{
    "original": {
        "text": "How eager Lady Carbury was that her son should at once go in form to Marie's father and make his proposition may be easily understood. \"My dear Felix,\" she said, standing over his bedside a little before noon, \"pray don't put it off; you don't know how many slips there may be between the cup and the lip.\"\n\"It's everything to get him in a good humour,\" pleaded Sir Felix.\n\"But the young lady will feel that she is ill-used.\"\n\"There's no fear of that; she's all right. What am I to say to him about money? That's the question.\"\n\"I shouldn't think of dictating anything, Felix.\"\n\"Nidderdale, when he was on before, stipulated for a certain sum down; or his father did for him. So much cash was to be paid over before the ceremony, and it only went off because Nidderdale wanted the money to do what he liked with.\"\n\"You wouldn't mind having it settled?\"\n\"No;--I'd consent to that on condition that the money was paid down, and the income insured to me,--say 7,000 or 8,000 a year. I wouldn't do it for less, mother; it wouldn't be worth while.\"\n\"But you have nothing left of your own.\"\n\"I've got a throat that I can cut, and brains that I can blow out,\" said the son, using an argument which he conceived might be efficacious with his mother; though, had she known him, she might have been sure that no man lived less likely to cut his own throat or blow out his own brains.\n\"Oh, Felix! how brutal it is to speak to me in that way.\"\n\"It may be brutal; but you know, mother, business is business. You want me to marry this girl because of her money.\"\n\"You want to marry her yourself.\"\n\"I'm quite a philosopher about it. I want her money; and when one wants money, one should make up one's mind how much or how little one means to take,--and whether one is sure to get it.\"\n\"I don't think there can be any doubt.\"\n\"If I were to marry her, and if the money wasn't there, it would be very like cutting my throat then, mother. If a man plays and loses, he can play again and perhaps win; but when a fellow goes in for an heiress, and gets the wife without the money, he feels a little hampered you know.\"\n\"Of course he'd pay the money first.\"\n\"It's very well to say that. Of course he ought; but it would be rather awkward to refuse to go into church after everything had been arranged because the money hadn't been paid over. He's so clever, that he'd contrive that a man shouldn't know whether the money had been paid or not. You can't carry 10,000 a year about in your pocket, you know. If you'll go, mother, perhaps I might think of getting up.\"\nLady Carbury saw the danger, and turned over the affair on every side in her own mind. But she could also see the house in Grosvenor Square, the expenditure without limit, the congregating duchesses, the general acceptation of the people, and the mercantile celebrity of the man. And she could weigh against that the absolute pennilessness of her baronet-son. As he was, his condition was hopeless. Such a one must surely run some risk. The embarrassments of such a man as Lord Nidderdale were only temporary. There were the family estates, and the marquisate, and a golden future for him; but there was nothing coming to Felix in the future. All the goods he would ever have of his own, he had now;--position, a title, and a handsome face. Surely he could afford to risk something! Even the ruins and wreck of such wealth as that displayed in Grosvenor Square would be better than the baronet's present condition. And then, though it was possible that old Melmotte should be ruined some day, there could be no doubt as to his present means; and would it not be probable that he would make hay while the sun shone by securing his daughter's position? She visited her son again on the next morning, which was Sunday, and again tried to persuade him to the marriage. \"I think you should be content to run a little risk,\" she said.\nSir Felix had been unlucky at cards on Saturday night, and had taken, perhaps, a little too much wine. He was at any rate sulky, and in a humour to resent interference. \"I wish you'd leave me alone,\" he said, \"to manage my own business.\"\n\"Is it not my business too?\"\n\"No; you haven't got to marry her, and to put up with these people. I shall make up my mind what to do myself, and I don't want anybody to meddle with me.\"\n\"You ungrateful boy!\"\n\"I understand all about that. Of course I'm ungrateful when I don't do everything just as you wish it. You don't do any good. You only set me against it all.\"\n\"How do you expect to live, then? Are you always to be a burden on me and your sister? I wonder that you've no shame. Your cousin Roger is right. I will quit London altogether, and leave you to your own wretchedness.\"\n\"That's what Roger says; is it? I always thought Roger was a fellow of that sort.\"\n\"He is the best friend I have.\" What would Roger have thought had he heard this assertion from Lady Carbury?\n\"He's an ill-tempered, close-fisted, interfering cad, and if he meddles with my affairs again, I shall tell him what I think of him. Upon my word, mother, these little disputes up in my bedroom ain't very pleasant. Of course it's your house; but if you do allow me a room, I think you might let me have it to myself.\" It was impossible for Lady Carbury, in her present mood, and in his present mood, to explain to him that in no other way and at no other time could she ever find him. If she waited till he came down to breakfast, he escaped from her in five minutes, and then he returned no more till some unholy hour in the morning. She was as good a pelican as ever allowed the blood to be torn from her own breast to satisfy the greed of her young, but she felt that she should have something back for her blood,--some return for her sacrifices. This chick would take all as long as there was a drop left, and then resent the fondling of the mother-bird as interference. Again and again there came upon her moments in which she thought that Roger Carbury was right. And yet she knew that when the time came she would not be able to be severe. She almost hated herself for the weakness of her own love,--but she acknowledged it. If he should fall utterly, she must fall with him. In spite of his cruelty, his callous hardness, his insolence to herself, his wickedness and ruinous indifference to the future, she must cling to him to the last. All that she had done, and all that she had borne,--all that she was doing and bearing,--was it not for his sake?\nSir Felix had been in Grosvenor Square since his return from Carbury, and had seen Madame Melmotte and Marie; but he had seen them together, and not a word had been said about the engagement. He could not make much use of the elder woman. She was as gracious as was usual with her; but then she was never very gracious. She had told him that Miss Longestaffe was coming to her, which was a great bore, as the young lady was \"fatigante.\" Upon this Marie had declared that she intended to like the young lady very much. \"Pooh!\" said Madame Melmotte. \"You never like no person at all.\" At this Marie had looked over to her lover and smiled. \"Ah, yes; that is all very well,--while it lasts; but you care for no friend.\" From which Felix had judged that Madame Melmotte at any rate knew of his offer, and did not absolutely disapprove of it. On the Saturday he had received a note at his club from Marie. \"Come on Sunday at half-past two. You will find papa after lunch.\" This was in his possession when his mother visited him in his bedroom, and he had determined to obey the behest. But he would not tell her of his intention, because he had drunk too much wine, and was sulky.\nAt about three on Sunday he knocked at the door in Grosvenor Square and asked for the ladies. Up to the moment of his knocking,--even after he had knocked, and when the big porter was opening the door,--he intended to ask for Mr. Melmotte; but at the last his courage failed him, and he was shown up into the drawing-room. There he found Madame Melmotte, Marie, Georgiana Longestaffe, and--Lord Nidderdale. Marie looked anxiously into his face, thinking that he had already been with her father. He slid into a chair close to Madame Melmotte, and endeavoured to seem at his ease. Lord Nidderdale continued his flirtation with Miss Longestaffe,--a flirtation which she carried on in a half whisper, wholly indifferent to her hostess or the young lady of the house. \"We know what brings you here,\" she said.\n\"I came on purpose to see you.\"\n\"I'm sure, Lord Nidderdale, you didn't expect to find me here.\"\n\"Lord bless you, I knew all about it, and came on purpose. It's a great institution; isn't it?\"\n\"It's an institution you mean to belong to,--permanently.\"\n\"No, indeed. I did have thoughts about it as fellows do when they talk of going into the army or to the bar; but I couldn't pass. That fellow there is the happy man. I shall go on coming here, because you're here. I don't think you'll like it a bit, you know.\"\n\"I don't suppose I shall, Lord Nidderdale.\"\nAfter a while Marie contrived to be alone with her lover near one of the windows for a few seconds. \"Papa is down-stairs in the book-room,\" she said. \"Lord Alfred was told when he came that he was out.\" It was evident to Sir Felix that everything was prepared for him. \"You go down,\" she continued, \"and ask the man to show you into the book-room.\"\n\"Shall I come up again?\"\n\"No; but leave a note for me here under cover to Madame Didon.\" Now Sir Felix was sufficiently at home in the house to know that Madame Didon was Madame Melmotte's own woman, commonly called Didon by the ladies of the family. \"Or send it by post,--under cover to her. That will be better. Go at once, now.\" It certainly did seem to Sir Felix that the very nature of the girl was altered. But he went, just shaking hands with Madame Melmotte, and bowing to Miss Longestaffe.\nIn a few moments he found himself with Mr. Melmotte in the chamber which had been dignified with the name of the book-room. The great financier was accustomed to spend his Sunday afternoons here, generally with the company of Lord Alfred Grendall. It may be supposed that he was meditating on millions, and arranging the prices of money and funds for the New York, Paris, and London Exchanges. But on this occasion he was waked from slumber, which he seemed to have been enjoying with a cigar in his mouth. \"How do you do, Sir Felix?\" he said. \"I suppose you want the ladies.\"\n\"I've just been in the drawing-room, but I thought I'd look in on you as I came down.\" It immediately occurred to Melmotte that the baronet had come about his share of the plunder out of the railway, and he at once resolved to be stern in his manner, and perhaps rude also. He believed that he should thrive best by resenting any interference with him in his capacity as financier. He thought that he had risen high enough to venture on such conduct, and experience had told him that men who were themselves only half-plucked, might easily be cowed by a savage assumption of superiority. And he, too, had generally the advantage of understanding the game, while those with whom he was concerned did not, at any rate, more than half understand it. He could thus trade either on the timidity or on the ignorance of his colleagues. When neither of these sufficed to give him undisputed mastery, then he cultivated the cupidity of his friends. He liked young associates because they were more timid and less greedy than their elders. Lord Nidderdale's suggestions had soon been put at rest, and Mr. Melmotte anticipated no greater difficulty with Sir Felix. Lord Alfred he had been obliged to buy.\n\"I'm very glad to see you, and all that,\" said Melmotte, assuming a certain exaltation of the eyebrows, which they who had many dealings with him often found to be very disagreeable; \"but this is hardly a day for business, Sir Felix, nor,--yet a place for business.\"\nSir Felix wished himself at the Beargarden. He certainly had come about business,--business of a particular sort; but Marie had told him that of all days Sunday would be the best, and had also told him that her father was more likely to be in a good humour on Sunday than on any other day. Sir Felix felt that he had not been received with good humour. \"I didn't mean to intrude, Mr. Melmotte,\" he said.\n\"I dare say not. I only thought I'd tell you. You might have been going to speak about that railway.\"\n\"Oh dear no.\"\n\"Your mother was saying to me down in the country that she hoped you attended to the business. I told her that there was nothing to attend to.\"\n\"My mother doesn't understand anything at all about it,\" said Sir Felix.\n\"Women never do. Well;--what can I do for you, now that you are here?\"\n\"Mr. Melmotte, I'm come,--I'm come to;--in short, Mr. Melmotte, I want to propose myself as a suitor for your daughter's hand.\"\n\"The d---- you do!\"\n\"Well, yes; and we hope you'll give us your consent.\"\n\"She knows you're coming then?\"\n\"Yes;--she knows.\"\n\"And my wife;--does she know?\"\n\"I've never spoken to her about it. Perhaps Miss Melmotte has.\"\n\"And how long have you and she understood each other?\"\n\"I've been attached to her ever since I saw her,\" said Sir Felix. \"I have indeed. I've spoken to her sometimes. You know how that kind of thing goes on.\"\n\"I'm blessed if I do. I know how it ought to go on. I know that when large sums of money are supposed to be concerned, the young man should speak to the father before he speaks to the girl. He's a fool if he don't, if he wants to get the father's money. So she has given you a promise?\"\n\"I don't know about a promise.\"\n\"Do you consider that she's engaged to you?\"\n\"Not if she's disposed to get out of it,\" said Sir Felix, hoping that he might thus ingratiate himself with the father. \"Of course, I should be awfully disappointed.\"\n\"She has consented to your coming to me?\"\n\"Well, yes;--in a sort of a way. Of course she knows that it all depends on you.\"\n\"Not at all. She's of age. If she chooses to marry you, she can marry you. If that's all you want, her consent is enough. You're a baronet, I believe?\"\n\"Oh, yes, I'm a baronet.\"\n\"And therefore you've come to your own property. You haven't to wait for your father to die, and I dare say you are indifferent about money.\"\nThis was a view of things which Sir Felix felt that he was bound to dispel, even at the risk of offending the father. \"Not exactly that,\" he said. \"I suppose you will give your daughter a fortune, of course.\"\n\"Then I wonder you didn't come to me before you went to her. If my daughter marries to please me, I shall give her money, no doubt. How much is neither here nor there. If she marries to please herself, without considering me, I shan't give her a farthing.\"\n\"I had hoped that you might consent, Mr. Melmotte.\"\n\"I've said nothing about that. It is possible. You're a man of fashion and have a title of your own,--and no doubt a property. If you'll show me that you've an income fit to maintain her, I'll think about it at any rate. What is your property, Sir Felix?\"\nWhat could three or four thousand a year, or even five or six, matter to a man like Melmotte? It was thus that Sir Felix looked at it. When a man can hardly count his millions he ought not to ask questions about trifling sums of money. But the question had been asked, and the asking of such a question was no doubt within the prerogative of a proposed father-in-law. At any rate, it must be answered. For a moment it occurred to Sir Felix that he might conveniently tell the truth. It would be nasty for the moment, but there would be nothing to come after. Were he to do so he could not be dragged down lower and lower into the mire by cross-examinings. There might be an end of all his hopes, but there would at the same time be an end of all his misery. But he lacked the necessary courage. \"It isn't a large property, you know,\" he said.\n\"Not like the Marquis of Westminster's, I suppose,\" said the horrid, big, rich scoundrel.\n\"No;--not quite like that,\" said Sir Felix, with a sickly laugh.\n\"But you have got enough to support a baronet's title?\"\n\"That depends on how you want to support it,\" said Sir Felix, putting off the evil day.\n\"Where's your family seat?\"\n\"Carbury Manor, down in Suffolk, near the Longestaffes, is the old family place.\"\n\"That doesn't belong to you,\" said Melmotte, very sharply.\n\"No; not yet. But I'm the heir.\"\nPerhaps if there is one thing in England more difficult than another to be understood by men born and bred out of England, it is the system under which titles and property descend together, or in various lines. The jurisdiction of our Courts of Law is complex, and so is the business of Parliament. But the rules regulating them, though anomalous, are easy to the memory compared with the mixed anomalies of the peerage and primogeniture. They who are brought up among it, learn it as children do a language, but strangers who begin the study in advanced life, seldom make themselves perfect in it. It was everything to Melmotte that he should understand the ways of the country which he had adopted; and when he did not understand, he was clever at hiding his ignorance. Now he was puzzled. He knew that Sir Felix was a baronet, and therefore presumed him to be the head of the family. He knew that Carbury Manor belonged to Roger Carbury, and he judged by the name it must be an old family property. And now the baronet declared that he was heir to the man who was simply an Esquire. \"Oh, the heir are you? But how did he get it before you? You're the head of the family?\"\n\"Yes, I am the head of the family, of course,\" said Sir Felix, lying directly. \"But the place won't be mine till he dies. It would take a long time to explain it all.\"\n\"He's a young man, isn't he?\"\n\"No,--not what you'd call a young man. He isn't very old.\"\n\"If he were to marry and have children, how would it be then?\"\nSir Felix was beginning to think that he might have told the truth with discretion. \"I don't quite know how it would be. I have always understood that I am the heir. It's not very likely that he will marry.\"\n\"And in the meantime what is your own property?\"\n[Illustration: \"In the meantime what is your own property?\"]\n\"My father left me money in the funds and in railway stock,--and then I am my mother's heir.\"\n\"You have done me the honour of telling me that you wish to marry my daughter.\"\n\"Certainly.\"\n\"Would you then object to inform me the amount and nature of the income on which you intend to support your establishment as a married man? I fancy that the position you assume justifies the question on my part.\" The bloated swindler, the vile city ruffian, was certainly taking a most ungenerous advantage of the young aspirant for wealth. It was then that Sir Felix felt his own position. Was he not a baronet, and a gentleman, and a very handsome fellow, and a man of the world who had been in a crack regiment? If this surfeited sponge of speculation, this crammed commercial cormorant, wanted more than that for his daughter, why could he not say so without asking disgusting questions such as these,--questions which it was quite impossible that a gentleman should answer? Was it not sufficiently plain that any gentleman proposing to marry the daughter of such a man as Melmotte, must do so under the stress of pecuniary embarrassment? Would it not be an understood bargain that as he provided the rank and position, she would provide the money? And yet the vulgar wretch took advantage of his assumed authority to ask these dreadful questions! Sir Felix stood silent, trying to look the man in the face, but failing;--wishing that he was well out of the house, and at the Beargarden. \"You don't seem to be very clear about your own circumstances, Sir Felix. Perhaps you will get your lawyer to write to me.\"\n\"Perhaps that will be best,\" said the lover.\n\"Either that, or to give it up. My daughter, no doubt, will have money; but money expects money.\" At this moment Lord Alfred entered the room. \"You're very late to-day, Alfred. Why didn't you come as you said you would?\"\n\"I was here more than an hour ago, and they said you were out.\"\n\"I haven't been out of this room all day,--except to lunch. Good morning, Sir Felix. Ring the bell, Alfred, and we'll have a little soda and brandy.\" Sir Felix had gone through some greeting with his fellow Director, Lord Alfred, and at last succeeded in getting Melmotte to shake hands with him before he went. \"Do you know anything about that young fellow?\" Melmotte asked as soon as the door was closed.\n\"He's a baronet without a shilling;--was in the army and had to leave it,\" said Lord Alfred as he buried his face in a big tumbler.\n\"Without a shilling! I supposed so. But he's heir to a place down in Suffolk;--eh?\"\n\"Not a bit of it. It's the same name, and that's about all. Mr. Carbury has a small property there, and he might give it to me to-morrow. I wish he would, though there isn't much of it. That young fellow has nothing to do with it whatever.\"\n\"Hasn't he now?\" Mr. Melmotte as he speculated upon it, almost admired the young man's impudence.",
        "paragraph_chars": [
            [
                0,
                307
            ],
            [
                307,
                373
            ],
            [
                373,
                426
            ],
            [
                426,
                528
            ],
            [
                528,
                578
            ],
            [
                578,
                814
            ],
            [
                814,
                853
            ],
            [
                853,
                1044
            ],
            [
                1044,
                1085
            ],
            [
                1085,
                1374
            ],
            [
                1374,
                1432
            ],
            [
                1432,
                1549
            ],
            [
                1549,
                1583
            ],
            [
                1583,
                1771
            ],
            [
                1771,
                1811
            ],
            [
                1811,
                2099
            ],
            [
                2099,
                2137
            ],
            [
                2137,
                2544
            ],
            [
                2544,
                3873
            ],
            [
                3873,
                4111
            ],
            [
                4111,
                4140
            ],
            [
                4140,
                4296
            ],
            [
                4296,
                4318
            ],
            [
                4318,
                4477
            ],
            [
                4477,
                4695
            ],
            [
                4695,
                4778
            ],
            [
                4778,
                4887
            ],
            [
                4887,
                6447
            ],
            [
                6447,
                7623
            ],
            [
                7623,
                8429
            ],
            [
                8429,
                8461
            ],
            [
                8461,
                8525
            ],
            [
                8525,
                8621
            ],
            [
                8621,
                8680
            ],
            [
                8680,
                8941
            ],
            [
                8941,
                8985
            ],
            [
                8985,
                9334
            ],
            [
                9334,
                9359
            ],
            [
                9359,
                9833
            ],
            [
                9833,
                10410
            ],
            [
                10410,
                11604
            ],
            [
                11604,
                11871
            ],
            [
                11871,
                12275
            ],
            [
                12275,
                12377
            ],
            [
                12377,
                12391
            ],
            [
                12391,
                12535
            ],
            [
                12535,
                12608
            ],
            [
                12608,
                12679
            ],
            [
                12679,
                12807
            ],
            [
                12807,
                12827
            ],
            [
                12827,
                12881
            ],
            [
                12881,
                12913
            ],
            [
                12913,
                12932
            ],
            [
                12932,
                12963
            ],
            [
                12963,
                13027
            ],
            [
                13027,
                13082
            ],
            [
                13082,
                13236
            ],
            [
                13236,
                13523
            ],
            [
                13523,
                13555
            ],
            [
                13555,
                13600
            ],
            [
                13600,
                13767
            ],
            [
                13767,
                13809
            ],
            [
                13809,
                13891
            ],
            [
                13891,
                14043
            ],
            [
                14043,
                14069
            ],
            [
                14069,
                14211
            ],
            [
                14211,
                14420
            ],
            [
                14420,
                14677
            ],
            [
                14677,
                14729
            ],
            [
                14729,
                14985
            ],
            [
                14985,
                15828
            ],
            [
                15828,
                15918
            ],
            [
                15918,
                15983
            ],
            [
                15983,
                16039
            ],
            [
                16039,
                16127
            ],
            [
                16127,
                16155
            ],
            [
                16155,
                16237
            ],
            [
                16237,
                16296
            ],
            [
                16296,
                16329
            ],
            [
                16329,
                17504
            ],
            [
                17504,
                17672
            ],
            [
                17672,
                17702
            ],
            [
                17702,
                17761
            ],
            [
                17761,
                17824
            ],
            [
                17824,
                18032
            ],
            [
                18032,
                18081
            ],
            [
                18081,
                18142
            ],
            [
                18142,
                18236
            ],
            [
                18236,
                18316
            ],
            [
                18316,
                18329
            ],
            [
                18329,
                19745
            ],
            [
                19745,
                19790
            ],
            [
                19790,
                20011
            ],
            [
                20011,
                20075
            ],
            [
                20075,
                20482
            ],
            [
                20482,
                20614
            ],
            [
                20614,
                20698
            ],
            [
                20698,
                20939
            ],
            [
                20939,
                21036
            ]
        ],
        "segment_chars": [
            [
                0,
                135
            ],
            [
                135,
                307
            ],
            [
                307,
                373
            ],
            [
                373,
                426
            ],
            [
                426,
                469
            ],
            [
                469,
                506
            ],
            [
                506,
                528
            ],
            [
                528,
                578
            ],
            [
                578,
                676
            ],
            [
                676,
                814
            ],
            [
                814,
                853
            ],
            [
                853,
                980
            ],
            [
                980,
                1044
            ],
            [
                1044,
                1085
            ],
            [
                1085,
                1374
            ],
            [
                1374,
                1386
            ],
            [
                1386,
                1432
            ],
            [
                1432,
                1495
            ],
            [
                1495,
                1549
            ],
            [
                1549,
                1583
            ],
            [
                1583,
                1618
            ],
            [
                1618,
                1771
            ],
            [
                1771,
                1811
            ],
            [
                1811,
                1921
            ],
            [
                1921,
                2099
            ],
            [
                2099,
                2137
            ],
            [
                2137,
                2166
            ],
            [
                2166,
                2321
            ],
            [
                2321,
                2422
            ],
            [
                2422,
                2484
            ],
            [
                2484,
                2544
            ],
            [
                2544,
                2631
            ],
            [
                2631,
                2824
            ],
            [
                2824,
                2904
            ],
            [
                2904,
                2943
            ],
            [
                2943,
                2981
            ],
            [
                2981,
                3054
            ],
            [
                3054,
                3187
            ],
            [
                3187,
                3285
            ],
            [
                3285,
                3327
            ],
            [
                3327,
                3459
            ],
            [
                3459,
                3695
            ],
            [
                3695,
                3809
            ],
            [
                3809,
                3873
            ],
            [
                3873,
                3976
            ],
            [
                3976,
                4042
            ],
            [
                4042,
                4111
            ],
            [
                4111,
                4140
            ],
            [
                4140,
                4208
            ],
            [
                4208,
                4296
            ],
            [
                4296,
                4318
            ],
            [
                4318,
                4348
            ],
            [
                4348,
                4421
            ],
            [
                4421,
                4444
            ],
            [
                4444,
                4477
            ],
            [
                4477,
                4511
            ],
            [
                4511,
                4564
            ],
            [
                4564,
                4595
            ],
            [
                4595,
                4623
            ],
            [
                4623,
                4695
            ],
            [
                4695,
                4727
            ],
            [
                4727,
                4778
            ],
            [
                4778,
                4810
            ],
            [
                4810,
                4887
            ],
            [
                4887,
                5020
            ],
            [
                5020,
                5102
            ],
            [
                5102,
                5205
            ],
            [
                5205,
                5372
            ],
            [
                5372,
                5522
            ],
            [
                5522,
                5737
            ],
            [
                5737,
                5862
            ],
            [
                5862,
                5957
            ],
            [
                5957,
                6034
            ],
            [
                6034,
                6119
            ],
            [
                6119,
                6170
            ],
            [
                6170,
                6333
            ],
            [
                6333,
                6447
            ],
            [
                6447,
                6639
            ],
            [
                6639,
                6686
            ],
            [
                6686,
                6767
            ],
            [
                6767,
                6884
            ],
            [
                6884,
                6965
            ],
            [
                6965,
                6973
            ],
            [
                6973,
                6995
            ],
            [
                6995,
                7030
            ],
            [
                7030,
                7085
            ],
            [
                7085,
                7164
            ],
            [
                7164,
                7285
            ],
            [
                7285,
                7348
            ],
            [
                7348,
                7382
            ],
            [
                7382,
                7415
            ],
            [
                7415,
                7528
            ],
            [
                7528,
                7623
            ],
            [
                7623,
                7717
            ],
            [
                7717,
                7946
            ],
            [
                7946,
                8030
            ],
            [
                8030,
                8119
            ],
            [
                8119,
                8203
            ],
            [
                8203,
                8387
            ],
            [
                8387,
                8429
            ],
            [
                8429,
                8461
            ],
            [
                8461,
                8525
            ],
            [
                8525,
                8584
            ],
            [
                8584,
                8621
            ],
            [
                8621,
                8680
            ],
            [
                8680,
                8693
            ],
            [
                8693,
                8810
            ],
            [
                8810,
                8846
            ],
            [
                8846,
                8894
            ],
            [
                8894,
                8941
            ],
            [
                8941,
                8985
            ],
            [
                8985,
                9085
            ],
            [
                9085,
                9135
            ],
            [
                9135,
                9188
            ],
            [
                9188,
                9254
            ],
            [
                9254,
                9334
            ],
            [
                9334,
                9359
            ],
            [
                9359,
                9423
            ],
            [
                9423,
                9585
            ],
            [
                9585,
                9627
            ],
            [
                9627,
                9648
            ],
            [
                9648,
                9666
            ],
            [
                9666,
                9747
            ],
            [
                9747,
                9833
            ],
            [
                9833,
                9957
            ],
            [
                9957,
                10081
            ],
            [
                10081,
                10227
            ],
            [
                10227,
                10340
            ],
            [
                10340,
                10368
            ],
            [
                10368,
                10377
            ],
            [
                10377,
                10410
            ],
            [
                10410,
                10497
            ],
            [
                10497,
                10684
            ],
            [
                10684,
                10792
            ],
            [
                10792,
                10998
            ],
            [
                10998,
                11157
            ],
            [
                11157,
                11239
            ],
            [
                11239,
                11350
            ],
            [
                11350,
                11440
            ],
            [
                11440,
                11564
            ],
            [
                11564,
                11604
            ],
            [
                11604,
                11871
            ],
            [
                11871,
                11915
            ],
            [
                11915,
                12161
            ],
            [
                12161,
                12224
            ],
            [
                12224,
                12275
            ],
            [
                12275,
                12292
            ],
            [
                12292,
                12321
            ],
            [
                12321,
                12377
            ],
            [
                12377,
                12391
            ],
            [
                12391,
                12486
            ],
            [
                12486,
                12535
            ],
            [
                12535,
                12608
            ],
            [
                12608,
                12625
            ],
            [
                12625,
                12679
            ],
            [
                12679,
                12807
            ],
            [
                12807,
                12827
            ],
            [
                12827,
                12881
            ],
            [
                12881,
                12913
            ],
            [
                12913,
                12932
            ],
            [
                12932,
                12963
            ],
            [
                12963,
                12999
            ],
            [
                12999,
                13027
            ],
            [
                13027,
                13082
            ],
            [
                13082,
                13148
            ],
            [
                13148,
                13164
            ],
            [
                13164,
                13194
            ],
            [
                13194,
                13236
            ],
            [
                13236,
                13258
            ],
            [
                13258,
                13288
            ],
            [
                13288,
                13426
            ],
            [
                13426,
                13490
            ],
            [
                13490,
                13523
            ],
            [
                13523,
                13555
            ],
            [
                13555,
                13600
            ],
            [
                13600,
                13720
            ],
            [
                13720,
                13767
            ],
            [
                13767,
                13809
            ],
            [
                13809,
                13842
            ],
            [
                13842,
                13891
            ],
            [
                13891,
                13904
            ],
            [
                13904,
                13918
            ],
            [
                13918,
                13966
            ],
            [
                13966,
                14013
            ],
            [
                14013,
                14043
            ],
            [
                14043,
                14069
            ],
            [
                14069,
                14118
            ],
            [
                14118,
                14211
            ],
            [
                14211,
                14329
            ],
            [
                14329,
                14358
            ],
            [
                14358,
                14420
            ],
            [
                14420,
                14481
            ],
            [
                14481,
                14552
            ],
            [
                14552,
                14588
            ],
            [
                14588,
                14677
            ],
            [
                14677,
                14729
            ],
            [
                14729,
                14760
            ],
            [
                14760,
                14776
            ],
            [
                14776,
                14856
            ],
            [
                14856,
                14950
            ],
            [
                14950,
                14985
            ],
            [
                14985,
                15079
            ],
            [
                15079,
                15120
            ],
            [
                15120,
                15221
            ],
            [
                15221,
                15353
            ],
            [
                15353,
                15387
            ],
            [
                15387,
                15468
            ],
            [
                15468,
                15544
            ],
            [
                15544,
                15641
            ],
            [
                15641,
                15743
            ],
            [
                15743,
                15780
            ],
            [
                15780,
                15828
            ],
            [
                15828,
                15918
            ],
            [
                15918,
                15983
            ],
            [
                15983,
                16039
            ],
            [
                16039,
                16127
            ],
            [
                16127,
                16155
            ],
            [
                16155,
                16237
            ],
            [
                16237,
                16296
            ],
            [
                16296,
                16310
            ],
            [
                16310,
                16329
            ],
            [
                16329,
                16540
            ],
            [
                16540,
                16628
            ],
            [
                16628,
                16768
            ],
            [
                16768,
                16928
            ],
            [
                16928,
                17101
            ],
            [
                17101,
                17121
            ],
            [
                17121,
                17216
            ],
            [
                17216,
                17331
            ],
            [
                17331,
                17415
            ],
            [
                17415,
                17438
            ],
            [
                17438,
                17472
            ],
            [
                17472,
                17504
            ],
            [
                17504,
                17583
            ],
            [
                17583,
                17626
            ],
            [
                17626,
                17672
            ],
            [
                17672,
                17702
            ],
            [
                17702,
                17741
            ],
            [
                17741,
                17761
            ],
            [
                17761,
                17824
            ],
            [
                17824,
                17908
            ],
            [
                17908,
                17945
            ],
            [
                17945,
                17990
            ],
            [
                17990,
                18032
            ],
            [
                18032,
                18081
            ],
            [
                18081,
                18142
            ],
            [
                18142,
                18236
            ],
            [
                18236,
                18316
            ],
            [
                18316,
                18329
            ],
            [
                18329,
                18469
            ],
            [
                18469,
                18542
            ],
            [
                18542,
                18670
            ],
            [
                18670,
                18720
            ],
            [
                18720,
                18844
            ],
            [
                18844,
                19108
            ],
            [
                19108,
                19272
            ],
            [
                19272,
                19382
            ],
            [
                19382,
                19481
            ],
            [
                19481,
                19621
            ],
            [
                19621,
                19695
            ],
            [
                19695,
                19745
            ],
            [
                19745,
                19790
            ],
            [
                19790,
                19822
            ],
            [
                19822,
                19888
            ],
            [
                19888,
                19933
            ],
            [
                19933,
                19967
            ],
            [
                19967,
                20011
            ],
            [
                20011,
                20075
            ],
            [
                20075,
                20135
            ],
            [
                20135,
                20160
            ],
            [
                20160,
                20225
            ],
            [
                20225,
                20387
            ],
            [
                20387,
                20435
            ],
            [
                20435,
                20482
            ],
            [
                20482,
                20614
            ],
            [
                20614,
                20635
            ],
            [
                20635,
                20650
            ],
            [
                20650,
                20698
            ],
            [
                20698,
                20716
            ],
            [
                20716,
                20758
            ],
            [
                20758,
                20836
            ],
            [
                20836,
                20884
            ],
            [
                20884,
                20939
            ],
            [
                20939,
                20956
            ],
            [
                20956,
                21036
            ]
        ],
        "overlap_chars": [
            [
                15,
                26
            ],
            [
                4,
                9
            ],
            [
                27,
                46
            ],
            [
                55,
                57
            ],
            [
                47,
                54
            ],
            [
                66,
                83
            ],
            [
                133,
                135
            ],
            [
                135,
                187
            ],
            [
                197,
                232
            ],
            [
                304,
                307
            ],
            [
                307,
                308
            ],
            [
                324,
                373
            ],
            [
                373,
                426
            ],
            [
                426,
                469
            ],
            [
                469,
                506
            ],
            [
                506,
                525
            ],
            [
                579,
                589
            ],
            [
                625,
                647
            ],
            [
                589,
                590
            ],
            [
                693,
                703
            ],
            [
                709,
                814
            ],
            [
                814,
                853
            ],
            [
                853,
                857
            ],
            [
                859,
                878
            ],
            [
                897,
                950
            ],
            [
                953,
                980
            ],
            [
                1015,
                1041
            ],
            [
                997,
                1005
            ],
            [
                1041,
                1044
            ],
            [
                1044,
                1085
            ],
            [
                1085,
                1193
            ],
            [
                1204,
                1212
            ],
            [
                1225,
                1248
            ],
            [
                1299,
                1345
            ],
            [
                1372,
                1374
            ],
            [
                1374,
                1386
            ],
            [
                1386,
                1396
            ],
            [
                1429,
                1432
            ],
            [
                1432,
                1495
            ],
            [
                1495,
                1549
            ],
            [
                1549,
                1583
            ],
            [
                1771,
                1772
            ],
            [
                1618,
                1639
            ],
            [
                1812,
                1878
            ],
            [
                1884,
                1906
            ],
            [
                1919,
                1921
            ],
            [
                2096,
                2099
            ],
            [
                2099,
                2137
            ],
            [
                2166,
                2244
            ],
            [
                2280,
                2321
            ],
            [
                2321,
                2422
            ],
            [
                2484,
                2505
            ],
            [
                2514,
                2544
            ],
            [
                2544,
                2599
            ],
            [
                2614,
                2631
            ],
            [
                2631,
                2688
            ],
            [
                2824,
                2827
            ],
            [
                2802,
                2822
            ],
            [
                2781,
                2786
            ],
            [
                2838,
                2843
            ],
            [
                2852,
                2856
            ],
            [
                2844,
                2851
            ],
            [
                2857,
                2890
            ],
            [
                2899,
                2904
            ],
            [
                2919,
                2943
            ],
            [
                3017,
                3032
            ],
            [
                2985,
                2999
            ],
            [
                3033,
                3054
            ],
            [
                3054,
                3083
            ],
            [
                3103,
                3171
            ],
            [
                3185,
                3187
            ],
            [
                3187,
                3190
            ],
            [
                3201,
                3219
            ],
            [
                3230,
                3243
            ],
            [
                3245,
                3285
            ],
            [
                3327,
                3341
            ],
            [
                3352,
                3425
            ],
            [
                3440,
                3459
            ],
            [
                3459,
                3462
            ],
            [
                3469,
                3560
            ],
            [
                3567,
                3570
            ],
            [
                3695,
                3720
            ],
            [
                3724,
                3809
            ],
            [
                3809,
                3873
            ],
            [
                3873,
                3931
            ],
            [
                3979,
                3982
            ],
            [
                3995,
                4000
            ],
            [
                3974,
                3975
            ],
            [
                4042,
                4111
            ],
            [
                4111,
                4140
            ],
            [
                4140,
                4208
            ],
            [
                4208,
                4242
            ],
            [
                4249,
                4285
            ],
            [
                4293,
                4296
            ],
            [
                4296,
                4315
            ],
            [
                4511,
                4564
            ],
            [
                4578,
                4581
            ],
            [
                4585,
                4595
            ],
            [
                4595,
                4623
            ],
            [
                4623,
                4695
            ],
            [
                4695,
                4718
            ],
            [
                4720,
                4725
            ],
            [
                4778,
                4809
            ],
            [
                4887,
                5020
            ],
            [
                5020,
                5040
            ],
            [
                5158,
                5189
            ],
            [
                5070,
                5072
            ],
            [
                5154,
                5158
            ],
            [
                5193,
                5205
            ],
            [
                5205,
                5243
            ],
            [
                5269,
                5297
            ],
            [
                5305,
                5309
            ],
            [
                5322,
                5325
            ],
            [
                5353,
                5356
            ],
            [
                5347,
                5352
            ],
            [
                5357,
                5372
            ],
            [
                5372,
                5428
            ],
            [
                5438,
                5458
            ],
            [
                5484,
                5493
            ],
            [
                5501,
                5521
            ],
            [
                5862,
                5955
            ],
            [
                5955,
                5957
            ],
            [
                6034,
                6082
            ],
            [
                6087,
                6091
            ],
            [
                6094,
                6119
            ],
            [
                6119,
                6136
            ],
            [
                6144,
                6170
            ],
            [
                6170,
                6230
            ],
            [
                6258,
                6333
            ],
            [
                6333,
                6354
            ],
            [
                6356,
                6359
            ],
            [
                6377,
                6382
            ],
            [
                6422,
                6447
            ],
            [
                6447,
                6485
            ],
            [
                6515,
                6560
            ],
            [
                6592,
                6639
            ],
            [
                6771,
                6816
            ],
            [
                6823,
                6847
            ],
            [
                6884,
                6964
            ],
            [
                6965,
                6973
            ],
            [
                6973,
                6995
            ],
            [
                6995,
                7030
            ],
            [
                7030,
                7085
            ],
            [
                7085,
                7117
            ],
            [
                7119,
                7164
            ],
            [
                7164,
                7212
            ],
            [
                7225,
                7277
            ],
            [
                7283,
                7284
            ],
            [
                7285,
                7287
            ],
            [
                7292,
                7348
            ],
            [
                7348,
                7382
            ],
            [
                7382,
                7415
            ],
            [
                7528,
                7534
            ],
            [
                7541,
                7549
            ],
            [
                7554,
                7570
            ],
            [
                7621,
                7623
            ],
            [
                7623,
                7717
            ],
            [
                7826,
                7866
            ],
            [
                7879,
                7944
            ],
            [
                7749,
                7750
            ],
            [
                7952,
                8011
            ],
            [
                8013,
                8029
            ],
            [
                8030,
                8119
            ],
            [
                8119,
                8169
            ],
            [
                8182,
                8203
            ],
            [
                8203,
                8265
            ],
            [
                8268,
                8354
            ],
            [
                8385,
                8386
            ],
            [
                8387,
                8418
            ],
            [
                8423,
                8427
            ],
            [
                8427,
                8429
            ],
            [
                8429,
                8436
            ],
            [
                8448,
                8461
            ],
            [
                8461,
                8525
            ],
            [
                8525,
                8584
            ],
            [
                8810,
                8846
            ],
            [
                8846,
                8894
            ],
            [
                8894,
                8922
            ],
            [
                8923,
                8941
            ],
            [
                8941,
                8985
            ],
            [
                8985,
                9065
            ],
            [
                9083,
                9085
            ],
            [
                9085,
                9093
            ],
            [
                9106,
                9135
            ],
            [
                9254,
                9255
            ],
            [
                9259,
                9266
            ],
            [
                9282,
                9283
            ],
            [
                9285,
                9334
            ],
            [
                9334,
                9359
            ],
            [
                9359,
                9387
            ],
            [
                9393,
                9423
            ],
            [
                9431,
                9436
            ],
            [
                9483,
                9522
            ],
            [
                9583,
                9585
            ],
            [
                9585,
                9588
            ],
            [
                9600,
                9604
            ],
            [
                9594,
                9596
            ],
            [
                9607,
                9627
            ],
            [
                9648,
                9665
            ],
            [
                9666,
                9668
            ],
            [
                9688,
                9747
            ],
            [
                9747,
                9759
            ],
            [
                9765,
                9833
            ],
            [
                9833,
                9884
            ],
            [
                9955,
                9957
            ],
            [
                9957,
                9976
            ],
            [
                10251,
                10339
            ],
            [
                10340,
                10368
            ],
            [
                10368,
                10377
            ],
            [
                10377,
                10410
            ],
            [
                10410,
                10496
            ],
            [
                10497,
                10616
            ],
            [
                10625,
                10645
            ],
            [
                10659,
                10677
            ],
            [
                10646,
                10648
            ],
            [
                10726,
                10739
            ],
            [
                10740,
                10752
            ],
            [
                10790,
                10792
            ],
            [
                10876,
                10893
            ],
            [
                10894,
                10897
            ],
            [
                10937,
                10998
            ],
            [
                10998,
                11004
            ],
            [
                11056,
                11065
            ],
            [
                11105,
                11112
            ],
            [
                11155,
                11157
            ],
            [
                11350,
                11440
            ],
            [
                11440,
                11564
            ],
            [
                11564,
                11604
            ],
            [
                11604,
                11660
            ],
            [
                11698,
                11706
            ],
            [
                11670,
                11671
            ],
            [
                11773,
                11785
            ],
            [
                11785,
                11825
            ],
            [
                11868,
                11871
            ],
            [
                11871,
                11915
            ],
            [
                12224,
                12275
            ],
            [
                12275,
                12292
            ],
            [
                12292,
                12321
            ],
            [
                12321,
                12377
            ],
            [
                12377,
                12391
            ],
            [
                12391,
                12486
            ],
            [
                12486,
                12535
            ],
            [
                12535,
                12573
            ],
            [
                12581,
                12608
            ],
            [
                12608,
                12625
            ],
            [
                12625,
                12630
            ],
            [
                12632,
                12653
            ],
            [
                12676,
                12679
            ],
            [
                12679,
                12702
            ],
            [
                12705,
                12716
            ],
            [
                12719,
                12807
            ],
            [
                12807,
                12813
            ],
            [
                12818,
                12827
            ],
            [
                12827,
                12881
            ],
            [
                12881,
                12913
            ],
            [
                12913,
                12917
            ],
            [
                12929,
                12932
            ],
            [
                12932,
                12944
            ],
            [
                12947,
                12963
            ],
            [
                12963,
                12999
            ],
            [
                12999,
                13027
            ],
            [
                13027,
                13057
            ],
            [
                13079,
                13082
            ],
            [
                13082,
                13148
            ],
            [
                13148,
                13164
            ],
            [
                13194,
                13236
            ],
            [
                13236,
                13258
            ],
            [
                13258,
                13288
            ],
            [
                13288,
                13299
            ],
            [
                13355,
                13426
            ],
            [
                13426,
                13490
            ],
            [
                13490,
                13523
            ],
            [
                13523,
                13555
            ],
            [
                13555,
                13600
            ],
            [
                13600,
                13720
            ],
            [
                13720,
                13767
            ],
            [
                13767,
                13809
            ],
            [
                13809,
                13819
            ],
            [
                13827,
                13834
            ],
            [
                13840,
                13842
            ],
            [
                13842,
                13891
            ],
            [
                13891,
                13904
            ],
            [
                13904,
                13918
            ],
            [
                13918,
                13966
            ],
            [
                13966,
                14013
            ],
            [
                14013,
                14043
            ],
            [
                14043,
                14069
            ],
            [
                14118,
                14211
            ],
            [
                14211,
                14285
            ],
            [
                14327,
                14329
            ],
            [
                14329,
                14341
            ],
            [
                14346,
                14358
            ],
            [
                14358,
                14420
            ],
            [
                14420,
                14481
            ],
            [
                14481,
                14540
            ],
            [
                14550,
                14552
            ],
            [
                14588,
                14677
            ],
            [
                14677,
                14729
            ],
            [
                14760,
                14776
            ],
            [
                14776,
                14816
            ],
            [
                14831,
                14856
            ],
            [
                14856,
                14950
            ],
            [
                14950,
                14985
            ],
            [
                15100,
                15105
            ],
            [
                15091,
                15095
            ],
            [
                15120,
                15221
            ],
            [
                15221,
                15257
            ],
            [
                15369,
                15387
            ],
            [
                15387,
                15468
            ],
            [
                15468,
                15544
            ],
            [
                15561,
                15589
            ],
            [
                15600,
                15641
            ],
            [
                15641,
                15665
            ],
            [
                15670,
                15684
            ],
            [
                15697,
                15713
            ],
            [
                15717,
                15726
            ],
            [
                15731,
                15742
            ],
            [
                15743,
                15780
            ],
            [
                15780,
                15828
            ],
            [
                15828,
                15918
            ],
            [
                15918,
                15922
            ],
            [
                15924,
                15933
            ],
            [
                15943,
                15983
            ],
            [
                15983,
                15991
            ],
            [
                16011,
                16036
            ],
            [
                16128,
                16155
            ],
            [
                16155,
                16209
            ],
            [
                16234,
                16237
            ],
            [
                16237,
                16280
            ],
            [
                16287,
                16296
            ],
            [
                16296,
                16310
            ],
            [
                16310,
                16329
            ],
            [
                17101,
                17104
            ],
            [
                16949,
                16957
            ],
            [
                17108,
                17120
            ],
            [
                17039,
                17060
            ],
            [
                16458,
                16461
            ],
            [
                16581,
                16588
            ],
            [
                16462,
                16508
            ],
            [
                16538,
                16539
            ],
            [
                16963,
                16965
            ],
            [
                16398,
                16400
            ],
            [
                16984,
                17033
            ],
            [
                17065,
                17100
            ],
            [
                17121,
                17216
            ],
            [
                17216,
                17268
            ],
            [
                17329,
                17331
            ],
            [
                17331,
                17414
            ],
            [
                17415,
                17438
            ],
            [
                17438,
                17472
            ],
            [
                17472,
                17504
            ],
            [
                17504,
                17572
            ],
            [
                17581,
                17583
            ],
            [
                17583,
                17626
            ],
            [
                17626,
                17672
            ],
            [
                17672,
                17699
            ],
            [
                17762,
                17824
            ],
            [
                17908,
                17927
            ],
            [
                17943,
                17945
            ],
            [
                17945,
                17990
            ],
            [
                17990,
                18032
            ],
            [
                18032,
                18081
            ],
            [
                18142,
                18200
            ],
            [
                18203,
                18236
            ],
            [
                18236,
                18237
            ],
            [
                18284,
                18313
            ],
            [
                18330,
                18339
            ],
            [
                18355,
                18431
            ],
            [
                18691,
                18701
            ],
            [
                18682,
                18686
            ],
            [
                18542,
                18562
            ],
            [
                18587,
                18590
            ],
            [
                18601,
                18638
            ],
            [
                18718,
                18720
            ],
            [
                18720,
                18740
            ],
            [
                18742,
                18786
            ],
            [
                18810,
                18844
            ],
            [
                18844,
                19019
            ],
            [
                19046,
                19075
            ],
            [
                19081,
                19092
            ],
            [
                19100,
                19108
            ],
            [
                19108,
                19118
            ],
            [
                19132,
                19226
            ],
            [
                19318,
                19320
            ],
            [
                19375,
                19380
            ],
            [
                19334,
                19338
            ],
            [
                19380,
                19382
            ],
            [
                19481,
                19504
            ],
            [
                19563,
                19596
            ],
            [
                19619,
                19620
            ],
            [
                19621,
                19695
            ],
            [
                19695,
                19745
            ],
            [
                19745,
                19790
            ],
            [
                19790,
                19806
            ],
            [
                19810,
                19820
            ],
            [
                19888,
                19933
            ],
            [
                19933,
                19950
            ],
            [
                19957,
                19967
            ],
            [
                20135,
                20160
            ],
            [
                20160,
                20224
            ],
            [
                20225,
                20234
            ],
            [
                20317,
                20386
            ],
            [
                20387,
                20435
            ],
            [
                20435,
                20482
            ],
            [
                20482,
                20517
            ],
            [
                20519,
                20573
            ],
            [
                20612,
                20614
            ],
            [
                20635,
                20650
            ],
            [
                20650,
                20691
            ],
            [
                20693,
                20698
            ],
            [
                20698,
                20699
            ],
            [
                20714,
                20716
            ],
            [
                20716,
                20758
            ],
            [
                20884,
                20939
            ],
            [
                20939,
                20956
            ],
            [
                20956,
                20968
            ],
            [
                20991,
                20993
            ],
            [
                20993,
                21036
            ]
        ],
        "row_chars": [
            [
                0,
                135
            ],
            [
                135,
                307
            ],
            [
                307,
                373
            ],
            [
                373,
                426
            ],
            [
                426,
                469
            ],
            [
                469,
                506
            ],
            [
                506,
                528
            ],
            [
                528,
                578
            ],
            [
                578,
                814
            ],
            [
                814,
                853
            ],
            [
                853,
                980
            ],
            [
                980,
                1044
            ],
            [
                1044,
                1085
            ],
            [
                1085,
                1374
            ],
            [
                1374,
                1386
            ],
            [
                1386,
                1432
            ],
            [
                1432,
                1495
            ],
            [
                1495,
                1549
            ],
            [
                1549,
                1583
            ],
            [
                1583,
                1618
            ],
            [
                1618,
                1921
            ],
            [
                1921,
                2099
            ],
            [
                2099,
                2137
            ],
            [
                2137,
                2166
            ],
            [
                2166,
                2321
            ],
            [
                2321,
                2422
            ],
            [
                2422,
                2484
            ],
            [
                2484,
                2544
            ],
            [
                2544,
                2631
            ],
            [
                2631,
                2904
            ],
            [
                2904,
                2943
            ],
            [
                2943,
                2981
            ],
            [
                2981,
                3054
            ],
            [
                3054,
                3187
            ],
            [
                3187,
                3285
            ],
            [
                3285,
                3327
            ],
            [
                3327,
                3459
            ],
            [
                3459,
                3695
            ],
            [
                3695,
                3809
            ],
            [
                3809,
                3873
            ],
            [
                3873,
                4042
            ],
            [
                4042,
                4111
            ],
            [
                4111,
                4140
            ],
            [
                4140,
                4208
            ],
            [
                4208,
                4296
            ],
            [
                4296,
                4318
            ],
            [
                4318,
                4348
            ],
            [
                4348,
                4421
            ],
            [
                4421,
                4444
            ],
            [
                4444,
                4477
            ],
            [
                4477,
                4511
            ],
            [
                4511,
                4564
            ],
            [
                4564,
                4595
            ],
            [
                4595,
                4623
            ],
            [
                4623,
                4695
            ],
            [
                4695,
                4727
            ],
            [
                4727,
                4778
            ],
            [
                4778,
                4810
            ],
            [
                4810,
                4887
            ],
            [
                4887,
                5020
            ],
            [
                5020,
                5205
            ],
            [
                5205,
                5372
            ],
            [
                5372,
                5522
            ],
            [
                5522,
                5737
            ],
            [
                5737,
                5862
            ],
            [
                5862,
                5957
            ],
            [
                5957,
                6034
            ],
            [
                6034,
                6119
            ],
            [
                6119,
                6170
            ],
            [
                6170,
                6333
            ],
            [
                6333,
                6447
            ],
            [
                6447,
                6639
            ],
            [
                6639,
                6686
            ],
            [
                6686,
                6767
            ],
            [
                6767,
                6884
            ],
            [
                6884,
                6965
            ],
            [
                6965,
                6973
            ],
            [
                6973,
                6995
            ],
            [
                6995,
                7030
            ],
            [
                7030,
                7085
            ],
            [
                7085,
                7164
            ],
            [
                7164,
                7285
            ],
            [
                7285,
                7348
            ],
            [
                7348,
                7382
            ],
            [
                7382,
                7415
            ],
            [
                7415,
                7528
            ],
            [
                7528,
                7623
            ],
            [
                7623,
                7717
            ],
            [
                7717,
                8030
            ],
            [
                8030,
                8119
            ],
            [
                8119,
                8203
            ],
            [
                8203,
                8387
            ],
            [
                8387,
                8429
            ],
            [
                8429,
                8461
            ],
            [
                8461,
                8525
            ],
            [
                8525,
                8584
            ],
            [
                8584,
                8621
            ],
            [
                8621,
                8680
            ],
            [
                8680,
                8693
            ],
            [
                8693,
                8810
            ],
            [
                8810,
                8846
            ],
            [
                8846,
                8894
            ],
            [
                8894,
                8941
            ],
            [
                8941,
                8985
            ],
            [
                8985,
                9085
            ],
            [
                9085,
                9135
            ],
            [
                9135,
                9188
            ],
            [
                9188,
                9254
            ],
            [
                9254,
                9334
            ],
            [
                9334,
                9359
            ],
            [
                9359,
                9423
            ],
            [
                9423,
                9585
            ],
            [
                9585,
                9627
            ],
            [
                9627,
                9648
            ],
            [
                9648,
                9666
            ],
            [
                9666,
                9747
            ],
            [
                9747,
                9833
            ],
            [
                9833,
                9957
            ],
            [
                9957,
                10340
            ],
            [
                10340,
                10368
            ],
            [
                10368,
                10377
            ],
            [
                10377,
                10410
            ],
            [
                10410,
                10497
            ],
            [
                10497,
                10792
            ],
            [
                10792,
                10998
            ],
            [
                10998,
                11157
            ],
            [
                11157,
                11239
            ],
            [
                11239,
                11350
            ],
            [
                11350,
                11440
            ],
            [
                11440,
                11564
            ],
            [
                11564,
                11604
            ],
            [
                11604,
                11871
            ],
            [
                11871,
                11915
            ],
            [
                11915,
                12161
            ],
            [
                12161,
                12224
            ],
            [
                12224,
                12275
            ],
            [
                12275,
                12292
            ],
            [
                12292,
                12321
            ],
            [
                12321,
                12377
            ],
            [
                12377,
                12391
            ],
            [
                12391,
                12486
            ],
            [
                12486,
                12535
            ],
            [
                12535,
                12608
            ],
            [
                12608,
                12625
            ],
            [
                12625,
                12679
            ],
            [
                12679,
                12807
            ],
            [
                12807,
                12827
            ],
            [
                12827,
                12881
            ],
            [
                12881,
                12913
            ],
            [
                12913,
                12932
            ],
            [
                12932,
                12963
            ],
            [
                12963,
                12999
            ],
            [
                12999,
                13027
            ],
            [
                13027,
                13082
            ],
            [
                13082,
                13148
            ],
            [
                13148,
                13164
            ],
            [
                13164,
                13194
            ],
            [
                13194,
                13236
            ],
            [
                13236,
                13258
            ],
            [
                13258,
                13288
            ],
            [
                13288,
                13426
            ],
            [
                13426,
                13490
            ],
            [
                13490,
                13523
            ],
            [
                13523,
                13555
            ],
            [
                13555,
                13600
            ],
            [
                13600,
                13720
            ],
            [
                13720,
                13767
            ],
            [
                13767,
                13809
            ],
            [
                13809,
                13842
            ],
            [
                13842,
                13891
            ],
            [
                13891,
                13904
            ],
            [
                13904,
                13918
            ],
            [
                13918,
                13966
            ],
            [
                13966,
                14013
            ],
            [
                14013,
                14043
            ],
            [
                14043,
                14069
            ],
            [
                14069,
                14118
            ],
            [
                14118,
                14211
            ],
            [
                14211,
                14329
            ],
            [
                14329,
                14358
            ],
            [
                14358,
                14420
            ],
            [
                14420,
                14481
            ],
            [
                14481,
                14552
            ],
            [
                14552,
                14588
            ],
            [
                14588,
                14677
            ],
            [
                14677,
                14729
            ],
            [
                14729,
                14760
            ],
            [
                14760,
                14776
            ],
            [
                14776,
                14856
            ],
            [
                14856,
                14950
            ],
            [
                14950,
                14985
            ],
            [
                14985,
                15079
            ],
            [
                15079,
                15221
            ],
            [
                15221,
                15387
            ],
            [
                15387,
                15468
            ],
            [
                15468,
                15544
            ],
            [
                15544,
                15641
            ],
            [
                15641,
                15743
            ],
            [
                15743,
                15780
            ],
            [
                15780,
                15828
            ],
            [
                15828,
                15918
            ],
            [
                15918,
                15983
            ],
            [
                15983,
                16039
            ],
            [
                16039,
                16127
            ],
            [
                16127,
                16155
            ],
            [
                16155,
                16237
            ],
            [
                16237,
                16296
            ],
            [
                16296,
                16310
            ],
            [
                16310,
                16329
            ],
            [
                16329,
                17121
            ],
            [
                17121,
                17216
            ],
            [
                17216,
                17331
            ],
            [
                17331,
                17415
            ],
            [
                17415,
                17438
            ],
            [
                17438,
                17472
            ],
            [
                17472,
                17504
            ],
            [
                17504,
                17583
            ],
            [
                17583,
                17626
            ],
            [
                17626,
                17672
            ],
            [
                17672,
                17702
            ],
            [
                17702,
                17741
            ],
            [
                17741,
                17761
            ],
            [
                17761,
                17824
            ],
            [
                17824,
                17908
            ],
            [
                17908,
                17945
            ],
            [
                17945,
                17990
            ],
            [
                17990,
                18032
            ],
            [
                18032,
                18081
            ],
            [
                18081,
                18142
            ],
            [
                18142,
                18236
            ],
            [
                18236,
                18316
            ],
            [
                18316,
                18329
            ],
            [
                18329,
                18469
            ],
            [
                18469,
                18542
            ],
            [
                18542,
                18720
            ],
            [
                18720,
                18844
            ],
            [
                18844,
                19108
            ],
            [
                19108,
                19382
            ],
            [
                19382,
                19481
            ],
            [
                19481,
                19621
            ],
            [
                19621,
                19695
            ],
            [
                19695,
                19745
            ],
            [
                19745,
                19790
            ],
            [
                19790,
                19822
            ],
            [
                19822,
                19888
            ],
            [
                19888,
                19933
            ],
            [
                19933,
                19967
            ],
            [
                19967,
                20011
            ],
            [
                20011,
                20075
            ],
            [
                20075,
                20135
            ],
            [
                20135,
                20160
            ],
            [
                20160,
                20225
            ],
            [
                20225,
                20387
            ],
            [
                20387,
                20435
            ],
            [
                20435,
                20482
            ],
            [
                20482,
                20614
            ],
            [
                20614,
                20635
            ],
            [
                20635,
                20650
            ],
            [
                20650,
                20698
            ],
            [
                20698,
                20716
            ],
            [
                20716,
                20758
            ],
            [
                20758,
                20836
            ],
            [
                20836,
                20884
            ],
            [
                20884,
                20939
            ],
            [
                20939,
                20956
            ],
            [
                20956,
                21036
            ]
        ]
    },
    "abridged": {
        "text": "Lady Carbury was eager that her son should go at once to Marie's father. \"My dear Felix,\" she said, standing over his bedside just before noon, \"pray don't put it off.\"\n\"I need to get him in a good humour,\" pleaded Sir Felix.\n\"But the young lady will feel that she is ill-used.\"\n\"There's no fear of that; she's all right. What am I to say to him about money? That's the question. Nidderdale asked for a certain sum down, to be paid before the ceremony, and it only went off because Nidderdale wanted the money to do what he liked with.\"\n\"You wouldn't mind having it settled?\"\n\"No; I'd consent to that if the money was paid down, and the income insured to me - say 7,000 or 8,000 a year. It wouldn't be worth while for less.\"\n\"But you have nothing left of your own.\"\n\"I've got a throat that I can cut, and brains that I can blow out,\" said the son, using an argument which he thought might be effective with his mother; though no man lived less likely to cut his own throat.\n\"Oh, Felix! how brutal.\"\n\"It may be brutal; but you know, mother, business is business. You want me to marry this girl because of her money.\"\n\"You want to marry her yourself.\"\n\"I want her money; and if I were to marry her, and if the money wasn't there, it would be like cutting my throat. There'd be no going back.\"\n\"Of course he'd pay the money first.\"\n\"Of course he ought; but it would be rather awkward to refuse to go into church because the money hadn't been paid over. He's so clever, that he'd contrive that a man shouldn't know whether the money had been paid or not. If you'll go, mother, I might think of getting up.\"\nLady Carbury saw the danger, and turned over the affair in her own mind. But she could also see the house in Grosvenor Square, the wealth and celebrity of the man, and weigh that against the absolute pennilessness of her son. Felix's condition was hopeless. Lord Nidderdale's embarrassments were only temporary. There were the family estates, and a golden future for him; but there was nothing coming to Felix. All he would ever have, he had now; position, a title, and a handsome face. Even the ruins of such wealth as that displayed in Grosvenor Square would be better than his present condition. And though it was possible that old Melmotte should be ruined some day, there could be no doubt about his riches now.\nShe visited her son again the next morning, which was Sunday, and again tried to persuade him to the marriage. \"I think you should be content to run a little risk,\" she said.\nSir Felix had been unlucky at cards on Saturday night, and was sulky.\n\"I wish you'd leave me alone,\" he said, \"to manage my own business.\"\n\"Is it not my business too?\"\n\"No; you haven't got to marry her, and to put up with these people. I shall make up my mind what to do, and I don't want anybody to meddle.\"\n\"You ungrateful boy! Are you always to be a burden on me and your sister? You have no shame. Your cousin Roger is right. I will quit London altogether, and leave you to your own wretchedness.\"\n\"That's what Roger says, is it?\"\n\"He is the best friend I have.\"\n\"He's an ill-tempered, close-fisted, interfering cad, and if he meddles with my affairs again, I shall tell him what I think of him. Upon my word, mother, I think you might let me have my room to myself.\" It was impossible for Lady Carbury, in his present mood, to explain that it was the only way she could ever find him. If she waited till he came down to breakfast, he escaped in five minutes, and did not return till some ungodly hour in the morning.\nAgain and again there came upon her moments in which she thought that Roger Carbury was right about Felix. She almost hated herself for the weakness of her love - but she acknowledged it. If he should fall, she must fall with him. In spite of his cruelty, his callous hardness, his insolence and ruinous indifference to the future, she must cling to him to the last. All that she had done and borne - was it not for his sake?\nSir Felix had been in Grosvenor Square, and had seen Madame Melmotte and Marie; but not a word had been said about the engagement. Madame Melmotte had told him that Miss Longestaffe was coming, which was a great bore. Upon this Marie had declared that she intended to like the young lady very much.\n\"Pooh!\" said Madame Melmotte. \"You never like no person at all.\" At this Marie had looked over to her lover and smiled. \"Ah, yes; that is all very well, while it lasts; but you care for no friend.\" From which Felix had judged that Madame Melmotte knew of his offer, and did not absolutely disapprove.\nOn Saturday he had received a note at his club from Marie. \"Come on Sunday at half-past two. You will find papa after lunch.\" But he did not tell his mother of his intention.\nAt about three on Sunday he knocked at the door in Grosvenor Square and asked for the ladies. He intended to ask for Mr. Melmotte; but his courage failed him, and he was shown up into the drawing-room, where he found Madame Melmotte, Marie, Georgiana Longestaffe, and Lord Nidderdale.\nMarie looked anxiously into his face, thinking that he had already been with her father. He slid into a chair close to Madame Melmotte, and tried to seem at his ease. Lord Nidderdale continued his flirtation with Miss Longestaffe - a flirtation which she carried on in a half whisper, wholly indifferent to her hostess.\n\"We know what brings you here,\" said Georgiana.\n\"I came to see you.\"\n\"I'm sure, Lord Nidderdale, you didn't expect to find me here.\"\n\"Lord bless you, I knew all about it, and came on purpose. That fellow there is the happy man. I shall go on coming here, because you're here. I don't think you'll like it here a bit, you know.\"\n\"I don't suppose I shall, Lord Nidderdale.\"\nAfter a while Marie contrived to be alone with her lover near one of the windows. \"Papa is downstairs in the book-room,\" she said. \"Go down, and ask the man to show you into the book-room.\"\n\"Shall I come up again?\"\n\"No; but leave a note for me under cover to Madame Didon.\" Sir Felix knew that Madame Didon was Madame Melmotte's maid. \"Or post it under cover to her. Go at once, now.\"\nIt seemed to Sir Felix that the very nature of the girl was altered. But he went, shaking hands with Madame Melmotte, and bowing to Miss Longestaffe.\nIn a few moments he found himself with Mr. Melmotte. The great financier was waked from slumber, which he seemed to have been enjoying with a cigar in his mouth.\n\"How do you do, Sir Felix?\" he said. \"I suppose you want the ladies.\"\n\"I've just been in the drawing-room, but I thought I'd look in on you as I came down.\"\nIt immediately occurred to Melmotte that the baronet had come about his share of the plunder out of the railway, and he resolved to be stern, and perhaps rude, in resenting any such interference. Experience had told him that young men might easily be cowed by a savage assumption of superiority. And he understood the game, which Sir Felix did not. He liked young associates because they were more timid and less greedy than their elders. Lord Nidderdale's suggestions had soon been put at rest, and Mr. Melmotte anticipated no greater difficulty with Sir Felix. Lord Alfred he had been obliged to buy.\n\"I'm very glad to see you, and all that,\" said Melmotte, raising his eyebrows in a disagreeable way; \"but this is hardly a day for business.\"\nSir Felix wished himself at the Beargarden. \"I didn't mean to intrude, Mr. Melmotte,\" he said.\n\"I dare say not. I only thought I'd tell you. You might have been going to speak about that railway.\"\n\"Oh dear no.\"\n\"Your mother was saying to me down in the country that she hoped you attended to the business. I told her that there was nothing to attend to.\"\n\"My mother doesn't understand anything about it,\" said Sir Felix.\n\"Women never do. Well; what can I do for you?\"\n\"Mr. Melmotte, I'm come - I'm come to - in short, Mr. Melmotte, I want to propose myself as a suitor for your daughter's hand.\"\n\"The d____ you do!\"\n\"Well, yes; and we hope you'll give us your consent.\"\n\"She knows you're coming then?\"\n\"Yes.\"\n\"And my wife - does she know?\"\n\"I've never spoken to her about it. Perhaps Miss Melmotte has.\"\n\"And how long have you and she had an understanding?\"\n\"I've been attached to her ever since I saw her,\" said Sir Felix. \"I have indeed. You know how that kind of thing goes on.\"\n\"I'm blessed if I do. I know how it ought to go on. I know that the young man should speak to the father before he speaks to the girl. He's a fool if he don't, if he wants to get the father's money. So she has given you a promise?\"\n\"I don't know about a promise.\"\n\"Do you consider that she's engaged to you?\"\n\"Not if she's disposed to get out of it,\" said Sir Felix, hoping that he might thus ingratiate himself with the father. \"Of course, I should be awfully disappointed.\"\n\"She has consented to your coming to me?\"\n\"Well, yes, sort of. Of course she knows that it all depends on you.\"\n\"Not at all. She's of age. If she chooses to marry you, she can marry you. If that's all you want, her consent is enough. You're a baronet, I believe?\"\n\"Oh, yes, I'm a baronet.\"\n\"And therefore you haven't to wait for your father to die, and I dare say you are indifferent about money.\"\nThis was a view of things which Sir Felix felt that he was bound to dispel. \"Not exactly,\" he said. \"I suppose you will give your daughter a fortune, of course.\"\n\"Then I wonder you didn't come to me before you went to her. If my daughter marries to please me, I shall give her money. If she marries to please herself, without considering me, I shan't give her a farthing.\"\n\"I had hoped that you might consent, Mr. Melmotte.\"\n\"It is possible. You're a man of fashion and have a title - and no doubt a property. If you'll show me that you've an income fit to maintain her, I'll think about it at any rate. What is your property, Sir Felix?\"\nSit Felix thought that when a man can hardly count his millions he ought not to ask questions about trifling sums of money. But the question had been asked, and must be answered. For a moment it occurred to Sir Felix that he might conveniently tell the truth. It would be nasty for the moment, but there would be nothing to come after. He could not be dragged down lower into the mire by cross-examinings. There might be an end of his hopes, but at the same time an end of his misery.\nBut he lacked the necessary courage. \"It isn't a large property, you know,\" he said.\n\"Not like the Marquis of Westminster's, I suppose,\" said the horrid, big, rich scoundrel.\n\"No; not quite,\" said Sir Felix, with a sickly laugh.\n\"But you can support a baronet's title? Where's your family seat?\"\n\"Carbury Manor, down in Suffolk, near the Longestaffes.\"\n\"That doesn't belong to you,\" said Melmotte sharply.\n\"No; not yet. But I'm the heir.\"\nNow Melmotte was puzzled. He did not understand the complex English system under which titles and property descend. He wanted to comprehend the ways of the country which he had adopted; and was clever at hiding his ignorance. He knew that Sir Felix was a baronet, and therefore presumed him to be the head of the family. He knew that Carbury Manor belonged to Roger Carbury. And now the baronet declared that he was heir to the man who was simply an Esquire.\n\"Oh, the heir are you? But how did he get it before you? You're the head of the family?\"\n\"Yes, I am the head of the family, of course,\" said Sir Felix, lying. \"But the place won't be mine till he dies. It would take a long time to explain it all.\"\n\"He's a young man, isn't he? If he were to marry and have children, how would it be then?\"\n\"I don't quite know. I have always understood that I am the heir. It's not very likely that he will marry.\"\n\"And in the meantime what is your own property?\"\n\"My father left me money in the funds and in railway stock - and then I am my mother's heir.\"\n\"You wish to marry my daughter. Would you inform me the amount and nature of the income on which you intend to support her?\"\nSir Felix felt that the bloated swindler was taking a most ungenerous advantage of him. Was he not a baronet and a gentleman, and a very handsome fellow, who had been in a crack regiment? If this surfeited sponge of speculation, this crammed commercial cormorant, wanted more than that for his daughter, why could he not say so without asking disgusting questions which it was quite impossible for a gentleman to answer? Was it not plain that any gentleman proposing to marry the daughter of such a man as Melmotte, must do so because he needed money in return for his rank? Sir Felix stood silent, wishing that he was well out of the house.\n\"You don't seem to be very clear about your own circumstances, Sir Felix. Perhaps you will get your lawyer to write to me.\"\n\"Perhaps that will be best,\" said the lover.\n\"Either that, or give it up.\" At this moment Lord Alfred entered the room. \"You're very late today, Alfred. Good morning, Sir Felix. Ring the bell, Alfred, and we'll have a little soda and brandy.\"\nSir Felix succeeded in getting Melmotte to shake hands with him before he went.\n\"Do you know anything about that young fellow?\" Melmotte asked as soon as the door was closed.\n\"He's a baronet without a shilling; was in the army and had to leave it,\" said Lord Alfred.\n\"I supposed so. But he's heir to a place down in Suffolk; eh?\"\n\"No. It's the same name, and that's about all. That young fellow has nothing to do with it whatever.\"\n\"Hasn't he now?\" Mr. Melmotte, thinking it over, almost admired the young man's impudence.",
        "paragraph_chars": [
            [
                0,
                169
            ],
            [
                169,
                226
            ],
            [
                226,
                279
            ],
            [
                279,
                537
            ],
            [
                537,
                576
            ],
            [
                576,
                725
            ],
            [
                725,
                766
            ],
            [
                766,
                974
            ],
            [
                974,
                999
            ],
            [
                999,
                1116
            ],
            [
                1116,
                1150
            ],
            [
                1150,
                1291
            ],
            [
                1291,
                1329
            ],
            [
                1329,
                1603
            ],
            [
                1603,
                2320
            ],
            [
                2320,
                2495
            ],
            [
                2495,
                2565
            ],
            [
                2565,
                2634
            ],
            [
                2634,
                2663
            ],
            [
                2663,
                2804
            ],
            [
                2804,
                2997
            ],
            [
                2997,
                3030
            ],
            [
                3030,
                3062
            ],
            [
                3062,
                3517
            ],
            [
                3517,
                3943
            ],
            [
                3943,
                4242
            ],
            [
                4242,
                4543
            ],
            [
                4543,
                4718
            ],
            [
                4718,
                5003
            ],
            [
                5003,
                5323
            ],
            [
                5323,
                5371
            ],
            [
                5371,
                5392
            ],
            [
                5392,
                5456
            ],
            [
                5456,
                5651
            ],
            [
                5651,
                5695
            ],
            [
                5695,
                5885
            ],
            [
                5885,
                5910
            ],
            [
                5910,
                6080
            ],
            [
                6080,
                6230
            ],
            [
                6230,
                6392
            ],
            [
                6392,
                6462
            ],
            [
                6462,
                6549
            ],
            [
                6549,
                7152
            ],
            [
                7152,
                7294
            ],
            [
                7294,
                7389
            ],
            [
                7389,
                7491
            ],
            [
                7491,
                7505
            ],
            [
                7505,
                7649
            ],
            [
                7649,
                7715
            ],
            [
                7715,
                7762
            ],
            [
                7762,
                7890
            ],
            [
                7890,
                7910
            ],
            [
                7910,
                7964
            ],
            [
                7964,
                7996
            ],
            [
                7996,
                8003
            ],
            [
                8003,
                8034
            ],
            [
                8034,
                8098
            ],
            [
                8098,
                8152
            ],
            [
                8152,
                8276
            ],
            [
                8276,
                8508
            ],
            [
                8508,
                8540
            ],
            [
                8540,
                8585
            ],
            [
                8585,
                8752
            ],
            [
                8752,
                8794
            ],
            [
                8794,
                8864
            ],
            [
                8864,
                9016
            ],
            [
                9016,
                9042
            ],
            [
                9042,
                9150
            ],
            [
                9150,
                9312
            ],
            [
                9312,
                9523
            ],
            [
                9523,
                9575
            ],
            [
                9575,
                9789
            ],
            [
                9789,
                10274
            ],
            [
                10274,
                10359
            ],
            [
                10359,
                10449
            ],
            [
                10449,
                10503
            ],
            [
                10503,
                10570
            ],
            [
                10570,
                10627
            ],
            [
                10627,
                10680
            ],
            [
                10680,
                10713
            ],
            [
                10713,
                11172
            ],
            [
                11172,
                11261
            ],
            [
                11261,
                11420
            ],
            [
                11420,
                11511
            ],
            [
                11511,
                11619
            ],
            [
                11619,
                11668
            ],
            [
                11668,
                11762
            ],
            [
                11762,
                11887
            ],
            [
                11887,
                12529
            ],
            [
                12529,
                12653
            ],
            [
                12653,
                12698
            ],
            [
                12698,
                12896
            ],
            [
                12896,
                12976
            ],
            [
                12976,
                13071
            ],
            [
                13071,
                13163
            ],
            [
                13163,
                13226
            ],
            [
                13226,
                13328
            ],
            [
                13328,
                13418
            ]
        ],
        "segment_chars": [
            [
                0,
                73
            ],
            [
                73,
                169
            ],
            [
                169,
                226
            ],
            [
                226,
                279
            ],
            [
                279,
                322
            ],
            [
                322,
                359
            ],
            [
                359,
                380
            ],
            [
                380,
                537
            ],
            [
                537,
                576
            ],
            [
                576,
                687
            ],
            [
                687,
                725
            ],
            [
                725,
                766
            ],
            [
                766,
                974
            ],
            [
                974,
                986
            ],
            [
                986,
                999
            ],
            [
                999,
                1062
            ],
            [
                1062,
                1116
            ],
            [
                1116,
                1150
            ],
            [
                1150,
                1264
            ],
            [
                1264,
                1291
            ],
            [
                1291,
                1329
            ],
            [
                1329,
                1450
            ],
            [
                1450,
                1551
            ],
            [
                1551,
                1603
            ],
            [
                1603,
                1676
            ],
            [
                1676,
                1829
            ],
            [
                1829,
                1861
            ],
            [
                1861,
                1915
            ],
            [
                1915,
                2014
            ],
            [
                2014,
                2090
            ],
            [
                2090,
                2202
            ],
            [
                2202,
                2320
            ],
            [
                2320,
                2431
            ],
            [
                2431,
                2495
            ],
            [
                2495,
                2565
            ],
            [
                2565,
                2634
            ],
            [
                2634,
                2663
            ],
            [
                2663,
                2731
            ],
            [
                2731,
                2804
            ],
            [
                2804,
                2825
            ],
            [
                2825,
                2878
            ],
            [
                2878,
                2897
            ],
            [
                2897,
                2925
            ],
            [
                2925,
                2997
            ],
            [
                2997,
                3030
            ],
            [
                3030,
                3062
            ],
            [
                3062,
                3195
            ],
            [
                3195,
                3267
            ],
            [
                3267,
                3385
            ],
            [
                3385,
                3517
            ],
            [
                3517,
                3624
            ],
            [
                3624,
                3705
            ],
            [
                3705,
                3748
            ],
            [
                3748,
                3884
            ],
            [
                3884,
                3943
            ],
            [
                3943,
                4074
            ],
            [
                4074,
                4161
            ],
            [
                4161,
                4242
            ],
            [
                4242,
                4250
            ],
            [
                4250,
                4272
            ],
            [
                4272,
                4307
            ],
            [
                4307,
                4362
            ],
            [
                4362,
                4440
            ],
            [
                4440,
                4543
            ],
            [
                4543,
                4602
            ],
            [
                4602,
                4636
            ],
            [
                4636,
                4669
            ],
            [
                4669,
                4718
            ],
            [
                4718,
                4812
            ],
            [
                4812,
                5003
            ],
            [
                5003,
                5092
            ],
            [
                5092,
                5170
            ],
            [
                5170,
                5323
            ],
            [
                5323,
                5371
            ],
            [
                5371,
                5392
            ],
            [
                5392,
                5456
            ],
            [
                5456,
                5515
            ],
            [
                5515,
                5551
            ],
            [
                5551,
                5599
            ],
            [
                5599,
                5651
            ],
            [
                5651,
                5695
            ],
            [
                5695,
                5777
            ],
            [
                5777,
                5826
            ],
            [
                5826,
                5885
            ],
            [
                5885,
                5910
            ],
            [
                5910,
                5969
            ],
            [
                5969,
                6030
            ],
            [
                6030,
                6062
            ],
            [
                6062,
                6080
            ],
            [
                6080,
                6149
            ],
            [
                6149,
                6230
            ],
            [
                6230,
                6283
            ],
            [
                6283,
                6392
            ],
            [
                6392,
                6420
            ],
            [
                6420,
                6429
            ],
            [
                6429,
                6462
            ],
            [
                6462,
                6549
            ],
            [
                6549,
                6745
            ],
            [
                6745,
                6845
            ],
            [
                6845,
                6898
            ],
            [
                6898,
                6988
            ],
            [
                6988,
                7112
            ],
            [
                7112,
                7152
            ],
            [
                7152,
                7294
            ],
            [
                7294,
                7338
            ],
            [
                7338,
                7389
            ],
            [
                7389,
                7406
            ],
            [
                7406,
                7435
            ],
            [
                7435,
                7491
            ],
            [
                7491,
                7505
            ],
            [
                7505,
                7600
            ],
            [
                7600,
                7649
            ],
            [
                7649,
                7715
            ],
            [
                7715,
                7732
            ],
            [
                7732,
                7762
            ],
            [
                7762,
                7890
            ],
            [
                7890,
                7910
            ],
            [
                7910,
                7964
            ],
            [
                7964,
                7996
            ],
            [
                7996,
                8003
            ],
            [
                8003,
                8034
            ],
            [
                8034,
                8070
            ],
            [
                8070,
                8098
            ],
            [
                8098,
                8152
            ],
            [
                8152,
                8218
            ],
            [
                8218,
                8234
            ],
            [
                8234,
                8276
            ],
            [
                8276,
                8298
            ],
            [
                8298,
                8328
            ],
            [
                8328,
                8411
            ],
            [
                8411,
                8475
            ],
            [
                8475,
                8508
            ],
            [
                8508,
                8540
            ],
            [
                8540,
                8585
            ],
            [
                8585,
                8705
            ],
            [
                8705,
                8752
            ],
            [
                8752,
                8794
            ],
            [
                8794,
                8815
            ],
            [
                8815,
                8864
            ],
            [
                8864,
                8877
            ],
            [
                8877,
                8891
            ],
            [
                8891,
                8939
            ],
            [
                8939,
                8986
            ],
            [
                8986,
                9016
            ],
            [
                9016,
                9042
            ],
            [
                9042,
                9150
            ],
            [
                9150,
                9226
            ],
            [
                9226,
                9250
            ],
            [
                9250,
                9312
            ],
            [
                9312,
                9373
            ],
            [
                9373,
                9434
            ],
            [
                9434,
                9523
            ],
            [
                9523,
                9575
            ],
            [
                9575,
                9592
            ],
            [
                9592,
                9660
            ],
            [
                9660,
                9754
            ],
            [
                9754,
                9789
            ],
            [
                9789,
                9913
            ],
            [
                9913,
                9968
            ],
            [
                9968,
                10049
            ],
            [
                10049,
                10125
            ],
            [
                10125,
                10195
            ],
            [
                10195,
                10274
            ],
            [
                10274,
                10311
            ],
            [
                10311,
                10359
            ],
            [
                10359,
                10449
            ],
            [
                10449,
                10503
            ],
            [
                10503,
                10543
            ],
            [
                10543,
                10570
            ],
            [
                10570,
                10627
            ],
            [
                10627,
                10680
            ],
            [
                10680,
                10694
            ],
            [
                10694,
                10713
            ],
            [
                10713,
                10739
            ],
            [
                10739,
                10829
            ],
            [
                10829,
                10939
            ],
            [
                10939,
                11034
            ],
            [
                11034,
                11088
            ],
            [
                11088,
                11172
            ],
            [
                11172,
                11195
            ],
            [
                11195,
                11229
            ],
            [
                11229,
                11261
            ],
            [
                11261,
                11331
            ],
            [
                11331,
                11374
            ],
            [
                11374,
                11420
            ],
            [
                11420,
                11449
            ],
            [
                11449,
                11511
            ],
            [
                11511,
                11532
            ],
            [
                11532,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11668
            ],
            [
                11668,
                11762
            ],
            [
                11762,
                11794
            ],
            [
                11794,
                11887
            ],
            [
                11887,
                11975
            ],
            [
                11975,
                12075
            ],
            [
                12075,
                12308
            ],
            [
                12308,
                12462
            ],
            [
                12462,
                12529
            ],
            [
                12529,
                12603
            ],
            [
                12603,
                12653
            ],
            [
                12653,
                12698
            ],
            [
                12698,
                12728
            ],
            [
                12728,
                12773
            ],
            [
                12773,
                12806
            ],
            [
                12806,
                12831
            ],
            [
                12831,
                12896
            ],
            [
                12896,
                12976
            ],
            [
                12976,
                13024
            ],
            [
                13024,
                13071
            ],
            [
                13071,
                13163
            ],
            [
                13163,
                13179
            ],
            [
                13179,
                13226
            ],
            [
                13226,
                13231
            ],
            [
                13231,
                13273
            ],
            [
                13273,
                13328
            ],
            [
                13328,
                13345
            ],
            [
                13345,
                13418
            ]
        ],
        "overlap_chars": [
            [
                5,
                16
            ],
            [
                17,
                22
            ],
            [
                23,
                42
            ],
            [
                43,
                45
            ],
            [
                46,
                53
            ],
            [
                54,
                71
            ],
            [
                71,
                73
            ],
            [
                73,
                125
            ],
            [
                131,
                166
            ],
            [
                166,
                169
            ],
            [
                169,
                170
            ],
            [
                177,
                226
            ],
            [
                226,
                279
            ],
            [
                279,
                322
            ],
            [
                322,
                359
            ],
            [
                359,
                378
            ],
            [
                380,
                390
            ],
            [
                397,
                419
            ],
            [
                419,
                420
            ],
            [
                421,
                431
            ],
            [
                432,
                537
            ],
            [
                537,
                576
            ],
            [
                576,
                580
            ],
            [
                581,
                600
            ],
            [
                604,
                657
            ],
            [
                660,
                687
            ],
            [
                687,
                713
            ],
            [
                714,
                722
            ],
            [
                722,
                725
            ],
            [
                725,
                766
            ],
            [
                766,
                874
            ],
            [
                883,
                891
            ],
            [
                902,
                925
            ],
            [
                926,
                972
            ],
            [
                972,
                974
            ],
            [
                974,
                986
            ],
            [
                986,
                996
            ],
            [
                996,
                999
            ],
            [
                999,
                1062
            ],
            [
                1062,
                1116
            ],
            [
                1116,
                1150
            ],
            [
                1150,
                1151
            ],
            [
                1151,
                1172
            ],
            [
                1173,
                1239
            ],
            [
                1240,
                1262
            ],
            [
                1262,
                1264
            ],
            [
                1288,
                1291
            ],
            [
                1291,
                1329
            ],
            [
                1330,
                1408
            ],
            [
                1409,
                1450
            ],
            [
                1450,
                1551
            ],
            [
                1551,
                1572
            ],
            [
                1573,
                1603
            ],
            [
                1603,
                1658
            ],
            [
                1659,
                1676
            ],
            [
                1676,
                1733
            ],
            [
                1741,
                1744
            ],
            [
                1745,
                1765
            ],
            [
                1765,
                1770
            ],
            [
                1771,
                1776
            ],
            [
                1777,
                1781
            ],
            [
                1782,
                1789
            ],
            [
                1790,
                1823
            ],
            [
                1824,
                1829
            ],
            [
                1837,
                1861
            ],
            [
                1861,
                1876
            ],
            [
                1879,
                1893
            ],
            [
                1894,
                1915
            ],
            [
                1915,
                1944
            ],
            [
                1944,
                2012
            ],
            [
                2012,
                2014
            ],
            [
                2014,
                2017
            ],
            [
                2018,
                2036
            ],
            [
                2036,
                2049
            ],
            [
                2050,
                2090
            ],
            [
                2090,
                2104
            ],
            [
                2105,
                2178
            ],
            [
                2183,
                2202
            ],
            [
                2202,
                2205
            ],
            [
                2206,
                2297
            ],
            [
                2304,
                2307
            ],
            [
                2320,
                2345
            ],
            [
                2346,
                2431
            ],
            [
                2431,
                2495
            ],
            [
                2495,
                2553
            ],
            [
                2554,
                2557
            ],
            [
                2558,
                2563
            ],
            [
                2563,
                2564
            ],
            [
                2565,
                2634
            ],
            [
                2634,
                2663
            ],
            [
                2663,
                2731
            ],
            [
                2731,
                2765
            ],
            [
                2765,
                2801
            ],
            [
                2801,
                2804
            ],
            [
                2804,
                2823
            ],
            [
                2825,
                2878
            ],
            [
                2878,
                2881
            ],
            [
                2887,
                2897
            ],
            [
                2897,
                2925
            ],
            [
                2925,
                2997
            ],
            [
                2997,
                3020
            ],
            [
                3022,
                3027
            ],
            [
                3030,
                3061
            ],
            [
                3062,
                3195
            ],
            [
                3195,
                3215
            ],
            [
                3215,
                3246
            ],
            [
                3247,
                3249
            ],
            [
                3250,
                3254
            ],
            [
                3255,
                3267
            ],
            [
                3267,
                3305
            ],
            [
                3306,
                3334
            ],
            [
                3335,
                3339
            ],
            [
                3356,
                3359
            ],
            [
                3360,
                3363
            ],
            [
                3364,
                3369
            ],
            [
                3370,
                3385
            ],
            [
                3385,
                3441
            ],
            [
                3442,
                3462
            ],
            [
                3478,
                3487
            ],
            [
                3496,
                3516
            ],
            [
                3517,
                3610
            ],
            [
                3622,
                3624
            ],
            [
                3624,
                3672
            ],
            [
                3673,
                3677
            ],
            [
                3680,
                3705
            ],
            [
                3705,
                3722
            ],
            [
                3722,
                3748
            ],
            [
                3748,
                3808
            ],
            [
                3809,
                3884
            ],
            [
                3884,
                3905
            ],
            [
                3906,
                3909
            ],
            [
                3910,
                3915
            ],
            [
                3918,
                3943
            ],
            [
                3943,
                3981
            ],
            [
                3981,
                4026
            ],
            [
                4027,
                4074
            ],
            [
                4090,
                4135
            ],
            [
                4135,
                4159
            ],
            [
                4161,
                4241
            ],
            [
                4242,
                4250
            ],
            [
                4250,
                4272
            ],
            [
                4272,
                4307
            ],
            [
                4307,
                4362
            ],
            [
                4362,
                4394
            ],
            [
                4395,
                4440
            ],
            [
                4440,
                4488
            ],
            [
                4489,
                4541
            ],
            [
                4541,
                4542
            ],
            [
                4543,
                4545
            ],
            [
                4546,
                4602
            ],
            [
                4602,
                4636
            ],
            [
                4636,
                4669
            ],
            [
                4669,
                4675
            ],
            [
                4680,
                4688
            ],
            [
                4700,
                4716
            ],
            [
                4716,
                4718
            ],
            [
                4718,
                4812
            ],
            [
                4812,
                4852
            ],
            [
                4853,
                4918
            ],
            [
                4918,
                4919
            ],
            [
                4926,
                4985
            ],
            [
                4986,
                5002
            ],
            [
                5003,
                5092
            ],
            [
                5092,
                5142
            ],
            [
                5149,
                5170
            ],
            [
                5170,
                5232
            ],
            [
                5235,
                5321
            ],
            [
                5321,
                5322
            ],
            [
                5323,
                5354
            ],
            [
                5355,
                5359
            ],
            [
                5369,
                5371
            ],
            [
                5371,
                5378
            ],
            [
                5379,
                5392
            ],
            [
                5392,
                5456
            ],
            [
                5456,
                5515
            ],
            [
                5515,
                5551
            ],
            [
                5551,
                5599
            ],
            [
                5599,
                5627
            ],
            [
                5633,
                5651
            ],
            [
                5651,
                5695
            ],
            [
                5695,
                5775
            ],
            [
                5775,
                5777
            ],
            [
                5777,
                5785
            ],
            [
                5797,
                5826
            ],
            [
                5826,
                5827
            ],
            [
                5827,
                5834
            ],
            [
                5834,
                5835
            ],
            [
                5836,
                5885
            ],
            [
                5885,
                5910
            ],
            [
                5910,
                5938
            ],
            [
                5939,
                5969
            ],
            [
                5973,
                5978
            ],
            [
                5984,
                6023
            ],
            [
                6028,
                6030
            ],
            [
                6030,
                6033
            ],
            [
                6034,
                6038
            ],
            [
                6039,
                6041
            ],
            [
                6042,
                6062
            ],
            [
                6062,
                6079
            ],
            [
                6080,
                6082
            ],
            [
                6090,
                6149
            ],
            [
                6149,
                6161
            ],
            [
                6162,
                6230
            ],
            [
                6230,
                6281
            ],
            [
                6281,
                6283
            ],
            [
                6283,
                6302
            ],
            [
                6303,
                6391
            ],
            [
                6392,
                6420
            ],
            [
                6420,
                6429
            ],
            [
                6429,
                6462
            ],
            [
                6462,
                6548
            ],
            [
                6549,
                6668
            ],
            [
                6669,
                6689
            ],
            [
                6689,
                6707
            ],
            [
                6709,
                6711
            ],
            [
                6712,
                6725
            ],
            [
                6731,
                6743
            ],
            [
                6743,
                6745
            ],
            [
                6756,
                6773
            ],
            [
                6780,
                6783
            ],
            [
                6784,
                6845
            ],
            [
                6845,
                6851
            ],
            [
                6863,
                6872
            ],
            [
                6889,
                6896
            ],
            [
                6896,
                6898
            ],
            [
                6898,
                6988
            ],
            [
                6988,
                7112
            ],
            [
                7112,
                7152
            ],
            [
                7152,
                7208
            ],
            [
                7221,
                7229
            ],
            [
                7233,
                7234
            ],
            [
                7235,
                7247
            ],
            [
                7251,
                7291
            ],
            [
                7291,
                7294
            ],
            [
                7294,
                7338
            ],
            [
                7338,
                7389
            ],
            [
                7389,
                7406
            ],
            [
                7406,
                7435
            ],
            [
                7435,
                7491
            ],
            [
                7491,
                7505
            ],
            [
                7505,
                7600
            ],
            [
                7600,
                7649
            ],
            [
                7649,
                7687
            ],
            [
                7688,
                7715
            ],
            [
                7715,
                7732
            ],
            [
                7732,
                7737
            ],
            [
                7738,
                7759
            ],
            [
                7759,
                7762
            ],
            [
                7762,
                7785
            ],
            [
                7788,
                7799
            ],
            [
                7802,
                7890
            ],
            [
                7890,
                7896
            ],
            [
                7901,
                7910
            ],
            [
                7910,
                7964
            ],
            [
                7964,
                7996
            ],
            [
                7996,
                8000
            ],
            [
                8000,
                8003
            ],
            [
                8003,
                8015
            ],
            [
                8018,
                8034
            ],
            [
                8034,
                8070
            ],
            [
                8070,
                8098
            ],
            [
                8098,
                8128
            ],
            [
                8149,
                8152
            ],
            [
                8152,
                8218
            ],
            [
                8218,
                8234
            ],
            [
                8234,
                8276
            ],
            [
                8276,
                8298
            ],
            [
                8298,
                8328
            ],
            [
                8328,
                8339
            ],
            [
                8340,
                8411
            ],
            [
                8411,
                8475
            ],
            [
                8475,
                8508
            ],
            [
                8508,
                8540
            ],
            [
                8540,
                8585
            ],
            [
                8585,
                8705
            ],
            [
                8705,
                8752
            ],
            [
                8752,
                8794
            ],
            [
                8794,
                8804
            ],
            [
                8806,
                8813
            ],
            [
                8813,
                8815
            ],
            [
                8815,
                8864
            ],
            [
                8864,
                8877
            ],
            [
                8877,
                8891
            ],
            [
                8891,
                8939
            ],
            [
                8939,
                8986
            ],
            [
                8986,
                9016
            ],
            [
                9016,
                9042
            ],
            [
                9057,
                9150
            ],
            [
                9150,
                9224
            ],
            [
                9224,
                9226
            ],
            [
                9226,
                9238
            ],
            [
                9238,
                9250
            ],
            [
                9250,
                9312
            ],
            [
                9312,
                9373
            ],
            [
                9373,
                9432
            ],
            [
                9432,
                9434
            ],
            [
                9434,
                9523
            ],
            [
                9523,
                9575
            ],
            [
                9576,
                9592
            ],
            [
                9592,
                9632
            ],
            [
                9635,
                9660
            ],
            [
                9660,
                9754
            ],
            [
                9754,
                9789
            ],
            [
                9793,
                9798
            ],
            [
                9807,
                9811
            ],
            [
                9812,
                9913
            ],
            [
                9913,
                9949
            ],
            [
                9950,
                9968
            ],
            [
                9968,
                10049
            ],
            [
                10049,
                10125
            ],
            [
                10125,
                10153
            ],
            [
                10154,
                10195
            ],
            [
                10195,
                10219
            ],
            [
                10220,
                10234
            ],
            [
                10235,
                10251
            ],
            [
                10252,
                10261
            ],
            [
                10262,
                10273
            ],
            [
                10274,
                10311
            ],
            [
                10311,
                10359
            ],
            [
                10359,
                10449
            ],
            [
                10449,
                10453
            ],
            [
                10454,
                10463
            ],
            [
                10463,
                10503
            ],
            [
                10503,
                10511
            ],
            [
                10516,
                10541
            ],
            [
                10543,
                10570
            ],
            [
                10570,
                10624
            ],
            [
                10624,
                10627
            ],
            [
                10627,
                10670
            ],
            [
                10671,
                10680
            ],
            [
                10680,
                10694
            ],
            [
                10694,
                10713
            ],
            [
                10713,
                10716
            ],
            [
                10717,
                10725
            ],
            [
                10726,
                10738
            ],
            [
                10739,
                10760
            ],
            [
                10761,
                10764
            ],
            [
                10765,
                10772
            ],
            [
                10781,
                10827
            ],
            [
                10827,
                10828
            ],
            [
                10829,
                10831
            ],
            [
                10839,
                10841
            ],
            [
                10853,
                10902
            ],
            [
                10903,
                10938
            ],
            [
                10939,
                11034
            ],
            [
                11034,
                11086
            ],
            [
                11086,
                11088
            ],
            [
                11088,
                11171
            ],
            [
                11172,
                11195
            ],
            [
                11195,
                11229
            ],
            [
                11229,
                11261
            ],
            [
                11261,
                11329
            ],
            [
                11329,
                11331
            ],
            [
                11331,
                11374
            ],
            [
                11374,
                11420
            ],
            [
                11420,
                11447
            ],
            [
                11449,
                11511
            ],
            [
                11511,
                11530
            ],
            [
                11530,
                11532
            ],
            [
                11532,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11668
            ],
            [
                11668,
                11726
            ],
            [
                11729,
                11762
            ],
            [
                11762,
                11763
            ],
            [
                11763,
                11792
            ],
            [
                11794,
                11803
            ],
            [
                11804,
                11880
            ],
            [
                11891,
                11901
            ],
            [
                11902,
                11906
            ],
            [
                11907,
                11927
            ],
            [
                11928,
                11931
            ],
            [
                11932,
                11969
            ],
            [
                11973,
                11975
            ],
            [
                11975,
                11995
            ],
            [
                11996,
                12040
            ],
            [
                12041,
                12075
            ],
            [
                12075,
                12250
            ],
            [
                12251,
                12280
            ],
            [
                12285,
                12296
            ],
            [
                12300,
                12308
            ],
            [
                12308,
                12318
            ],
            [
                12319,
                12413
            ],
            [
                12422,
                12424
            ],
            [
                12432,
                12437
            ],
            [
                12456,
                12460
            ],
            [
                12460,
                12462
            ],
            [
                12462,
                12485
            ],
            [
                12494,
                12527
            ],
            [
                12527,
                12528
            ],
            [
                12529,
                12603
            ],
            [
                12603,
                12653
            ],
            [
                12653,
                12698
            ],
            [
                12698,
                12714
            ],
            [
                12715,
                12725
            ],
            [
                12728,
                12773
            ],
            [
                12773,
                12790
            ],
            [
                12796,
                12806
            ],
            [
                12806,
                12831
            ],
            [
                12831,
                12895
            ],
            [
                12896,
                12905
            ],
            [
                12906,
                12975
            ],
            [
                12976,
                13024
            ],
            [
                13024,
                13071
            ],
            [
                13071,
                13106
            ],
            [
                13107,
                13161
            ],
            [
                13161,
                13163
            ],
            [
                13164,
                13179
            ],
            [
                13179,
                13220
            ],
            [
                13221,
                13226
            ],
            [
                13226,
                13227
            ],
            [
                13229,
                13231
            ],
            [
                13231,
                13273
            ],
            [
                13273,
                13328
            ],
            [
                13328,
                13345
            ],
            [
                13345,
                13357
            ],
            [
                13368,
                13370
            ],
            [
                13375,
                13418
            ]
        ],
        "row_chars": [
            [
                0,
                73
            ],
            [
                73,
                169
            ],
            [
                169,
                226
            ],
            [
                226,
                279
            ],
            [
                279,
                322
            ],
            [
                322,
                359
            ],
            [
                359,
                380
            ],
            [
                380,
                380
            ],
            [
                380,
                537
            ],
            [
                537,
                576
            ],
            [
                576,
                687
            ],
            [
                687,
                725
            ],
            [
                725,
                766
            ],
            [
                766,
                974
            ],
            [
                974,
                986
            ],
            [
                986,
                999
            ],
            [
                999,
                1062
            ],
            [
                1062,
                1116
            ],
            [
                1116,
                1150
            ],
            [
                1150,
                1150
            ],
            [
                1150,
                1264
            ],
            [
                1264,
                1291
            ],
            [
                1291,
                1329
            ],
            [
                1329,
                1329
            ],
            [
                1329,
                1450
            ],
            [
                1450,
                1551
            ],
            [
                1551,
                1551
            ],
            [
                1551,
                1603
            ],
            [
                1603,
                1676
            ],
            [
                1676,
                1829
            ],
            [
                1829,
                1861
            ],
            [
                1861,
                1861
            ],
            [
                1861,
                1915
            ],
            [
                1915,
                2014
            ],
            [
                2014,
                2090
            ],
            [
                2090,
                2090
            ],
            [
                2090,
                2202
            ],
            [
                2202,
                2320
            ],
            [
                2320,
                2431
            ],
            [
                2431,
                2495
            ],
            [
                2495,
                2565
            ],
            [
                2565,
                2634
            ],
            [
                2634,
                2663
            ],
            [
                2663,
                2731
            ],
            [
                2731,
                2804
            ],
            [
                2804,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2878
            ],
            [
                2878,
                2897
            ],
            [
                2897,
                2925
            ],
            [
                2925,
                2997
            ],
            [
                2997,
                3030
            ],
            [
                3030,
                3030
            ],
            [
                3030,
                3062
            ],
            [
                3062,
                3062
            ],
            [
                3062,
                3195
            ],
            [
                3195,
                3267
            ],
            [
                3267,
                3385
            ],
            [
                3385,
                3517
            ],
            [
                3517,
                3517
            ],
            [
                3517,
                3517
            ],
            [
                3517,
                3624
            ],
            [
                3624,
                3624
            ],
            [
                3624,
                3705
            ],
            [
                3705,
                3748
            ],
            [
                3748,
                3884
            ],
            [
                3884,
                3943
            ],
            [
                3943,
                4074
            ],
            [
                4074,
                4074
            ],
            [
                4074,
                4074
            ],
            [
                4074,
                4161
            ],
            [
                4161,
                4242
            ],
            [
                4242,
                4250
            ],
            [
                4250,
                4272
            ],
            [
                4272,
                4307
            ],
            [
                4307,
                4362
            ],
            [
                4362,
                4440
            ],
            [
                4440,
                4543
            ],
            [
                4543,
                4602
            ],
            [
                4602,
                4636
            ],
            [
                4636,
                4669
            ],
            [
                4669,
                4669
            ],
            [
                4669,
                4718
            ],
            [
                4718,
                4812
            ],
            [
                4812,
                5003
            ],
            [
                5003,
                5092
            ],
            [
                5092,
                5170
            ],
            [
                5170,
                5323
            ],
            [
                5323,
                5371
            ],
            [
                5371,
                5392
            ],
            [
                5392,
                5456
            ],
            [
                5456,
                5515
            ],
            [
                5515,
                5515
            ],
            [
                5515,
                5515
            ],
            [
                5515,
                5515
            ],
            [
                5515,
                5515
            ],
            [
                5515,
                5551
            ],
            [
                5551,
                5599
            ],
            [
                5599,
                5651
            ],
            [
                5651,
                5695
            ],
            [
                5695,
                5777
            ],
            [
                5777,
                5826
            ],
            [
                5826,
                5826
            ],
            [
                5826,
                5826
            ],
            [
                5826,
                5885
            ],
            [
                5885,
                5910
            ],
            [
                5910,
                5969
            ],
            [
                5969,
                6030
            ],
            [
                6030,
                6062
            ],
            [
                6062,
                6062
            ],
            [
                6062,
                6080
            ],
            [
                6080,
                6149
            ],
            [
                6149,
                6230
            ],
            [
                6230,
                6283
            ],
            [
                6283,
                6392
            ],
            [
                6392,
                6420
            ],
            [
                6420,
                6429
            ],
            [
                6429,
                6462
            ],
            [
                6462,
                6549
            ],
            [
                6549,
                6745
            ],
            [
                6745,
                6845
            ],
            [
                6845,
                6898
            ],
            [
                6898,
                6898
            ],
            [
                6898,
                6898
            ],
            [
                6898,
                6988
            ],
            [
                6988,
                7112
            ],
            [
                7112,
                7152
            ],
            [
                7152,
                7294
            ],
            [
                7294,
                7338
            ],
            [
                7338,
                7338
            ],
            [
                7338,
                7338
            ],
            [
                7338,
                7389
            ],
            [
                7389,
                7406
            ],
            [
                7406,
                7435
            ],
            [
                7435,
                7491
            ],
            [
                7491,
                7505
            ],
            [
                7505,
                7600
            ],
            [
                7600,
                7649
            ],
            [
                7649,
                7715
            ],
            [
                7715,
                7732
            ],
            [
                7732,
                7762
            ],
            [
                7762,
                7890
            ],
            [
                7890,
                7910
            ],
            [
                7910,
                7964
            ],
            [
                7964,
                7996
            ],
            [
                7996,
                8003
            ],
            [
                8003,
                8034
            ],
            [
                8034,
                8070
            ],
            [
                8070,
                8098
            ],
            [
                8098,
                8152
            ],
            [
                8152,
                8218
            ],
            [
                8218,
                8234
            ],
            [
                8234,
                8234
            ],
            [
                8234,
                8276
            ],
            [
                8276,
                8298
            ],
            [
                8298,
                8328
            ],
            [
                8328,
                8411
            ],
            [
                8411,
                8475
            ],
            [
                8475,
                8508
            ],
            [
                8508,
                8540
            ],
            [
                8540,
                8585
            ],
            [
                8585,
                8705
            ],
            [
                8705,
                8752
            ],
            [
                8752,
                8794
            ],
            [
                8794,
                8815
            ],
            [
                8815,
                8864
            ],
            [
                8864,
                8877
            ],
            [
                8877,
                8891
            ],
            [
                8891,
                8939
            ],
            [
                8939,
                8986
            ],
            [
                8986,
                9016
            ],
            [
                9016,
                9042
            ],
            [
                9042,
                9042
            ],
            [
                9042,
                9150
            ],
            [
                9150,
                9226
            ],
            [
                9226,
                9250
            ],
            [
                9250,
                9312
            ],
            [
                9312,
                9373
            ],
            [
                9373,
                9434
            ],
            [
                9434,
                9434
            ],
            [
                9434,
                9523
            ],
            [
                9523,
                9575
            ],
            [
                9575,
                9575
            ],
            [
                9575,
                9592
            ],
            [
                9592,
                9660
            ],
            [
                9660,
                9754
            ],
            [
                9754,
                9789
            ],
            [
                9789,
                9789
            ],
            [
                9789,
                9913
            ],
            [
                9913,
                9968
            ],
            [
                9968,
                10049
            ],
            [
                10049,
                10125
            ],
            [
                10125,
                10195
            ],
            [
                10195,
                10274
            ],
            [
                10274,
                10311
            ],
            [
                10311,
                10359
            ],
            [
                10359,
                10449
            ],
            [
                10449,
                10503
            ],
            [
                10503,
                10543
            ],
            [
                10543,
                10543
            ],
            [
                10543,
                10570
            ],
            [
                10570,
                10627
            ],
            [
                10627,
                10680
            ],
            [
                10680,
                10694
            ],
            [
                10694,
                10713
            ],
            [
                10713,
                10939
            ],
            [
                10939,
                11034
            ],
            [
                11034,
                11088
            ],
            [
                11088,
                11172
            ],
            [
                11172,
                11195
            ],
            [
                11195,
                11229
            ],
            [
                11229,
                11261
            ],
            [
                11261,
                11331
            ],
            [
                11331,
                11374
            ],
            [
                11374,
                11420
            ],
            [
                11420,
                11449
            ],
            [
                11449,
                11449
            ],
            [
                11449,
                11449
            ],
            [
                11449,
                11511
            ],
            [
                11511,
                11511
            ],
            [
                11511,
                11532
            ],
            [
                11532,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11668
            ],
            [
                11668,
                11668
            ],
            [
                11668,
                11762
            ],
            [
                11762,
                11794
            ],
            [
                11794,
                11794
            ],
            [
                11794,
                11887
            ],
            [
                11887,
                11887
            ],
            [
                11887,
                11975
            ],
            [
                11975,
                12075
            ],
            [
                12075,
                12308
            ],
            [
                12308,
                12462
            ],
            [
                12462,
                12462
            ],
            [
                12462,
                12529
            ],
            [
                12529,
                12603
            ],
            [
                12603,
                12653
            ],
            [
                12653,
                12698
            ],
            [
                12698,
                12728
            ],
            [
                12728,
                12728
            ],
            [
                12728,
                12773
            ],
            [
                12773,
                12806
            ],
            [
                12806,
                12806
            ],
            [
                12806,
                12806
            ],
            [
                12806,
                12806
            ],
            [
                12806,
                12831
            ],
            [
                12831,
                12896
            ],
            [
                12896,
                12976
            ],
            [
                12976,
                13024
            ],
            [
                13024,
                13071
            ],
            [
                13071,
                13163
            ],
            [
                13163,
                13163
            ],
            [
                13163,
                13179
            ],
            [
                13179,
                13226
            ],
            [
                13226,
                13231
            ],
            [
                13231,
                13273
            ],
            [
                13273,
                13273
            ],
            [
                13273,
                13273
            ],
            [
                13273,
                13328
            ],
            [
                13328,
                13345
            ],
            [
                13345,
                13418
            ]
        ]
    }
}