{
    "original": {
        "text": "Sir Felix as he walked down to his club felt that he had been checkmated,--and was at the same time full of wrath at the insolence of the man who had so easily beaten him out of the field. As far as he could see, the game was over. No doubt he might marry Marie Melmotte. The father had told him so much himself, and he perfectly believed the truth of that oath which Marie had sworn. He did not doubt but that she'd stick to him close enough. She was in love with him, which was natural; and was a fool,--which was perhaps also natural. But romance was not the game which he was playing. People told him that when girls succeeded in marrying without their parents' consent, fathers were always constrained to forgive them at last. That might be the case with ordinary fathers. But Melmotte was decidedly not an ordinary father. He was,--so Sir Felix declared to himself,--perhaps the greatest brute ever created. Sir Felix could not but remember that elevation of the eyebrows, and the brazen forehead, and the hard mouth. He had found himself quite unable to stand up against Melmotte, and now he cursed and swore at the man as he was carried down to the Beargarden in a cab.\nBut what should he do? Should he abandon Marie Melmotte altogether, never go to Grosvenor Square again, and drop the whole family, including the Great Mexican Railway? Then an idea occurred to him. Nidderdale had explained to him the result of his application for shares. \"You see we haven't bought any and therefore can't sell any. There seems to be something in that. I shall explain it all to my governor, and get him to go a thou' or two. If he sees his way to get the money back, he'd do that and let me have the difference.\" On that Sunday afternoon Sir Felix thought over all this. \"Why shouldn't he 'go a thou,' and get the difference?\" He made a mental calculation. 12 10_s._ per 100! 125 for a thousand! and all paid in ready money. As far as Sir Felix could understand, directly the one operation had been perfected the thousand pounds would be available for another. As he looked into it with all his intelligence he thought that he began to perceive that that was the way in which the Melmottes of the world made their money. There was but one objection. He had not got the entire thousand pounds. But luck had been on the whole very good to him. He had more than the half of it in real money, lying at a bank in the city at which he had opened an account. And he had very much more than the remainder in I. O. U.'s from Dolly Longestaffe and Miles Grendall. In fact if every man had his own,--and his bosom glowed with indignation as he reflected on the injustice with which he was kept out of his own,--he could go into the city and take up his shares to-morrow, and still have ready money at his command. If he could do this, would not such conduct on his part be the best refutation of that charge of not having any fortune which Melmotte had brought against him? He would endeavour to work the money out of Dolly Longestaffe;--and he entertained an idea that though it would be impossible to get cash from Miles Grendall, he might use his claim against Miles in the city. Miles was Secretary to the Board, and might perhaps contrive that the money required for the shares should not be all ready money. Sir Felix was not very clear about it, but thought that he might possibly in this way use the indebtedness of Miles Grendall. \"How I do hate a fellow who does not pay up,\" he said to himself as he sat alone in his club, waiting for some friend to come in. And he formed in his head Draconic laws which he would fain have executed upon men who lost money at play and did not pay. \"How the deuce fellows can look one in the face, is what I can't understand,\" he said to himself.\nHe thought over this great stroke of exhibiting himself to Melmotte as a capitalist till he gave up his idea of abandoning his suit. So he wrote a note to Marie Melmotte in accordance with her instructions.\nDEAR M.,\nYour father cut up very rough,--about money. Perhaps you had better see him yourself; or would your mother?\nYours always,\nF.\nThis, as directed, he put under cover to Madame Didon,--Grosvenor Square, and posted at the club. He had put nothing at any rate in the letter which could commit him.\nThere was generally on Sundays a house dinner, so called, at eight o'clock. Five or six men would sit down, and would always gamble afterwards. On this occasion Dolly Longestaffe sauntered in at about seven in quest of sherry and bitters, and Felix found the opportunity a good one to speak of his money. \"You couldn't cash your I. O. U.'s for me to-morrow;--could you?\"\n\"To-morrow! oh, lord!\"\n\"I'll tell you why. You know I'd tell you anything because I think we are really friends. I'm after that daughter of Melmotte's.\"\n\"I'm told you're to have her.\"\n\"I don't know about that. I mean to try at any rate. I've gone in you know for that Board in the city.\"\n\"I don't know anything about Boards, my boy.\"\n\"Yes, you do, Dolly. You remember that American fellow, Montague's friend, that was here one night and won all our money.\"\n\"The chap that had the waistcoat, and went away in the morning to California. Fancy starting to California after a hard night. I always wondered whether he got there alive.\"\n\"Well;--I can't explain to you all about it, because you hate those kinds of things.\"\n\"And because I am such a fool.\"\n\"I don't think you're a fool at all, but it would take a week. But it's absolutely essential for me to take up a lot of shares in the city to-morrow;--or perhaps Wednesday might do. I'm bound to pay for them, and old Melmotte will think that I'm utterly hard up if I don't. Indeed he said as much, and the only objection about me and this girl of his is as to money. Can't you understand, now, how important it may be?\"\n\"It's always important to have a lot of money. I know that.\"\n\"I shouldn't have gone in for this kind of thing if I hadn't thought I was sure. You know how much you owe me, don't you?\"\n\"Not in the least.\"\n\"It's about eleven hundred pounds!\"\n\"I shouldn't wonder.\"\n\"And Miles Grendall owes me two thousand. Grasslough and Nidderdale when they lose always pay with Miles's I. O. U.'s.\"\n\"So should I, if I had them.\"\n\"It'll come to that soon that there won't be any other stuff going, and they really ain't worth anything. I don't see what's the use of playing when this rubbish is shoved about the table. As for Grendall himself, he has no feeling about it.\"\n\"Not the least, I should say.\"\n\"You'll try and get me the money, won't you, Dolly?\"\n\"Melmotte has been at me twice. He wants me to agree to sell something. He's an old thief, and of course he means to rob me. You may tell him that if he'll let me have the money in the way I've proposed, you are to have a thousand pounds out of it. I don't know any other way.\"\n\"You could write me that,--in a business sort of way.\"\n\"I couldn't do that, Carbury. What's the use? I never write any letters. I can't do it. You tell him that; and if the sale comes off, I'll make it straight.\"\nMiles Grendall also dined there, and after dinner, in the smoking-room, Sir Felix tried to do a little business with the Secretary. He began his operations with unusual courtesy, believing that the man must have some influence with the great distributor of shares. \"I'm going to take up my shares in that company,\" said Sir Felix.\n\"Ah;--indeed.\" And Miles enveloped himself from head to foot in smoke.\n\"I didn't quite understand about it, but Nidderdale saw Melmotte and he has explained it. I think I shall go in for a couple of thousand on Wednesday.\"\n\"Oh;--ah.\"\n\"It will be the proper thing to do;--won't it?\"\n\"Very good--thing to do!\" Miles Grendall smoked harder and harder as the suggestions were made to him.\n\"Is it always ready money?\"\n\"Always ready money,\" said Miles shaking his head, as though in reprobation of so abominable an institution.\n\"I suppose they allow some time to their own Directors, if a deposit, say 50 per cent., is made for the shares?\"\n\"They'll give you half the number, which would come to the same thing.\"\nSir Felix turned this over in his mind, but let him look at it as he would, could not see the truth of his companion's remark. \"You know I should want to sell again,--for the rise.\"\n\"Oh; you'll want to sell again.\"\n\"And therefore I must have the full number.\"\n\"You could sell half the number, you know,\" said Miles.\n\"I'm determined to begin with ten shares;--that's 1,000. Well;--I have got the money, but I don't want to draw out so much. Couldn't you manage for me that I should get them on paying 50 per cent. down?\"\n\"Melmotte does all that himself.\"\n\"You could explain, you know, that you are a little short in your own payments to me.\" This Sir Felix said, thinking it to be a delicate mode of introducing his claim upon the Secretary.\n\"That's private,\" said Miles frowning.\n\"Of course it's private; but if you would pay me the money I could buy the shares with it, though they are public.\"\n\"I don't think we could mix the two things together, Carbury.\"\n\"You can't help me?\"\n\"Not in that way.\"\n\"Then, when the deuce will you pay me what you owe me?\" Sir Felix was driven to this plain expression of his demand by the impassibility of his debtor. Here was a man who did not pay his debts of honour, who did not even propose any arrangement for paying them, and who yet had the impudence to talk of not mixing up private matters with affairs of business! It made the young baronet very sick. Miles Grendall smoked on in silence. There was a difficulty in answering the question, and he therefore made no answer. \"Do you know how much you owe me?\" continued the baronet, determined to persist now that he had commenced the attack. There was a little crowd of other men in the room, and the conversation about the shares had been commenced in an under-tone. These two last questions Sir Felix had asked in a whisper, but his countenance showed plainly that he was speaking in anger.\n\"Of course I know,\" said Miles.\n\"Well?\"\n\"I'm not going to talk about it here.\"\n\"Not going to talk about it here?\"\n\"No. This is a public room.\"\n\"I am going to talk about it,\" said Sir Felix, raising his voice.\n\"Will any fellow come up-stairs and play a game of billiards?\" said Miles Grendall rising from his chair. Then he walked slowly out of the room, leaving Sir Felix to take what revenge he pleased. For a moment Sir Felix thought that he would expose the transaction to the whole room; but he was afraid, thinking that Miles Grendall was a more popular man than himself.\nIt was Sunday night; but not the less were the gamblers assembled in the card-room at about eleven. Dolly Longestaffe was there, and with him the two lords, and Sir Felix, and Miles Grendall of course, and, I regret to say, a much better man than any of them, Paul Montague. Sir Felix had doubted much as to the propriety of joining the party. What was the use of playing with a man who seemed by general consent to be liberated from any obligation to pay? But then if he did not play with him, where should he find another gambling table? They began with whist, but soon laid that aside and devoted themselves to loo. The least respected man in that confraternity was Grendall, and yet it was in compliance with the persistency of his suggestion that they gave up the nobler game. \"Let's stick to whist; I like cutting out,\" said Grasslough. \"It's much more jolly having nothing to do now and then; one can always bet,\" said Dolly shortly afterwards. \"I hate loo,\" said Sir Felix in answer to a third application. \"I like whist best,\" said Nidderdale, \"but I'll play anything anybody likes;--pitch and toss if you please.\" But Miles Grendall had his way, and loo was the game.\nAt about two o'clock Grendall was the only winner. The play had not been very high, but nevertheless he had won largely. Whenever a large pool had collected itself he swept it into his garners. The men opposed to him hardly grudged him this stroke of luck. He had hitherto been unlucky; and they were able to pay him with his own paper, which was so valueless that they parted with it without a pang. Even Dolly Longestaffe seemed to have a supply of it. The only man there not so furnished was Montague, and while the sums won were quite small he was allowed to pay with cash. But to Sir Felix it was frightful to see ready money going over to Miles Grendall, as under no circumstances could it be got back from him. \"Montague,\" he said, \"just change these for the time. I'll take them back, if you still have them when we've done.\" And he handed a lot of Miles's paper across the table. The result of course would be that Felix would receive so much real money, and that Miles would get back more of his own worthless paper. To Montague it would make no difference, and he did as he was asked;--or rather was preparing to do so, when Miles interfered. On what principle of justice could Sir Felix come between him and another man? \"I don't understand this kind of thing,\" he said. \"When I win from you, Carbury, I'll take my I. O. U.'s, as long as you have any.\"\n\"By George, that's kind.\"\n\"But I won't have them handed about the table to be changed.\"\n\"Pay them yourself, then,\" said Sir Felix, laying a handful down on the table.\n\"Don't let's have a row,\" said Lord Nidderdale.\n\"Carbury is always making a row,\" said Grasslough.\n\"Of course he is,\" said Miles Grendall.\n\"I don't make more row than anybody else; but I do say that as we have such a lot of these things, and as we all know that we don't get cash for them as we want it, Grendall shouldn't take money and walk off with it.\"\n\"Who is walking off?\" said Miles.\n\"And why should you be entitled to Montague's money more than any of us?\" asked Grasslough.\nThe matter was debated, and was thus decided. It was not to be allowed that Miles's paper should be negotiated at the table in the manner that Sir Felix had attempted to adopt. But Mr. Grendall pledged his honour that when they broke up the party he would apply any money that he might have won to the redemption of his I. O. U.'s, paying a regular percentage to the holders of them. The decision made Sir Felix very cross. He knew that their condition at six or seven in the morning would not be favourable to such commercial accuracy,--which indeed would require an accountant to effect it; and he felt sure that Miles, if still a winner, would in truth walk off with the ready money.\nFor a considerable time he did not speak, and became very moderate in his play, tossing his cards about, almost always losing, but losing a minimum, and watching the board. He was sitting next to Grendall, and he thought that he observed that his neighbour moved his chair farther and farther away from him, and nearer to Dolly Longestaffe, who was next to him on the other side. This went on for an hour, during which Grendall still won,--and won heavily from Paul Montague. \"I never saw a fellow have such a run of luck in my life,\" said Grasslough. \"You've had two trumps dealt to you every hand almost since we began!\"\n\"Ever so many hands I haven't played at all,\" said Miles.\n\"You've always won when I've played,\" said Dolly. \"I've been looed every time.\"\n\"You oughtn't to begrudge me one run of luck, when I've lost so much,\" said Miles, who, since he began, had destroyed paper counters of his own making, supposed to represent considerably above 1,000, and had also,--which was of infinitely greater concern to him,--received an amount of ready money which was quite a godsend to him.\n\"What's the good of talking about it?\" said Nidderdale. \"I hate all this row about winning and losing. Let's go on, or go to bed.\" The idea of going to bed was absurd. So they went on. Sir Felix, however, hardly spoke at all, played very little, and watched Miles Grendall without seeming to watch him. At last he felt certain that he saw a card go into the man's sleeve, and remembered at the moment that the winner had owed his success to a continued run of aces. He was tempted to rush at once upon the player, and catch the card on his person. But he feared. Grendall was a big man; and where would he be if there should be no card there? And then, in the scramble, there would certainly be at any rate a doubt. And he knew that the men around him would be most unwilling to believe such an accusation. Grasslough was Grendall's friend, and Nidderdale and Dolly Longestaffe would infinitely rather be cheated than suspect any one of their own set of cheating them. He feared both the violence of the man he should accuse, and also the impassive good humour of the others. He let that opportunity pass by, again watched, and again saw the card abstracted. Thrice he saw it, till it was wonderful to him that others also should not see it. As often as the deal came round, the man did it. Felix watched more closely, and was certain that in each round the man had an ace at least once. It seemed to him that nothing could be easier. At last he pleaded a headache, got up, and went away, leaving the others playing. He had lost nearly a thousand pounds, but it had been all in paper. \"There's something the matter with that fellow,\" said Grasslough.\n\"There's always something the matter with him, I think,\" said Miles. \"He is so awfully greedy about his money.\" Miles had become somewhat triumphant in his success.\n\"The less said about that, Grendall, the better,\" said Nidderdale. \"We have put up with a good deal, you know, and he has put up with as much as anybody.\" Miles was cowed at once, and went on dealing without manoeuvring a card on that hand.",
        "paragraph_chars": [
            [
                0,
                1178
            ],
            [
                1178,
                3776
            ],
            [
                3776,
                3983
            ],
            [
                3983,
                3992
            ],
            [
                3992,
                4100
            ],
            [
                4100,
                4114
            ],
            [
                4114,
                4117
            ],
            [
                4117,
                4284
            ],
            [
                4284,
                4655
            ],
            [
                4655,
                4678
            ],
            [
                4678,
                4808
            ],
            [
                4808,
                4839
            ],
            [
                4839,
                4943
            ],
            [
                4943,
                4989
            ],
            [
                4989,
                5112
            ],
            [
                5112,
                5286
            ],
            [
                5286,
                5372
            ],
            [
                5372,
                5404
            ],
            [
                5404,
                5824
            ],
            [
                5824,
                5885
            ],
            [
                5885,
                6008
            ],
            [
                6008,
                6028
            ],
            [
                6028,
                6064
            ],
            [
                6064,
                6086
            ],
            [
                6086,
                6206
            ],
            [
                6206,
                6236
            ],
            [
                6236,
                6479
            ],
            [
                6479,
                6510
            ],
            [
                6510,
                6563
            ],
            [
                6563,
                6841
            ],
            [
                6841,
                6896
            ],
            [
                6896,
                7054
            ],
            [
                7054,
                7385
            ],
            [
                7385,
                7456
            ],
            [
                7456,
                7608
            ],
            [
                7608,
                7619
            ],
            [
                7619,
                7667
            ],
            [
                7667,
                7770
            ],
            [
                7770,
                7798
            ],
            [
                7798,
                7907
            ],
            [
                7907,
                8020
            ],
            [
                8020,
                8092
            ],
            [
                8092,
                8274
            ],
            [
                8274,
                8307
            ],
            [
                8307,
                8352
            ],
            [
                8352,
                8408
            ],
            [
                8408,
                8612
            ],
            [
                8612,
                8646
            ],
            [
                8646,
                8833
            ],
            [
                8833,
                8872
            ],
            [
                8872,
                8988
            ],
            [
                8988,
                9051
            ],
            [
                9051,
                9072
            ],
            [
                9072,
                9091
            ],
            [
                9091,
                9976
            ],
            [
                9976,
                10008
            ],
            [
                10008,
                10016
            ],
            [
                10016,
                10055
            ],
            [
                10055,
                10090
            ],
            [
                10090,
                10119
            ],
            [
                10119,
                10185
            ],
            [
                10185,
                10553
            ],
            [
                10553,
                11731
            ],
            [
                11731,
                13096
            ],
            [
                13096,
                13122
            ],
            [
                13122,
                13184
            ],
            [
                13184,
                13263
            ],
            [
                13263,
                13311
            ],
            [
                13311,
                13362
            ],
            [
                13362,
                13402
            ],
            [
                13402,
                13620
            ],
            [
                13620,
                13654
            ],
            [
                13654,
                13746
            ],
            [
                13746,
                14433
            ],
            [
                14433,
                15056
            ],
            [
                15056,
                15114
            ],
            [
                15114,
                15194
            ],
            [
                15194,
                15526
            ],
            [
                15526,
                17177
            ],
            [
                17177,
                17342
            ],
            [
                17342,
                17582
            ]
        ],
        "segment_chars": [
            [
                0,
                189
            ],
            [
                189,
                232
            ],
            [
                232,
                272
            ],
            [
                272,
                385
            ],
            [
                385,
                444
            ],
            [
                444,
                538
            ],
            [
                538,
                589
            ],
            [
                589,
                732
            ],
            [
                732,
                778
            ],
            [
                778,
                829
            ],
            [
                829,
                914
            ],
            [
                914,
                1024
            ],
            [
                1024,
                1178
            ],
            [
                1178,
                1201
            ],
            [
                1201,
                1346
            ],
            [
                1346,
                1376
            ],
            [
                1376,
                1450
            ],
            [
                1450,
                1511
            ],
            [
                1511,
                1548
            ],
            [
                1548,
                1621
            ],
            [
                1621,
                1709
            ],
            [
                1709,
                1767
            ],
            [
                1767,
                1823
            ],
            [
                1823,
                1853
            ],
            [
                1853,
                1872
            ],
            [
                1872,
                1892
            ],
            [
                1892,
                1921
            ],
            [
                1921,
                2057
            ],
            [
                2057,
                2217
            ],
            [
                2217,
                2246
            ],
            [
                2246,
                2289
            ],
            [
                2289,
                2338
            ],
            [
                2338,
                2448
            ],
            [
                2448,
                2502
            ],
            [
                2502,
                2504
            ],
            [
                2504,
                2550
            ],
            [
                2550,
                2799
            ],
            [
                2799,
                2959
            ],
            [
                2959,
                3168
            ],
            [
                3168,
                3299
            ],
            [
                3299,
                3425
            ],
            [
                3425,
                3555
            ],
            [
                3555,
                3678
            ],
            [
                3678,
                3776
            ],
            [
                3776,
                3909
            ],
            [
                3909,
                3983
            ],
            [
                3983,
                3992
            ],
            [
                3992,
                4037
            ],
            [
                4037,
                4100
            ],
            [
                4100,
                4114
            ],
            [
                4114,
                4117
            ],
            [
                4117,
                4215
            ],
            [
                4215,
                4284
            ],
            [
                4284,
                4360
            ],
            [
                4360,
                4428
            ],
            [
                4428,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4621
            ],
            [
                4621,
                4655
            ],
            [
                4655,
                4667
            ],
            [
                4667,
                4678
            ],
            [
                4678,
                4698
            ],
            [
                4698,
                4768
            ],
            [
                4768,
                4808
            ],
            [
                4808,
                4839
            ],
            [
                4839,
                4865
            ],
            [
                4865,
                4892
            ],
            [
                4892,
                4943
            ],
            [
                4943,
                4989
            ],
            [
                4989,
                5010
            ],
            [
                5010,
                5112
            ],
            [
                5112,
                5190
            ],
            [
                5190,
                5239
            ],
            [
                5239,
                5286
            ],
            [
                5286,
                5372
            ],
            [
                5372,
                5404
            ],
            [
                5404,
                5467
            ],
            [
                5467,
                5586
            ],
            [
                5586,
                5678
            ],
            [
                5678,
                5771
            ],
            [
                5771,
                5824
            ],
            [
                5824,
                5871
            ],
            [
                5871,
                5885
            ],
            [
                5885,
                5966
            ],
            [
                5966,
                6008
            ],
            [
                6008,
                6028
            ],
            [
                6028,
                6064
            ],
            [
                6064,
                6086
            ],
            [
                6086,
                6128
            ],
            [
                6128,
                6199
            ],
            [
                6199,
                6206
            ],
            [
                6206,
                6236
            ],
            [
                6236,
                6342
            ],
            [
                6342,
                6425
            ],
            [
                6425,
                6479
            ],
            [
                6479,
                6510
            ],
            [
                6510,
                6563
            ],
            [
                6563,
                6595
            ],
            [
                6595,
                6635
            ],
            [
                6635,
                6688
            ],
            [
                6688,
                6812
            ],
            [
                6812,
                6841
            ],
            [
                6841,
                6896
            ],
            [
                6896,
                6926
            ],
            [
                6926,
                6942
            ],
            [
                6942,
                6969
            ],
            [
                6969,
                6984
            ],
            [
                6984,
                7054
            ],
            [
                7054,
                7186
            ],
            [
                7186,
                7319
            ],
            [
                7319,
                7385
            ],
            [
                7385,
                7400
            ],
            [
                7400,
                7456
            ],
            [
                7456,
                7546
            ],
            [
                7546,
                7608
            ],
            [
                7608,
                7619
            ],
            [
                7619,
                7667
            ],
            [
                7667,
                7693
            ],
            [
                7693,
                7770
            ],
            [
                7770,
                7798
            ],
            [
                7798,
                7907
            ],
            [
                7907,
                8020
            ],
            [
                8020,
                8092
            ],
            [
                8092,
                8219
            ],
            [
                8219,
                8274
            ],
            [
                8274,
                8307
            ],
            [
                8307,
                8352
            ],
            [
                8352,
                8408
            ],
            [
                8408,
                8465
            ],
            [
                8465,
                8532
            ],
            [
                8532,
                8605
            ],
            [
                8605,
                8612
            ],
            [
                8612,
                8646
            ],
            [
                8646,
                8733
            ],
            [
                8733,
                8833
            ],
            [
                8833,
                8872
            ],
            [
                8872,
                8988
            ],
            [
                8988,
                9051
            ],
            [
                9051,
                9072
            ],
            [
                9072,
                9091
            ],
            [
                9091,
                9147
            ],
            [
                9147,
                9243
            ],
            [
                9243,
                9450
            ],
            [
                9450,
                9487
            ],
            [
                9487,
                9524
            ],
            [
                9524,
                9607
            ],
            [
                9607,
                9642
            ],
            [
                9642,
                9725
            ],
            [
                9725,
                9851
            ],
            [
                9851,
                9976
            ],
            [
                9976,
                10008
            ],
            [
                10008,
                10016
            ],
            [
                10016,
                10055
            ],
            [
                10055,
                10090
            ],
            [
                10090,
                10095
            ],
            [
                10095,
                10119
            ],
            [
                10119,
                10185
            ],
            [
                10185,
                10248
            ],
            [
                10248,
                10291
            ],
            [
                10291,
                10381
            ],
            [
                10381,
                10553
            ],
            [
                10553,
                10653
            ],
            [
                10653,
                10828
            ],
            [
                10828,
                10897
            ],
            [
                10897,
                11010
            ],
            [
                11010,
                11093
            ],
            [
                11093,
                11172
            ],
            [
                11172,
                11335
            ],
            [
                11335,
                11396
            ],
            [
                11396,
                11505
            ],
            [
                11505,
                11568
            ],
            [
                11568,
                11677
            ],
            [
                11677,
                11731
            ],
            [
                11731,
                11782
            ],
            [
                11782,
                11852
            ],
            [
                11852,
                11925
            ],
            [
                11925,
                11988
            ],
            [
                11988,
                12132
            ],
            [
                12132,
                12186
            ],
            [
                12186,
                12309
            ],
            [
                12309,
                12449
            ],
            [
                12449,
                12503
            ],
            [
                12503,
                12565
            ],
            [
                12565,
                12620
            ],
            [
                12620,
                12758
            ],
            [
                12758,
                12885
            ],
            [
                12885,
                12964
            ],
            [
                12964,
                13014
            ],
            [
                13014,
                13064
            ],
            [
                13064,
                13066
            ],
            [
                13066,
                13096
            ],
            [
                13096,
                13122
            ],
            [
                13122,
                13184
            ],
            [
                13184,
                13263
            ],
            [
                13263,
                13311
            ],
            [
                13311,
                13362
            ],
            [
                13362,
                13402
            ],
            [
                13402,
                13620
            ],
            [
                13620,
                13642
            ],
            [
                13642,
                13654
            ],
            [
                13654,
                13728
            ],
            [
                13728,
                13746
            ],
            [
                13746,
                13792
            ],
            [
                13792,
                13923
            ],
            [
                13923,
                14072
            ],
            [
                14072,
                14074
            ],
            [
                14074,
                14130
            ],
            [
                14130,
                14170
            ],
            [
                14170,
                14433
            ],
            [
                14433,
                14606
            ],
            [
                14606,
                14813
            ],
            [
                14813,
                14909
            ],
            [
                14909,
                14985
            ],
            [
                14985,
                15056
            ],
            [
                15056,
                15114
            ],
            [
                15114,
                15164
            ],
            [
                15164,
                15194
            ],
            [
                15194,
                15526
            ],
            [
                15526,
                15565
            ],
            [
                15565,
                15582
            ],
            [
                15582,
                15629
            ],
            [
                15629,
                15657
            ],
            [
                15657,
                15694
            ],
            [
                15694,
                15711
            ],
            [
                15711,
                15829
            ],
            [
                15829,
                15992
            ],
            [
                15992,
                16074
            ],
            [
                16074,
                16089
            ],
            [
                16089,
                16169
            ],
            [
                16169,
                16242
            ],
            [
                16242,
                16333
            ],
            [
                16333,
                16495
            ],
            [
                16495,
                16602
            ],
            [
                16602,
                16685
            ],
            [
                16685,
                16768
            ],
            [
                16768,
                16817
            ],
            [
                16817,
                16914
            ],
            [
                16914,
                16961
            ],
            [
                16961,
                17043
            ],
            [
                17043,
                17111
            ],
            [
                17111,
                17177
            ],
            [
                17177,
                17246
            ],
            [
                17246,
                17289
            ],
            [
                17289,
                17342
            ],
            [
                17342,
                17409
            ],
            [
                17409,
                17497
            ],
            [
                17497,
                17582
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                40,
                72
            ],
            [
                75,
                116
            ],
            [
                121,
                130
            ],
            [
                187,
                189
            ],
            [
                189,
                232
            ],
            [
                232,
                272
            ],
            [
                444,
                504
            ],
            [
                506,
                538
            ],
            [
                778,
                790
            ],
            [
                805,
                808
            ],
            [
                710,
                717
            ],
            [
                634,
                650
            ],
            [
                666,
                673
            ],
            [
                827,
                829
            ],
            [
                829,
                835
            ],
            [
                838,
                870
            ],
            [
                881,
                914
            ],
            [
                1027,
                1105
            ],
            [
                1119,
                1178
            ],
            [
                1178,
                1201
            ],
            [
                1201,
                1244
            ],
            [
                1280,
                1346
            ],
            [
                1351,
                1376
            ],
            [
                1376,
                1449
            ],
            [
                1450,
                1511
            ],
            [
                1511,
                1548
            ],
            [
                1548,
                1601
            ],
            [
                1605,
                1606
            ],
            [
                1613,
                1619
            ],
            [
                1738,
                1751
            ],
            [
                1761,
                1765
            ],
            [
                1752,
                1756
            ],
            [
                1798,
                1801
            ],
            [
                1826,
                1853
            ],
            [
                1853,
                1858
            ],
            [
                1859,
                1860
            ],
            [
                1863,
                1872
            ],
            [
                1872,
                1892
            ],
            [
                1892,
                1895
            ],
            [
                1900,
                1921
            ],
            [
                1921,
                1958
            ],
            [
                1972,
                1994
            ],
            [
                2005,
                2056
            ],
            [
                2217,
                2226
            ],
            [
                2231,
                2246
            ],
            [
                2246,
                2260
            ],
            [
                2272,
                2289
            ],
            [
                2289,
                2306
            ],
            [
                2325,
                2336
            ],
            [
                2383,
                2384
            ],
            [
                2338,
                2354
            ],
            [
                2359,
                2363
            ],
            [
                2385,
                2412
            ],
            [
                2446,
                2448
            ],
            [
                2448,
                2501
            ],
            [
                2504,
                2550
            ],
            [
                2550,
                2557
            ],
            [
                2582,
                2583
            ],
            [
                2558,
                2570
            ],
            [
                2693,
                2694
            ],
            [
                2696,
                2704
            ],
            [
                2726,
                2744
            ],
            [
                2797,
                2799
            ],
            [
                2820,
                2825
            ],
            [
                2881,
                2885
            ],
            [
                2826,
                2829
            ],
            [
                2925,
                2933
            ],
            [
                2886,
                2918
            ],
            [
                2957,
                2959
            ],
            [
                2959,
                2967
            ],
            [
                2978,
                2980
            ],
            [
                2986,
                3021
            ],
            [
                3023,
                3026
            ],
            [
                3055,
                3154
            ],
            [
                3174,
                3205
            ],
            [
                3212,
                3298
            ],
            [
                3490,
                3499
            ],
            [
                3506,
                3518
            ],
            [
                3776,
                3809
            ],
            [
                3860,
                3909
            ],
            [
                3909,
                3945
            ],
            [
                3983,
                3992
            ],
            [
                3992,
                4021
            ],
            [
                4024,
                4037
            ],
            [
                4037,
                4100
            ],
            [
                4100,
                4114
            ],
            [
                4114,
                4117
            ],
            [
                4117,
                4138
            ],
            [
                4155,
                4170
            ],
            [
                4189,
                4214
            ],
            [
                4304,
                4314
            ],
            [
                4284,
                4303
            ],
            [
                4315,
                4360
            ],
            [
                4360,
                4395
            ],
            [
                4409,
                4428
            ],
            [
                4428,
                4490
            ],
            [
                4521,
                4532
            ],
            [
                4589,
                4621
            ],
            [
                4621,
                4630
            ],
            [
                4640,
                4641
            ],
            [
                4643,
                4655
            ],
            [
                4655,
                4656
            ],
            [
                4665,
                4667
            ],
            [
                4667,
                4678
            ],
            [
                4678,
                4696
            ],
            [
                4729,
                4736
            ],
            [
                4698,
                4701
            ],
            [
                4766,
                4768
            ],
            [
                4768,
                4808
            ],
            [
                4808,
                4839
            ],
            [
                4839,
                4865
            ],
            [
                4865,
                4878
            ],
            [
                4890,
                4892
            ],
            [
                4892,
                4904
            ],
            [
                4914,
                4943
            ],
            [
                4943,
                4989
            ],
            [
                5286,
                5291
            ],
            [
                5329,
                5330
            ],
            [
                5445,
                5465
            ],
            [
                5310,
                5312
            ],
            [
                5302,
                5309
            ],
            [
                5327,
                5329
            ],
            [
                5436,
                5440
            ],
            [
                5467,
                5542
            ],
            [
                5291,
                5292
            ],
            [
                5555,
                5575
            ],
            [
                5584,
                5586
            ],
            [
                5617,
                5676
            ],
            [
                5599,
                5611
            ],
            [
                5676,
                5678
            ],
            [
                5771,
                5824
            ],
            [
                5824,
                5871
            ],
            [
                5871,
                5885
            ],
            [
                5966,
                6008
            ],
            [
                6008,
                6028
            ],
            [
                6028,
                6064
            ],
            [
                6064,
                6086
            ],
            [
                6086,
                6128
            ],
            [
                6128,
                6153
            ],
            [
                6169,
                6179
            ],
            [
                6180,
                6203
            ],
            [
                6308,
                6312
            ],
            [
                6320,
                6325
            ],
            [
                6313,
                6319
            ],
            [
                6326,
                6342
            ],
            [
                6342,
                6425
            ],
            [
                6511,
                6563
            ],
            [
                6563,
                6593
            ],
            [
                6593,
                6595
            ],
            [
                6595,
                6635
            ],
            [
                6635,
                6657
            ],
            [
                6668,
                6688
            ],
            [
                6688,
                6812
            ],
            [
                6812,
                6841
            ],
            [
                6841,
                6857
            ],
            [
                6861,
                6865
            ],
            [
                6868,
                6881
            ],
            [
                6893,
                6896
            ],
            [
                6896,
                6907
            ],
            [
                6915,
                6926
            ],
            [
                6942,
                6955
            ],
            [
                6960,
                6969
            ],
            [
                6984,
                7001
            ],
            [
                7007,
                7054
            ],
            [
                7054,
                7090
            ],
            [
                7105,
                7124
            ],
            [
                7091,
                7103
            ],
            [
                7124,
                7170
            ],
            [
                7231,
                7247
            ],
            [
                7186,
                7188
            ],
            [
                7256,
                7285
            ],
            [
                7184,
                7185
            ],
            [
                7319,
                7384
            ],
            [
                7456,
                7457
            ],
            [
                7497,
                7546
            ],
            [
                7546,
                7608
            ],
            [
                7608,
                7612
            ],
            [
                7614,
                7619
            ],
            [
                7619,
                7653
            ],
            [
                7656,
                7667
            ],
            [
                7667,
                7677
            ],
            [
                7679,
                7693
            ],
            [
                7693,
                7721
            ],
            [
                7768,
                7770
            ],
            [
                7770,
                7798
            ],
            [
                7798,
                7830
            ],
            [
                7847,
                7848
            ],
            [
                7831,
                7847
            ],
            [
                7905,
                7907
            ],
            [
                7907,
                7992
            ],
            [
                7995,
                8020
            ],
            [
                8020,
                8092
            ],
            [
                8092,
                8135
            ],
            [
                8168,
                8194
            ],
            [
                8152,
                8154
            ],
            [
                8217,
                8219
            ],
            [
                8219,
                8256
            ],
            [
                8259,
                8274
            ],
            [
                8274,
                8307
            ],
            [
                8408,
                8410
            ],
            [
                8424,
                8449
            ],
            [
                8451,
                8465
            ],
            [
                8472,
                8532
            ],
            [
                8532,
                8603
            ],
            [
                8612,
                8646
            ],
            [
                8646,
                8733
            ],
            [
                8742,
                8747
            ],
            [
                8733,
                8737
            ],
            [
                8772,
                8782
            ],
            [
                8788,
                8833
            ],
            [
                8833,
                8861
            ],
            [
                8862,
                8872
            ],
            [
                8872,
                8953
            ],
            [
                8985,
                8988
            ],
            [
                8988,
                9051
            ],
            [
                9091,
                9096
            ],
            [
                9098,
                9125
            ],
            [
                9129,
                9147
            ],
            [
                9151,
                9156
            ],
            [
                9241,
                9242
            ],
            [
                9487,
                9523
            ],
            [
                9607,
                9642
            ],
            [
                9642,
                9686
            ],
            [
                9723,
                9725
            ],
            [
                9725,
                9779
            ],
            [
                9890,
                9895
            ],
            [
                9851,
                9856
            ],
            [
                9866,
                9875
            ],
            [
                9896,
                9913
            ],
            [
                9950,
                9956
            ],
            [
                9937,
                9944
            ],
            [
                9974,
                9976
            ],
            [
                9976,
                10007
            ],
            [
                10016,
                10052
            ],
            [
                10103,
                10119
            ],
            [
                10119,
                10185
            ],
            [
                10185,
                10206
            ],
            [
                10217,
                10248
            ],
            [
                10248,
                10267
            ],
            [
                10268,
                10291
            ],
            [
                10291,
                10305
            ],
            [
                10313,
                10316
            ],
            [
                10306,
                10312
            ],
            [
                10379,
                10381
            ],
            [
                10381,
                10403
            ],
            [
                10433,
                10553
            ],
            [
                10596,
                10608
            ],
            [
                10591,
                10595
            ],
            [
                10609,
                10638
            ],
            [
                10645,
                10653
            ],
            [
                10653,
                10743
            ],
            [
                10753,
                10776
            ],
            [
                10813,
                10828
            ],
            [
                10828,
                10849
            ],
            [
                10886,
                10897
            ],
            [
                10897,
                10946
            ],
            [
                10966,
                10968
            ],
            [
                10991,
                11010
            ],
            [
                11010,
                11018
            ],
            [
                11048,
                11076
            ],
            [
                11086,
                11092
            ],
            [
                11093,
                11124
            ],
            [
                11164,
                11170
            ],
            [
                11222,
                11230
            ],
            [
                11170,
                11171
            ],
            [
                11335,
                11356
            ],
            [
                11376,
                11395
            ],
            [
                11505,
                11533
            ],
            [
                11566,
                11567
            ],
            [
                11568,
                11643
            ],
            [
                11674,
                11677
            ],
            [
                11687,
                11731
            ],
            [
                11731,
                11782
            ],
            [
                11955,
                11957
            ],
            [
                11944,
                11947
            ],
            [
                11982,
                11986
            ],
            [
                12016,
                12132
            ],
            [
                12186,
                12198
            ],
            [
                12222,
                12239
            ],
            [
                12246,
                12278
            ],
            [
                12298,
                12308
            ],
            [
                12309,
                12390
            ],
            [
                12447,
                12448
            ],
            [
                12449,
                12488
            ],
            [
                12565,
                12618
            ],
            [
                12650,
                12654
            ],
            [
                12661,
                12698
            ],
            [
                12704,
                12758
            ],
            [
                12761,
                12769
            ],
            [
                12838,
                12841
            ],
            [
                12852,
                12857
            ],
            [
                12810,
                12825
            ],
            [
                12860,
                12884
            ],
            [
                13014,
                13043
            ],
            [
                13043,
                13044
            ],
            [
                13045,
                13066
            ],
            [
                13066,
                13093
            ],
            [
                13123,
                13184
            ],
            [
                13184,
                13263
            ],
            [
                13263,
                13311
            ],
            [
                13311,
                13362
            ],
            [
                13362,
                13402
            ],
            [
                13402,
                13500
            ],
            [
                13567,
                13620
            ],
            [
                13620,
                13642
            ],
            [
                13642,
                13654
            ],
            [
                13654,
                13705
            ],
            [
                13725,
                13728
            ],
            [
                13728,
                13746
            ],
            [
                13746,
                13768
            ],
            [
                13770,
                13773
            ],
            [
                13792,
                13798
            ],
            [
                13783,
                13790
            ],
            [
                13817,
                13842
            ],
            [
                13799,
                13802
            ],
            [
                13843,
                13872
            ],
            [
                13921,
                13923
            ],
            [
                13923,
                14001
            ],
            [
                14008,
                14040
            ],
            [
                14044,
                14047
            ],
            [
                14059,
                14074
            ],
            [
                14074,
                14076
            ],
            [
                14128,
                14129
            ],
            [
                14130,
                14170
            ],
            [
                14170,
                14182
            ],
            [
                14202,
                14229
            ],
            [
                14230,
                14235
            ],
            [
                14311,
                14327
            ],
            [
                14337,
                14366
            ],
            [
                14297,
                14302
            ],
            [
                14402,
                14419
            ],
            [
                14426,
                14433
            ],
            [
                14433,
                14512
            ],
            [
                14564,
                14606
            ],
            [
                14606,
                14739
            ],
            [
                14811,
                14813
            ],
            [
                14813,
                14870
            ],
            [
                14873,
                14908
            ],
            [
                14909,
                14954
            ],
            [
                14965,
                14985
            ],
            [
                14985,
                15056
            ],
            [
                15114,
                15164
            ],
            [
                15164,
                15194
            ],
            [
                15194,
                15280
            ],
            [
                15298,
                15311
            ],
            [
                15330,
                15337
            ],
            [
                15355,
                15357
            ],
            [
                15327,
                15329
            ],
            [
                15387,
                15406
            ],
            [
                15458,
                15501
            ],
            [
                15508,
                15526
            ],
            [
                15526,
                15565
            ],
            [
                15565,
                15582
            ],
            [
                15629,
                15657
            ],
            [
                15657,
                15694
            ],
            [
                15694,
                15710
            ],
            [
                15711,
                15743
            ],
            [
                15770,
                15798
            ],
            [
                15827,
                15829
            ],
            [
                15829,
                15896
            ],
            [
                15990,
                15992
            ],
            [
                15992,
                16027
            ],
            [
                16038,
                16074
            ],
            [
                16094,
                16116
            ],
            [
                16135,
                16169
            ],
            [
                16242,
                16245
            ],
            [
                16259,
                16333
            ],
            [
                16333,
                16409
            ],
            [
                16421,
                16451
            ],
            [
                16456,
                16494
            ],
            [
                16605,
                16685
            ],
            [
                16685,
                16714
            ],
            [
                16725,
                16743
            ],
            [
                16756,
                16759
            ],
            [
                16766,
                16768
            ],
            [
                16823,
                16914
            ],
            [
                16961,
                17043
            ],
            [
                17043,
                17110
            ],
            [
                17111,
                17177
            ],
            [
                17177,
                17222
            ],
            [
                17231,
                17246
            ],
            [
                17246,
                17288
            ],
            [
                17342,
                17409
            ],
            [
                17409,
                17417
            ],
            [
                17418,
                17451
            ],
            [
                17494,
                17497
            ],
            [
                17497,
                17512
            ],
            [
                17520,
                17525
            ],
            [
                17542,
                17582
            ]
        ],
        "row_chars": [
            [
                0,
                189
            ],
            [
                189,
                232
            ],
            [
                232,
                272
            ],
            [
                272,
                385
            ],
            [
                385,
                444
            ],
            [
                444,
                538
            ],
            [
                538,
                589
            ],
            [
                589,
                829
            ],
            [
                829,
                914
            ],
            [
                914,
                1024
            ],
            [
                1024,
                1178
            ],
            [
                1178,
                1201
            ],
            [
                1201,
                1346
            ],
            [
                1346,
                1376
            ],
            [
                1376,
                1450
            ],
            [
                1450,
                1511
            ],
            [
                1511,
                1548
            ],
            [
                1548,
                1621
            ],
            [
                1621,
                1709
            ],
            [
                1709,
                1853
            ],
            [
                1853,
                1872
            ],
            [
                1872,
                1892
            ],
            [
                1892,
                1921
            ],
            [
                1921,
                2057
            ],
            [
                2057,
                2217
            ],
            [
                2217,
                2246
            ],
            [
                2246,
                2289
            ],
            [
                2289,
                2448
            ],
            [
                2448,
                2502
            ],
            [
                2502,
                2504
            ],
            [
                2504,
                2550
            ],
            [
                2550,
                2799
            ],
            [
                2799,
                2959
            ],
            [
                2959,
                3299
            ],
            [
                3299,
                3425
            ],
            [
                3425,
                3909
            ],
            [
                3909,
                3983
            ],
            [
                3983,
                3992
            ],
            [
                3992,
                4037
            ],
            [
                4037,
                4100
            ],
            [
                4100,
                4114
            ],
            [
                4114,
                4117
            ],
            [
                4117,
                4215
            ],
            [
                4215,
                4284
            ],
            [
                4284,
                4360
            ],
            [
                4360,
                4428
            ],
            [
                4428,
                4621
            ],
            [
                4621,
                4655
            ],
            [
                4655,
                4667
            ],
            [
                4667,
                4678
            ],
            [
                4678,
                4768
            ],
            [
                4768,
                4808
            ],
            [
                4808,
                4839
            ],
            [
                4839,
                4865
            ],
            [
                4865,
                4892
            ],
            [
                4892,
                4943
            ],
            [
                4943,
                4989
            ],
            [
                4989,
                5010
            ],
            [
                5010,
                5112
            ],
            [
                5112,
                5190
            ],
            [
                5190,
                5239
            ],
            [
                5239,
                5286
            ],
            [
                5286,
                5586
            ],
            [
                5586,
                5678
            ],
            [
                5678,
                5771
            ],
            [
                5771,
                5824
            ],
            [
                5824,
                5871
            ],
            [
                5871,
                5885
            ],
            [
                5885,
                5966
            ],
            [
                5966,
                6008
            ],
            [
                6008,
                6028
            ],
            [
                6028,
                6064
            ],
            [
                6064,
                6086
            ],
            [
                6086,
                6128
            ],
            [
                6128,
                6206
            ],
            [
                6206,
                6236
            ],
            [
                6236,
                6342
            ],
            [
                6342,
                6425
            ],
            [
                6425,
                6479
            ],
            [
                6479,
                6510
            ],
            [
                6510,
                6563
            ],
            [
                6563,
                6595
            ],
            [
                6595,
                6635
            ],
            [
                6635,
                6688
            ],
            [
                6688,
                6812
            ],
            [
                6812,
                6841
            ],
            [
                6841,
                6896
            ],
            [
                6896,
                6926
            ],
            [
                6926,
                6942
            ],
            [
                6942,
                6969
            ],
            [
                6969,
                6984
            ],
            [
                6984,
                7054
            ],
            [
                7054,
                7319
            ],
            [
                7319,
                7385
            ],
            [
                7385,
                7400
            ],
            [
                7400,
                7456
            ],
            [
                7456,
                7546
            ],
            [
                7546,
                7608
            ],
            [
                7608,
                7619
            ],
            [
                7619,
                7667
            ],
            [
                7667,
                7693
            ],
            [
                7693,
                7770
            ],
            [
                7770,
                7798
            ],
            [
                7798,
                7907
            ],
            [
                7907,
                8020
            ],
            [
                8020,
                8092
            ],
            [
                8092,
                8219
            ],
            [
                8219,
                8274
            ],
            [
                8274,
                8307
            ],
            [
                8307,
                8352
            ],
            [
                8352,
                8408
            ],
            [
                8408,
                8465
            ],
            [
                8465,
                8532
            ],
            [
                8532,
                8605
            ],
            [
                8605,
                8612
            ],
            [
                8612,
                8646
            ],
            [
                8646,
                8733
            ],
            [
                8733,
                8833
            ],
            [
                8833,
                8872
            ],
            [
                8872,
                8988
            ],
            [
                8988,
                9051
            ],
            [
                9051,
                9072
            ],
            [
                9072,
                9091
            ],
            [
                9091,
                9147
            ],
            [
                9147,
                9243
            ],
            [
                9243,
                9450
            ],
            [
                9450,
                9487
            ],
            [
                9487,
                9524
            ],
            [
                9524,
                9607
            ],
            [
                9607,
                9642
            ],
            [
                9642,
                9725
            ],
            [
                9725,
                9976
            ],
            [
                9976,
                10008
            ],
            [
                10008,
                10016
            ],
            [
                10016,
                10119
            ],
            [
                10119,
                10185
            ],
            [
                10185,
                10248
            ],
            [
                10248,
                10291
            ],
            [
                10291,
                10381
            ],
            [
                10381,
                10553
            ],
            [
                10553,
                10653
            ],
            [
                10653,
                10828
            ],
            [
                10828,
                10897
            ],
            [
                10897,
                11010
            ],
            [
                11010,
                11093
            ],
            [
                11093,
                11335
            ],
            [
                11335,
                11396
            ],
            [
                11396,
                11505
            ],
            [
                11505,
                11568
            ],
            [
                11568,
                11677
            ],
            [
                11677,
                11731
            ],
            [
                11731,
                11782
            ],
            [
                11782,
                11852
            ],
            [
                11852,
                11925
            ],
            [
                11925,
                12132
            ],
            [
                12132,
                12186
            ],
            [
                12186,
                12309
            ],
            [
                12309,
                12449
            ],
            [
                12449,
                12503
            ],
            [
                12503,
                12565
            ],
            [
                12565,
                12758
            ],
            [
                12758,
                12885
            ],
            [
                12885,
                12964
            ],
            [
                12964,
                13014
            ],
            [
                13014,
                13066
            ],
            [
                13066,
                13096
            ],
            [
                13096,
                13122
            ],
            [
                13122,
                13184
            ],
            [
                13184,
                13263
            ],
            [
                13263,
                13311
            ],
            [
                13311,
                13362
            ],
            [
                13362,
                13402
            ],
            [
                13402,
                13620
            ],
            [
                13620,
                13642
            ],
            [
                13642,
                13654
            ],
            [
                13654,
                13728
            ],
            [
                13728,
                13746
            ],
            [
                13746,
                13923
            ],
            [
                13923,
                14074
            ],
            [
                14074,
                14130
            ],
            [
                14130,
                14170
            ],
            [
                14170,
                14433
            ],
            [
                14433,
                14606
            ],
            [
                14606,
                14813
            ],
            [
                14813,
                14909
            ],
            [
                14909,
                14985
            ],
            [
                14985,
                15056
            ],
            [
                15056,
                15114
            ],
            [
                15114,
                15164
            ],
            [
                15164,
                15194
            ],
            [
                15194,
                15526
            ],
            [
                15526,
                15565
            ],
            [
                15565,
                15582
            ],
            [
                15582,
                15629
            ],
            [
                15629,
                15657
            ],
            [
                15657,
                15694
            ],
            [
                15694,
                15711
            ],
            [
                15711,
                15829
            ],
            [
                15829,
                15992
            ],
            [
                15992,
                16074
            ],
            [
                16074,
                16089
            ],
            [
                16089,
                16169
            ],
            [
                16169,
                16242
            ],
            [
                16242,
                16333
            ],
            [
                16333,
                16495
            ],
            [
                16495,
                16602
            ],
            [
                16602,
                16685
            ],
            [
                16685,
                16768
            ],
            [
                16768,
                16817
            ],
            [
                16817,
                16914
            ],
            [
                16914,
                16961
            ],
            [
                16961,
                17043
            ],
            [
                17043,
                17111
            ],
            [
                17111,
                17177
            ],
            [
                17177,
                17246
            ],
            [
                17246,
                17289
            ],
            [
                17289,
                17342
            ],
            [
                17342,
                17409
            ],
            [
                17409,
                17497
            ],
            [
                17497,
                17582
            ]
        ]
    },
    "abridged": {
        "text": "Sir Felix felt that he had been checkmated - and was at the same time full of wrath at Melmotte's insolence. As far as he could see, the game was over. No doubt he might marry Marie Melmotte. She was in love with him, which was natural; and was a fool, which was perhaps also natural. But Melmotte would not forgive his daughter for marrying without his consent. He was - so Sir Felix declared to himself - the greatest brute ever created. Sir Felix had found himself quite unable to stand up against Melmotte, and now he cursed the man as he was carried down to the Beargarden in a cab.\nBut what should he do? Should he abandon Marie Melmotte altogether, and drop the whole family, including the Great Mexican Railway? An idea occurred to him. Nidderdale had explained to him the result of his application for shares.\n\"You see we haven't bought any and therefore can't sell any. There seems to be something in that. I shall explain it all to my governor, and get him to let me have a thousand or two.\"\nSir Felix thought this over, and made a mental calculation. 12 10s. per 100! 125 for a thousand! and paid in ready money. As far as Sir Felix could understand, as soon as one operation had been completed the thousand pounds would be available for another.\nThere was just one objection. He had not got a thousand pounds. But luck had been good to him, and he had more than half that amount lying at a bank in the city. And he had very much more than the remainder in I.O.U.'s from Dolly Longestaffe and Miles Grendall. In fact, if every man paid up, he could take up his shares tomorrow. Would that not refute Melmotte's charge of not having any fortune? He would try to get the money out of Dolly Longestaffe; and though it would be impossible to get cash from Miles Grendall, he might use his claim against Miles, who was Secretary to the Board, and could perhaps contrive that the money required for the shares should not be all ready money.\nAs he sat in his club, he thought over this great stroke till he gave up his idea of abandoning his suit. So he wrote a note to Marie Melmotte:\nDear M.,\nYour father cut up very rough about money. Perhaps you had better see him yourself; or would your mother?\nYours always,\nF.\nThis, as directed, he addressed to Madame Didon, and posted at the club.\nOn Sundays there was generally a house dinner, so called, at eight o'clock. Five or six men would sit down, and gamble afterwards. On this occasion Dolly Longestaffe sauntered in at about seven, and Felix said, \"You couldn't cash your I.O.U.'s for me tomorrow; could you?\"\n\"Tomorrow! oh, lord!\"\n\"I'll tell you why, because you're a friend. I'm after that daughter of Melmotte's.\"\n\"I'm told you're to have her.\"\n\"I don't know about that. I mean to try. I've gone in for that Board in the city.\"\n\"I don't know anything about Boards, my boy.\"\n\"Well, it would take a week to explain it all, but it's absolutely essential for me to take up a lot of shares in the city tomorrow; or perhaps Wednesday. Old Melmotte will think that I'm utterly hard up if I don't pay for them. Can't you understand, now, how important it may be?\"\n\"It's always important to have a lot of money. I know that.\"\n\"You know how much you owe me, don't you?\"\n\"Not in the least.\"\n\"It's about eleven hundred pounds!\"\n\"I shouldn't wonder.\"\n\"And Miles Grendall owes me two thousand. Grasslough and Nidderdale always pay me with Miles's I.O.U.'s. They ain't really worth anything. I don't see what's the use of playing when this rubbish is shoved about the table. But you'll try and get me the money, won't you, Dolly?\"\n\"Melmotte has been at me twice,\" said Dolly Longestaffe. \"He wants me to agree to sell something. He's an old thief, and he means to rob me. You may tell him that if he'll let me have the money in the way I've proposed, you are to have a thousand pounds out of it. I don't know any other way.\"\n\"You could write that in a business letter.\"\n\"I couldn't, Carbury. I never write letters. You tell him that if the sale comes off, I'll make it straight.\"\nMiles Grendall also dined there, and in the smoking-room after dinner, Sir Felix tried to do a little business with him, believing that he must have some influence with Melmotte.\n\"I'm going to take up my shares in that company,\" said Sir Felix. \"Nidderdale saw Melmotte and he has explained it. I think I shall go in for a couple of thousand on Wednesday.\"\n\"Oh; ah.\"\n\"It will be the proper thing to do, won't it?\"\n\"Very good thing to do!\" Miles Grendall smoked harder.\n\"Is it always ready money?\"\n\"Always ready money,\" said Miles, shaking his head.\n\"I suppose they allow some time to their own Directors, if a deposit, say 50 per cent, is made for the shares?\"\n\"They'll give you half the number, which would come to the same thing.\"\nSir Felix turned this over in his mind, but could not see the truth of it. \"You know I should want to sell again - for the rise.\"\n\"Oh; you'll want to sell again.\"\n\"I want to begin with ten shares; that's 1,000. I have got the money, but I don't want to draw out so much. Couldn't you manage for me that I should get them on paying 50 per cent down?\"\n\"Melmotte does all that himself.\"\n\"You could explain, you know, that you are a little short in your own payments to me.\" Sir Felix thought this was a delicate way of introducing his claim upon the Secretary.\n\"That's private,\" said Miles, frowning.\n\"Of course it's private; but if you would pay me the money I could buy the shares.\"\n\"I don't think we could mix the two things together, Carbury.\"\n\"Then when the deuce will you pay what you owe me?\" demanded Sir Felix.\nMiles Grendall smoked on in silence.\n\"Do you know how much you owe me?\" continued the baronet, determined to persist. There was a little crowd of other men in the room, and he asked these questions in a whisper, but he was plainly angry.\n\"Of course I know,\" said Miles. \"I'm not going to talk about it here, in a public room.\"\n\"I am going to talk about it,\" said Sir Felix, raising his voice.\n\"Will any fellow come upstairs and play a game of billiards?\" said Miles Grendall, rising from his chair. Then he walked out slowly. For a moment Sir Felix considered exposing the transaction to the whole room; but he was afraid, thinking that Miles Grendall was a more popular man than himself.\nThe gamblers were assembled in the card-room at eleven. Dolly Longestaffe was there, and with him the two lords, and Sir Felix, and Miles Grendall, and, I regret to say, Paul Montague. Sir Felix had doubted whether he should join the party. What was the use of playing with a man who seemed to feel no obligation to pay? But then where should he find another gaming table?\nThey began with whist, but soon switched to loo at Grendall's repeated suggestions.\n\"Let's stick to whist,\" said Grasslough.\n\"I hate loo,\" said Sir Felix.\n\"I like whist best,\" said Nidderdale, \"but I'll play anything anybody likes.\" Miles Grendall had his way, and loo was the game.\nAt about two o'clock Grendall was the only winner. His opponents did not grudge him his unusual luck; and they were able to pay him with his own paper, which was so valueless that they parted with it without a pang. The only man without any of his I.O.U.s was Montague, and since the sums won were quite small he paid with cash.\nBut to Sir Felix it was frightful to see ready money going over to Miles Grendall.\n\"Montague,\" he said, \"just change these.\" And he handed a lot of Miles's paper across the table, so that he would receive so much real money, and Miles would get back more of his own worthless paper. Paul Montague was about to do as he was asked, when Miles interfered.\n\"When I win from you, Carbury,\" he said, \"I'll take my I.O.U.'s, as long as you have any. But I won't have them handed about the table to be changed.\"\n\"Pay them yourself, then,\" said Sir Felix, laying a handful down on the table.\n\"Don't let's have a row,\" said Lord Nidderdale.\n\"Carbury is always making a row,\" said Grasslough.\n\"Of course he is,\" said Miles Grendall.\n\"I don't make more row than anybody else; but I do say that as we have such a lot of these things, Grendall shouldn't take money and walk off with it.\"\n\"Who is walking off?\" said Miles.\n\"And why should you be entitled to Montague's money?\" asked Grasslough.\nThe matter was debated; and it was decided that Miles's paper should not be negotiated at the table in this way. But Mr. Grendall pledged his honour that when they broke up the party he would give any money that he might have won towards the paying of his I.O.U.'s.\nThe decision made Sir Felix very cross. He knew that by six or seven in the morning they would need an accountant to work that out; and he felt sure that Miles would simply walk off with the money.\nFor a considerable time he did not speak, and became very moderate in his play, losing a minimum, and watching the board. He was sitting next to Grendall, and he thought that he observed that his neighbour moved his chair farther and farther away from him. This went on for an hour, during which Grendall still won - and won heavily from Paul Montague.\n\"I never saw a fellow have such a run of luck,\" said Grasslough. \"You've had two trumps dealt to you every hand almost since we began!\"\n\"You've always won when I've played,\" said Dolly. \"I've been looed every time.\"\n\"You oughtn't to begrudge me one run of luck, when I've lost so much,\" said Miles, who by now had destroyed his own papers to the amount of 1,000, and had also received an amount of ready money which was a godsend to him.\n\"What's the good of talking about it?\" said Nidderdale. \"Let's go on, or go to bed.\" The idea of going to bed was absurd. So they went on.\nSir Felix, however, hardly spoke, and watched Miles Grendall. At last he felt certain that he saw a card go into the man's sleeve. He was tempted to rush at once upon him, and catch the card on his person. But Grendall was a big man; and what if there should be no card there? And the men around him would be most unwilling to believe such an accusation. Grasslough was Grendall's friend, and Nidderdale and Dolly Longestaffe would rather be cheated than suspect one of their own set of cheating them.\nSo Felix let that opportunity pass by, again watched, and again saw the card abstracted. Thrice he saw it, till it was amazing to him that others did not. He watched more closely, and was certain that in each round the man had an ace at least once. At last he pleaded a headache, got up, and went away, leaving the others playing. He had lost nearly a thousand pounds, but it had been all in paper.\n\"There's something the matter with that fellow,\" said Grasslough.\n\"There's always something the matter with him,\" said Miles. \"He is so awfully greedy about his money.\"\n\"The less said about that, Grendall, the better,\" said Nidderdale. \"We have all put up with a good deal, you know.\" Miles was cowed, and dealt without manoeuvring a card on that hand.",
        "paragraph_chars": [
            [
                0,
                588
            ],
            [
                588,
                819
            ],
            [
                819,
                1003
            ],
            [
                1003,
                1259
            ],
            [
                1259,
                1947
            ],
            [
                1947,
                2091
            ],
            [
                2091,
                2100
            ],
            [
                2100,
                2206
            ],
            [
                2206,
                2220
            ],
            [
                2220,
                2223
            ],
            [
                2223,
                2296
            ],
            [
                2296,
                2569
            ],
            [
                2569,
                2591
            ],
            [
                2591,
                2676
            ],
            [
                2676,
                2707
            ],
            [
                2707,
                2790
            ],
            [
                2790,
                2836
            ],
            [
                2836,
                3118
            ],
            [
                3118,
                3179
            ],
            [
                3179,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3278
            ],
            [
                3278,
                3300
            ],
            [
                3300,
                3578
            ],
            [
                3578,
                3872
            ],
            [
                3872,
                3917
            ],
            [
                3917,
                4027
            ],
            [
                4027,
                4206
            ],
            [
                4206,
                4384
            ],
            [
                4384,
                4394
            ],
            [
                4394,
                4441
            ],
            [
                4441,
                4496
            ],
            [
                4496,
                4524
            ],
            [
                4524,
                4576
            ],
            [
                4576,
                4688
            ],
            [
                4688,
                4760
            ],
            [
                4760,
                4890
            ],
            [
                4890,
                4923
            ],
            [
                4923,
                5110
            ],
            [
                5110,
                5144
            ],
            [
                5144,
                5318
            ],
            [
                5318,
                5358
            ],
            [
                5358,
                5442
            ],
            [
                5442,
                5505
            ],
            [
                5505,
                5577
            ],
            [
                5577,
                5614
            ],
            [
                5614,
                5815
            ],
            [
                5815,
                5904
            ],
            [
                5904,
                5970
            ],
            [
                5970,
                6266
            ],
            [
                6266,
                6639
            ],
            [
                6639,
                6723
            ],
            [
                6723,
                6764
            ],
            [
                6764,
                6794
            ],
            [
                6794,
                6922
            ],
            [
                6922,
                7251
            ],
            [
                7251,
                7334
            ],
            [
                7334,
                7604
            ],
            [
                7604,
                7755
            ],
            [
                7755,
                7834
            ],
            [
                7834,
                7882
            ],
            [
                7882,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8125
            ],
            [
                8125,
                8159
            ],
            [
                8159,
                8231
            ],
            [
                8231,
                8497
            ],
            [
                8497,
                8695
            ],
            [
                8695,
                9048
            ],
            [
                9048,
                9184
            ],
            [
                9184,
                9264
            ],
            [
                9264,
                9486
            ],
            [
                9486,
                9625
            ],
            [
                9625,
                10127
            ],
            [
                10127,
                10526
            ],
            [
                10526,
                10592
            ],
            [
                10592,
                10695
            ],
            [
                10695,
                10878
            ]
        ],
        "segment_chars": [
            [
                0,
                109
            ],
            [
                109,
                152
            ],
            [
                152,
                192
            ],
            [
                192,
                285
            ],
            [
                285,
                363
            ],
            [
                363,
                440
            ],
            [
                440,
                588
            ],
            [
                588,
                611
            ],
            [
                611,
                720
            ],
            [
                720,
                745
            ],
            [
                745,
                819
            ],
            [
                819,
                880
            ],
            [
                880,
                917
            ],
            [
                917,
                1003
            ],
            [
                1003,
                1063
            ],
            [
                1063,
                1071
            ],
            [
                1071,
                1080
            ],
            [
                1080,
                1100
            ],
            [
                1100,
                1125
            ],
            [
                1125,
                1259
            ],
            [
                1259,
                1289
            ],
            [
                1289,
                1323
            ],
            [
                1323,
                1421
            ],
            [
                1421,
                1475
            ],
            [
                1475,
                1521
            ],
            [
                1521,
                1590
            ],
            [
                1590,
                1657
            ],
            [
                1657,
                1947
            ],
            [
                1947,
                2053
            ],
            [
                2053,
                2091
            ],
            [
                2091,
                2100
            ],
            [
                2100,
                2143
            ],
            [
                2143,
                2206
            ],
            [
                2206,
                2220
            ],
            [
                2220,
                2223
            ],
            [
                2223,
                2296
            ],
            [
                2296,
                2372
            ],
            [
                2372,
                2427
            ],
            [
                2427,
                2537
            ],
            [
                2537,
                2569
            ],
            [
                2569,
                2580
            ],
            [
                2580,
                2591
            ],
            [
                2591,
                2636
            ],
            [
                2636,
                2676
            ],
            [
                2676,
                2707
            ],
            [
                2707,
                2733
            ],
            [
                2733,
                2748
            ],
            [
                2748,
                2790
            ],
            [
                2790,
                2836
            ],
            [
                2836,
                2991
            ],
            [
                2991,
                3065
            ],
            [
                3065,
                3118
            ],
            [
                3118,
                3165
            ],
            [
                3165,
                3179
            ],
            [
                3179,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3278
            ],
            [
                3278,
                3300
            ],
            [
                3300,
                3342
            ],
            [
                3342,
                3405
            ],
            [
                3405,
                3439
            ],
            [
                3439,
                3522
            ],
            [
                3522,
                3578
            ],
            [
                3578,
                3635
            ],
            [
                3635,
                3676
            ],
            [
                3676,
                3719
            ],
            [
                3719,
                3843
            ],
            [
                3843,
                3872
            ],
            [
                3872,
                3917
            ],
            [
                3917,
                3939
            ],
            [
                3939,
                3962
            ],
            [
                3962,
                4027
            ],
            [
                4027,
                4206
            ],
            [
                4206,
                4272
            ],
            [
                4272,
                4322
            ],
            [
                4322,
                4384
            ],
            [
                4384,
                4394
            ],
            [
                4394,
                4441
            ],
            [
                4441,
                4466
            ],
            [
                4466,
                4496
            ],
            [
                4496,
                4524
            ],
            [
                4524,
                4576
            ],
            [
                4576,
                4688
            ],
            [
                4688,
                4760
            ],
            [
                4760,
                4835
            ],
            [
                4835,
                4890
            ],
            [
                4890,
                4923
            ],
            [
                4923,
                4971
            ],
            [
                4971,
                5031
            ],
            [
                5031,
                5110
            ],
            [
                5110,
                5144
            ],
            [
                5144,
                5231
            ],
            [
                5231,
                5318
            ],
            [
                5318,
                5358
            ],
            [
                5358,
                5442
            ],
            [
                5442,
                5505
            ],
            [
                5505,
                5557
            ],
            [
                5557,
                5577
            ],
            [
                5577,
                5614
            ],
            [
                5614,
                5649
            ],
            [
                5649,
                5695
            ],
            [
                5695,
                5815
            ],
            [
                5815,
                5847
            ],
            [
                5847,
                5904
            ],
            [
                5904,
                5970
            ],
            [
                5970,
                6032
            ],
            [
                6032,
                6076
            ],
            [
                6076,
                6103
            ],
            [
                6103,
                6266
            ],
            [
                6266,
                6322
            ],
            [
                6322,
                6451
            ],
            [
                6451,
                6507
            ],
            [
                6507,
                6587
            ],
            [
                6587,
                6639
            ],
            [
                6639,
                6723
            ],
            [
                6723,
                6764
            ],
            [
                6764,
                6794
            ],
            [
                6794,
                6872
            ],
            [
                6872,
                6922
            ],
            [
                6922,
                6973
            ],
            [
                6973,
                7138
            ],
            [
                7138,
                7251
            ],
            [
                7251,
                7334
            ],
            [
                7334,
                7376
            ],
            [
                7376,
                7534
            ],
            [
                7534,
                7604
            ],
            [
                7604,
                7665
            ],
            [
                7665,
                7694
            ],
            [
                7694,
                7755
            ],
            [
                7755,
                7834
            ],
            [
                7834,
                7882
            ],
            [
                7882,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8125
            ],
            [
                8125,
                8147
            ],
            [
                8147,
                8159
            ],
            [
                8159,
                8213
            ],
            [
                8213,
                8231
            ],
            [
                8231,
                8344
            ],
            [
                8344,
                8493
            ],
            [
                8493,
                8497
            ],
            [
                8497,
                8537
            ],
            [
                8537,
                8695
            ],
            [
                8695,
                8817
            ],
            [
                8817,
                8952
            ],
            [
                8952,
                9048
            ],
            [
                9048,
                9113
            ],
            [
                9113,
                9184
            ],
            [
                9184,
                9234
            ],
            [
                9234,
                9264
            ],
            [
                9264,
                9486
            ],
            [
                9486,
                9525
            ],
            [
                9525,
                9542
            ],
            [
                9542,
                9571
            ],
            [
                9571,
                9608
            ],
            [
                9608,
                9625
            ],
            [
                9625,
                9687
            ],
            [
                9687,
                9756
            ],
            [
                9756,
                9831
            ],
            [
                9831,
                9902
            ],
            [
                9902,
                9980
            ],
            [
                9980,
                10127
            ],
            [
                10127,
                10216
            ],
            [
                10216,
                10282
            ],
            [
                10282,
                10376
            ],
            [
                10376,
                10458
            ],
            [
                10458,
                10526
            ],
            [
                10526,
                10592
            ],
            [
                10592,
                10652
            ],
            [
                10652,
                10695
            ],
            [
                10695,
                10762
            ],
            [
                10762,
                10811
            ],
            [
                10811,
                10878
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                10,
                42
            ],
            [
                45,
                86
            ],
            [
                98,
                107
            ],
            [
                107,
                109
            ],
            [
                109,
                152
            ],
            [
                152,
                192
            ],
            [
                192,
                252
            ],
            [
                253,
                285
            ],
            [
                285,
                297
            ],
            [
                304,
                307
            ],
            [
                308,
                315
            ],
            [
                333,
                349
            ],
            [
                354,
                361
            ],
            [
                361,
                363
            ],
            [
                363,
                369
            ],
            [
                372,
                404
            ],
            [
                407,
                440
            ],
            [
                450,
                528
            ],
            [
                529,
                588
            ],
            [
                588,
                611
            ],
            [
                611,
                654
            ],
            [
                654,
                720
            ],
            [
                720,
                745
            ],
            [
                745,
                818
            ],
            [
                819,
                880
            ],
            [
                880,
                917
            ],
            [
                917,
                970
            ],
            [
                983,
                984
            ],
            [
                994,
                1000
            ],
            [
                1007,
                1020
            ],
            [
                1021,
                1025
            ],
            [
                1026,
                1030
            ],
            [
                1032,
                1035
            ],
            [
                1036,
                1063
            ],
            [
                1063,
                1068
            ],
            [
                1068,
                1069
            ],
            [
                1071,
                1080
            ],
            [
                1080,
                1100
            ],
            [
                1100,
                1103
            ],
            [
                1104,
                1125
            ],
            [
                1125,
                1162
            ],
            [
                1174,
                1196
            ],
            [
                1207,
                1258
            ],
            [
                1259,
                1268
            ],
            [
                1274,
                1289
            ],
            [
                1289,
                1303
            ],
            [
                1306,
                1323
            ],
            [
                1323,
                1340
            ],
            [
                1341,
                1352
            ],
            [
                1352,
                1353
            ],
            [
                1358,
                1374
            ],
            [
                1375,
                1379
            ],
            [
                1392,
                1419
            ],
            [
                1419,
                1421
            ],
            [
                1421,
                1473
            ],
            [
                1475,
                1521
            ],
            [
                1521,
                1528
            ],
            [
                1528,
                1529
            ],
            [
                1530,
                1542
            ],
            [
                1550,
                1551
            ],
            [
                1552,
                1560
            ],
            [
                1561,
                1579
            ],
            [
                1588,
                1590
            ],
            [
                1590,
                1595
            ],
            [
                1596,
                1600
            ],
            [
                1601,
                1604
            ],
            [
                1612,
                1620
            ],
            [
                1623,
                1655
            ],
            [
                1655,
                1657
            ],
            [
                1657,
                1665
            ],
            [
                1670,
                1672
            ],
            [
                1677,
                1712
            ],
            [
                1713,
                1716
            ],
            [
                1717,
                1816
            ],
            [
                1822,
                1853
            ],
            [
                1860,
                1946
            ],
            [
                1947,
                1956
            ],
            [
                1957,
                1969
            ],
            [
                1970,
                2003
            ],
            [
                2004,
                2053
            ],
            [
                2053,
                2089
            ],
            [
                2091,
                2100
            ],
            [
                2100,
                2129
            ],
            [
                2130,
                2143
            ],
            [
                2143,
                2206
            ],
            [
                2206,
                2220
            ],
            [
                2220,
                2223
            ],
            [
                2223,
                2244
            ],
            [
                2255,
                2270
            ],
            [
                2270,
                2295
            ],
            [
                2296,
                2306
            ],
            [
                2307,
                2326
            ],
            [
                2327,
                2372
            ],
            [
                2372,
                2407
            ],
            [
                2408,
                2427
            ],
            [
                2427,
                2489
            ],
            [
                2489,
                2500
            ],
            [
                2507,
                2537
            ],
            [
                2537,
                2546
            ],
            [
                2555,
                2556
            ],
            [
                2557,
                2569
            ],
            [
                2569,
                2570
            ],
            [
                2578,
                2580
            ],
            [
                2580,
                2591
            ],
            [
                2591,
                2609
            ],
            [
                2611,
                2618
            ],
            [
                2619,
                2622
            ],
            [
                2634,
                2636
            ],
            [
                2636,
                2676
            ],
            [
                2676,
                2707
            ],
            [
                2707,
                2733
            ],
            [
                2733,
                2746
            ],
            [
                2746,
                2748
            ],
            [
                2748,
                2760
            ],
            [
                2761,
                2790
            ],
            [
                2790,
                2836
            ],
            [
                2836,
                2841
            ],
            [
                2841,
                2842
            ],
            [
                2843,
                2863
            ],
            [
                2864,
                2866
            ],
            [
                2867,
                2874
            ],
            [
                2875,
                2877
            ],
            [
                2878,
                2882
            ],
            [
                2883,
                2958
            ],
            [
                2967,
                2968
            ],
            [
                2969,
                2989
            ],
            [
                2989,
                2991
            ],
            [
                2991,
                3050
            ],
            [
                3051,
                3063
            ],
            [
                3063,
                3065
            ],
            [
                3065,
                3118
            ],
            [
                3118,
                3165
            ],
            [
                3165,
                3179
            ],
            [
                3180,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3278
            ],
            [
                3278,
                3300
            ],
            [
                3300,
                3342
            ],
            [
                3342,
                3367
            ],
            [
                3368,
                3378
            ],
            [
                3382,
                3403
            ],
            [
                3405,
                3409
            ],
            [
                3410,
                3415
            ],
            [
                3416,
                3422
            ],
            [
                3423,
                3439
            ],
            [
                3439,
                3522
            ],
            [
                3526,
                3578
            ],
            [
                3578,
                3608
            ],
            [
                3633,
                3635
            ],
            [
                3636,
                3676
            ],
            [
                3676,
                3698
            ],
            [
                3699,
                3719
            ],
            [
                3719,
                3843
            ],
            [
                3843,
                3872
            ],
            [
                3872,
                3888
            ],
            [
                3889,
                3893
            ],
            [
                3894,
                3907
            ],
            [
                3914,
                3917
            ],
            [
                3917,
                3928
            ],
            [
                3928,
                3939
            ],
            [
                3939,
                3952
            ],
            [
                3953,
                3962
            ],
            [
                3962,
                3979
            ],
            [
                3980,
                4027
            ],
            [
                4027,
                4063
            ],
            [
                4064,
                4083
            ],
            [
                4084,
                4096
            ],
            [
                4096,
                4142
            ],
            [
                4146,
                4162
            ],
            [
                4163,
                4165
            ],
            [
                4166,
                4195
            ],
            [
                4204,
                4205
            ],
            [
                4206,
                4271
            ],
            [
                4272,
                4273
            ],
            [
                4273,
                4322
            ],
            [
                4322,
                4384
            ],
            [
                4384,
                4388
            ],
            [
                4389,
                4394
            ],
            [
                4394,
                4428
            ],
            [
                4430,
                4441
            ],
            [
                4441,
                4451
            ],
            [
                4452,
                4466
            ],
            [
                4466,
                4494
            ],
            [
                4494,
                4496
            ],
            [
                4496,
                4524
            ],
            [
                4524,
                4556
            ],
            [
                4556,
                4557
            ],
            [
                4558,
                4574
            ],
            [
                4574,
                4576
            ],
            [
                4576,
                4661
            ],
            [
                4663,
                4688
            ],
            [
                4688,
                4760
            ],
            [
                4760,
                4803
            ],
            [
                4804,
                4830
            ],
            [
                4831,
                4833
            ],
            [
                4833,
                4835
            ],
            [
                4835,
                4872
            ],
            [
                4875,
                4890
            ],
            [
                4890,
                4923
            ],
            [
                4923,
                4925
            ],
            [
                4931,
                4956
            ],
            [
                4957,
                4971
            ],
            [
                4971,
                5031
            ],
            [
                5031,
                5102
            ],
            [
                5110,
                5144
            ],
            [
                5144,
                5231
            ],
            [
                5235,
                5240
            ],
            [
                5249,
                5253
            ],
            [
                5258,
                5268
            ],
            [
                5273,
                5318
            ],
            [
                5318,
                5346
            ],
            [
                5348,
                5358
            ],
            [
                5358,
                5439
            ],
            [
                5439,
                5442
            ],
            [
                5442,
                5505
            ],
            [
                5505,
                5510
            ],
            [
                5511,
                5538
            ],
            [
                5539,
                5557
            ],
            [
                5570,
                5575
            ],
            [
                5575,
                5576
            ],
            [
                5577,
                5613
            ],
            [
                5614,
                5649
            ],
            [
                5649,
                5693
            ],
            [
                5693,
                5695
            ],
            [
                5695,
                5749
            ],
            [
                5753,
                5758
            ],
            [
                5759,
                5764
            ],
            [
                5765,
                5774
            ],
            [
                5775,
                5792
            ],
            [
                5793,
                5799
            ],
            [
                5800,
                5807
            ],
            [
                5813,
                5815
            ],
            [
                5815,
                5846
            ],
            [
                5847,
                5883
            ],
            [
                5888,
                5904
            ],
            [
                5904,
                5970
            ],
            [
                5970,
                5991
            ],
            [
                6001,
                6032
            ],
            [
                6032,
                6051
            ],
            [
                6053,
                6076
            ],
            [
                6076,
                6090
            ],
            [
                6091,
                6094
            ],
            [
                6095,
                6101
            ],
            [
                6101,
                6103
            ],
            [
                6103,
                6125
            ],
            [
                6146,
                6266
            ],
            [
                6266,
                6278
            ],
            [
                6279,
                6283
            ],
            [
                6284,
                6313
            ],
            [
                6314,
                6322
            ],
            [
                6322,
                6412
            ],
            [
                6412,
                6435
            ],
            [
                6436,
                6451
            ],
            [
                6451,
                6472
            ],
            [
                6496,
                6507
            ],
            [
                6507,
                6556
            ],
            [
                6557,
                6559
            ],
            [
                6568,
                6587
            ],
            [
                6587,
                6595
            ],
            [
                6596,
                6624
            ],
            [
                6632,
                6638
            ],
            [
                6639,
                6670
            ],
            [
                6680,
                6686
            ],
            [
                6690,
                6698
            ],
            [
                6721,
                6722
            ],
            [
                6723,
                6744
            ],
            [
                6744,
                6763
            ],
            [
                6764,
                6792
            ],
            [
                6792,
                6793
            ],
            [
                6794,
                6869
            ],
            [
                6869,
                6872
            ],
            [
                6878,
                6922
            ],
            [
                6922,
                6973
            ],
            [
                6995,
                6997
            ],
            [
                7002,
                7005
            ],
            [
                7018,
                7022
            ],
            [
                7022,
                7138
            ],
            [
                7138,
                7150
            ],
            [
                7178,
                7195
            ],
            [
                7202,
                7234
            ],
            [
                7240,
                7250
            ],
            [
                7251,
                7332
            ],
            [
                7332,
                7333
            ],
            [
                7334,
                7373
            ],
            [
                7376,
                7429
            ],
            [
                7434,
                7438
            ],
            [
                7442,
                7479
            ],
            [
                7480,
                7534
            ],
            [
                7539,
                7547
            ],
            [
                7548,
                7551
            ],
            [
                7558,
                7563
            ],
            [
                7564,
                7579
            ],
            [
                7579,
                7603
            ],
            [
                7604,
                7633
            ],
            [
                7643,
                7644
            ],
            [
                7646,
                7665
            ],
            [
                7665,
                7692
            ],
            [
                7694,
                7755
            ],
            [
                7755,
                7834
            ],
            [
                7834,
                7882
            ],
            [
                7882,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8071
            ],
            [
                8072,
                8125
            ],
            [
                8125,
                8147
            ],
            [
                8147,
                8159
            ],
            [
                8159,
                8210
            ],
            [
                8210,
                8213
            ],
            [
                8213,
                8231
            ],
            [
                8231,
                8253
            ],
            [
                8255,
                8258
            ],
            [
                8259,
                8265
            ],
            [
                8266,
                8273
            ],
            [
                8274,
                8299
            ],
            [
                8300,
                8303
            ],
            [
                8304,
                8333
            ],
            [
                8342,
                8344
            ],
            [
                8344,
                8422
            ],
            [
                8428,
                8460
            ],
            [
                8469,
                8472
            ],
            [
                8480,
                8493
            ],
            [
                8493,
                8495
            ],
            [
                8495,
                8496
            ],
            [
                8497,
                8537
            ],
            [
                8537,
                8549
            ],
            [
                8553,
                8580
            ],
            [
                8586,
                8591
            ],
            [
                8597,
                8613
            ],
            [
                8627,
                8656
            ],
            [
                8657,
                8662
            ],
            [
                8670,
                8687
            ],
            [
                8688,
                8695
            ],
            [
                8695,
                8774
            ],
            [
                8775,
                8817
            ],
            [
                8817,
                8950
            ],
            [
                8950,
                8952
            ],
            [
                8952,
                9009
            ],
            [
                9012,
                9047
            ],
            [
                9048,
                9093
            ],
            [
                9093,
                9113
            ],
            [
                9113,
                9184
            ],
            [
                9184,
                9234
            ],
            [
                9234,
                9264
            ],
            [
                9264,
                9350
            ],
            [
                9358,
                9371
            ],
            [
                9372,
                9379
            ],
            [
                9387,
                9389
            ],
            [
                9401,
                9403
            ],
            [
                9404,
                9423
            ],
            [
                9424,
                9467
            ],
            [
                9468,
                9486
            ],
            [
                9486,
                9525
            ],
            [
                9525,
                9542
            ],
            [
                9543,
                9571
            ],
            [
                9571,
                9608
            ],
            [
                9608,
                9624
            ],
            [
                9625,
                9657
            ],
            [
                9657,
                9685
            ],
            [
                9685,
                9687
            ],
            [
                9687,
                9754
            ],
            [
                9754,
                9756
            ],
            [
                9756,
                9791
            ],
            [
                9795,
                9831
            ],
            [
                9840,
                9862
            ],
            [
                9868,
                9902
            ],
            [
                9902,
                9905
            ],
            [
                9906,
                9980
            ],
            [
                9980,
                10056
            ],
            [
                10057,
                10087
            ],
            [
                10088,
                10126
            ],
            [
                10136,
                10216
            ],
            [
                10216,
                10245
            ],
            [
                10254,
                10272
            ],
            [
                10277,
                10280
            ],
            [
                10280,
                10282
            ],
            [
                10285,
                10376
            ],
            [
                10376,
                10458
            ],
            [
                10458,
                10525
            ],
            [
                10526,
                10592
            ],
            [
                10592,
                10637
            ],
            [
                10637,
                10652
            ],
            [
                10652,
                10694
            ],
            [
                10695,
                10762
            ],
            [
                10762,
                10770
            ],
            [
                10775,
                10808
            ],
            [
                10808,
                10811
            ],
            [
                10811,
                10826
            ],
            [
                10826,
                10831
            ],
            [
                10838,
                10878
            ]
        ],
        "row_chars": [
            [
                0,
                109
            ],
            [
                109,
                152
            ],
            [
                152,
                192
            ],
            [
                192,
                192
            ],
            [
                192,
                192
            ],
            [
                192,
                285
            ],
            [
                285,
                285
            ],
            [
                285,
                363
            ],
            [
                363,
                440
            ],
            [
                440,
                440
            ],
            [
                440,
                588
            ],
            [
                588,
                611
            ],
            [
                611,
                720
            ],
            [
                720,
                745
            ],
            [
                745,
                819
            ],
            [
                819,
                880
            ],
            [
                880,
                917
            ],
            [
                917,
                1003
            ],
            [
                1003,
                1003
            ],
            [
                1003,
                1063
            ],
            [
                1063,
                1080
            ],
            [
                1080,
                1100
            ],
            [
                1100,
                1125
            ],
            [
                1125,
                1259
            ],
            [
                1259,
                1259
            ],
            [
                1259,
                1289
            ],
            [
                1289,
                1323
            ],
            [
                1323,
                1421
            ],
            [
                1421,
                1475
            ],
            [
                1475,
                1475
            ],
            [
                1475,
                1521
            ],
            [
                1521,
                1590
            ],
            [
                1590,
                1657
            ],
            [
                1657,
                1947
            ],
            [
                1947,
                1947
            ],
            [
                1947,
                2053
            ],
            [
                2053,
                2091
            ],
            [
                2091,
                2100
            ],
            [
                2100,
                2143
            ],
            [
                2143,
                2206
            ],
            [
                2206,
                2220
            ],
            [
                2220,
                2223
            ],
            [
                2223,
                2296
            ],
            [
                2296,
                2296
            ],
            [
                2296,
                2372
            ],
            [
                2372,
                2427
            ],
            [
                2427,
                2537
            ],
            [
                2537,
                2569
            ],
            [
                2569,
                2580
            ],
            [
                2580,
                2591
            ],
            [
                2591,
                2636
            ],
            [
                2636,
                2676
            ],
            [
                2676,
                2707
            ],
            [
                2707,
                2733
            ],
            [
                2733,
                2748
            ],
            [
                2748,
                2790
            ],
            [
                2790,
                2836
            ],
            [
                2836,
                2836
            ],
            [
                2836,
                2836
            ],
            [
                2836,
                2836
            ],
            [
                2836,
                2836
            ],
            [
                2836,
                2836
            ],
            [
                2836,
                2991
            ],
            [
                2991,
                3065
            ],
            [
                3065,
                3065
            ],
            [
                3065,
                3118
            ],
            [
                3118,
                3165
            ],
            [
                3165,
                3179
            ],
            [
                3179,
                3179
            ],
            [
                3179,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3278
            ],
            [
                3278,
                3300
            ],
            [
                3300,
                3342
            ],
            [
                3342,
                3405
            ],
            [
                3405,
                3405
            ],
            [
                3405,
                3439
            ],
            [
                3439,
                3522
            ],
            [
                3522,
                3522
            ],
            [
                3522,
                3522
            ],
            [
                3522,
                3578
            ],
            [
                3578,
                3635
            ],
            [
                3635,
                3676
            ],
            [
                3676,
                3719
            ],
            [
                3719,
                3843
            ],
            [
                3843,
                3872
            ],
            [
                3872,
                3917
            ],
            [
                3917,
                3939
            ],
            [
                3939,
                3939
            ],
            [
                3939,
                3962
            ],
            [
                3962,
                3962
            ],
            [
                3962,
                4027
            ],
            [
                4027,
                4206
            ],
            [
                4206,
                4272
            ],
            [
                4272,
                4272
            ],
            [
                4272,
                4272
            ],
            [
                4272,
                4322
            ],
            [
                4322,
                4384
            ],
            [
                4384,
                4394
            ],
            [
                4394,
                4441
            ],
            [
                4441,
                4466
            ],
            [
                4466,
                4496
            ],
            [
                4496,
                4524
            ],
            [
                4524,
                4576
            ],
            [
                4576,
                4688
            ],
            [
                4688,
                4760
            ],
            [
                4760,
                4835
            ],
            [
                4835,
                4890
            ],
            [
                4890,
                4923
            ],
            [
                4923,
                4923
            ],
            [
                4923,
                4923
            ],
            [
                4923,
                4971
            ],
            [
                4971,
                5031
            ],
            [
                5031,
                5110
            ],
            [
                5110,
                5110
            ],
            [
                5110,
                5144
            ],
            [
                5144,
                5231
            ],
            [
                5231,
                5318
            ],
            [
                5318,
                5358
            ],
            [
                5358,
                5442
            ],
            [
                5442,
                5505
            ],
            [
                5505,
                5505
            ],
            [
                5505,
                5505
            ],
            [
                5505,
                5557
            ],
            [
                5557,
                5577
            ],
            [
                5577,
                5577
            ],
            [
                5577,
                5577
            ],
            [
                5577,
                5614
            ],
            [
                5614,
                5614
            ],
            [
                5614,
                5649
            ],
            [
                5649,
                5695
            ],
            [
                5695,
                5815
            ],
            [
                5815,
                5847
            ],
            [
                5847,
                5847
            ],
            [
                5847,
                5904
            ],
            [
                5904,
                5970
            ],
            [
                5970,
                6032
            ],
            [
                6032,
                6076
            ],
            [
                6076,
                6103
            ],
            [
                6103,
                6266
            ],
            [
                6266,
                6322
            ],
            [
                6322,
                6451
            ],
            [
                6451,
                6507
            ],
            [
                6507,
                6587
            ],
            [
                6587,
                6639
            ],
            [
                6639,
                6723
            ],
            [
                6723,
                6764
            ],
            [
                6764,
                6764
            ],
            [
                6764,
                6794
            ],
            [
                6794,
                6872
            ],
            [
                6872,
                6922
            ],
            [
                6922,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                7138
            ],
            [
                7138,
                7138
            ],
            [
                7138,
                7251
            ],
            [
                7251,
                7334
            ],
            [
                7334,
                7376
            ],
            [
                7376,
                7376
            ],
            [
                7376,
                7534
            ],
            [
                7534,
                7604
            ],
            [
                7604,
                7604
            ],
            [
                7604,
                7604
            ],
            [
                7604,
                7665
            ],
            [
                7665,
                7694
            ],
            [
                7694,
                7694
            ],
            [
                7694,
                7755
            ],
            [
                7755,
                7834
            ],
            [
                7834,
                7882
            ],
            [
                7882,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8125
            ],
            [
                8125,
                8147
            ],
            [
                8147,
                8159
            ],
            [
                8159,
                8213
            ],
            [
                8213,
                8231
            ],
            [
                8231,
                8344
            ],
            [
                8344,
                8493
            ],
            [
                8493,
                8497
            ],
            [
                8497,
                8537
            ],
            [
                8537,
                8695
            ],
            [
                8695,
                8817
            ],
            [
                8817,
                8952
            ],
            [
                8952,
                9048
            ],
            [
                9048,
                9113
            ],
            [
                9113,
                9184
            ],
            [
                9184,
                9184
            ],
            [
                9184,
                9234
            ],
            [
                9234,
                9264
            ],
            [
                9264,
                9486
            ],
            [
                9486,
                9525
            ],
            [
                9525,
                9542
            ],
            [
                9542,
                9542
            ],
            [
                9542,
                9571
            ],
            [
                9571,
                9608
            ],
            [
                9608,
                9625
            ],
            [
                9625,
                9687
            ],
            [
                9687,
                9756
            ],
            [
                9756,
                9831
            ],
            [
                9831,
                9831
            ],
            [
                9831,
                9902
            ],
            [
                9902,
                9902
            ],
            [
                9902,
                9980
            ],
            [
                9980,
                10127
            ],
            [
                10127,
                10127
            ],
            [
                10127,
                10216
            ],
            [
                10216,
                10282
            ],
            [
                10282,
                10282
            ],
            [
                10282,
                10376
            ],
            [
                10376,
                10376
            ],
            [
                10376,
                10458
            ],
            [
                10458,
                10526
            ],
            [
                10526,
                10592
            ],
            [
                10592,
                10652
            ],
            [
                10652,
                10695
            ],
            [
                10695,
                10695
            ],
            [
                10695,
                10762
            ],
            [
                10762,
                10811
            ],
            [
                10811,
                10878
            ]
        ]
    }
}