{
    "original": {
        "text": "Marie Melmotte was hardly satisfied with the note which she received from Didon early on the Monday morning. With a volubility of French eloquence, Didon declared that she would be turned out of the house if either Monsieur or Madame were to know what she was doing. Marie told her that Madame would certainly never dismiss her. \"Well, perhaps not Madame,\" said Didon, who knew too much about Madame to be dismissed; \"but Monsieur!\" Marie declared that by no possibility could Monsieur know anything about it. In that house nobody ever told anything to Monsieur. He was regarded as the general enemy, against whom the whole household was always making ambushes, always firing guns from behind rocks and trees. It is not a pleasant condition for a master of a house; but in this house the master at any rate knew how he was placed. It never occurred to him to trust any one. Of course his daughter might run away. But who would run away with her without money? And there could be no money except from him. He knew himself and his own strength. He was not the man to forgive a girl, and then bestow his wealth on the Lothario who had injured him. His daughter was valuable to him because she might make him the father-in-law of a Marquis or an Earl; but the higher that he rose without such assistance, the less need had he of his daughter's aid. Lord Alfred was certainly very useful to him. Lord Alfred had whispered into his ear that by certain conduct and by certain uses of his money, he himself might be made a baronet. \"But if they should say that I'm not an Englishman?\" suggested Melmotte. Lord Alfred had explained that it was not necessary that he should have been born in England, or even that he should have an English name. No questions would be asked. Let him first get into Parliament, and then spend a little money on the proper side,--by which Lord Alfred meant the Conservative side,--and be munificent in his entertainments, and the baronetcy would be almost a matter of course. Indeed, there was no knowing what honours might not be achieved in the present days by money scattered with a liberal hand. In these conversations, Melmotte would speak of his money and power of making money as though they were unlimited,--and Lord Alfred believed him.\nMarie was dissatisfied with her letter,--not because it described her father as \"cutting up very rough.\" To her who had known her father all her life that was a matter of course. But there was no word of love in the note. An impassioned correspondence carried on through Didon would be delightful to her. She was quite capable of loving, and she did love the young man. She had, no doubt, consented to accept the addresses of others whom she did not love,--but this she had done at the moment almost of her first introduction to the marvellous world in which she was now living. As days went on she ceased to be a child, and her courage grew within her. She became conscious of an identity of her own, which feeling was produced in great part by the contempt which accompanied her increasing familiarity with grand people and grand names and grand things. She was no longer afraid of saying No to the Nidderdales on account of any awe of them personally. It might be that she should acknowledge herself to be obliged to obey her father, though she was drifting away even from the sense of that obligation. Had her mind been as it was now when Lord Nidderdale first came to her, she might indeed have loved him, who, as a man, was infinitely better than Sir Felix, and who, had he thought it to be necessary, would have put some grace into his love-making. But at that time she had been childish. He, finding her to be a child, had hardly spoken to her. And she, child though she was, had resented such usage. But a few months in London had changed all this, and now she was a child no longer. She was in love with Sir Felix, and had told her love. Whatever difficulties there might be, she intended to be true. If necessary, she would run away. Sir Felix was her idol, and she abandoned herself to its worship. But she desired that her idol should be of flesh and blood, and not of wood. She was at first half-inclined to be angry; but as she sat with his letter in her hand, she remembered that he did not know Didon as well as she did, and that he might be afraid to trust his raptures to such custody. She could write to him at his club, and having no such fear, she could write warmly.\n--, Grosvenor Square. Early Monday Morning.\nDEAREST, DEAREST FELIX,\nI have just got your note;--such a scrap! Of course papa would talk about money because he never thinks of anything else. I don't know anything about money, and I don't care in the least how much you have got. Papa has got plenty, and I think he would give us some if we were once married. I have told mamma, but mamma is always afraid of everything. Papa is very cross to her sometimes;--more so than to me. I will try to tell him, though I can't always get at him. I very often hardly see him all day long. But I don't mean to be afraid of him, and will tell him that on my word and honour I will never marry any one except you. I don't think he will beat me, but if he does, I'll bear it,--for your sake. He does beat mamma sometimes, I know.\nYou can write to me quite safely through Didon. I think if you would call some day and give her something, it would help, as she is very fond of money. Do write and tell me that you love me. I love you better than anything in the world, and I will never,--never give you up. I suppose you can come and call,--unless papa tells the man in the hall not to let you in. I'll find that out from Didon, but I can't do it before sending this letter. Papa dined out yesterday somewhere with that Lord Alfred, so I haven't seen him since you were here. I never see him before he goes into the city in the morning. Now I am going down-stairs to breakfast with mamma and that Miss Longestaffe. She is a stuck-up thing. Didn't you think so at Caversham?\nGood-bye. You are my own, own, own darling Felix,\nAnd I am your own, own affectionate ladylove,\nMARIE.\nSir Felix when he read this letter at his club in the afternoon of the Monday, turned up his nose and shook his head. He thought if there were much of that kind of thing to be done, he could not go on with it, even though the marriage were certain, and the money secure. \"What an infernal little ass!\" he said to himself as he crumpled the letter up.\nMarie having intrusted her letter to Didon, together with a little present of gloves and shoes, went down to breakfast. Her mother was the first there, and Miss Longestaffe soon followed. That lady, when she found that she was not expected to breakfast with the master of the house, abandoned the idea of having her meal sent to her in her own room. Madame Melmotte she must endure. With Madame Melmotte she had to go out in the carriage every day. Indeed she could only go to those parties to which Madame Melmotte accompanied her. If the London season was to be of any use at all, she must accustom herself to the companionship of Madame Melmotte. The man kept himself very much apart from her. She met him only at dinner, and that not often. Madame Melmotte was very bad; but she was silent, and seemed to understand that her guest was only her guest as a matter of business.\nBut Miss Longestaffe already perceived that her old acquaintances were changed in their manner to her. She had written to her dear friend Lady Monogram, whom she had known intimately as Miss Triplex, and whose marriage with Sir Damask Monogram had been splendid preferment, telling how she had been kept down in Suffolk at the time of her friend's last party, and how she had been driven to consent to return to London as the guest of Madame Melmotte. She hoped her friend would not throw her off on that account. She had been very affectionate, with a poor attempt at fun, and rather humble. Georgiana Longestaffe had never been humble before; but the Monograms were people so much thought of and in such an excellent set! She would do anything rather than lose the Monograms. But it was of no use. She had been humble in vain, for Lady Monogram had not even answered her note. \"She never really cared for anybody but herself,\" Georgiana said in her wretched solitude. Then, too, she had found that Lord Nidderdale's manner to her had been quite changed. She was not a fool, and could read these signs with sufficient accuracy. There had been little flirtations between her and Nidderdale,--meaning nothing, as every one knew that Nidderdale must marry money; but in none of them had he spoken to her as he spoke when he met her in Madame Melmotte's drawing-room. She could see it in the faces of people as they greeted her in the park,--especially in the faces of the men. She had always carried herself with a certain high demeanour, and had been able to maintain it. All that was now gone from her, and she knew it. Though the thing was as yet but a few days old she understood that others understood that she had degraded herself. \"What's all this about?\" Lord Grasslough had said to her, seeing her come into a room behind Madame Melmotte. She had simpered, had tried to laugh, and had then turned away her face. \"Impudent scoundrel!\" she said to herself, knowing that a fortnight ago he would not have dared to address her in such a tone.\nA day or two afterwards an occurrence took place worthy of commemoration. Dolly Longestaffe called on his sister! His mind must have been much stirred when he allowed himself to be moved to such uncommon action. He came too at a very early hour, not much after noon, when it was his custom to be eating his breakfast in bed. He declared at once to the servant that he did not wish to see Madame Melmotte or any of the family. He had called to see his sister. He was therefore shown into a separate room where Georgiana joined him. \"What's all this about?\"\nShe tried to laugh as she tossed her head. \"What brings you here, I wonder? This is quite an unexpected compliment.\"\n\"My being here doesn't matter. I can go anywhere without doing much harm. Why are you staying with these people?\"\n\"Ask papa.\"\n\"I don't suppose he sent you here?\"\n\"That's just what he did do.\"\n\"You needn't have come, I suppose, unless you liked it. Is it because they are none of them coming up?\"\n\"Exactly that, Dolly. What a wonderful young man you are for guessing!\"\n\"Don't you feel ashamed of yourself?\"\n\"No;--not a bit.\"\n\"Then I feel ashamed for you.\"\n\"Everybody comes here.\"\n\"No;--everybody does not come and stay here as you are doing. Everybody doesn't make themselves a part of the family. I have heard of nobody doing it except you. I thought you used to think so much of yourself.\"\n\"I think as much of myself as ever I did,\" said Georgiana, hardly able to restrain her tears.\n\"I can tell you nobody else will think much of you if you remain here. I could hardly believe it when Nidderdale told me.\"\n\"What did he say, Dolly?\"\n\"He didn't say much to me, but I could see what he thought. And of course everybody thinks the same. How you can like the people yourself is what I can't understand!\"\n\"I don't like them,--I hate them.\"\n\"Then why do you come and live with them?\"\n\"Oh, Dolly, it is impossible to make you understand. A man is so different. You can go just where you please, and do what you like. And if you're short of money, people will give you credit. And you can live by yourself, and all that sort of thing. How should you like to be shut up down at Caversham all the season?\"\n\"I shouldn't mind it,--only for the governor.\"\n\"You have got a property of your own. Your fortune is made for you. What is to become of me?\"\n\"You mean about marrying?\"\n\"I mean altogether,\" said the poor girl, unable to be quite as explicit with her brother, as she had been with her father, and mother, and sister. \"Of course I have to think of myself.\"\n\"I don't see how the Melmottes are to help you. The long and the short of it is, you oughtn't to be here. It's not often I interfere, but when I heard it I thought I'd come and tell you. I shall write to the governor, and tell him too. He should have known better.\"\n\"Don't write to papa, Dolly!\"\n\"Yes, I shall. I am not going to see everything going to the devil without saying a word. Good-bye.\"\nAs soon as he had left he hurried down to some club that was open,--not the Beargarden, as it was long before the Beargarden hours,--and actually did write a letter to his father.\nMY DEAR FATHER,\nI have seen Georgiana at Mr. Melmotte's house. She ought not to be there. I suppose you don't know it, but everybody says he's a swindler. For the sake of the family I hope you will get her home again. It seems to me that Bruton Street is the proper place for the girls at this time of the year.\nYour affectionate son,\nADOLPHUS LONGESTAFFE.\nThis letter fell upon old Mr. Longestaffe at Caversham like a thunderbolt. It was marvellous to him that his son should have been instigated to write a letter. The Melmottes must be very bad indeed,--worse than he had thought,--or their iniquities would not have brought about such energy as this. But the passage which angered him most was that which told him that he ought to have taken his family back to town. This had come from his son, who had refused to do anything to help him in his difficulties.",
        "paragraph_chars": [
            [
                0,
                2267
            ],
            [
                2267,
                4457
            ],
            [
                4457,
                4501
            ],
            [
                4501,
                4525
            ],
            [
                4525,
                5271
            ],
            [
                5271,
                6013
            ],
            [
                6013,
                6063
            ],
            [
                6063,
                6109
            ],
            [
                6109,
                6116
            ],
            [
                6116,
                6467
            ],
            [
                6467,
                7346
            ],
            [
                7346,
                9392
            ],
            [
                9392,
                9948
            ],
            [
                9948,
                10065
            ],
            [
                10065,
                10179
            ],
            [
                10179,
                10191
            ],
            [
                10191,
                10227
            ],
            [
                10227,
                10257
            ],
            [
                10257,
                10361
            ],
            [
                10361,
                10433
            ],
            [
                10433,
                10471
            ],
            [
                10471,
                10489
            ],
            [
                10489,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10544,
                10756
            ],
            [
                10756,
                10850
            ],
            [
                10850,
                10973
            ],
            [
                10973,
                10999
            ],
            [
                10999,
                11166
            ],
            [
                11166,
                11201
            ],
            [
                11201,
                11244
            ],
            [
                11244,
                11562
            ],
            [
                11562,
                11609
            ],
            [
                11609,
                11703
            ],
            [
                11703,
                11730
            ],
            [
                11730,
                11916
            ],
            [
                11916,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12313
            ],
            [
                12313,
                12493
            ],
            [
                12493,
                12509
            ],
            [
                12509,
                12805
            ],
            [
                12805,
                12828
            ],
            [
                12828,
                12850
            ],
            [
                12850,
                13355
            ]
        ],
        "segment_chars": [
            [
                0,
                109
            ],
            [
                109,
                267
            ],
            [
                267,
                329
            ],
            [
                329,
                433
            ],
            [
                433,
                510
            ],
            [
                510,
                563
            ],
            [
                563,
                710
            ],
            [
                710,
                831
            ],
            [
                831,
                874
            ],
            [
                874,
                913
            ],
            [
                913,
                960
            ],
            [
                960,
                1005
            ],
            [
                1005,
                1043
            ],
            [
                1043,
                1145
            ],
            [
                1145,
                1345
            ],
            [
                1345,
                1391
            ],
            [
                1391,
                1524
            ],
            [
                1524,
                1577
            ],
            [
                1577,
                1597
            ],
            [
                1597,
                1736
            ],
            [
                1736,
                1765
            ],
            [
                1765,
                1997
            ],
            [
                1997,
                2121
            ],
            [
                2121,
                2267
            ],
            [
                2267,
                2372
            ],
            [
                2372,
                2446
            ],
            [
                2446,
                2489
            ],
            [
                2489,
                2572
            ],
            [
                2572,
                2637
            ],
            [
                2637,
                2846
            ],
            [
                2846,
                2921
            ],
            [
                2921,
                3123
            ],
            [
                3123,
                3222
            ],
            [
                3222,
                3373
            ],
            [
                3373,
                3623
            ],
            [
                3623,
                3663
            ],
            [
                3663,
                3720
            ],
            [
                3720,
                3776
            ],
            [
                3776,
                3860
            ],
            [
                3860,
                3915
            ],
            [
                3915,
                3978
            ],
            [
                3978,
                4012
            ],
            [
                4012,
                4078
            ],
            [
                4078,
                4155
            ],
            [
                4155,
                4372
            ],
            [
                4372,
                4457
            ],
            [
                4457,
                4479
            ],
            [
                4479,
                4501
            ],
            [
                4501,
                4525
            ],
            [
                4525,
                4567
            ],
            [
                4567,
                4647
            ],
            [
                4647,
                4735
            ],
            [
                4735,
                4815
            ],
            [
                4815,
                4876
            ],
            [
                4876,
                4934
            ],
            [
                4934,
                4992
            ],
            [
                4992,
                5034
            ],
            [
                5034,
                5156
            ],
            [
                5156,
                5233
            ],
            [
                5233,
                5271
            ],
            [
                5271,
                5319
            ],
            [
                5319,
                5423
            ],
            [
                5423,
                5462
            ],
            [
                5462,
                5546
            ],
            [
                5546,
                5637
            ],
            [
                5637,
                5714
            ],
            [
                5714,
                5815
            ],
            [
                5815,
                5876
            ],
            [
                5876,
                5954
            ],
            [
                5954,
                5979
            ],
            [
                5979,
                6013
            ],
            [
                6013,
                6023
            ],
            [
                6023,
                6063
            ],
            [
                6063,
                6109
            ],
            [
                6109,
                6116
            ],
            [
                6116,
                6234
            ],
            [
                6234,
                6387
            ],
            [
                6387,
                6418
            ],
            [
                6418,
                6467
            ],
            [
                6467,
                6587
            ],
            [
                6587,
                6655
            ],
            [
                6655,
                6817
            ],
            [
                6817,
                6850
            ],
            [
                6850,
                6916
            ],
            [
                6916,
                7000
            ],
            [
                7000,
                7117
            ],
            [
                7117,
                7164
            ],
            [
                7164,
                7212
            ],
            [
                7212,
                7346
            ],
            [
                7346,
                7449
            ],
            [
                7449,
                7798
            ],
            [
                7798,
                7860
            ],
            [
                7860,
                7939
            ],
            [
                7939,
                8070
            ],
            [
                8070,
                8124
            ],
            [
                8124,
                8146
            ],
            [
                8146,
                8225
            ],
            [
                8225,
                8316
            ],
            [
                8316,
                8402
            ],
            [
                8402,
                8475
            ],
            [
                8475,
                8711
            ],
            [
                8711,
                8821
            ],
            [
                8821,
                8917
            ],
            [
                8917,
                8966
            ],
            [
                8966,
                9082
            ],
            [
                9082,
                9107
            ],
            [
                9107,
                9192
            ],
            [
                9192,
                9265
            ],
            [
                9265,
                9287
            ],
            [
                9287,
                9392
            ],
            [
                9392,
                9466
            ],
            [
                9466,
                9506
            ],
            [
                9506,
                9604
            ],
            [
                9604,
                9717
            ],
            [
                9717,
                9818
            ],
            [
                9818,
                9851
            ],
            [
                9851,
                9923
            ],
            [
                9923,
                9948
            ],
            [
                9948,
                9991
            ],
            [
                9991,
                10024
            ],
            [
                10024,
                10065
            ],
            [
                10065,
                10096
            ],
            [
                10096,
                10139
            ],
            [
                10139,
                10179
            ],
            [
                10179,
                10191
            ],
            [
                10191,
                10227
            ],
            [
                10227,
                10257
            ],
            [
                10257,
                10313
            ],
            [
                10313,
                10361
            ],
            [
                10361,
                10383
            ],
            [
                10383,
                10433
            ],
            [
                10433,
                10471
            ],
            [
                10471,
                10489
            ],
            [
                10489,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10544,
                10606
            ],
            [
                10606,
                10662
            ],
            [
                10662,
                10706
            ],
            [
                10706,
                10756
            ],
            [
                10756,
                10850
            ],
            [
                10850,
                10921
            ],
            [
                10921,
                10973
            ],
            [
                10973,
                10999
            ],
            [
                10999,
                11059
            ],
            [
                11059,
                11100
            ],
            [
                11100,
                11166
            ],
            [
                11166,
                11201
            ],
            [
                11201,
                11244
            ],
            [
                11244,
                11297
            ],
            [
                11297,
                11320
            ],
            [
                11320,
                11376
            ],
            [
                11376,
                11435
            ],
            [
                11435,
                11493
            ],
            [
                11493,
                11562
            ],
            [
                11562,
                11609
            ],
            [
                11609,
                11647
            ],
            [
                11647,
                11677
            ],
            [
                11677,
                11703
            ],
            [
                11703,
                11730
            ],
            [
                11730,
                11877
            ],
            [
                11877,
                11916
            ],
            [
                11916,
                11964
            ],
            [
                11964,
                12022
            ],
            [
                12022,
                12103
            ],
            [
                12103,
                12152
            ],
            [
                12152,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12227
            ],
            [
                12227,
                12302
            ],
            [
                12302,
                12313
            ],
            [
                12313,
                12493
            ],
            [
                12493,
                12509
            ],
            [
                12509,
                12556
            ],
            [
                12556,
                12583
            ],
            [
                12583,
                12648
            ],
            [
                12648,
                12711
            ],
            [
                12711,
                12805
            ],
            [
                12805,
                12828
            ],
            [
                12828,
                12850
            ],
            [
                12850,
                12925
            ],
            [
                12925,
                13010
            ],
            [
                13010,
                13148
            ],
            [
                13148,
                13264
            ],
            [
                13264,
                13355
            ]
        ],
        "overlap_chars": [
            [
                0,
                79
            ],
            [
                86,
                88
            ],
            [
                93,
                109
            ],
            [
                109,
                113
            ],
            [
                130,
                136
            ],
            [
                116,
                126
            ],
            [
                146,
                207
            ],
            [
                215,
                223
            ],
            [
                247,
                267
            ],
            [
                433,
                438
            ],
            [
                448,
                452
            ],
            [
                477,
                485
            ],
            [
                471,
                476
            ],
            [
                486,
                510
            ],
            [
                510,
                563
            ],
            [
                563,
                660
            ],
            [
                708,
                709
            ],
            [
                710,
                769
            ],
            [
                784,
                794
            ],
            [
                807,
                829
            ],
            [
                834,
                839
            ],
            [
                872,
                874
            ],
            [
                874,
                913
            ],
            [
                913,
                960
            ],
            [
                960,
                1005
            ],
            [
                1005,
                1012
            ],
            [
                1025,
                1043
            ],
            [
                1145,
                1262
            ],
            [
                1268,
                1275
            ],
            [
                1299,
                1345
            ],
            [
                1391,
                1406
            ],
            [
                1430,
                1434
            ],
            [
                1458,
                1487
            ],
            [
                1499,
                1523
            ],
            [
                1524,
                1577
            ],
            [
                1584,
                1597
            ],
            [
                1597,
                1689
            ],
            [
                1734,
                1736
            ],
            [
                1736,
                1765
            ],
            [
                1765,
                1836
            ],
            [
                1882,
                1900
            ],
            [
                1902,
                1905
            ],
            [
                1927,
                1936
            ],
            [
                1941,
                1966
            ],
            [
                1995,
                1996
            ],
            [
                2267,
                2306
            ],
            [
                2312,
                2319
            ],
            [
                2450,
                2478
            ],
            [
                2320,
                2322
            ],
            [
                2487,
                2489
            ],
            [
                2489,
                2518
            ],
            [
                2544,
                2572
            ],
            [
                2572,
                2575
            ],
            [
                2622,
                2635
            ],
            [
                2603,
                2608
            ],
            [
                2576,
                2579
            ],
            [
                2838,
                2844
            ],
            [
                2817,
                2819
            ],
            [
                2644,
                2645
            ],
            [
                2800,
                2816
            ],
            [
                2844,
                2846
            ],
            [
                2846,
                2908
            ],
            [
                2919,
                2921
            ],
            [
                2921,
                2968
            ],
            [
                3044,
                3088
            ],
            [
                2983,
                2986
            ],
            [
                2996,
                2998
            ],
            [
                3121,
                3123
            ],
            [
                3123,
                3179
            ],
            [
                3220,
                3222
            ],
            [
                3311,
                3355
            ],
            [
                3361,
                3371
            ],
            [
                3270,
                3272
            ],
            [
                3292,
                3302
            ],
            [
                3371,
                3372
            ],
            [
                3373,
                3393
            ],
            [
                3405,
                3476
            ],
            [
                3481,
                3492
            ],
            [
                3544,
                3546
            ],
            [
                3493,
                3529
            ],
            [
                3621,
                3623
            ],
            [
                3623,
                3661
            ],
            [
                3663,
                3720
            ],
            [
                3720,
                3727
            ],
            [
                3751,
                3763
            ],
            [
                3774,
                3776
            ],
            [
                3776,
                3779
            ],
            [
                3833,
                3860
            ],
            [
                3860,
                3915
            ],
            [
                3915,
                3978
            ],
            [
                3978,
                4012
            ],
            [
                4012,
                4077
            ],
            [
                4078,
                4137
            ],
            [
                4142,
                4145
            ],
            [
                4149,
                4155
            ],
            [
                4155,
                4284
            ],
            [
                4288,
                4292
            ],
            [
                4303,
                4357
            ],
            [
                4363,
                4372
            ],
            [
                4372,
                4406
            ],
            [
                4455,
                4457
            ],
            [
                4501,
                4525
            ],
            [
                4525,
                4550
            ],
            [
                4553,
                4567
            ],
            [
                4567,
                4647
            ],
            [
                4647,
                4735
            ],
            [
                4735,
                4800
            ],
            [
                4806,
                4815
            ],
            [
                4815,
                4837
            ],
            [
                4844,
                4876
            ],
            [
                4876,
                4912
            ],
            [
                4914,
                4934
            ],
            [
                4934,
                4992
            ],
            [
                4992,
                4993
            ],
            [
                5005,
                5019
            ],
            [
                5032,
                5034
            ],
            [
                5034,
                5063
            ],
            [
                5070,
                5075
            ],
            [
                5076,
                5135
            ],
            [
                5144,
                5156
            ],
            [
                5156,
                5216
            ],
            [
                5218,
                5233
            ],
            [
                5233,
                5261
            ],
            [
                5269,
                5271
            ],
            [
                5271,
                5319
            ],
            [
                5319,
                5339
            ],
            [
                5358,
                5423
            ],
            [
                5423,
                5462
            ],
            [
                5462,
                5525
            ],
            [
                5527,
                5546
            ],
            [
                5546,
                5578
            ],
            [
                5580,
                5601
            ],
            [
                5618,
                5637
            ],
            [
                5637,
                5646
            ],
            [
                5652,
                5666
            ],
            [
                5712,
                5714
            ],
            [
                5876,
                5890
            ],
            [
                5903,
                5954
            ],
            [
                5954,
                5979
            ],
            [
                5979,
                6013
            ],
            [
                6013,
                6023
            ],
            [
                6023,
                6063
            ],
            [
                6063,
                6109
            ],
            [
                6109,
                6116
            ],
            [
                6116,
                6143
            ],
            [
                6195,
                6234
            ],
            [
                6234,
                6263
            ],
            [
                6264,
                6285
            ],
            [
                6296,
                6325
            ],
            [
                6369,
                6378
            ],
            [
                6385,
                6386
            ],
            [
                6387,
                6418
            ],
            [
                6418,
                6467
            ],
            [
                6467,
                6472
            ],
            [
                6473,
                6479
            ],
            [
                6490,
                6587
            ],
            [
                6587,
                6601
            ],
            [
                6612,
                6653
            ],
            [
                6664,
                6665
            ],
            [
                6772,
                6778
            ],
            [
                6707,
                6709
            ],
            [
                6842,
                6848
            ],
            [
                6817,
                6832
            ],
            [
                6848,
                6850
            ],
            [
                6871,
                6904
            ],
            [
                6850,
                6854
            ],
            [
                6905,
                6914
            ],
            [
                6927,
                6943
            ],
            [
                6950,
                6957
            ],
            [
                6967,
                7000
            ],
            [
                7164,
                7171
            ],
            [
                7162,
                7163
            ],
            [
                7176,
                7180
            ],
            [
                7190,
                7191
            ],
            [
                7181,
                7190
            ],
            [
                7210,
                7211
            ],
            [
                7346,
                7449
            ],
            [
                7449,
                7545
            ],
            [
                7620,
                7627
            ],
            [
                7681,
                7684
            ],
            [
                7632,
                7644
            ],
            [
                7734,
                7767
            ],
            [
                7781,
                7796
            ],
            [
                7691,
                7693
            ],
            [
                7772,
                7777
            ],
            [
                7796,
                7798
            ],
            [
                7798,
                7860
            ],
            [
                7860,
                7939
            ],
            [
                7939,
                8013
            ],
            [
                8044,
                8069
            ],
            [
                8124,
                8146
            ],
            [
                8146,
                8224
            ],
            [
                8225,
                8289
            ],
            [
                8297,
                8305
            ],
            [
                8314,
                8315
            ],
            [
                8316,
                8326
            ],
            [
                8346,
                8381
            ],
            [
                8393,
                8402
            ],
            [
                8402,
                8448
            ],
            [
                8473,
                8475
            ],
            [
                8711,
                8750
            ],
            [
                8785,
                8795
            ],
            [
                8812,
                8819
            ],
            [
                8751,
                8782
            ],
            [
                8819,
                8821
            ],
            [
                9013,
                9016
            ],
            [
                9017,
                9081
            ],
            [
                9082,
                9107
            ],
            [
                9107,
                9192
            ],
            [
                9192,
                9195
            ],
            [
                9210,
                9264
            ],
            [
                9265,
                9287
            ],
            [
                9287,
                9392
            ],
            [
                9392,
                9415
            ],
            [
                9464,
                9466
            ],
            [
                9466,
                9506
            ],
            [
                9506,
                9542
            ],
            [
                9567,
                9569
            ],
            [
                9579,
                9604
            ],
            [
                9604,
                9611
            ],
            [
                9616,
                9658
            ],
            [
                9720,
                9728
            ],
            [
                9737,
                9779
            ],
            [
                9799,
                9816
            ],
            [
                9839,
                9851
            ],
            [
                9851,
                9857
            ],
            [
                9868,
                9880
            ],
            [
                9890,
                9922
            ],
            [
                9923,
                9945
            ],
            [
                10139,
                10179
            ],
            [
                10179,
                10191
            ],
            [
                10191,
                10227
            ],
            [
                10227,
                10257
            ],
            [
                10257,
                10313
            ],
            [
                10313,
                10331
            ],
            [
                10349,
                10358
            ],
            [
                10358,
                10361
            ],
            [
                10361,
                10381
            ],
            [
                10433,
                10468
            ],
            [
                10495,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10544,
                10548
            ],
            [
                10560,
                10568
            ],
            [
                10578,
                10587
            ],
            [
                10604,
                10606
            ],
            [
                10706,
                10756
            ],
            [
                10756,
                10850
            ],
            [
                10850,
                10921
            ],
            [
                10921,
                10973
            ],
            [
                10973,
                10999
            ],
            [
                10999,
                11018
            ],
            [
                11024,
                11059
            ],
            [
                11059,
                11100
            ],
            [
                11145,
                11146
            ],
            [
                11150,
                11163
            ],
            [
                11100,
                11116
            ],
            [
                11121,
                11127
            ],
            [
                11163,
                11166
            ],
            [
                11166,
                11174
            ],
            [
                11187,
                11201
            ],
            [
                11201,
                11217
            ],
            [
                11241,
                11244
            ],
            [
                11244,
                11297
            ],
            [
                11297,
                11320
            ],
            [
                11320,
                11352
            ],
            [
                11374,
                11376
            ],
            [
                11647,
                11677
            ],
            [
                11677,
                11703
            ],
            [
                11703,
                11730
            ],
            [
                11730,
                11769
            ],
            [
                11875,
                11876
            ],
            [
                11916,
                11964
            ],
            [
                11964,
                12022
            ],
            [
                12022,
                12053
            ],
            [
                12103,
                12146
            ],
            [
                12150,
                12152
            ],
            [
                12152,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12227
            ],
            [
                12302,
                12313
            ],
            [
                12313,
                12364
            ],
            [
                12378,
                12379
            ],
            [
                12446,
                12468
            ],
            [
                12478,
                12493
            ],
            [
                12493,
                12509
            ],
            [
                12509,
                12556
            ],
            [
                12556,
                12583
            ],
            [
                12626,
                12648
            ],
            [
                12648,
                12711
            ],
            [
                12731,
                12805
            ],
            [
                12805,
                12828
            ],
            [
                12828,
                12850
            ],
            [
                12850,
                12925
            ],
            [
                12925,
                12931
            ],
            [
                12943,
                12974
            ],
            [
                13000,
                13010
            ],
            [
                13010,
                13047
            ],
            [
                13127,
                13131
            ],
            [
                13146,
                13148
            ],
            [
                13148,
                13151
            ],
            [
                13187,
                13190
            ],
            [
                13202,
                13206
            ],
            [
                13211,
                13264
            ],
            [
                13264,
                13268
            ],
            [
                13278,
                13310
            ],
            [
                13326,
                13354
            ]
        ],
        "row_chars": [
            [
                0,
                109
            ],
            [
                109,
                267
            ],
            [
                267,
                329
            ],
            [
                329,
                433
            ],
            [
                433,
                510
            ],
            [
                510,
                563
            ],
            [
                563,
                710
            ],
            [
                710,
                874
            ],
            [
                874,
                913
            ],
            [
                913,
                960
            ],
            [
                960,
                1005
            ],
            [
                1005,
                1043
            ],
            [
                1043,
                1145
            ],
            [
                1145,
                1345
            ],
            [
                1345,
                1391
            ],
            [
                1391,
                1524
            ],
            [
                1524,
                1577
            ],
            [
                1577,
                1597
            ],
            [
                1597,
                1736
            ],
            [
                1736,
                1765
            ],
            [
                1765,
                1997
            ],
            [
                1997,
                2121
            ],
            [
                2121,
                2267
            ],
            [
                2267,
                2489
            ],
            [
                2489,
                2572
            ],
            [
                2572,
                2846
            ],
            [
                2846,
                2921
            ],
            [
                2921,
                3123
            ],
            [
                3123,
                3222
            ],
            [
                3222,
                3373
            ],
            [
                3373,
                3623
            ],
            [
                3623,
                3720
            ],
            [
                3720,
                3776
            ],
            [
                3776,
                3860
            ],
            [
                3860,
                3915
            ],
            [
                3915,
                3978
            ],
            [
                3978,
                4012
            ],
            [
                4012,
                4078
            ],
            [
                4078,
                4155
            ],
            [
                4155,
                4372
            ],
            [
                4372,
                4457
            ],
            [
                4457,
                4479
            ],
            [
                4479,
                4501
            ],
            [
                4501,
                4525
            ],
            [
                4525,
                4567
            ],
            [
                4567,
                4647
            ],
            [
                4647,
                4735
            ],
            [
                4735,
                4815
            ],
            [
                4815,
                4876
            ],
            [
                4876,
                4934
            ],
            [
                4934,
                4992
            ],
            [
                4992,
                5034
            ],
            [
                5034,
                5156
            ],
            [
                5156,
                5233
            ],
            [
                5233,
                5271
            ],
            [
                5271,
                5319
            ],
            [
                5319,
                5423
            ],
            [
                5423,
                5462
            ],
            [
                5462,
                5546
            ],
            [
                5546,
                5637
            ],
            [
                5637,
                5714
            ],
            [
                5714,
                5815
            ],
            [
                5815,
                5876
            ],
            [
                5876,
                5954
            ],
            [
                5954,
                5979
            ],
            [
                5979,
                6013
            ],
            [
                6013,
                6023
            ],
            [
                6023,
                6063
            ],
            [
                6063,
                6109
            ],
            [
                6109,
                6116
            ],
            [
                6116,
                6234
            ],
            [
                6234,
                6387
            ],
            [
                6387,
                6418
            ],
            [
                6418,
                6467
            ],
            [
                6467,
                6587
            ],
            [
                6587,
                6850
            ],
            [
                6850,
                7000
            ],
            [
                7000,
                7117
            ],
            [
                7117,
                7212
            ],
            [
                7212,
                7346
            ],
            [
                7346,
                7449
            ],
            [
                7449,
                7798
            ],
            [
                7798,
                7860
            ],
            [
                7860,
                7939
            ],
            [
                7939,
                8070
            ],
            [
                8070,
                8124
            ],
            [
                8124,
                8146
            ],
            [
                8146,
                8225
            ],
            [
                8225,
                8316
            ],
            [
                8316,
                8402
            ],
            [
                8402,
                8475
            ],
            [
                8475,
                8711
            ],
            [
                8711,
                8821
            ],
            [
                8821,
                8917
            ],
            [
                8917,
                8966
            ],
            [
                8966,
                9082
            ],
            [
                9082,
                9107
            ],
            [
                9107,
                9192
            ],
            [
                9192,
                9265
            ],
            [
                9265,
                9287
            ],
            [
                9287,
                9392
            ],
            [
                9392,
                9466
            ],
            [
                9466,
                9506
            ],
            [
                9506,
                9604
            ],
            [
                9604,
                9851
            ],
            [
                9851,
                9923
            ],
            [
                9923,
                9948
            ],
            [
                9948,
                9991
            ],
            [
                9991,
                10024
            ],
            [
                10024,
                10065
            ],
            [
                10065,
                10096
            ],
            [
                10096,
                10139
            ],
            [
                10139,
                10179
            ],
            [
                10179,
                10191
            ],
            [
                10191,
                10227
            ],
            [
                10227,
                10257
            ],
            [
                10257,
                10313
            ],
            [
                10313,
                10361
            ],
            [
                10361,
                10383
            ],
            [
                10383,
                10433
            ],
            [
                10433,
                10471
            ],
            [
                10471,
                10489
            ],
            [
                10489,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10544,
                10606
            ],
            [
                10606,
                10662
            ],
            [
                10662,
                10706
            ],
            [
                10706,
                10756
            ],
            [
                10756,
                10850
            ],
            [
                10850,
                10921
            ],
            [
                10921,
                10973
            ],
            [
                10973,
                10999
            ],
            [
                10999,
                11059
            ],
            [
                11059,
                11100
            ],
            [
                11100,
                11166
            ],
            [
                11166,
                11201
            ],
            [
                11201,
                11244
            ],
            [
                11244,
                11297
            ],
            [
                11297,
                11320
            ],
            [
                11320,
                11376
            ],
            [
                11376,
                11435
            ],
            [
                11435,
                11493
            ],
            [
                11493,
                11562
            ],
            [
                11562,
                11609
            ],
            [
                11609,
                11647
            ],
            [
                11647,
                11677
            ],
            [
                11677,
                11703
            ],
            [
                11703,
                11730
            ],
            [
                11730,
                11877
            ],
            [
                11877,
                11916
            ],
            [
                11916,
                11964
            ],
            [
                11964,
                12022
            ],
            [
                12022,
                12152
            ],
            [
                12152,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12227
            ],
            [
                12227,
                12302
            ],
            [
                12302,
                12313
            ],
            [
                12313,
                12493
            ],
            [
                12493,
                12509
            ],
            [
                12509,
                12556
            ],
            [
                12556,
                12583
            ],
            [
                12583,
                12648
            ],
            [
                12648,
                12711
            ],
            [
                12711,
                12805
            ],
            [
                12805,
                12828
            ],
            [
                12828,
                12850
            ],
            [
                12850,
                12925
            ],
            [
                12925,
                13010
            ],
            [
                13010,
                13148
            ],
            [
                13148,
                13264
            ],
            [
                13264,
                13355
            ]
        ]
    },
    "abridged": {
        "text": "Marie Melmotte was hardly satisfied with the note which she received from Didon on Monday morning. With French volubility, Didon declared that she would be turned out of the house if Monsieur knew what she was doing. Marie retorted that Monsieur could not possibly know anything about it. In that house nobody ever told anything to Monsieur. He was regarded as the general enemy, against whom the whole household was always making ambushes.\nIt is not a pleasant condition for a master of a house; but the master knew how he was placed, and never trusted anyone. Of course his daughter might run away. But who would run away with her without money? And there could be no money except from him. He knew his own strength. His daughter was valuable to him because she might make him the father-in-law of a Marquis or an Earl; but the higher he rose, the less need had he of his daughter's aid. Lord Alfred had suggested that by certain uses of his money, Melmotte might be made a baronet.\n\"But if they should say that I'm not an Englishman?\" asked Melmotte. Lord Alfred had explained that it was not necessary that he should have been born in England. No questions would be asked. Let him first get into Parliament, and then spend a little money on the Conservative side, and entertain lavishly, and the baronetcy would follow.\nMarie was dissatisfied with her letter, because there was no word of love in it. An impassioned correspondence would be delightful to her. She loved the young man, and was living in a new, marvellous world. As days went on she ceased to be a child, and her courage grew. She became conscious of an identity of her own, partly because her increasing familiarity with grand people meant she was no longer in awe of them. She was no longer afraid of saying No to the Nidderdales. She was drifting away even from the sense of obligation to her father.\nHad her mind been as independent when Lord Nidderdale first came to her, she might indeed have loved him; for, as a man, he was infinitely better than Sir Felix. But at that time she had been childish, and he, finding her to be a child, had hardly spoken to her. And she had resented it. But she was a child no longer. She was in love with Sir Felix, and had told her love. Whatever difficulties there might be, she intended to be true. If necessary, she would run away. Sir Felix was her idol, and she abandoned herself to its worship.\nBut she desired that her idol should be of flesh and blood, not wood. She was at first half-inclined to be angry; but as she sat with his letter in her hand, she remembered that he did not know Didon well, and that he might be afraid to trust his raptures to the maid's custody. She could write to him at his club.\nDearest, Dearest Felix,\nI have just got your note - such a scrap! Of course papa would talk about money because he never thinks of anything else. I don't know anything about money, and I don't care in the least how much you have got. Papa has got plenty, and I think he would give us some if we were married. I have told mamma, but she is always afraid of everything. Papa is very cross to her sometimes; more so than to me. I will try to tell him, though I can't always get at him. I hardly see him. But I don't mean to be afraid, and I will tell him that on my word and honour I will never marry anyone except you. I don't think he will beat me, but if he does, I'll bear it, for your sake. He does beat mamma sometimes.\nYou can write to me quite safely through Didon. I think if you would give her something, it would help, as she is very fond of money. Do write and tell me that you love me. I love you better than anything in the world, and I will never, never give you up. I suppose you can come and call, unless papa tells the servants not to let you in. I'll find out from Didon. Now I am going downstairs to breakfast with mamma and that Miss Longestaffe. She is a stuck-up thing. Didn't you think so at Caversham?\nGood-bye. You are my own, own, own darling Felix,\nAnd I am your own, own affectionate ladylove,\nMarie.\nSir Felix when he read this turned up his nose and shook his head. He thought if there were much more of that kind of thing, he could not go on with it, despite the money.\n\"What an infernal little ass!\" he said to himself as he crumpled the letter up.\nMarie, having entrusted her letter to Didon, together with a little present of gloves and shoes, went down to breakfast. Her mother was there, and Miss Longestaffe soon followed, having resolved to endure Madame Melmotte. She had to go out in the carriage with her every day, and could only go to parties if Madame Melmotte accompanied her. She met Mr. Melmotte only infrequently, at dinner.\nBut Miss Longestaffe already perceived that her old acquaintances were changed in their manner to her. She had written to her dear friend Lady Monogram, whom she had known intimately as Miss Triplex, telling her she had been forced to consent to return to London as Madame Melmotte's guest. She hoped her friend would not throw her off on that account. She had been very affectionate, with a poor attempt at fun, and rather humble. Georgiana Longestaffe had never been humble before; but the Monograms were in such an excellent set!\nBut it was of no use. She had been humble in vain, for Lady Monogram had not even answered her note.\n\"She never really cared for anybody but herself,\" Georgiana said wretchedly.\nThen, too, Lord Nidderdale's manner to her had changed. She was not a fool, and could read these signs. She could see it in the faces of people - especially the men - as they greeted her in the park. She already understood that others understood that she had degraded herself.\n\"What's all this about?\" Lord Grasslough had said to her, seeing her come into a room behind Madame Melmotte. She had tried to laugh, and had then turned away her face.\n\"Impudent scoundrel!\" she said to herself, knowing that a fortnight ago he would not have dared to address her in such a tone.\nA day or two afterwards a memorable event occurred. Dolly Longestaffe called on his sister! His mind must have been much stirred to move him to such uncommon action. He came at a very early hour, not much after noon, and declared to the servant that he did not wish to see any of the family, only his sister. He was shown into a room where Georgiana joined him.\n\"What's all this about? Why are you staying with these people?\"\n\"Ask papa.\"\n\"I don't suppose he sent you here?\"\n\"That's just what he did do.\"\n\"You needn't have come, I suppose, unless you liked it. Is it because they aren't coming up to London?\"\n\"Exactly that, Dolly.\"\n\"Don't you feel ashamed of yourself? I feel ashamed for you.\"\n\"Everybody comes here.\"\n\"No; everybody does not stay here. I thought you used to think so much of yourself.\"\n\"I think as much of myself as ever I did,\" said Georgiana, hardly able to restrain her tears.\n\"I can tell you nobody else will think much of you if you remain here. I could hardly believe it when Nidderdale told me.\"\n\"What did he say, Dolly?\"\n\"He didn't say much, but I could see what he thought. And of course everybody thinks the same. I don't understand how you can like these people!\"\n\"I don't - I hate them.\"\n\"Then why do you stay here?\"\n\"Oh, Dolly, it is impossible to make you understand. A man is so different. You can go just where you please. And your fortune is made for you. What is to become of me?\"\n\"You mean about marrying?\"\n\"I mean altogether,\" said the poor girl.\n\"I don't see how the Melmottes are to help you. The long and the short of it is, you oughtn't to be here. It's not often I interfere, but I shall write to the governor, and tell him. He should have known better.\"\n\"Don't write to papa, Dolly!\"\n\"Yes, I shall. Good-bye.\"\nAs soon as he had left he hurried down to some club, and actually did write to his father.\nMy Dear Father,\nI have seen Georgiana at Mr. Melmotte's house. She ought not to be there. Everybody says he's a swindler. For the sake of the family I hope you will get her home again. I think Bruton Street is the proper place for the girls at this time of the year.\nYour affectionate son,\nAdolphus Longestaffe.\nThis letter fell upon old Mr. Longestaffe at Caversham like a thunderbolt. It was extraordinary to him that his son should have written a letter. The Melmottes must be very bad indeed for him to expend such energies. But he was angry at being told that he ought to have taken his family back to town. This came from his son, who had refused to help him in his difficulties!",
        "paragraph_chars": [
            [
                0,
                441
            ],
            [
                441,
                985
            ],
            [
                985,
                1324
            ],
            [
                1324,
                1872
            ],
            [
                1872,
                2409
            ],
            [
                2409,
                2724
            ],
            [
                2724,
                2748
            ],
            [
                2748,
                3447
            ],
            [
                3447,
                3948
            ],
            [
                3948,
                3998
            ],
            [
                3998,
                4044
            ],
            [
                4044,
                4051
            ],
            [
                4051,
                4223
            ],
            [
                4223,
                4303
            ],
            [
                4303,
                4695
            ],
            [
                4695,
                5228
            ],
            [
                5228,
                5329
            ],
            [
                5329,
                5406
            ],
            [
                5406,
                5683
            ],
            [
                5683,
                5852
            ],
            [
                5852,
                5979
            ],
            [
                5979,
                6341
            ],
            [
                6341,
                6405
            ],
            [
                6405,
                6417
            ],
            [
                6417,
                6453
            ],
            [
                6453,
                6483
            ],
            [
                6483,
                6587
            ],
            [
                6587,
                6610
            ],
            [
                6610,
                6672
            ],
            [
                6672,
                6696
            ],
            [
                6696,
                6781
            ],
            [
                6781,
                6875
            ],
            [
                6875,
                6998
            ],
            [
                6998,
                7024
            ],
            [
                7024,
                7170
            ],
            [
                7170,
                7195
            ],
            [
                7195,
                7224
            ],
            [
                7224,
                7394
            ],
            [
                7394,
                7421
            ],
            [
                7421,
                7462
            ],
            [
                7462,
                7675
            ],
            [
                7675,
                7705
            ],
            [
                7705,
                7731
            ],
            [
                7731,
                7822
            ],
            [
                7822,
                7838
            ],
            [
                7838,
                8089
            ],
            [
                8089,
                8112
            ],
            [
                8112,
                8134
            ],
            [
                8134,
                8507
            ]
        ],
        "segment_chars": [
            [
                0,
                99
            ],
            [
                99,
                217
            ],
            [
                217,
                289
            ],
            [
                289,
                342
            ],
            [
                342,
                441
            ],
            [
                441,
                562
            ],
            [
                562,
                601
            ],
            [
                601,
                648
            ],
            [
                648,
                693
            ],
            [
                693,
                719
            ],
            [
                719,
                890
            ],
            [
                890,
                985
            ],
            [
                985,
                1038
            ],
            [
                1038,
                1054
            ],
            [
                1054,
                1148
            ],
            [
                1148,
                1177
            ],
            [
                1177,
                1324
            ],
            [
                1324,
                1405
            ],
            [
                1405,
                1463
            ],
            [
                1463,
                1531
            ],
            [
                1531,
                1595
            ],
            [
                1595,
                1743
            ],
            [
                1743,
                1801
            ],
            [
                1801,
                1872
            ],
            [
                1872,
                2034
            ],
            [
                2034,
                2135
            ],
            [
                2135,
                2160
            ],
            [
                2160,
                2191
            ],
            [
                2191,
                2246
            ],
            [
                2246,
                2309
            ],
            [
                2309,
                2343
            ],
            [
                2343,
                2409
            ],
            [
                2409,
                2479
            ],
            [
                2479,
                2688
            ],
            [
                2688,
                2724
            ],
            [
                2724,
                2748
            ],
            [
                2748,
                2790
            ],
            [
                2790,
                2870
            ],
            [
                2870,
                2958
            ],
            [
                2958,
                3033
            ],
            [
                3033,
                3092
            ],
            [
                3092,
                3149
            ],
            [
                3149,
                3207
            ],
            [
                3207,
                3225
            ],
            [
                3225,
                3341
            ],
            [
                3341,
                3417
            ],
            [
                3417,
                3447
            ],
            [
                3447,
                3495
            ],
            [
                3495,
                3581
            ],
            [
                3581,
                3620
            ],
            [
                3620,
                3703
            ],
            [
                3703,
                3786
            ],
            [
                3786,
                3812
            ],
            [
                3812,
                3889
            ],
            [
                3889,
                3914
            ],
            [
                3914,
                3948
            ],
            [
                3948,
                3958
            ],
            [
                3958,
                3998
            ],
            [
                3998,
                4044
            ],
            [
                4044,
                4051
            ],
            [
                4051,
                4118
            ],
            [
                4118,
                4223
            ],
            [
                4223,
                4254
            ],
            [
                4254,
                4303
            ],
            [
                4303,
                4424
            ],
            [
                4424,
                4525
            ],
            [
                4525,
                4644
            ],
            [
                4644,
                4695
            ],
            [
                4695,
                4798
            ],
            [
                4798,
                4986
            ],
            [
                4986,
                5048
            ],
            [
                5048,
                5127
            ],
            [
                5127,
                5228
            ],
            [
                5228,
                5250
            ],
            [
                5250,
                5329
            ],
            [
                5329,
                5406
            ],
            [
                5406,
                5462
            ],
            [
                5462,
                5510
            ],
            [
                5510,
                5606
            ],
            [
                5606,
                5683
            ],
            [
                5683,
                5708
            ],
            [
                5708,
                5793
            ],
            [
                5793,
                5852
            ],
            [
                5852,
                5874
            ],
            [
                5874,
                5979
            ],
            [
                5979,
                6031
            ],
            [
                6031,
                6071
            ],
            [
                6071,
                6145
            ],
            [
                6145,
                6288
            ],
            [
                6288,
                6341
            ],
            [
                6341,
                6365
            ],
            [
                6365,
                6405
            ],
            [
                6405,
                6417
            ],
            [
                6417,
                6453
            ],
            [
                6453,
                6483
            ],
            [
                6483,
                6539
            ],
            [
                6539,
                6587
            ],
            [
                6587,
                6610
            ],
            [
                6610,
                6647
            ],
            [
                6647,
                6672
            ],
            [
                6672,
                6696
            ],
            [
                6696,
                6731
            ],
            [
                6731,
                6781
            ],
            [
                6781,
                6875
            ],
            [
                6875,
                6946
            ],
            [
                6946,
                6998
            ],
            [
                6998,
                7024
            ],
            [
                7024,
                7078
            ],
            [
                7078,
                7119
            ],
            [
                7119,
                7170
            ],
            [
                7170,
                7195
            ],
            [
                7195,
                7224
            ],
            [
                7224,
                7277
            ],
            [
                7277,
                7300
            ],
            [
                7300,
                7334
            ],
            [
                7334,
                7368
            ],
            [
                7368,
                7394
            ],
            [
                7394,
                7421
            ],
            [
                7421,
                7462
            ],
            [
                7462,
                7510
            ],
            [
                7510,
                7568
            ],
            [
                7568,
                7645
            ],
            [
                7645,
                7675
            ],
            [
                7675,
                7705
            ],
            [
                7705,
                7720
            ],
            [
                7720,
                7731
            ],
            [
                7731,
                7822
            ],
            [
                7822,
                7838
            ],
            [
                7838,
                7885
            ],
            [
                7885,
                7912
            ],
            [
                7912,
                7944
            ],
            [
                7944,
                8007
            ],
            [
                8007,
                8089
            ],
            [
                8089,
                8112
            ],
            [
                8112,
                8134
            ],
            [
                8134,
                8209
            ],
            [
                8209,
                8280
            ],
            [
                8280,
                8351
            ],
            [
                8351,
                8435
            ],
            [
                8435,
                8507
            ]
        ],
        "overlap_chars": [
            [
                0,
                79
            ],
            [
                80,
                82
            ],
            [
                83,
                99
            ],
            [
                99,
                103
            ],
            [
                104,
                110
            ],
            [
                111,
                121
            ],
            [
                121,
                182
            ],
            [
                183,
                191
            ],
            [
                197,
                217
            ],
            [
                217,
                222
            ],
            [
                232,
                236
            ],
            [
                237,
                245
            ],
            [
                246,
                251
            ],
            [
                265,
                289
            ],
            [
                289,
                342
            ],
            [
                342,
                439
            ],
            [
                439,
                440
            ],
            [
                441,
                500
            ],
            [
                501,
                511
            ],
            [
                512,
                534
            ],
            [
                540,
                545
            ],
            [
                560,
                562
            ],
            [
                562,
                601
            ],
            [
                601,
                648
            ],
            [
                648,
                693
            ],
            [
                693,
                700
            ],
            [
                701,
                719
            ],
            [
                719,
                836
            ],
            [
                837,
                844
            ],
            [
                844,
                890
            ],
            [
                890,
                905
            ],
            [
                916,
                920
            ],
            [
                921,
                950
            ],
            [
                960,
                984
            ],
            [
                985,
                1038
            ],
            [
                1041,
                1054
            ],
            [
                1054,
                1146
            ],
            [
                1146,
                1148
            ],
            [
                1148,
                1177
            ],
            [
                1177,
                1248
            ],
            [
                1249,
                1267
            ],
            [
                1268,
                1271
            ],
            [
                1272,
                1281
            ],
            [
                1290,
                1315
            ],
            [
                1322,
                1323
            ],
            [
                1324,
                1363
            ],
            [
                1364,
                1371
            ],
            [
                1372,
                1400
            ],
            [
                1401,
                1403
            ],
            [
                1403,
                1405
            ],
            [
                1405,
                1434
            ],
            [
                1435,
                1463
            ],
            [
                1463,
                1466
            ],
            [
                1473,
                1486
            ],
            [
                1486,
                1491
            ],
            [
                1492,
                1495
            ],
            [
                1496,
                1502
            ],
            [
                1503,
                1505
            ],
            [
                1511,
                1512
            ],
            [
                1513,
                1529
            ],
            [
                1529,
                1531
            ],
            [
                1531,
                1593
            ],
            [
                1593,
                1595
            ],
            [
                1595,
                1642
            ],
            [
                1658,
                1702
            ],
            [
                1713,
                1716
            ],
            [
                1727,
                1729
            ],
            [
                1741,
                1743
            ],
            [
                1743,
                1799
            ],
            [
                1799,
                1801
            ],
            [
                1801,
                1845
            ],
            [
                1846,
                1856
            ],
            [
                1857,
                1859
            ],
            [
                1860,
                1870
            ],
            [
                1870,
                1871
            ],
            [
                1872,
                1892
            ],
            [
                1905,
                1976
            ],
            [
                1981,
                1992
            ],
            [
                1993,
                1995
            ],
            [
                1996,
                2032
            ],
            [
                2032,
                2034
            ],
            [
                2034,
                2072
            ],
            [
                2078,
                2135
            ],
            [
                2135,
                2142
            ],
            [
                2143,
                2155
            ],
            [
                2158,
                2160
            ],
            [
                2160,
                2163
            ],
            [
                2164,
                2191
            ],
            [
                2191,
                2246
            ],
            [
                2246,
                2309
            ],
            [
                2309,
                2343
            ],
            [
                2343,
                2408
            ],
            [
                2409,
                2468
            ],
            [
                2469,
                2472
            ],
            [
                2473,
                2479
            ],
            [
                2479,
                2608
            ],
            [
                2609,
                2613
            ],
            [
                2613,
                2667
            ],
            [
                2679,
                2688
            ],
            [
                2688,
                2722
            ],
            [
                2722,
                2724
            ],
            [
                2724,
                2748
            ],
            [
                2748,
                2773
            ],
            [
                2776,
                2790
            ],
            [
                2790,
                2870
            ],
            [
                2870,
                2958
            ],
            [
                2958,
                3023
            ],
            [
                3024,
                3033
            ],
            [
                3033,
                3055
            ],
            [
                3060,
                3092
            ],
            [
                3092,
                3128
            ],
            [
                3129,
                3149
            ],
            [
                3149,
                3207
            ],
            [
                3207,
                3208
            ],
            [
                3209,
                3223
            ],
            [
                3223,
                3225
            ],
            [
                3225,
                3254
            ],
            [
                3254,
                3259
            ],
            [
                3262,
                3321
            ],
            [
                3329,
                3341
            ],
            [
                3341,
                3401
            ],
            [
                3402,
                3417
            ],
            [
                3417,
                3445
            ],
            [
                3445,
                3447
            ],
            [
                3447,
                3495
            ],
            [
                3495,
                3515
            ],
            [
                3516,
                3581
            ],
            [
                3581,
                3620
            ],
            [
                3620,
                3683
            ],
            [
                3684,
                3703
            ],
            [
                3703,
                3735
            ],
            [
                3736,
                3757
            ],
            [
                3767,
                3786
            ],
            [
                3786,
                3795
            ],
            [
                3796,
                3810
            ],
            [
                3810,
                3812
            ],
            [
                3812,
                3826
            ],
            [
                3838,
                3889
            ],
            [
                3889,
                3914
            ],
            [
                3914,
                3948
            ],
            [
                3948,
                3958
            ],
            [
                3958,
                3998
            ],
            [
                3998,
                4044
            ],
            [
                4044,
                4051
            ],
            [
                4051,
                4078
            ],
            [
                4079,
                4118
            ],
            [
                4118,
                4147
            ],
            [
                4153,
                4174
            ],
            [
                4174,
                4203
            ],
            [
                4212,
                4221
            ],
            [
                4221,
                4222
            ],
            [
                4223,
                4254
            ],
            [
                4254,
                4303
            ],
            [
                4303,
                4308
            ],
            [
                4310,
                4316
            ],
            [
                4327,
                4424
            ],
            [
                4424,
                4438
            ],
            [
                4439,
                4480
            ],
            [
                4480,
                4481
            ],
            [
                4482,
                4488
            ],
            [
                4498,
                4500
            ],
            [
                4501,
                4507
            ],
            [
                4508,
                4523
            ],
            [
                4523,
                4525
            ],
            [
                4525,
                4558
            ],
            [
                4559,
                4563
            ],
            [
                4568,
                4577
            ],
            [
                4583,
                4599
            ],
            [
                4600,
                4607
            ],
            [
                4611,
                4644
            ],
            [
                4644,
                4651
            ],
            [
                4654,
                4655
            ],
            [
                4665,
                4669
            ],
            [
                4682,
                4683
            ],
            [
                4684,
                4693
            ],
            [
                4693,
                4694
            ],
            [
                4695,
                4798
            ],
            [
                4798,
                4894
            ],
            [
                4895,
                4902
            ],
            [
                4903,
                4906
            ],
            [
                4907,
                4919
            ],
            [
                4927,
                4960
            ],
            [
                4961,
                4976
            ],
            [
                4976,
                4978
            ],
            [
                4979,
                4984
            ],
            [
                4984,
                4986
            ],
            [
                4986,
                5048
            ],
            [
                5048,
                5127
            ],
            [
                5127,
                5201
            ],
            [
                5202,
                5227
            ],
            [
                5228,
                5250
            ],
            [
                5250,
                5328
            ],
            [
                5329,
                5393
            ],
            [
                5394,
                5402
            ],
            [
                5404,
                5405
            ],
            [
                5406,
                5416
            ],
            [
                5417,
                5452
            ],
            [
                5453,
                5462
            ],
            [
                5462,
                5508
            ],
            [
                5508,
                5510
            ],
            [
                5510,
                5549
            ],
            [
                5552,
                5562
            ],
            [
                5563,
                5570
            ],
            [
                5573,
                5604
            ],
            [
                5604,
                5606
            ],
            [
                5606,
                5609
            ],
            [
                5618,
                5682
            ],
            [
                5683,
                5708
            ],
            [
                5708,
                5793
            ],
            [
                5793,
                5796
            ],
            [
                5797,
                5851
            ],
            [
                5852,
                5874
            ],
            [
                5874,
                5979
            ],
            [
                5979,
                6002
            ],
            [
                6029,
                6031
            ],
            [
                6031,
                6071
            ],
            [
                6071,
                6107
            ],
            [
                6108,
                6110
            ],
            [
                6120,
                6145
            ],
            [
                6145,
                6152
            ],
            [
                6153,
                6195
            ],
            [
                6200,
                6208
            ],
            [
                6209,
                6251
            ],
            [
                6252,
                6269
            ],
            [
                6276,
                6288
            ],
            [
                6288,
                6294
            ],
            [
                6295,
                6307
            ],
            [
                6308,
                6340
            ],
            [
                6341,
                6363
            ],
            [
                6365,
                6405
            ],
            [
                6405,
                6417
            ],
            [
                6417,
                6453
            ],
            [
                6453,
                6483
            ],
            [
                6483,
                6539
            ],
            [
                6539,
                6557
            ],
            [
                6565,
                6574
            ],
            [
                6584,
                6587
            ],
            [
                6587,
                6607
            ],
            [
                6610,
                6645
            ],
            [
                6647,
                6672
            ],
            [
                6672,
                6696
            ],
            [
                6696,
                6700
            ],
            [
                6711,
                6719
            ],
            [
                6720,
                6729
            ],
            [
                6729,
                6731
            ],
            [
                6731,
                6781
            ],
            [
                6781,
                6875
            ],
            [
                6875,
                6946
            ],
            [
                6946,
                6998
            ],
            [
                6998,
                7024
            ],
            [
                7024,
                7043
            ],
            [
                7043,
                7078
            ],
            [
                7078,
                7119
            ],
            [
                7119,
                7120
            ],
            [
                7124,
                7137
            ],
            [
                7138,
                7154
            ],
            [
                7161,
                7167
            ],
            [
                7167,
                7170
            ],
            [
                7170,
                7178
            ],
            [
                7181,
                7195
            ],
            [
                7195,
                7211
            ],
            [
                7221,
                7224
            ],
            [
                7224,
                7277
            ],
            [
                7277,
                7300
            ],
            [
                7300,
                7332
            ],
            [
                7332,
                7334
            ],
            [
                7338,
                7368
            ],
            [
                7368,
                7394
            ],
            [
                7394,
                7421
            ],
            [
                7421,
                7460
            ],
            [
                7460,
                7461
            ],
            [
                7462,
                7510
            ],
            [
                7510,
                7568
            ],
            [
                7568,
                7599
            ],
            [
                7600,
                7643
            ],
            [
                7643,
                7645
            ],
            [
                7645,
                7675
            ],
            [
                7675,
                7705
            ],
            [
                7705,
                7720
            ],
            [
                7720,
                7731
            ],
            [
                7731,
                7782
            ],
            [
                7782,
                7783
            ],
            [
                7784,
                7806
            ],
            [
                7807,
                7822
            ],
            [
                7822,
                7838
            ],
            [
                7838,
                7885
            ],
            [
                7885,
                7912
            ],
            [
                7922,
                7944
            ],
            [
                7944,
                8007
            ],
            [
                8015,
                8089
            ],
            [
                8089,
                8112
            ],
            [
                8112,
                8134
            ],
            [
                8134,
                8209
            ],
            [
                8209,
                8215
            ],
            [
                8230,
                8261
            ],
            [
                8270,
                8280
            ],
            [
                8280,
                8317
            ],
            [
                8336,
                8340
            ],
            [
                8349,
                8351
            ],
            [
                8351,
                8354
            ],
            [
                8358,
                8361
            ],
            [
                8377,
                8381
            ],
            [
                8382,
                8435
            ],
            [
                8435,
                8439
            ],
            [
                8445,
                8477
            ],
            [
                8478,
                8506
            ]
        ],
        "row_chars": [
            [
                0,
                99
            ],
            [
                99,
                217
            ],
            [
                217,
                217
            ],
            [
                217,
                217
            ],
            [
                217,
                289
            ],
            [
                289,
                342
            ],
            [
                342,
                441
            ],
            [
                441,
                562
            ],
            [
                562,
                601
            ],
            [
                601,
                648
            ],
            [
                648,
                693
            ],
            [
                693,
                719
            ],
            [
                719,
                719
            ],
            [
                719,
                890
            ],
            [
                890,
                890
            ],
            [
                890,
                985
            ],
            [
                985,
                1038
            ],
            [
                1038,
                1054
            ],
            [
                1054,
                1148
            ],
            [
                1148,
                1177
            ],
            [
                1177,
                1324
            ],
            [
                1324,
                1324
            ],
            [
                1324,
                1324
            ],
            [
                1324,
                1405
            ],
            [
                1405,
                1463
            ],
            [
                1463,
                1531
            ],
            [
                1531,
                1595
            ],
            [
                1595,
                1743
            ],
            [
                1743,
                1801
            ],
            [
                1801,
                1872
            ],
            [
                1872,
                2034
            ],
            [
                2034,
                2135
            ],
            [
                2135,
                2160
            ],
            [
                2160,
                2191
            ],
            [
                2191,
                2246
            ],
            [
                2246,
                2309
            ],
            [
                2309,
                2343
            ],
            [
                2343,
                2409
            ],
            [
                2409,
                2479
            ],
            [
                2479,
                2688
            ],
            [
                2688,
                2724
            ],
            [
                2724,
                2724
            ],
            [
                2724,
                2724
            ],
            [
                2724,
                2748
            ],
            [
                2748,
                2790
            ],
            [
                2790,
                2870
            ],
            [
                2870,
                2958
            ],
            [
                2958,
                3033
            ],
            [
                3033,
                3092
            ],
            [
                3092,
                3149
            ],
            [
                3149,
                3207
            ],
            [
                3207,
                3225
            ],
            [
                3225,
                3341
            ],
            [
                3341,
                3417
            ],
            [
                3417,
                3447
            ],
            [
                3447,
                3495
            ],
            [
                3495,
                3581
            ],
            [
                3581,
                3620
            ],
            [
                3620,
                3703
            ],
            [
                3703,
                3786
            ],
            [
                3786,
                3812
            ],
            [
                3812,
                3812
            ],
            [
                3812,
                3812
            ],
            [
                3812,
                3889
            ],
            [
                3889,
                3914
            ],
            [
                3914,
                3948
            ],
            [
                3948,
                3958
            ],
            [
                3958,
                3998
            ],
            [
                3998,
                4044
            ],
            [
                4044,
                4051
            ],
            [
                4051,
                4118
            ],
            [
                4118,
                4223
            ],
            [
                4223,
                4254
            ],
            [
                4254,
                4303
            ],
            [
                4303,
                4424
            ],
            [
                4424,
                4525
            ],
            [
                4525,
                4644
            ],
            [
                4644,
                4644
            ],
            [
                4644,
                4695
            ],
            [
                4695,
                4695
            ],
            [
                4695,
                4798
            ],
            [
                4798,
                4986
            ],
            [
                4986,
                5048
            ],
            [
                5048,
                5127
            ],
            [
                5127,
                5228
            ],
            [
                5228,
                5228
            ],
            [
                5228,
                5250
            ],
            [
                5250,
                5329
            ],
            [
                5329,
                5406
            ],
            [
                5406,
                5462
            ],
            [
                5462,
                5510
            ],
            [
                5510,
                5510
            ],
            [
                5510,
                5606
            ],
            [
                5606,
                5606
            ],
            [
                5606,
                5606
            ],
            [
                5606,
                5683
            ],
            [
                5683,
                5708
            ],
            [
                5708,
                5793
            ],
            [
                5793,
                5852
            ],
            [
                5852,
                5874
            ],
            [
                5874,
                5979
            ],
            [
                5979,
                6031
            ],
            [
                6031,
                6071
            ],
            [
                6071,
                6145
            ],
            [
                6145,
                6288
            ],
            [
                6288,
                6341
            ],
            [
                6341,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6405
            ],
            [
                6405,
                6417
            ],
            [
                6417,
                6453
            ],
            [
                6453,
                6483
            ],
            [
                6483,
                6539
            ],
            [
                6539,
                6587
            ],
            [
                6587,
                6610
            ],
            [
                6610,
                6610
            ],
            [
                6610,
                6647
            ],
            [
                6647,
                6647
            ],
            [
                6647,
                6672
            ],
            [
                6672,
                6696
            ],
            [
                6696,
                6731
            ],
            [
                6731,
                6731
            ],
            [
                6731,
                6731
            ],
            [
                6731,
                6781
            ],
            [
                6781,
                6875
            ],
            [
                6875,
                6946
            ],
            [
                6946,
                6998
            ],
            [
                6998,
                7024
            ],
            [
                7024,
                7078
            ],
            [
                7078,
                7119
            ],
            [
                7119,
                7170
            ],
            [
                7170,
                7195
            ],
            [
                7195,
                7224
            ],
            [
                7224,
                7277
            ],
            [
                7277,
                7300
            ],
            [
                7300,
                7334
            ],
            [
                7334,
                7334
            ],
            [
                7334,
                7334
            ],
            [
                7334,
                7334
            ],
            [
                7334,
                7334
            ],
            [
                7334,
                7334
            ],
            [
                7334,
                7368
            ],
            [
                7368,
                7394
            ],
            [
                7394,
                7421
            ],
            [
                7421,
                7462
            ],
            [
                7462,
                7462
            ],
            [
                7462,
                7510
            ],
            [
                7510,
                7568
            ],
            [
                7568,
                7645
            ],
            [
                7645,
                7675
            ],
            [
                7675,
                7705
            ],
            [
                7705,
                7720
            ],
            [
                7720,
                7720
            ],
            [
                7720,
                7731
            ],
            [
                7731,
                7822
            ],
            [
                7822,
                7838
            ],
            [
                7838,
                7885
            ],
            [
                7885,
                7912
            ],
            [
                7912,
                7944
            ],
            [
                7944,
                8007
            ],
            [
                8007,
                8089
            ],
            [
                8089,
                8112
            ],
            [
                8112,
                8134
            ],
            [
                8134,
                8209
            ],
            [
                8209,
                8280
            ],
            [
                8280,
                8351
            ],
            [
                8351,
                8435
            ],
            [
                8435,
                8507
            ]
        ]
    }
}