{
    "original": {
        "text": "Paul Montague at this time lived in comfortable lodgings in Sackville Street, and ostensibly the world was going well with him. But he had many troubles. His troubles in reference to Fisker, Montague, and Montague,--and also their consolation,--are already known to the reader. He was troubled too about his love, though when he allowed his mind to expatiate on the success of the great railway he would venture to hope that on that side his life might perhaps be blessed. Henrietta had at any rate as yet showed no disposition to accept her cousin's offer. He was troubled too about the gambling, which he disliked, knowing that in that direction there might be speedy ruin, and yet returning to it from day to day in spite of his own conscience. But there was yet another trouble which culminated just at this time. One morning, not long after that Sunday night which had been so wretchedly spent at the Beargarden, he got into a cab in Piccadilly and had himself taken to a certain address in Islington. Here he knocked at a decent, modest door,--at such a house as men live in with two or three hundred a year,--and asked for Mrs. Hurtle. Yes;--Mrs. Hurtle lodged there, and he was shown into the drawing-room. There he stood by the round table for a quarter of an hour turning over the lodging-house books which lay there, and then Mrs. Hurtle entered the room. Mrs. Hurtle was a widow whom he had once promised to marry. \"Paul,\" she said, with a quick, sharp voice, but with a voice which could be very pleasant when she pleased,--taking him by the hand as she spoke, \"Paul, say that that letter of yours must go for nothing. Say that it shall be so, and I will forgive everything.\"\n\"I cannot say that,\" he replied, laying his hand in hers.\n\"You cannot say it! What do you mean? Will you dare to tell me that your promises to me are to go for nothing?\"\n\"Things are changed,\" said Paul hoarsely. He had come thither at her bidding because he had felt that to remain away would be cowardly, but the meeting was inexpressibly painful to him. He did think that he had sufficient excuse for breaking his troth to this woman, but the justification of his conduct was founded on reasons which he hardly knew how to plead to her. He had heard that of her past life which, had he heard it before, would have saved him from his present difficulty. But he had loved her,--did love her in a certain fashion; and her offences, such as they were, did not debar her from his sympathies.\n\"How are they changed? I am two years older, if you mean that.\" As she said this she looked round at the glass, as though to see whether she was become so haggard with age as to be unfit to become this man's wife. She was very lovely, with a kind of beauty which we seldom see now. In these days men regard the form and outward lines of a woman's face and figure more than either the colour or the expression, and women fit themselves to men's eyes. With padding and false hair without limit a figure may be constructed of almost any dimensions. The sculptors who construct them, male and female, hairdressers and milliners, are very skilful, and figures are constructed of noble dimensions, sometimes with voluptuous expansion, sometimes with classic reticence, sometimes with dishevelled negligence which becomes very dishevelled indeed when long out of the sculptors' hands. Colours indeed are added, but not the colours which we used to love. The taste for flesh and blood has for the day given place to an appetite for horsehair and pearl powder. But Mrs. Hurtle was not a beauty after the present fashion. She was very dark,--a dark brunette,--with large round blue eyes, that could indeed be soft, but could also be very severe. Her silken hair, almost black, hung in a thousand curls all round her head and neck. Her cheeks and lips and neck were full, and the blood would come and go, giving a varying expression to her face with almost every word she spoke. Her nose also was full, and had something of the pug. But nevertheless it was a nose which any man who loved her would swear to be perfect. Her mouth was large, and she rarely showed her teeth. Her chin was full, marked by a large dimple, and as it ran down to her neck was beginning to form a second. Her bust was full and beautifully shaped; but she invariably dressed as though she were oblivious, or at any rate neglectful, of her own charms. Her dress, as Montague had seen her, was always black,--not a sad weeping widow's garment, but silk or woollen or cotton as the case might be, always new, always nice, always well-fitting, and most especially always simple. She was certainly a most beautiful woman, and she knew it. She looked as though she knew it,--but only after that fashion in which a woman ought to know it. Of her age she had never spoken to Montague. She was in truth over thirty,--perhaps almost as near thirty-five as thirty. But she was one of those whom years hardly seem to touch.\n\"You are beautiful as ever you were,\" he said.\n\"Psha! Do not tell me of that. I care nothing for my beauty unless it can bind me to your love. Sit down there and tell me what it means.\" Then she let go his hand, and seated herself opposite to the chair which she gave him.\n\"I told you in my letter.\"\n\"You told me nothing in your letter,--except that it was to be--off. Why is it to be--off? Do you not love me?\" Then she threw herself upon her knees, and leaned upon his, and looked up in his face. \"Paul,\" she said, \"I have come again across the Atlantic on purpose to see you,--after so many months,--and will you not give me one kiss? Even though you should leave me for ever, give me one kiss.\" Of course he kissed her, not once, but with a long, warm embrace. How could it have been otherwise? With all his heart he wished that she would have remained away, but while she knelt there at his feet what could he do but embrace her? \"Now tell me everything,\" she said, seating herself on a footstool at his feet.\n[Illustration: \"I have come across the Atlantic to see you.\"]\nShe certainly did not look like a woman whom a man might ill treat or scorn with impunity. Paul felt, even while she was lavishing her caresses upon him, that she might too probably turn and rend him before he left her. He had known something of her temper before, though he had also known the truth and warmth of her love. He had travelled with her from San Francisco to England, and she had been very good to him in illness, in distress of mind and in poverty,--for he had been almost penniless in New York. When they landed at Liverpool they were engaged as man and wife. He had told her all his affairs, had given her the whole history of his life. This was before his second journey to America, when Hamilton K. Fisker was unknown to him. But she had told him little or nothing of her own life,--but that she was a widow, and that she was travelling to Paris on business. When he left her at the London railway station, from which she started for Dover, he was full of all a lover's ardour. He had offered to go with her, but that she had declined. But when he remembered that he must certainly tell his friend Roger of his engagement, and remembered also how little he knew of the lady to whom he was engaged, he became embarrassed. What were her means he did not know. He did know that she was some years older than himself, and that she had spoken hardly a word to him of her own family. She had indeed said that her husband had been one of the greatest miscreants ever created, and had spoken of her release from him as the one blessing she had known before she had met Paul Montague. But it was only when he thought of all this after she had left him,--only when he reflected how bald was the story which he must tell Roger Carbury,--that he became dismayed. Such had been the woman's cleverness, such her charm, so great her power of adaptation, that he had passed weeks in her daily company, with still progressing intimacy and affection, without feeling that anything had been missing.\nHe had told his friend, and his friend had declared to him that it was impossible that he should marry a woman whom he had met in a railway train without knowing something about her. Roger did all he could to persuade the lover to forget his love,--and partially succeeded. It is so pleasant and so natural that a young man should enjoy the company of a clever, beautiful woman on a long journey,--so natural that during the journey he should allow himself to think that she may during her whole life be all in all to him as she is at that moment;--and so natural again that he should see his mistake when he has parted from her! But Montague, though he was half false to his widow, was half true to her. He had pledged his word, and that he said ought to bind him. Then he returned to California, and learned through the instrumentality of Hamilton K. Fisker, that in San Francisco Mrs. Hurtle was regarded as a mystery. Some people did not quite believe that there ever had been a Mr. Hurtle. Others said that there certainly had been a Mr. Hurtle, and that to the best of their belief he still existed. The fact, however, best known of her was, that she had shot a man through the head somewhere in Oregon. She had not been tried for it, as the world of Oregon had considered that the circumstances justified the deed. Everybody knew that she was very clever and very beautiful,--but everybody also thought that she was very dangerous. \"She always had money when she was here,\" Hamilton Fisker said, \"but no one knew where it came from.\" Then he wanted to know why Paul inquired. \"I don't think, you know, that I should like to go in for a life partnership, if you mean that,\" said Hamilton K. Fisker.\nMontague had seen her in New York as he passed through on his second journey to San Francisco, and had then renewed his promises in spite of his cousin's caution. He told her that he was going to see what he could make of his broken fortunes,--for at this time, as the reader will remember, there was no great railway in existence,--and she had promised to follow him. Since that they had never met till this day. She had not made the promised journey to San Francisco, at any rate before he had left it. Letters from her had reached him in England, and these he had answered by explaining to her, or endeavouring to explain, that their engagement must be at an end. And now she had followed him to London! \"Tell me everything,\" she said, leaning upon him and looking up into his face.\n\"But you,--when did you arrive here?\"\n\"Here, at this house, I arrived the night before last. On Tuesday I reached Liverpool. There I found that you were probably in London, and so I came on. I have come only to see you. I can understand that you should have been estranged from me. That journey home is now so long ago! Our meeting in New York was so short and wretched. I would not tell you because you then were poor yourself, but at that moment I was penniless. I have got my own now out from the very teeth of robbers.\" As she said this, she looked as though she could be very persistent in claiming her own,--or what she might think to be her own. \"I could not get across to San Francisco as I said I would, and when I was there you had quarrelled with your uncle and returned. And now I am here. I at any rate have been faithful.\" As she said this his arm was again thrown over her, so as to press her head to his knee. \"And now,\" she said, \"tell me about yourself?\"\nHis position was embarrassing and very odious to himself. Had he done his duty properly, he would gently have pushed her from him, have sprung to his legs, and have declared that, however faulty might have been his previous conduct, he now found himself bound to make her understand that he did not intend to become her husband. But he was either too much of a man or too little of a man for conduct such as that. He did make the avowal to himself, even at that moment as she sat there. Let the matter go as it would, she should never be his wife. He would marry no one unless it was Hetta Carbury. But he did not at all know how to get this said with proper emphasis, and yet with properly apologetic courtesy. \"I am engaged here about this railway,\" he said. \"You have heard, I suppose, of our projected scheme?\"\n\"Heard of it! San Francisco is full of it. Hamilton Fisker is the great man of the day there, and, when I left, your uncle was buying a villa for seventy-four thousand dollars. And yet they say that the best of it all has been transferred to you Londoners. Many there are very hard upon Fisker for coming here and doing as he did.\"\n\"It's doing very well, I believe,\" said Paul, with some feeling of shame, as he thought how very little he knew about it.\n\"You are the manager here in England?\"\n\"No,--I am a member of the firm that manages it at San Francisco; but the real manager here is our chairman, Mr. Melmotte.\"\n\"Ah,--I have heard of him. He is a great man;--a Frenchman, is he not? There was a talk of inviting him to California. You know him of course?\"\n\"Yes;--I know him. I see him once a week.\"\n\"I would sooner see that man than your Queen, or any of your dukes or lords. They tell me that he holds the world of commerce in his right hand. What power;--what grandeur!\"\n\"Grand enough,\" said Paul, \"if it all came honestly.\"\n\"Such a man rises above honesty,\" said Mrs. Hurtle, \"as a great general rises above humanity when he sacrifices an army to conquer a nation. Such greatness is incompatible with small scruples. A pigmy man is stopped by a little ditch, but a giant stalks over the rivers.\"\n\"I prefer to be stopped by the ditches,\" said Montague.\n\"Ah, Paul, you were not born for commerce. And I will grant you this, that commerce is not noble unless it rises to great heights. To live in plenty by sticking to your counter from nine in the morning to nine at night, is not a fine life. But this man with a scratch of his pen can send out or call in millions of dollars. Do they say here that he is not honest?\"\n\"As he is my partner in this affair perhaps I had better say nothing against him.\"\n\"Of course such a man will be abused. People have said that Napoleon was a coward, and Washington a traitor. You must take me where I shall see Melmotte. He is a man whose hand I would kiss; but I would not condescend to speak even a word of reverence to any of your Emperors.\"\n\"I fear you will find that your idol has feet of clay.\"\n\"Ah,--you mean that he is bold in breaking those precepts of yours about coveting worldly wealth. All men and women break that commandment, but they do so in a stealthy fashion, half drawing back the grasping hand, praying to be delivered from temptation while they filch only a little, pretending to despise the only thing that is dear to them in the world. Here is a man who boldly says that he recognises no such law; that wealth is power, and that power is good, and that the more a man has of wealth the greater and the stronger and the nobler he can be. I love a man who can turn the hobgoblins inside out and burn the wooden bogies that he meets.\"\nMontague had formed his own opinions about Melmotte. Though connected with the man, he believed their Grand Director to be as vile a scoundrel as ever lived. Mrs. Hurtle's enthusiasm was very pretty, and there was something of feminine eloquence in her words. But it was shocking to see them lavished on such a subject. \"Personally, I do not like him,\" said Paul.\n\"I had thought to find that you and he were hand and glove.\"\n\"Oh no.\"\n\"But you are prospering in this business?\"\n\"Yes,--I suppose we are prospering. It is one of those hazardous things in which a man can never tell whether he be really prosperous till he is out of it. I fell into it altogether against my will. I had no alternative.\"\n\"It seems to me to have been a golden chance.\"\n\"As far as immediate results go it has been golden.\"\n\"That at any rate is well, Paul. And now,--now that we have got back into our old way of talking, tell me what all this means. I have talked to no one after this fashion since we parted. Why should our engagement be over? You used to love me, did you not?\"\nHe would willingly have left her question unanswered, but she waited for an answer. \"You know I did,\" he said.\n\"I thought so. This I know, that you were sure and are sure of my love to you. Is it not so? Come, speak openly like a man. Do you doubt me?\"\nHe did not doubt her, and was forced to say so. \"No, indeed.\"\n\"Oh, with what bated, half-mouthed words you speak,--fit for a girl from a nursery! Out with it if you have anything to say against me! You owe me so much at any rate. I have never ill-treated you. I have never lied to you. I have taken nothing from you,--if I have not taken your heart. I have given you all that I have to give.\" Then she leaped to her feet and stood a little apart from him. \"If you hate me, say so.\"\n\"Winifrid,\" he said, calling her by her name.\n\"Winifrid! Yes, now for the first time, though I have called you Paul from the moment you entered the room. Well, speak out. Is there another woman that you love?\"\nAt this moment Paul Montague proved that at any rate he was no coward. Knowing the nature of the woman, how ardent, how impetuous she could be, and how full of wrath, he had come at her call intending to tell her the truth which he now spoke. \"There is another,\" he said.\nShe stood silent, looking into his face, thinking how she would commence her attack upon him. She fixed her eyes upon him, standing quite upright, squeezing her own right hand with the fingers of the left. \"Oh,\" she said, in a whisper;--\"that is the reason why I am told that I am to be--off.\"\n\"That was not the reason.\"\n\"What;--can there be more reason than that,--better reason than that? Unless, indeed, it be that as you have learned to love another so also you have learned to--hate me.\"\n\"Listen to me, Winifrid.\"\n\"No, sir; no Winifrid now! How did you dare to kiss me, knowing that it was on your tongue to tell me I was to be cast aside? And so you love--some other woman! I am too old to please you, too rough,--too little like the dolls of your own country! What were your--other reasons? Let me hear your--other reasons, that I may tell you that they are lies.\"\nThe reasons were very difficult to tell, though when put forward by Roger Carbury they had been easily pleaded. Paul knew but little about Winifrid Hurtle, and nothing at all about the late Mr. Hurtle. His reasons curtly put forward might have been so stated. \"We know too little of each other,\" he said.\n\"What more do you want to know? You can know all for the asking. Did I ever refuse to answer you? As to my knowledge of you and your affairs, if I think it sufficient, need you complain? What is it that you want to know? Ask anything and I will tell you. Is it about my money? You knew when you gave me your word that I had next to none. Now I have ample means of my own. You knew that I was a widow. What more? If you wish to hear of the wretch that was my husband, I will deluge you with stories. I should have thought that a man who loved would not have cared to hear much of one--who perhaps was loved once.\"\nHe knew that his position was perfectly indefensible. It would have been better for him not to have alluded to any reasons, but to have remained firm to his assertion that he loved another woman. He must have acknowledged himself to be false, perjured, inconstant, and very base. A fault that may be venial to those who do not suffer, is damnable, deserving of an eternity of tortures, in the eyes of the sufferer. He must have submitted to be told that he was a fiend, and might have had to endure whatever of punishment a lady in her wrath could inflict upon him. But he would have been called upon for no further mental effort. His position would have been plain. But now he was all at sea. \"I wish to hear nothing,\" he said.\n\"Then why tell me that we know so little of each other? That, surely, is a poor excuse to make to a woman,--after you have been false to her. Why did you not say that when we were in New York together? Think of it, Paul. Is not that mean?\"\n\"I do not think that I am mean.\"\n\"No;--a man will lie to a woman, and justify it always. Who is--this lady?\"\nHe knew that he could not at any rate be warranted in mentioning Hetta Carbury's name. He had never even asked her for her love, and certainly had received no assurance that he was loved. \"I can not name her.\"\n\"And I, who have come hither from California to see you, am to return satisfied because you tell me that you have--changed your affections? That is to be all, and you think that fair? That suits your own mind, and leaves no sore spot in your heart? You can do that, and shake hands with me, and go away,--without a pang, without a scruple?\"\n\"I did not say so.\"\n\"And you are the man who cannot bear to hear me praise Augustus Melmotte because you think him dishonest! Are you a liar?\"\n\"I hope not.\"\n\"Did you say you would be my husband? Answer me, sir.\"\n\"I did say so.\"\n\"Do you now refuse to keep your promise? You shall answer me.\"\n\"I cannot marry you.\"\n\"Then, sir, are you not a liar?\" It would have taken him long to explain to her, even had he been able, that a man may break a promise and yet not tell a lie. He had made up his mind to break his engagement before he had seen Hetta Carbury, and therefore he could not accuse himself of falseness on her account. He had been brought to his resolution by the rumours he had heard of her past life, and as to his uncertainty about her husband. If Mr. Hurtle were alive, certainly then he would not be a liar because he did not marry Mrs. Hurtle. He did not think himself to be a liar, but he was not at once ready with his defence. \"Oh, Paul,\" she said, changing at once into softness,--\"I am pleading to you for my life. Oh, that I could make you feel that I am pleading for my life. Have you given a promise to this lady also?\"\n\"No,\" said he. \"I have given no promise.\"\n\"But she loves you?\"\n\"She has never said so.\"\n\"You have told her of your love?\"\n\"Never.\"\n\"There is nothing, then, between you? And you would put her against me,--some woman who has nothing to suffer, no cause of complaint, who, for aught you know, cares nothing for you. Is that so?\"\n\"I suppose it is,\" said Paul.\n\"Then you may still be mine. Oh, Paul, come back to me. Will any woman love you as I do;--live for you as I do? Think what I have done in coming here, where I have no friend,--not a single friend,--unless you are a friend. Listen to me. I have told the woman here that I am engaged to marry you.\"\n\"You have told the woman of the house?\"\n\"Certainly I have. Was I not justified? Were you not engaged to me? Am I to have you to visit me here, and to risk her insults, perhaps to be told to take myself off and to find accommodation elsewhere, because I am too mealy-mouthed to tell the truth as to the cause of my being here? I am here because you have promised to make me your wife, and, as far as I am concerned, I am not ashamed to have the fact advertised in every newspaper in the town. I told her that I was the promised wife of one Paul Montague, who was joined with Mr. Melmotte in managing the new great American railway, and that Mr. Paul Montague would be with me this morning. She was too far-seeing to doubt me, but had she doubted, I could have shown her your letters. Now go and tell her that what I have said is false,--if you dare.\" The woman was not there, and it did not seem to be his immediate duty to leave the room in order that he might denounce a lady whom he certainly had ill-used. The position was one which required thought. After a while he took up his hat to go. \"Do you mean to tell her that my statement is untrue?\"\n\"No,--\" he said; \"not to-day.\"\n\"And you will come back to me?\"\n\"Yes;--I will come back.\"\n\"I have no friend here, but you, Paul. Remember that. Remember all your promises. Remember all our love,--and be good to me.\" Then she let him go without another word.",
        "paragraph_chars": [
            [
                0,
                1689
            ],
            [
                1689,
                1747
            ],
            [
                1747,
                1859
            ],
            [
                1859,
                2478
            ],
            [
                2478,
                4954
            ],
            [
                4954,
                5001
            ],
            [
                5001,
                5227
            ],
            [
                5227,
                5254
            ],
            [
                5254,
                5969
            ],
            [
                5969,
                6031
            ],
            [
                6031,
                8030
            ],
            [
                8030,
                9735
            ],
            [
                9735,
                10521
            ],
            [
                10521,
                10559
            ],
            [
                10559,
                11494
            ],
            [
                11494,
                12309
            ],
            [
                12309,
                12641
            ],
            [
                12641,
                12763
            ],
            [
                12763,
                12802
            ],
            [
                12802,
                12926
            ],
            [
                12926,
                13070
            ],
            [
                13070,
                13113
            ],
            [
                13113,
                13287
            ],
            [
                13287,
                13341
            ],
            [
                13341,
                13613
            ],
            [
                13613,
                13669
            ],
            [
                13669,
                14034
            ],
            [
                14034,
                14117
            ],
            [
                14117,
                14395
            ],
            [
                14395,
                14451
            ],
            [
                14451,
                15106
            ],
            [
                15106,
                15470
            ],
            [
                15470,
                15531
            ],
            [
                15531,
                15540
            ],
            [
                15540,
                15583
            ],
            [
                15583,
                15805
            ],
            [
                15805,
                15852
            ],
            [
                15852,
                15905
            ],
            [
                15905,
                16162
            ],
            [
                16162,
                16273
            ],
            [
                16273,
                16415
            ],
            [
                16415,
                16477
            ],
            [
                16477,
                16897
            ],
            [
                16897,
                16943
            ],
            [
                16943,
                17107
            ],
            [
                17107,
                17379
            ],
            [
                17379,
                17673
            ],
            [
                17673,
                17700
            ],
            [
                17700,
                17872
            ],
            [
                17872,
                17898
            ],
            [
                17898,
                18251
            ],
            [
                18251,
                18556
            ],
            [
                18556,
                19169
            ],
            [
                19169,
                19898
            ],
            [
                19898,
                20138
            ],
            [
                20138,
                20171
            ],
            [
                20171,
                20247
            ],
            [
                20247,
                20457
            ],
            [
                20457,
                20798
            ],
            [
                20798,
                20818
            ],
            [
                20818,
                20941
            ],
            [
                20941,
                20955
            ],
            [
                20955,
                21010
            ],
            [
                21010,
                21026
            ],
            [
                21026,
                21089
            ],
            [
                21089,
                21111
            ],
            [
                21111,
                21938
            ],
            [
                21938,
                21980
            ],
            [
                21980,
                22001
            ],
            [
                22001,
                22026
            ],
            [
                22026,
                22060
            ],
            [
                22060,
                22069
            ],
            [
                22069,
                22264
            ],
            [
                22264,
                22294
            ],
            [
                22294,
                22591
            ],
            [
                22591,
                22631
            ],
            [
                22631,
                23740
            ],
            [
                23740,
                23771
            ],
            [
                23771,
                23803
            ],
            [
                23803,
                23829
            ],
            [
                23829,
                23996
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                154
            ],
            [
                154,
                278
            ],
            [
                278,
                473
            ],
            [
                473,
                558
            ],
            [
                558,
                748
            ],
            [
                748,
                818
            ],
            [
                818,
                1007
            ],
            [
                1007,
                1143
            ],
            [
                1143,
                1215
            ],
            [
                1215,
                1367
            ],
            [
                1367,
                1427
            ],
            [
                1427,
                1632
            ],
            [
                1632,
                1689
            ],
            [
                1689,
                1747
            ],
            [
                1747,
                1767
            ],
            [
                1767,
                1785
            ],
            [
                1785,
                1859
            ],
            [
                1859,
                1901
            ],
            [
                1901,
                2045
            ],
            [
                2045,
                2228
            ],
            [
                2228,
                2344
            ],
            [
                2344,
                2478
            ],
            [
                2478,
                2501
            ],
            [
                2501,
                2542
            ],
            [
                2542,
                2692
            ],
            [
                2692,
                2760
            ],
            [
                2760,
                2928
            ],
            [
                2928,
                3024
            ],
            [
                3024,
                3356
            ],
            [
                3356,
                3425
            ],
            [
                3425,
                3530
            ],
            [
                3530,
                3590
            ],
            [
                3590,
                3714
            ],
            [
                3714,
                3799
            ],
            [
                3799,
                3946
            ],
            [
                3946,
                4000
            ],
            [
                4000,
                4086
            ],
            [
                4086,
                4140
            ],
            [
                4140,
                4248
            ],
            [
                4248,
                4393
            ],
            [
                4393,
                4617
            ],
            [
                4617,
                4676
            ],
            [
                4676,
                4774
            ],
            [
                4774,
                4819
            ],
            [
                4819,
                4896
            ],
            [
                4896,
                4954
            ],
            [
                4954,
                5001
            ],
            [
                5001,
                5008
            ],
            [
                5008,
                5032
            ],
            [
                5032,
                5097
            ],
            [
                5097,
                5140
            ],
            [
                5140,
                5227
            ],
            [
                5227,
                5254
            ],
            [
                5254,
                5323
            ],
            [
                5323,
                5345
            ],
            [
                5345,
                5366
            ],
            [
                5366,
                5453
            ],
            [
                5453,
                5592
            ],
            [
                5592,
                5653
            ],
            [
                5653,
                5719
            ],
            [
                5719,
                5753
            ],
            [
                5753,
                5889
            ],
            [
                5889,
                5969
            ],
            [
                5969,
                6031
            ],
            [
                6031,
                6122
            ],
            [
                6122,
                6251
            ],
            [
                6251,
                6355
            ],
            [
                6355,
                6541
            ],
            [
                6541,
                6606
            ],
            [
                6606,
                6684
            ],
            [
                6684,
                6775
            ],
            [
                6775,
                6908
            ],
            [
                6908,
                7027
            ],
            [
                7027,
                7085
            ],
            [
                7085,
                7270
            ],
            [
                7270,
                7307
            ],
            [
                7307,
                7427
            ],
            [
                7427,
                7625
            ],
            [
                7625,
                7800
            ],
            [
                7800,
                8030
            ],
            [
                8030,
                8213
            ],
            [
                8213,
                8304
            ],
            [
                8304,
                8660
            ],
            [
                8660,
                8735
            ],
            [
                8735,
                8796
            ],
            [
                8796,
                8952
            ],
            [
                8952,
                9025
            ],
            [
                9025,
                9136
            ],
            [
                9136,
                9240
            ],
            [
                9240,
                9352
            ],
            [
                9352,
                9469
            ],
            [
                9469,
                9571
            ],
            [
                9571,
                9613
            ],
            [
                9613,
                9735
            ],
            [
                9735,
                9898
            ],
            [
                9898,
                10104
            ],
            [
                10104,
                10149
            ],
            [
                10149,
                10240
            ],
            [
                10240,
                10402
            ],
            [
                10402,
                10442
            ],
            [
                10442,
                10521
            ],
            [
                10521,
                10559
            ],
            [
                10559,
                10614
            ],
            [
                10614,
                10646
            ],
            [
                10646,
                10712
            ],
            [
                10712,
                10741
            ],
            [
                10741,
                10803
            ],
            [
                10803,
                10841
            ],
            [
                10841,
                10892
            ],
            [
                10892,
                10986
            ],
            [
                10986,
                11045
            ],
            [
                11045,
                11174
            ],
            [
                11174,
                11304
            ],
            [
                11304,
                11323
            ],
            [
                11323,
                11358
            ],
            [
                11358,
                11447
            ],
            [
                11447,
                11494
            ],
            [
                11494,
                11552
            ],
            [
                11552,
                11823
            ],
            [
                11823,
                11908
            ],
            [
                11908,
                11981
            ],
            [
                11981,
                12042
            ],
            [
                12042,
                12093
            ],
            [
                12093,
                12206
            ],
            [
                12206,
                12255
            ],
            [
                12255,
                12309
            ],
            [
                12309,
                12323
            ],
            [
                12323,
                12352
            ],
            [
                12352,
                12486
            ],
            [
                12486,
                12566
            ],
            [
                12566,
                12641
            ],
            [
                12641,
                12763
            ],
            [
                12763,
                12802
            ],
            [
                12802,
                12926
            ],
            [
                12926,
                12953
            ],
            [
                12953,
                12997
            ],
            [
                12997,
                13045
            ],
            [
                13045,
                13070
            ],
            [
                13070,
                13089
            ],
            [
                13089,
                13113
            ],
            [
                13113,
                13190
            ],
            [
                13190,
                13258
            ],
            [
                13258,
                13287
            ],
            [
                13287,
                13341
            ],
            [
                13341,
                13482
            ],
            [
                13482,
                13534
            ],
            [
                13534,
                13613
            ],
            [
                13613,
                13669
            ],
            [
                13669,
                13712
            ],
            [
                13712,
                13800
            ],
            [
                13800,
                13909
            ],
            [
                13909,
                13993
            ],
            [
                13993,
                14034
            ],
            [
                14034,
                14117
            ],
            [
                14117,
                14155
            ],
            [
                14155,
                14226
            ],
            [
                14226,
                14271
            ],
            [
                14271,
                14395
            ],
            [
                14395,
                14451
            ],
            [
                14451,
                14549
            ],
            [
                14549,
                14810
            ],
            [
                14810,
                15011
            ],
            [
                15011,
                15106
            ],
            [
                15106,
                15159
            ],
            [
                15159,
                15264
            ],
            [
                15264,
                15366
            ],
            [
                15366,
                15426
            ],
            [
                15426,
                15470
            ],
            [
                15470,
                15531
            ],
            [
                15531,
                15540
            ],
            [
                15540,
                15583
            ],
            [
                15583,
                15619
            ],
            [
                15619,
                15739
            ],
            [
                15739,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15852
            ],
            [
                15852,
                15905
            ],
            [
                15905,
                15938
            ],
            [
                15938,
                16032
            ],
            [
                16032,
                16092
            ],
            [
                16092,
                16127
            ],
            [
                16127,
                16162
            ],
            [
                16162,
                16246
            ],
            [
                16246,
                16273
            ],
            [
                16273,
                16288
            ],
            [
                16288,
                16352
            ],
            [
                16352,
                16366
            ],
            [
                16366,
                16397
            ],
            [
                16397,
                16415
            ],
            [
                16415,
                16463
            ],
            [
                16463,
                16477
            ],
            [
                16477,
                16561
            ],
            [
                16561,
                16613
            ],
            [
                16613,
                16645
            ],
            [
                16645,
                16675
            ],
            [
                16675,
                16701
            ],
            [
                16701,
                16765
            ],
            [
                16765,
                16808
            ],
            [
                16808,
                16871
            ],
            [
                16871,
                16897
            ],
            [
                16897,
                16943
            ],
            [
                16943,
                16954
            ],
            [
                16954,
                17051
            ],
            [
                17051,
                17068
            ],
            [
                17068,
                17107
            ],
            [
                17107,
                17178
            ],
            [
                17178,
                17350
            ],
            [
                17350,
                17379
            ],
            [
                17379,
                17473
            ],
            [
                17473,
                17585
            ],
            [
                17585,
                17673
            ],
            [
                17673,
                17700
            ],
            [
                17700,
                17770
            ],
            [
                17770,
                17872
            ],
            [
                17872,
                17898
            ],
            [
                17898,
                17925
            ],
            [
                17925,
                18024
            ],
            [
                18024,
                18059
            ],
            [
                18059,
                18146
            ],
            [
                18146,
                18177
            ],
            [
                18177,
                18251
            ],
            [
                18251,
                18363
            ],
            [
                18363,
                18453
            ],
            [
                18453,
                18511
            ],
            [
                18511,
                18556
            ],
            [
                18556,
                18588
            ],
            [
                18588,
                18621
            ],
            [
                18621,
                18654
            ],
            [
                18654,
                18743
            ],
            [
                18743,
                18777
            ],
            [
                18777,
                18811
            ],
            [
                18811,
                18833
            ],
            [
                18833,
                18894
            ],
            [
                18894,
                18928
            ],
            [
                18928,
                18957
            ],
            [
                18957,
                18968
            ],
            [
                18968,
                19055
            ],
            [
                19055,
                19169
            ],
            [
                19169,
                19223
            ],
            [
                19223,
                19365
            ],
            [
                19365,
                19449
            ],
            [
                19449,
                19584
            ],
            [
                19584,
                19735
            ],
            [
                19735,
                19800
            ],
            [
                19800,
                19836
            ],
            [
                19836,
                19863
            ],
            [
                19863,
                19898
            ],
            [
                19898,
                19954
            ],
            [
                19954,
                20040
            ],
            [
                20040,
                20100
            ],
            [
                20100,
                20119
            ],
            [
                20119,
                20138
            ],
            [
                20138,
                20171
            ],
            [
                20171,
                20227
            ],
            [
                20227,
                20247
            ],
            [
                20247,
                20334
            ],
            [
                20334,
                20435
            ],
            [
                20435,
                20457
            ],
            [
                20457,
                20597
            ],
            [
                20597,
                20641
            ],
            [
                20641,
                20706
            ],
            [
                20706,
                20798
            ],
            [
                20798,
                20818
            ],
            [
                20818,
                20924
            ],
            [
                20924,
                20941
            ],
            [
                20941,
                20955
            ],
            [
                20955,
                20993
            ],
            [
                20993,
                21010
            ],
            [
                21010,
                21026
            ],
            [
                21026,
                21067
            ],
            [
                21067,
                21089
            ],
            [
                21089,
                21111
            ],
            [
                21111,
                21144
            ],
            [
                21144,
                21270
            ],
            [
                21270,
                21423
            ],
            [
                21423,
                21552
            ],
            [
                21552,
                21654
            ],
            [
                21654,
                21740
            ],
            [
                21740,
                21830
            ],
            [
                21830,
                21893
            ],
            [
                21893,
                21938
            ],
            [
                21938,
                21953
            ],
            [
                21953,
                21980
            ],
            [
                21980,
                22001
            ],
            [
                22001,
                22026
            ],
            [
                22026,
                22060
            ],
            [
                22060,
                22069
            ],
            [
                22069,
                22107
            ],
            [
                22107,
                22251
            ],
            [
                22251,
                22264
            ],
            [
                22264,
                22294
            ],
            [
                22294,
                22323
            ],
            [
                22323,
                22350
            ],
            [
                22350,
                22406
            ],
            [
                22406,
                22517
            ],
            [
                22517,
                22531
            ],
            [
                22531,
                22591
            ],
            [
                22591,
                22631
            ],
            [
                22631,
                22650
            ],
            [
                22650,
                22671
            ],
            [
                22671,
                22699
            ],
            [
                22699,
                22917
            ],
            [
                22917,
                23083
            ],
            [
                23083,
                23280
            ],
            [
                23280,
                23374
            ],
            [
                23374,
                23441
            ],
            [
                23441,
                23600
            ],
            [
                23600,
                23645
            ],
            [
                23645,
                23685
            ],
            [
                23685,
                23740
            ],
            [
                23740,
                23771
            ],
            [
                23771,
                23803
            ],
            [
                23803,
                23829
            ],
            [
                23829,
                23868
            ],
            [
                23868,
                23883
            ],
            [
                23883,
                23911
            ],
            [
                23911,
                23955
            ],
            [
                23955,
                23996
            ]
        ],
        "overlap_chars": [
            [
                0,
                81
            ],
            [
                93,
                102
            ],
            [
                113,
                128
            ],
            [
                128,
                154
            ],
            [
                154,
                166
            ],
            [
                183,
                213
            ],
            [
                245,
                278
            ],
            [
                278,
                284
            ],
            [
                285,
                293
            ],
            [
                298,
                328
            ],
            [
                362,
                397
            ],
            [
                420,
                424
            ],
            [
                447,
                452
            ],
            [
                461,
                471
            ],
            [
                473,
                482
            ],
            [
                548,
                550
            ],
            [
                556,
                558
            ],
            [
                558,
                616
            ],
            [
                676,
                683
            ],
            [
                694,
                696
            ],
            [
                746,
                747
            ],
            [
                748,
                761
            ],
            [
                766,
                818
            ],
            [
                818,
                829
            ],
            [
                918,
                924
            ],
            [
                930,
                953
            ],
            [
                972,
                1007
            ],
            [
                1007,
                1048
            ],
            [
                1116,
                1142
            ],
            [
                1179,
                1213
            ],
            [
                1173,
                1178
            ],
            [
                1224,
                1236
            ],
            [
                1243,
                1248
            ],
            [
                1337,
                1367
            ],
            [
                1367,
                1426
            ],
            [
                1427,
                1475
            ],
            [
                1481,
                1535
            ],
            [
                1574,
                1610
            ],
            [
                1623,
                1632
            ],
            [
                1632,
                1640
            ],
            [
                1655,
                1689
            ],
            [
                1689,
                1707
            ],
            [
                1747,
                1767
            ],
            [
                1767,
                1785
            ],
            [
                1785,
                1828
            ],
            [
                1849,
                1859
            ],
            [
                1859,
                1901
            ],
            [
                1901,
                1912
            ],
            [
                1921,
                1963
            ],
            [
                1971,
                2045
            ],
            [
                2045,
                2129
            ],
            [
                2192,
                2213
            ],
            [
                2220,
                2228
            ],
            [
                2228,
                2240
            ],
            [
                2249,
                2282
            ],
            [
                2286,
                2319
            ],
            [
                2332,
                2344
            ],
            [
                2344,
                2364
            ],
            [
                2367,
                2384
            ],
            [
                2364,
                2365
            ],
            [
                2406,
                2418
            ],
            [
                2476,
                2478
            ],
            [
                2478,
                2501
            ],
            [
                2501,
                2542
            ],
            [
                2542,
                2582
            ],
            [
                2588,
                2629
            ],
            [
                2633,
                2649
            ],
            [
                2690,
                2692
            ],
            [
                2692,
                2712
            ],
            [
                3386,
                3389
            ],
            [
                2760,
                2762
            ],
            [
                2785,
                2788
            ],
            [
                3581,
                3590
            ],
            [
                3590,
                3597
            ],
            [
                3610,
                3625
            ],
            [
                3628,
                3666
            ],
            [
                3674,
                3714
            ],
            [
                3714,
                3769
            ],
            [
                3780,
                3799
            ],
            [
                3799,
                3818
            ],
            [
                3828,
                3842
            ],
            [
                3935,
                3938
            ],
            [
                3944,
                3946
            ],
            [
                4248,
                4260
            ],
            [
                4270,
                4297
            ],
            [
                4309,
                4345
            ],
            [
                4374,
                4392
            ],
            [
                4393,
                4403
            ],
            [
                4407,
                4447
            ],
            [
                4536,
                4560
            ],
            [
                4568,
                4585
            ],
            [
                4609,
                4617
            ],
            [
                4617,
                4636
            ],
            [
                4642,
                4676
            ],
            [
                4774,
                4819
            ],
            [
                4819,
                4847
            ],
            [
                4894,
                4896
            ],
            [
                4896,
                4954
            ],
            [
                4954,
                4962
            ],
            [
                4963,
                5001
            ],
            [
                5001,
                5008
            ],
            [
                5032,
                5097
            ],
            [
                5097,
                5105
            ],
            [
                5112,
                5140
            ],
            [
                5145,
                5148
            ],
            [
                5170,
                5193
            ],
            [
                5222,
                5227
            ],
            [
                5227,
                5254
            ],
            [
                5254,
                5290
            ],
            [
                5292,
                5310
            ],
            [
                5318,
                5323
            ],
            [
                5323,
                5326
            ],
            [
                5343,
                5345
            ],
            [
                5345,
                5366
            ],
            [
                5366,
                5425
            ],
            [
                5437,
                5453
            ],
            [
                5453,
                5509
            ],
            [
                5521,
                5532
            ],
            [
                5534,
                5554
            ],
            [
                5557,
                5592
            ],
            [
                5592,
                5652
            ],
            [
                5653,
                5677
            ],
            [
                5692,
                5719
            ],
            [
                5821,
                5888
            ],
            [
                5889,
                5969
            ],
            [
                6031,
                6034
            ],
            [
                6045,
                6087
            ],
            [
                6101,
                6106
            ],
            [
                6120,
                6122
            ],
            [
                6122,
                6151
            ],
            [
                6166,
                6168
            ],
            [
                6180,
                6199
            ],
            [
                6213,
                6251
            ],
            [
                6251,
                6354
            ],
            [
                6355,
                6457
            ],
            [
                6461,
                6469
            ],
            [
                6478,
                6481
            ],
            [
                6485,
                6492
            ],
            [
                6495,
                6541
            ],
            [
                6541,
                6588
            ],
            [
                6604,
                6606
            ],
            [
                6606,
                6608
            ],
            [
                6639,
                6684
            ],
            [
                6684,
                6692
            ],
            [
                6731,
                6775
            ],
            [
                6775,
                6830
            ],
            [
                6836,
                6857
            ],
            [
                6875,
                6908
            ],
            [
                6908,
                6955
            ],
            [
                6990,
                7004
            ],
            [
                7009,
                7026
            ],
            [
                7085,
                7120
            ],
            [
                7131,
                7213
            ],
            [
                7245,
                7270
            ],
            [
                7372,
                7400
            ],
            [
                7408,
                7425
            ],
            [
                7516,
                7517
            ],
            [
                7427,
                7434
            ],
            [
                7442,
                7472
            ],
            [
                7493,
                7499
            ],
            [
                7361,
                7366
            ],
            [
                7536,
                7556
            ],
            [
                7522,
                7525
            ],
            [
                7560,
                7625
            ],
            [
                7669,
                7692
            ],
            [
                7704,
                7773
            ],
            [
                7783,
                7800
            ],
            [
                7800,
                7836
            ],
            [
                7967,
                7970
            ],
            [
                7847,
                7852
            ],
            [
                7886,
                7933
            ],
            [
                7982,
                8030
            ],
            [
                8030,
                8041
            ],
            [
                8052,
                8156
            ],
            [
                8160,
                8161
            ],
            [
                8170,
                8191
            ],
            [
                8202,
                8213
            ],
            [
                8213,
                8247
            ],
            [
                8258,
                8276
            ],
            [
                8279,
                8304
            ],
            [
                8619,
                8630
            ],
            [
                8672,
                8712
            ],
            [
                8713,
                8735
            ],
            [
                8735,
                8763
            ],
            [
                8772,
                8776
            ],
            [
                8764,
                8768
            ],
            [
                8777,
                8795
            ],
            [
                8796,
                8847
            ],
            [
                8871,
                8889
            ],
            [
                8891,
                8952
            ],
            [
                8952,
                8971
            ],
            [
                8978,
                9025
            ],
            [
                9025,
                9066
            ],
            [
                9079,
                9089
            ],
            [
                9118,
                9136
            ],
            [
                9136,
                9165
            ],
            [
                9173,
                9218
            ],
            [
                9229,
                9240
            ],
            [
                9240,
                9352
            ],
            [
                9352,
                9361
            ],
            [
                9432,
                9439
            ],
            [
                9367,
                9411
            ],
            [
                9413,
                9416
            ],
            [
                9427,
                9431
            ],
            [
                9453,
                9468
            ],
            [
                9469,
                9490
            ],
            [
                9508,
                9568
            ],
            [
                9614,
                9689
            ],
            [
                9735,
                9768
            ],
            [
                9790,
                9898
            ],
            [
                9898,
                9976
            ],
            [
                9979,
                9982
            ],
            [
                9986,
                9990
            ],
            [
                10032,
                10035
            ],
            [
                10000,
                10003
            ],
            [
                10039,
                10052
            ],
            [
                10068,
                10104
            ],
            [
                10104,
                10109
            ],
            [
                10115,
                10123
            ],
            [
                10130,
                10149
            ],
            [
                10240,
                10288
            ],
            [
                10295,
                10310
            ],
            [
                10289,
                10294
            ],
            [
                10311,
                10313
            ],
            [
                10349,
                10359
            ],
            [
                10361,
                10402
            ],
            [
                10402,
                10441
            ],
            [
                10442,
                10473
            ],
            [
                10495,
                10521
            ],
            [
                10521,
                10522
            ],
            [
                10532,
                10559
            ],
            [
                10614,
                10646
            ],
            [
                10646,
                10673
            ],
            [
                10683,
                10707
            ],
            [
                10710,
                10712
            ],
            [
                10741,
                10803
            ],
            [
                10841,
                10892
            ],
            [
                10892,
                10893
            ],
            [
                10900,
                10986
            ],
            [
                11175,
                11244
            ],
            [
                11255,
                11293
            ],
            [
                11302,
                11304
            ],
            [
                11304,
                11323
            ],
            [
                11323,
                11355
            ],
            [
                11448,
                11494
            ],
            [
                11494,
                11510
            ],
            [
                11528,
                11532
            ],
            [
                11511,
                11523
            ],
            [
                11550,
                11552
            ],
            [
                11556,
                11558
            ],
            [
                11754,
                11756
            ],
            [
                11599,
                11603
            ],
            [
                11592,
                11598
            ],
            [
                11604,
                11614
            ],
            [
                11623,
                11708
            ],
            [
                11718,
                11726
            ],
            [
                11782,
                11823
            ],
            [
                11823,
                11849
            ],
            [
                11859,
                11881
            ],
            [
                11902,
                11908
            ],
            [
                11908,
                11914
            ],
            [
                11931,
                11941
            ],
            [
                11951,
                11955
            ],
            [
                12012,
                12042
            ],
            [
                12093,
                12107
            ],
            [
                12115,
                12126
            ],
            [
                12131,
                12135
            ],
            [
                12171,
                12205
            ],
            [
                12206,
                12255
            ],
            [
                12255,
                12270
            ],
            [
                12283,
                12285
            ],
            [
                12270,
                12281
            ],
            [
                12306,
                12309
            ],
            [
                12309,
                12323
            ],
            [
                12323,
                12352
            ],
            [
                12352,
                12486
            ],
            [
                12486,
                12522
            ],
            [
                12527,
                12564
            ],
            [
                12641,
                12696
            ],
            [
                12708,
                12732
            ],
            [
                12738,
                12763
            ],
            [
                12763,
                12802
            ],
            [
                12802,
                12805
            ],
            [
                12808,
                12833
            ],
            [
                12866,
                12926
            ],
            [
                12926,
                12929
            ],
            [
                12932,
                12953
            ],
            [
                12959,
                12970
            ],
            [
                13045,
                13057
            ],
            [
                13058,
                13070
            ],
            [
                13070,
                13075
            ],
            [
                13089,
                13113
            ],
            [
                13113,
                13146
            ],
            [
                13162,
                13190
            ],
            [
                13190,
                13258
            ],
            [
                13258,
                13269
            ],
            [
                13271,
                13287
            ],
            [
                13287,
                13341
            ],
            [
                13341,
                13482
            ],
            [
                13482,
                13534
            ],
            [
                13744,
                13800
            ],
            [
                13993,
                14034
            ],
            [
                14034,
                14054
            ],
            [
                14070,
                14117
            ],
            [
                14117,
                14155
            ],
            [
                14155,
                14226
            ],
            [
                14294,
                14301
            ],
            [
                14257,
                14269
            ],
            [
                14302,
                14306
            ],
            [
                14289,
                14293
            ],
            [
                14306,
                14343
            ],
            [
                14349,
                14395
            ],
            [
                14395,
                14451
            ],
            [
                14451,
                14454
            ],
            [
                14457,
                14473
            ],
            [
                14524,
                14528
            ],
            [
                14533,
                14549
            ],
            [
                14549,
                14605
            ],
            [
                14611,
                14618
            ],
            [
                14736,
                14759
            ],
            [
                14712,
                14716
            ],
            [
                14808,
                14810
            ],
            [
                14810,
                14839
            ],
            [
                14872,
                14935
            ],
            [
                14949,
                14955
            ],
            [
                14936,
                14945
            ],
            [
                14956,
                14967
            ],
            [
                14985,
                15009
            ],
            [
                15106,
                15159
            ],
            [
                15190,
                15201
            ],
            [
                15181,
                15184
            ],
            [
                15208,
                15264
            ],
            [
                15264,
                15309
            ],
            [
                15370,
                15392
            ],
            [
                15398,
                15425
            ],
            [
                15426,
                15470
            ],
            [
                15540,
                15583
            ],
            [
                15583,
                15584
            ],
            [
                15590,
                15599
            ],
            [
                15617,
                15619
            ],
            [
                15619,
                15624
            ],
            [
                15680,
                15684
            ],
            [
                15737,
                15739
            ],
            [
                15739,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15852
            ],
            [
                15852,
                15905
            ],
            [
                15905,
                15938
            ],
            [
                15938,
                15945
            ],
            [
                16003,
                16032
            ],
            [
                16092,
                16127
            ],
            [
                16127,
                16162
            ],
            [
                16220,
                16230
            ],
            [
                16214,
                16215
            ],
            [
                16162,
                16164
            ],
            [
                16238,
                16246
            ],
            [
                16246,
                16273
            ],
            [
                16273,
                16288
            ],
            [
                16306,
                16309
            ],
            [
                16324,
                16352
            ],
            [
                16352,
                16366
            ],
            [
                16366,
                16377
            ],
            [
                16385,
                16397
            ],
            [
                16397,
                16415
            ],
            [
                16415,
                16463
            ],
            [
                16463,
                16477
            ],
            [
                16477,
                16491
            ],
            [
                16499,
                16527
            ],
            [
                16538,
                16561
            ],
            [
                16561,
                16613
            ],
            [
                16675,
                16701
            ],
            [
                16701,
                16730
            ],
            [
                16733,
                16735
            ],
            [
                16743,
                16746
            ],
            [
                16753,
                16765
            ],
            [
                16765,
                16808
            ],
            [
                16808,
                16871
            ],
            [
                16871,
                16897
            ],
            [
                16897,
                16916
            ],
            [
                16941,
                16943
            ],
            [
                16943,
                16954
            ],
            [
                16954,
                17051
            ],
            [
                17051,
                17068
            ],
            [
                17068,
                17107
            ],
            [
                17107,
                17178
            ],
            [
                17350,
                17379
            ],
            [
                17379,
                17442
            ],
            [
                17452,
                17462
            ],
            [
                17471,
                17473
            ],
            [
                17473,
                17501
            ],
            [
                17526,
                17539
            ],
            [
                17583,
                17584
            ],
            [
                17585,
                17594
            ],
            [
                17613,
                17614
            ],
            [
                17616,
                17654
            ],
            [
                17667,
                17673
            ],
            [
                17673,
                17700
            ],
            [
                17700,
                17705
            ],
            [
                17745,
                17770
            ],
            [
                17770,
                17785
            ],
            [
                17797,
                17860
            ],
            [
                17862,
                17872
            ],
            [
                17872,
                17898
            ],
            [
                17898,
                17925
            ],
            [
                17925,
                17966
            ],
            [
                17989,
                18024
            ],
            [
                18024,
                18039
            ],
            [
                18041,
                18059
            ],
            [
                18059,
                18097
            ],
            [
                18099,
                18146
            ],
            [
                18177,
                18193
            ],
            [
                18195,
                18209
            ],
            [
                18210,
                18251
            ],
            [
                18251,
                18290
            ],
            [
                18361,
                18363
            ],
            [
                18363,
                18372
            ],
            [
                18377,
                18452
            ],
            [
                18511,
                18556
            ],
            [
                18556,
                18588
            ],
            [
                18588,
                18591
            ],
            [
                18619,
                18621
            ],
            [
                18621,
                18654
            ],
            [
                18811,
                18833
            ],
            [
                18833,
                18894
            ],
            [
                18894,
                18928
            ],
            [
                18928,
                18957
            ],
            [
                18957,
                18968
            ],
            [
                18968,
                19055
            ],
            [
                19055,
                19134
            ],
            [
                19166,
                19169
            ],
            [
                19169,
                19198
            ],
            [
                19209,
                19223
            ],
            [
                19223,
                19283
            ],
            [
                19284,
                19304
            ],
            [
                19319,
                19365
            ],
            [
                19365,
                19367
            ],
            [
                19373,
                19377
            ],
            [
                19405,
                19411
            ],
            [
                19434,
                19437
            ],
            [
                19630,
                19676
            ],
            [
                19680,
                19690
            ],
            [
                19530,
                19532
            ],
            [
                19693,
                19697
            ],
            [
                19711,
                19735
            ],
            [
                19735,
                19738
            ],
            [
                19800,
                19836
            ],
            [
                19840,
                19862
            ],
            [
                19863,
                19898
            ],
            [
                19898,
                19954
            ],
            [
                19954,
                19958
            ],
            [
                19968,
                20003
            ],
            [
                20006,
                20040
            ],
            [
                20040,
                20089
            ],
            [
                20098,
                20100
            ],
            [
                20119,
                20121
            ],
            [
                20126,
                20130
            ],
            [
                20122,
                20125
            ],
            [
                20131,
                20138
            ],
            [
                20138,
                20171
            ],
            [
                20171,
                20175
            ],
            [
                20177,
                20227
            ],
            [
                20227,
                20233
            ],
            [
                20235,
                20247
            ],
            [
                20247,
                20272
            ],
            [
                20312,
                20334
            ],
            [
                20334,
                20346
            ],
            [
                20352,
                20379
            ],
            [
                20390,
                20435
            ],
            [
                20435,
                20437
            ],
            [
                20446,
                20457
            ],
            [
                20457,
                20478
            ],
            [
                20486,
                20570
            ],
            [
                20572,
                20597
            ],
            [
                20706,
                20713
            ],
            [
                20727,
                20759
            ],
            [
                20762,
                20776
            ],
            [
                20795,
                20798
            ],
            [
                20798,
                20818
            ],
            [
                20955,
                20993
            ],
            [
                20993,
                21010
            ],
            [
                21010,
                21026
            ],
            [
                21026,
                21065
            ],
            [
                21089,
                21111
            ],
            [
                21111,
                21143
            ],
            [
                21144,
                21183
            ],
            [
                21215,
                21270
            ],
            [
                21270,
                21351
            ],
            [
                21394,
                21396
            ],
            [
                21464,
                21491
            ],
            [
                21421,
                21422
            ],
            [
                21496,
                21510
            ],
            [
                21517,
                21551
            ],
            [
                21740,
                21770
            ],
            [
                21779,
                21793
            ],
            [
                21795,
                21809
            ],
            [
                21817,
                21828
            ],
            [
                21893,
                21938
            ],
            [
                21938,
                21952
            ],
            [
                21980,
                22001
            ],
            [
                22001,
                22026
            ],
            [
                22026,
                22060
            ],
            [
                22060,
                22069
            ],
            [
                22069,
                22107
            ],
            [
                22107,
                22139
            ],
            [
                22142,
                22179
            ],
            [
                22203,
                22211
            ],
            [
                22218,
                22251
            ],
            [
                22251,
                22264
            ],
            [
                22264,
                22294
            ],
            [
                22294,
                22323
            ],
            [
                22323,
                22350
            ],
            [
                22350,
                22381
            ],
            [
                22384,
                22406
            ],
            [
                22417,
                22423
            ],
            [
                22439,
                22443
            ],
            [
                22474,
                22489
            ],
            [
                22515,
                22517
            ],
            [
                22531,
                22591
            ],
            [
                22591,
                22605
            ],
            [
                22628,
                22631
            ],
            [
                22631,
                22641
            ],
            [
                22648,
                22650
            ],
            [
                22671,
                22699
            ],
            [
                22699,
                22715
            ],
            [
                22719,
                22724
            ],
            [
                22732,
                22758
            ],
            [
                22797,
                22800
            ],
            [
                22759,
                22766
            ],
            [
                22770,
                22796
            ],
            [
                22915,
                22917
            ],
            [
                22917,
                22938
            ],
            [
                22944,
                22978
            ],
            [
                23006,
                23022
            ],
            [
                23031,
                23039
            ],
            [
                23081,
                23083
            ],
            [
                23280,
                23283
            ],
            [
                23320,
                23323
            ],
            [
                23328,
                23335
            ],
            [
                23312,
                23314
            ],
            [
                23335,
                23374
            ],
            [
                23374,
                23405
            ],
            [
                23411,
                23424
            ],
            [
                23427,
                23440
            ],
            [
                23543,
                23545
            ],
            [
                23514,
                23537
            ],
            [
                23486,
                23488
            ],
            [
                23552,
                23575
            ],
            [
                23586,
                23589
            ],
            [
                23576,
                23585
            ],
            [
                23590,
                23600
            ],
            [
                23659,
                23684
            ],
            [
                23685,
                23709
            ],
            [
                23737,
                23740
            ],
            [
                23740,
                23743
            ],
            [
                23748,
                23761
            ],
            [
                23768,
                23771
            ],
            [
                23771,
                23803
            ],
            [
                23803,
                23807
            ],
            [
                23826,
                23829
            ],
            [
                23829,
                23851
            ],
            [
                23853,
                23868
            ],
            [
                23868,
                23883
            ],
            [
                23883,
                23891
            ],
            [
                23896,
                23911
            ],
            [
                23911,
                23932
            ],
            [
                23935,
                23955
            ],
            [
                23955,
                23974
            ],
            [
                23995,
                23996
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                154
            ],
            [
                154,
                278
            ],
            [
                278,
                558
            ],
            [
                558,
                748
            ],
            [
                748,
                818
            ],
            [
                818,
                1007
            ],
            [
                1007,
                1143
            ],
            [
                1143,
                1367
            ],
            [
                1367,
                1427
            ],
            [
                1427,
                1632
            ],
            [
                1632,
                1689
            ],
            [
                1689,
                1747
            ],
            [
                1747,
                1767
            ],
            [
                1767,
                1785
            ],
            [
                1785,
                1859
            ],
            [
                1859,
                1901
            ],
            [
                1901,
                2045
            ],
            [
                2045,
                2228
            ],
            [
                2228,
                2344
            ],
            [
                2344,
                2478
            ],
            [
                2478,
                2501
            ],
            [
                2501,
                2542
            ],
            [
                2542,
                2692
            ],
            [
                2692,
                3590
            ],
            [
                3590,
                3714
            ],
            [
                3714,
                3799
            ],
            [
                3799,
                3946
            ],
            [
                3946,
                4000
            ],
            [
                4000,
                4086
            ],
            [
                4086,
                4140
            ],
            [
                4140,
                4248
            ],
            [
                4248,
                4393
            ],
            [
                4393,
                4617
            ],
            [
                4617,
                4676
            ],
            [
                4676,
                4774
            ],
            [
                4774,
                4819
            ],
            [
                4819,
                4896
            ],
            [
                4896,
                4954
            ],
            [
                4954,
                5001
            ],
            [
                5001,
                5008
            ],
            [
                5008,
                5032
            ],
            [
                5032,
                5097
            ],
            [
                5097,
                5140
            ],
            [
                5140,
                5227
            ],
            [
                5227,
                5254
            ],
            [
                5254,
                5323
            ],
            [
                5323,
                5345
            ],
            [
                5345,
                5366
            ],
            [
                5366,
                5453
            ],
            [
                5453,
                5592
            ],
            [
                5592,
                5653
            ],
            [
                5653,
                5719
            ],
            [
                5719,
                5753
            ],
            [
                5753,
                5889
            ],
            [
                5889,
                5969
            ],
            [
                5969,
                6031
            ],
            [
                6031,
                6122
            ],
            [
                6122,
                6251
            ],
            [
                6251,
                6355
            ],
            [
                6355,
                6541
            ],
            [
                6541,
                6606
            ],
            [
                6606,
                6684
            ],
            [
                6684,
                6775
            ],
            [
                6775,
                6908
            ],
            [
                6908,
                7027
            ],
            [
                7027,
                7085
            ],
            [
                7085,
                7270
            ],
            [
                7270,
                7307
            ],
            [
                7307,
                7625
            ],
            [
                7625,
                7800
            ],
            [
                7800,
                8030
            ],
            [
                8030,
                8213
            ],
            [
                8213,
                8304
            ],
            [
                8304,
                8660
            ],
            [
                8660,
                8735
            ],
            [
                8735,
                8796
            ],
            [
                8796,
                8952
            ],
            [
                8952,
                9025
            ],
            [
                9025,
                9136
            ],
            [
                9136,
                9240
            ],
            [
                9240,
                9352
            ],
            [
                9352,
                9469
            ],
            [
                9469,
                9571
            ],
            [
                9571,
                9613
            ],
            [
                9613,
                9735
            ],
            [
                9735,
                9898
            ],
            [
                9898,
                10104
            ],
            [
                10104,
                10149
            ],
            [
                10149,
                10240
            ],
            [
                10240,
                10402
            ],
            [
                10402,
                10442
            ],
            [
                10442,
                10521
            ],
            [
                10521,
                10559
            ],
            [
                10559,
                10614
            ],
            [
                10614,
                10646
            ],
            [
                10646,
                10712
            ],
            [
                10712,
                10741
            ],
            [
                10741,
                10803
            ],
            [
                10803,
                10841
            ],
            [
                10841,
                10892
            ],
            [
                10892,
                10986
            ],
            [
                10986,
                11045
            ],
            [
                11045,
                11174
            ],
            [
                11174,
                11304
            ],
            [
                11304,
                11323
            ],
            [
                11323,
                11358
            ],
            [
                11358,
                11447
            ],
            [
                11447,
                11494
            ],
            [
                11494,
                11552
            ],
            [
                11552,
                11823
            ],
            [
                11823,
                11908
            ],
            [
                11908,
                12042
            ],
            [
                12042,
                12093
            ],
            [
                12093,
                12206
            ],
            [
                12206,
                12255
            ],
            [
                12255,
                12309
            ],
            [
                12309,
                12323
            ],
            [
                12323,
                12352
            ],
            [
                12352,
                12486
            ],
            [
                12486,
                12566
            ],
            [
                12566,
                12641
            ],
            [
                12641,
                12763
            ],
            [
                12763,
                12802
            ],
            [
                12802,
                12926
            ],
            [
                12926,
                12953
            ],
            [
                12953,
                12997
            ],
            [
                12997,
                13045
            ],
            [
                13045,
                13070
            ],
            [
                13070,
                13113
            ],
            [
                13113,
                13190
            ],
            [
                13190,
                13258
            ],
            [
                13258,
                13287
            ],
            [
                13287,
                13341
            ],
            [
                13341,
                13482
            ],
            [
                13482,
                13534
            ],
            [
                13534,
                13613
            ],
            [
                13613,
                13669
            ],
            [
                13669,
                13712
            ],
            [
                13712,
                13800
            ],
            [
                13800,
                13909
            ],
            [
                13909,
                13993
            ],
            [
                13993,
                14034
            ],
            [
                14034,
                14117
            ],
            [
                14117,
                14155
            ],
            [
                14155,
                14226
            ],
            [
                14226,
                14395
            ],
            [
                14395,
                14451
            ],
            [
                14451,
                14549
            ],
            [
                14549,
                14810
            ],
            [
                14810,
                15011
            ],
            [
                15011,
                15106
            ],
            [
                15106,
                15159
            ],
            [
                15159,
                15264
            ],
            [
                15264,
                15426
            ],
            [
                15426,
                15470
            ],
            [
                15470,
                15531
            ],
            [
                15531,
                15540
            ],
            [
                15540,
                15583
            ],
            [
                15583,
                15619
            ],
            [
                15619,
                15739
            ],
            [
                15739,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15852
            ],
            [
                15852,
                15905
            ],
            [
                15905,
                15938
            ],
            [
                15938,
                16032
            ],
            [
                16032,
                16092
            ],
            [
                16092,
                16127
            ],
            [
                16127,
                16162
            ],
            [
                16162,
                16246
            ],
            [
                16246,
                16273
            ],
            [
                16273,
                16288
            ],
            [
                16288,
                16352
            ],
            [
                16352,
                16366
            ],
            [
                16366,
                16397
            ],
            [
                16397,
                16415
            ],
            [
                16415,
                16463
            ],
            [
                16463,
                16477
            ],
            [
                16477,
                16561
            ],
            [
                16561,
                16613
            ],
            [
                16613,
                16645
            ],
            [
                16645,
                16675
            ],
            [
                16675,
                16701
            ],
            [
                16701,
                16765
            ],
            [
                16765,
                16808
            ],
            [
                16808,
                16871
            ],
            [
                16871,
                16897
            ],
            [
                16897,
                16943
            ],
            [
                16943,
                16954
            ],
            [
                16954,
                17051
            ],
            [
                17051,
                17068
            ],
            [
                17068,
                17107
            ],
            [
                17107,
                17178
            ],
            [
                17178,
                17350
            ],
            [
                17350,
                17379
            ],
            [
                17379,
                17473
            ],
            [
                17473,
                17585
            ],
            [
                17585,
                17673
            ],
            [
                17673,
                17700
            ],
            [
                17700,
                17770
            ],
            [
                17770,
                17872
            ],
            [
                17872,
                17898
            ],
            [
                17898,
                17925
            ],
            [
                17925,
                18024
            ],
            [
                18024,
                18059
            ],
            [
                18059,
                18146
            ],
            [
                18146,
                18177
            ],
            [
                18177,
                18251
            ],
            [
                18251,
                18363
            ],
            [
                18363,
                18453
            ],
            [
                18453,
                18511
            ],
            [
                18511,
                18556
            ],
            [
                18556,
                18588
            ],
            [
                18588,
                18621
            ],
            [
                18621,
                18654
            ],
            [
                18654,
                18743
            ],
            [
                18743,
                18777
            ],
            [
                18777,
                18811
            ],
            [
                18811,
                18833
            ],
            [
                18833,
                18894
            ],
            [
                18894,
                18928
            ],
            [
                18928,
                18957
            ],
            [
                18957,
                18968
            ],
            [
                18968,
                19055
            ],
            [
                19055,
                19169
            ],
            [
                19169,
                19223
            ],
            [
                19223,
                19365
            ],
            [
                19365,
                19735
            ],
            [
                19735,
                19836
            ],
            [
                19836,
                19863
            ],
            [
                19863,
                19898
            ],
            [
                19898,
                19954
            ],
            [
                19954,
                20040
            ],
            [
                20040,
                20100
            ],
            [
                20100,
                20119
            ],
            [
                20119,
                20138
            ],
            [
                20138,
                20171
            ],
            [
                20171,
                20227
            ],
            [
                20227,
                20247
            ],
            [
                20247,
                20334
            ],
            [
                20334,
                20435
            ],
            [
                20435,
                20457
            ],
            [
                20457,
                20597
            ],
            [
                20597,
                20641
            ],
            [
                20641,
                20706
            ],
            [
                20706,
                20798
            ],
            [
                20798,
                20818
            ],
            [
                20818,
                20924
            ],
            [
                20924,
                20941
            ],
            [
                20941,
                20955
            ],
            [
                20955,
                20993
            ],
            [
                20993,
                21010
            ],
            [
                21010,
                21026
            ],
            [
                21026,
                21067
            ],
            [
                21067,
                21089
            ],
            [
                21089,
                21111
            ],
            [
                21111,
                21144
            ],
            [
                21144,
                21270
            ],
            [
                21270,
                21552
            ],
            [
                21552,
                21654
            ],
            [
                21654,
                21740
            ],
            [
                21740,
                21830
            ],
            [
                21830,
                21893
            ],
            [
                21893,
                21938
            ],
            [
                21938,
                21953
            ],
            [
                21953,
                21980
            ],
            [
                21980,
                22001
            ],
            [
                22001,
                22026
            ],
            [
                22026,
                22060
            ],
            [
                22060,
                22069
            ],
            [
                22069,
                22107
            ],
            [
                22107,
                22251
            ],
            [
                22251,
                22264
            ],
            [
                22264,
                22294
            ],
            [
                22294,
                22323
            ],
            [
                22323,
                22350
            ],
            [
                22350,
                22406
            ],
            [
                22406,
                22517
            ],
            [
                22517,
                22531
            ],
            [
                22531,
                22591
            ],
            [
                22591,
                22631
            ],
            [
                22631,
                22650
            ],
            [
                22650,
                22671
            ],
            [
                22671,
                22699
            ],
            [
                22699,
                22917
            ],
            [
                22917,
                23083
            ],
            [
                23083,
                23280
            ],
            [
                23280,
                23374
            ],
            [
                23374,
                23441
            ],
            [
                23441,
                23600
            ],
            [
                23600,
                23685
            ],
            [
                23685,
                23740
            ],
            [
                23740,
                23771
            ],
            [
                23771,
                23803
            ],
            [
                23803,
                23829
            ],
            [
                23829,
                23868
            ],
            [
                23868,
                23883
            ],
            [
                23883,
                23911
            ],
            [
                23911,
                23955
            ],
            [
                23955,
                23996
            ]
        ]
    },
    "abridged": {
        "text": "Paul Montague at this time lived in comfortable lodgings in Sackville Street, and the world appeared to go well with him. But he had many troubles. His troubles about Fisker, Montague, and Montague are already known to the reader. He was also troubled about his love, though when he thought about the success of the great railway he hoped that he might be blessed by Henrietta's acceptance. He was troubled too about the gambling, which he disliked, and yet returned to.\nBut there was another trouble which culminated just at this time. One morning he got a cab in Piccadilly and travelled to a certain address in Islington. Here he knocked at a decent, modest door, and asked for Mrs. Hurtle.\nHe was shown into the drawing-room, and stood by the table until Mrs. Hurtle entered the room. Mrs. Hurtle was a widow whom he had once promised to marry.\n\"Paul,\" she said, with a quick, sharp voice, but a voice which could be very pleasant when she pleased, \"Paul, say that that letter of yours means nothing. Say that, and I will forgive everything.\"\n\"I cannot say that.\"\n\"You cannot say it! What do you mean? Will you dare to tell me that your promises mean nothing?\"\n\"Things are changed,\" said Paul hoarsely. He had come here at her bidding because he had felt that to stay away would be cowardly, but the meeting was inexpressibly painful to him. He did think that he had sufficient excuse for breaking his troth to this woman, but he hardly knew how to justify it to her. He had heard things about her past life which, had he heard them before, would have saved him from this difficulty. But he had loved her - did love her in a way, in spite of her offences.\n\"How are they changed? I am two years older, if you mean that.\" As she said this she looked round at the mirror, as though to see whether she was become haggard with age. She was very lovely, though not in the current fashion. She was a dark brunette with large round blue eyes, that could be soft, but could also be very severe. Her silken hair, almost black, hung in a thousand curls around her head and neck. Her cheeks and lips were full, and she blushed easily. Her bust was beautifully shaped; but she dressed as though she were oblivious of her own charms.\nHer dress, when Montague had seen her, was always black, always new, always nice, well-fitting, and above all simple. She was certainly a beautiful woman, and she knew it. Of her age she had never spoken to Montague. She was in truth over thirty. But she was one of those whom years hardly seem to touch.\n\"You are as beautiful as ever you were,\" he said.\n\"Psha! I care nothing for my beauty unless it can bind me to your love. Sit down and tell me what it means.\" She seated herself opposite him.\n\"I told you in my letter.\"\n\"You told me nothing in your letter, except that it was - off. Why? Do you not love me?\" Then she threw herself upon her knees, and leaned upon his, looking up in his face. \"Paul,\" she said, \"I have come again across the Atlantic to see you, after so many months - and will you not give me one kiss? Even though you should leave me for ever, give me one kiss.\"\nOf course he kissed her, with a long, warm embrace. While she knelt there at his feet what could he do but embrace her?\n\"Now tell me everything,\" she said, seating herself on a footstool at his feet.\nShe did not look like a woman whom a man might scorn unpunished. Paul felt, even while she was caressing him, that she might well turn and rend him before he left her. He had known something of her temper before, though he had also known the truth and warmth of her love.\nHe had travelled with her from San Francisco to England, and she had been very good to him in illness, distress and poverty - for he had been almost penniless in New York. When they landed at Liverpool they were engaged to marry. He had given her the whole history of his life. This was when Hamilton K. Fisker was unknown to him. But she had told him little or nothing of her own life, except that she was a widow, travelling to Paris on business. When he left her at the London railway station, he was full of a lover's ardour.\nBut when he remembered that he must tell his friend Roger of his engagement, and remembered also how little he knew of Mrs. Hurtle, he became embarrassed. She had spoken hardly a word of her own family, although she had said that her husband had been a great miscreant, and her release from him had been the one blessing she had known before she had met Paul Montague. After she had left him, he reflected how bald was the story which he must tell Roger Carbury, and became dismayed. Such had been the woman's cleverness and charm, that he had passed weeks in her daily company without feeling that anything had been missing.\nHe had told Roger, and his friend had declared to him that it was impossible that he should marry a woman whom he had met on a train without knowing anything about her. Roger did all he could to persuade him to forget his love - and partially succeeded. Paul saw his mistake. Yet, though he was half false to his widow, he was half true to her. He had pledged his word, and said that ought to bind him.\nThen he returned to California, and learned through Hamilton K. Fisker that in San Francisco Mrs. Hurtle was regarded as a mystery. Some people did not believe that there ever had been a Mr. Hurtle. Others said that there certainly had been, and that he still existed. The fact, however, best known was, that she had shot a man through the head in Oregon. She had not been tried for it, as the world of Oregon had considered that the circumstances justified the deed. Everybody thought that she was very clever and very beautiful, but also very dangerous.\n\"She always had money,\" Hamilton Fisker said, \"but no one knew where it came from. I don't think, you know, that I should like to go in for a life partnership.\"\nMontague had seen her in New York on his second journey to San Francisco, and had then renewed his promises in spite of his cousin's caution. He told her that he was going to see what he could make of his broken fortunes - for this was before the great railway - and she had promised to follow him. Since then they had not met till this day. Letters from her had reached him in England, and he had answered these by trying to explain that their engagement must be at an end. And now she had followed him to London!\n\"Tell me everything,\" she said, looking up into his face.\n\"When did you arrive here?\"\n\"On Tuesday I reached Liverpool. There I found that you were in London, and so I came here. I can understand that you should have been estranged from me. Our meeting in New York was so short and wretched. I did not tell you because you then were poor yourself, but at that moment I was penniless. I could not get across to San Francisco as I said I would, and when I did you had quarrelled with your uncle and left. And now I am here. I at any rate have been faithful. And now,\" she said, \"tell me about yourself?\"\nHis position was very embarrassing. He ought to have gently pushed her away, have sprung to his legs, and have declared that, however faulty might have been his conduct, he did not intend to become her husband. But he was either too much or too little of a man to do that. He did vow to himself that she should never be his wife. But he did not know how to say this with properly apologetic courtesy.\n\"I am engaged here about this railway,\" he said. \"You have heard of it, I suppose?\"\n\"Heard of it! San Francisco is full of it. Hamilton Fisker is the great man of the day there, and, when I left, your uncle was buying a villa for seventy-four thousand dollars. And yet they say that the best of it has been transferred to you Londoners.\"\n\"It's doing very well, I believe,\" said Paul, with some shame, as he thought how little he knew about it.\n\"You are the manager here in England?\"\n\"No; I am a member of the firm; but the real manager here is our chairman, Mr. Melmotte.\"\n\"Ah - I have heard of him. A great man. You know him, of course?\"\n\"Yes; I see him once a week.\"\n\"I would sooner see that man than any of your dukes or lords. They tell me that he holds the world of commerce in his right hand. What power; what grandeur!\"\n\"Grand enough,\" said Paul, \"if it all came honestly.\"\n\"Such a man rises above honesty,\" said Mrs. Hurtle, \"as a great general rises above humanity when he sacrifices an army to conquer a nation. Such greatness is incompatible with small scruples. Commerce is not noble unless it rises to great heights. Do they say here that he is not honest?\"\n\"As he is my partner perhaps I had better say nothing against him.\"\n\"Of course such a man will be abused. People have said that Napoleon was a coward, and Washington a traitor. I would like to see Melmotte - to kiss his hand; but I would not condescend to speak a word of reverence to any of your Emperors.\"\n\"I fear you will find that your idol has feet of clay.\"\n\"Ah - you mean that he covets worldly wealth. All men and women break that commandment, but they do so stealthily, pretending to despise what they really love. Here is a man who boldly says that wealth is power, and that power is good, and that the more wealth a man has the greater and the nobler he can be.\"\nMontague had formed his own opinions about Melmotte. He believed the Grand Director to be as vile a scoundrel as ever lived. Mrs. Hurtle's enthusiasm was very pretty, and it was shocking to see it lavished on such a subject.\n\"Personally, I do not like him,\" said Paul.\n\"But you are prospering in this business?\"\n\"I suppose so. It is hard to tell. I fell into it altogether against my will. I had no alternative.\"\n\"It seems to me to have been a golden chance.\"\n\"As far as immediate results go it has been golden.\"\n\"That at any rate is well, Paul. And now - tell me what all this means. Why should our engagement be over? You used to love me, did you not?\"\nShe waited, and he had to answer. \"You know I did,\" he said.\n\"I thought so. You are sure of my love to you. Is it not so? Come, speak like a man. Do you doubt me?\"\nHe did not doubt her, and was forced to say so. \"No, indeed.\"\n\"Oh, with what half-mouthed words you speak - like a girl from a nursery! Out with it if you have anything to say against me! I have never lied to you. I have taken nothing from you - if not your heart. I have given you all that I have to give.\" Then she leaped to her feet and stood a little apart from him. \"If you hate me, say so.\"\n\"Winifrid,\" he said.\n\"Winifrid! Yes, now for the first time, though I have called you Paul from the moment you entered the room. Well, speak out. Is there another woman that you love?\"\nAt this moment Paul Montague proved that at any rate he was no coward. \"There is another,\" he said.\nShe stood silent, looking into his face, thinking how she would begin her attack. She fixed her eyes upon him, squeezing her hands together.\n\"Oh,\" she whispered; \"that is the reason why I am told that it is - off.\"\n\"That was not the reason.\"\n\"What better reason than that? Unless, indeed, as you have learned to love another so also you have learned to hate me.\"\n\"Listen to me, Winifrid.\"\n\"No, sir; no Winifrid now! How did you dare to kiss me, knowing that you were about to tell me I was to be cast aside? And so you love some other woman! I am too old to please you, too rough, too little like the dolls of your own country! Let me hear your other reasons, so that I may tell you that they are lies.\"\nThe reasons were very difficult to tell. Paul knew little about Winifrid Hurtle, and nothing at all about the late Mr. Hurtle.\n\"We know too little of each other,\" he said.\n\"What more do you want to know? Ask anything and I will tell you. Did I ever refuse to answer you? Is it about my money? You knew when you gave me your word that I had next to none. Now I have ample means of my own. You knew that I was a widow. What more? If you wish to hear of the wretch that was my husband, I will deluge you with stories. I should have thought that a man who loved would not have cared to hear much of that.\"\nHe knew that his position was indefensible. It would have been better for him not to have alluded to any other reasons, but to have stuck to his assertion that he loved another woman. He would have been called false, and a fiend, and might have had to endure whatever punishment an angry lady could inflict upon him. But his position would have been plain. Now he was all at sea.\n\"I wish to hear nothing,\" he said.\n\"Then why tell me that we know so little of each other? That is a poor excuse to make to a woman - after you have been false to her. Why did you not say that when we were in New York? Is that not mean?\"\n\"I do not think that I am mean.\"\n\"No; a man will lie to a woman, and justify it always. Who is this lady?\"\nHe knew that he could not mention Hetta Carbury's name. He had never asked her for her love, and had received no assurance that he was loved. \"I cannot name her.\"\n\"And I, who have come from California to see you, am to return satisfied because you tell me that you have changed your affections? You can shake hands with me, and go away without a pang?\"\n\"I did not say so.\"\n\"Did you say you would be my husband? Answer me, sir.\"\n\"I did say so.\"\n\"Do you now refuse to keep your promise?\"\n\"I cannot marry you.\"\n\"Then, sir, are you not a liar?\"\nIt would have taken him long to explain that a man may break a promise and yet not tell a lie. He had made up his mind to break his engagement before he had seen Hetta Carbury, because of the rumours he had heard of Mrs. Hurtle's past life, and his uncertainty about her husband.\n\"Oh, Paul,\" she said, changing into softness, \"I am pleading for my life! Have you given a promise to this lady also?\"\n\"No,\" said he.\n\"But she loves you?\"\n\"She has never said so.\"\n\"You have told her of your love?\"\n\"Never.\"\n\"There is nothing, then, between you? And you would put her against me,- some woman who has nothing to suffer, who, for all you know, cares nothing for you. Is that so?\"\n\"I suppose it is,\" said Paul.\n\"Then you may still be mine. Oh, Paul, come back to me. Will any woman love you as I do - live for you as I do? I have come here without a single friend. I have told the woman here that I am engaged to marry you.\"\n\"You have told your landlady?\"\n\"Certainly. Were you not engaged to me? Am I to have you visit, and to risk her insults, and perhaps be told to take myself off? I am here because you promised to make me your wife, and I am not ashamed of the fact. If she had doubted me, I could have shown her your letters. Now go and tell her that what I said is false - if you dare.\"\nPaul felt he could hardly leave the room in order to denounce a lady whom he had certainly ill-used. He needed to think; and he took up his hat to go.\n\"Do you mean to tell her?\"\n\"No,\" he said; \"not today.\"\n\"And you will come back to me?\"\n\"Yes.\"\n\"I have no friend here but you, Paul. Remember that. Remember your promises. Remember all our love - and be good to me.\" Then she let him go.",
        "paragraph_chars": [
            [
                0,
                471
            ],
            [
                471,
                694
            ],
            [
                694,
                849
            ],
            [
                849,
                1047
            ],
            [
                1047,
                1068
            ],
            [
                1068,
                1165
            ],
            [
                1165,
                1660
            ],
            [
                1660,
                2224
            ],
            [
                2224,
                2529
            ],
            [
                2529,
                2579
            ],
            [
                2579,
                2721
            ],
            [
                2721,
                2748
            ],
            [
                2748,
                3109
            ],
            [
                3109,
                3229
            ],
            [
                3229,
                3309
            ],
            [
                3309,
                3581
            ],
            [
                3581,
                4111
            ],
            [
                4111,
                4737
            ],
            [
                4737,
                5140
            ],
            [
                5140,
                5696
            ],
            [
                5696,
                5857
            ],
            [
                5857,
                6372
            ],
            [
                6372,
                6430
            ],
            [
                6430,
                6458
            ],
            [
                6458,
                6973
            ],
            [
                6973,
                7374
            ],
            [
                7374,
                7458
            ],
            [
                7458,
                7712
            ],
            [
                7712,
                7818
            ],
            [
                7818,
                7857
            ],
            [
                7857,
                7947
            ],
            [
                7947,
                8013
            ],
            [
                8013,
                8043
            ],
            [
                8043,
                8201
            ],
            [
                8201,
                8255
            ],
            [
                8255,
                8545
            ],
            [
                8545,
                8613
            ],
            [
                8613,
                8853
            ],
            [
                8853,
                8909
            ],
            [
                8909,
                9219
            ],
            [
                9219,
                9444
            ],
            [
                9444,
                9488
            ],
            [
                9488,
                9531
            ],
            [
                9531,
                9632
            ],
            [
                9632,
                9679
            ],
            [
                9679,
                9732
            ],
            [
                9732,
                9874
            ],
            [
                9874,
                9935
            ],
            [
                9935,
                10038
            ],
            [
                10038,
                10100
            ],
            [
                10100,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10620
            ],
            [
                10620,
                10720
            ],
            [
                10720,
                10861
            ],
            [
                10861,
                10935
            ],
            [
                10935,
                10962
            ],
            [
                10962,
                11083
            ],
            [
                11083,
                11109
            ],
            [
                11109,
                11424
            ],
            [
                11424,
                11551
            ],
            [
                11551,
                11596
            ],
            [
                11596,
                12026
            ],
            [
                12026,
                12406
            ],
            [
                12406,
                12441
            ],
            [
                12441,
                12644
            ],
            [
                12644,
                12677
            ],
            [
                12677,
                12751
            ],
            [
                12751,
                12914
            ],
            [
                12914,
                13104
            ],
            [
                13104,
                13124
            ],
            [
                13124,
                13179
            ],
            [
                13179,
                13195
            ],
            [
                13195,
                13237
            ],
            [
                13237,
                13259
            ],
            [
                13259,
                13292
            ],
            [
                13292,
                13572
            ],
            [
                13572,
                13691
            ],
            [
                13691,
                13706
            ],
            [
                13706,
                13727
            ],
            [
                13727,
                13752
            ],
            [
                13752,
                13786
            ],
            [
                13786,
                13795
            ],
            [
                13795,
                13965
            ],
            [
                13965,
                13995
            ],
            [
                13995,
                14209
            ],
            [
                14209,
                14240
            ],
            [
                14240,
                14578
            ],
            [
                14578,
                14729
            ],
            [
                14729,
                14756
            ],
            [
                14756,
                14784
            ],
            [
                14784,
                14816
            ],
            [
                14816,
                14823
            ],
            [
                14823,
                14964
            ]
        ],
        "segment_chars": [
            [
                0,
                122
            ],
            [
                122,
                148
            ],
            [
                148,
                231
            ],
            [
                231,
                391
            ],
            [
                391,
                471
            ],
            [
                471,
                537
            ],
            [
                537,
                625
            ],
            [
                625,
                694
            ],
            [
                694,
                789
            ],
            [
                789,
                849
            ],
            [
                849,
                1005
            ],
            [
                1005,
                1047
            ],
            [
                1047,
                1068
            ],
            [
                1068,
                1088
            ],
            [
                1088,
                1106
            ],
            [
                1106,
                1165
            ],
            [
                1165,
                1207
            ],
            [
                1207,
                1346
            ],
            [
                1346,
                1472
            ],
            [
                1472,
                1588
            ],
            [
                1588,
                1660
            ],
            [
                1660,
                1683
            ],
            [
                1683,
                1724
            ],
            [
                1724,
                1831
            ],
            [
                1831,
                1887
            ],
            [
                1887,
                1990
            ],
            [
                1990,
                2072
            ],
            [
                2072,
                2127
            ],
            [
                2127,
                2224
            ],
            [
                2224,
                2342
            ],
            [
                2342,
                2396
            ],
            [
                2396,
                2441
            ],
            [
                2441,
                2471
            ],
            [
                2471,
                2529
            ],
            [
                2529,
                2579
            ],
            [
                2579,
                2586
            ],
            [
                2586,
                2651
            ],
            [
                2651,
                2688
            ],
            [
                2688,
                2721
            ],
            [
                2721,
                2748
            ],
            [
                2748,
                2811
            ],
            [
                2811,
                2816
            ],
            [
                2816,
                2837
            ],
            [
                2837,
                2921
            ],
            [
                2921,
                3048
            ],
            [
                3048,
                3109
            ],
            [
                3109,
                3161
            ],
            [
                3161,
                3229
            ],
            [
                3229,
                3309
            ],
            [
                3309,
                3374
            ],
            [
                3374,
                3477
            ],
            [
                3477,
                3581
            ],
            [
                3581,
                3753
            ],
            [
                3753,
                3811
            ],
            [
                3811,
                3859
            ],
            [
                3859,
                3912
            ],
            [
                3912,
                4030
            ],
            [
                4030,
                4111
            ],
            [
                4111,
                4266
            ],
            [
                4266,
                4480
            ],
            [
                4480,
                4595
            ],
            [
                4595,
                4737
            ],
            [
                4737,
                4906
            ],
            [
                4906,
                4991
            ],
            [
                4991,
                5013
            ],
            [
                5013,
                5082
            ],
            [
                5082,
                5140
            ],
            [
                5140,
                5272
            ],
            [
                5272,
                5339
            ],
            [
                5339,
                5409
            ],
            [
                5409,
                5496
            ],
            [
                5496,
                5608
            ],
            [
                5608,
                5696
            ],
            [
                5696,
                5779
            ],
            [
                5779,
                5857
            ],
            [
                5857,
                5999
            ],
            [
                5999,
                6156
            ],
            [
                6156,
                6199
            ],
            [
                6199,
                6332
            ],
            [
                6332,
                6372
            ],
            [
                6372,
                6430
            ],
            [
                6430,
                6458
            ],
            [
                6458,
                6491
            ],
            [
                6491,
                6550
            ],
            [
                6550,
                6612
            ],
            [
                6612,
                6663
            ],
            [
                6663,
                6755
            ],
            [
                6755,
                6874
            ],
            [
                6874,
                6893
            ],
            [
                6893,
                6927
            ],
            [
                6927,
                6973
            ],
            [
                6973,
                7009
            ],
            [
                7009,
                7184
            ],
            [
                7184,
                7246
            ],
            [
                7246,
                7303
            ],
            [
                7303,
                7374
            ],
            [
                7374,
                7423
            ],
            [
                7423,
                7458
            ],
            [
                7458,
                7472
            ],
            [
                7472,
                7501
            ],
            [
                7501,
                7635
            ],
            [
                7635,
                7712
            ],
            [
                7712,
                7818
            ],
            [
                7818,
                7857
            ],
            [
                7857,
                7947
            ],
            [
                7947,
                7974
            ],
            [
                7974,
                7987
            ],
            [
                7987,
                8013
            ],
            [
                8013,
                8043
            ],
            [
                8043,
                8105
            ],
            [
                8105,
                8173
            ],
            [
                8173,
                8201
            ],
            [
                8201,
                8255
            ],
            [
                8255,
                8396
            ],
            [
                8396,
                8448
            ],
            [
                8448,
                8504
            ],
            [
                8504,
                8545
            ],
            [
                8545,
                8613
            ],
            [
                8613,
                8651
            ],
            [
                8651,
                8722
            ],
            [
                8722,
                8853
            ],
            [
                8853,
                8909
            ],
            [
                8909,
                8955
            ],
            [
                8955,
                9069
            ],
            [
                9069,
                9219
            ],
            [
                9219,
                9272
            ],
            [
                9272,
                9344
            ],
            [
                9344,
                9444
            ],
            [
                9444,
                9488
            ],
            [
                9488,
                9531
            ],
            [
                9531,
                9546
            ],
            [
                9546,
                9566
            ],
            [
                9566,
                9609
            ],
            [
                9609,
                9632
            ],
            [
                9632,
                9679
            ],
            [
                9679,
                9732
            ],
            [
                9732,
                9765
            ],
            [
                9765,
                9804
            ],
            [
                9804,
                9839
            ],
            [
                9839,
                9874
            ],
            [
                9874,
                9908
            ],
            [
                9908,
                9935
            ],
            [
                9935,
                9950
            ],
            [
                9950,
                9982
            ],
            [
                9982,
                9996
            ],
            [
                9996,
                10020
            ],
            [
                10020,
                10038
            ],
            [
                10038,
                10086
            ],
            [
                10086,
                10100
            ],
            [
                10100,
                10174
            ],
            [
                10174,
                10226
            ],
            [
                10226,
                10252
            ],
            [
                10252,
                10303
            ],
            [
                10303,
                10346
            ],
            [
                10346,
                10409
            ],
            [
                10409,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10467
            ],
            [
                10467,
                10564
            ],
            [
                10564,
                10581
            ],
            [
                10581,
                10620
            ],
            [
                10620,
                10691
            ],
            [
                10691,
                10720
            ],
            [
                10720,
                10802
            ],
            [
                10802,
                10861
            ],
            [
                10861,
                10935
            ],
            [
                10935,
                10962
            ],
            [
                10962,
                10993
            ],
            [
                10993,
                11083
            ],
            [
                11083,
                11109
            ],
            [
                11109,
                11136
            ],
            [
                11136,
                11228
            ],
            [
                11228,
                11262
            ],
            [
                11262,
                11348
            ],
            [
                11348,
                11424
            ],
            [
                11424,
                11465
            ],
            [
                11465,
                11551
            ],
            [
                11551,
                11596
            ],
            [
                11596,
                11628
            ],
            [
                11628,
                11662
            ],
            [
                11662,
                11695
            ],
            [
                11695,
                11717
            ],
            [
                11717,
                11778
            ],
            [
                11778,
                11812
            ],
            [
                11812,
                11841
            ],
            [
                11841,
                11852
            ],
            [
                11852,
                11939
            ],
            [
                11939,
                12026
            ],
            [
                12026,
                12070
            ],
            [
                12070,
                12210
            ],
            [
                12210,
                12343
            ],
            [
                12343,
                12383
            ],
            [
                12383,
                12406
            ],
            [
                12406,
                12441
            ],
            [
                12441,
                12497
            ],
            [
                12497,
                12574
            ],
            [
                12574,
                12625
            ],
            [
                12625,
                12644
            ],
            [
                12644,
                12677
            ],
            [
                12677,
                12732
            ],
            [
                12732,
                12751
            ],
            [
                12751,
                12807
            ],
            [
                12807,
                12893
            ],
            [
                12893,
                12914
            ],
            [
                12914,
                13046
            ],
            [
                13046,
                13104
            ],
            [
                13104,
                13124
            ],
            [
                13124,
                13162
            ],
            [
                13162,
                13179
            ],
            [
                13179,
                13195
            ],
            [
                13195,
                13237
            ],
            [
                13237,
                13259
            ],
            [
                13259,
                13292
            ],
            [
                13292,
                13387
            ],
            [
                13387,
                13572
            ],
            [
                13572,
                13646
            ],
            [
                13646,
                13691
            ],
            [
                13691,
                13706
            ],
            [
                13706,
                13727
            ],
            [
                13727,
                13752
            ],
            [
                13752,
                13786
            ],
            [
                13786,
                13795
            ],
            [
                13795,
                13833
            ],
            [
                13833,
                13952
            ],
            [
                13952,
                13965
            ],
            [
                13965,
                13995
            ],
            [
                13995,
                14024
            ],
            [
                14024,
                14051
            ],
            [
                14051,
                14107
            ],
            [
                14107,
                14149
            ],
            [
                14149,
                14209
            ],
            [
                14209,
                14240
            ],
            [
                14240,
                14252
            ],
            [
                14252,
                14280
            ],
            [
                14280,
                14369
            ],
            [
                14369,
                14456
            ],
            [
                14456,
                14516
            ],
            [
                14516,
                14578
            ],
            [
                14578,
                14679
            ],
            [
                14679,
                14729
            ],
            [
                14729,
                14756
            ],
            [
                14756,
                14784
            ],
            [
                14784,
                14816
            ],
            [
                14816,
                14823
            ],
            [
                14823,
                14861
            ],
            [
                14861,
                14876
            ],
            [
                14876,
                14900
            ],
            [
                14900,
                14944
            ],
            [
                14944,
                14964
            ]
        ],
        "overlap_chars": [
            [
                0,
                81
            ],
            [
                82,
                91
            ],
            [
                107,
                122
            ],
            [
                122,
                148
            ],
            [
                148,
                160
            ],
            [
                167,
                197
            ],
            [
                198,
                231
            ],
            [
                231,
                237
            ],
            [
                243,
                251
            ],
            [
                252,
                282
            ],
            [
                297,
                332
            ],
            [
                339,
                343
            ],
            [
                347,
                352
            ],
            [
                353,
                363
            ],
            [
                367,
                376
            ],
            [
                376,
                378
            ],
            [
                389,
                391
            ],
            [
                391,
                449
            ],
            [
                450,
                457
            ],
            [
                467,
                469
            ],
            [
                469,
                470
            ],
            [
                471,
                484
            ],
            [
                485,
                537
            ],
            [
                537,
                548
            ],
            [
                549,
                555
            ],
            [
                556,
                579
            ],
            [
                590,
                625
            ],
            [
                625,
                666
            ],
            [
                667,
                693
            ],
            [
                694,
                728
            ],
            [
                728,
                733
            ],
            [
                734,
                746
            ],
            [
                747,
                752
            ],
            [
                759,
                789
            ],
            [
                789,
                848
            ],
            [
                849,
                897
            ],
            [
                898,
                952
            ],
            [
                953,
                989
            ],
            [
                996,
                1005
            ],
            [
                1005,
                1013
            ],
            [
                1013,
                1047
            ],
            [
                1047,
                1065
            ],
            [
                1068,
                1088
            ],
            [
                1088,
                1106
            ],
            [
                1106,
                1149
            ],
            [
                1155,
                1165
            ],
            [
                1165,
                1207
            ],
            [
                1207,
                1218
            ],
            [
                1224,
                1266
            ],
            [
                1272,
                1346
            ],
            [
                1346,
                1430
            ],
            [
                1431,
                1452
            ],
            [
                1464,
                1472
            ],
            [
                1472,
                1484
            ],
            [
                1498,
                1531
            ],
            [
                1537,
                1570
            ],
            [
                1576,
                1588
            ],
            [
                1588,
                1608
            ],
            [
                1611,
                1628
            ],
            [
                1632,
                1633
            ],
            [
                1646,
                1658
            ],
            [
                1658,
                1660
            ],
            [
                1660,
                1683
            ],
            [
                1683,
                1724
            ],
            [
                1724,
                1764
            ],
            [
                1771,
                1812
            ],
            [
                1813,
                1829
            ],
            [
                1829,
                1831
            ],
            [
                1831,
                1851
            ],
            [
                1859,
                1862
            ],
            [
                1863,
                1865
            ],
            [
                1866,
                1869
            ],
            [
                1878,
                1887
            ],
            [
                1887,
                1894
            ],
            [
                1895,
                1910
            ],
            [
                1911,
                1949
            ],
            [
                1950,
                1990
            ],
            [
                1990,
                2045
            ],
            [
                2053,
                2072
            ],
            [
                2072,
                2091
            ],
            [
                2092,
                2106
            ],
            [
                2107,
                2110
            ],
            [
                2125,
                2127
            ],
            [
                2127,
                2139
            ],
            [
                2140,
                2167
            ],
            [
                2168,
                2204
            ],
            [
                2205,
                2223
            ],
            [
                2224,
                2234
            ],
            [
                2240,
                2280
            ],
            [
                2281,
                2305
            ],
            [
                2306,
                2323
            ],
            [
                2334,
                2342
            ],
            [
                2342,
                2361
            ],
            [
                2362,
                2396
            ],
            [
                2396,
                2441
            ],
            [
                2441,
                2469
            ],
            [
                2469,
                2471
            ],
            [
                2471,
                2529
            ],
            [
                2529,
                2537
            ],
            [
                2541,
                2579
            ],
            [
                2579,
                2586
            ],
            [
                2586,
                2651
            ],
            [
                2651,
                2659
            ],
            [
                2660,
                2688
            ],
            [
                2688,
                2691
            ],
            [
                2692,
                2715
            ],
            [
                2716,
                2721
            ],
            [
                2721,
                2748
            ],
            [
                2748,
                2784
            ],
            [
                2785,
                2803
            ],
            [
                2806,
                2811
            ],
            [
                2811,
                2814
            ],
            [
                2814,
                2816
            ],
            [
                2816,
                2837
            ],
            [
                2837,
                2896
            ],
            [
                2905,
                2921
            ],
            [
                2921,
                2977
            ],
            [
                2978,
                2989
            ],
            [
                2990,
                3010
            ],
            [
                3013,
                3048
            ],
            [
                3048,
                3108
            ],
            [
                3109,
                3133
            ],
            [
                3134,
                3161
            ],
            [
                3161,
                3228
            ],
            [
                3229,
                3309
            ],
            [
                3309,
                3312
            ],
            [
                3313,
                3355
            ],
            [
                3356,
                3361
            ],
            [
                3372,
                3374
            ],
            [
                3374,
                3403
            ],
            [
                3404,
                3406
            ],
            [
                3414,
                3433
            ],
            [
                3439,
                3477
            ],
            [
                3477,
                3580
            ],
            [
                3581,
                3683
            ],
            [
                3684,
                3692
            ],
            [
                3693,
                3696
            ],
            [
                3697,
                3704
            ],
            [
                3707,
                3753
            ],
            [
                3753,
                3800
            ],
            [
                3809,
                3811
            ],
            [
                3811,
                3813
            ],
            [
                3814,
                3859
            ],
            [
                3859,
                3867
            ],
            [
                3868,
                3912
            ],
            [
                3912,
                3967
            ],
            [
                3975,
                3996
            ],
            [
                3997,
                4030
            ],
            [
                4030,
                4077
            ],
            [
                4078,
                4092
            ],
            [
                4093,
                4110
            ],
            [
                4111,
                4146
            ],
            [
                4147,
                4229
            ],
            [
                4241,
                4266
            ],
            [
                4266,
                4294
            ],
            [
                4295,
                4312
            ],
            [
                4312,
                4313
            ],
            [
                4323,
                4330
            ],
            [
                4331,
                4361
            ],
            [
                4370,
                4376
            ],
            [
                4379,
                4384
            ],
            [
                4385,
                4405
            ],
            [
                4406,
                4409
            ],
            [
                4415,
                4480
            ],
            [
                4480,
                4503
            ],
            [
                4504,
                4573
            ],
            [
                4578,
                4595
            ],
            [
                4595,
                4631
            ],
            [
                4632,
                4635
            ],
            [
                4636,
                4641
            ],
            [
                4641,
                4688
            ],
            [
                4689,
                4737
            ],
            [
                4737,
                4748
            ],
            [
                4754,
                4858
            ],
            [
                4862,
                4863
            ],
            [
                4864,
                4885
            ],
            [
                4895,
                4906
            ],
            [
                4906,
                4940
            ],
            [
                4945,
                4963
            ],
            [
                4966,
                4991
            ],
            [
                5000,
                5011
            ],
            [
                5016,
                5056
            ],
            [
                5060,
                5082
            ],
            [
                5082,
                5110
            ],
            [
                5111,
                5115
            ],
            [
                5116,
                5120
            ],
            [
                5121,
                5139
            ],
            [
                5140,
                5191
            ],
            [
                5192,
                5210
            ],
            [
                5211,
                5272
            ],
            [
                5272,
                5291
            ],
            [
                5292,
                5339
            ],
            [
                5339,
                5380
            ],
            [
                5380,
                5390
            ],
            [
                5391,
                5409
            ],
            [
                5409,
                5438
            ],
            [
                5439,
                5484
            ],
            [
                5485,
                5496
            ],
            [
                5496,
                5608
            ],
            [
                5608,
                5617
            ],
            [
                5618,
                5625
            ],
            [
                5626,
                5670
            ],
            [
                5671,
                5674
            ],
            [
                5675,
                5679
            ],
            [
                5680,
                5695
            ],
            [
                5696,
                5717
            ],
            [
                5717,
                5777
            ],
            [
                5779,
                5854
            ],
            [
                5857,
                5890
            ],
            [
                5891,
                5999
            ],
            [
                5999,
                6077
            ],
            [
                6080,
                6083
            ],
            [
                6084,
                6088
            ],
            [
                6089,
                6092
            ],
            [
                6100,
                6103
            ],
            [
                6104,
                6117
            ],
            [
                6120,
                6156
            ],
            [
                6156,
                6161
            ],
            [
                6167,
                6175
            ],
            [
                6180,
                6199
            ],
            [
                6199,
                6247
            ],
            [
                6248,
                6263
            ],
            [
                6264,
                6269
            ],
            [
                6270,
                6272
            ],
            [
                6280,
                6290
            ],
            [
                6291,
                6332
            ],
            [
                6332,
                6371
            ],
            [
                6372,
                6403
            ],
            [
                6404,
                6430
            ],
            [
                6430,
                6431
            ],
            [
                6431,
                6458
            ],
            [
                6459,
                6491
            ],
            [
                6491,
                6518
            ],
            [
                6519,
                6543
            ],
            [
                6548,
                6550
            ],
            [
                6550,
                6612
            ],
            [
                6612,
                6663
            ],
            [
                6663,
                6664
            ],
            [
                6669,
                6755
            ],
            [
                6755,
                6824
            ],
            [
                6829,
                6867
            ],
            [
                6872,
                6874
            ],
            [
                6874,
                6893
            ],
            [
                6893,
                6925
            ],
            [
                6927,
                6973
            ],
            [
                6973,
                6989
            ],
            [
                6990,
                6994
            ],
            [
                6995,
                7007
            ],
            [
                7007,
                7009
            ],
            [
                7009,
                7011
            ],
            [
                7018,
                7020
            ],
            [
                7021,
                7025
            ],
            [
                7026,
                7032
            ],
            [
                7033,
                7043
            ],
            [
                7048,
                7133
            ],
            [
                7134,
                7142
            ],
            [
                7143,
                7184
            ],
            [
                7184,
                7210
            ],
            [
                7211,
                7233
            ],
            [
                7240,
                7246
            ],
            [
                7246,
                7252
            ],
            [
                7257,
                7267
            ],
            [
                7268,
                7272
            ],
            [
                7273,
                7303
            ],
            [
                7303,
                7317
            ],
            [
                7318,
                7329
            ],
            [
                7334,
                7338
            ],
            [
                7339,
                7373
            ],
            [
                7374,
                7423
            ],
            [
                7423,
                7438
            ],
            [
                7439,
                7441
            ],
            [
                7444,
                7455
            ],
            [
                7455,
                7458
            ],
            [
                7458,
                7472
            ],
            [
                7472,
                7501
            ],
            [
                7501,
                7635
            ],
            [
                7635,
                7671
            ],
            [
                7672,
                7709
            ],
            [
                7712,
                7767
            ],
            [
                7768,
                7792
            ],
            [
                7793,
                7818
            ],
            [
                7818,
                7857
            ],
            [
                7857,
                7860
            ],
            [
                7862,
                7887
            ],
            [
                7887,
                7947
            ],
            [
                7947,
                7950
            ],
            [
                7953,
                7974
            ],
            [
                7974,
                7985
            ],
            [
                7987,
                7999
            ],
            [
                8001,
                8013
            ],
            [
                8013,
                8018
            ],
            [
                8019,
                8043
            ],
            [
                8043,
                8076
            ],
            [
                8077,
                8105
            ],
            [
                8105,
                8173
            ],
            [
                8173,
                8184
            ],
            [
                8185,
                8201
            ],
            [
                8201,
                8255
            ],
            [
                8255,
                8396
            ],
            [
                8396,
                8448
            ],
            [
                8448,
                8504
            ],
            [
                8504,
                8545
            ],
            [
                8545,
                8565
            ],
            [
                8566,
                8613
            ],
            [
                8613,
                8651
            ],
            [
                8651,
                8722
            ],
            [
                8722,
                8729
            ],
            [
                8738,
                8750
            ],
            [
                8756,
                8760
            ],
            [
                8765,
                8769
            ],
            [
                8769,
                8806
            ],
            [
                8807,
                8853
            ],
            [
                8853,
                8909
            ],
            [
                8909,
                8912
            ],
            [
                8915,
                8931
            ],
            [
                8932,
                8936
            ],
            [
                8939,
                8955
            ],
            [
                8955,
                9011
            ],
            [
                9012,
                9019
            ],
            [
                9022,
                9045
            ],
            [
                9051,
                9055
            ],
            [
                9067,
                9069
            ],
            [
                9069,
                9098
            ],
            [
                9099,
                9162
            ],
            [
                9163,
                9169
            ],
            [
                9170,
                9179
            ],
            [
                9180,
                9191
            ],
            [
                9192,
                9216
            ],
            [
                9219,
                9272
            ],
            [
                9272,
                9283
            ],
            [
                9284,
                9287
            ],
            [
                9288,
                9344
            ],
            [
                9344,
                9389
            ],
            [
                9390,
                9412
            ],
            [
                9416,
                9443
            ],
            [
                9444,
                9488
            ],
            [
                9488,
                9531
            ],
            [
                9531,
                9532
            ],
            [
                9532,
                9541
            ],
            [
                9544,
                9546
            ],
            [
                9546,
                9551
            ],
            [
                9560,
                9564
            ],
            [
                9564,
                9566
            ],
            [
                9566,
                9609
            ],
            [
                9609,
                9632
            ],
            [
                9632,
                9679
            ],
            [
                9679,
                9732
            ],
            [
                9732,
                9765
            ],
            [
                9765,
                9772
            ],
            [
                9775,
                9804
            ],
            [
                9804,
                9839
            ],
            [
                9839,
                9874
            ],
            [
                9874,
                9884
            ],
            [
                9884,
                9885
            ],
            [
                9890,
                9892
            ],
            [
                9900,
                9908
            ],
            [
                9908,
                9935
            ],
            [
                9935,
                9950
            ],
            [
                9950,
                9953
            ],
            [
                9954,
                9982
            ],
            [
                9982,
                9996
            ],
            [
                9996,
                10007
            ],
            [
                10008,
                10020
            ],
            [
                10020,
                10038
            ],
            [
                10038,
                10086
            ],
            [
                10086,
                10100
            ],
            [
                10100,
                10114
            ],
            [
                10115,
                10143
            ],
            [
                10151,
                10174
            ],
            [
                10174,
                10226
            ],
            [
                10226,
                10252
            ],
            [
                10252,
                10281
            ],
            [
                10284,
                10286
            ],
            [
                10287,
                10290
            ],
            [
                10291,
                10303
            ],
            [
                10303,
                10346
            ],
            [
                10346,
                10409
            ],
            [
                10409,
                10435
            ],
            [
                10435,
                10454
            ],
            [
                10454,
                10456
            ],
            [
                10456,
                10467
            ],
            [
                10467,
                10564
            ],
            [
                10564,
                10581
            ],
            [
                10581,
                10620
            ],
            [
                10620,
                10691
            ],
            [
                10691,
                10720
            ],
            [
                10720,
                10783
            ],
            [
                10790,
                10800
            ],
            [
                10800,
                10802
            ],
            [
                10802,
                10830
            ],
            [
                10831,
                10844
            ],
            [
                10859,
                10860
            ],
            [
                10861,
                10870
            ],
            [
                10880,
                10881
            ],
            [
                10882,
                10920
            ],
            [
                10929,
                10935
            ],
            [
                10935,
                10962
            ],
            [
                10962,
                10967
            ],
            [
                10968,
                10993
            ],
            [
                10993,
                11008
            ],
            [
                11009,
                11072
            ],
            [
                11073,
                11083
            ],
            [
                11083,
                11109
            ],
            [
                11109,
                11136
            ],
            [
                11136,
                11177
            ],
            [
                11193,
                11228
            ],
            [
                11228,
                11243
            ],
            [
                11244,
                11262
            ],
            [
                11262,
                11300
            ],
            [
                11301,
                11348
            ],
            [
                11348,
                11364
            ],
            [
                11365,
                11379
            ],
            [
                11383,
                11424
            ],
            [
                11424,
                11463
            ],
            [
                11463,
                11465
            ],
            [
                11465,
                11474
            ],
            [
                11475,
                11550
            ],
            [
                11551,
                11596
            ],
            [
                11596,
                11628
            ],
            [
                11657,
                11660
            ],
            [
                11660,
                11662
            ],
            [
                11662,
                11695
            ],
            [
                11695,
                11717
            ],
            [
                11717,
                11778
            ],
            [
                11778,
                11812
            ],
            [
                11812,
                11841
            ],
            [
                11841,
                11852
            ],
            [
                11852,
                11939
            ],
            [
                11939,
                12018
            ],
            [
                12023,
                12026
            ],
            [
                12026,
                12055
            ],
            [
                12056,
                12070
            ],
            [
                12070,
                12130
            ],
            [
                12137,
                12157
            ],
            [
                12164,
                12210
            ],
            [
                12210,
                12212
            ],
            [
                12219,
                12223
            ],
            [
                12236,
                12242
            ],
            [
                12243,
                12246
            ],
            [
                12247,
                12293
            ],
            [
                12294,
                12304
            ],
            [
                12305,
                12307
            ],
            [
                12314,
                12318
            ],
            [
                12319,
                12343
            ],
            [
                12343,
                12346
            ],
            [
                12347,
                12383
            ],
            [
                12383,
                12405
            ],
            [
                12406,
                12441
            ],
            [
                12441,
                12497
            ],
            [
                12497,
                12501
            ],
            [
                12502,
                12537
            ],
            [
                12540,
                12574
            ],
            [
                12574,
                12623
            ],
            [
                12623,
                12625
            ],
            [
                12625,
                12627
            ],
            [
                12628,
                12632
            ],
            [
                12633,
                12636
            ],
            [
                12637,
                12644
            ],
            [
                12644,
                12677
            ],
            [
                12677,
                12681
            ],
            [
                12682,
                12732
            ],
            [
                12732,
                12738
            ],
            [
                12739,
                12751
            ],
            [
                12751,
                12776
            ],
            [
                12785,
                12807
            ],
            [
                12807,
                12819
            ],
            [
                12820,
                12847
            ],
            [
                12848,
                12893
            ],
            [
                12893,
                12895
            ],
            [
                12903,
                12914
            ],
            [
                12914,
                12935
            ],
            [
                12936,
                13020
            ],
            [
                13021,
                13046
            ],
            [
                13046,
                13053
            ],
            [
                13054,
                13086
            ],
            [
                13087,
                13101
            ],
            [
                13101,
                13104
            ],
            [
                13104,
                13124
            ],
            [
                13124,
                13162
            ],
            [
                13162,
                13179
            ],
            [
                13179,
                13195
            ],
            [
                13195,
                13234
            ],
            [
                13237,
                13259
            ],
            [
                13259,
                13291
            ],
            [
                13292,
                13331
            ],
            [
                13332,
                13387
            ],
            [
                13387,
                13468
            ],
            [
                13477,
                13479
            ],
            [
                13480,
                13507
            ],
            [
                13511,
                13512
            ],
            [
                13522,
                13536
            ],
            [
                13537,
                13571
            ],
            [
                13572,
                13602
            ],
            [
                13603,
                13617
            ],
            [
                13618,
                13632
            ],
            [
                13633,
                13644
            ],
            [
                13646,
                13691
            ],
            [
                13691,
                13705
            ],
            [
                13706,
                13727
            ],
            [
                13727,
                13752
            ],
            [
                13752,
                13786
            ],
            [
                13786,
                13795
            ],
            [
                13795,
                13833
            ],
            [
                13833,
                13865
            ],
            [
                13868,
                13905
            ],
            [
                13906,
                13914
            ],
            [
                13919,
                13952
            ],
            [
                13952,
                13965
            ],
            [
                13965,
                13995
            ],
            [
                13995,
                14024
            ],
            [
                14024,
                14051
            ],
            [
                14051,
                14082
            ],
            [
                14085,
                14107
            ],
            [
                14107,
                14113
            ],
            [
                14119,
                14123
            ],
            [
                14132,
                14147
            ],
            [
                14147,
                14149
            ],
            [
                14149,
                14209
            ],
            [
                14209,
                14223
            ],
            [
                14237,
                14240
            ],
            [
                14240,
                14250
            ],
            [
                14250,
                14252
            ],
            [
                14252,
                14280
            ],
            [
                14280,
                14296
            ],
            [
                14297,
                14302
            ],
            [
                14302,
                14328
            ],
            [
                14329,
                14332
            ],
            [
                14333,
                14340
            ],
            [
                14341,
                14367
            ],
            [
                14367,
                14369
            ],
            [
                14369,
                14390
            ],
            [
                14391,
                14425
            ],
            [
                14426,
                14442
            ],
            [
                14446,
                14454
            ],
            [
                14454,
                14456
            ],
            [
                14459,
                14462
            ],
            [
                14463,
                14466
            ],
            [
                14467,
                14474
            ],
            [
                14475,
                14477
            ],
            [
                14477,
                14516
            ],
            [
                14516,
                14547
            ],
            [
                14548,
                14561
            ],
            [
                14564,
                14577
            ],
            [
                14588,
                14590
            ],
            [
                14604,
                14627
            ],
            [
                14628,
                14630
            ],
            [
                14631,
                14654
            ],
            [
                14655,
                14658
            ],
            [
                14659,
                14668
            ],
            [
                14669,
                14679
            ],
            [
                14703,
                14728
            ],
            [
                14729,
                14753
            ],
            [
                14753,
                14756
            ],
            [
                14756,
                14759
            ],
            [
                14762,
                14775
            ],
            [
                14781,
                14784
            ],
            [
                14784,
                14816
            ],
            [
                14816,
                14820
            ],
            [
                14820,
                14823
            ],
            [
                14823,
                14845
            ],
            [
                14846,
                14861
            ],
            [
                14861,
                14876
            ],
            [
                14876,
                14884
            ],
            [
                14885,
                14900
            ],
            [
                14900,
                14921
            ],
            [
                14924,
                14944
            ],
            [
                14944,
                14963
            ],
            [
                14963,
                14964
            ]
        ],
        "row_chars": [
            [
                0,
                122
            ],
            [
                122,
                148
            ],
            [
                148,
                231
            ],
            [
                231,
                391
            ],
            [
                391,
                471
            ],
            [
                471,
                537
            ],
            [
                537,
                625
            ],
            [
                625,
                694
            ],
            [
                694,
                789
            ],
            [
                789,
                849
            ],
            [
                849,
                1005
            ],
            [
                1005,
                1047
            ],
            [
                1047,
                1068
            ],
            [
                1068,
                1088
            ],
            [
                1088,
                1106
            ],
            [
                1106,
                1165
            ],
            [
                1165,
                1207
            ],
            [
                1207,
                1346
            ],
            [
                1346,
                1472
            ],
            [
                1472,
                1588
            ],
            [
                1588,
                1660
            ],
            [
                1660,
                1683
            ],
            [
                1683,
                1724
            ],
            [
                1724,
                1831
            ],
            [
                1831,
                1887
            ],
            [
                1887,
                1990
            ],
            [
                1990,
                2072
            ],
            [
                2072,
                2127
            ],
            [
                2127,
                2127
            ],
            [
                2127,
                2127
            ],
            [
                2127,
                2127
            ],
            [
                2127,
                2127
            ],
            [
                2127,
                2224
            ],
            [
                2224,
                2342
            ],
            [
                2342,
                2396
            ],
            [
                2396,
                2396
            ],
            [
                2396,
                2441
            ],
            [
                2441,
                2471
            ],
            [
                2471,
                2529
            ],
            [
                2529,
                2579
            ],
            [
                2579,
                2586
            ],
            [
                2586,
                2586
            ],
            [
                2586,
                2651
            ],
            [
                2651,
                2688
            ],
            [
                2688,
                2721
            ],
            [
                2721,
                2748
            ],
            [
                2748,
                2811
            ],
            [
                2811,
                2816
            ],
            [
                2816,
                2837
            ],
            [
                2837,
                2921
            ],
            [
                2921,
                3048
            ],
            [
                3048,
                3109
            ],
            [
                3109,
                3161
            ],
            [
                3161,
                3161
            ],
            [
                3161,
                3229
            ],
            [
                3229,
                3309
            ],
            [
                3309,
                3309
            ],
            [
                3309,
                3374
            ],
            [
                3374,
                3477
            ],
            [
                3477,
                3581
            ],
            [
                3581,
                3753
            ],
            [
                3753,
                3811
            ],
            [
                3811,
                3859
            ],
            [
                3859,
                3912
            ],
            [
                3912,
                4030
            ],
            [
                4030,
                4111
            ],
            [
                4111,
                4111
            ],
            [
                4111,
                4266
            ],
            [
                4266,
                4266
            ],
            [
                4266,
                4480
            ],
            [
                4480,
                4595
            ],
            [
                4595,
                4737
            ],
            [
                4737,
                4906
            ],
            [
                4906,
                4991
            ],
            [
                4991,
                5013
            ],
            [
                5013,
                5082
            ],
            [
                5082,
                5140
            ],
            [
                5140,
                5272
            ],
            [
                5272,
                5339
            ],
            [
                5339,
                5409
            ],
            [
                5409,
                5496
            ],
            [
                5496,
                5608
            ],
            [
                5608,
                5696
            ],
            [
                5696,
                5779
            ],
            [
                5779,
                5779
            ],
            [
                5779,
                5857
            ],
            [
                5857,
                5999
            ],
            [
                5999,
                6156
            ],
            [
                6156,
                6199
            ],
            [
                6199,
                6199
            ],
            [
                6199,
                6332
            ],
            [
                6332,
                6372
            ],
            [
                6372,
                6430
            ],
            [
                6430,
                6458
            ],
            [
                6458,
                6458
            ],
            [
                6458,
                6491
            ],
            [
                6491,
                6550
            ],
            [
                6550,
                6550
            ],
            [
                6550,
                6612
            ],
            [
                6612,
                6612
            ],
            [
                6612,
                6663
            ],
            [
                6663,
                6755
            ],
            [
                6755,
                6755
            ],
            [
                6755,
                6755
            ],
            [
                6755,
                6874
            ],
            [
                6874,
                6893
            ],
            [
                6893,
                6927
            ],
            [
                6927,
                6927
            ],
            [
                6927,
                6973
            ],
            [
                6973,
                7009
            ],
            [
                7009,
                7184
            ],
            [
                7184,
                7246
            ],
            [
                7246,
                7303
            ],
            [
                7303,
                7303
            ],
            [
                7303,
                7374
            ],
            [
                7374,
                7423
            ],
            [
                7423,
                7458
            ],
            [
                7458,
                7472
            ],
            [
                7472,
                7501
            ],
            [
                7501,
                7635
            ],
            [
                7635,
                7712
            ],
            [
                7712,
                7712
            ],
            [
                7712,
                7818
            ],
            [
                7818,
                7857
            ],
            [
                7857,
                7947
            ],
            [
                7947,
                7974
            ],
            [
                7974,
                7987
            ],
            [
                7987,
                7987
            ],
            [
                7987,
                8013
            ],
            [
                8013,
                8043
            ],
            [
                8043,
                8105
            ],
            [
                8105,
                8173
            ],
            [
                8173,
                8201
            ],
            [
                8201,
                8255
            ],
            [
                8255,
                8396
            ],
            [
                8396,
                8448
            ],
            [
                8448,
                8448
            ],
            [
                8448,
                8448
            ],
            [
                8448,
                8448
            ],
            [
                8448,
                8504
            ],
            [
                8504,
                8504
            ],
            [
                8504,
                8504
            ],
            [
                8504,
                8545
            ],
            [
                8545,
                8613
            ],
            [
                8613,
                8651
            ],
            [
                8651,
                8722
            ],
            [
                8722,
                8853
            ],
            [
                8853,
                8909
            ],
            [
                8909,
                8955
            ],
            [
                8955,
                9069
            ],
            [
                9069,
                9219
            ],
            [
                9219,
                9219
            ],
            [
                9219,
                9272
            ],
            [
                9272,
                9344
            ],
            [
                9344,
                9444
            ],
            [
                9444,
                9488
            ],
            [
                9488,
                9488
            ],
            [
                9488,
                9488
            ],
            [
                9488,
                9531
            ],
            [
                9531,
                9546
            ],
            [
                9546,
                9566
            ],
            [
                9566,
                9609
            ],
            [
                9609,
                9632
            ],
            [
                9632,
                9679
            ],
            [
                9679,
                9732
            ],
            [
                9732,
                9765
            ],
            [
                9765,
                9804
            ],
            [
                9804,
                9804
            ],
            [
                9804,
                9839
            ],
            [
                9839,
                9874
            ],
            [
                9874,
                9908
            ],
            [
                9908,
                9935
            ],
            [
                9935,
                9950
            ],
            [
                9950,
                9982
            ],
            [
                9982,
                9996
            ],
            [
                9996,
                10020
            ],
            [
                10020,
                10038
            ],
            [
                10038,
                10086
            ],
            [
                10086,
                10100
            ],
            [
                10100,
                10174
            ],
            [
                10174,
                10226
            ],
            [
                10226,
                10226
            ],
            [
                10226,
                10226
            ],
            [
                10226,
                10252
            ],
            [
                10252,
                10303
            ],
            [
                10303,
                10346
            ],
            [
                10346,
                10409
            ],
            [
                10409,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10467
            ],
            [
                10467,
                10564
            ],
            [
                10564,
                10581
            ],
            [
                10581,
                10620
            ],
            [
                10620,
                10691
            ],
            [
                10691,
                10691
            ],
            [
                10691,
                10720
            ],
            [
                10720,
                10802
            ],
            [
                10802,
                10861
            ],
            [
                10861,
                10935
            ],
            [
                10935,
                10962
            ],
            [
                10962,
                10993
            ],
            [
                10993,
                11083
            ],
            [
                11083,
                11109
            ],
            [
                11109,
                11136
            ],
            [
                11136,
                11228
            ],
            [
                11228,
                11262
            ],
            [
                11262,
                11348
            ],
            [
                11348,
                11348
            ],
            [
                11348,
                11424
            ],
            [
                11424,
                11465
            ],
            [
                11465,
                11551
            ],
            [
                11551,
                11551
            ],
            [
                11551,
                11596
            ],
            [
                11596,
                11628
            ],
            [
                11628,
                11662
            ],
            [
                11662,
                11695
            ],
            [
                11695,
                11695
            ],
            [
                11695,
                11695
            ],
            [
                11695,
                11695
            ],
            [
                11695,
                11717
            ],
            [
                11717,
                11778
            ],
            [
                11778,
                11812
            ],
            [
                11812,
                11841
            ],
            [
                11841,
                11852
            ],
            [
                11852,
                11939
            ],
            [
                11939,
                12026
            ],
            [
                12026,
                12070
            ],
            [
                12070,
                12210
            ],
            [
                12210,
                12343
            ],
            [
                12343,
                12383
            ],
            [
                12383,
                12406
            ],
            [
                12406,
                12441
            ],
            [
                12441,
                12497
            ],
            [
                12497,
                12574
            ],
            [
                12574,
                12625
            ],
            [
                12625,
                12625
            ],
            [
                12625,
                12644
            ],
            [
                12644,
                12677
            ],
            [
                12677,
                12732
            ],
            [
                12732,
                12751
            ],
            [
                12751,
                12807
            ],
            [
                12807,
                12893
            ],
            [
                12893,
                12914
            ],
            [
                12914,
                13046
            ],
            [
                13046,
                13046
            ],
            [
                13046,
                13046
            ],
            [
                13046,
                13104
            ],
            [
                13104,
                13124
            ],
            [
                13124,
                13124
            ],
            [
                13124,
                13124
            ],
            [
                13124,
                13124
            ],
            [
                13124,
                13162
            ],
            [
                13162,
                13179
            ],
            [
                13179,
                13195
            ],
            [
                13195,
                13237
            ],
            [
                13237,
                13237
            ],
            [
                13237,
                13259
            ],
            [
                13259,
                13292
            ],
            [
                13292,
                13387
            ],
            [
                13387,
                13572
            ],
            [
                13572,
                13572
            ],
            [
                13572,
                13572
            ],
            [
                13572,
                13646
            ],
            [
                13646,
                13646
            ],
            [
                13646,
                13691
            ],
            [
                13691,
                13706
            ],
            [
                13706,
                13706
            ],
            [
                13706,
                13727
            ],
            [
                13727,
                13752
            ],
            [
                13752,
                13786
            ],
            [
                13786,
                13795
            ],
            [
                13795,
                13833
            ],
            [
                13833,
                13952
            ],
            [
                13952,
                13965
            ],
            [
                13965,
                13995
            ],
            [
                13995,
                14024
            ],
            [
                14024,
                14051
            ],
            [
                14051,
                14107
            ],
            [
                14107,
                14149
            ],
            [
                14149,
                14149
            ],
            [
                14149,
                14209
            ],
            [
                14209,
                14240
            ],
            [
                14240,
                14252
            ],
            [
                14252,
                14252
            ],
            [
                14252,
                14280
            ],
            [
                14280,
                14369
            ],
            [
                14369,
                14456
            ],
            [
                14456,
                14456
            ],
            [
                14456,
                14516
            ],
            [
                14516,
                14578
            ],
            [
                14578,
                14679
            ],
            [
                14679,
                14729
            ],
            [
                14729,
                14756
            ],
            [
                14756,
                14784
            ],
            [
                14784,
                14816
            ],
            [
                14816,
                14823
            ],
            [
                14823,
                14861
            ],
            [
                14861,
                14876
            ],
            [
                14876,
                14900
            ],
            [
                14900,
                14944
            ],
            [
                14944,
                14964
            ]
        ]
    }
}