{
    "original": {
        "text": "On the day after the visit just recorded, Paul Montague received the following letter from Mrs. Hurtle:--\nMY DEAR PAUL,--\nI think that perhaps we hardly made ourselves understood to each other yesterday, and I am sure that you do not understand how absolutely my whole life is now at stake. I need only refer you to our journey from San Francisco to London to make you conscious that I really love you. To a woman such love is all important. She cannot throw it from her as a man may do amidst the affairs of the world. Nor, if it has to be thrown from her, can she bear the loss as a man bears it. Her thoughts have dwelt on it with more constancy than his;--and then too her devotion has separated her from other things. My devotion to you has separated me from everything.\nBut I scorn to come to you as a suppliant. If you choose to say after hearing me that you will put me away from you because you have seen some one fairer than I am, whatever course I may take in my indignation, I shall not throw myself at your feet to tell you of my wrongs. I wish, however, that you should hear me. You say that there is some one you love better than you love me, but that you have not committed yourself to her. Alas, I know too much of the world to be surprised that a man's constancy should not stand out two years in the absence of his mistress. A man cannot wrap himself up and keep himself warm with an absent love as a woman does. But I think that some remembrance of the past must come back upon you now that you have seen me again. I think that you must have owned to yourself that you did love me, and that you could love me again. You sin against me to my utter destruction if you leave me. I have given up every friend I have to follow you. As regards the other--nameless lady, there can be no fault; for, as you tell me, she knows nothing of your passion.\nYou hinted that there were other reasons,--that we know too little of each other. You meant no doubt that you knew too little of me. Is it not the case that you were content when you knew only what was to be learned in those days of our sweet intimacy, but that you have been made discontented by stories told you by your partners at San Francisco? If this be so, trouble yourself at any rate to find out the truth before you allow yourself to treat a woman as you propose to treat me. I think you are too good a man to cast aside a woman you have loved,--like a soiled glove,--because ill-natured words have been spoken of her by men, or perhaps by women, who know nothing of her life. My late husband, Caradoc Hurtle, was Attorney-General in the State of Kansas when I married him, I being then in possession of a considerable fortune left to me by my mother. There his life was infamously bad. He spent what money he could get of mine, and then left me and the State, and took himself to Texas;--where he drank himself to death. I did not follow him, and in his absence I was divorced from him in accordance with the laws of Kansas State. I then went to San Francisco about property of my mother's, which my husband had fraudulently sold to a countryman of ours now resident in Paris,--having forged my name. There I met you, and in that short story I tell you all that there is to be told. It may be that you do not believe me now; but if so, are you not bound to go where you can verify your own doubts or my word?\nI try to write dispassionately, but I am in truth overborne by passion. I also have heard in California rumours about myself, and after much delay I received your letter. I resolved to follow you to England as soon as circumstances would permit me. I have been forced to fight a battle about my property, and I have won it. I had two reasons for carrying this through by my personal efforts before I saw you. I had begun it and had determined that I would not be beaten by fraud. And I was also determined that I would not plead to you as a pauper. We have talked too freely together in past days of our mutual money matters for me to feel any delicacy in alluding to them. When a man and woman have agreed to be husband and wife there should be no delicacy of that kind. When we came here together we were both embarrassed. We both had some property, but neither of us could enjoy it. Since that I have made my way through my difficulties. From what I have heard at San Francisco I suppose that you have done the same. I at any rate shall be perfectly contented if from this time our affairs can be made one.\nAnd now about myself,--immediately. I have come here all alone. Since I last saw you in New York I have not had altogether a good time. I have had a great struggle and have been thrown on my own resources and have been all alone. Very cruel things have been said of me. You heard cruel things said, but I presume them to have been said to you with reference to my late husband. Since that they have been said to others with reference to you. I have not now come, as my countrymen do generally, backed with a trunk full of introductions and with scores of friends ready to receive me. It was necessary to me that I should see you and hear my fate,--and here I am. I appeal to you to release me in some degree from the misery of my solitude. You know,--no one so well,--that my nature is social and that I am not given to be melancholy. Let us be cheerful together, as we once were, if it be only for a day. Let me see you as I used to see you, and let me be seen as I used to be seen.\nCome to me and take me out with you, and let us dine together, and take me to one of your theatres. If you wish it I will promise you not to allude to that revelation you made to me just now, though of course it is nearer to my heart than any other matter. Perhaps some woman's vanity makes me think that if you would only see me again, and talk to me as you used to talk, you would think of me as you used to think.\nYou need not fear but you will find me at home. I have no whither to go,--and shall hardly stir from the house till you come to me. Send me a line, however, that I may have my hat on if you are minded to do as I ask you.\nYours with all my heart,\nWINIFRID HURTLE.\nThis letter took her much time to write, though she was very careful so to write as to make it seem that it had flown easily from her pen. She copied it from the first draught, but she copied it rapidly, with one or two premeditated erasures, so that it should look to have been done hurriedly. There had been much art in it. She had at any rate suppressed any show of anger. In calling him to her she had so written as to make him feel that if he would come he need not fear the claws of an offended lioness:--and yet she was angry as a lioness who had lost her cub. She had almost ignored that other lady whose name she had not yet heard. She had spoken of her lover's entanglement with that other lady as a light thing which might easily be put aside. She had said much of her own wrongs, but had not said much of the wickedness of the wrong doer. Invited as she had invited him, surely he could not but come to her! And then, in her reference to money, not descending to the details of dollars and cents, she had studied how to make him feel that he might marry her without imprudence. As she read it over to herself she thought that there was a tone through it of natural feminine uncautious eagerness. She put her letter up in an envelope, stuck a stamp on it and addressed it,--and then threw herself back in her chair to think of her position.\nHe should marry her,--or there should be something done which should make the name of Winifrid Hurtle known to the world! She had no plan of revenge yet formed. She would not talk of revenge,--she told herself that she would not even think of revenge,--till she was quite sure that revenge would be necessary. But she did think of it, and could not keep her thoughts from it for a moment. Could it be possible that she, with all her intellectual gifts as well as those of her outward person, should be thrown over by a man whom well as she loved him,--and she did love him with all her heart,--she regarded as greatly inferior to herself! He had promised to marry her; and he should marry her, or the world should hear the story of his perjury!\nPaul Montague felt that he was surrounded by difficulties as soon as he read the letter. That his heart was all the other way he was quite sure; but yet it did seem to him that there was no escape from his troubles open to him. There was not a single word in this woman's letter that he could contradict. He had loved her and had promised to make her his wife,--and had determined to break his word to her because he found that she was enveloped in dangerous mystery. He had so resolved before he had ever seen Hetta Carbury, having been made to believe by Roger Carbury that a marriage with an unknown American woman,--of whom he only did know that she was handsome and clever,--would be a step to ruin. The woman, as Roger said, was an adventuress,--might never have had a husband,--might at this moment have two or three,--might be overwhelmed with debt,--might be anything bad, dangerous, and abominable. All that he had heard at San Francisco had substantiated Roger's views. \"Any scrape is better than that scrape,\" Roger had said to him. Paul had believed his Mentor, and had believed with a double faith as soon as he had seen Hetta Carbury.\nBut what should he do now? It was impossible, after what had passed between them, that he should leave Mrs. Hurtle at her lodgings at Islington without any notice. It was clear enough to him that she would not consent to be so left. Then her present proposal,--though it seemed to be absurd and almost comical in the tragical condition of their present circumstances,--had in it some immediate comfort. To take her out and give her a dinner, and then go with her to some theatre, would be easy and perhaps pleasant. It would be easier, and certainly much pleasanter, because she had pledged herself to abstain from talking of her grievances. Then he remembered some happy evenings, delicious hours, which he had so passed with her, when they were first together at New York. There could be no better companion for such a festival. She could talk,--and she could listen as well as talk. And she could sit silent, conveying to her neighbour the sense of her feminine charms by her simple proximity. He had been very happy when so placed. Had it been possible he would have escaped the danger now, but the reminiscence of past delights in some sort reconciled him to the performance of this perilous duty.\nBut when the evening should be over, how would he part with her? When the pleasant hour should have passed away and he had brought her back to her door, what should he say to her then? He must make some arrangement as to a future meeting. He knew that he was in a great peril, and he did not know how he might best escape it. He could not now go to Roger Carbury for advice; for was not Roger Carbury his rival? It would be for his friend's interest that he should marry the widow. Roger Carbury, as he knew well, was too honest a man to allow himself to be guided in any advice he might give by such a feeling, but, still, on this matter, he could no longer tell everything to Roger Carbury. He could not say all that he would have to say without speaking of Hetta;--and of his love for Hetta he could not speak to his rival.\nHe had no other friend in whom he could confide. There was no other human being he could trust, unless it was Hetta herself. He thought for a moment that he would write a stern and true letter to the woman, telling her that as it was impossible that there should ever be marriage between them, he felt himself bound to abstain from her society. But then he remembered her solitude, her picture of herself in London without even an acquaintance except himself, and he convinced himself that it would be impossible that he should leave her without seeing her. So he wrote to her thus;--\nDEAR WINIFRID,\nI will come for you to-morrow at half-past five. We will dine together at the Thespian;--and then I will have a box at the Haymarket. The Thespian is a good sort of place, and lots of ladies dine there. You can dine in your bonnet.\nYours affectionately,\nP. M.\nSome half-formed idea ran through his brain that P. M. was a safer signature than Paul Montague. Then came a long train of thoughts as to the perils of the whole proceeding. She had told him that she had announced herself to the keeper of the lodging-house as engaged to him, and he had in a manner authorised the statement by declining to contradict it at once. And now, after that announcement, he was assenting to her proposal that they should go out and amuse themselves together. Hitherto she had always seemed to him to be open, candid, and free from intrigue. He had known her to be impulsive, capricious, at times violent, but never deceitful. Perhaps he was unable to read correctly the inner character of a woman whose experience of the world had been much wider than his own. His mind misgave him that it might be so; but still he thought that he knew that she was not treacherous. And yet did not her present acts justify him in thinking that she was carrying on a plot against him? The note, however, was sent, and he prepared for the evening of the play, leaving the dangers of the occasion to adjust themselves. He ordered the dinner and he took the box, and at the hour fixed he was again at her lodgings.\nThe woman of the house with a smile showed him into Mrs. Hurtle's sitting-room, and he at once perceived that the smile was intended to welcome him as an accepted lover. It was a smile half of congratulation to the lover, half of congratulation to herself as a woman that another man had been caught by the leg and made fast. Who does not know the smile? What man, who has been caught and made sure, has not felt a certain dissatisfaction at being so treated, understanding that the smile is intended to convey to him a sense of his own captivity? It has, however, generally mattered but little to us. If we have felt that something of ridicule was intended, because we have been regarded as cocks with their spurs cut away, then we also have a pride when we have declared to ourselves that upon the whole we have gained more than we have lost. But with Paul Montague at the present moment there was no satisfaction, no pride,--only a feeling of danger which every hour became deeper, and stronger, with less chance of escape. He was almost tempted at this moment to detain the woman, and tell her the truth,--and bear the immediate consequences. But there would be treason in doing so, and he would not, could not do it.\nHe was left hardly a moment to think of this. Almost before the woman had shut the door, Mrs. Hurtle came to him out of her bedroom, with her hat on her head. Nothing could be more simple than her dress, and nothing prettier. It was now June, and the weather was warm, and the lady wore a light gauzy black dress,--there is a fabric which the milliners I think call grenadine,--coming close up round her throat. It was very pretty, and she was prettier even than her dress. And she had on a hat, black also, small and simple, but very pretty. There are times at which a man going to a theatre with a lady wishes her to be bright in her apparel,--almost gorgeous; in which he will hardly be contented unless her cloak be scarlet, and her dress white, and her gloves of some bright hue,--unless she wear roses or jewels in her hair. It is thus our girls go to the theatre now, when they go intending that all the world shall know who they are. But there are times again in which a man would prefer that his companion should be very quiet in her dress,--but still pretty; in which he would choose that she should dress herself for him only. All this Mrs. Hurtle had understood accurately; and Paul Montague, who understood nothing of it, was gratified. \"You told me to have a hat, and here I am,--hat and all.\" She gave him her hand, and laughed, and looked pleasantly at him, as though there was no cause of unhappiness between them. The lodging-house woman saw them enter the cab, and muttered some little word as they went off. Paul did not hear the word, but was sure that it bore some indistinct reference to his expected marriage.\nNeither during the drive, nor at the dinner, nor during the performance at the theatre, did she say a word in allusion to her engagement. It was with them, as in former days it had been at New York. She whispered pleasant words to him, touching his arm now and again with her finger as she spoke, seeming ever better inclined to listen than to speak. Now and again she referred, after some slightest fashion, to little circumstances that had occurred between them, to some joke, some hour of tedium, some moment of delight; but it was done as one man might do it to another,--if any man could have done it so pleasantly. There was a scent which he had once approved, and now she bore it on her handkerchief. There was a ring which he had once given her, and she wore it on the finger with which she touched his sleeve. With his own hands he had once adjusted her curls, and each curl was as he had placed it. She had a way of shaking her head, that was very pretty,--a way that might, one would think, have been dangerous at her age, as likely to betray those first grey hairs which will come to disturb the last days of youth. He had once told her in sport to be more careful. She now shook her head again, and, as he smiled, she told him that she could still dare to be careless. There are a thousand little silly softnesses which are pretty and endearing between acknowledged lovers, with which no woman would like to dispense, to which even men who are in love submit sometimes with delight; but which in other circumstances would be vulgar,--and to the woman distasteful. There are closenesses and sweet approaches, smiles and nods and pleasant winkings, whispers, innuendoes and hints, little mutual admirations and assurances that there are things known to those two happy ones of which the world beyond is altogether ignorant. Much of this comes of nature, but something of it sometimes comes by art. Of such art as there may be in it Mrs. Hurtle was a perfect master. No allusion was made to their engagement,--not an unpleasant word was spoken; but the art was practised with all its pleasant adjuncts. Paul was flattered to the top of his bent; and, though the sword was hanging over his head, though he knew that the sword must fall,--must partly fall that very night,--still he enjoyed it.\nThere are men who, of their natures, do not like women, even though they may have wives and legions of daughters, and be surrounded by things feminine in all the affairs of their lives. Others again have their strongest affinities and sympathies with women, and are rarely altogether happy when removed from their influence. Paul Montague was of the latter sort. At this time he was thoroughly in love with Hetta Carbury, and was not in love with Mrs. Hurtle. He would have given much of his golden prospects in the American railway to have had Mrs. Hurtle reconveyed suddenly to San Francisco. And yet he had a delight in her presence. \"The acting isn't very good,\" he said when the piece was nearly over.\n\"What does it signify? What we enjoy or what we suffer depends upon the humour. The acting is not first-rate, but I have listened and laughed and cried, because I have been happy.\"\nHe was bound to tell her that he also had enjoyed the evening, and was bound to say it in no voice of hypocritical constraint. \"It has been very jolly,\" he said.\n\"And one has so little that is really jolly, as you call it. I wonder whether any girl ever did sit and cry like that because her lover talked to another woman. What I find fault with is that the writers and actors are so ignorant of men and women as we see them every day. It's all right that she should cry, but she shouldn't cry there.\" The position described was so nearly her own, that he could say nothing to this. She had so spoken on purpose,--fighting her own battle after her own fashion, knowing well that her words would confuse him. \"A woman hides such tears. She may be found crying because she is unable to hide them;--but she does not willingly let the other woman see them. Does she?\"\n\"I suppose not.\"\n\"Medea did not weep when she was introduced to Creusa.\"\n\"Women are not all Medeas,\" he replied.\n\"There's a dash of the savage princess about most of them. I am quite ready if you like. I never want to see the curtain fall. And I have had no nosegay brought in a wheelbarrow to throw on to the stage. Are you going to see me home?\"\n\"Certainly.\"\n\"You need not. I'm not a bit afraid of a London cab by myself.\" But of course he accompanied her to Islington. He owed her at any rate as much as that. She continued to talk during the whole journey. What a wonderful place London was,--so immense, but so dirty! New York of course was not so big, but was, she thought, pleasanter. But Paris was the gem of gems among towns. She did not like Frenchmen, and she liked Englishmen even better than Americans; but she fancied that she could never like English women. \"I do so hate all kinds of buckram. I like good conduct, and law, and religion too if it be not forced down one's throat; but I hate what your women call propriety. I suppose what we have been doing to-night is very improper; but I am quite sure that it has not been in the least wicked.\"\n\"I don't think it has,\" said Paul Montague very tamely.\nIt is a long way from the Haymarket to Islington, but at last the cab reached the lodging-house door. \"Yes, this is it,\" she said. \"Even about the houses there is an air of stiff-necked propriety which frightens me.\" She was getting out as she spoke, and he had already knocked at the door. \"Come in for one moment,\" she said as he paid the cabman. The woman the while was standing with the door in her hand. It was near midnight,--but, when people are engaged, hours do not matter. The woman of the house, who was respectability herself,--a nice kind widow, with five children, named Pipkin,--understood that and smiled again as he followed the lady into the sitting-room. She had already taken off her hat and was flinging it on to the sofa as he entered. \"Shut the door for one moment,\" she said; and he shut it. Then she threw herself into his arms, not kissing him but looking up into his face. \"Oh Paul,\" she exclaimed, \"my darling! Oh Paul, my love! I will not bear to be separated from you. No, no;--never. I swear it, and you may believe me. There is nothing I cannot do for love of you,--but to lose you.\" Then she pushed him from her and looked away from him, clasping her hands together. \"But Paul, I mean to keep my pledge to you to-night. It was to be an island in our troubles, a little holiday in our hard school-time, and I will not destroy it at its close. You will see me again soon,--will you not?\" He nodded assent, then took her in his arms and kissed her, and left her without a word.",
        "paragraph_chars": [
            [
                0,
                106
            ],
            [
                106,
                122
            ],
            [
                122,
                776
            ],
            [
                776,
                1863
            ],
            [
                1863,
                3383
            ],
            [
                3383,
                4493
            ],
            [
                4493,
                5477
            ],
            [
                5477,
                5894
            ],
            [
                5894,
                6115
            ],
            [
                6115,
                6140
            ],
            [
                6140,
                6157
            ],
            [
                6157,
                7509
            ],
            [
                7509,
                8254
            ],
            [
                8254,
                9404
            ],
            [
                9404,
                10607
            ],
            [
                10607,
                11434
            ],
            [
                11434,
                12019
            ],
            [
                12019,
                12034
            ],
            [
                12034,
                12266
            ],
            [
                12266,
                12288
            ],
            [
                12288,
                12294
            ],
            [
                12294,
                13516
            ],
            [
                13516,
                14738
            ],
            [
                14738,
                16372
            ],
            [
                16372,
                18675
            ],
            [
                18675,
                19382
            ],
            [
                19382,
                19563
            ],
            [
                19563,
                19725
            ],
            [
                19725,
                20427
            ],
            [
                20427,
                20444
            ],
            [
                20444,
                20500
            ],
            [
                20500,
                20540
            ],
            [
                20540,
                20775
            ],
            [
                20775,
                20788
            ],
            [
                20788,
                21589
            ],
            [
                21589,
                21645
            ],
            [
                21645,
                23152
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                122
            ],
            [
                122,
                291
            ],
            [
                291,
                403
            ],
            [
                403,
                442
            ],
            [
                442,
                520
            ],
            [
                520,
                599
            ],
            [
                599,
                723
            ],
            [
                723,
                776
            ],
            [
                776,
                819
            ],
            [
                819,
                1051
            ],
            [
                1051,
                1093
            ],
            [
                1093,
                1207
            ],
            [
                1207,
                1344
            ],
            [
                1344,
                1432
            ],
            [
                1432,
                1535
            ],
            [
                1535,
                1636
            ],
            [
                1636,
                1696
            ],
            [
                1696,
                1747
            ],
            [
                1747,
                1863
            ],
            [
                1863,
                1945
            ],
            [
                1945,
                1996
            ],
            [
                1996,
                2212
            ],
            [
                2212,
                2349
            ],
            [
                2349,
                2550
            ],
            [
                2550,
                2725
            ],
            [
                2725,
                2760
            ],
            [
                2760,
                2895
            ],
            [
                2895,
                3005
            ],
            [
                3005,
                3175
            ],
            [
                3175,
                3257
            ],
            [
                3257,
                3383
            ],
            [
                3383,
                3455
            ],
            [
                3455,
                3554
            ],
            [
                3554,
                3632
            ],
            [
                3632,
                3707
            ],
            [
                3707,
                3792
            ],
            [
                3792,
                3863
            ],
            [
                3863,
                3932
            ],
            [
                3932,
                4057
            ],
            [
                4057,
                4155
            ],
            [
                4155,
                4208
            ],
            [
                4208,
                4269
            ],
            [
                4269,
                4324
            ],
            [
                4324,
                4403
            ],
            [
                4403,
                4493
            ],
            [
                4493,
                4529
            ],
            [
                4529,
                4557
            ],
            [
                4557,
                4629
            ],
            [
                4629,
                4723
            ],
            [
                4723,
                4763
            ],
            [
                4763,
                4871
            ],
            [
                4871,
                4935
            ],
            [
                4935,
                5077
            ],
            [
                5077,
                5156
            ],
            [
                5156,
                5233
            ],
            [
                5233,
                5328
            ],
            [
                5328,
                5399
            ],
            [
                5399,
                5477
            ],
            [
                5477,
                5577
            ],
            [
                5577,
                5734
            ],
            [
                5734,
                5894
            ],
            [
                5894,
                5942
            ],
            [
                5942,
                6026
            ],
            [
                6026,
                6115
            ],
            [
                6115,
                6140
            ],
            [
                6140,
                6157
            ],
            [
                6157,
                6296
            ],
            [
                6296,
                6452
            ],
            [
                6452,
                6483
            ],
            [
                6483,
                6533
            ],
            [
                6533,
                6725
            ],
            [
                6725,
                6798
            ],
            [
                6798,
                6912
            ],
            [
                6912,
                7008
            ],
            [
                7008,
                7077
            ],
            [
                7077,
                7247
            ],
            [
                7247,
                7365
            ],
            [
                7365,
                7509
            ],
            [
                7509,
                7631
            ],
            [
                7631,
                7670
            ],
            [
                7670,
                7819
            ],
            [
                7819,
                7898
            ],
            [
                7898,
                8148
            ],
            [
                8148,
                8254
            ],
            [
                8254,
                8343
            ],
            [
                8343,
                8482
            ],
            [
                8482,
                8559
            ],
            [
                8559,
                8722
            ],
            [
                8722,
                8959
            ],
            [
                8959,
                9163
            ],
            [
                9163,
                9235
            ],
            [
                9235,
                9299
            ],
            [
                9299,
                9404
            ],
            [
                9404,
                9431
            ],
            [
                9431,
                9568
            ],
            [
                9568,
                9637
            ],
            [
                9637,
                9807
            ],
            [
                9807,
                9920
            ],
            [
                9920,
                10046
            ],
            [
                10046,
                10179
            ],
            [
                10179,
                10235
            ],
            [
                10235,
                10290
            ],
            [
                10290,
                10401
            ],
            [
                10401,
                10440
            ],
            [
                10440,
                10607
            ],
            [
                10607,
                10672
            ],
            [
                10672,
                10792
            ],
            [
                10792,
                10846
            ],
            [
                10846,
                10933
            ],
            [
                10933,
                11019
            ],
            [
                11019,
                11089
            ],
            [
                11089,
                11300
            ],
            [
                11300,
                11434
            ],
            [
                11434,
                11483
            ],
            [
                11483,
                11559
            ],
            [
                11559,
                11779
            ],
            [
                11779,
                11992
            ],
            [
                11992,
                12019
            ],
            [
                12019,
                12034
            ],
            [
                12034,
                12083
            ],
            [
                12083,
                12168
            ],
            [
                12168,
                12237
            ],
            [
                12237,
                12266
            ],
            [
                12266,
                12288
            ],
            [
                12288,
                12294
            ],
            [
                12294,
                12391
            ],
            [
                12391,
                12468
            ],
            [
                12468,
                12657
            ],
            [
                12657,
                12779
            ],
            [
                12779,
                12861
            ],
            [
                12861,
                12946
            ],
            [
                12946,
                13081
            ],
            [
                13081,
                13187
            ],
            [
                13187,
                13289
            ],
            [
                13289,
                13421
            ],
            [
                13421,
                13516
            ],
            [
                13516,
                13686
            ],
            [
                13686,
                13842
            ],
            [
                13842,
                13871
            ],
            [
                13871,
                14064
            ],
            [
                14064,
                14118
            ],
            [
                14118,
                14361
            ],
            [
                14361,
                14543
            ],
            [
                14543,
                14663
            ],
            [
                14663,
                14738
            ],
            [
                14738,
                14784
            ],
            [
                14784,
                14897
            ],
            [
                14897,
                14964
            ],
            [
                14964,
                15150
            ],
            [
                15150,
                15212
            ],
            [
                15212,
                15281
            ],
            [
                15281,
                15569
            ],
            [
                15569,
                15680
            ],
            [
                15680,
                15876
            ],
            [
                15876,
                15988
            ],
            [
                15988,
                16046
            ],
            [
                16046,
                16170
            ],
            [
                16170,
                16266
            ],
            [
                16266,
                16372
            ],
            [
                16372,
                16510
            ],
            [
                16510,
                16571
            ],
            [
                16571,
                16723
            ],
            [
                16723,
                16993
            ],
            [
                16993,
                17080
            ],
            [
                17080,
                17191
            ],
            [
                17191,
                17281
            ],
            [
                17281,
                17500
            ],
            [
                17500,
                17550
            ],
            [
                17550,
                17654
            ],
            [
                17654,
                17949
            ],
            [
                17949,
                18207
            ],
            [
                18207,
                18281
            ],
            [
                18281,
                18349
            ],
            [
                18349,
                18485
            ],
            [
                18485,
                18675
            ],
            [
                18675,
                18861
            ],
            [
                18861,
                19000
            ],
            [
                19000,
                19038
            ],
            [
                19038,
                19135
            ],
            [
                19135,
                19270
            ],
            [
                19270,
                19312
            ],
            [
                19312,
                19382
            ],
            [
                19382,
                19405
            ],
            [
                19405,
                19462
            ],
            [
                19462,
                19563
            ],
            [
                19563,
                19690
            ],
            [
                19690,
                19725
            ],
            [
                19725,
                19786
            ],
            [
                19786,
                19886
            ],
            [
                19886,
                19999
            ],
            [
                19999,
                20065
            ],
            [
                20065,
                20146
            ],
            [
                20146,
                20271
            ],
            [
                20271,
                20298
            ],
            [
                20298,
                20416
            ],
            [
                20416,
                20427
            ],
            [
                20427,
                20444
            ],
            [
                20444,
                20500
            ],
            [
                20500,
                20540
            ],
            [
                20540,
                20599
            ],
            [
                20599,
                20629
            ],
            [
                20629,
                20667
            ],
            [
                20667,
                20744
            ],
            [
                20744,
                20775
            ],
            [
                20775,
                20788
            ],
            [
                20788,
                20803
            ],
            [
                20803,
                20852
            ],
            [
                20852,
                20899
            ],
            [
                20899,
                20940
            ],
            [
                20940,
                20988
            ],
            [
                20988,
                21050
            ],
            [
                21050,
                21119
            ],
            [
                21119,
                21162
            ],
            [
                21162,
                21300
            ],
            [
                21300,
                21336
            ],
            [
                21336,
                21465
            ],
            [
                21465,
                21589
            ],
            [
                21589,
                21645
            ],
            [
                21645,
                21747
            ],
            [
                21747,
                21776
            ],
            [
                21776,
                21862
            ],
            [
                21862,
                21936
            ],
            [
                21936,
                21994
            ],
            [
                21994,
                22054
            ],
            [
                22054,
                22128
            ],
            [
                22128,
                22319
            ],
            [
                22319,
                22403
            ],
            [
                22403,
                22461
            ],
            [
                22461,
                22545
            ],
            [
                22545,
                22584
            ],
            [
                22584,
                22602
            ],
            [
                22602,
                22644
            ],
            [
                22644,
                22660
            ],
            [
                22660,
                22696
            ],
            [
                22696,
                22761
            ],
            [
                22761,
                22845
            ],
            [
                22845,
                22898
            ],
            [
                22898,
                23020
            ],
            [
                23020,
                23064
            ],
            [
                23064,
                23152
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                7,
                10
            ],
            [
                40,
                64
            ],
            [
                79,
                103
            ],
            [
                106,
                119
            ],
            [
                122,
                152
            ],
            [
                168,
                178
            ],
            [
                182,
                291
            ],
            [
                291,
                403
            ],
            [
                403,
                442
            ],
            [
                442,
                483
            ],
            [
                518,
                520
            ],
            [
                520,
                523
            ],
            [
                558,
                599
            ],
            [
                599,
                658
            ],
            [
                660,
                663
            ],
            [
                673,
                723
            ],
            [
                723,
                776
            ],
            [
                819,
                825
            ],
            [
                836,
                839
            ],
            [
                857,
                870
            ],
            [
                854,
                856
            ],
            [
                892,
                929
            ],
            [
                985,
                1024
            ],
            [
                1049,
                1051
            ],
            [
                1051,
                1093
            ],
            [
                1093,
                1114
            ],
            [
                1124,
                1144
            ],
            [
                1154,
                1207
            ],
            [
                1432,
                1448
            ],
            [
                1498,
                1501
            ],
            [
                1478,
                1482
            ],
            [
                1469,
                1477
            ],
            [
                1502,
                1535
            ],
            [
                1535,
                1556
            ],
            [
                1580,
                1636
            ],
            [
                1636,
                1696
            ],
            [
                1696,
                1747
            ],
            [
                1747,
                1767
            ],
            [
                1778,
                1810
            ],
            [
                1828,
                1863
            ],
            [
                1863,
                1903
            ],
            [
                1906,
                1945
            ],
            [
                1945,
                1954
            ],
            [
                1964,
                1996
            ],
            [
                2129,
                2133
            ],
            [
                2020,
                2023
            ],
            [
                2002,
                2005
            ],
            [
                2134,
                2176
            ],
            [
                2194,
                2212
            ],
            [
                2259,
                2288
            ],
            [
                2339,
                2347
            ],
            [
                2324,
                2338
            ],
            [
                2347,
                2349
            ],
            [
                2349,
                2401
            ],
            [
                2419,
                2439
            ],
            [
                2441,
                2493
            ],
            [
                2520,
                2549
            ],
            [
                2550,
                2606
            ],
            [
                2620,
                2646
            ],
            [
                2677,
                2678
            ],
            [
                2692,
                2725
            ],
            [
                2725,
                2760
            ],
            [
                2760,
                2768
            ],
            [
                2774,
                2779
            ],
            [
                2800,
                2822
            ],
            [
                2838,
                2859
            ],
            [
                2862,
                2895
            ],
            [
                2895,
                3005
            ],
            [
                3005,
                3103
            ],
            [
                3149,
                3150
            ],
            [
                3152,
                3175
            ],
            [
                3175,
                3195
            ],
            [
                3199,
                3203
            ],
            [
                3227,
                3257
            ],
            [
                3272,
                3293
            ],
            [
                3297,
                3359
            ],
            [
                3364,
                3370
            ],
            [
                3381,
                3383
            ],
            [
                3383,
                3432
            ],
            [
                3443,
                3455
            ],
            [
                3455,
                3507
            ],
            [
                3552,
                3554
            ],
            [
                3554,
                3600
            ],
            [
                3630,
                3632
            ],
            [
                3632,
                3668
            ],
            [
                3725,
                3728
            ],
            [
                3675,
                3705
            ],
            [
                3867,
                3872
            ],
            [
                3878,
                3932
            ],
            [
                4057,
                4140
            ],
            [
                3967,
                3969
            ],
            [
                3994,
                3999
            ],
            [
                4153,
                4155
            ],
            [
                4280,
                4322
            ],
            [
                4324,
                4363
            ],
            [
                4364,
                4373
            ],
            [
                4379,
                4402
            ],
            [
                4493,
                4513
            ],
            [
                4527,
                4529
            ],
            [
                4529,
                4557
            ],
            [
                4557,
                4604
            ],
            [
                4616,
                4629
            ],
            [
                4629,
                4697
            ],
            [
                4721,
                4723
            ],
            [
                4723,
                4761
            ],
            [
                4806,
                4810
            ],
            [
                4912,
                4935
            ],
            [
                4935,
                4941
            ],
            [
                5048,
                5055
            ],
            [
                5056,
                5077
            ],
            [
                5105,
                5106
            ],
            [
                5094,
                5096
            ],
            [
                5114,
                5138
            ],
            [
                5141,
                5144
            ],
            [
                5156,
                5185
            ],
            [
                5201,
                5233
            ],
            [
                5233,
                5241
            ],
            [
                5290,
                5303
            ],
            [
                5316,
                5328
            ],
            [
                5328,
                5376
            ],
            [
                5383,
                5398
            ],
            [
                5477,
                5481
            ],
            [
                5488,
                5503
            ],
            [
                5512,
                5543
            ],
            [
                5552,
                5577
            ],
            [
                5577,
                5588
            ],
            [
                5592,
                5606
            ],
            [
                5611,
                5658
            ],
            [
                5732,
                5734
            ],
            [
                5734,
                5741
            ],
            [
                5747,
                5894
            ],
            [
                5916,
                5940
            ],
            [
                5965,
                5966
            ],
            [
                5942,
                5948
            ],
            [
                5960,
                5965
            ],
            [
                6024,
                6026
            ],
            [
                6026,
                6040
            ],
            [
                6113,
                6115
            ],
            [
                6115,
                6140
            ],
            [
                6140,
                6145
            ],
            [
                6149,
                6157
            ],
            [
                6157,
                6225
            ],
            [
                6241,
                6296
            ],
            [
                6338,
                6359
            ],
            [
                6310,
                6324
            ],
            [
                6359,
                6452
            ],
            [
                6483,
                6490
            ],
            [
                6503,
                6513
            ],
            [
                6551,
                6554
            ],
            [
                6526,
                6531
            ],
            [
                6668,
                6683
            ],
            [
                6574,
                6576
            ],
            [
                6684,
                6725
            ],
            [
                7008,
                7049
            ],
            [
                7064,
                7076
            ],
            [
                7247,
                7266
            ],
            [
                7278,
                7294
            ],
            [
                7320,
                7322
            ],
            [
                7305,
                7311
            ],
            [
                7323,
                7342
            ],
            [
                7354,
                7365
            ],
            [
                7365,
                7383
            ],
            [
                7387,
                7402
            ],
            [
                7427,
                7440
            ],
            [
                7442,
                7491
            ],
            [
                7507,
                7509
            ],
            [
                7509,
                7528
            ],
            [
                7531,
                7533
            ],
            [
                7583,
                7610
            ],
            [
                7611,
                7631
            ],
            [
                7631,
                7668
            ],
            [
                7702,
                7718
            ],
            [
                7724,
                7760
            ],
            [
                7767,
                7819
            ],
            [
                7819,
                7842
            ],
            [
                7896,
                7897
            ],
            [
                7898,
                7941
            ],
            [
                8061,
                8064
            ],
            [
                7999,
                8031
            ],
            [
                8037,
                8058
            ],
            [
                8103,
                8146
            ],
            [
                8148,
                8254
            ],
            [
                8254,
                8343
            ],
            [
                8407,
                8413
            ],
            [
                8414,
                8418
            ],
            [
                8426,
                8440
            ],
            [
                8444,
                8450
            ],
            [
                8469,
                8482
            ],
            [
                8482,
                8512
            ],
            [
                8526,
                8559
            ],
            [
                8559,
                8595
            ],
            [
                8601,
                8604
            ],
            [
                8616,
                8652
            ],
            [
                8660,
                8667
            ],
            [
                8968,
                8984
            ],
            [
                8682,
                8685
            ],
            [
                8985,
                9004
            ],
            [
                8877,
                8884
            ],
            [
                9161,
                9163
            ],
            [
                9235,
                9290
            ],
            [
                9327,
                9328
            ],
            [
                9299,
                9316
            ],
            [
                9294,
                9297
            ],
            [
                9329,
                9345
            ],
            [
                9377,
                9383
            ],
            [
                9389,
                9404
            ],
            [
                9404,
                9431
            ],
            [
                9431,
                9518
            ],
            [
                9566,
                9568
            ],
            [
                9568,
                9580
            ],
            [
                9595,
                9637
            ],
            [
                9642,
                9662
            ],
            [
                9783,
                9787
            ],
            [
                9798,
                9807
            ],
            [
                9807,
                9822
            ],
            [
                9867,
                9869
            ],
            [
                9838,
                9844
            ],
            [
                9823,
                9826
            ],
            [
                9875,
                9882
            ],
            [
                9884,
                9920
            ],
            [
                10051,
                10069
            ],
            [
                10076,
                10084
            ],
            [
                10103,
                10179
            ],
            [
                10235,
                10244
            ],
            [
                10245,
                10249
            ],
            [
                10252,
                10255
            ],
            [
                10266,
                10272
            ],
            [
                10249,
                10250
            ],
            [
                10290,
                10293
            ],
            [
                10401,
                10423
            ],
            [
                10304,
                10307
            ],
            [
                10326,
                10332
            ],
            [
                10438,
                10440
            ],
            [
                10503,
                10519
            ],
            [
                10550,
                10567
            ],
            [
                10587,
                10607
            ],
            [
                10607,
                10627
            ],
            [
                10638,
                10672
            ],
            [
                10760,
                10792
            ],
            [
                10792,
                10799
            ],
            [
                10805,
                10809
            ],
            [
                10830,
                10846
            ],
            [
                10846,
                10868
            ],
            [
                10871,
                10907
            ],
            [
                10922,
                10933
            ],
            [
                10933,
                10945
            ],
            [
                10956,
                10999
            ],
            [
                11008,
                11019
            ],
            [
                11434,
                11483
            ],
            [
                11559,
                11582
            ],
            [
                11603,
                11629
            ],
            [
                11639,
                11657
            ],
            [
                11728,
                11752
            ],
            [
                11777,
                11779
            ],
            [
                11779,
                11814
            ],
            [
                11839,
                11848
            ],
            [
                11892,
                11923
            ],
            [
                11952,
                11954
            ],
            [
                11987,
                11992
            ],
            [
                11992,
                12015
            ],
            [
                12019,
                12029
            ],
            [
                12032,
                12034
            ],
            [
                12034,
                12053
            ],
            [
                12064,
                12083
            ],
            [
                12083,
                12121
            ],
            [
                12123,
                12166
            ],
            [
                12166,
                12168
            ],
            [
                12168,
                12237
            ],
            [
                12237,
                12266
            ],
            [
                12266,
                12288
            ],
            [
                12288,
                12294
            ],
            [
                12294,
                12391
            ],
            [
                12391,
                12468
            ],
            [
                12468,
                12480
            ],
            [
                12485,
                12493
            ],
            [
                12554,
                12580
            ],
            [
                12645,
                12647
            ],
            [
                12655,
                12657
            ],
            [
                12657,
                12664
            ],
            [
                12691,
                12697
            ],
            [
                12708,
                12710
            ],
            [
                12741,
                12747
            ],
            [
                12711,
                12714
            ],
            [
                12777,
                12779
            ],
            [
                13297,
                13298
            ],
            [
                13289,
                13297
            ],
            [
                13308,
                13324
            ],
            [
                13424,
                13446
            ],
            [
                13455,
                13462
            ],
            [
                13419,
                13420
            ],
            [
                13468,
                13516
            ],
            [
                13516,
                13525
            ],
            [
                13529,
                13532
            ],
            [
                13533,
                13538
            ],
            [
                13552,
                13595
            ],
            [
                13660,
                13663
            ],
            [
                13539,
                13545
            ],
            [
                13709,
                13716
            ],
            [
                13546,
                13551
            ],
            [
                13840,
                13842
            ],
            [
                14370,
                14383
            ],
            [
                14416,
                14431
            ],
            [
                14384,
                14386
            ],
            [
                14444,
                14450
            ],
            [
                14459,
                14492
            ],
            [
                14505,
                14513
            ],
            [
                14541,
                14543
            ],
            [
                14543,
                14564
            ],
            [
                14580,
                14582
            ],
            [
                14605,
                14609
            ],
            [
                14590,
                14599
            ],
            [
                14614,
                14623
            ],
            [
                14663,
                14666
            ],
            [
                14707,
                14709
            ],
            [
                14721,
                14738
            ],
            [
                14827,
                14843
            ],
            [
                14851,
                14886
            ],
            [
                14895,
                14897
            ],
            [
                14964,
                15010
            ],
            [
                15020,
                15032
            ],
            [
                15050,
                15051
            ],
            [
                15033,
                15050
            ],
            [
                15116,
                15150
            ],
            [
                15150,
                15181
            ],
            [
                15191,
                15195
            ],
            [
                15182,
                15190
            ],
            [
                15210,
                15212
            ],
            [
                15229,
                15232
            ],
            [
                15234,
                15262
            ],
            [
                15279,
                15281
            ],
            [
                15684,
                15699
            ],
            [
                15709,
                15720
            ],
            [
                15680,
                15683
            ],
            [
                15816,
                15818
            ],
            [
                15721,
                15787
            ],
            [
                15789,
                15809
            ],
            [
                15832,
                15853
            ],
            [
                15862,
                15876
            ],
            [
                15876,
                15911
            ],
            [
                15922,
                15932
            ],
            [
                15941,
                15987
            ],
            [
                15988,
                16029
            ],
            [
                16032,
                16046
            ],
            [
                16046,
                16080
            ],
            [
                16093,
                16103
            ],
            [
                16248,
                16255
            ],
            [
                16213,
                16216
            ],
            [
                16168,
                16169
            ],
            [
                16372,
                16420
            ],
            [
                16444,
                16478
            ],
            [
                16428,
                16431
            ],
            [
                16498,
                16510
            ],
            [
                16510,
                16516
            ],
            [
                16528,
                16530
            ],
            [
                16546,
                16557
            ],
            [
                16531,
                16545
            ],
            [
                16569,
                16571
            ],
            [
                16571,
                16599
            ],
            [
                16606,
                16638
            ],
            [
                16667,
                16676
            ],
            [
                16689,
                16723
            ],
            [
                16723,
                16750
            ],
            [
                16772,
                16790
            ],
            [
                16805,
                16813
            ],
            [
                16823,
                16894
            ],
            [
                16991,
                16993
            ],
            [
                16993,
                17080
            ],
            [
                17080,
                17191
            ],
            [
                17281,
                17314
            ],
            [
                17316,
                17337
            ],
            [
                17449,
                17454
            ],
            [
                17550,
                17553
            ],
            [
                17554,
                17557
            ],
            [
                17498,
                17499
            ],
            [
                17654,
                17708
            ],
            [
                17720,
                17757
            ],
            [
                17866,
                17867
            ],
            [
                17716,
                17719
            ],
            [
                18315,
                18347
            ],
            [
                18157,
                18159
            ],
            [
                17926,
                17929
            ],
            [
                18276,
                18279
            ],
            [
                18212,
                18214
            ],
            [
                18347,
                18349
            ],
            [
                18392,
                18426
            ],
            [
                18485,
                18503
            ],
            [
                18526,
                18531
            ],
            [
                18533,
                18576
            ],
            [
                18654,
                18675
            ],
            [
                18675,
                18692
            ],
            [
                18712,
                18787
            ],
            [
                18859,
                18861
            ],
            [
                18874,
                18936
            ],
            [
                19000,
                19038
            ],
            [
                19038,
                19133
            ],
            [
                19274,
                19280
            ],
            [
                19295,
                19311
            ],
            [
                19312,
                19349
            ],
            [
                19355,
                19358
            ],
            [
                19380,
                19382
            ],
            [
                19382,
                19395
            ],
            [
                19403,
                19405
            ],
            [
                19462,
                19563
            ],
            [
                19690,
                19718
            ],
            [
                19723,
                19725
            ],
            [
                19725,
                19786
            ],
            [
                19786,
                19886
            ],
            [
                19886,
                19958
            ],
            [
                19973,
                19999
            ],
            [
                19999,
                20065
            ],
            [
                20146,
                20149
            ],
            [
                20224,
                20231
            ],
            [
                20237,
                20271
            ],
            [
                20271,
                20298
            ],
            [
                20298,
                20357
            ],
            [
                20359,
                20375
            ],
            [
                20386,
                20416
            ],
            [
                20416,
                20427
            ],
            [
                20427,
                20444
            ],
            [
                20599,
                20629
            ],
            [
                20744,
                20775
            ],
            [
                20775,
                20788
            ],
            [
                20788,
                20803
            ],
            [
                20803,
                20810
            ],
            [
                20817,
                20851
            ],
            [
                20852,
                20899
            ],
            [
                20899,
                20910
            ],
            [
                20934,
                20940
            ],
            [
                20940,
                20943
            ],
            [
                20962,
                20972
            ],
            [
                20979,
                20986
            ],
            [
                20988,
                21021
            ],
            [
                21024,
                21050
            ],
            [
                21050,
                21058
            ],
            [
                21089,
                21119
            ],
            [
                21119,
                21143
            ],
            [
                21155,
                21162
            ],
            [
                21162,
                21214
            ],
            [
                21241,
                21300
            ],
            [
                21336,
                21356
            ],
            [
                21422,
                21465
            ],
            [
                21465,
                21498
            ],
            [
                21508,
                21589
            ],
            [
                21589,
                21645
            ],
            [
                21699,
                21746
            ],
            [
                21747,
                21776
            ],
            [
                21776,
                21862
            ],
            [
                21862,
                21894
            ],
            [
                21934,
                21936
            ],
            [
                21936,
                21970
            ],
            [
                21992,
                21994
            ],
            [
                21994,
                21997
            ],
            [
                21998,
                22003
            ],
            [
                22014,
                22054
            ],
            [
                22054,
                22075
            ],
            [
                22077,
                22128
            ],
            [
                22128,
                22150
            ],
            [
                22152,
                22159
            ],
            [
                22185,
                22191
            ],
            [
                22150,
                22151
            ],
            [
                22197,
                22229
            ],
            [
                22230,
                22236
            ],
            [
                22259,
                22286
            ],
            [
                22296,
                22300
            ],
            [
                22305,
                22319
            ],
            [
                22319,
                22322
            ],
            [
                22345,
                22352
            ],
            [
                22373,
                22387
            ],
            [
                22401,
                22402
            ],
            [
                22403,
                22461
            ],
            [
                22461,
                22544
            ],
            [
                22545,
                22584
            ],
            [
                22584,
                22602
            ],
            [
                22602,
                22644
            ],
            [
                22644,
                22651
            ],
            [
                22696,
                22740
            ],
            [
                22743,
                22761
            ],
            [
                22761,
                22793
            ],
            [
                22816,
                22821
            ],
            [
                22825,
                22845
            ],
            [
                22845,
                22887
            ],
            [
                22896,
                22898
            ],
            [
                22898,
                23005
            ],
            [
                23018,
                23020
            ],
            [
                23020,
                23046
            ],
            [
                23049,
                23064
            ],
            [
                23064,
                23152
            ]
        ],
        "row_chars": [
            [
                0,
                106
            ],
            [
                106,
                122
            ],
            [
                122,
                291
            ],
            [
                291,
                403
            ],
            [
                403,
                442
            ],
            [
                442,
                520
            ],
            [
                520,
                599
            ],
            [
                599,
                723
            ],
            [
                723,
                776
            ],
            [
                776,
                819
            ],
            [
                819,
                1051
            ],
            [
                1051,
                1093
            ],
            [
                1093,
                1207
            ],
            [
                1207,
                1344
            ],
            [
                1344,
                1432
            ],
            [
                1432,
                1535
            ],
            [
                1535,
                1636
            ],
            [
                1636,
                1696
            ],
            [
                1696,
                1747
            ],
            [
                1747,
                1863
            ],
            [
                1863,
                1945
            ],
            [
                1945,
                1996
            ],
            [
                1996,
                2212
            ],
            [
                2212,
                2349
            ],
            [
                2349,
                2550
            ],
            [
                2550,
                2725
            ],
            [
                2725,
                2760
            ],
            [
                2760,
                2895
            ],
            [
                2895,
                3005
            ],
            [
                3005,
                3175
            ],
            [
                3175,
                3257
            ],
            [
                3257,
                3383
            ],
            [
                3383,
                3455
            ],
            [
                3455,
                3554
            ],
            [
                3554,
                3632
            ],
            [
                3632,
                3932
            ],
            [
                3932,
                4155
            ],
            [
                4155,
                4208
            ],
            [
                4208,
                4269
            ],
            [
                4269,
                4403
            ],
            [
                4403,
                4493
            ],
            [
                4493,
                4529
            ],
            [
                4529,
                4557
            ],
            [
                4557,
                4629
            ],
            [
                4629,
                4723
            ],
            [
                4723,
                4935
            ],
            [
                4935,
                5077
            ],
            [
                5077,
                5233
            ],
            [
                5233,
                5328
            ],
            [
                5328,
                5399
            ],
            [
                5399,
                5477
            ],
            [
                5477,
                5577
            ],
            [
                5577,
                5734
            ],
            [
                5734,
                5894
            ],
            [
                5894,
                6026
            ],
            [
                6026,
                6115
            ],
            [
                6115,
                6140
            ],
            [
                6140,
                6157
            ],
            [
                6157,
                6296
            ],
            [
                6296,
                6452
            ],
            [
                6452,
                6483
            ],
            [
                6483,
                6725
            ],
            [
                6725,
                6798
            ],
            [
                6798,
                6912
            ],
            [
                6912,
                7008
            ],
            [
                7008,
                7077
            ],
            [
                7077,
                7247
            ],
            [
                7247,
                7365
            ],
            [
                7365,
                7509
            ],
            [
                7509,
                7631
            ],
            [
                7631,
                7819
            ],
            [
                7819,
                7898
            ],
            [
                7898,
                8148
            ],
            [
                8148,
                8254
            ],
            [
                8254,
                8343
            ],
            [
                8343,
                8482
            ],
            [
                8482,
                8559
            ],
            [
                8559,
                9163
            ],
            [
                9163,
                9235
            ],
            [
                9235,
                9404
            ],
            [
                9404,
                9431
            ],
            [
                9431,
                9568
            ],
            [
                9568,
                9637
            ],
            [
                9637,
                9807
            ],
            [
                9807,
                9920
            ],
            [
                9920,
                10046
            ],
            [
                10046,
                10179
            ],
            [
                10179,
                10235
            ],
            [
                10235,
                10440
            ],
            [
                10440,
                10607
            ],
            [
                10607,
                10672
            ],
            [
                10672,
                10792
            ],
            [
                10792,
                10846
            ],
            [
                10846,
                10933
            ],
            [
                10933,
                11019
            ],
            [
                11019,
                11089
            ],
            [
                11089,
                11300
            ],
            [
                11300,
                11434
            ],
            [
                11434,
                11483
            ],
            [
                11483,
                11559
            ],
            [
                11559,
                11779
            ],
            [
                11779,
                11992
            ],
            [
                11992,
                12019
            ],
            [
                12019,
                12034
            ],
            [
                12034,
                12083
            ],
            [
                12083,
                12168
            ],
            [
                12168,
                12237
            ],
            [
                12237,
                12266
            ],
            [
                12266,
                12288
            ],
            [
                12288,
                12294
            ],
            [
                12294,
                12391
            ],
            [
                12391,
                12468
            ],
            [
                12468,
                12657
            ],
            [
                12657,
                12779
            ],
            [
                12779,
                12861
            ],
            [
                12861,
                12946
            ],
            [
                12946,
                13081
            ],
            [
                13081,
                13187
            ],
            [
                13187,
                13289
            ],
            [
                13289,
                13516
            ],
            [
                13516,
                13842
            ],
            [
                13842,
                13871
            ],
            [
                13871,
                14064
            ],
            [
                14064,
                14118
            ],
            [
                14118,
                14361
            ],
            [
                14361,
                14543
            ],
            [
                14543,
                14738
            ],
            [
                14738,
                14784
            ],
            [
                14784,
                14897
            ],
            [
                14897,
                14964
            ],
            [
                14964,
                15150
            ],
            [
                15150,
                15212
            ],
            [
                15212,
                15281
            ],
            [
                15281,
                15569
            ],
            [
                15569,
                15680
            ],
            [
                15680,
                15876
            ],
            [
                15876,
                15988
            ],
            [
                15988,
                16046
            ],
            [
                16046,
                16266
            ],
            [
                16266,
                16372
            ],
            [
                16372,
                16510
            ],
            [
                16510,
                16571
            ],
            [
                16571,
                16723
            ],
            [
                16723,
                16993
            ],
            [
                16993,
                17080
            ],
            [
                17080,
                17191
            ],
            [
                17191,
                17281
            ],
            [
                17281,
                17654
            ],
            [
                17654,
                18349
            ],
            [
                18349,
                18675
            ],
            [
                18675,
                18861
            ],
            [
                18861,
                19038
            ],
            [
                19038,
                19312
            ],
            [
                19312,
                19382
            ],
            [
                19382,
                19405
            ],
            [
                19405,
                19462
            ],
            [
                19462,
                19563
            ],
            [
                19563,
                19690
            ],
            [
                19690,
                19725
            ],
            [
                19725,
                19786
            ],
            [
                19786,
                19886
            ],
            [
                19886,
                19999
            ],
            [
                19999,
                20065
            ],
            [
                20065,
                20146
            ],
            [
                20146,
                20271
            ],
            [
                20271,
                20298
            ],
            [
                20298,
                20416
            ],
            [
                20416,
                20427
            ],
            [
                20427,
                20444
            ],
            [
                20444,
                20500
            ],
            [
                20500,
                20540
            ],
            [
                20540,
                20599
            ],
            [
                20599,
                20629
            ],
            [
                20629,
                20667
            ],
            [
                20667,
                20744
            ],
            [
                20744,
                20775
            ],
            [
                20775,
                20788
            ],
            [
                20788,
                20803
            ],
            [
                20803,
                20852
            ],
            [
                20852,
                20899
            ],
            [
                20899,
                20940
            ],
            [
                20940,
                21050
            ],
            [
                21050,
                21119
            ],
            [
                21119,
                21162
            ],
            [
                21162,
                21300
            ],
            [
                21300,
                21336
            ],
            [
                21336,
                21465
            ],
            [
                21465,
                21589
            ],
            [
                21589,
                21645
            ],
            [
                21645,
                21747
            ],
            [
                21747,
                21776
            ],
            [
                21776,
                21862
            ],
            [
                21862,
                21936
            ],
            [
                21936,
                21994
            ],
            [
                21994,
                22054
            ],
            [
                22054,
                22128
            ],
            [
                22128,
                22319
            ],
            [
                22319,
                22403
            ],
            [
                22403,
                22461
            ],
            [
                22461,
                22545
            ],
            [
                22545,
                22584
            ],
            [
                22584,
                22602
            ],
            [
                22602,
                22644
            ],
            [
                22644,
                22761
            ],
            [
                22761,
                22845
            ],
            [
                22845,
                22898
            ],
            [
                22898,
                23020
            ],
            [
                23020,
                23064
            ],
            [
                23064,
                23152
            ]
        ]
    },
    "abridged": {
        "text": "On the next day, Paul Montague received this letter from Mrs. Hurtle:\nMy dear Paul,\nI think that perhaps we hardly understood each other yesterday, and I am sure that you do not understand how absolutely my whole life is now at stake. I need only refer you to our journey from San Francisco to London to make you conscious that I really love you. To a woman such love is all important. She cannot throw it from her as a man may. Nor can she bear the loss as a man bears it. Her thoughts have dwelt on it with more constancy than his; and her devotion has separated her from other things. My devotion to you has separated me from everything.\nIf you say that you will discard me because you have seen some one fairer, I shall not throw myself at your feet. I wish, however, that you should hear me. You say that there is someone you love better than me, but that you have not committed yourself to her. But I think that you must remember the past now that you have seen me again. I think that you must know that you did love me, and that you could love me again. You sin against me to my utter destruction if you leave me. I have given up every friend I have to follow you. As regards the other lady, there can be no fault; for she knows nothing of your passion.\nYou hinted that there were other reasons - that we know too little of each other. You meant that you knew too little of me. Yet have you not merely been made discontented by stories told you at San Francisco? Find out the truth before you treat me the way you propose to. I think you are too good a man to cast aside a woman like a soiled glove, because ill-natured words have been spoken of her by people who know nothing of her life.\nMy late husband, Caradoc Hurtle, was Attorney-General in Kansas when I married him, bringing to him a fortune left to me by my mother. There his life was infamously bad. He spent my money, and then left me and took himself to Texas - where he drank himself to death. I did not follow him, and in his absence I was divorced from him in accordance with the laws of Kansas State. I then went to San Francisco about property of my mother's, which my husband had fraudulently sold, having forged my name. There I met you, and that is all that there is to be told. Maybe you do not believe me; but if so, are you not bound to go where you can verify your doubts?\nI try to write dispassionately, but I am in truth overcome by passion. I also have heard in California rumours about myself. When I received your letter, I resolved to follow you to England as soon as I could. I have been forced to fight a battle for my property, and I have won it; for I was determined that I would not plead to you as a pauper. When a man and woman have agreed to be husband and wife there should be no delicacy in talking about money. I have made my way through my difficulties, and from what I have heard at San Francisco, I suppose you have done the same.\nAnd now about myself. I have come here all alone. Since I last saw you in New York I have not had a good time. I have had a great struggle and have been thrown on my own resources. Very cruel things have been said of me - some of them with reference to you. I have no friends here ready to receive me. I needed to see you and hear my fate - and I appeal to you to release me from the misery of my solitude. You know that I am not usually melancholy. Let us be cheerful together, as we once were, if only for a day.\nCome and take me out, and let us dine together, and go to one of your theatres. If you wish I will promise not to allude to that revelation you made to me. Perhaps a woman's vanity makes me think that if you would only see me again, and talk to me as you used to talk, you would think of me as you used to think.\nYou will find me at home, for I have nowhere else to go. Send me a line.\nYours with all my heart,\nWinifred Hurtle.\nThis letter took her much time to write, though she was very careful to make it seem that it had flown easily from her pen. She copied it rapidly from the first draft, with one or two premeditated erasures, so that it should look to have been done hurriedly. She had suppressed her anger - and yet she was as angry as a lioness who had lost her cub. Invited as she had invited him, surely he must come to her!\nAs she read it over she thought that it had a tone of natural feminine eagerness. She put her letter in an envelope, addressed it, and then threw herself back in her chair to think.\nHe should marry her - or the name of Winifrid Hurtle would become known to the world! She had no plan of revenge yet formed - she told herself she would not even think of revenge, till she was quite sure that revenge would be necessary. But she did think of it all the time.\nCould it be possible that she, with all her cleverness and good looks, should be thrown over by a man who - well as she loved him - she regarded as greatly inferior to herself? He had promised to marry her; and he should marry her, or the world should hear the story of his perjury!\nPaul Montague felt that he was surrounded by difficulties as soon as he read the letter. It did not seem that there was any escape open to him. There was not a single word in the letter that he could contradict. He had loved her and had promised to marry her - and had determined to break his word because, as Roger said, she was an adventuress, about whom he knew almost nothing. \"Any scrape is better than that scrape,\" Roger had said, and Paul had believed him; and had believed doubly once he had met Hetta Carbury.\nBut what should he do now? It was impossible, after what had passed between them, that he should leave Mrs. Hurtle immediately. It was clear that she would not consent to be so left. Her present proposal held some comfort. To take her out to dinner and the theatre would be easy and perhaps pleasant. He remembered some delightful evenings which he had so passed with her, when they were first together at New York. She could both talk and listen, and he had been very happy to sit next to her. The reminiscence partly reconciled him to doing this perilous duty.\nBut when the evening was over, how would he part with her? What should he say to her then? He must arrange some future meeting. He knew that he was in great peril, and he did not know how to escape it. He could not ask Roger Carbury for advice; for was not Roger his rival? He had no other friend in whom he could confide. He thought for a moment of writing a stern and true letter to Mrs. Hurtle, telling her that he felt himself bound to stay away. But then he remembered her solitude in London, and he convinced himself that he ought to see her. So he wrote to her thus:\nDear Winifred,\nI will come for you tomorrow at half-past five. We will dine together at the Thespian; and then I will have a box at the Haymarket Theatre. The Thespian is a good sort of place, and lots of ladies dine there. You can dine in your bonnet.\nYours affectionately,\nP. M.\nSome half-formed idea ran through his brain that P. M. was a safer signature than Paul Montague. Then came a long train of thoughts as to the perils of the whole proceeding. She had told her landlady that she was engaged to him, and he had not contradicted it. And now he was agreeing to go out with her. However, the note was sent, and he ordered the dinner and the box. At the hour fixed he was again at her lodgings.\nThe woman who owned the lodging-house showed him into Mrs. Hurtle's sitting-room, welcoming him with a congratulatory smile. Paul Montague felt no satisfaction at this - only a sense of danger which every hour became stronger. He was almost tempted to tell the woman the truth; but he could not do it.\nMrs. Hurtle came out of her bedroom, with her hat on. It was now June, and the weather was warm, and she wore a light, gauzy black dress coming close up round her throat. It was very pretty, and she was even prettier. Her hat was black also, small and simple. There are times at which a man going to a theatre with a lady wishes her to look bright and gorgeous; but there are also times when he would prefer that his companion should be very quiet in her dress, but still pretty; in other words, that she should dress for him only. All this Mrs. Hurtle had understood; and Paul, who understood nothing of it, was gratified.\n\"You told me to have a hat, and here I am - hat and all.\" She gave him her hand, and laughed pleasantly as they entered a cab.\nNeither during the drive, nor at the dinner, nor at the theatre, did she say a word about the engagement. It was as it had been in former days. She whispered pleasant words, touching his arm now and again, seeming more inclined to listen than to speak. Now and again she referred, in the lightest fashion, to little things that had happened between them, to some joke, some hour of tedium, some moment of delight. There was a scent which he had once approved, and now she bore it on her handkerchief. There was a ring which he had once given her, and she wore it on the finger with which she touched his sleeve. She had a way of shaking her head that was very pretty, which she did now.\nThere are a thousand little silly softnesses which are endearing between acknowledged lovers; and Mrs. Hurtle was a perfect master of the art of these. Not an unpleasant word was spoken; Paul was flattered; and though the sword was hanging over his head, still he enjoyed it.\nThere are men who do not like women, even though they may have wives and legions of daughters. But others have their strongest affinities and sympathies with women, and Paul Montague was of the latter sort. At this time he was thoroughly in love with Hetta Carbury, and was not in love with Mrs. Hurtle; yet he delighted in her presence.\n\"The acting isn't very good,\" he said towards the end of the play.\n\"What does it matter? The acting is not first-rate, but I have listened and laughed and cried, because I have been happy.\"\n\"It has been very jolly,\" he admitted.\n\"And one has so little that is really jolly, as you call it. I wonder whether any girl ever did sit and cry like that because her lover talked to another woman. What I find fault with is that the writers and actors are so ignorant of people as we see them every day. It's all right that she should cry, but she shouldn't cry there.\" She spoke knowing that her words would confuse him. \"A woman hides such tears. She may be found crying because she is unable to hide them; but she does not let the other woman see them. Does she?\"\n\"I suppose not.\"\n\"I am quite ready if you like. Are you going to see me home?\"\n\"Certainly.\"\n\"You need not. I'm not afraid of a London cab by myself.\"\nBut of course he accompanied her to Islington. He owed her that. She talked during the journey of what a wonderful place London was - so immense, but so dirty! New York was, she thought, pleasanter. But Paris was the gem of towns. She did not like Frenchmen, and she liked Englishmen; but she fancied that she could never like English women. \"I like good conduct, but I hate what your women call propriety. I suppose what we have been doing tonight is very improper; but I am quite sure that it has not been in the least wicked.\"\n\"I don't think it has,\" said Paul Montague very tamely.\nAt last the cab reached the lodging-house door.\n\"Yes, this is it,\" she said. \"Even about the houses there is an air of stiff-necked propriety which frightens me.\" She was getting out as she spoke. \"Come in for one moment,\" she said. The lodging-house woman was standing with the door in her hand. It was near midnight, but, when people are engaged, hours do not matter. The woman of the house - who was a nice, respectable widow, with five children, named Mrs. Pipkin - smiled again as he followed Mrs. Hurtle into her sitting-room. She flung her hat on to the sofa.\n\"Shut the door for one moment,\" she said; and he shut it. Then she threw herself into his arms, not kissing him but looking up into his face.\n\"Oh Paul,\" she exclaimed, \"my darling! Oh Paul, my love! I will not bear to be separated from you. No, no; there is nothing I cannot do for love of you - but to lose you.\" Then she pushed him from her and clasped her hands together. \"But Paul, I mean to keep my pledge to you tonight. It was to be an island in our troubles, a little holiday in our hard school-time, and I will not destroy it. You will see me again soon - will you not?\" He nodded assent, then took her in his arms and kissed her, and left her without a word.",
        "paragraph_chars": [
            [
                0,
                70
            ],
            [
                70,
                84
            ],
            [
                84,
                641
            ],
            [
                641,
                1261
            ],
            [
                1261,
                1697
            ],
            [
                1697,
                2354
            ],
            [
                2354,
                2932
            ],
            [
                2932,
                3447
            ],
            [
                3447,
                3760
            ],
            [
                3760,
                3833
            ],
            [
                3833,
                3858
            ],
            [
                3858,
                3875
            ],
            [
                3875,
                4285
            ],
            [
                4285,
                4467
            ],
            [
                4467,
                4742
            ],
            [
                4742,
                5025
            ],
            [
                5025,
                5545
            ],
            [
                5545,
                6108
            ],
            [
                6108,
                6682
            ],
            [
                6682,
                6697
            ],
            [
                6697,
                6935
            ],
            [
                6935,
                6957
            ],
            [
                6957,
                6963
            ],
            [
                6963,
                7383
            ],
            [
                7383,
                7685
            ],
            [
                7685,
                8309
            ],
            [
                8309,
                8436
            ],
            [
                8436,
                9123
            ],
            [
                9123,
                9399
            ],
            [
                9399,
                9737
            ],
            [
                9737,
                9804
            ],
            [
                9804,
                9927
            ],
            [
                9927,
                9966
            ],
            [
                9966,
                10496
            ],
            [
                10496,
                10513
            ],
            [
                10513,
                10575
            ],
            [
                10575,
                10588
            ],
            [
                10588,
                10646
            ],
            [
                10646,
                11176
            ],
            [
                11176,
                11232
            ],
            [
                11232,
                11280
            ],
            [
                11280,
                11799
            ],
            [
                11799,
                11941
            ],
            [
                11941,
                12467
            ]
        ],
        "segment_chars": [
            [
                0,
                70
            ],
            [
                70,
                84
            ],
            [
                84,
                235
            ],
            [
                235,
                347
            ],
            [
                347,
                386
            ],
            [
                386,
                429
            ],
            [
                429,
                474
            ],
            [
                474,
                588
            ],
            [
                588,
                641
            ],
            [
                641,
                755
            ],
            [
                755,
                797
            ],
            [
                797,
                901
            ],
            [
                901,
                978
            ],
            [
                978,
                1061
            ],
            [
                1061,
                1121
            ],
            [
                1121,
                1172
            ],
            [
                1172,
                1261
            ],
            [
                1261,
                1343
            ],
            [
                1343,
                1385
            ],
            [
                1385,
                1470
            ],
            [
                1470,
                1533
            ],
            [
                1533,
                1697
            ],
            [
                1697,
                1832
            ],
            [
                1832,
                1867
            ],
            [
                1867,
                1964
            ],
            [
                1964,
                2074
            ],
            [
                2074,
                2197
            ],
            [
                2197,
                2256
            ],
            [
                2256,
                2354
            ],
            [
                2354,
                2425
            ],
            [
                2425,
                2479
            ],
            [
                2479,
                2564
            ],
            [
                2564,
                2701
            ],
            [
                2701,
                2809
            ],
            [
                2809,
                2932
            ],
            [
                2932,
                2954
            ],
            [
                2954,
                2982
            ],
            [
                2982,
                3043
            ],
            [
                3043,
                3113
            ],
            [
                3113,
                3190
            ],
            [
                3190,
                3234
            ],
            [
                3234,
                3339
            ],
            [
                3339,
                3382
            ],
            [
                3382,
                3447
            ],
            [
                3447,
                3527
            ],
            [
                3527,
                3603
            ],
            [
                3603,
                3760
            ],
            [
                3760,
                3817
            ],
            [
                3817,
                3833
            ],
            [
                3833,
                3858
            ],
            [
                3858,
                3875
            ],
            [
                3875,
                3999
            ],
            [
                3999,
                4134
            ],
            [
                4134,
                4225
            ],
            [
                4225,
                4285
            ],
            [
                4285,
                4367
            ],
            [
                4367,
                4467
            ],
            [
                4467,
                4553
            ],
            [
                4553,
                4704
            ],
            [
                4704,
                4742
            ],
            [
                4742,
                4919
            ],
            [
                4919,
                5025
            ],
            [
                5025,
                5114
            ],
            [
                5114,
                5169
            ],
            [
                5169,
                5237
            ],
            [
                5237,
                5406
            ],
            [
                5406,
                5545
            ],
            [
                5545,
                5572
            ],
            [
                5572,
                5673
            ],
            [
                5673,
                5728
            ],
            [
                5728,
                5768
            ],
            [
                5768,
                5846
            ],
            [
                5846,
                5961
            ],
            [
                5961,
                6040
            ],
            [
                6040,
                6108
            ],
            [
                6108,
                6167
            ],
            [
                6167,
                6199
            ],
            [
                6199,
                6236
            ],
            [
                6236,
                6310
            ],
            [
                6310,
                6382
            ],
            [
                6382,
                6431
            ],
            [
                6431,
                6559
            ],
            [
                6559,
                6657
            ],
            [
                6657,
                6682
            ],
            [
                6682,
                6697
            ],
            [
                6697,
                6745
            ],
            [
                6745,
                6837
            ],
            [
                6837,
                6906
            ],
            [
                6906,
                6935
            ],
            [
                6935,
                6957
            ],
            [
                6957,
                6963
            ],
            [
                6963,
                7060
            ],
            [
                7060,
                7137
            ],
            [
                7137,
                7224
            ],
            [
                7224,
                7268
            ],
            [
                7268,
                7335
            ],
            [
                7335,
                7383
            ],
            [
                7383,
                7508
            ],
            [
                7508,
                7610
            ],
            [
                7610,
                7685
            ],
            [
                7685,
                7739
            ],
            [
                7739,
                7856
            ],
            [
                7856,
                7903
            ],
            [
                7903,
                7945
            ],
            [
                7945,
                8217
            ],
            [
                8217,
                8309
            ],
            [
                8309,
                8367
            ],
            [
                8367,
                8436
            ],
            [
                8436,
                8542
            ],
            [
                8542,
                8580
            ],
            [
                8580,
                8689
            ],
            [
                8689,
                8850
            ],
            [
                8850,
                8937
            ],
            [
                8937,
                9048
            ],
            [
                9048,
                9123
            ],
            [
                9123,
                9275
            ],
            [
                9275,
                9399
            ],
            [
                9399,
                9494
            ],
            [
                9494,
                9606
            ],
            [
                9606,
                9737
            ],
            [
                9737,
                9804
            ],
            [
                9804,
                9826
            ],
            [
                9826,
                9927
            ],
            [
                9927,
                9966
            ],
            [
                9966,
                10027
            ],
            [
                10027,
                10127
            ],
            [
                10127,
                10233
            ],
            [
                10233,
                10299
            ],
            [
                10299,
                10351
            ],
            [
                10351,
                10378
            ],
            [
                10378,
                10485
            ],
            [
                10485,
                10496
            ],
            [
                10496,
                10513
            ],
            [
                10513,
                10544
            ],
            [
                10544,
                10575
            ],
            [
                10575,
                10588
            ],
            [
                10588,
                10603
            ],
            [
                10603,
                10646
            ],
            [
                10646,
                10693
            ],
            [
                10693,
                10711
            ],
            [
                10711,
                10806
            ],
            [
                10806,
                10845
            ],
            [
                10845,
                10877
            ],
            [
                10877,
                10988
            ],
            [
                10988,
                11053
            ],
            [
                11053,
                11176
            ],
            [
                11176,
                11232
            ],
            [
                11232,
                11280
            ],
            [
                11280,
                11309
            ],
            [
                11309,
                11395
            ],
            [
                11395,
                11429
            ],
            [
                11429,
                11465
            ],
            [
                11465,
                11529
            ],
            [
                11529,
                11602
            ],
            [
                11602,
                11765
            ],
            [
                11765,
                11799
            ],
            [
                11799,
                11857
            ],
            [
                11857,
                11941
            ],
            [
                11941,
                11980
            ],
            [
                11980,
                11998
            ],
            [
                11998,
                12040
            ],
            [
                12040,
                12113
            ],
            [
                12113,
                12174
            ],
            [
                12174,
                12226
            ],
            [
                12226,
                12335
            ],
            [
                12335,
                12379
            ],
            [
                12379,
                12467
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                12,
                15
            ],
            [
                15,
                39
            ],
            [
                45,
                69
            ],
            [
                70,
                83
            ],
            [
                84,
                114
            ],
            [
                115,
                125
            ],
            [
                126,
                235
            ],
            [
                235,
                347
            ],
            [
                347,
                386
            ],
            [
                386,
                427
            ],
            [
                427,
                429
            ],
            [
                429,
                432
            ],
            [
                433,
                474
            ],
            [
                474,
                533
            ],
            [
                534,
                537
            ],
            [
                538,
                588
            ],
            [
                588,
                641
            ],
            [
                641,
                647
            ],
            [
                648,
                651
            ],
            [
                652,
                665
            ],
            [
                674,
                676
            ],
            [
                677,
                714
            ],
            [
                714,
                753
            ],
            [
                753,
                755
            ],
            [
                755,
                797
            ],
            [
                797,
                818
            ],
            [
                827,
                847
            ],
            [
                848,
                901
            ],
            [
                901,
                917
            ],
            [
                918,
                921
            ],
            [
                922,
                926
            ],
            [
                936,
                944
            ],
            [
                945,
                978
            ],
            [
                978,
                999
            ],
            [
                1005,
                1061
            ],
            [
                1061,
                1121
            ],
            [
                1121,
                1172
            ],
            [
                1172,
                1192
            ],
            [
                1193,
                1225
            ],
            [
                1226,
                1261
            ],
            [
                1261,
                1301
            ],
            [
                1304,
                1343
            ],
            [
                1343,
                1352
            ],
            [
                1353,
                1385
            ],
            [
                1389,
                1393
            ],
            [
                1394,
                1397
            ],
            [
                1398,
                1401
            ],
            [
                1409,
                1451
            ],
            [
                1452,
                1470
            ],
            [
                1470,
                1499
            ],
            [
                1500,
                1508
            ],
            [
                1517,
                1531
            ],
            [
                1531,
                1533
            ],
            [
                1533,
                1585
            ],
            [
                1586,
                1606
            ],
            [
                1607,
                1659
            ],
            [
                1667,
                1696
            ],
            [
                1697,
                1753
            ],
            [
                1754,
                1780
            ],
            [
                1797,
                1798
            ],
            [
                1799,
                1832
            ],
            [
                1832,
                1867
            ],
            [
                1867,
                1875
            ],
            [
                1879,
                1884
            ],
            [
                1884,
                1906
            ],
            [
                1907,
                1928
            ],
            [
                1931,
                1964
            ],
            [
                1964,
                2074
            ],
            [
                2074,
                2172
            ],
            [
                2172,
                2173
            ],
            [
                2174,
                2197
            ],
            [
                2197,
                2217
            ],
            [
                2218,
                2222
            ],
            [
                2226,
                2256
            ],
            [
                2262,
                2283
            ],
            [
                2283,
                2345
            ],
            [
                2346,
                2352
            ],
            [
                2352,
                2354
            ],
            [
                2354,
                2403
            ],
            [
                2413,
                2425
            ],
            [
                2425,
                2477
            ],
            [
                2477,
                2479
            ],
            [
                2508,
                2554
            ],
            [
                2562,
                2564
            ],
            [
                2564,
                2600
            ],
            [
                2601,
                2604
            ],
            [
                2605,
                2635
            ],
            [
                2641,
                2646
            ],
            [
                2647,
                2701
            ],
            [
                2701,
                2784
            ],
            [
                2785,
                2787
            ],
            [
                2802,
                2807
            ],
            [
                2807,
                2809
            ],
            [
                2809,
                2851
            ],
            [
                2857,
                2896
            ],
            [
                2898,
                2907
            ],
            [
                2908,
                2931
            ],
            [
                2932,
                2952
            ],
            [
                2952,
                2954
            ],
            [
                2954,
                2982
            ],
            [
                2982,
                3029
            ],
            [
                3030,
                3043
            ],
            [
                3043,
                3111
            ],
            [
                3111,
                3113
            ],
            [
                3113,
                3151
            ],
            [
                3162,
                3166
            ],
            [
                3167,
                3190
            ],
            [
                3190,
                3196
            ],
            [
                3200,
                3207
            ],
            [
                3213,
                3234
            ],
            [
                3234,
                3235
            ],
            [
                3243,
                3245
            ],
            [
                3246,
                3270
            ],
            [
                3273,
                3276
            ],
            [
                3277,
                3306
            ],
            [
                3307,
                3339
            ],
            [
                3339,
                3347
            ],
            [
                3348,
                3361
            ],
            [
                3370,
                3382
            ],
            [
                3382,
                3430
            ],
            [
                3431,
                3446
            ],
            [
                3447,
                3451
            ],
            [
                3452,
                3467
            ],
            [
                3467,
                3498
            ],
            [
                3502,
                3527
            ],
            [
                3527,
                3538
            ],
            [
                3539,
                3553
            ],
            [
                3554,
                3601
            ],
            [
                3601,
                3603
            ],
            [
                3603,
                3610
            ],
            [
                3613,
                3760
            ],
            [
                3760,
                3784
            ],
            [
                3784,
                3785
            ],
            [
                3790,
                3796
            ],
            [
                3810,
                3815
            ],
            [
                3815,
                3817
            ],
            [
                3817,
                3831
            ],
            [
                3831,
                3833
            ],
            [
                3833,
                3858
            ],
            [
                3858,
                3863
            ],
            [
                3867,
                3875
            ],
            [
                3875,
                3943
            ],
            [
                3944,
                3999
            ],
            [
                3999,
                4020
            ],
            [
                4021,
                4035
            ],
            [
                4041,
                4134
            ],
            [
                4134,
                4141
            ],
            [
                4142,
                4152
            ],
            [
                4153,
                4156
            ],
            [
                4157,
                4162
            ],
            [
                4165,
                4180
            ],
            [
                4181,
                4183
            ],
            [
                4184,
                4225
            ],
            [
                4225,
                4266
            ],
            [
                4272,
                4284
            ],
            [
                4285,
                4304
            ],
            [
                4305,
                4321
            ],
            [
                4322,
                4324
            ],
            [
                4329,
                4335
            ],
            [
                4336,
                4355
            ],
            [
                4356,
                4367
            ],
            [
                4367,
                4385
            ],
            [
                4386,
                4401
            ],
            [
                4402,
                4415
            ],
            [
                4416,
                4465
            ],
            [
                4465,
                4467
            ],
            [
                4467,
                4486
            ],
            [
                4489,
                4491
            ],
            [
                4492,
                4519
            ],
            [
                4533,
                4553
            ],
            [
                4553,
                4590
            ],
            [
                4593,
                4609
            ],
            [
                4610,
                4646
            ],
            [
                4652,
                4704
            ],
            [
                4704,
                4727
            ],
            [
                4740,
                4741
            ],
            [
                4742,
                4785
            ],
            [
                4797,
                4800
            ],
            [
                4811,
                4843
            ],
            [
                4850,
                4871
            ],
            [
                4874,
                4917
            ],
            [
                4919,
                5025
            ],
            [
                5025,
                5114
            ],
            [
                5114,
                5120
            ],
            [
                5125,
                5129
            ],
            [
                5130,
                5144
            ],
            [
                5149,
                5155
            ],
            [
                5156,
                5169
            ],
            [
                5169,
                5199
            ],
            [
                5204,
                5237
            ],
            [
                5237,
                5273
            ],
            [
                5280,
                5283
            ],
            [
                5286,
                5322
            ],
            [
                5323,
                5330
            ],
            [
                5330,
                5346
            ],
            [
                5347,
                5350
            ],
            [
                5351,
                5370
            ],
            [
                5377,
                5384
            ],
            [
                5404,
                5406
            ],
            [
                5406,
                5461
            ],
            [
                5461,
                5462
            ],
            [
                5467,
                5484
            ],
            [
                5485,
                5488
            ],
            [
                5490,
                5506
            ],
            [
                5519,
                5525
            ],
            [
                5530,
                5545
            ],
            [
                5545,
                5572
            ],
            [
                5572,
                5659
            ],
            [
                5671,
                5673
            ],
            [
                5673,
                5685
            ],
            [
                5686,
                5728
            ],
            [
                5728,
                5748
            ],
            [
                5754,
                5758
            ],
            [
                5759,
                5768
            ],
            [
                5768,
                5783
            ],
            [
                5784,
                5786
            ],
            [
                5787,
                5793
            ],
            [
                5794,
                5797
            ],
            [
                5802,
                5809
            ],
            [
                5810,
                5846
            ],
            [
                5846,
                5864
            ],
            [
                5876,
                5884
            ],
            [
                5885,
                5961
            ],
            [
                5961,
                5970
            ],
            [
                5976,
                5980
            ],
            [
                5981,
                5984
            ],
            [
                5985,
                5991
            ],
            [
                5991,
                5992
            ],
            [
                5993,
                5996
            ],
            [
                5997,
                6019
            ],
            [
                6023,
                6026
            ],
            [
                6032,
                6038
            ],
            [
                6038,
                6040
            ],
            [
                6040,
                6056
            ],
            [
                6064,
                6081
            ],
            [
                6088,
                6108
            ],
            [
                6108,
                6128
            ],
            [
                6133,
                6167
            ],
            [
                6167,
                6199
            ],
            [
                6199,
                6206
            ],
            [
                6215,
                6219
            ],
            [
                6220,
                6236
            ],
            [
                6236,
                6258
            ],
            [
                6259,
                6295
            ],
            [
                6299,
                6310
            ],
            [
                6310,
                6322
            ],
            [
                6327,
                6370
            ],
            [
                6371,
                6382
            ],
            [
                6382,
                6431
            ],
            [
                6431,
                6454
            ],
            [
                6466,
                6492
            ],
            [
                6504,
                6522
            ],
            [
                6523,
                6547
            ],
            [
                6557,
                6559
            ],
            [
                6559,
                6594
            ],
            [
                6595,
                6604
            ],
            [
                6604,
                6635
            ],
            [
                6636,
                6638
            ],
            [
                6652,
                6657
            ],
            [
                6657,
                6680
            ],
            [
                6682,
                6692
            ],
            [
                6695,
                6697
            ],
            [
                6697,
                6716
            ],
            [
                6726,
                6745
            ],
            [
                6745,
                6783
            ],
            [
                6784,
                6827
            ],
            [
                6835,
                6837
            ],
            [
                6837,
                6906
            ],
            [
                6906,
                6935
            ],
            [
                6935,
                6957
            ],
            [
                6957,
                6963
            ],
            [
                6963,
                7060
            ],
            [
                7060,
                7137
            ],
            [
                7137,
                7149
            ],
            [
                7163,
                7171
            ],
            [
                7176,
                7202
            ],
            [
                7220,
                7222
            ],
            [
                7222,
                7224
            ],
            [
                7224,
                7231
            ],
            [
                7232,
                7238
            ],
            [
                7248,
                7250
            ],
            [
                7251,
                7257
            ],
            [
                7263,
                7266
            ],
            [
                7266,
                7268
            ],
            [
                7275,
                7276
            ],
            [
                7277,
                7285
            ],
            [
                7286,
                7302
            ],
            [
                7303,
                7325
            ],
            [
                7326,
                7333
            ],
            [
                7333,
                7334
            ],
            [
                7335,
                7383
            ],
            [
                7383,
                7392
            ],
            [
                7403,
                7406
            ],
            [
                7415,
                7420
            ],
            [
                7421,
                7464
            ],
            [
                7475,
                7478
            ],
            [
                7479,
                7485
            ],
            [
                7486,
                7493
            ],
            [
                7501,
                7506
            ],
            [
                7506,
                7508
            ],
            [
                7508,
                7521
            ],
            [
                7527,
                7542
            ],
            [
                7543,
                7545
            ],
            [
                7553,
                7559
            ],
            [
                7566,
                7599
            ],
            [
                7600,
                7608
            ],
            [
                7608,
                7610
            ],
            [
                7610,
                7631
            ],
            [
                7632,
                7634
            ],
            [
                7635,
                7639
            ],
            [
                7640,
                7649
            ],
            [
                7650,
                7659
            ],
            [
                7661,
                7664
            ],
            [
                7665,
                7667
            ],
            [
                7668,
                7685
            ],
            [
                7685,
                7701
            ],
            [
                7702,
                7737
            ],
            [
                7737,
                7739
            ],
            [
                7739,
                7785
            ],
            [
                7790,
                7802
            ],
            [
                7802,
                7803
            ],
            [
                7804,
                7821
            ],
            [
                7822,
                7856
            ],
            [
                7856,
                7887
            ],
            [
                7888,
                7892
            ],
            [
                7893,
                7901
            ],
            [
                7901,
                7903
            ],
            [
                7907,
                7910
            ],
            [
                7915,
                7943
            ],
            [
                7943,
                7945
            ],
            [
                7945,
                7960
            ],
            [
                7964,
                7975
            ],
            [
                8047,
                8050
            ],
            [
                8077,
                8079
            ],
            [
                8080,
                8146
            ],
            [
                8147,
                8167
            ],
            [
                8181,
                8202
            ],
            [
                8203,
                8217
            ],
            [
                8217,
                8252
            ],
            [
                8252,
                8262
            ],
            [
                8262,
                8308
            ],
            [
                8309,
                8350
            ],
            [
                8353,
                8367
            ],
            [
                8367,
                8401
            ],
            [
                8402,
                8412
            ],
            [
                8413,
                8420
            ],
            [
                8431,
                8434
            ],
            [
                8434,
                8435
            ],
            [
                8436,
                8484
            ],
            [
                8485,
                8519
            ],
            [
                8526,
                8529
            ],
            [
                8530,
                8542
            ],
            [
                8542,
                8548
            ],
            [
                8549,
                8551
            ],
            [
                8552,
                8563
            ],
            [
                8564,
                8578
            ],
            [
                8578,
                8580
            ],
            [
                8580,
                8608
            ],
            [
                8608,
                8640
            ],
            [
                8640,
                8649
            ],
            [
                8655,
                8689
            ],
            [
                8689,
                8716
            ],
            [
                8733,
                8751
            ],
            [
                8759,
                8767
            ],
            [
                8777,
                8848
            ],
            [
                8848,
                8850
            ],
            [
                8850,
                8937
            ],
            [
                8937,
                9048
            ],
            [
                9048,
                9081
            ],
            [
                9082,
                9103
            ],
            [
                9104,
                9109
            ],
            [
                9110,
                9113
            ],
            [
                9118,
                9121
            ],
            [
                9121,
                9122
            ],
            [
                9123,
                9177
            ],
            [
                9178,
                9215
            ],
            [
                9215,
                9216
            ],
            [
                9217,
                9220
            ],
            [
                9221,
                9253
            ],
            [
                9254,
                9256
            ],
            [
                9257,
                9260
            ],
            [
                9261,
                9264
            ],
            [
                9265,
                9267
            ],
            [
                9273,
                9275
            ],
            [
                9275,
                9309
            ],
            [
                9310,
                9328
            ],
            [
                9328,
                9333
            ],
            [
                9334,
                9377
            ],
            [
                9378,
                9399
            ],
            [
                9399,
                9416
            ],
            [
                9417,
                9492
            ],
            [
                9492,
                9494
            ],
            [
                9505,
                9567
            ],
            [
                9568,
                9606
            ],
            [
                9606,
                9701
            ],
            [
                9703,
                9709
            ],
            [
                9720,
                9736
            ],
            [
                9737,
                9774
            ],
            [
                9783,
                9786
            ],
            [
                9802,
                9804
            ],
            [
                9804,
                9817
            ],
            [
                9824,
                9826
            ],
            [
                9826,
                9927
            ],
            [
                9927,
                9955
            ],
            [
                9964,
                9966
            ],
            [
                9966,
                10027
            ],
            [
                10027,
                10127
            ],
            [
                10127,
                10199
            ],
            [
                10207,
                10233
            ],
            [
                10233,
                10299
            ],
            [
                10299,
                10302
            ],
            [
                10309,
                10316
            ],
            [
                10317,
                10351
            ],
            [
                10351,
                10378
            ],
            [
                10378,
                10437
            ],
            [
                10438,
                10454
            ],
            [
                10455,
                10485
            ],
            [
                10485,
                10496
            ],
            [
                10496,
                10513
            ],
            [
                10514,
                10544
            ],
            [
                10544,
                10575
            ],
            [
                10575,
                10588
            ],
            [
                10588,
                10603
            ],
            [
                10603,
                10610
            ],
            [
                10611,
                10645
            ],
            [
                10646,
                10693
            ],
            [
                10693,
                10704
            ],
            [
                10705,
                10711
            ],
            [
                10711,
                10714
            ],
            [
                10722,
                10732
            ],
            [
                10733,
                10740
            ],
            [
                10744,
                10777
            ],
            [
                10780,
                10806
            ],
            [
                10806,
                10814
            ],
            [
                10815,
                10845
            ],
            [
                10845,
                10869
            ],
            [
                10870,
                10877
            ],
            [
                10877,
                10929
            ],
            [
                10929,
                10988
            ],
            [
                10989,
                11009
            ],
            [
                11010,
                11053
            ],
            [
                11053,
                11086
            ],
            [
                11095,
                11176
            ],
            [
                11176,
                11232
            ],
            [
                11232,
                11279
            ],
            [
                11280,
                11309
            ],
            [
                11309,
                11395
            ],
            [
                11395,
                11427
            ],
            [
                11427,
                11429
            ],
            [
                11429,
                11463
            ],
            [
                11463,
                11465
            ],
            [
                11465,
                11468
            ],
            [
                11483,
                11488
            ],
            [
                11489,
                11529
            ],
            [
                11529,
                11550
            ],
            [
                11551,
                11602
            ],
            [
                11602,
                11624
            ],
            [
                11627,
                11634
            ],
            [
                11635,
                11641
            ],
            [
                11641,
                11642
            ],
            [
                11655,
                11687
            ],
            [
                11693,
                11699
            ],
            [
                11702,
                11729
            ],
            [
                11742,
                11746
            ],
            [
                11751,
                11765
            ],
            [
                11765,
                11768
            ],
            [
                11775,
                11782
            ],
            [
                11783,
                11797
            ],
            [
                11797,
                11798
            ],
            [
                11799,
                11857
            ],
            [
                11857,
                11940
            ],
            [
                11941,
                11980
            ],
            [
                11980,
                11998
            ],
            [
                11998,
                12040
            ],
            [
                12040,
                12047
            ],
            [
                12048,
                12092
            ],
            [
                12095,
                12113
            ],
            [
                12113,
                12145
            ],
            [
                12146,
                12151
            ],
            [
                12154,
                12174
            ],
            [
                12174,
                12216
            ],
            [
                12224,
                12226
            ],
            [
                12226,
                12333
            ],
            [
                12333,
                12335
            ],
            [
                12335,
                12361
            ],
            [
                12364,
                12379
            ],
            [
                12379,
                12467
            ]
        ],
        "row_chars": [
            [
                0,
                70
            ],
            [
                70,
                84
            ],
            [
                84,
                235
            ],
            [
                235,
                347
            ],
            [
                347,
                386
            ],
            [
                386,
                429
            ],
            [
                429,
                474
            ],
            [
                474,
                588
            ],
            [
                588,
                641
            ],
            [
                641,
                641
            ],
            [
                641,
                755
            ],
            [
                755,
                797
            ],
            [
                797,
                901
            ],
            [
                901,
                901
            ],
            [
                901,
                901
            ],
            [
                901,
                978
            ],
            [
                978,
                1061
            ],
            [
                1061,
                1121
            ],
            [
                1121,
                1172
            ],
            [
                1172,
                1261
            ],
            [
                1261,
                1343
            ],
            [
                1343,
                1385
            ],
            [
                1385,
                1470
            ],
            [
                1470,
                1533
            ],
            [
                1533,
                1697
            ],
            [
                1697,
                1832
            ],
            [
                1832,
                1867
            ],
            [
                1867,
                1964
            ],
            [
                1964,
                2074
            ],
            [
                2074,
                2197
            ],
            [
                2197,
                2256
            ],
            [
                2256,
                2354
            ],
            [
                2354,
                2425
            ],
            [
                2425,
                2479
            ],
            [
                2479,
                2564
            ],
            [
                2564,
                2701
            ],
            [
                2701,
                2809
            ],
            [
                2809,
                2809
            ],
            [
                2809,
                2809
            ],
            [
                2809,
                2932
            ],
            [
                2932,
                2932
            ],
            [
                2932,
                2954
            ],
            [
                2954,
                2982
            ],
            [
                2982,
                3043
            ],
            [
                3043,
                3113
            ],
            [
                3113,
                3190
            ],
            [
                3190,
                3234
            ],
            [
                3234,
                3339
            ],
            [
                3339,
                3382
            ],
            [
                3382,
                3447
            ],
            [
                3447,
                3447
            ],
            [
                3447,
                3527
            ],
            [
                3527,
                3603
            ],
            [
                3603,
                3760
            ],
            [
                3760,
                3817
            ],
            [
                3817,
                3833
            ],
            [
                3833,
                3858
            ],
            [
                3858,
                3875
            ],
            [
                3875,
                3999
            ],
            [
                3999,
                4134
            ],
            [
                4134,
                4134
            ],
            [
                4134,
                4225
            ],
            [
                4225,
                4225
            ],
            [
                4225,
                4225
            ],
            [
                4225,
                4225
            ],
            [
                4225,
                4285
            ],
            [
                4285,
                4285
            ],
            [
                4285,
                4367
            ],
            [
                4367,
                4467
            ],
            [
                4467,
                4553
            ],
            [
                4553,
                4704
            ],
            [
                4704,
                4742
            ],
            [
                4742,
                4919
            ],
            [
                4919,
                5025
            ],
            [
                5025,
                5114
            ],
            [
                5114,
                5169
            ],
            [
                5169,
                5237
            ],
            [
                5237,
                5406
            ],
            [
                5406,
                5406
            ],
            [
                5406,
                5545
            ],
            [
                5545,
                5572
            ],
            [
                5572,
                5673
            ],
            [
                5673,
                5728
            ],
            [
                5728,
                5768
            ],
            [
                5768,
                5846
            ],
            [
                5846,
                5846
            ],
            [
                5846,
                5961
            ],
            [
                5961,
                5961
            ],
            [
                5961,
                6040
            ],
            [
                6040,
                6108
            ],
            [
                6108,
                6167
            ],
            [
                6167,
                6199
            ],
            [
                6199,
                6236
            ],
            [
                6236,
                6310
            ],
            [
                6310,
                6382
            ],
            [
                6382,
                6382
            ],
            [
                6382,
                6382
            ],
            [
                6382,
                6382
            ],
            [
                6382,
                6431
            ],
            [
                6431,
                6431
            ],
            [
                6431,
                6559
            ],
            [
                6559,
                6657
            ],
            [
                6657,
                6682
            ],
            [
                6682,
                6697
            ],
            [
                6697,
                6745
            ],
            [
                6745,
                6837
            ],
            [
                6837,
                6906
            ],
            [
                6906,
                6935
            ],
            [
                6935,
                6957
            ],
            [
                6957,
                6963
            ],
            [
                6963,
                7060
            ],
            [
                7060,
                7137
            ],
            [
                7137,
                7224
            ],
            [
                7224,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7383
            ],
            [
                7383,
                7508
            ],
            [
                7508,
                7508
            ],
            [
                7508,
                7508
            ],
            [
                7508,
                7508
            ],
            [
                7508,
                7508
            ],
            [
                7508,
                7610
            ],
            [
                7610,
                7685
            ],
            [
                7685,
                7685
            ],
            [
                7685,
                7739
            ],
            [
                7739,
                7739
            ],
            [
                7739,
                7856
            ],
            [
                7856,
                7903
            ],
            [
                7903,
                7945
            ],
            [
                7945,
                7945
            ],
            [
                7945,
                7945
            ],
            [
                7945,
                8217
            ],
            [
                8217,
                8309
            ],
            [
                8309,
                8367
            ],
            [
                8367,
                8436
            ],
            [
                8436,
                8436
            ],
            [
                8436,
                8542
            ],
            [
                8542,
                8580
            ],
            [
                8580,
                8689
            ],
            [
                8689,
                8850
            ],
            [
                8850,
                8937
            ],
            [
                8937,
                9048
            ],
            [
                9048,
                9048
            ],
            [
                9048,
                9123
            ],
            [
                9123,
                9275
            ],
            [
                9275,
                9399
            ],
            [
                9399,
                9494
            ],
            [
                9494,
                9606
            ],
            [
                9606,
                9737
            ],
            [
                9737,
                9804
            ],
            [
                9804,
                9826
            ],
            [
                9826,
                9826
            ],
            [
                9826,
                9927
            ],
            [
                9927,
                9927
            ],
            [
                9927,
                9966
            ],
            [
                9966,
                10027
            ],
            [
                10027,
                10127
            ],
            [
                10127,
                10233
            ],
            [
                10233,
                10299
            ],
            [
                10299,
                10299
            ],
            [
                10299,
                10351
            ],
            [
                10351,
                10378
            ],
            [
                10378,
                10485
            ],
            [
                10485,
                10496
            ],
            [
                10496,
                10513
            ],
            [
                10513,
                10513
            ],
            [
                10513,
                10513
            ],
            [
                10513,
                10513
            ],
            [
                10513,
                10544
            ],
            [
                10544,
                10544
            ],
            [
                10544,
                10544
            ],
            [
                10544,
                10575
            ],
            [
                10575,
                10588
            ],
            [
                10588,
                10603
            ],
            [
                10603,
                10646
            ],
            [
                10646,
                10693
            ],
            [
                10693,
                10711
            ],
            [
                10711,
                10806
            ],
            [
                10806,
                10845
            ],
            [
                10845,
                10877
            ],
            [
                10877,
                10988
            ],
            [
                10988,
                10988
            ],
            [
                10988,
                11053
            ],
            [
                11053,
                11176
            ],
            [
                11176,
                11232
            ],
            [
                11232,
                11280
            ],
            [
                11280,
                11309
            ],
            [
                11309,
                11395
            ],
            [
                11395,
                11429
            ],
            [
                11429,
                11465
            ],
            [
                11465,
                11529
            ],
            [
                11529,
                11602
            ],
            [
                11602,
                11765
            ],
            [
                11765,
                11799
            ],
            [
                11799,
                11857
            ],
            [
                11857,
                11941
            ],
            [
                11941,
                11980
            ],
            [
                11980,
                11998
            ],
            [
                11998,
                12040
            ],
            [
                12040,
                12113
            ],
            [
                12113,
                12174
            ],
            [
                12174,
                12226
            ],
            [
                12226,
                12335
            ],
            [
                12335,
                12379
            ],
            [
                12379,
                12467
            ]
        ]
    }
}