{
    "original": {
        "text": "It has been told how the gambling at the Beargarden went on one Sunday night. On the following Monday Sir Felix did not go to the club. He had watched Miles Grendall at play, and was sure that on more than one or two occasions the man had cheated. Sir Felix did not quite know what in such circumstances it would be best for him to do. Reprobate as he was himself, this work of villainy was new to him and seemed to be very terrible. What steps ought he to take? He was quite sure of his facts, and yet he feared that Nidderdale and Grasslough and Longestaffe would not believe him. He would have told Montague, but Montague had, he thought, hardly enough authority at the club to be of any use to him. On the Tuesday again he did not go to the club. He felt severely the loss of the excitement to which he had been accustomed, but the thing was too important to him to be slurred over. He did not dare to sit down and play with the man who had cheated him without saying anything about it. On the Wednesday afternoon life was becoming unbearable to him and he sauntered into the building at about five in the afternoon. There, as a matter of course, he found Dolly Longestaffe drinking sherry and bitters. \"Where the blessed angels have you been?\" said Dolly. Dolly was at that moment alert with the sense of a duty performed. He had just called on his sister and written a sharp letter to his father, and felt himself to be almost a man of business.\n\"I've had fish of my own to fry,\" said Felix, who had passed the last two days in unendurable idleness. Then he referred again to the money which Dolly owed him, not making any complaint, not indeed asking for immediate payment, but explaining with an air of importance that if a commercial arrangement could be made, it might, at this moment, be very serviceable to him. \"I'm particularly anxious to take up those shares,\" said Felix.\n\"Of course you ought to have your money.\"\n\"I don't say that at all, old fellow. I know very well that you're all right. You're not like that fellow, Miles Grendall.\"\n\"Well; no. Poor Miles has got nothing to bless himself with. I suppose I could get it, and so I ought to pay.\"\n\"That's no excuse for Grendall,\" said Sir Felix, shaking his head.\n\"A chap can't pay if he hasn't got it, Carbury. A chap ought to pay of course. I've had a letter from our lawyer within the last half hour--here it is.\" And Dolly pulled a letter out of his pocket which he had opened and read indeed within the last hour, but which had been duly delivered at his lodgings early in the morning. \"My governor wants to sell Pickering, and Melmotte wants to buy the place. My governor can't sell without me, and I've asked for half the plunder. I know what's what. My interest in the property is greater than his. It isn't much of a place, and they are talking of 50,000, over and above the debt upon it. 25,000 would pay off what I owe on my own property, and make me very square. From what this fellow says I suppose they're going to give in to my terms.\"\n\"By George, that'll be a grand thing for you, Dolly.\"\n\"Oh yes. Of course I want it. But I don't like the place going. I'm not much of a fellow, I know. I'm awfully lazy and can't get myself to go in for things as I ought to do; but I've a sort of feeling that I don't like the family property going to pieces. A fellow oughtn't to let his family property go to pieces.\"\n\"You never lived at Pickering.\"\n\"No;--and I don't know that it is any good. It gives us 3 per cent. on the money it's worth, while the governor is paying 6 per cent., and I'm paying 25, for the money we've borrowed. I know more about it than you'd think. It ought to be sold, and now I suppose it will be sold. Old Melmotte knows all about it, and if you like I'll go with you to the city to-morrow and make it straight about what I owe you. He'll advance me 1,000, and then you can get the shares. Are you going to dine here?\"\nSir Felix said that he would dine at the club, but declared, with considerable mystery in his manner, that he could not stay and play whist afterwards. He acceded willingly to Dolly's plan of visiting Abchurch Lane on the following day, but had some difficulty in inducing his friend to consent to fix on an hour early enough for city purposes. Dolly suggested that they should meet at the club at 4 P.M. Sir Felix had named noon, and promised to call at Dolly's lodgings. They split the difference at last and agreed to start at two. They then dined together, Miles Grendall dining alone at the next table to them. Dolly and Grendall spoke to each other frequently, but in that conversation the young baronet would not join. Nor did Grendall ever address himself to Sir Felix. \"Is there anything up between you and Miles?\" said Dolly, when they had adjourned to the smoking-room.\n\"I can't bear him.\"\n\"There never was any love between you two, I know. But you used to speak, and you've played with him all through.\"\n\"Played with him! I should think I have. Though he did get such a haul last Sunday he owes me more than you do now.\"\n\"Is that the reason you haven't played the last two nights?\"\nSir Felix paused a moment. \"No;--that is not the reason. I'll tell you all about it in the cab to-morrow.\" Then he left the club, declaring that he would go up to Grosvenor Square and see Marie Melmotte. He did go up to the Square, and when he came to the house he would not go in. What was the good? He could do nothing further till he got old Melmotte's consent, and in no way could he so probably do that as by showing that he had got money wherewith to buy shares in the railway. What he did with himself during the remainder of the evening the reader need not know, but on his return home at some comparatively early hour, he found this note from Marie.\nWednesday Afternoon.\nDEAREST FELIX,\nWhy don't we see you? Mamma would say nothing if you came. Papa is never in the drawing-room. Miss Longestaffe is here of course, and people always come in in the evening. We are just going to dine out at the Duchess of Stevenage's. Papa, and mamma and I. Mamma told me that Lord Nidderdale is to be there, but you need not be a bit afraid. I don't like Lord Nidderdale, and I will never take any one but the man I love. You know who that is. Miss Longestaffe is so angry because she can't go with us. What do you think of her telling me that she did not understand being left alone? We are to go afterwards to a musical party at Lady Gamut's. Miss Longestaffe is going with us, but she says that she hates music. She is such a set-up thing! I wonder why papa has her here. We don't go anywhere to-morrow evening, so pray come.\nAnd why haven't you written me something and sent it to Didon? She won't betray us. And if she did, what matters? I mean to be true. If papa were to beat me into a mummy I would stick to you. He told me once to take Lord Nidderdale, and then he told me to refuse him. And now he wants me to take him again. But I won't. I'll take no one but my own darling.\nYours for ever and ever,\nMARIE.\nNow that the young lady had begun to have an interest of her own in life, she was determined to make the most of it. All this was delightful to her, but to Sir Felix it was simply \"a bother.\" Sir Felix was quite willing to marry the girl to-morrow,--on condition of course that the money was properly arranged; but he was not willing to go through much work in the way of love-making with Marie Melmotte. In such business he preferred Ruby Ruggles as a companion.\nOn the following day Felix was with his friend at the appointed time, and was only kept an hour waiting while Dolly ate his breakfast and struggled into his coat and boots. On their way to the city Felix told his dreadful story about Miles Grendall. \"By George!\" said Dolly. \"And you think you saw him do it!\"\n\"It's not thinking at all. I'm sure I saw him do it three times. I believe he always had an ace somewhere about him.\" Dolly sat quite silent thinking of it. \"What had I better do?\" asked Sir Felix.\n\"By George;--I don't know.\"\n\"What should you do?\"\n\"Nothing at all. I shouldn't believe my own eyes. Or if I did, should take care not to look at him.\"\n\"You wouldn't go on playing with him?\"\n\"Yes I should. It'd be such a bore breaking up.\"\n\"But Dolly,--if you think of it!\"\n\"That's all very fine, my dear fellow, but I shouldn't think of it.\"\n\"And you won't give me your advice.\"\n\"Well;--no; I think I'd rather not. I wish you hadn't told me. Why did you pick me out to tell me? Why didn't you tell Nidderdale?\"\n\"He might have said, why didn't you tell Longestaffe?\"\n\"No, he wouldn't. Nobody would suppose that anybody would pick me out for this kind of thing. If I'd known that you were going to tell me such a story as this I wouldn't have come with you.\"\n\"That's nonsense, Dolly.\"\n\"Very well. I can't bear these kind of things. I feel all in a twitter already.\"\n\"You mean to go on playing just the same?\"\n\"Of course I do. If he won anything very heavy I should begin to think about it, I suppose. Oh; this is Abchurch Lane, is it? Now for the man of money.\"\nThe man of money received them much more graciously than Sir Felix had expected. Of course nothing was said about Marie and no further allusion was made to the painful subject of the baronet's \"property.\" Both Dolly and Sir Felix were astonished by the quick way in which the great financier understood their views and the readiness with which he undertook to comply with them. No disagreeable questions were asked as to the nature of the debt between the young men. Dolly was called upon to sign a couple of documents, and Sir Felix to sign one,--and then they were assured that the thing was done. Mr. Adolphus Longestaffe had paid Sir Felix Carbury a thousand pounds, and Sir Felix Carbury's commission had been accepted by Mr. Melmotte for the purchase of railway stock to that amount. Sir Felix attempted to say a word. He endeavoured to explain that his object in this commercial transaction was to make money immediately by reselling the shares,--and to go on continually making money by buying at a low price and selling at a high price. He no doubt did believe that, being a Director, if he could once raise the means of beginning this game, he could go on with it for an unlimited period;--buy and sell, buy and sell;--so that he would have an almost regular income. This, as far as he could understand, was what Paul Montague was allowed to do,--simply because he had become a Director with a little money. Mr. Melmotte was cordiality itself, but he could not be got to go into particulars. It was all right. \"You will wish to sell again, of course;--of course. I'll watch the market for you.\" When the young men left the room all they knew, or thought that they knew, was, that Dolly Longestaffe had authorised Melmotte to pay a thousand pounds on his behalf to Sir Felix, and that Sir Felix had instructed the same great man to buy shares with the amount. \"But why didn't he give you the scrip?\" said Dolly on his way westwards.\n\"I suppose it's all right with him,\" said Sir Felix.\n\"Oh yes;--it's all right. Thousands of pounds to him are only like half-crowns to us fellows. I should say it's all right. All the same, he's the biggest rogue out, you know.\" Sir Felix already began to be unhappy about his thousand pounds.",
        "paragraph_chars": [
            [
                0,
                1452
            ],
            [
                1452,
                1888
            ],
            [
                1888,
                1930
            ],
            [
                1930,
                2054
            ],
            [
                2054,
                2165
            ],
            [
                2165,
                2232
            ],
            [
                2232,
                3019
            ],
            [
                3019,
                3073
            ],
            [
                3073,
                3389
            ],
            [
                3389,
                3421
            ],
            [
                3421,
                3917
            ],
            [
                3917,
                4798
            ],
            [
                4798,
                4818
            ],
            [
                4818,
                4933
            ],
            [
                4933,
                5050
            ],
            [
                5050,
                5111
            ],
            [
                5111,
                5770
            ],
            [
                5770,
                5791
            ],
            [
                5791,
                5806
            ],
            [
                5806,
                6634
            ],
            [
                6634,
                6991
            ],
            [
                6991,
                7016
            ],
            [
                7016,
                7023
            ],
            [
                7023,
                7487
            ],
            [
                7487,
                7797
            ],
            [
                7797,
                7995
            ],
            [
                7995,
                8023
            ],
            [
                8023,
                8045
            ],
            [
                8045,
                8146
            ],
            [
                8146,
                8185
            ],
            [
                8185,
                8234
            ],
            [
                8234,
                8268
            ],
            [
                8268,
                8337
            ],
            [
                8337,
                8374
            ],
            [
                8374,
                8506
            ],
            [
                8506,
                8561
            ],
            [
                8561,
                8752
            ],
            [
                8752,
                8778
            ],
            [
                8778,
                8859
            ],
            [
                8859,
                8902
            ],
            [
                8902,
                9055
            ],
            [
                9055,
                10997
            ],
            [
                10997,
                11050
            ],
            [
                11050,
                11290
            ]
        ],
        "segment_chars": [
            [
                0,
                78
            ],
            [
                78,
                136
            ],
            [
                136,
                248
            ],
            [
                248,
                336
            ],
            [
                336,
                434
            ],
            [
                434,
                463
            ],
            [
                463,
                583
            ],
            [
                583,
                703
            ],
            [
                703,
                751
            ],
            [
                751,
                887
            ],
            [
                887,
                991
            ],
            [
                991,
                1121
            ],
            [
                1121,
                1207
            ],
            [
                1207,
                1249
            ],
            [
                1249,
                1261
            ],
            [
                1261,
                1328
            ],
            [
                1328,
                1452
            ],
            [
                1452,
                1556
            ],
            [
                1556,
                1824
            ],
            [
                1824,
                1888
            ],
            [
                1888,
                1930
            ],
            [
                1930,
                1968
            ],
            [
                1968,
                2008
            ],
            [
                2008,
                2054
            ],
            [
                2054,
                2065
            ],
            [
                2065,
                2115
            ],
            [
                2115,
                2165
            ],
            [
                2165,
                2232
            ],
            [
                2232,
                2280
            ],
            [
                2280,
                2311
            ],
            [
                2311,
                2385
            ],
            [
                2385,
                2559
            ],
            [
                2559,
                2634
            ],
            [
                2634,
                2706
            ],
            [
                2706,
                2726
            ],
            [
                2726,
                2775
            ],
            [
                2775,
                2866
            ],
            [
                2866,
                2943
            ],
            [
                2943,
                3019
            ],
            [
                3019,
                3073
            ],
            [
                3073,
                3082
            ],
            [
                3082,
                3103
            ],
            [
                3103,
                3137
            ],
            [
                3137,
                3171
            ],
            [
                3171,
                3329
            ],
            [
                3329,
                3389
            ],
            [
                3389,
                3421
            ],
            [
                3421,
                3465
            ],
            [
                3465,
                3489
            ],
            [
                3489,
                3605
            ],
            [
                3605,
                3644
            ],
            [
                3644,
                3700
            ],
            [
                3700,
                3831
            ],
            [
                3831,
                3888
            ],
            [
                3888,
                3917
            ],
            [
                3917,
                4069
            ],
            [
                4069,
                4262
            ],
            [
                4262,
                4390
            ],
            [
                4390,
                4452
            ],
            [
                4452,
                4533
            ],
            [
                4533,
                4643
            ],
            [
                4643,
                4695
            ],
            [
                4695,
                4741
            ],
            [
                4741,
                4798
            ],
            [
                4798,
                4818
            ],
            [
                4818,
                4869
            ],
            [
                4869,
                4933
            ],
            [
                4933,
                4951
            ],
            [
                4951,
                4974
            ],
            [
                4974,
                5050
            ],
            [
                5050,
                5111
            ],
            [
                5111,
                5138
            ],
            [
                5138,
                5168
            ],
            [
                5168,
                5218
            ],
            [
                5218,
                5315
            ],
            [
                5315,
                5393
            ],
            [
                5393,
                5412
            ],
            [
                5412,
                5595
            ],
            [
                5595,
                5770
            ],
            [
                5770,
                5791
            ],
            [
                5791,
                5806
            ],
            [
                5806,
                5828
            ],
            [
                5828,
                5865
            ],
            [
                5865,
                5900
            ],
            [
                5900,
                5978
            ],
            [
                5978,
                6039
            ],
            [
                6039,
                6147
            ],
            [
                6147,
                6227
            ],
            [
                6227,
                6249
            ],
            [
                6249,
                6308
            ],
            [
                6308,
                6390
            ],
            [
                6390,
                6450
            ],
            [
                6450,
                6520
            ],
            [
                6520,
                6548
            ],
            [
                6548,
                6580
            ],
            [
                6580,
                6634
            ],
            [
                6634,
                6697
            ],
            [
                6697,
                6718
            ],
            [
                6718,
                6748
            ],
            [
                6748,
                6767
            ],
            [
                6767,
                6826
            ],
            [
                6826,
                6902
            ],
            [
                6902,
                6941
            ],
            [
                6941,
                6954
            ],
            [
                6954,
                6991
            ],
            [
                6991,
                7016
            ],
            [
                7016,
                7023
            ],
            [
                7023,
                7140
            ],
            [
                7140,
                7215
            ],
            [
                7215,
                7428
            ],
            [
                7428,
                7487
            ],
            [
                7487,
                7660
            ],
            [
                7660,
                7737
            ],
            [
                7737,
                7750
            ],
            [
                7750,
                7762
            ],
            [
                7762,
                7797
            ],
            [
                7797,
                7824
            ],
            [
                7824,
                7862
            ],
            [
                7862,
                7915
            ],
            [
                7915,
                7954
            ],
            [
                7954,
                7978
            ],
            [
                7978,
                7995
            ],
            [
                7995,
                8023
            ],
            [
                8023,
                8045
            ],
            [
                8045,
                8062
            ],
            [
                8062,
                8095
            ],
            [
                8095,
                8146
            ],
            [
                8146,
                8185
            ],
            [
                8185,
                8200
            ],
            [
                8200,
                8234
            ],
            [
                8234,
                8268
            ],
            [
                8268,
                8337
            ],
            [
                8337,
                8374
            ],
            [
                8374,
                8410
            ],
            [
                8410,
                8437
            ],
            [
                8437,
                8473
            ],
            [
                8473,
                8506
            ],
            [
                8506,
                8561
            ],
            [
                8561,
                8579
            ],
            [
                8579,
                8655
            ],
            [
                8655,
                8752
            ],
            [
                8752,
                8778
            ],
            [
                8778,
                8790
            ],
            [
                8790,
                8825
            ],
            [
                8825,
                8859
            ],
            [
                8859,
                8902
            ],
            [
                8902,
                8919
            ],
            [
                8919,
                8994
            ],
            [
                8994,
                9028
            ],
            [
                9028,
                9055
            ],
            [
                9055,
                9136
            ],
            [
                9136,
                9260
            ],
            [
                9260,
                9433
            ],
            [
                9433,
                9522
            ],
            [
                9522,
                9655
            ],
            [
                9655,
                9845
            ],
            [
                9845,
                9880
            ],
            [
                9880,
                10101
            ],
            [
                10101,
                10332
            ],
            [
                10332,
                10473
            ],
            [
                10473,
                10557
            ],
            [
                10557,
                10575
            ],
            [
                10575,
                10628
            ],
            [
                10628,
                10660
            ],
            [
                10660,
                10924
            ],
            [
                10924,
                10964
            ],
            [
                10964,
                10997
            ],
            [
                10997,
                11050
            ],
            [
                11050,
                11076
            ],
            [
                11076,
                11144
            ],
            [
                11144,
                11173
            ],
            [
                11173,
                11226
            ],
            [
                11226,
                11290
            ]
        ],
        "overlap_chars": [
            [
                0,
                78
            ],
            [
                78,
                84
            ],
            [
                95,
                136
            ],
            [
                136,
                138
            ],
            [
                179,
                192
            ],
            [
                151,
                165
            ],
            [
                235,
                246
            ],
            [
                166,
                168
            ],
            [
                175,
                178
            ],
            [
                258,
                281
            ],
            [
                329,
                336
            ],
            [
                336,
                369
            ],
            [
                375,
                412
            ],
            [
                419,
                434
            ],
            [
                463,
                583
            ],
            [
                583,
                585
            ],
            [
                592,
                628
            ],
            [
                642,
                648
            ],
            [
                687,
                690
            ],
            [
                656,
                677
            ],
            [
                701,
                702
            ],
            [
                703,
                751
            ],
            [
                751,
                779
            ],
            [
                784,
                794
            ],
            [
                826,
                831
            ],
            [
                887,
                991
            ],
            [
                991,
                1121
            ],
            [
                1151,
                1206
            ],
            [
                1207,
                1249
            ],
            [
                1249,
                1259
            ],
            [
                1331,
                1406
            ],
            [
                1271,
                1285
            ],
            [
                1407,
                1452
            ],
            [
                1452,
                1466
            ],
            [
                1477,
                1556
            ],
            [
                1556,
                1563
            ],
            [
                1582,
                1617
            ],
            [
                1679,
                1778
            ],
            [
                1796,
                1803
            ],
            [
                1816,
                1824
            ],
            [
                1824,
                1875
            ],
            [
                1876,
                1880
            ],
            [
                1886,
                1888
            ],
            [
                1888,
                1930
            ],
            [
                1930,
                1932
            ],
            [
                1970,
                1974
            ],
            [
                1985,
                2006
            ],
            [
                1954,
                1967
            ],
            [
                2008,
                2023
            ],
            [
                2037,
                2054
            ],
            [
                2054,
                2065
            ],
            [
                2065,
                2113
            ],
            [
                2165,
                2182
            ],
            [
                2195,
                2232
            ],
            [
                2232,
                2280
            ],
            [
                2287,
                2311
            ],
            [
                2372,
                2376
            ],
            [
                2311,
                2315
            ],
            [
                2316,
                2344
            ],
            [
                2382,
                2385
            ],
            [
                2385,
                2428
            ],
            [
                2557,
                2559
            ],
            [
                2559,
                2595
            ],
            [
                2616,
                2618
            ],
            [
                2601,
                2609
            ],
            [
                2632,
                2634
            ],
            [
                2646,
                2706
            ],
            [
                2706,
                2726
            ],
            [
                2775,
                2866
            ],
            [
                2866,
                2943
            ],
            [
                2943,
                3019
            ],
            [
                3019,
                3073
            ],
            [
                3073,
                3082
            ],
            [
                3082,
                3103
            ],
            [
                3103,
                3119
            ],
            [
                3120,
                3129
            ],
            [
                3135,
                3137
            ],
            [
                3137,
                3171
            ],
            [
                3171,
                3187
            ],
            [
                3245,
                3327
            ],
            [
                3389,
                3421
            ],
            [
                3421,
                3425
            ],
            [
                3427,
                3430
            ],
            [
                3449,
                3451
            ],
            [
                3436,
                3438
            ],
            [
                3463,
                3465
            ],
            [
                3700,
                3777
            ],
            [
                3788,
                3831
            ],
            [
                3831,
                3888
            ],
            [
                3888,
                3917
            ],
            [
                3917,
                3977
            ],
            [
                4004,
                4006
            ],
            [
                4011,
                4069
            ],
            [
                4283,
                4287
            ],
            [
                4428,
                4437
            ],
            [
                4295,
                4302
            ],
            [
                4447,
                4450
            ],
            [
                4135,
                4138
            ],
            [
                4149,
                4152
            ],
            [
                4450,
                4452
            ],
            [
                4452,
                4456
            ],
            [
                4462,
                4512
            ],
            [
                4518,
                4523
            ],
            [
                4513,
                4517
            ],
            [
                4524,
                4533
            ],
            [
                4539,
                4583
            ],
            [
                4688,
                4693
            ],
            [
                4651,
                4659
            ],
            [
                4647,
                4650
            ],
            [
                4633,
                4636
            ],
            [
                4665,
                4672
            ],
            [
                4641,
                4642
            ],
            [
                4695,
                4741
            ],
            [
                4741,
                4798
            ],
            [
                4798,
                4818
            ],
            [
                4818,
                4869
            ],
            [
                4869,
                4872
            ],
            [
                4896,
                4918
            ],
            [
                4930,
                4933
            ],
            [
                4933,
                4951
            ],
            [
                4951,
                4972
            ],
            [
                5111,
                5138
            ],
            [
                5168,
                5205
            ],
            [
                5215,
                5218
            ],
            [
                5218,
                5230
            ],
            [
                5239,
                5314
            ],
            [
                5315,
                5342
            ],
            [
                5347,
                5375
            ],
            [
                5382,
                5393
            ],
            [
                5393,
                5412
            ],
            [
                5412,
                5431
            ],
            [
                5452,
                5479
            ],
            [
                5486,
                5489
            ],
            [
                5514,
                5518
            ],
            [
                5522,
                5544
            ],
            [
                5549,
                5554
            ],
            [
                5565,
                5594
            ],
            [
                5686,
                5704
            ],
            [
                5737,
                5770
            ],
            [
                5791,
                5806
            ],
            [
                5806,
                5828
            ],
            [
                5865,
                5900
            ],
            [
                5900,
                5961
            ],
            [
                5965,
                5978
            ],
            [
                5978,
                5995
            ],
            [
                6004,
                6007
            ],
            [
                5996,
                6003
            ],
            [
                6008,
                6039
            ],
            [
                6062,
                6147
            ],
            [
                6147,
                6198
            ],
            [
                6207,
                6227
            ],
            [
                6227,
                6249
            ],
            [
                6249,
                6308
            ],
            [
                6467,
                6469
            ],
            [
                6476,
                6483
            ],
            [
                6403,
                6448
            ],
            [
                6483,
                6497
            ],
            [
                6503,
                6520
            ],
            [
                6520,
                6533
            ],
            [
                6537,
                6548
            ],
            [
                6548,
                6580
            ],
            [
                6580,
                6600
            ],
            [
                6611,
                6634
            ],
            [
                6638,
                6697
            ],
            [
                6697,
                6718
            ],
            [
                6732,
                6733
            ],
            [
                6748,
                6767
            ],
            [
                6767,
                6790
            ],
            [
                6804,
                6826
            ],
            [
                6910,
                6921
            ],
            [
                6842,
                6865
            ],
            [
                6934,
                6941
            ],
            [
                6941,
                6954
            ],
            [
                6954,
                6991
            ],
            [
                6991,
                7016
            ],
            [
                7016,
                7023
            ],
            [
                7023,
                7076
            ],
            [
                7088,
                7140
            ],
            [
                7140,
                7215
            ],
            [
                7225,
                7260
            ],
            [
                7270,
                7271
            ],
            [
                7301,
                7406
            ],
            [
                7426,
                7428
            ],
            [
                7428,
                7487
            ],
            [
                7487,
                7522
            ],
            [
                7534,
                7574
            ],
            [
                7583,
                7590
            ],
            [
                7575,
                7582
            ],
            [
                7591,
                7660
            ],
            [
                7660,
                7736
            ],
            [
                7737,
                7750
            ],
            [
                7750,
                7762
            ],
            [
                7762,
                7794
            ],
            [
                7824,
                7862
            ],
            [
                7862,
                7912
            ],
            [
                7955,
                7977
            ],
            [
                7995,
                8006
            ],
            [
                8008,
                8023
            ],
            [
                8023,
                8028
            ],
            [
                8036,
                8045
            ],
            [
                8045,
                8062
            ],
            [
                8062,
                8063
            ],
            [
                8071,
                8093
            ],
            [
                8146,
                8185
            ],
            [
                8185,
                8189
            ],
            [
                8190,
                8191
            ],
            [
                8198,
                8200
            ],
            [
                8200,
                8234
            ],
            [
                8234,
                8244
            ],
            [
                8254,
                8268
            ],
            [
                8410,
                8437
            ],
            [
                8655,
                8711
            ],
            [
                8720,
                8752
            ],
            [
                8752,
                8778
            ],
            [
                8778,
                8779
            ],
            [
                8788,
                8790
            ],
            [
                8790,
                8825
            ],
            [
                8825,
                8848
            ],
            [
                8856,
                8859
            ],
            [
                8859,
                8902
            ],
            [
                8902,
                8919
            ],
            [
                8919,
                8994
            ],
            [
                8994,
                9028
            ],
            [
                9028,
                9055
            ],
            [
                9072,
                9136
            ],
            [
                9136,
                9174
            ],
            [
                9260,
                9363
            ],
            [
                9370,
                9401
            ],
            [
                9422,
                9433
            ],
            [
                9433,
                9469
            ],
            [
                9476,
                9521
            ],
            [
                9522,
                9600
            ],
            [
                9603,
                9655
            ],
            [
                9655,
                9845
            ],
            [
                9845,
                9867
            ],
            [
                9898,
                9910
            ],
            [
                9880,
                9882
            ],
            [
                9957,
                10007
            ],
            [
                10009,
                10101
            ],
            [
                10332,
                10410
            ],
            [
                10441,
                10473
            ],
            [
                10473,
                10515
            ],
            [
                10522,
                10525
            ],
            [
                10536,
                10556
            ],
            [
                10575,
                10615
            ],
            [
                10617,
                10628
            ],
            [
                10628,
                10660
            ],
            [
                10660,
                10923
            ],
            [
                10924,
                10964
            ],
            [
                10964,
                10974
            ],
            [
                10995,
                10997
            ],
            [
                10997,
                11050
            ],
            [
                11050,
                11058
            ],
            [
                11060,
                11076
            ],
            [
                11076,
                11106
            ],
            [
                11112,
                11144
            ],
            [
                11173,
                11226
            ],
            [
                11226,
                11290
            ]
        ],
        "row_chars": [
            [
                0,
                78
            ],
            [
                78,
                136
            ],
            [
                136,
                336
            ],
            [
                336,
                434
            ],
            [
                434,
                463
            ],
            [
                463,
                583
            ],
            [
                583,
                703
            ],
            [
                703,
                751
            ],
            [
                751,
                991
            ],
            [
                991,
                1121
            ],
            [
                1121,
                1207
            ],
            [
                1207,
                1249
            ],
            [
                1249,
                1452
            ],
            [
                1452,
                1556
            ],
            [
                1556,
                1824
            ],
            [
                1824,
                1888
            ],
            [
                1888,
                1930
            ],
            [
                1930,
                2008
            ],
            [
                2008,
                2054
            ],
            [
                2054,
                2065
            ],
            [
                2065,
                2115
            ],
            [
                2115,
                2165
            ],
            [
                2165,
                2232
            ],
            [
                2232,
                2280
            ],
            [
                2280,
                2311
            ],
            [
                2311,
                2385
            ],
            [
                2385,
                2559
            ],
            [
                2559,
                2634
            ],
            [
                2634,
                2706
            ],
            [
                2706,
                2726
            ],
            [
                2726,
                2775
            ],
            [
                2775,
                2866
            ],
            [
                2866,
                2943
            ],
            [
                2943,
                3019
            ],
            [
                3019,
                3073
            ],
            [
                3073,
                3082
            ],
            [
                3082,
                3103
            ],
            [
                3103,
                3137
            ],
            [
                3137,
                3171
            ],
            [
                3171,
                3329
            ],
            [
                3329,
                3389
            ],
            [
                3389,
                3421
            ],
            [
                3421,
                3465
            ],
            [
                3465,
                3489
            ],
            [
                3489,
                3605
            ],
            [
                3605,
                3644
            ],
            [
                3644,
                3700
            ],
            [
                3700,
                3831
            ],
            [
                3831,
                3888
            ],
            [
                3888,
                3917
            ],
            [
                3917,
                4069
            ],
            [
                4069,
                4452
            ],
            [
                4452,
                4533
            ],
            [
                4533,
                4695
            ],
            [
                4695,
                4741
            ],
            [
                4741,
                4798
            ],
            [
                4798,
                4818
            ],
            [
                4818,
                4869
            ],
            [
                4869,
                4933
            ],
            [
                4933,
                4951
            ],
            [
                4951,
                4974
            ],
            [
                4974,
                5050
            ],
            [
                5050,
                5111
            ],
            [
                5111,
                5138
            ],
            [
                5138,
                5168
            ],
            [
                5168,
                5218
            ],
            [
                5218,
                5315
            ],
            [
                5315,
                5393
            ],
            [
                5393,
                5412
            ],
            [
                5412,
                5595
            ],
            [
                5595,
                5770
            ],
            [
                5770,
                5791
            ],
            [
                5791,
                5806
            ],
            [
                5806,
                5828
            ],
            [
                5828,
                5865
            ],
            [
                5865,
                5900
            ],
            [
                5900,
                5978
            ],
            [
                5978,
                6039
            ],
            [
                6039,
                6147
            ],
            [
                6147,
                6227
            ],
            [
                6227,
                6249
            ],
            [
                6249,
                6308
            ],
            [
                6308,
                6390
            ],
            [
                6390,
                6520
            ],
            [
                6520,
                6548
            ],
            [
                6548,
                6580
            ],
            [
                6580,
                6634
            ],
            [
                6634,
                6697
            ],
            [
                6697,
                6718
            ],
            [
                6718,
                6767
            ],
            [
                6767,
                6826
            ],
            [
                6826,
                6941
            ],
            [
                6941,
                6954
            ],
            [
                6954,
                6991
            ],
            [
                6991,
                7016
            ],
            [
                7016,
                7023
            ],
            [
                7023,
                7140
            ],
            [
                7140,
                7215
            ],
            [
                7215,
                7428
            ],
            [
                7428,
                7487
            ],
            [
                7487,
                7660
            ],
            [
                7660,
                7737
            ],
            [
                7737,
                7750
            ],
            [
                7750,
                7762
            ],
            [
                7762,
                7797
            ],
            [
                7797,
                7824
            ],
            [
                7824,
                7862
            ],
            [
                7862,
                7915
            ],
            [
                7915,
                7954
            ],
            [
                7954,
                7978
            ],
            [
                7978,
                7995
            ],
            [
                7995,
                8023
            ],
            [
                8023,
                8045
            ],
            [
                8045,
                8062
            ],
            [
                8062,
                8095
            ],
            [
                8095,
                8146
            ],
            [
                8146,
                8185
            ],
            [
                8185,
                8200
            ],
            [
                8200,
                8234
            ],
            [
                8234,
                8268
            ],
            [
                8268,
                8337
            ],
            [
                8337,
                8374
            ],
            [
                8374,
                8410
            ],
            [
                8410,
                8437
            ],
            [
                8437,
                8473
            ],
            [
                8473,
                8506
            ],
            [
                8506,
                8561
            ],
            [
                8561,
                8579
            ],
            [
                8579,
                8655
            ],
            [
                8655,
                8752
            ],
            [
                8752,
                8778
            ],
            [
                8778,
                8790
            ],
            [
                8790,
                8825
            ],
            [
                8825,
                8859
            ],
            [
                8859,
                8902
            ],
            [
                8902,
                8919
            ],
            [
                8919,
                8994
            ],
            [
                8994,
                9028
            ],
            [
                9028,
                9055
            ],
            [
                9055,
                9136
            ],
            [
                9136,
                9260
            ],
            [
                9260,
                9433
            ],
            [
                9433,
                9522
            ],
            [
                9522,
                9655
            ],
            [
                9655,
                9845
            ],
            [
                9845,
                10101
            ],
            [
                10101,
                10332
            ],
            [
                10332,
                10473
            ],
            [
                10473,
                10557
            ],
            [
                10557,
                10575
            ],
            [
                10575,
                10628
            ],
            [
                10628,
                10660
            ],
            [
                10660,
                10924
            ],
            [
                10924,
                10964
            ],
            [
                10964,
                10997
            ],
            [
                10997,
                11050
            ],
            [
                11050,
                11076
            ],
            [
                11076,
                11144
            ],
            [
                11144,
                11173
            ],
            [
                11173,
                11226
            ],
            [
                11226,
                11290
            ]
        ]
    },
    "abridged": {
        "text": "It has been told how the gambling at the Beargarden went on one Sunday night. On the Monday Sir Felix did not go to the club. He was sure that Miles Grendall had cheated at cards; and he did not quite know what to do. Reprobate as he was himself, this type of villainy was new to him and seemed very terrible. He was quite sure of his facts, and yet he feared that Nidderdale and Grasslough and Longestaffe would not believe him. He might have told Montague, but Montague had hardly any authority at the club.\nOn the Tuesday again he did not go to the club. He felt severely the loss of his usual excitement, but he did not dare to sit down and play with the man who had cheated him without saying anything about it. On the Wednesday afternoon life was becoming unbearable to him and he sauntered into the building at about five in the afternoon. He found Dolly Longestaffe drinking sherry and bitters.\n\"Where the blessed angels have you been?\" said Dolly, who had just called on his sister and written a sharp letter to his father, and at that moment felt himself to be almost a man of business.\n\"I've had fish to fry,\" said Felix, who had passed the last two days in unendurable idleness. Then he mentioned the money which Dolly owed him, not complaining, but explaining with an air of importance that if a commercial arrangement could be made, it might be very useful to him. \"I'm particularly anxious to take up those shares,\" he said.\n\"Of course you ought to have your money.\"\n\"I know that you're all right, old fellow. You're not like Miles Grendall.\"\n\"Well; no. Poor Miles has got nothing to bless himself with.\"\n\"That's no excuse,\" said Sir Felix, shaking his head.\n\"A chap can't pay if he hasn't got it, Carbury. He ought to pay of course. Here, I've just had a letter from our lawyer.\" And Dolly pulled a letter out of his pocket. \"My governor wants to sell Pickering to Melmotte. He can't sell without me, and I've asked for half the plunder. I know what's what. It isn't much of a place, and they are talking of 50,000, over and above the debt upon it. 25,000 would pay off what I owe on my own property, and make me very square. From what this fellow says I suppose they're going to give in to my terms.\"\n\"By George, that'll be a grand thing for you, Dolly.\"\n\"Oh yes. Of course I want it. But I don't like selling the place. I'm not much of a fellow, I know. I'm awfully lazy; but I've a sort of feeling that I don't like the family property going to pieces.\"\n\"You never lived at Pickering.\"\n\"No; and it doesn't bring in much income. Old Melmotte knows all about it, and if you like I'll go with you to the city tomorrow and make it straight about what I owe you. He'll advance me 1,000, and then you can get the shares. Are you going to dine here?\"\nSir Felix said that he would dine at the club, but declared, in a mysterious manner, that he could not stay and play whist afterwards. They agreed to meet at two the next day. They dined together, Miles Grendall dining alone at the table next to them. Though Dolly and Grendall spoke to each other frequently, Felix and Grendall did not address each other at all.\n\"Is there anything up between you and Miles?\" said Dolly, when they had adjourned to the smoking-room.\n\"I can't bear him.\"\n\"There never was any love between you two, I know. But you've played with him.\"\n\"Played with him! I should think I have.\" Sir Felix paused a moment. \"I'll tell you all about it in the cab tomorrow.\" Then he left, declaring that he would go up to Grosvenor Square and see Marie Melmotte.\nHe did go up to the Square, but when he came to the house he did not go in. What was the good? He could do nothing without old Melmotte's consent, and the best way to get that was by showing that he had enough money to buy shares in the railway.\nOn his return home, he found this note from Marie.\nDearest Felix,\nWhy don't we see you? Papa is never in the drawing-room. Miss Longestaffe is here of course, and people always come in the evening. We are just going out to dine at the Duchess of Stevenage's. Mamma told me that Lord Nidderdale is to be there, but you need not be a bit afraid. I don't like Lord Nidderdale, and I will never take anyone but the man I love. You know who that is. Miss Longestaffe is so angry because she can't go with us. She is coming with us afterwards to a musical party at Lady Gamut's, but she says she hates music. She is such a stuck-up thing! I wonder why papa has her here. We don't go anywhere tomorrow evening, so pray come.\nWhy haven't you written me something and sent it to Didon? She won't betray us. In any case, I mean to be true. If papa were to beat me I would stick to you. He wants me to take Lord Nidderdale again. But I won't. I'll take no one but my own darling.\nYours for ever and ever,\nMarie.\nNow that the young lady had begun to have an interest in life, she was determined to make the most of it. All this was delightful to her, but to Sir Felix it was simply \"a bother.\" He was quite willing to marry the girl tomorrow, if the money was properly arranged; but he was not willing to go through much work in the way of love-making. In such business he preferred Ruby Ruggles as a companion.\nOn the following day Felix was with Dolly at the appointed time, and was only kept waiting an hour while Dolly ate his breakfast and struggled into his coat and boots. On their way to the city Felix told his dreadful story about Miles Grendall.\n\"By George!\" said Dolly. \"And you think you saw him do it?\"\n\"I'm sure I saw him do it three times. I believe he always had an ace somewhere about him. What had I better do?\"\n\"By George; I don't know.\"\n\"What would you do?\"\n\"Nothing at all. I wouldn't believe my own eyes.\"\n\"You wouldn't go on playing with him?\"\n\"Yes, I would. It'd be such a bore breaking up.\"\n\"But Dolly - think of it!\"\n\"I wish you hadn't told me. If I'd known that you were going to tell me such a story I wouldn't have come with you.\"\n\"That's nonsense, Dolly.\"\n\"Maybe. I can't bear these kind of things. I feel all in a twitter.\"\n\"You mean to go on playing just the same?\"\n\"Of course I do. If he won anything very heavy I should begin to think about it, I suppose. Oh; this is Abchurch Lane, is it? Now for the man of money.\"\nMelmotte received them much more graciously than Sir Felix had expected. Of course nothing was said about Marie. Both Dolly and Sir Felix were astonished by the quick way in which the great financier understood their wishes and the readiness with which he complied with them. No disagreeable questions were asked about the nature of the debt between the young men.\nDolly was called upon to sign a couple of documents, and Sir Felix to sign one - and then they were assured that the thing was done. Mr. Adolphus Longestaffe had paid Sir Felix Carbury a thousand pounds, and Sir Felix Carbury's commission had been accepted by Mr. Melmotte for the purchase of railway stock to that amount. Sir Felix attempted to explain that he wanted to make money immediately by reselling the shares, and to go on continually making money by buying at a low price and selling at a high price. This, as far as he could understand, was what Paul Montague was allowed to do, as a Director with a little money. Mr. Melmotte was cordiality itself, but he did not go into particulars.\n\"You will wish to sell again, of course; of course. I'll watch the market for you.\" When the young men left the room all they knew, or thought that they knew, was, that Dolly Longestaffe had authorised Melmotte to pay a thousand pounds on his behalf to Sir Felix, and that Sir Felix had instructed the same great man to buy shares with the amount.\n\"But why didn't he give you the scrip?\" said Dolly.\n\"I suppose it's all right with him,\" said Sir Felix.\n\"Oh yes; it's all right. Thousands of pounds to him are like half-crowns to us fellows. All the same, he's the biggest rogue out, you know.\" Sir Felix already began to be unhappy about his thousand pounds.",
        "paragraph_chars": [
            [
                0,
                510
            ],
            [
                510,
                903
            ],
            [
                903,
                1097
            ],
            [
                1097,
                1440
            ],
            [
                1440,
                1482
            ],
            [
                1482,
                1558
            ],
            [
                1558,
                1620
            ],
            [
                1620,
                1674
            ],
            [
                1674,
                2218
            ],
            [
                2218,
                2272
            ],
            [
                2272,
                2473
            ],
            [
                2473,
                2505
            ],
            [
                2505,
                2763
            ],
            [
                2763,
                3127
            ],
            [
                3127,
                3230
            ],
            [
                3230,
                3250
            ],
            [
                3250,
                3330
            ],
            [
                3330,
                3537
            ],
            [
                3537,
                3783
            ],
            [
                3783,
                3834
            ],
            [
                3834,
                3849
            ],
            [
                3849,
                4501
            ],
            [
                4501,
                4752
            ],
            [
                4752,
                4777
            ],
            [
                4777,
                4784
            ],
            [
                4784,
                5183
            ],
            [
                5183,
                5428
            ],
            [
                5428,
                5488
            ],
            [
                5488,
                5602
            ],
            [
                5602,
                5629
            ],
            [
                5629,
                5650
            ],
            [
                5650,
                5700
            ],
            [
                5700,
                5739
            ],
            [
                5739,
                5788
            ],
            [
                5788,
                5815
            ],
            [
                5815,
                5932
            ],
            [
                5932,
                5958
            ],
            [
                5958,
                6027
            ],
            [
                6027,
                6070
            ],
            [
                6070,
                6223
            ],
            [
                6223,
                6588
            ],
            [
                6588,
                7286
            ],
            [
                7286,
                7634
            ],
            [
                7634,
                7686
            ],
            [
                7686,
                7739
            ],
            [
                7739,
                7944
            ]
        ],
        "segment_chars": [
            [
                0,
                78
            ],
            [
                78,
                126
            ],
            [
                126,
                218
            ],
            [
                218,
                310
            ],
            [
                310,
                430
            ],
            [
                430,
                510
            ],
            [
                510,
                558
            ],
            [
                558,
                717
            ],
            [
                717,
                847
            ],
            [
                847,
                903
            ],
            [
                903,
                945
            ],
            [
                945,
                1097
            ],
            [
                1097,
                1191
            ],
            [
                1191,
                1379
            ],
            [
                1379,
                1440
            ],
            [
                1440,
                1482
            ],
            [
                1482,
                1525
            ],
            [
                1525,
                1558
            ],
            [
                1558,
                1569
            ],
            [
                1569,
                1620
            ],
            [
                1620,
                1674
            ],
            [
                1674,
                1722
            ],
            [
                1722,
                1749
            ],
            [
                1749,
                1796
            ],
            [
                1796,
                1841
            ],
            [
                1841,
                1891
            ],
            [
                1891,
                1954
            ],
            [
                1954,
                1974
            ],
            [
                1974,
                2065
            ],
            [
                2065,
                2142
            ],
            [
                2142,
                2218
            ],
            [
                2218,
                2272
            ],
            [
                2272,
                2281
            ],
            [
                2281,
                2302
            ],
            [
                2302,
                2338
            ],
            [
                2338,
                2372
            ],
            [
                2372,
                2473
            ],
            [
                2473,
                2505
            ],
            [
                2505,
                2547
            ],
            [
                2547,
                2677
            ],
            [
                2677,
                2734
            ],
            [
                2734,
                2763
            ],
            [
                2763,
                2898
            ],
            [
                2898,
                2939
            ],
            [
                2939,
                3015
            ],
            [
                3015,
                3127
            ],
            [
                3127,
                3173
            ],
            [
                3173,
                3230
            ],
            [
                3230,
                3250
            ],
            [
                3250,
                3301
            ],
            [
                3301,
                3330
            ],
            [
                3330,
                3348
            ],
            [
                3348,
                3372
            ],
            [
                3372,
                3399
            ],
            [
                3399,
                3449
            ],
            [
                3449,
                3537
            ],
            [
                3537,
                3613
            ],
            [
                3613,
                3632
            ],
            [
                3632,
                3783
            ],
            [
                3783,
                3834
            ],
            [
                3834,
                3849
            ],
            [
                3849,
                3871
            ],
            [
                3871,
                3906
            ],
            [
                3906,
                3981
            ],
            [
                3981,
                4042
            ],
            [
                4042,
                4127
            ],
            [
                4127,
                4206
            ],
            [
                4206,
                4228
            ],
            [
                4228,
                4287
            ],
            [
                4287,
                4386
            ],
            [
                4386,
                4416
            ],
            [
                4416,
                4448
            ],
            [
                4448,
                4501
            ],
            [
                4501,
                4560
            ],
            [
                4560,
                4581
            ],
            [
                4581,
                4613
            ],
            [
                4613,
                4659
            ],
            [
                4659,
                4702
            ],
            [
                4702,
                4715
            ],
            [
                4715,
                4752
            ],
            [
                4752,
                4777
            ],
            [
                4777,
                4784
            ],
            [
                4784,
                4890
            ],
            [
                4890,
                4965
            ],
            [
                4965,
                5124
            ],
            [
                5124,
                5183
            ],
            [
                5183,
                5351
            ],
            [
                5351,
                5428
            ],
            [
                5428,
                5441
            ],
            [
                5441,
                5453
            ],
            [
                5453,
                5488
            ],
            [
                5488,
                5527
            ],
            [
                5527,
                5579
            ],
            [
                5579,
                5602
            ],
            [
                5602,
                5629
            ],
            [
                5629,
                5650
            ],
            [
                5650,
                5667
            ],
            [
                5667,
                5700
            ],
            [
                5700,
                5739
            ],
            [
                5739,
                5754
            ],
            [
                5754,
                5788
            ],
            [
                5788,
                5815
            ],
            [
                5815,
                5843
            ],
            [
                5843,
                5932
            ],
            [
                5932,
                5958
            ],
            [
                5958,
                5966
            ],
            [
                5966,
                6001
            ],
            [
                6001,
                6027
            ],
            [
                6027,
                6070
            ],
            [
                6070,
                6087
            ],
            [
                6087,
                6162
            ],
            [
                6162,
                6196
            ],
            [
                6196,
                6223
            ],
            [
                6223,
                6296
            ],
            [
                6296,
                6336
            ],
            [
                6336,
                6499
            ],
            [
                6499,
                6588
            ],
            [
                6588,
                6721
            ],
            [
                6721,
                6911
            ],
            [
                6911,
                7100
            ],
            [
                7100,
                7214
            ],
            [
                7214,
                7286
            ],
            [
                7286,
                7338
            ],
            [
                7338,
                7370
            ],
            [
                7370,
                7634
            ],
            [
                7634,
                7674
            ],
            [
                7674,
                7686
            ],
            [
                7686,
                7739
            ],
            [
                7739,
                7764
            ],
            [
                7764,
                7827
            ],
            [
                7827,
                7880
            ],
            [
                7880,
                7944
            ]
        ],
        "overlap_chars": [
            [
                0,
                78
            ],
            [
                78,
                84
            ],
            [
                85,
                126
            ],
            [
                126,
                128
            ],
            [
                129,
                142
            ],
            [
                143,
                157
            ],
            [
                158,
                169
            ],
            [
                170,
                172
            ],
            [
                180,
                183
            ],
            [
                187,
                210
            ],
            [
                211,
                218
            ],
            [
                218,
                251
            ],
            [
                257,
                294
            ],
            [
                295,
                310
            ],
            [
                310,
                430
            ],
            [
                430,
                432
            ],
            [
                439,
                475
            ],
            [
                476,
                482
            ],
            [
                483,
                486
            ],
            [
                487,
                508
            ],
            [
                508,
                509
            ],
            [
                510,
                558
            ],
            [
                558,
                586
            ],
            [
                597,
                607
            ],
            [
                607,
                612
            ],
            [
                613,
                717
            ],
            [
                717,
                847
            ],
            [
                847,
                902
            ],
            [
                903,
                945
            ],
            [
                945,
                955
            ],
            [
                961,
                1036
            ],
            [
                1037,
                1051
            ],
            [
                1052,
                1097
            ],
            [
                1097,
                1111
            ],
            [
                1112,
                1191
            ],
            [
                1191,
                1198
            ],
            [
                1209,
                1244
            ],
            [
                1256,
                1355
            ],
            [
                1356,
                1363
            ],
            [
                1371,
                1379
            ],
            [
                1379,
                1430
            ],
            [
                1434,
                1438
            ],
            [
                1438,
                1440
            ],
            [
                1440,
                1482
            ],
            [
                1482,
                1484
            ],
            [
                1485,
                1489
            ],
            [
                1490,
                1511
            ],
            [
                1511,
                1524
            ],
            [
                1525,
                1540
            ],
            [
                1541,
                1558
            ],
            [
                1558,
                1569
            ],
            [
                1569,
                1617
            ],
            [
                1620,
                1637
            ],
            [
                1637,
                1674
            ],
            [
                1674,
                1722
            ],
            [
                1725,
                1749
            ],
            [
                1749,
                1753
            ],
            [
                1755,
                1759
            ],
            [
                1765,
                1793
            ],
            [
                1793,
                1796
            ],
            [
                1796,
                1839
            ],
            [
                1839,
                1841
            ],
            [
                1841,
                1877
            ],
            [
                1878,
                1880
            ],
            [
                1881,
                1889
            ],
            [
                1889,
                1891
            ],
            [
                1894,
                1954
            ],
            [
                1954,
                1974
            ],
            [
                1974,
                2065
            ],
            [
                2065,
                2142
            ],
            [
                2142,
                2218
            ],
            [
                2218,
                2272
            ],
            [
                2272,
                2281
            ],
            [
                2281,
                2302
            ],
            [
                2302,
                2318
            ],
            [
                2327,
                2336
            ],
            [
                2336,
                2338
            ],
            [
                2338,
                2372
            ],
            [
                2372,
                2388
            ],
            [
                2388,
                2470
            ],
            [
                2473,
                2505
            ],
            [
                2505,
                2509
            ],
            [
                2510,
                2513
            ],
            [
                2514,
                2516
            ],
            [
                2522,
                2524
            ],
            [
                2545,
                2547
            ],
            [
                2547,
                2624
            ],
            [
                2634,
                2677
            ],
            [
                2677,
                2734
            ],
            [
                2734,
                2763
            ],
            [
                2763,
                2823
            ],
            [
                2824,
                2826
            ],
            [
                2840,
                2898
            ],
            [
                2898,
                2902
            ],
            [
                2903,
                2912
            ],
            [
                2913,
                2920
            ],
            [
                2921,
                2924
            ],
            [
                2925,
                2928
            ],
            [
                2934,
                2937
            ],
            [
                2937,
                2939
            ],
            [
                2939,
                2943
            ],
            [
                2944,
                2994
            ],
            [
                2995,
                3000
            ],
            [
                3001,
                3005
            ],
            [
                3006,
                3015
            ],
            [
                3028,
                3072
            ],
            [
                3073,
                3078
            ],
            [
                3083,
                3091
            ],
            [
                3092,
                3095
            ],
            [
                3096,
                3099
            ],
            [
                3100,
                3107
            ],
            [
                3125,
                3126
            ],
            [
                3127,
                3173
            ],
            [
                3173,
                3230
            ],
            [
                3230,
                3250
            ],
            [
                3250,
                3301
            ],
            [
                3301,
                3304
            ],
            [
                3305,
                3327
            ],
            [
                3327,
                3330
            ],
            [
                3330,
                3348
            ],
            [
                3348,
                3369
            ],
            [
                3372,
                3399
            ],
            [
                3400,
                3437
            ],
            [
                3446,
                3449
            ],
            [
                3449,
                3461
            ],
            [
                3461,
                3536
            ],
            [
                3537,
                3564
            ],
            [
                3569,
                3597
            ],
            [
                3602,
                3613
            ],
            [
                3613,
                3632
            ],
            [
                3632,
                3651
            ],
            [
                3660,
                3687
            ],
            [
                3697,
                3700
            ],
            [
                3708,
                3712
            ],
            [
                3717,
                3739
            ],
            [
                3747,
                3752
            ],
            [
                3753,
                3782
            ],
            [
                3783,
                3801
            ],
            [
                3801,
                3834
            ],
            [
                3834,
                3849
            ],
            [
                3849,
                3871
            ],
            [
                3871,
                3906
            ],
            [
                3906,
                3967
            ],
            [
                3968,
                3981
            ],
            [
                3981,
                3998
            ],
            [
                3999,
                4002
            ],
            [
                4003,
                4010
            ],
            [
                4011,
                4042
            ],
            [
                4042,
                4127
            ],
            [
                4127,
                4178
            ],
            [
                4186,
                4206
            ],
            [
                4206,
                4228
            ],
            [
                4228,
                4287
            ],
            [
                4291,
                4293
            ],
            [
                4301,
                4308
            ],
            [
                4309,
                4354
            ],
            [
                4354,
                4368
            ],
            [
                4369,
                4386
            ],
            [
                4386,
                4399
            ],
            [
                4405,
                4416
            ],
            [
                4416,
                4448
            ],
            [
                4448,
                4468
            ],
            [
                4478,
                4501
            ],
            [
                4501,
                4560
            ],
            [
                4560,
                4581
            ],
            [
                4592,
                4593
            ],
            [
                4594,
                4613
            ],
            [
                4613,
                4636
            ],
            [
                4637,
                4659
            ],
            [
                4659,
                4670
            ],
            [
                4671,
                4694
            ],
            [
                4695,
                4702
            ],
            [
                4702,
                4715
            ],
            [
                4715,
                4752
            ],
            [
                4752,
                4777
            ],
            [
                4777,
                4784
            ],
            [
                4784,
                4837
            ],
            [
                4838,
                4890
            ],
            [
                4890,
                4965
            ],
            [
                4968,
                5003
            ],
            [
                5012,
                5013
            ],
            [
                5017,
                5122
            ],
            [
                5122,
                5124
            ],
            [
                5124,
                5183
            ],
            [
                5183,
                5218
            ],
            [
                5225,
                5265
            ],
            [
                5266,
                5273
            ],
            [
                5274,
                5281
            ],
            [
                5282,
                5351
            ],
            [
                5351,
                5427
            ],
            [
                5428,
                5441
            ],
            [
                5441,
                5453
            ],
            [
                5453,
                5485
            ],
            [
                5489,
                5527
            ],
            [
                5527,
                5577
            ],
            [
                5579,
                5601
            ],
            [
                5602,
                5613
            ],
            [
                5614,
                5629
            ],
            [
                5629,
                5634
            ],
            [
                5641,
                5650
            ],
            [
                5650,
                5667
            ],
            [
                5667,
                5668
            ],
            [
                5675,
                5697
            ],
            [
                5700,
                5739
            ],
            [
                5739,
                5743
            ],
            [
                5745,
                5746
            ],
            [
                5752,
                5754
            ],
            [
                5754,
                5788
            ],
            [
                5788,
                5798
            ],
            [
                5801,
                5815
            ],
            [
                5816,
                5843
            ],
            [
                5843,
                5899
            ],
            [
                5900,
                5932
            ],
            [
                5932,
                5958
            ],
            [
                5958,
                5959
            ],
            [
                5964,
                5966
            ],
            [
                5966,
                6001
            ],
            [
                6001,
                6024
            ],
            [
                6024,
                6027
            ],
            [
                6027,
                6070
            ],
            [
                6070,
                6087
            ],
            [
                6087,
                6162
            ],
            [
                6162,
                6196
            ],
            [
                6196,
                6223
            ],
            [
                6232,
                6296
            ],
            [
                6296,
                6334
            ],
            [
                6336,
                6439
            ],
            [
                6447,
                6478
            ],
            [
                6488,
                6499
            ],
            [
                6499,
                6535
            ],
            [
                6542,
                6587
            ],
            [
                6588,
                6666
            ],
            [
                6669,
                6721
            ],
            [
                6721,
                6911
            ],
            [
                6911,
                6933
            ],
            [
                6934,
                6946
            ],
            [
                6947,
                6949
            ],
            [
                6957,
                7007
            ],
            [
                7008,
                7100
            ],
            [
                7100,
                7178
            ],
            [
                7182,
                7214
            ],
            [
                7214,
                7256
            ],
            [
                7261,
                7264
            ],
            [
                7265,
                7285
            ],
            [
                7286,
                7326
            ],
            [
                7327,
                7338
            ],
            [
                7338,
                7370
            ],
            [
                7370,
                7633
            ],
            [
                7634,
                7674
            ],
            [
                7674,
                7684
            ],
            [
                7684,
                7686
            ],
            [
                7686,
                7739
            ],
            [
                7739,
                7747
            ],
            [
                7748,
                7764
            ],
            [
                7764,
                7794
            ],
            [
                7795,
                7827
            ],
            [
                7827,
                7880
            ],
            [
                7880,
                7944
            ]
        ],
        "row_chars": [
            [
                0,
                78
            ],
            [
                78,
                126
            ],
            [
                126,
                218
            ],
            [
                218,
                310
            ],
            [
                310,
                310
            ],
            [
                310,
                430
            ],
            [
                430,
                510
            ],
            [
                510,
                558
            ],
            [
                558,
                717
            ],
            [
                717,
                847
            ],
            [
                847,
                903
            ],
            [
                903,
                945
            ],
            [
                945,
                1097
            ],
            [
                1097,
                1191
            ],
            [
                1191,
                1379
            ],
            [
                1379,
                1440
            ],
            [
                1440,
                1482
            ],
            [
                1482,
                1525
            ],
            [
                1525,
                1558
            ],
            [
                1558,
                1569
            ],
            [
                1569,
                1620
            ],
            [
                1620,
                1620
            ],
            [
                1620,
                1674
            ],
            [
                1674,
                1722
            ],
            [
                1722,
                1749
            ],
            [
                1749,
                1796
            ],
            [
                1796,
                1841
            ],
            [
                1841,
                1891
            ],
            [
                1891,
                1954
            ],
            [
                1954,
                1974
            ],
            [
                1974,
                1974
            ],
            [
                1974,
                2065
            ],
            [
                2065,
                2142
            ],
            [
                2142,
                2218
            ],
            [
                2218,
                2272
            ],
            [
                2272,
                2281
            ],
            [
                2281,
                2302
            ],
            [
                2302,
                2338
            ],
            [
                2338,
                2372
            ],
            [
                2372,
                2473
            ],
            [
                2473,
                2473
            ],
            [
                2473,
                2505
            ],
            [
                2505,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2677
            ],
            [
                2677,
                2734
            ],
            [
                2734,
                2763
            ],
            [
                2763,
                2898
            ],
            [
                2898,
                2939
            ],
            [
                2939,
                3015
            ],
            [
                3015,
                3127
            ],
            [
                3127,
                3173
            ],
            [
                3173,
                3230
            ],
            [
                3230,
                3250
            ],
            [
                3250,
                3301
            ],
            [
                3301,
                3330
            ],
            [
                3330,
                3348
            ],
            [
                3348,
                3372
            ],
            [
                3372,
                3372
            ],
            [
                3372,
                3372
            ],
            [
                3372,
                3399
            ],
            [
                3399,
                3399
            ],
            [
                3399,
                3449
            ],
            [
                3449,
                3537
            ],
            [
                3537,
                3613
            ],
            [
                3613,
                3632
            ],
            [
                3632,
                3783
            ],
            [
                3783,
                3834
            ],
            [
                3834,
                3834
            ],
            [
                3834,
                3849
            ],
            [
                3849,
                3871
            ],
            [
                3871,
                3871
            ],
            [
                3871,
                3906
            ],
            [
                3906,
                3981
            ],
            [
                3981,
                4042
            ],
            [
                4042,
                4127
            ],
            [
                4127,
                4206
            ],
            [
                4206,
                4228
            ],
            [
                4228,
                4287
            ],
            [
                4287,
                4287
            ],
            [
                4287,
                4386
            ],
            [
                4386,
                4416
            ],
            [
                4416,
                4448
            ],
            [
                4448,
                4501
            ],
            [
                4501,
                4560
            ],
            [
                4560,
                4581
            ],
            [
                4581,
                4613
            ],
            [
                4613,
                4659
            ],
            [
                4659,
                4702
            ],
            [
                4702,
                4715
            ],
            [
                4715,
                4752
            ],
            [
                4752,
                4777
            ],
            [
                4777,
                4784
            ],
            [
                4784,
                4890
            ],
            [
                4890,
                4965
            ],
            [
                4965,
                5124
            ],
            [
                5124,
                5183
            ],
            [
                5183,
                5351
            ],
            [
                5351,
                5428
            ],
            [
                5428,
                5441
            ],
            [
                5441,
                5453
            ],
            [
                5453,
                5488
            ],
            [
                5488,
                5488
            ],
            [
                5488,
                5527
            ],
            [
                5527,
                5579
            ],
            [
                5579,
                5579
            ],
            [
                5579,
                5602
            ],
            [
                5602,
                5602
            ],
            [
                5602,
                5629
            ],
            [
                5629,
                5650
            ],
            [
                5650,
                5667
            ],
            [
                5667,
                5700
            ],
            [
                5700,
                5700
            ],
            [
                5700,
                5739
            ],
            [
                5739,
                5754
            ],
            [
                5754,
                5788
            ],
            [
                5788,
                5815
            ],
            [
                5815,
                5815
            ],
            [
                5815,
                5815
            ],
            [
                5815,
                5815
            ],
            [
                5815,
                5843
            ],
            [
                5843,
                5843
            ],
            [
                5843,
                5843
            ],
            [
                5843,
                5843
            ],
            [
                5843,
                5843
            ],
            [
                5843,
                5843
            ],
            [
                5843,
                5932
            ],
            [
                5932,
                5958
            ],
            [
                5958,
                5966
            ],
            [
                5966,
                6001
            ],
            [
                6001,
                6027
            ],
            [
                6027,
                6070
            ],
            [
                6070,
                6087
            ],
            [
                6087,
                6162
            ],
            [
                6162,
                6196
            ],
            [
                6196,
                6223
            ],
            [
                6223,
                6296
            ],
            [
                6296,
                6336
            ],
            [
                6336,
                6499
            ],
            [
                6499,
                6588
            ],
            [
                6588,
                6721
            ],
            [
                6721,
                6911
            ],
            [
                6911,
                7100
            ],
            [
                7100,
                7100
            ],
            [
                7100,
                7214
            ],
            [
                7214,
                7286
            ],
            [
                7286,
                7286
            ],
            [
                7286,
                7338
            ],
            [
                7338,
                7370
            ],
            [
                7370,
                7634
            ],
            [
                7634,
                7674
            ],
            [
                7674,
                7686
            ],
            [
                7686,
                7739
            ],
            [
                7739,
                7764
            ],
            [
                7764,
                7827
            ],
            [
                7827,
                7827
            ],
            [
                7827,
                7880
            ],
            [
                7880,
                7944
            ]
        ]
    }
}