{
    "original": {
        "text": "Lady Carbury continued to ask frequent questions as to the prosecution of her son's suit, and Sir Felix began to think that he was persecuted. \"I have spoken to her father,\" he said crossly.\n\"And what did Mr. Melmotte say?\"\n\"Say;--what should he say? He wanted to know what income I had got. After all he's an old screw.\"\n\"Did he forbid you to come there any more?\"\n\"Now, mother, it's no use your cross-examining me. If you'll let me alone I'll do the best I can.\"\n\"She has accepted you, herself?\"\n\"Of course she has. I told you that at Carbury.\"\n\"Then, Felix, if I were you I'd run off with her. I would indeed. It's done every day, and nobody thinks any harm of it when you marry the girl. You could do it now because I know you've got money. From all I can hear she's just the sort of girl that would go with you.\" The son sat silent, listening to these maternal councils. He did believe that Marie would go off with him, were he to propose the scheme to her. Her own father had almost alluded to such a proceeding,--had certainly hinted that it was feasible,--but at the same time had very clearly stated that in such case the ardent lover would have to content himself with the lady alone. In any such event as that there would be no fortune. But then, might not that only be a threat? Rich fathers generally do forgive their daughters, and a rich father with only one child would surely forgive her when she returned to him, as she would do in this instance, graced with a title. Sir Felix thought of all this as he sat there silent. His mother read his thoughts as she continued. \"Of course, Felix, there must be some risk.\"\n\"Fancy what it would be to be thrown over at last!\" he exclaimed. \"I couldn't bear it. I think I should kill her.\"\n\"Oh no, Felix; you wouldn't do that. But when I say there would be some risk I mean that there would be very little. There would be nothing in it that ought to make him really angry. He has nobody else to give his money to, and it would be much nicer to have his daughter, Lady Carbury, with him, than to be left all alone in the world.\"\n\"I couldn't live with him, you know. I couldn't do it.\"\n\"You needn't live with him, Felix. Of course she would visit her parents. When the money was once settled you need see as little of them as you pleased. Pray do not allow trifles to interfere with you. If this should not succeed, what are you to do? We shall all starve unless something be done. If I were you, Felix, I would take her away at once. They say she is of age.\"\n\"I shouldn't know where to take her,\" said Sir Felix, almost stunned into thoughtfulness by the magnitude of the proposition made to him. \"All that about Scotland is done with now.\"\n\"Of course you would marry her at once.\"\n\"I suppose so,--unless it were better to stay as we were, till the money was settled.\"\n\"Oh, no; no! Everybody would be against you. If you take her off in a spirited sort of way and then marry her, everybody will be with you. That's what you want. The father and mother will be sure to come round, if--\"\n\"The mother is nothing.\"\n\"He will come round if people speak up in your favour. I could get Mr. Alf and Mr. Broune to help. I'd try it, Felix; indeed I would. Ten thousand a year is not to be had every year.\"\nSir Felix gave no assent to his mother's views. He felt no desire to relieve her anxiety by an assurance of activity in the matter. But the prospect was so grand that it had excited even him. He had money sufficient for carrying out the scheme, and if he delayed the matter now, it might well be that he would never again find himself so circumstanced. He thought that he would ask somebody whither he ought to take her, and what he ought to do with her;--and that he would then make the proposition to herself. Miles Grendall would be the man to tell him, because, with all his faults, Miles did understand things. But he could not ask Miles. He and Nidderdale were good friends; but Nidderdale wanted the girl for himself. Grasslough would be sure to tell Nidderdale. Dolly would be altogether useless. He thought that, perhaps, Herr Vossner would be the man to help him. There would be no difficulty out of which Herr Vossner would not extricate \"a fellow,\"--if \"the fellow\" paid him.\nOn Thursday evening he went to Grosvenor Square, as desired by Marie,--but unfortunately found Melmotte in the drawing-room. Lord Nidderdale was there also, and his lordship's old father, the Marquis of Auld Reekie, whom Felix, when he entered the room, did not know. He was a fierce-looking, gouty old man, with watery eyes, and very stiff grey hair,--almost white. He was standing up supporting himself on two sticks when Sir Felix entered the room. There were also present Madame Melmotte, Miss Longestaffe, and Marie. As Felix had entered the hall one huge footman had said that the ladies were not at home; then there had been for a moment a whispering behind a door,--in which he afterwards conceived that Madame Didon had taken a part;--and upon that a second tall footman had contradicted the first and had ushered him up to the drawing-room. He felt considerably embarrassed, but shook hands with the ladies, bowed to Melmotte, who seemed to take no notice of him, and nodded to Lord Nidderdale. He had not had time to place himself, when the Marquis arranged things. \"Suppose we go down-stairs,\" said the Marquis.\n\"Certainly, my lord,\" said Melmotte. \"I'll show your lordship the way.\" The Marquis did not speak to his son, but poked at him with his stick, as though poking him out of the door. So instigated Nidderdale followed the financier, and the gouty old Marquis toddled after them.\nMadame Melmotte was beside herself with trepidation. \"You should not have been made to come up at all,\" she said. \"Il faut que vous vous retirez.\"\n\"I am very sorry,\" said Sir Felix, looking quite aghast.\n\"I think that I had at any rate better retire,\" said Miss Longestaffe, raising herself to her full height and stalking out of the room.\n\"Qu'elle est mchante,\" said Madame Melmotte. \"Oh, she is so bad. Sir Felix, you had better go too. Yes,--indeed.\"\n\"No,\" said Marie, running to him, and taking hold of his arm. \"Why should he go? I want papa to know.\"\n\"Il vous tuera,\" said Madame Melmotte. \"My God, yes.\"\n\"Then he shall,\" said Marie, clinging to her lover. \"I will never marry Lord Nidderdale. If he were to cut me into bits I wouldn't do it. Felix, you love me;--do you not?\"\n\"Certainly,\" said Sir Felix, slipping his arm round her waist.\n\"Mamma,\" said Marie, \"I will never have any other man but him;--never, never, never. Oh, Felix, tell her that you love me.\"\n\"You know that, don't you, ma'am?\" Sir Felix was a little troubled in his mind as to what he should say, or what he should do.\n\"Oh, love! It is a beastliness,\" said Madame Melmotte. \"Sir Felix, you had better go. Yes, indeed. Will you be so obliging?\"\n\"Don't go,\" said Marie. \"No, mamma, he shan't go. What has he to be afraid of? I will walk down among them into papa's room, and say that I will never marry that man, and that this is my lover. Felix, will you come?\"\nSir Felix did not quite like the proposition. There had been a savage ferocity in that Marquis's eye, and there was habitually a heavy sternness about Melmotte, which together made him resist the invitation. \"I don't think I have a right to do that,\" he said, \"because it is Mr. Melmotte's own house.\"\n\"I wouldn't mind,\" said Marie. \"I told papa to-day that I wouldn't marry Lord Nidderdale.\"\n\"Was he angry with you?\"\n\"He laughed at me. He manages people till he thinks that everybody must do exactly what he tells them. He may kill me, but I will not do it. I have quite made up my mind. Felix, if you will be true to me, nothing shall separate us. I will not be ashamed to tell everybody that I love you.\"\nMadame Melmotte had now thrown herself into a chair and was sighing. Sir Felix stood on the rug with his arm round Marie's waist, listening to her protestations, but saying little in answer to them,--when, suddenly, a heavy step was heard ascending the stairs. \"C'est lui,\" screamed Madame Melmotte, bustling up from her seat and hurrying out of the room by a side door. The two lovers were alone for one moment, during which Marie lifted up her face, and Sir Felix kissed her lips. \"Now be brave,\" she said, escaping from his arm, \"and I'll be brave.\" Mr. Melmotte looked round the room as he entered. \"Where are the others?\" he asked.\n\"Mamma has gone away, and Miss Longestaffe went before mamma.\"\n\"Sir Felix, it is well that I should tell you that my daughter is engaged to marry Lord Nidderdale.\"\n\"Sir Felix, I am not engaged--to--marry Lord Nidderdale,\" said Marie. \"It's no good, papa. I won't do it. If you chop me to pieces, I won't do it.\"\n\"She will marry Lord Nidderdale,\" continued Mr. Melmotte, addressing himself to Sir Felix. \"As that is arranged, you will perhaps think it better to leave us. I shall be happy to renew my acquaintance with you as soon as the fact is recognised;--or happy to see you in the city at any time.\"\n\"Papa, he is my lover,\" said Marie.\n\"Pooh!\"\n\"It is not pooh. He is. I will never have any other. I hate Lord Nidderdale; and as for that dreadful old man, I could not bear to look at him. Sir Felix is as good a gentleman as he is. If you loved me, papa, you would not want to make me unhappy all my life.\"\nHer father walked up to her rapidly with his hand raised, and she clung only the closer to her lover's arm. At this moment Sir Felix did not know what he might best do, but he thoroughly wished himself out in the square. \"Jade!\" said Melmotte, \"get to your room.\"\n[Illustration: \"Get to your room.\"]\n\"Of course I will go to bed, if you tell me, papa.\"\n\"I do tell you. How dare you take hold of him in that way before me! Have you no idea of disgrace?\"\n\"I am not disgraced. It is not more disgraceful to love him than that other man. Oh, papa, don't. You hurt me. I am going.\" He took her by the arm and dragged her to the door, and then thrust her out.\n\"I am very sorry, Mr. Melmotte,\" said Sir Felix, \"to have had a hand in causing this disturbance.\"\n\"Go away, and don't come back any more;--that's all. You can't both marry her. All you have got to understand is this. I'm not the man to give my daughter a single shilling if she marries against my consent. By the God that hears me, Sir Felix, she shall not have one shilling. But look you,--if you'll give this up, I shall be proud to co-operate with you in anything you may wish to have done in the city.\"\nAfter this Sir Felix left the room, went down the stairs, had the door opened for him, and was ushered into the square. But as he went through the hall a woman managed to shove a note into his hand,--which he read as soon as he found himself under a gas lamp. It was dated that morning, and had therefore no reference to the fray which had just taken place. It ran as follows:--\nI hope you will come to-night. There is something I cannot tell you then, but you ought to know it. When we were in France papa thought it wise to settle a lot of money on me. I don't know how much, but I suppose it was enough to live on if other things went wrong. He never talked to me about it, but I know it was done. And it hasn't been undone, and can't be without my leave. He is very angry about you this morning, for I told him I would never give you up. He says he won't give me anything if I marry without his leave. But I am sure he cannot take it away. I tell you, because I think I ought to tell you everything.\nM.\nSir Felix as he read this could not but think that he had become engaged to a very enterprising young lady. It was evident that she did not care to what extent she braved her father on behalf of her lover, and now she coolly proposed to rob him. But Sir Felix saw no reason why he should not take advantage of the money made over to the girl's name, if he could lay his hands on it. He did not know much of such transactions, but he knew more than Marie Melmotte, and could understand that a man in Melmotte's position should want to secure a portion of his fortune against accidents, by settling it on his daughter. Whether having so settled it, he could again resume it without the daughter's assent, Sir Felix did not know. Marie, who had no doubt been regarded as an absolutely passive instrument when the thing was done, was now quite alive to the benefit which she might possibly derive from it. Her proposition, put into plain English, amounted to this: \"Take me and marry me without my father's consent,--and then you and I together can rob my father of the money which, for his own purposes, he has settled upon me.\" He had looked upon the lady of his choice as a poor weak thing, without any special character of her own, who was made worthy of consideration only by the fact that she was a rich man's daughter; but now she began to loom before his eyes as something bigger than that. She had had a will of her own when the mother had none. She had not been afraid of her brutal father when he, Sir Felix, had trembled before him. She had offered to be beaten, and killed, and chopped to pieces on behalf of her lover. There could be no doubt about her running away if she were asked.\nIt seemed to him that within the last month he had gained a great deal of experience, and that things which heretofore had been troublesome to him, or difficult, or perhaps impossible, were now coming easily within his reach. He had won two or three thousand pounds at cards, whereas invariable loss had been the result of the small play in which he had before indulged. He had been set to marry this heiress, having at first no great liking for the attempt, because of its difficulties and the small amount of hope which it offered him. The girl was already willing and anxious to jump into his arms. Then he had detected a man cheating at cards,--an extent of iniquity that was awful to him before he had seen it,--and was already beginning to think that there was not very much in that. If there was not much in it, if such a man as Miles Grendall could cheat at cards and be brought to no punishment, why should not he try it? It was a rapid way of winning, no doubt. He remembered that on one or two occasions he had asked his adversary to cut the cards a second time at whist, because he had observed that there was no honour at the bottom. No feeling of honesty had interfered with him. The little trick had hardly been premeditated, but when successful without detection had not troubled his conscience. Now it seemed to him that much more than that might be done without detection. But nothing had opened his eyes to the ways of the world so widely as the sweet little lover-like proposition made by Miss Melmotte for robbing her father. It certainly recommended the girl to him. She had been able at an early age, amidst the circumstances of a very secluded life, to throw off from her altogether those scruples of honesty, those bugbears of the world, which are apt to prevent great enterprises in the minds of men.\nWhat should he do next? This sum of money of which Marie wrote so easily was probably large. It would not have been worth the while of such a man as Mr. Melmotte to make a trifling provision of this nature. It could hardly be less than 50,000,--might probably be very much more. But this was certain to him,--that if he and Marie were to claim this money as man and wife, there could then be no hope of further liberality. It was not probable that such a man as Mr. Melmotte would forgive even an only child such an offence as that. Even if it were obtained, 50,000 would not be very much. And Melmotte might probably have means, even if the robbery were duly perpetrated, of making the possession of the money very uncomfortable. These were deep waters into which Sir Felix was preparing to plunge; and he did not feel himself to be altogether comfortable, although he liked the deep waters.",
        "paragraph_chars": [
            [
                0,
                191
            ],
            [
                191,
                224
            ],
            [
                224,
                322
            ],
            [
                322,
                366
            ],
            [
                366,
                465
            ],
            [
                465,
                498
            ],
            [
                498,
                547
            ],
            [
                547,
                1632
            ],
            [
                1632,
                1747
            ],
            [
                1747,
                2085
            ],
            [
                2085,
                2141
            ],
            [
                2141,
                2515
            ],
            [
                2515,
                2697
            ],
            [
                2697,
                2738
            ],
            [
                2738,
                2825
            ],
            [
                2825,
                3042
            ],
            [
                3042,
                3067
            ],
            [
                3067,
                3251
            ],
            [
                3251,
                4239
            ],
            [
                4239,
                5363
            ],
            [
                5363,
                5639
            ],
            [
                5639,
                5786
            ],
            [
                5786,
                5843
            ],
            [
                5843,
                5979
            ],
            [
                5979,
                6093
            ],
            [
                6093,
                6196
            ],
            [
                6196,
                6250
            ],
            [
                6250,
                6422
            ],
            [
                6422,
                6485
            ],
            [
                6485,
                6609
            ],
            [
                6609,
                6736
            ],
            [
                6736,
                6861
            ],
            [
                6861,
                7078
            ],
            [
                7078,
                7380
            ],
            [
                7380,
                7471
            ],
            [
                7471,
                7496
            ],
            [
                7496,
                7786
            ],
            [
                7786,
                8423
            ],
            [
                8423,
                8486
            ],
            [
                8486,
                8587
            ],
            [
                8587,
                8735
            ],
            [
                8735,
                9027
            ],
            [
                9027,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9333
            ],
            [
                9333,
                9597
            ],
            [
                9597,
                9633
            ],
            [
                9633,
                9685
            ],
            [
                9685,
                9785
            ],
            [
                9785,
                9986
            ],
            [
                9986,
                10085
            ],
            [
                10085,
                10494
            ],
            [
                10494,
                10873
            ],
            [
                10873,
                11498
            ],
            [
                11498,
                11501
            ],
            [
                11501,
                13196
            ],
            [
                13196,
                15023
            ],
            [
                15023,
                15915
            ]
        ],
        "segment_chars": [
            [
                0,
                143
            ],
            [
                143,
                191
            ],
            [
                191,
                224
            ],
            [
                224,
                251
            ],
            [
                251,
                292
            ],
            [
                292,
                322
            ],
            [
                322,
                366
            ],
            [
                366,
                417
            ],
            [
                417,
                465
            ],
            [
                465,
                498
            ],
            [
                498,
                518
            ],
            [
                518,
                547
            ],
            [
                547,
                597
            ],
            [
                597,
                613
            ],
            [
                613,
                692
            ],
            [
                692,
                745
            ],
            [
                745,
                818
            ],
            [
                818,
                876
            ],
            [
                876,
                963
            ],
            [
                963,
                1195
            ],
            [
                1195,
                1248
            ],
            [
                1248,
                1291
            ],
            [
                1291,
                1486
            ],
            [
                1486,
                1540
            ],
            [
                1540,
                1587
            ],
            [
                1587,
                1632
            ],
            [
                1632,
                1684
            ],
            [
                1684,
                1698
            ],
            [
                1698,
                1719
            ],
            [
                1719,
                1747
            ],
            [
                1747,
                1784
            ],
            [
                1784,
                1864
            ],
            [
                1864,
                1930
            ],
            [
                1930,
                2085
            ],
            [
                2085,
                2122
            ],
            [
                2122,
                2141
            ],
            [
                2141,
                2176
            ],
            [
                2176,
                2215
            ],
            [
                2215,
                2294
            ],
            [
                2294,
                2343
            ],
            [
                2343,
                2391
            ],
            [
                2391,
                2437
            ],
            [
                2437,
                2490
            ],
            [
                2490,
                2515
            ],
            [
                2515,
                2653
            ],
            [
                2653,
                2697
            ],
            [
                2697,
                2738
            ],
            [
                2738,
                2825
            ],
            [
                2825,
                2838
            ],
            [
                2838,
                2870
            ],
            [
                2870,
                2964
            ],
            [
                2964,
                2986
            ],
            [
                2986,
                3042
            ],
            [
                3042,
                3067
            ],
            [
                3067,
                3122
            ],
            [
                3122,
                3166
            ],
            [
                3166,
                3201
            ],
            [
                3201,
                3251
            ],
            [
                3251,
                3299
            ],
            [
                3299,
                3383
            ],
            [
                3383,
                3443
            ],
            [
                3443,
                3604
            ],
            [
                3604,
                3763
            ],
            [
                3763,
                3867
            ],
            [
                3867,
                3895
            ],
            [
                3895,
                3976
            ],
            [
                3976,
                4021
            ],
            [
                4021,
                4056
            ],
            [
                4056,
                4125
            ],
            [
                4125,
                4239
            ],
            [
                4239,
                4364
            ],
            [
                4364,
                4507
            ],
            [
                4507,
                4606
            ],
            [
                4606,
                4691
            ],
            [
                4691,
                4761
            ],
            [
                4761,
                5090
            ],
            [
                5090,
                5244
            ],
            [
                5244,
                5316
            ],
            [
                5316,
                5363
            ],
            [
                5363,
                5400
            ],
            [
                5400,
                5435
            ],
            [
                5435,
                5544
            ],
            [
                5544,
                5639
            ],
            [
                5639,
                5692
            ],
            [
                5692,
                5753
            ],
            [
                5753,
                5786
            ],
            [
                5786,
                5843
            ],
            [
                5843,
                5979
            ],
            [
                5979,
                6024
            ],
            [
                6024,
                6044
            ],
            [
                6044,
                6078
            ],
            [
                6078,
                6093
            ],
            [
                6093,
                6155
            ],
            [
                6155,
                6174
            ],
            [
                6174,
                6196
            ],
            [
                6196,
                6235
            ],
            [
                6235,
                6250
            ],
            [
                6250,
                6302
            ],
            [
                6302,
                6339
            ],
            [
                6339,
                6388
            ],
            [
                6388,
                6422
            ],
            [
                6422,
                6485
            ],
            [
                6485,
                6570
            ],
            [
                6570,
                6609
            ],
            [
                6609,
                6644
            ],
            [
                6644,
                6736
            ],
            [
                6736,
                6747
            ],
            [
                6747,
                6791
            ],
            [
                6791,
                6822
            ],
            [
                6822,
                6835
            ],
            [
                6835,
                6861
            ],
            [
                6861,
                6885
            ],
            [
                6885,
                6911
            ],
            [
                6911,
                6940
            ],
            [
                6940,
                7055
            ],
            [
                7055,
                7078
            ],
            [
                7078,
                7124
            ],
            [
                7124,
                7286
            ],
            [
                7286,
                7380
            ],
            [
                7380,
                7411
            ],
            [
                7411,
                7471
            ],
            [
                7471,
                7496
            ],
            [
                7496,
                7515
            ],
            [
                7515,
                7599
            ],
            [
                7599,
                7637
            ],
            [
                7637,
                7667
            ],
            [
                7667,
                7728
            ],
            [
                7728,
                7786
            ],
            [
                7786,
                7855
            ],
            [
                7855,
                8047
            ],
            [
                8047,
                8157
            ],
            [
                8157,
                8269
            ],
            [
                8269,
                8339
            ],
            [
                8339,
                8389
            ],
            [
                8389,
                8413
            ],
            [
                8413,
                8423
            ],
            [
                8423,
                8486
            ],
            [
                8486,
                8587
            ],
            [
                8587,
                8657
            ],
            [
                8657,
                8678
            ],
            [
                8678,
                8693
            ],
            [
                8693,
                8735
            ],
            [
                8735,
                8826
            ],
            [
                8826,
                8894
            ],
            [
                8894,
                9027
            ],
            [
                9027,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9088
            ],
            [
                9088,
                9095
            ],
            [
                9095,
                9124
            ],
            [
                9124,
                9215
            ],
            [
                9215,
                9258
            ],
            [
                9258,
                9333
            ],
            [
                9333,
                9441
            ],
            [
                9441,
                9554
            ],
            [
                9554,
                9562
            ],
            [
                9562,
                9597
            ],
            [
                9597,
                9633
            ],
            [
                9633,
                9685
            ],
            [
                9685,
                9701
            ],
            [
                9701,
                9754
            ],
            [
                9754,
                9785
            ],
            [
                9785,
                9806
            ],
            [
                9806,
                9866
            ],
            [
                9866,
                9883
            ],
            [
                9883,
                9896
            ],
            [
                9896,
                9909
            ],
            [
                9909,
                9986
            ],
            [
                9986,
                10085
            ],
            [
                10085,
                10138
            ],
            [
                10138,
                10164
            ],
            [
                10164,
                10204
            ],
            [
                10204,
                10293
            ],
            [
                10293,
                10363
            ],
            [
                10363,
                10494
            ],
            [
                10494,
                10614
            ],
            [
                10614,
                10754
            ],
            [
                10754,
                10852
            ],
            [
                10852,
                10873
            ],
            [
                10873,
                10904
            ],
            [
                10904,
                10973
            ],
            [
                10973,
                11049
            ],
            [
                11049,
                11139
            ],
            [
                11139,
                11195
            ],
            [
                11195,
                11253
            ],
            [
                11253,
                11336
            ],
            [
                11336,
                11400
            ],
            [
                11400,
                11438
            ],
            [
                11438,
                11498
            ],
            [
                11498,
                11501
            ],
            [
                11501,
                11609
            ],
            [
                11609,
                11747
            ],
            [
                11747,
                11884
            ],
            [
                11884,
                12118
            ],
            [
                12118,
                12228
            ],
            [
                12228,
                12403
            ],
            [
                12403,
                12627
            ],
            [
                12627,
                12896
            ],
            [
                12896,
                12952
            ],
            [
                12952,
                13042
            ],
            [
                13042,
                13130
            ],
            [
                13130,
                13196
            ],
            [
                13196,
                13422
            ],
            [
                13422,
                13567
            ],
            [
                13567,
                13734
            ],
            [
                13734,
                13798
            ],
            [
                13798,
                13986
            ],
            [
                13986,
                14127
            ],
            [
                14127,
                14168
            ],
            [
                14168,
                14343
            ],
            [
                14343,
                14390
            ],
            [
                14390,
                14508
            ],
            [
                14508,
                14587
            ],
            [
                14587,
                14743
            ],
            [
                14743,
                14785
            ],
            [
                14785,
                15023
            ],
            [
                15023,
                15047
            ],
            [
                15047,
                15116
            ],
            [
                15116,
                15230
            ],
            [
                15230,
                15302
            ],
            [
                15302,
                15446
            ],
            [
                15446,
                15556
            ],
            [
                15556,
                15613
            ],
            [
                15613,
                15754
            ],
            [
                15754,
                15915
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                30,
                48
            ],
            [
                74,
                88
            ],
            [
                88,
                89
            ],
            [
                94,
                142
            ],
            [
                143,
                191
            ],
            [
                191,
                204
            ],
            [
                218,
                224
            ],
            [
                224,
                228
            ],
            [
                231,
                251
            ],
            [
                251,
                292
            ],
            [
                302,
                322
            ],
            [
                465,
                486
            ],
            [
                495,
                498
            ],
            [
                498,
                518
            ],
            [
                518,
                533
            ],
            [
                544,
                547
            ],
            [
                547,
                597
            ],
            [
                597,
                613
            ],
            [
                613,
                692
            ],
            [
                745,
                817
            ],
            [
                818,
                836
            ],
            [
                874,
                876
            ],
            [
                876,
                923
            ],
            [
                930,
                932
            ],
            [
                961,
                963
            ],
            [
                963,
                981
            ],
            [
                1034,
                1045
            ],
            [
                1000,
                1006
            ],
            [
                1049,
                1062
            ],
            [
                1064,
                1130
            ],
            [
                1183,
                1187
            ],
            [
                1144,
                1154
            ],
            [
                1236,
                1238
            ],
            [
                1193,
                1194
            ],
            [
                1248,
                1272
            ],
            [
                1278,
                1280
            ],
            [
                1273,
                1277
            ],
            [
                1281,
                1291
            ],
            [
                1291,
                1313
            ],
            [
                1317,
                1422
            ],
            [
                1465,
                1486
            ],
            [
                1486,
                1525
            ],
            [
                1532,
                1539
            ],
            [
                1540,
                1568
            ],
            [
                1585,
                1587
            ],
            [
                1587,
                1632
            ],
            [
                1632,
                1633
            ],
            [
                1656,
                1684
            ],
            [
                1684,
                1698
            ],
            [
                1698,
                1719
            ],
            [
                1719,
                1747
            ],
            [
                1747,
                1784
            ],
            [
                1784,
                1798
            ],
            [
                1814,
                1823
            ],
            [
                1824,
                1830
            ],
            [
                1851,
                1864
            ],
            [
                1930,
                2085
            ],
            [
                2085,
                2122
            ],
            [
                2122,
                2141
            ],
            [
                2141,
                2176
            ],
            [
                2176,
                2215
            ],
            [
                2234,
                2238
            ],
            [
                2220,
                2233
            ],
            [
                2239,
                2259
            ],
            [
                2263,
                2277
            ],
            [
                2292,
                2294
            ],
            [
                2294,
                2332
            ],
            [
                2341,
                2343
            ],
            [
                2343,
                2391
            ],
            [
                2391,
                2437
            ],
            [
                2437,
                2488
            ],
            [
                2515,
                2583
            ],
            [
                2604,
                2639
            ],
            [
                2651,
                2653
            ],
            [
                2697,
                2698
            ],
            [
                2769,
                2775
            ],
            [
                2776,
                2778
            ],
            [
                2718,
                2723
            ],
            [
                2794,
                2825
            ],
            [
                2825,
                2838
            ],
            [
                2838,
                2870
            ],
            [
                2870,
                2903
            ],
            [
                2912,
                2964
            ],
            [
                2986,
                2996
            ],
            [
                3008,
                3035
            ],
            [
                3087,
                3122
            ],
            [
                3122,
                3166
            ],
            [
                3166,
                3183
            ],
            [
                3251,
                3275
            ],
            [
                3297,
                3299
            ],
            [
                3383,
                3420
            ],
            [
                3425,
                3443
            ],
            [
                3443,
                3449
            ],
            [
                3450,
                3455
            ],
            [
                3480,
                3513
            ],
            [
                3525,
                3529
            ],
            [
                3552,
                3554
            ],
            [
                3533,
                3538
            ],
            [
                3561,
                3566
            ],
            [
                3514,
                3517
            ],
            [
                3567,
                3572
            ],
            [
                3602,
                3604
            ],
            [
                3604,
                3641
            ],
            [
                3650,
                3670
            ],
            [
                3761,
                3763
            ],
            [
                3763,
                3783
            ],
            [
                3806,
                3807
            ],
            [
                3867,
                3895
            ],
            [
                3895,
                3976
            ],
            [
                4021,
                4056
            ],
            [
                4056,
                4100
            ],
            [
                4115,
                4125
            ],
            [
                4167,
                4185
            ],
            [
                4203,
                4209
            ],
            [
                4154,
                4160
            ],
            [
                4143,
                4153
            ],
            [
                4201,
                4202
            ],
            [
                4237,
                4239
            ],
            [
                4239,
                4308
            ],
            [
                4310,
                4364
            ],
            [
                4364,
                4395
            ],
            [
                4400,
                4403
            ],
            [
                4419,
                4454
            ],
            [
                4514,
                4589
            ],
            [
                4604,
                4606
            ],
            [
                4691,
                4761
            ],
            [
                5128,
                5243
            ],
            [
                5287,
                5290
            ],
            [
                5291,
                5298
            ],
            [
                5345,
                5349
            ],
            [
                5280,
                5281
            ],
            [
                5316,
                5330
            ],
            [
                5363,
                5400
            ],
            [
                5400,
                5435
            ],
            [
                5435,
                5446
            ],
            [
                5477,
                5485
            ],
            [
                5464,
                5471
            ],
            [
                5490,
                5504
            ],
            [
                5558,
                5577
            ],
            [
                5593,
                5639
            ],
            [
                5639,
                5678
            ],
            [
                5690,
                5692
            ],
            [
                5692,
                5717
            ],
            [
                5740,
                5753
            ],
            [
                5753,
                5754
            ],
            [
                5783,
                5786
            ],
            [
                5786,
                5820
            ],
            [
                5829,
                5843
            ],
            [
                5843,
                5862
            ],
            [
                5875,
                5913
            ],
            [
                5953,
                5979
            ],
            [
                6024,
                6042
            ],
            [
                5999,
                6023
            ],
            [
                6044,
                6076
            ],
            [
                6093,
                6155
            ],
            [
                6155,
                6174
            ],
            [
                6174,
                6196
            ],
            [
                6196,
                6197
            ],
            [
                6210,
                6235
            ],
            [
                6235,
                6250
            ],
            [
                6250,
                6302
            ],
            [
                6302,
                6339
            ],
            [
                6388,
                6406
            ],
            [
                6409,
                6422
            ],
            [
                6422,
                6485
            ],
            [
                6485,
                6547
            ],
            [
                6549,
                6570
            ],
            [
                6577,
                6609
            ],
            [
                6609,
                6644
            ],
            [
                6644,
                6675
            ],
            [
                6688,
                6712
            ],
            [
                6714,
                6716
            ],
            [
                6732,
                6736
            ],
            [
                6736,
                6747
            ],
            [
                6747,
                6791
            ],
            [
                6791,
                6820
            ],
            [
                6861,
                6885
            ],
            [
                6885,
                6895
            ],
            [
                6909,
                6911
            ],
            [
                6940,
                6956
            ],
            [
                6968,
                7055
            ],
            [
                7055,
                7078
            ],
            [
                7078,
                7124
            ],
            [
                7124,
                7183
            ],
            [
                7205,
                7206
            ],
            [
                7213,
                7244
            ],
            [
                7254,
                7262
            ],
            [
                7284,
                7286
            ],
            [
                7286,
                7380
            ],
            [
                7380,
                7411
            ],
            [
                7411,
                7423
            ],
            [
                7431,
                7471
            ],
            [
                7471,
                7484
            ],
            [
                7493,
                7496
            ],
            [
                7496,
                7515
            ],
            [
                7538,
                7599
            ],
            [
                7599,
                7637
            ],
            [
                7667,
                7728
            ],
            [
                7728,
                7786
            ],
            [
                7786,
                7805
            ],
            [
                7810,
                7837
            ],
            [
                7846,
                7855
            ],
            [
                7855,
                7870
            ],
            [
                7882,
                7925
            ],
            [
                7986,
                7990
            ],
            [
                8002,
                8046
            ],
            [
                8047,
                8097
            ],
            [
                8112,
                8157
            ],
            [
                8157,
                8268
            ],
            [
                8269,
                8338
            ],
            [
                8339,
                8389
            ],
            [
                8389,
                8413
            ],
            [
                8413,
                8423
            ],
            [
                8423,
                8424
            ],
            [
                8434,
                8443
            ],
            [
                8483,
                8486
            ],
            [
                8486,
                8497
            ],
            [
                8514,
                8515
            ],
            [
                8523,
                8587
            ],
            [
                8587,
                8615
            ],
            [
                8617,
                8619
            ],
            [
                8627,
                8657
            ],
            [
                8657,
                8678
            ],
            [
                8678,
                8691
            ],
            [
                8717,
                8718
            ],
            [
                8693,
                8717
            ],
            [
                8732,
                8735
            ],
            [
                8735,
                8803
            ],
            [
                8815,
                8826
            ],
            [
                8826,
                8894
            ],
            [
                8894,
                8904
            ],
            [
                8984,
                9027
            ],
            [
                9027,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9088
            ],
            [
                9095,
                9124
            ],
            [
                9124,
                9215
            ],
            [
                9215,
                9258
            ],
            [
                9258,
                9333
            ],
            [
                9333,
                9404
            ],
            [
                9414,
                9441
            ],
            [
                9460,
                9465
            ],
            [
                9520,
                9553
            ],
            [
                9554,
                9562
            ],
            [
                9562,
                9578
            ],
            [
                9582,
                9597
            ],
            [
                9633,
                9643
            ],
            [
                9660,
                9685
            ],
            [
                9685,
                9701
            ],
            [
                9701,
                9738
            ],
            [
                9739,
                9742
            ],
            [
                9806,
                9866
            ],
            [
                9866,
                9883
            ],
            [
                9883,
                9896
            ],
            [
                9896,
                9909
            ],
            [
                9909,
                9986
            ],
            [
                9986,
                10085
            ],
            [
                10085,
                10124
            ],
            [
                10126,
                10138
            ],
            [
                10184,
                10194
            ],
            [
                10198,
                10204
            ],
            [
                10204,
                10205
            ],
            [
                10223,
                10293
            ],
            [
                10293,
                10295
            ],
            [
                10300,
                10303
            ],
            [
                10317,
                10363
            ],
            [
                10363,
                10375
            ],
            [
                10378,
                10494
            ],
            [
                10509,
                10514
            ],
            [
                10530,
                10534
            ],
            [
                10581,
                10596
            ],
            [
                10597,
                10614
            ],
            [
                10614,
                10691
            ],
            [
                10752,
                10753
            ],
            [
                10754,
                10784
            ],
            [
                10855,
                10870
            ],
            [
                10904,
                10922
            ],
            [
                10951,
                10968
            ],
            [
                10971,
                10973
            ],
            [
                10973,
                11049
            ],
            [
                11049,
                11139
            ],
            [
                11139,
                11193
            ],
            [
                11220,
                11225
            ],
            [
                11199,
                11201
            ],
            [
                11226,
                11234
            ],
            [
                11214,
                11220
            ],
            [
                11235,
                11253
            ],
            [
                11336,
                11400
            ],
            [
                11400,
                11437
            ],
            [
                11498,
                11501
            ],
            [
                11501,
                11510
            ],
            [
                11547,
                11609
            ],
            [
                11661,
                11747
            ],
            [
                11747,
                11849
            ],
            [
                11882,
                11883
            ],
            [
                11884,
                11886
            ],
            [
                11969,
                12041
            ],
            [
                12052,
                12118
            ],
            [
                12118,
                12156
            ],
            [
                12170,
                12172
            ],
            [
                12173,
                12228
            ],
            [
                12228,
                12233
            ],
            [
                12239,
                12268
            ],
            [
                12283,
                12326
            ],
            [
                12327,
                12334
            ],
            [
                12350,
                12377
            ],
            [
                12387,
                12403
            ],
            [
                12403,
                12418
            ],
            [
                12444,
                12463
            ],
            [
                12481,
                12512
            ],
            [
                12471,
                12474
            ],
            [
                12533,
                12541
            ],
            [
                12542,
                12626
            ],
            [
                12627,
                12645
            ],
            [
                12724,
                12727
            ],
            [
                12669,
                12689
            ],
            [
                12821,
                12896
            ],
            [
                12896,
                12899
            ],
            [
                12904,
                12925
            ],
            [
                12950,
                12952
            ],
            [
                12952,
                13029
            ],
            [
                13040,
                13042
            ],
            [
                13042,
                13130
            ],
            [
                13130,
                13153
            ],
            [
                13172,
                13196
            ],
            [
                13196,
                13217
            ],
            [
                13291,
                13303
            ],
            [
                13315,
                13335
            ],
            [
                13344,
                13356
            ],
            [
                13381,
                13422
            ],
            [
                13422,
                13470
            ],
            [
                13565,
                13567
            ],
            [
                13567,
                13605
            ],
            [
                13683,
                13686
            ],
            [
                13734,
                13746
            ],
            [
                13755,
                13798
            ],
            [
                14015,
                14100
            ],
            [
                14512,
                14586
            ],
            [
                14587,
                14743
            ],
            [
                14743,
                14785
            ],
            [
                14785,
                14802
            ],
            [
                14870,
                14882
            ],
            [
                14892,
                14928
            ],
            [
                14959,
                15001
            ],
            [
                15021,
                15023
            ],
            [
                15023,
                15047
            ],
            [
                15047,
                15085
            ],
            [
                15096,
                15116
            ],
            [
                15116,
                15144
            ],
            [
                15149,
                15154
            ],
            [
                15185,
                15194
            ],
            [
                15204,
                15216
            ],
            [
                15249,
                15265
            ],
            [
                15274,
                15282
            ],
            [
                15286,
                15302
            ],
            [
                15302,
                15322
            ],
            [
                15337,
                15360
            ],
            [
                15393,
                15425
            ],
            [
                15372,
                15377
            ],
            [
                15332,
                15336
            ],
            [
                15444,
                15446
            ],
            [
                15580,
                15613
            ],
            [
                15613,
                15625
            ],
            [
                15632,
                15651
            ],
            [
                15696,
                15754
            ],
            [
                15754,
                15829
            ],
            [
                15914,
                15915
            ]
        ],
        "row_chars": [
            [
                0,
                143
            ],
            [
                143,
                191
            ],
            [
                191,
                224
            ],
            [
                224,
                251
            ],
            [
                251,
                292
            ],
            [
                292,
                322
            ],
            [
                322,
                366
            ],
            [
                366,
                417
            ],
            [
                417,
                465
            ],
            [
                465,
                498
            ],
            [
                498,
                518
            ],
            [
                518,
                547
            ],
            [
                547,
                597
            ],
            [
                597,
                613
            ],
            [
                613,
                692
            ],
            [
                692,
                745
            ],
            [
                745,
                818
            ],
            [
                818,
                876
            ],
            [
                876,
                963
            ],
            [
                963,
                1248
            ],
            [
                1248,
                1291
            ],
            [
                1291,
                1486
            ],
            [
                1486,
                1540
            ],
            [
                1540,
                1587
            ],
            [
                1587,
                1632
            ],
            [
                1632,
                1684
            ],
            [
                1684,
                1698
            ],
            [
                1698,
                1719
            ],
            [
                1719,
                1747
            ],
            [
                1747,
                1784
            ],
            [
                1784,
                1864
            ],
            [
                1864,
                1930
            ],
            [
                1930,
                2085
            ],
            [
                2085,
                2122
            ],
            [
                2122,
                2141
            ],
            [
                2141,
                2176
            ],
            [
                2176,
                2215
            ],
            [
                2215,
                2294
            ],
            [
                2294,
                2343
            ],
            [
                2343,
                2391
            ],
            [
                2391,
                2437
            ],
            [
                2437,
                2490
            ],
            [
                2490,
                2515
            ],
            [
                2515,
                2653
            ],
            [
                2653,
                2697
            ],
            [
                2697,
                2825
            ],
            [
                2825,
                2838
            ],
            [
                2838,
                2870
            ],
            [
                2870,
                2964
            ],
            [
                2964,
                2986
            ],
            [
                2986,
                3122
            ],
            [
                3122,
                3166
            ],
            [
                3166,
                3201
            ],
            [
                3201,
                3251
            ],
            [
                3251,
                3299
            ],
            [
                3299,
                3383
            ],
            [
                3383,
                3443
            ],
            [
                3443,
                3604
            ],
            [
                3604,
                3763
            ],
            [
                3763,
                3895
            ],
            [
                3895,
                3976
            ],
            [
                3976,
                4021
            ],
            [
                4021,
                4056
            ],
            [
                4056,
                4125
            ],
            [
                4125,
                4239
            ],
            [
                4239,
                4364
            ],
            [
                4364,
                4606
            ],
            [
                4606,
                4691
            ],
            [
                4691,
                4761
            ],
            [
                4761,
                5090
            ],
            [
                5090,
                5244
            ],
            [
                5244,
                5363
            ],
            [
                5363,
                5400
            ],
            [
                5400,
                5435
            ],
            [
                5435,
                5639
            ],
            [
                5639,
                5692
            ],
            [
                5692,
                5753
            ],
            [
                5753,
                5786
            ],
            [
                5786,
                5843
            ],
            [
                5843,
                5979
            ],
            [
                5979,
                6044
            ],
            [
                6044,
                6078
            ],
            [
                6078,
                6093
            ],
            [
                6093,
                6155
            ],
            [
                6155,
                6174
            ],
            [
                6174,
                6196
            ],
            [
                6196,
                6235
            ],
            [
                6235,
                6250
            ],
            [
                6250,
                6302
            ],
            [
                6302,
                6339
            ],
            [
                6339,
                6388
            ],
            [
                6388,
                6422
            ],
            [
                6422,
                6485
            ],
            [
                6485,
                6570
            ],
            [
                6570,
                6609
            ],
            [
                6609,
                6644
            ],
            [
                6644,
                6736
            ],
            [
                6736,
                6747
            ],
            [
                6747,
                6791
            ],
            [
                6791,
                6822
            ],
            [
                6822,
                6835
            ],
            [
                6835,
                6861
            ],
            [
                6861,
                6885
            ],
            [
                6885,
                6911
            ],
            [
                6911,
                6940
            ],
            [
                6940,
                7055
            ],
            [
                7055,
                7078
            ],
            [
                7078,
                7124
            ],
            [
                7124,
                7286
            ],
            [
                7286,
                7380
            ],
            [
                7380,
                7411
            ],
            [
                7411,
                7471
            ],
            [
                7471,
                7496
            ],
            [
                7496,
                7515
            ],
            [
                7515,
                7599
            ],
            [
                7599,
                7637
            ],
            [
                7637,
                7667
            ],
            [
                7667,
                7728
            ],
            [
                7728,
                7786
            ],
            [
                7786,
                7855
            ],
            [
                7855,
                8047
            ],
            [
                8047,
                8157
            ],
            [
                8157,
                8269
            ],
            [
                8269,
                8339
            ],
            [
                8339,
                8389
            ],
            [
                8389,
                8413
            ],
            [
                8413,
                8423
            ],
            [
                8423,
                8486
            ],
            [
                8486,
                8587
            ],
            [
                8587,
                8657
            ],
            [
                8657,
                8678
            ],
            [
                8678,
                8735
            ],
            [
                8735,
                8826
            ],
            [
                8826,
                8894
            ],
            [
                8894,
                9027
            ],
            [
                9027,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9088
            ],
            [
                9088,
                9095
            ],
            [
                9095,
                9124
            ],
            [
                9124,
                9215
            ],
            [
                9215,
                9258
            ],
            [
                9258,
                9333
            ],
            [
                9333,
                9441
            ],
            [
                9441,
                9554
            ],
            [
                9554,
                9562
            ],
            [
                9562,
                9597
            ],
            [
                9597,
                9633
            ],
            [
                9633,
                9685
            ],
            [
                9685,
                9701
            ],
            [
                9701,
                9754
            ],
            [
                9754,
                9785
            ],
            [
                9785,
                9806
            ],
            [
                9806,
                9866
            ],
            [
                9866,
                9883
            ],
            [
                9883,
                9896
            ],
            [
                9896,
                9909
            ],
            [
                9909,
                9986
            ],
            [
                9986,
                10085
            ],
            [
                10085,
                10138
            ],
            [
                10138,
                10164
            ],
            [
                10164,
                10204
            ],
            [
                10204,
                10293
            ],
            [
                10293,
                10363
            ],
            [
                10363,
                10494
            ],
            [
                10494,
                10614
            ],
            [
                10614,
                10754
            ],
            [
                10754,
                10873
            ],
            [
                10873,
                10904
            ],
            [
                10904,
                10973
            ],
            [
                10973,
                11049
            ],
            [
                11049,
                11139
            ],
            [
                11139,
                11253
            ],
            [
                11253,
                11336
            ],
            [
                11336,
                11400
            ],
            [
                11400,
                11438
            ],
            [
                11438,
                11498
            ],
            [
                11498,
                11501
            ],
            [
                11501,
                11609
            ],
            [
                11609,
                11747
            ],
            [
                11747,
                11884
            ],
            [
                11884,
                12118
            ],
            [
                12118,
                12228
            ],
            [
                12228,
                12403
            ],
            [
                12403,
                12627
            ],
            [
                12627,
                12896
            ],
            [
                12896,
                12952
            ],
            [
                12952,
                13042
            ],
            [
                13042,
                13130
            ],
            [
                13130,
                13196
            ],
            [
                13196,
                13422
            ],
            [
                13422,
                13567
            ],
            [
                13567,
                13798
            ],
            [
                13798,
                13986
            ],
            [
                13986,
                14587
            ],
            [
                14587,
                14743
            ],
            [
                14743,
                14785
            ],
            [
                14785,
                15023
            ],
            [
                15023,
                15047
            ],
            [
                15047,
                15116
            ],
            [
                15116,
                15302
            ],
            [
                15302,
                15446
            ],
            [
                15446,
                15556
            ],
            [
                15556,
                15613
            ],
            [
                15613,
                15754
            ],
            [
                15754,
                15915
            ]
        ]
    },
    "abridged": {
        "text": "Lady Carbury asked frequent questions about her son's suit for Marie's hand, until Sir Felix began to think that he was persecuted.\n\"I have spoken to her father,\" he said crossly.\n\"And what did he say?\"\n\"Say - what should he say? He wanted to know what income I had got. He's an old screw.\"\n\"She has accepted you?\"\n\"Of course she has. I told you that.\"\n\"Then, Felix, if I were you I'd run off with her. I would indeed. It's done every day, and nobody thinks any harm of it when you marry the girl. From all I can hear she's just the sort of girl that would go with you.\"\nThe son sat silent. He did believe that Marie would go off with him if he asked. Her own father had hinted that such a thing was feasible, but at the same time had very clearly stated that in such case the lady would have no money.\nBut then, might not that be only a threat? Rich fathers generally forgive their daughters, and a rich father with only one child would surely forgive her when she returned graced with a title. Sir Felix thought of all this as he sat silent.\nHis mother read his thoughts. \"Of course, Felix, there must be some risk.\"\n\"Imagine if I were to be thrown over at last!\" he exclaimed. \"I couldn't bear it. I think I should kill her.\"\n\"Oh no, Felix; you wouldn't do that. But when I say some risk, I mean very little. He has nobody else to give his money to, and it would be much nicer to have his daughter, Lady Carbury, with him, than to be left all alone in the world.\"\n\"I couldn't live with him, you know. I couldn't do it.\"\n\"You needn't live with him, Felix. Of course she would visit her parents. Once the money was settled you need see little of them. Pray do not allow trifles to interfere. If this should not succeed, what are you to do? We shall all starve unless something be done. If I were you, Felix, I would take her away at once.\"\n\"I shouldn't know where to take her,\" said Sir Felix, almost stunned by the magnitude of the proposition. \"Maybe better not to marry, till the money was settled.\"\n\"Oh, no; no! Everybody would be against you. If you take her off in a spirited way and then marry her, everybody will be with you. The father will be sure to come round, if people speak up in your favour. I could get Mr. Alf and Mr. Broune to help. I'd try it, Felix.\"\nSir Felix gave no assent. But the prospect was so grand that it excited even him. He had enough money to carry out the scheme, and if he delayed now, he might never have the chance again. He thought that he would ask somebody where he ought to take her. Miles Grendall would know, but he could not ask Miles. He and Nidderdale were good friends; but Nidderdale wanted the girl for himself. Dolly would be altogether useless. He thought that, perhaps, Herr Vossner would help him. Herr Vossner would help any fellow out of difficulty, for a payment.\nOn Thursday evening he went to Grosvenor Square, as desired by Marie, but unfortunately found Melmotte in the drawing-room. Lord Nidderdale was there also, with his father, the Marquis of Auld Reekie, a fierce-looking, gouty old man, with watery eyes, and very stiff grey hair. There were also present Madame Melmotte, Miss Longestaffe, and Marie. Felix shook hands with the ladies, bowed to Melmotte, who seemed to take no notice of him, and nodded to Lord Nidderdale.\nA moment later the old Marquis said, \"Suppose we go downstairs.\"\n\"Certainly, my lord,\" said Melmotte. \"I'll show your lordship the way.\" The Marquis poked at his son with his stick until Nidderdale followed Melmotte; and the gouty old Marquis toddled after them.\nMadame Melmotte was beside herself with anxiety. \"You should not have been shown in,\" she said. \"You have to go.\"\n\"I am very sorry,\" said Sir Felix, quite aghast.\n\"I think that I had better retire,\" said Miss Longestaffe, stalking out of the room.\n\"Oh, she is so bad,\" said Madame Melmotte. \"Sir Felix, you had better go too.\"\n\"No,\" said Marie, running to him, and taking hold of his arm. \"Why should he go? I want papa to know.\"\n\"He will kill you,\" said Madame Melmotte. \"My God, yes.\"\n\"Then he shall,\" said Marie, clinging to her lover. \"I will never marry Lord Nidderdale. Felix, you love me - do you not?\"\n\"Certainly,\" said Sir Felix, slipping his arm round her waist.\n\"Mamma,\" said Marie, \"I will never have any other man but him; never, never, never. Felix, tell her that you love me.\"\n\"You know that, don't you, ma'am?\" Sir Felix was a little troubled as to what he should say or do.\n\"Oh, love! It is a beastliness,\" said Madame Melmotte. \"Sir Felix, you had better go.\"\n\"Don't go,\" said Marie. \"No, mamma. I will walk down into papa's room, and say that I will never marry that man, and that this is my lover. Felix, will you come?\"\nSir Felix did not quite like the proposition. There had been a savage ferocity in that Marquis's eye, and a sternness about Melmotte, which made him cautious. \"I don't think I have a right to do that,\" he said, \"because it is Mr. Melmotte's own house.\"\n\"I wouldn't mind,\" said Marie. \"I told papa today that I wouldn't marry Lord Nidderdale.\"\n\"Was he angry?\"\n\"He laughed at me. He thinks that everybody must do exactly what he tells them. He may kill me, but I will not do it. Felix, if you will be true to me, nothing shall separate us. I will not be ashamed to tell everybody that I love you.\"\nMadame Melmotte had thrown herself into a chair, sighing. Sir Felix stood with his arm round Marie's waist, listening - when a heavy step was heard ascending the stairs.\n\"C'est lui,\" screamed Madame Melmotte, bustling up and hurrying out of the room by a side door. The two lovers were alone for one moment, during which Marie lifted up her face, and Sir Felix kissed her lips.\n\"Now be brave,\" she said, escaping from his arm, \"and I'll be brave.\"\nMr. Melmotte looked round the room as he entered. \"Where are the others?\" he asked.\n\"They have gone away.\"\n\"Sir Felix, I must tell you that my daughter is engaged to marry Lord Nidderdale.\"\n\"Sir Felix, I am not engaged to marry Lord Nidderdale,\" said Marie. \"It's no good, papa. I won't do it, if you chop me to pieces.\"\n\"She will marry Lord Nidderdale,\" continued Mr. Melmotte, addressing Sir Felix. \"As that is arranged, you will perhaps think it better to leave us. I shall be happy to see you in the city at any time.\"\n\"Papa, he is my lover,\" said Marie.\n\"Pooh!\"\n\"It is not pooh. I will never have any other. I hate Lord Nidderdale; and as for that dreadful old man, I could not bear to look at him. Sir Felix is as good a gentleman as he is. If you loved me, papa, you would not want to make me unhappy all my life.\"\nHer father walked up to her rapidly with his hand raised, and she clung closer to her lover's arm. Sir Felix wished himself out in the square.\n\"Jade!\" said Melmotte, \"go to your room.\"\n\"Of course, if you tell me, papa.\"\n\"I do tell you. How dare you take hold of him in that disgraceful way!\"\n\"It is not more disgraceful to love him than that other man. Oh, papa, don't. You hurt me. I am going.\" He took her by the arm and dragged her to the door, and then thrust her out.\n\"I am very sorry, Mr. Melmotte,\" said Sir Felix, \"to have had a hand in causing this disturbance.\"\n\"Go away, and don't come back any more; that's all. Just understand this. I won't give my daughter a single shilling if she marries against my consent. By God, Sir Felix, she shall not have one shilling. But look you - if you'll give this up, I shall be proud to co-operate with you in anything you may wish to have done in the city.\"\nSir Felix went downstairs and was ushered out into the square. But as he went through the hall a woman managed to shove a note into his hand.\nIt was dated that morning, and ran as follows:\nThere is something you ought to know. When we were in France papa thought it wise to settle a lot of money on me. I don't know how much, but I suppose it was enough to live on if other things went wrong. He never talked to me about it, but I know it was done, and it can't be undone without my leave. He says he won't give me anything if I marry without his leave. But I am sure he cannot take it away.\nM.\nSir Felix felt that he had become engaged to a very enterprising young lady. She braved her father on behalf of her lover, and now she coolly proposed to rob him. But Sir Felix saw no reason why he should not take advantage of the money made over to the girl's name.\nHe could understand that a man in Melmotte's position should want to secure some of his fortune against accidents, by settling it on his daughter. Whether having so settled it, he could take it back without the daughter's assent, Sir Felix did not know. Marie had no doubt been regarded as a passive instrument when the thing was done, but she was now aware of the benefit which she might derive from it. Her proposition amounted to this: \"Marry me without my father's consent, and together we can rob my father of the money which, for his own purposes, he has settled upon me.\"\nHe had looked upon her as a poor weak thing; but now she began to loom before his eyes as something bigger than that. She had a will of her own. She had not been afraid of her brutal father when he, Sir Felix, had trembled. She had offered to be beaten, and killed, and chopped to pieces on behalf of her lover. There could be no doubt she would run away if she were asked.\nIt seemed to him that things which had been troublesome or difficult were now coming easily within his reach. He had won two or three thousand pounds at cards. He had been set to marry this heiress, and the girl was willing and anxious to jump into his arms. If such a man as Miles Grendall could cheat at cards and be brought to no punishment, it seemed to him that much more than that might be done without detection.\nBut nothing had opened his eyes to the ways of the world so widely as the sweet little lover-like proposition made by Miss Melmotte for robbing her father. It certainly recommended the girl to him. She had been able to throw off altogether those scruples of honesty which are apt to prevent great enterprises.\nWhat should he do next? This sum of money of which Marie wrote was probably large. It would not have been worth her father's while to make a provision of less than 50,000 - probably very much more. But this was certain: if he and Marie were to marry, there could then be no hope of more money beyond that. In that case, 50,000 would not be very much. And Melmotte would probably have means of making the possession of the money very uncomfortable. These were deep waters into which Sir Felix was preparing to plunge; and he was uneasy.",
        "paragraph_chars": [
            [
                0,
                132
            ],
            [
                132,
                180
            ],
            [
                180,
                203
            ],
            [
                203,
                291
            ],
            [
                291,
                315
            ],
            [
                315,
                353
            ],
            [
                353,
                571
            ],
            [
                571,
                803
            ],
            [
                803,
                1044
            ],
            [
                1044,
                1119
            ],
            [
                1119,
                1229
            ],
            [
                1229,
                1467
            ],
            [
                1467,
                1523
            ],
            [
                1523,
                1841
            ],
            [
                1841,
                2004
            ],
            [
                2004,
                2273
            ],
            [
                2273,
                2822
            ],
            [
                2822,
                3292
            ],
            [
                3292,
                3357
            ],
            [
                3357,
                3555
            ],
            [
                3555,
                3669
            ],
            [
                3669,
                3718
            ],
            [
                3718,
                3803
            ],
            [
                3803,
                3882
            ],
            [
                3882,
                3985
            ],
            [
                3985,
                4042
            ],
            [
                4042,
                4165
            ],
            [
                4165,
                4228
            ],
            [
                4228,
                4347
            ],
            [
                4347,
                4446
            ],
            [
                4446,
                4533
            ],
            [
                4533,
                4696
            ],
            [
                4696,
                4949
            ],
            [
                4949,
                5039
            ],
            [
                5039,
                5055
            ],
            [
                5055,
                5292
            ],
            [
                5292,
                5462
            ],
            [
                5462,
                5670
            ],
            [
                5670,
                5740
            ],
            [
                5740,
                5824
            ],
            [
                5824,
                5847
            ],
            [
                5847,
                5930
            ],
            [
                5930,
                6061
            ],
            [
                6061,
                6263
            ],
            [
                6263,
                6299
            ],
            [
                6299,
                6307
            ],
            [
                6307,
                6562
            ],
            [
                6562,
                6705
            ],
            [
                6705,
                6747
            ],
            [
                6747,
                6782
            ],
            [
                6782,
                6854
            ],
            [
                6854,
                7035
            ],
            [
                7035,
                7134
            ],
            [
                7134,
                7469
            ],
            [
                7469,
                7611
            ],
            [
                7611,
                7658
            ],
            [
                7658,
                8061
            ],
            [
                8061,
                8064
            ],
            [
                8064,
                8331
            ],
            [
                8331,
                8910
            ],
            [
                8910,
                9284
            ],
            [
                9284,
                9704
            ],
            [
                9704,
                10014
            ],
            [
                10014,
                10549
            ]
        ],
        "segment_chars": [
            [
                0,
                132
            ],
            [
                132,
                180
            ],
            [
                180,
                203
            ],
            [
                203,
                230
            ],
            [
                230,
                271
            ],
            [
                271,
                291
            ],
            [
                291,
                315
            ],
            [
                315,
                335
            ],
            [
                335,
                353
            ],
            [
                353,
                403
            ],
            [
                403,
                419
            ],
            [
                419,
                498
            ],
            [
                498,
                571
            ],
            [
                571,
                591
            ],
            [
                591,
                652
            ],
            [
                652,
                803
            ],
            [
                803,
                846
            ],
            [
                846,
                996
            ],
            [
                996,
                1044
            ],
            [
                1044,
                1074
            ],
            [
                1074,
                1119
            ],
            [
                1119,
                1166
            ],
            [
                1166,
                1180
            ],
            [
                1180,
                1201
            ],
            [
                1201,
                1229
            ],
            [
                1229,
                1266
            ],
            [
                1266,
                1312
            ],
            [
                1312,
                1467
            ],
            [
                1467,
                1504
            ],
            [
                1504,
                1523
            ],
            [
                1523,
                1558
            ],
            [
                1558,
                1597
            ],
            [
                1597,
                1653
            ],
            [
                1653,
                1693
            ],
            [
                1693,
                1741
            ],
            [
                1741,
                1787
            ],
            [
                1787,
                1841
            ],
            [
                1841,
                1947
            ],
            [
                1947,
                2004
            ],
            [
                2004,
                2017
            ],
            [
                2017,
                2049
            ],
            [
                2049,
                2135
            ],
            [
                2135,
                2209
            ],
            [
                2209,
                2253
            ],
            [
                2253,
                2273
            ],
            [
                2273,
                2299
            ],
            [
                2299,
                2355
            ],
            [
                2355,
                2461
            ],
            [
                2461,
                2527
            ],
            [
                2527,
                2582
            ],
            [
                2582,
                2663
            ],
            [
                2663,
                2698
            ],
            [
                2698,
                2753
            ],
            [
                2753,
                2822
            ],
            [
                2822,
                2946
            ],
            [
                2946,
                3100
            ],
            [
                3100,
                3170
            ],
            [
                3170,
                3292
            ],
            [
                3292,
                3357
            ],
            [
                3357,
                3394
            ],
            [
                3394,
                3429
            ],
            [
                3429,
                3555
            ],
            [
                3555,
                3604
            ],
            [
                3604,
                3651
            ],
            [
                3651,
                3669
            ],
            [
                3669,
                3718
            ],
            [
                3718,
                3803
            ],
            [
                3803,
                3846
            ],
            [
                3846,
                3882
            ],
            [
                3882,
                3944
            ],
            [
                3944,
                3963
            ],
            [
                3963,
                3985
            ],
            [
                3985,
                4027
            ],
            [
                4027,
                4042
            ],
            [
                4042,
                4094
            ],
            [
                4094,
                4131
            ],
            [
                4131,
                4165
            ],
            [
                4165,
                4228
            ],
            [
                4228,
                4312
            ],
            [
                4312,
                4347
            ],
            [
                4347,
                4382
            ],
            [
                4382,
                4446
            ],
            [
                4446,
                4457
            ],
            [
                4457,
                4501
            ],
            [
                4501,
                4533
            ],
            [
                4533,
                4557
            ],
            [
                4557,
                4569
            ],
            [
                4569,
                4673
            ],
            [
                4673,
                4696
            ],
            [
                4696,
                4742
            ],
            [
                4742,
                4855
            ],
            [
                4855,
                4949
            ],
            [
                4949,
                4980
            ],
            [
                4980,
                5039
            ],
            [
                5039,
                5055
            ],
            [
                5055,
                5074
            ],
            [
                5074,
                5135
            ],
            [
                5135,
                5173
            ],
            [
                5173,
                5234
            ],
            [
                5234,
                5292
            ],
            [
                5292,
                5350
            ],
            [
                5350,
                5462
            ],
            [
                5462,
                5558
            ],
            [
                5558,
                5670
            ],
            [
                5670,
                5740
            ],
            [
                5740,
                5790
            ],
            [
                5790,
                5814
            ],
            [
                5814,
                5824
            ],
            [
                5824,
                5847
            ],
            [
                5847,
                5930
            ],
            [
                5930,
                5998
            ],
            [
                5998,
                6019
            ],
            [
                6019,
                6061
            ],
            [
                6061,
                6141
            ],
            [
                6141,
                6209
            ],
            [
                6209,
                6263
            ],
            [
                6263,
                6299
            ],
            [
                6299,
                6307
            ],
            [
                6307,
                6324
            ],
            [
                6324,
                6353
            ],
            [
                6353,
                6444
            ],
            [
                6444,
                6487
            ],
            [
                6487,
                6562
            ],
            [
                6562,
                6661
            ],
            [
                6661,
                6705
            ],
            [
                6705,
                6713
            ],
            [
                6713,
                6747
            ],
            [
                6747,
                6782
            ],
            [
                6782,
                6798
            ],
            [
                6798,
                6854
            ],
            [
                6854,
                6915
            ],
            [
                6915,
                6932
            ],
            [
                6932,
                6945
            ],
            [
                6945,
                6958
            ],
            [
                6958,
                7035
            ],
            [
                7035,
                7134
            ],
            [
                7134,
                7186
            ],
            [
                7186,
                7208
            ],
            [
                7208,
                7286
            ],
            [
                7286,
                7338
            ],
            [
                7338,
                7469
            ],
            [
                7469,
                7532
            ],
            [
                7532,
                7611
            ],
            [
                7611,
                7658
            ],
            [
                7658,
                7696
            ],
            [
                7696,
                7772
            ],
            [
                7772,
                7862
            ],
            [
                7862,
                7959
            ],
            [
                7959,
                8023
            ],
            [
                8023,
                8061
            ],
            [
                8061,
                8064
            ],
            [
                8064,
                8141
            ],
            [
                8141,
                8227
            ],
            [
                8227,
                8331
            ],
            [
                8331,
                8478
            ],
            [
                8478,
                8585
            ],
            [
                8585,
                8736
            ],
            [
                8736,
                8910
            ],
            [
                8910,
                9028
            ],
            [
                9028,
                9055
            ],
            [
                9055,
                9134
            ],
            [
                9134,
                9222
            ],
            [
                9222,
                9284
            ],
            [
                9284,
                9394
            ],
            [
                9394,
                9444
            ],
            [
                9444,
                9543
            ],
            [
                9543,
                9704
            ],
            [
                9704,
                9860
            ],
            [
                9860,
                9902
            ],
            [
                9902,
                10014
            ],
            [
                10014,
                10038
            ],
            [
                10038,
                10097
            ],
            [
                10097,
                10212
            ],
            [
                10212,
                10320
            ],
            [
                10320,
                10365
            ],
            [
                10365,
                10462
            ],
            [
                10462,
                10549
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                19,
                37
            ],
            [
                44,
                58
            ],
            [
                75,
                76
            ],
            [
                83,
                131
            ],
            [
                132,
                180
            ],
            [
                180,
                193
            ],
            [
                197,
                203
            ],
            [
                203,
                207
            ],
            [
                210,
                230
            ],
            [
                230,
                271
            ],
            [
                271,
                291
            ],
            [
                291,
                312
            ],
            [
                312,
                315
            ],
            [
                315,
                335
            ],
            [
                335,
                350
            ],
            [
                350,
                353
            ],
            [
                353,
                403
            ],
            [
                403,
                419
            ],
            [
                419,
                498
            ],
            [
                498,
                570
            ],
            [
                571,
                589
            ],
            [
                589,
                591
            ],
            [
                591,
                638
            ],
            [
                642,
                644
            ],
            [
                650,
                652
            ],
            [
                652,
                670
            ],
            [
                671,
                682
            ],
            [
                683,
                689
            ],
            [
                696,
                709
            ],
            [
                710,
                776
            ],
            [
                777,
                781
            ],
            [
                782,
                792
            ],
            [
                793,
                795
            ],
            [
                801,
                802
            ],
            [
                803,
                827
            ],
            [
                828,
                830
            ],
            [
                831,
                835
            ],
            [
                836,
                846
            ],
            [
                846,
                868
            ],
            [
                869,
                974
            ],
            [
                975,
                996
            ],
            [
                996,
                1035
            ],
            [
                1036,
                1043
            ],
            [
                1044,
                1072
            ],
            [
                1072,
                1074
            ],
            [
                1074,
                1119
            ],
            [
                1119,
                1120
            ],
            [
                1138,
                1166
            ],
            [
                1166,
                1180
            ],
            [
                1180,
                1201
            ],
            [
                1201,
                1229
            ],
            [
                1229,
                1266
            ],
            [
                1266,
                1280
            ],
            [
                1281,
                1290
            ],
            [
                1292,
                1298
            ],
            [
                1299,
                1312
            ],
            [
                1312,
                1467
            ],
            [
                1467,
                1504
            ],
            [
                1504,
                1523
            ],
            [
                1523,
                1558
            ],
            [
                1558,
                1597
            ],
            [
                1597,
                1601
            ],
            [
                1602,
                1615
            ],
            [
                1616,
                1636
            ],
            [
                1637,
                1651
            ],
            [
                1651,
                1653
            ],
            [
                1653,
                1691
            ],
            [
                1691,
                1693
            ],
            [
                1693,
                1741
            ],
            [
                1741,
                1787
            ],
            [
                1787,
                1838
            ],
            [
                1841,
                1909
            ],
            [
                1910,
                1945
            ],
            [
                1945,
                1947
            ],
            [
                1947,
                1948
            ],
            [
                1954,
                1960
            ],
            [
                1965,
                1967
            ],
            [
                1968,
                1973
            ],
            [
                1973,
                2004
            ],
            [
                2004,
                2017
            ],
            [
                2017,
                2049
            ],
            [
                2049,
                2082
            ],
            [
                2083,
                2135
            ],
            [
                2135,
                2145
            ],
            [
                2146,
                2173
            ],
            [
                2174,
                2209
            ],
            [
                2209,
                2253
            ],
            [
                2253,
                2270
            ],
            [
                2273,
                2297
            ],
            [
                2297,
                2299
            ],
            [
                2299,
                2336
            ],
            [
                2337,
                2355
            ],
            [
                2355,
                2361
            ],
            [
                2369,
                2374
            ],
            [
                2384,
                2417
            ],
            [
                2418,
                2422
            ],
            [
                2423,
                2425
            ],
            [
                2426,
                2431
            ],
            [
                2432,
                2437
            ],
            [
                2443,
                2446
            ],
            [
                2454,
                2459
            ],
            [
                2459,
                2461
            ],
            [
                2461,
                2498
            ],
            [
                2505,
                2525
            ],
            [
                2525,
                2527
            ],
            [
                2527,
                2547
            ],
            [
                2552,
                2553
            ],
            [
                2554,
                2582
            ],
            [
                2582,
                2663
            ],
            [
                2663,
                2698
            ],
            [
                2698,
                2742
            ],
            [
                2743,
                2753
            ],
            [
                2753,
                2771
            ],
            [
                2781,
                2787
            ],
            [
                2788,
                2794
            ],
            [
                2795,
                2805
            ],
            [
                2811,
                2812
            ],
            [
                2820,
                2822
            ],
            [
                2822,
                2891
            ],
            [
                2892,
                2946
            ],
            [
                2946,
                2977
            ],
            [
                2983,
                2986
            ],
            [
                2987,
                3022
            ],
            [
                3023,
                3098
            ],
            [
                3098,
                3100
            ],
            [
                3100,
                3170
            ],
            [
                3176,
                3291
            ],
            [
                3307,
                3310
            ],
            [
                3315,
                3322
            ],
            [
                3323,
                3327
            ],
            [
                3327,
                3328
            ],
            [
                3329,
                3343
            ],
            [
                3357,
                3394
            ],
            [
                3394,
                3429
            ],
            [
                3429,
                3440
            ],
            [
                3441,
                3449
            ],
            [
                3450,
                3457
            ],
            [
                3458,
                3472
            ],
            [
                3479,
                3498
            ],
            [
                3509,
                3555
            ],
            [
                3555,
                3594
            ],
            [
                3602,
                3604
            ],
            [
                3604,
                3629
            ],
            [
                3638,
                3651
            ],
            [
                3651,
                3652
            ],
            [
                3666,
                3669
            ],
            [
                3669,
                3703
            ],
            [
                3704,
                3718
            ],
            [
                3718,
                3737
            ],
            [
                3738,
                3776
            ],
            [
                3777,
                3803
            ],
            [
                3803,
                3821
            ],
            [
                3821,
                3845
            ],
            [
                3847,
                3879
            ],
            [
                3882,
                3944
            ],
            [
                3944,
                3963
            ],
            [
                3963,
                3985
            ],
            [
                3985,
                3986
            ],
            [
                4002,
                4027
            ],
            [
                4027,
                4042
            ],
            [
                4042,
                4094
            ],
            [
                4094,
                4131
            ],
            [
                4131,
                4149
            ],
            [
                4152,
                4165
            ],
            [
                4165,
                4228
            ],
            [
                4228,
                4290
            ],
            [
                4291,
                4312
            ],
            [
                4315,
                4347
            ],
            [
                4347,
                4382
            ],
            [
                4382,
                4413
            ],
            [
                4414,
                4438
            ],
            [
                4439,
                4441
            ],
            [
                4442,
                4446
            ],
            [
                4446,
                4457
            ],
            [
                4457,
                4501
            ],
            [
                4501,
                4530
            ],
            [
                4533,
                4557
            ],
            [
                4557,
                4567
            ],
            [
                4567,
                4569
            ],
            [
                4569,
                4585
            ],
            [
                4586,
                4673
            ],
            [
                4673,
                4696
            ],
            [
                4696,
                4742
            ],
            [
                4742,
                4801
            ],
            [
                4802,
                4803
            ],
            [
                4804,
                4835
            ],
            [
                4836,
                4844
            ],
            [
                4853,
                4855
            ],
            [
                4855,
                4949
            ],
            [
                4949,
                4980
            ],
            [
                4980,
                4992
            ],
            [
                4999,
                5039
            ],
            [
                5039,
                5052
            ],
            [
                5052,
                5055
            ],
            [
                5055,
                5074
            ],
            [
                5074,
                5135
            ],
            [
                5135,
                5173
            ],
            [
                5173,
                5234
            ],
            [
                5234,
                5292
            ],
            [
                5292,
                5311
            ],
            [
                5312,
                5339
            ],
            [
                5341,
                5350
            ],
            [
                5350,
                5365
            ],
            [
                5366,
                5409
            ],
            [
                5412,
                5416
            ],
            [
                5417,
                5461
            ],
            [
                5462,
                5512
            ],
            [
                5513,
                5558
            ],
            [
                5558,
                5669
            ],
            [
                5670,
                5739
            ],
            [
                5740,
                5790
            ],
            [
                5790,
                5814
            ],
            [
                5814,
                5824
            ],
            [
                5824,
                5825
            ],
            [
                5835,
                5844
            ],
            [
                5844,
                5847
            ],
            [
                5847,
                5858
            ],
            [
                5859,
                5860
            ],
            [
                5866,
                5930
            ],
            [
                5930,
                5958
            ],
            [
                5959,
                5961
            ],
            [
                5968,
                5998
            ],
            [
                5998,
                6019
            ],
            [
                6019,
                6032
            ],
            [
                6032,
                6033
            ],
            [
                6034,
                6058
            ],
            [
                6058,
                6061
            ],
            [
                6061,
                6129
            ],
            [
                6130,
                6141
            ],
            [
                6141,
                6209
            ],
            [
                6209,
                6219
            ],
            [
                6220,
                6263
            ],
            [
                6263,
                6299
            ],
            [
                6299,
                6307
            ],
            [
                6307,
                6324
            ],
            [
                6324,
                6353
            ],
            [
                6353,
                6444
            ],
            [
                6444,
                6487
            ],
            [
                6487,
                6562
            ],
            [
                6562,
                6633
            ],
            [
                6634,
                6661
            ],
            [
                6665,
                6670
            ],
            [
                6671,
                6704
            ],
            [
                6705,
                6713
            ],
            [
                6713,
                6729
            ],
            [
                6732,
                6747
            ],
            [
                6747,
                6757
            ],
            [
                6757,
                6782
            ],
            [
                6782,
                6798
            ],
            [
                6798,
                6835
            ],
            [
                6848,
                6851
            ],
            [
                6855,
                6915
            ],
            [
                6915,
                6932
            ],
            [
                6932,
                6945
            ],
            [
                6945,
                6958
            ],
            [
                6958,
                7035
            ],
            [
                7035,
                7134
            ],
            [
                7134,
                7173
            ],
            [
                7174,
                7186
            ],
            [
                7191,
                7201
            ],
            [
                7202,
                7208
            ],
            [
                7208,
                7209
            ],
            [
                7216,
                7286
            ],
            [
                7286,
                7288
            ],
            [
                7289,
                7292
            ],
            [
                7292,
                7338
            ],
            [
                7338,
                7350
            ],
            [
                7353,
                7469
            ],
            [
                7473,
                7478
            ],
            [
                7479,
                7483
            ],
            [
                7495,
                7510
            ],
            [
                7515,
                7532
            ],
            [
                7532,
                7609
            ],
            [
                7609,
                7610
            ],
            [
                7611,
                7641
            ],
            [
                7642,
                7657
            ],
            [
                7658,
                7676
            ],
            [
                7677,
                7694
            ],
            [
                7694,
                7696
            ],
            [
                7696,
                7772
            ],
            [
                7772,
                7862
            ],
            [
                7862,
                7916
            ],
            [
                7916,
                7921
            ],
            [
                7922,
                7924
            ],
            [
                7925,
                7933
            ],
            [
                7934,
                7940
            ],
            [
                7941,
                7959
            ],
            [
                7959,
                8023
            ],
            [
                8023,
                8060
            ],
            [
                8061,
                8064
            ],
            [
                8064,
                8073
            ],
            [
                8079,
                8141
            ],
            [
                8141,
                8227
            ],
            [
                8227,
                8329
            ],
            [
                8329,
                8330
            ],
            [
                8331,
                8333
            ],
            [
                8334,
                8406
            ],
            [
                8412,
                8478
            ],
            [
                8478,
                8516
            ],
            [
                8522,
                8524
            ],
            [
                8530,
                8585
            ],
            [
                8585,
                8590
            ],
            [
                8591,
                8620
            ],
            [
                8623,
                8666
            ],
            [
                8675,
                8682
            ],
            [
                8692,
                8719
            ],
            [
                8720,
                8736
            ],
            [
                8736,
                8751
            ],
            [
                8752,
                8771
            ],
            [
                8777,
                8808
            ],
            [
                8809,
                8812
            ],
            [
                8813,
                8821
            ],
            [
                8825,
                8909
            ],
            [
                8910,
                8928
            ],
            [
                8929,
                8932
            ],
            [
                8933,
                8953
            ],
            [
                8953,
                9028
            ],
            [
                9028,
                9031
            ],
            [
                9032,
                9053
            ],
            [
                9053,
                9055
            ],
            [
                9055,
                9132
            ],
            [
                9132,
                9134
            ],
            [
                9134,
                9222
            ],
            [
                9222,
                9245
            ],
            [
                9260,
                9284
            ],
            [
                9284,
                9305
            ],
            [
                9306,
                9318
            ],
            [
                9319,
                9339
            ],
            [
                9340,
                9352
            ],
            [
                9353,
                9394
            ],
            [
                9394,
                9442
            ],
            [
                9442,
                9444
            ],
            [
                9444,
                9482
            ],
            [
                9483,
                9486
            ],
            [
                9487,
                9499
            ],
            [
                9500,
                9543
            ],
            [
                9543,
                9628
            ],
            [
                9629,
                9703
            ],
            [
                9704,
                9860
            ],
            [
                9860,
                9902
            ],
            [
                9902,
                9919
            ],
            [
                9920,
                9932
            ],
            [
                9933,
                9969
            ],
            [
                9970,
                10012
            ],
            [
                10012,
                10014
            ],
            [
                10014,
                10038
            ],
            [
                10038,
                10076
            ],
            [
                10077,
                10097
            ],
            [
                10097,
                10125
            ],
            [
                10139,
                10144
            ],
            [
                10145,
                10154
            ],
            [
                10155,
                10167
            ],
            [
                10168,
                10184
            ],
            [
                10187,
                10195
            ],
            [
                10196,
                10212
            ],
            [
                10212,
                10232
            ],
            [
                10234,
                10257
            ],
            [
                10263,
                10295
            ],
            [
                10301,
                10306
            ],
            [
                10314,
                10318
            ],
            [
                10318,
                10320
            ],
            [
                10332,
                10365
            ],
            [
                10365,
                10377
            ],
            [
                10384,
                10403
            ],
            [
                10404,
                10462
            ],
            [
                10462,
                10537
            ],
            [
                10548,
                10549
            ]
        ],
        "row_chars": [
            [
                0,
                132
            ],
            [
                132,
                180
            ],
            [
                180,
                203
            ],
            [
                203,
                230
            ],
            [
                230,
                271
            ],
            [
                271,
                291
            ],
            [
                291,
                291
            ],
            [
                291,
                291
            ],
            [
                291,
                291
            ],
            [
                291,
                315
            ],
            [
                315,
                335
            ],
            [
                335,
                353
            ],
            [
                353,
                403
            ],
            [
                403,
                419
            ],
            [
                419,
                498
            ],
            [
                498,
                498
            ],
            [
                498,
                571
            ],
            [
                571,
                591
            ],
            [
                591,
                652
            ],
            [
                652,
                803
            ],
            [
                803,
                846
            ],
            [
                846,
                996
            ],
            [
                996,
                1044
            ],
            [
                1044,
                1074
            ],
            [
                1074,
                1119
            ],
            [
                1119,
                1166
            ],
            [
                1166,
                1180
            ],
            [
                1180,
                1201
            ],
            [
                1201,
                1229
            ],
            [
                1229,
                1266
            ],
            [
                1266,
                1312
            ],
            [
                1312,
                1312
            ],
            [
                1312,
                1467
            ],
            [
                1467,
                1504
            ],
            [
                1504,
                1523
            ],
            [
                1523,
                1558
            ],
            [
                1558,
                1597
            ],
            [
                1597,
                1653
            ],
            [
                1653,
                1693
            ],
            [
                1693,
                1741
            ],
            [
                1741,
                1787
            ],
            [
                1787,
                1841
            ],
            [
                1841,
                1841
            ],
            [
                1841,
                1947
            ],
            [
                1947,
                1947
            ],
            [
                1947,
                2004
            ],
            [
                2004,
                2017
            ],
            [
                2017,
                2049
            ],
            [
                2049,
                2135
            ],
            [
                2135,
                2135
            ],
            [
                2135,
                2209
            ],
            [
                2209,
                2253
            ],
            [
                2253,
                2273
            ],
            [
                2273,
                2273
            ],
            [
                2273,
                2299
            ],
            [
                2299,
                2299
            ],
            [
                2299,
                2355
            ],
            [
                2355,
                2461
            ],
            [
                2461,
                2527
            ],
            [
                2527,
                2582
            ],
            [
                2582,
                2663
            ],
            [
                2663,
                2663
            ],
            [
                2663,
                2698
            ],
            [
                2698,
                2753
            ],
            [
                2753,
                2822
            ],
            [
                2822,
                2946
            ],
            [
                2946,
                3100
            ],
            [
                3100,
                3100
            ],
            [
                3100,
                3170
            ],
            [
                3170,
                3170
            ],
            [
                3170,
                3292
            ],
            [
                3292,
                3357
            ],
            [
                3357,
                3394
            ],
            [
                3394,
                3429
            ],
            [
                3429,
                3555
            ],
            [
                3555,
                3604
            ],
            [
                3604,
                3651
            ],
            [
                3651,
                3669
            ],
            [
                3669,
                3718
            ],
            [
                3718,
                3803
            ],
            [
                3803,
                3846
            ],
            [
                3846,
                3882
            ],
            [
                3882,
                3882
            ],
            [
                3882,
                3944
            ],
            [
                3944,
                3963
            ],
            [
                3963,
                3985
            ],
            [
                3985,
                4027
            ],
            [
                4027,
                4042
            ],
            [
                4042,
                4094
            ],
            [
                4094,
                4131
            ],
            [
                4131,
                4131
            ],
            [
                4131,
                4165
            ],
            [
                4165,
                4228
            ],
            [
                4228,
                4312
            ],
            [
                4312,
                4347
            ],
            [
                4347,
                4382
            ],
            [
                4382,
                4446
            ],
            [
                4446,
                4457
            ],
            [
                4457,
                4501
            ],
            [
                4501,
                4533
            ],
            [
                4533,
                4533
            ],
            [
                4533,
                4533
            ],
            [
                4533,
                4557
            ],
            [
                4557,
                4569
            ],
            [
                4569,
                4569
            ],
            [
                4569,
                4673
            ],
            [
                4673,
                4696
            ],
            [
                4696,
                4742
            ],
            [
                4742,
                4855
            ],
            [
                4855,
                4949
            ],
            [
                4949,
                4980
            ],
            [
                4980,
                5039
            ],
            [
                5039,
                5055
            ],
            [
                5055,
                5074
            ],
            [
                5074,
                5135
            ],
            [
                5135,
                5173
            ],
            [
                5173,
                5173
            ],
            [
                5173,
                5234
            ],
            [
                5234,
                5292
            ],
            [
                5292,
                5350
            ],
            [
                5350,
                5462
            ],
            [
                5462,
                5558
            ],
            [
                5558,
                5670
            ],
            [
                5670,
                5740
            ],
            [
                5740,
                5790
            ],
            [
                5790,
                5814
            ],
            [
                5814,
                5824
            ],
            [
                5824,
                5847
            ],
            [
                5847,
                5930
            ],
            [
                5930,
                5998
            ],
            [
                5998,
                6019
            ],
            [
                6019,
                6061
            ],
            [
                6061,
                6141
            ],
            [
                6141,
                6209
            ],
            [
                6209,
                6263
            ],
            [
                6263,
                6299
            ],
            [
                6299,
                6307
            ],
            [
                6307,
                6324
            ],
            [
                6324,
                6324
            ],
            [
                6324,
                6353
            ],
            [
                6353,
                6444
            ],
            [
                6444,
                6487
            ],
            [
                6487,
                6562
            ],
            [
                6562,
                6661
            ],
            [
                6661,
                6705
            ],
            [
                6705,
                6713
            ],
            [
                6713,
                6747
            ],
            [
                6747,
                6747
            ],
            [
                6747,
                6782
            ],
            [
                6782,
                6798
            ],
            [
                6798,
                6854
            ],
            [
                6854,
                6854
            ],
            [
                6854,
                6854
            ],
            [
                6854,
                6915
            ],
            [
                6915,
                6932
            ],
            [
                6932,
                6945
            ],
            [
                6945,
                6958
            ],
            [
                6958,
                7035
            ],
            [
                7035,
                7134
            ],
            [
                7134,
                7186
            ],
            [
                7186,
                7186
            ],
            [
                7186,
                7208
            ],
            [
                7208,
                7286
            ],
            [
                7286,
                7338
            ],
            [
                7338,
                7469
            ],
            [
                7469,
                7532
            ],
            [
                7532,
                7611
            ],
            [
                7611,
                7658
            ],
            [
                7658,
                7658
            ],
            [
                7658,
                7696
            ],
            [
                7696,
                7772
            ],
            [
                7772,
                7862
            ],
            [
                7862,
                7959
            ],
            [
                7959,
                7959
            ],
            [
                7959,
                8023
            ],
            [
                8023,
                8061
            ],
            [
                8061,
                8061
            ],
            [
                8061,
                8064
            ],
            [
                8064,
                8141
            ],
            [
                8141,
                8227
            ],
            [
                8227,
                8331
            ],
            [
                8331,
                8478
            ],
            [
                8478,
                8585
            ],
            [
                8585,
                8736
            ],
            [
                8736,
                8910
            ],
            [
                8910,
                9028
            ],
            [
                9028,
                9055
            ],
            [
                9055,
                9134
            ],
            [
                9134,
                9222
            ],
            [
                9222,
                9284
            ],
            [
                9284,
                9394
            ],
            [
                9394,
                9444
            ],
            [
                9444,
                9543
            ],
            [
                9543,
                9543
            ],
            [
                9543,
                9704
            ],
            [
                9704,
                9860
            ],
            [
                9860,
                9902
            ],
            [
                9902,
                10014
            ],
            [
                10014,
                10038
            ],
            [
                10038,
                10097
            ],
            [
                10097,
                10212
            ],
            [
                10212,
                10320
            ],
            [
                10320,
                10320
            ],
            [
                10320,
                10365
            ],
            [
                10365,
                10462
            ],
            [
                10462,
                10549
            ]
        ]
    }
}