{
    "original": {
        "text": "\"And now I have something to say to you.\" Mr. Broune as he thus spoke to Lady Carbury rose up to his feet and then sat down again. There was an air of perturbation about him which was very manifest to the lady, and the cause and coming result of which she thought that she understood. \"The susceptible old goose is going to do something highly ridiculous and very disagreeable.\" It was thus that she spoke to herself of the scene that she saw was prepared for her, but she did not foresee accurately the shape in which the susceptibility of the \"old goose\" would declare itself. \"Lady Carbury,\" said Mr. Broune, standing up a second time, \"we are neither of us so young as we used to be.\"\n\"No, indeed;--and therefore it is that we can afford to ourselves the luxury of being friends. Nothing but age enables men and women to know each other intimately.\"\nThis speech was a great impediment to Mr. Broune's progress. It was evidently intended to imply that he at least had reached a time of life at which any allusion to love would be absurd. And yet, as a fact, he was nearer fifty than sixty, was young of his age, could walk his four or five miles pleasantly, could ride his cob in the park with as free an air as any man of forty, and could afterwards work through four or five hours of the night with an easy steadiness which nothing but sound health could produce. Mr. Broune, thinking of himself and his own circumstances, could see no reason why he should not be in love. \"I hope we know each other intimately at any rate,\" he said somewhat lamely.\n\"Oh, yes;--and it is for that reason that I have come to you for advice. Had I been a young woman I should not have dared to ask you.\"\n\"I don't see that. I don't quite understand that. But it has nothing to do with my present purpose. When I said that we were neither of us so young as we once were, I uttered what was a stupid platitude,--a foolish truism.\"\n\"I did not think so,\" said Lady Carbury smiling.\n\"Or would have been, only that I intended something further.\" Mr. Broune had got himself into a difficulty and hardly knew how to get out of it. \"I was going on to say that I hoped we were not too old to--love.\"\nFoolish old darling! What did he mean by making such an ass of himself? This was worse even than the kiss, as being more troublesome and less easily pushed on one side and forgotten. It may serve to explain the condition of Lady Carbury's mind at the time if it be stated that she did not even at this moment suppose that the editor of the \"Morning Breakfast Table\" intended to make her an offer of marriage. She knew, or thought she knew, that middle-aged men are fond of prating about love, and getting up sensational scenes. The falseness of the thing, and the injury which may come of it, did not shock her at all. Had she known that the editor professed to be in love with some lady in the next street, she would have been quite ready to enlist the lady in the next street among her friends that she might thus strengthen her own influence with Mr. Broune. For herself such make-belief of an improper passion would be inconvenient, and therefore to be avoided. But that any man, placed as Mr. Broune was in the world,--blessed with power, with a large income, with influence throughout all the world around him, courted, fted, feared and almost worshipped,--that he should desire to share her fortunes, her misfortunes, her struggles, her poverty and her obscurity, was not within the scope of her imagination. There was a homage in it, of which she did not believe any man to be capable,--and which to her would be the more wonderful as being paid to herself. She thought so badly of men and women generally, and of Mr. Broune and herself as a man and a woman individually, that she was unable to conceive the possibility of such a sacrifice. \"Mr. Broune,\" she said, \"I did not think that you would take advantage of the confidence I have placed in you to annoy me in this way.\"\n\"To annoy you, Lady Carbury! The phrase at any rate is singular. After much thought I have determined to ask you to be my wife. That I should be--annoyed, and more than annoyed by your refusal, is a matter of course. That I ought to expect such annoyance is perhaps too true. But you can extricate yourself from the dilemma only too easily.\"\nThe word \"wife\" came upon her like a thunder-clap. It at once changed all her feelings towards him. She did not dream of loving him. She felt sure that she never could love him. Had it been on the cards with her to love any man as a lover, it would have been some handsome spendthrift who would have hung from her neck like a nether millstone. This man was a friend to be used,--to be used because he knew the world. And now he gave her this clear testimony that he knew as little of the world as any other man. Mr. Broune of the \"Daily Breakfast Table\" asking her to be his wife! But mixed with her other feelings there was a tenderness which brought back some memory of her distant youth, and almost made her weep. That a man,--such a man,--should offer to take half her burdens, and to confer upon her half his blessings! What an idiot! But what a God! She had looked upon the man as all intellect, alloyed perhaps by some passionless remnants of the vices of his youth; and now she found that he not only had a human heart in his bosom, but a heart that she could touch. How wonderfully sweet! How infinitely small!\nIt was necessary that she should answer him--and to her it was only natural that she should at first think what answer would best assist her own views without reference to his. It did not occur to her that she could love him; but it did occur to her that he might lift her out of her difficulties. What a benefit it would be to her to have a father, and such a father, for Felix! How easy would be a literary career to the wife of the editor of the \"Morning Breakfast Table!\" And then it passed through her mind that somebody had told her that the man was paid 3,000 a year for his work. Would not the world, or any part of it that was desirable, come to her drawing-room if she were the wife of Mr. Broune? It all passed through her brain at once during that minute of silence which she allowed herself after the declaration was made to her. But other ideas and other feelings were present to her also. Perhaps the truest aspiration of her heart had been the love of freedom which the tyranny of her late husband had engendered. Once she had fled from that tyranny and had been almost crushed by the censure to which she had been subjected. Then her husband's protection and his tyranny had been restored to her. After that the freedom had come. It had been accompanied by many hopes never as yet fulfilled, and embittered by many sorrows which had been always present to her; but still the hopes were alive and the remembrance of the tyranny was very clear to her. At last the minute was over and she was bound to speak. \"Mr. Broune,\" she said, \"you have quite taken away my breath. I never expected anything of this kind.\"\nAnd now Mr. Broune's mouth was opened, and his voice was free. \"Lady Carbury,\" he said, \"I have lived a long time without marrying, and I have sometimes thought that it would be better for me to go on in the same way to the end. I have worked so hard all my life that when I was young I had no time to think of love. And, as I have gone on, my mind has been so fully employed, that I have hardly realised the want which nevertheless I have felt. And so it has been with me till I fancied, not that I was too old for love, but that others would think me so. Then I met you. As I said at first, perhaps with scant gallantry, you also are not as young as you once were. But you keep the beauty of your youth, and the energy, and something of the freshness of a young heart. And I have come to love you. I speak with absolute frankness, risking your anger. I have doubted much before I resolved upon this. It is so hard to know the nature of another person. But I think I understand yours;--and if you can confide your happiness with me, I am prepared to intrust mine to your keeping.\" Poor Mr. Broune! Though endowed with gifts peculiarly adapted for the editing of a daily newspaper, he could have had but little capacity for reading a woman's character when he talked of the freshness of Lady Carbury's young mind! And he must have surely been much blinded by love, before convincing himself that he could trust his happiness to such keeping.\n\"You do me infinite honour. You pay me a great compliment,\" ejaculated Lady Carbury.\n\"Well?\"\n\"How am I to answer you at a moment? I expected nothing of this. As God is to be my judge it has come upon me like a dream. I look upon your position as almost the highest in England,--on your prosperity as the uttermost that can be achieved.\"\n\"That prosperity, such as it is, I desire most anxiously to share with you.\"\n\"You tell me so;--but I can hardly yet believe it. And then how am I to know my own feelings so suddenly? Marriage as I have found it, Mr. Broune, has not been happy. I have suffered much. I have been wounded in every joint, hurt in every nerve,--tortured till I could hardly endure my punishment. At last I got my liberty, and to that I have looked for happiness.\"\n\"Has it made you happy?\"\n\"It has made me less wretched. And there is so much to be considered! I have a son and a daughter, Mr. Broune.\"\n\"Your daughter I can love as my own. I think I prove my devotion to you when I say that I am willing for your sake to encounter the troubles which may attend your son's future career.\"\n\"Mr. Broune, I love him better,--always shall love him better,--than anything in the world.\" This was calculated to damp the lover's ardour, but he probably reflected that should he now be successful, time might probably change the feeling which had just been expressed. \"Mr. Broune,\" she said, \"I am now so agitated that you had better leave me. And it is very late. The servant is sitting up, and will wonder that you should remain. It is near two o'clock.\"\n\"When may I hope for an answer?\"\n\"You shall not be kept waiting. I will write to you, almost at once. I will write to you,--to-morrow; say the day after to-morrow, on Thursday. I feel that I ought to have been prepared with an answer; but I am so surprised that I have none ready.\" He took her hand in his, and kissing it, left her without another word.\nAs he was about to open the front door to let himself out, a key from the other side raised the latch, and Sir Felix, returning from his club, entered his mother's house. The young man looked up into Mr. Broune's face with mingled impudence and surprise. \"Halloo, old fellow,\" he said, \"you've been keeping it up late here; haven't you?\" He was nearly drunk, and Mr. Broune, perceiving his condition, passed him without a word. Lady Carbury was still standing in the drawing-room, struck with amazement at the scene which had just passed, full of doubt as to her future conduct, when she heard her son stumbling up the stairs. It was impossible for her not to go out to him. \"Felix,\" she said, \"why do you make so much noise as you come in?\"\n\"Noish! I'm not making any noish. I think I'm very early. Your people's only just gone. I shaw shat editor fellow at the door that won't call himself Brown. He'sh great ass'h, that fellow. All right, mother. Oh, ye'sh I'm all right.\" And so he stumbled up to bed, and his mother followed him to see that the candle was at any rate placed squarely on the table, beyond the reach of the bed curtains.\nMr. Broune as he walked to his newspaper office experienced all those pangs of doubts which a man feels when he has just done that which for days and weeks past he has almost resolved that he had better leave undone. That last apparition which he had encountered at his lady love's door certainly had not tended to reassure him. What curse can be much greater than that inflicted by a drunken, reprobate son? The evil, when in the course of things it comes upon a man, has to be borne; but why should a man in middle life unnecessarily afflict himself with so terrible a misfortune? The woman, too, was devoted to the cub! Then thousands of other thoughts crowded upon him. How would this new life suit him? He must have a new house, and new ways; must live under a new dominion, and fit himself to new pleasures. And what was he to gain by it? Lady Carbury was a handsome woman, and he liked her beauty. He regarded her too as a clever woman; and, because she had flattered him, he had liked her conversation. He had been long enough about town to have known better,--and as he now walked along the streets, he almost felt that he ought to have known better. Every now and again he warmed himself a little with the remembrance of her beauty, and told himself that his new home would be pleasanter, though it might perhaps be less free, than the old one. He tried to make the best of it; but as he did so was always repressed by the memory of the appearance of that drunken young baronet.\nWhether for good or for evil, the step had been taken and the thing was done. It did not occur to him that the lady would refuse him. All his experience of the world was against such refusal. Towns which consider, always render themselves. Ladies who doubt always solve their doubts in the one direction. Of course she would accept him;--and of course he would stand to his guns. As he went to his work he endeavoured to bathe himself in self-complacency; but, at the bottom of it, there was a substratum of melancholy which leavened his prospects.\nLady Carbury went from the door of her son's room to her own chamber, and there sat thinking through the greater part of the night. During these hours she perhaps became a better woman, as being more oblivious of herself, than she had been for many a year. It could not be for the good of this man that he should marry her,--and she did in the midst of her many troubles try to think of the man's condition. Although in the moments of her triumph,--and such moments were many,--she would buoy herself up with assurances that her Felix would become a rich man, brilliant with wealth and rank, an honour to her, a personage whose society would be desired by many, still in her heart of hearts she knew how great was the peril, and in her imagination she could foresee the nature of the catastrophe which might come. He would go utterly to the dogs and would take her with him. And whithersoever he might go, to what lowest canine regions he might descend, she knew herself well enough to be sure that whether married or single she would go with him. Though her reason might be ever so strong in bidding her to desert him, her heart, she knew, would be stronger than her reason. He was the one thing in the world that overpowered her. In all other matters she could scheme, and contrive, and pretend; could get the better of her feelings and fight the world with a double face, laughing at illusions and telling herself that passions and preferences were simply weapons to be used. But her love for her son mastered her,--and she knew it. As it was so, could it be fit that she should marry another man?\nAnd then her liberty! Even though Felix should bring her to utter ruin, nevertheless she would be and might remain a free woman. Should the worse come to the worst she thought that she could endure a Bohemian life in which, should all her means have been taken from her, she could live on what she earned. Though Felix was a tyrant after a kind, he was not a tyrant who could bid her do this or that. A repetition of marriage vows did not of itself recommend itself to her. As to loving the man, liking his caresses, and being specially happy because he was near her,--no romance of that kind ever presented itself to her imagination. How would it affect Felix and her together,--and Mr. Broune as connected with her and Felix? If Felix should go to the dogs, then would Mr. Broune not want her. Should Felix go to the stars instead of the dogs, and become one of the gilded ornaments of the metropolis, then would not he and she want Mr. Broune. It was thus that she regarded the matter.\nShe thought very little of her daughter as she considered all this. There was a home for Hetta, with every comfort, if Hetta would only condescend to accept it. Why did not Hetta marry her cousin Roger Carbury and let there be an end of that trouble? Of course Hetta must live wherever her mother lived till she should marry; but Hetta's life was so much at her own disposal that her mother did not feel herself bound to be guided in the great matter by Hetta's predispositions.\nBut she must tell Hetta should she ultimately make up her mind to marry the man, and in that case the sooner this was done the better. On that night she did not make up her mind. Ever and again as she declared to herself that she would not marry him, the picture of a comfortable assured home over her head, and the conviction that the editor of the \"Morning Breakfast Table\" would be powerful for all things, brought new doubts to her mind. But she could not convince herself, and when at last she went to her bed her mind was still vacillating. The next morning she met Hetta at breakfast, and with assumed nonchalance asked a question about the man who was perhaps about to be her husband. \"Do you like Mr. Broune, Hetta?\"\n\"Yes;--pretty well. I don't care very much about him. What makes you ask, mamma?\"\n\"Because among my acquaintances in London there is no one so truly kind to me as he is.\"\n\"He always seems to me to like to have his own way.\"\n\"Why shouldn't he like it?\"\n\"He has to me that air of selfishness which is so very common with people in London;--as though what he said were all said out of surface politeness.\"\n\"I wonder what you expect, Hetta, when you talk of--London people? Why should not London people be as kind as other people? I think Mr. Broune is as obliging a man as any one I know. But if I like anybody, you always make little of him. The only person you seem to think well of is Mr. Montague.\"\n\"Mamma, that is unfair and unkind. I never mention Mr. Montague's name if I can help it,--and I should not have spoken of Mr. Broune, had you not asked me.\"",
        "paragraph_chars": [
            [
                0,
                689
            ],
            [
                689,
                854
            ],
            [
                854,
                1555
            ],
            [
                1555,
                1690
            ],
            [
                1690,
                1914
            ],
            [
                1914,
                1963
            ],
            [
                1963,
                2175
            ],
            [
                2175,
                3960
            ],
            [
                3960,
                4302
            ],
            [
                4302,
                5422
            ],
            [
                5422,
                7048
            ],
            [
                7048,
                8490
            ],
            [
                8490,
                8575
            ],
            [
                8575,
                8583
            ],
            [
                8583,
                8827
            ],
            [
                8827,
                8904
            ],
            [
                8904,
                9270
            ],
            [
                9270,
                9295
            ],
            [
                9295,
                9407
            ],
            [
                9407,
                9592
            ],
            [
                9592,
                10052
            ],
            [
                10052,
                10085
            ],
            [
                10085,
                10406
            ],
            [
                10406,
                11148
            ],
            [
                11148,
                11547
            ],
            [
                11547,
                13036
            ],
            [
                13036,
                13585
            ],
            [
                13585,
                15186
            ],
            [
                15186,
                16175
            ],
            [
                16175,
                16654
            ],
            [
                16654,
                17380
            ],
            [
                17380,
                17462
            ],
            [
                17462,
                17551
            ],
            [
                17551,
                17604
            ],
            [
                17604,
                17632
            ],
            [
                17632,
                17783
            ],
            [
                17783,
                18080
            ],
            [
                18080,
                18236
            ]
        ],
        "segment_chars": [
            [
                0,
                42
            ],
            [
                42,
                131
            ],
            [
                131,
                285
            ],
            [
                285,
                379
            ],
            [
                379,
                579
            ],
            [
                579,
                689
            ],
            [
                689,
                784
            ],
            [
                784,
                854
            ],
            [
                854,
                915
            ],
            [
                915,
                1041
            ],
            [
                1041,
                1369
            ],
            [
                1369,
                1478
            ],
            [
                1478,
                1555
            ],
            [
                1555,
                1628
            ],
            [
                1628,
                1690
            ],
            [
                1690,
                1709
            ],
            [
                1709,
                1740
            ],
            [
                1740,
                1790
            ],
            [
                1790,
                1914
            ],
            [
                1914,
                1963
            ],
            [
                1963,
                2025
            ],
            [
                2025,
                2108
            ],
            [
                2108,
                2175
            ],
            [
                2175,
                2196
            ],
            [
                2196,
                2247
            ],
            [
                2247,
                2358
            ],
            [
                2358,
                2584
            ],
            [
                2584,
                2703
            ],
            [
                2703,
                2794
            ],
            [
                2794,
                3037
            ],
            [
                3037,
                3141
            ],
            [
                3141,
                3491
            ],
            [
                3491,
                3641
            ],
            [
                3641,
                3824
            ],
            [
                3824,
                3960
            ],
            [
                3960,
                3989
            ],
            [
                3989,
                4025
            ],
            [
                4025,
                4088
            ],
            [
                4088,
                4177
            ],
            [
                4177,
                4236
            ],
            [
                4236,
                4302
            ],
            [
                4302,
                4353
            ],
            [
                4353,
                4402
            ],
            [
                4402,
                4435
            ],
            [
                4435,
                4480
            ],
            [
                4480,
                4646
            ],
            [
                4646,
                4719
            ],
            [
                4719,
                4814
            ],
            [
                4814,
                4883
            ],
            [
                4883,
                5019
            ],
            [
                5019,
                5127
            ],
            [
                5127,
                5142
            ],
            [
                5142,
                5158
            ],
            [
                5158,
                5377
            ],
            [
                5377,
                5400
            ],
            [
                5400,
                5422
            ],
            [
                5422,
                5599
            ],
            [
                5599,
                5720
            ],
            [
                5720,
                5802
            ],
            [
                5802,
                5898
            ],
            [
                5898,
                6010
            ],
            [
                6010,
                6130
            ],
            [
                6130,
                6265
            ],
            [
                6265,
                6326
            ],
            [
                6326,
                6452
            ],
            [
                6452,
                6564
            ],
            [
                6564,
                6636
            ],
            [
                6636,
                6669
            ],
            [
                6669,
                6889
            ],
            [
                6889,
                6945
            ],
            [
                6945,
                7007
            ],
            [
                7007,
                7048
            ],
            [
                7048,
                7111
            ],
            [
                7111,
                7277
            ],
            [
                7277,
                7365
            ],
            [
                7365,
                7494
            ],
            [
                7494,
                7605
            ],
            [
                7605,
                7621
            ],
            [
                7621,
                7715
            ],
            [
                7715,
                7819
            ],
            [
                7819,
                7848
            ],
            [
                7848,
                7901
            ],
            [
                7901,
                7950
            ],
            [
                7950,
                8002
            ],
            [
                8002,
                8130
            ],
            [
                8130,
                8147
            ],
            [
                8147,
                8362
            ],
            [
                8362,
                8490
            ],
            [
                8490,
                8518
            ],
            [
                8518,
                8575
            ],
            [
                8575,
                8583
            ],
            [
                8583,
                8620
            ],
            [
                8620,
                8648
            ],
            [
                8648,
                8707
            ],
            [
                8707,
                8827
            ],
            [
                8827,
                8904
            ],
            [
                8904,
                8955
            ],
            [
                8955,
                9010
            ],
            [
                9010,
                9071
            ],
            [
                9071,
                9093
            ],
            [
                9093,
                9202
            ],
            [
                9202,
                9270
            ],
            [
                9270,
                9295
            ],
            [
                9295,
                9326
            ],
            [
                9326,
                9365
            ],
            [
                9365,
                9407
            ],
            [
                9407,
                9444
            ],
            [
                9444,
                9592
            ],
            [
                9592,
                9685
            ],
            [
                9685,
                9863
            ],
            [
                9863,
                9939
            ],
            [
                9939,
                9960
            ],
            [
                9960,
                10027
            ],
            [
                10027,
                10052
            ],
            [
                10052,
                10085
            ],
            [
                10085,
                10117
            ],
            [
                10117,
                10154
            ],
            [
                10154,
                10229
            ],
            [
                10229,
                10334
            ],
            [
                10334,
                10406
            ],
            [
                10406,
                10577
            ],
            [
                10577,
                10661
            ],
            [
                10661,
                10744
            ],
            [
                10744,
                10834
            ],
            [
                10834,
                11033
            ],
            [
                11033,
                11081
            ],
            [
                11081,
                11148
            ],
            [
                11148,
                11156
            ],
            [
                11156,
                11182
            ],
            [
                11182,
                11206
            ],
            [
                11206,
                11236
            ],
            [
                11236,
                11305
            ],
            [
                11305,
                11337
            ],
            [
                11337,
                11356
            ],
            [
                11356,
                11382
            ],
            [
                11382,
                11547
            ],
            [
                11547,
                11764
            ],
            [
                11764,
                11876
            ],
            [
                11876,
                11956
            ],
            [
                11956,
                12130
            ],
            [
                12130,
                12170
            ],
            [
                12170,
                12221
            ],
            [
                12221,
                12255
            ],
            [
                12255,
                12361
            ],
            [
                12361,
                12392
            ],
            [
                12392,
                12452
            ],
            [
                12452,
                12558
            ],
            [
                12558,
                12707
            ],
            [
                12707,
                12902
            ],
            [
                12902,
                13036
            ],
            [
                13036,
                13114
            ],
            [
                13114,
                13170
            ],
            [
                13170,
                13228
            ],
            [
                13228,
                13276
            ],
            [
                13276,
                13341
            ],
            [
                13341,
                13416
            ],
            [
                13416,
                13585
            ],
            [
                13585,
                13717
            ],
            [
                13717,
                13842
            ],
            [
                13842,
                13993
            ],
            [
                13993,
                14399
            ],
            [
                14399,
                14460
            ],
            [
                14460,
                14633
            ],
            [
                14633,
                14761
            ],
            [
                14761,
                14817
            ],
            [
                14817,
                15064
            ],
            [
                15064,
                15121
            ],
            [
                15121,
                15186
            ],
            [
                15186,
                15208
            ],
            [
                15208,
                15315
            ],
            [
                15315,
                15492
            ],
            [
                15492,
                15587
            ],
            [
                15587,
                15660
            ],
            [
                15660,
                15821
            ],
            [
                15821,
                15914
            ],
            [
                15914,
                15982
            ],
            [
                15982,
                16133
            ],
            [
                16133,
                16175
            ],
            [
                16175,
                16243
            ],
            [
                16243,
                16336
            ],
            [
                16336,
                16426
            ],
            [
                16426,
                16654
            ],
            [
                16654,
                16789
            ],
            [
                16789,
                16833
            ],
            [
                16833,
                17096
            ],
            [
                17096,
                17201
            ],
            [
                17201,
                17347
            ],
            [
                17347,
                17380
            ],
            [
                17380,
                17400
            ],
            [
                17400,
                17434
            ],
            [
                17434,
                17462
            ],
            [
                17462,
                17551
            ],
            [
                17551,
                17604
            ],
            [
                17604,
                17632
            ],
            [
                17632,
                17783
            ],
            [
                17783,
                17850
            ],
            [
                17850,
                17907
            ],
            [
                17907,
                17966
            ],
            [
                17966,
                18020
            ],
            [
                18020,
                18080
            ],
            [
                18080,
                18115
            ],
            [
                18115,
                18236
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                42,
                58
            ],
            [
                64,
                69
            ],
            [
                91,
                93
            ],
            [
                209,
                210
            ],
            [
                110,
                129
            ],
            [
                151,
                155
            ],
            [
                144,
                147
            ],
            [
                129,
                130
            ],
            [
                285,
                358
            ],
            [
                364,
                376
            ],
            [
                396,
                399
            ],
            [
                577,
                578
            ],
            [
                579,
                689
            ],
            [
                689,
                701
            ],
            [
                703,
                706
            ],
            [
                723,
                727
            ],
            [
                720,
                722
            ],
            [
                728,
                741
            ],
            [
                755,
                784
            ],
            [
                784,
                854
            ],
            [
                854,
                915
            ],
            [
                915,
                957
            ],
            [
                967,
                1002
            ],
            [
                1019,
                1041
            ],
            [
                1041,
                1048
            ],
            [
                1061,
                1102
            ],
            [
                1106,
                1160
            ],
            [
                1233,
                1236
            ],
            [
                1254,
                1303
            ],
            [
                1183,
                1186
            ],
            [
                1307,
                1322
            ],
            [
                1103,
                1105
            ],
            [
                1341,
                1353
            ],
            [
                1367,
                1369
            ],
            [
                1369,
                1379
            ],
            [
                1428,
                1477
            ],
            [
                1478,
                1555
            ],
            [
                1555,
                1564
            ],
            [
                1580,
                1584
            ],
            [
                1573,
                1575
            ],
            [
                1597,
                1626
            ],
            [
                1790,
                1864
            ],
            [
                1874,
                1892
            ],
            [
                1911,
                1914
            ],
            [
                1914,
                1953
            ],
            [
                1954,
                1963
            ],
            [
                1963,
                1964
            ],
            [
                1994,
                2025
            ],
            [
                2025,
                2108
            ],
            [
                2108,
                2166
            ],
            [
                2168,
                2175
            ],
            [
                2175,
                2196
            ],
            [
                2196,
                2247
            ],
            [
                2247,
                2255
            ],
            [
                2291,
                2307
            ],
            [
                2262,
                2280
            ],
            [
                2356,
                2358
            ],
            [
                2404,
                2411
            ],
            [
                2464,
                2468
            ],
            [
                2492,
                2514
            ],
            [
                2524,
                2539
            ],
            [
                2541,
                2584
            ],
            [
                3145,
                3149
            ],
            [
                3169,
                3179
            ],
            [
                3157,
                3158
            ],
            [
                3207,
                3218
            ],
            [
                3224,
                3239
            ],
            [
                3314,
                3317
            ],
            [
                3245,
                3254
            ],
            [
                3338,
                3381
            ],
            [
                3387,
                3413
            ],
            [
                3427,
                3434
            ],
            [
                3419,
                3426
            ],
            [
                3444,
                3491
            ],
            [
                3641,
                3688
            ],
            [
                3753,
                3823
            ],
            [
                3824,
                3960
            ],
            [
                3960,
                3989
            ],
            [
                4044,
                4088
            ],
            [
                4088,
                4104
            ],
            [
                4129,
                4177
            ],
            [
                4177,
                4236
            ],
            [
                4236,
                4283
            ],
            [
                4293,
                4302
            ],
            [
                4302,
                4353
            ],
            [
                4353,
                4402
            ],
            [
                4402,
                4435
            ],
            [
                4480,
                4504
            ],
            [
                4510,
                4529
            ],
            [
                4540,
                4586
            ],
            [
                4644,
                4646
            ],
            [
                4646,
                4667
            ],
            [
                4678,
                4679
            ],
            [
                4681,
                4719
            ],
            [
                4719,
                4729
            ],
            [
                4760,
                4813
            ],
            [
                4883,
                4897
            ],
            [
                4908,
                4916
            ],
            [
                4923,
                5019
            ],
            [
                5019,
                5023
            ],
            [
                5032,
                5042
            ],
            [
                5045,
                5082
            ],
            [
                5125,
                5127
            ],
            [
                5127,
                5142
            ],
            [
                5142,
                5158
            ],
            [
                5158,
                5177
            ],
            [
                5186,
                5203
            ],
            [
                5276,
                5377
            ],
            [
                5377,
                5400
            ],
            [
                5400,
                5422
            ],
            [
                5422,
                5465
            ],
            [
                5597,
                5599
            ],
            [
                5599,
                5720
            ],
            [
                5720,
                5761
            ],
            [
                5776,
                5789
            ],
            [
                5791,
                5802
            ],
            [
                5802,
                5870
            ],
            [
                5872,
                5895
            ],
            [
                6010,
                6029
            ],
            [
                6069,
                6129
            ],
            [
                6130,
                6225
            ],
            [
                6263,
                6265
            ],
            [
                6265,
                6268
            ],
            [
                6285,
                6312
            ],
            [
                6320,
                6326
            ],
            [
                6326,
                6452
            ],
            [
                6452,
                6456
            ],
            [
                6457,
                6530
            ],
            [
                6562,
                6564
            ],
            [
                6564,
                6635
            ],
            [
                6636,
                6667
            ],
            [
                6681,
                6706
            ],
            [
                6804,
                6809
            ],
            [
                6729,
                6761
            ],
            [
                6798,
                6803
            ],
            [
                6810,
                6813
            ],
            [
                6851,
                6880
            ],
            [
                6887,
                6889
            ],
            [
                6897,
                6916
            ],
            [
                6917,
                6924
            ],
            [
                6938,
                6944
            ],
            [
                6945,
                7007
            ],
            [
                7007,
                7048
            ],
            [
                7111,
                7178
            ],
            [
                7275,
                7277
            ],
            [
                7277,
                7365
            ],
            [
                7365,
                7368
            ],
            [
                7389,
                7423
            ],
            [
                7425,
                7494
            ],
            [
                7605,
                7621
            ],
            [
                7621,
                7630
            ],
            [
                7639,
                7653
            ],
            [
                7660,
                7715
            ],
            [
                7715,
                7738
            ],
            [
                7770,
                7773
            ],
            [
                7762,
                7768
            ],
            [
                7739,
                7757
            ],
            [
                7787,
                7819
            ],
            [
                7819,
                7848
            ],
            [
                7848,
                7901
            ],
            [
                8002,
                8005
            ],
            [
                8039,
                8098
            ],
            [
                8107,
                8129
            ],
            [
                8130,
                8147
            ],
            [
                8147,
                8153
            ],
            [
                8211,
                8212
            ],
            [
                8228,
                8232
            ],
            [
                8252,
                8362
            ],
            [
                8362,
                8412
            ],
            [
                8420,
                8490
            ],
            [
                8490,
                8516
            ],
            [
                8575,
                8583
            ],
            [
                8583,
                8620
            ],
            [
                8620,
                8648
            ],
            [
                8673,
                8705
            ],
            [
                8919,
                8920
            ],
            [
                8926,
                8955
            ],
            [
                8964,
                9010
            ],
            [
                9010,
                9071
            ],
            [
                9071,
                9093
            ],
            [
                9093,
                9104
            ],
            [
                9129,
                9148
            ],
            [
                9160,
                9186
            ],
            [
                9200,
                9202
            ],
            [
                9202,
                9270
            ],
            [
                9270,
                9295
            ],
            [
                9295,
                9326
            ],
            [
                9326,
                9365
            ],
            [
                9365,
                9407
            ],
            [
                9407,
                9444
            ],
            [
                9444,
                9553
            ],
            [
                9565,
                9573
            ],
            [
                9554,
                9557
            ],
            [
                9589,
                9592
            ],
            [
                9592,
                9606
            ],
            [
                9632,
                9637
            ],
            [
                9625,
                9631
            ],
            [
                9607,
                9622
            ],
            [
                9656,
                9685
            ],
            [
                9685,
                9763
            ],
            [
                9771,
                9773
            ],
            [
                9781,
                9803
            ],
            [
                9813,
                9819
            ],
            [
                9861,
                9863
            ],
            [
                9863,
                9888
            ],
            [
                9914,
                9939
            ],
            [
                9943,
                9958
            ],
            [
                10052,
                10085
            ],
            [
                10154,
                10173
            ],
            [
                10178,
                10179
            ],
            [
                10185,
                10204
            ],
            [
                10334,
                10336
            ],
            [
                10342,
                10350
            ],
            [
                10359,
                10362
            ],
            [
                10375,
                10379
            ],
            [
                10384,
                10406
            ],
            [
                10406,
                10424
            ],
            [
                10448,
                10464
            ],
            [
                10430,
                10444
            ],
            [
                10471,
                10490
            ],
            [
                10507,
                10522
            ],
            [
                10549,
                10556
            ],
            [
                10575,
                10577
            ],
            [
                10577,
                10597
            ],
            [
                10606,
                10616
            ],
            [
                10624,
                10628
            ],
            [
                10637,
                10660
            ],
            [
                10661,
                10712
            ],
            [
                10716,
                10723
            ],
            [
                10730,
                10744
            ],
            [
                10744,
                10779
            ],
            [
                10807,
                10833
            ],
            [
                10834,
                10915
            ],
            [
                10983,
                11032
            ],
            [
                11081,
                11148
            ],
            [
                11148,
                11156
            ],
            [
                11156,
                11182
            ],
            [
                11206,
                11236
            ],
            [
                11236,
                11242
            ],
            [
                11274,
                11278
            ],
            [
                11248,
                11273
            ],
            [
                11303,
                11305
            ],
            [
                11305,
                11320
            ],
            [
                11321,
                11337
            ],
            [
                11337,
                11354
            ],
            [
                11382,
                11466
            ],
            [
                11479,
                11547
            ],
            [
                11547,
                11606
            ],
            [
                11617,
                11625
            ],
            [
                11762,
                11763
            ],
            [
                11743,
                11749
            ],
            [
                11736,
                11742
            ],
            [
                11764,
                11784
            ],
            [
                11810,
                11843
            ],
            [
                11848,
                11851
            ],
            [
                11862,
                11876
            ],
            [
                11876,
                11893
            ],
            [
                11899,
                11939
            ],
            [
                11951,
                11956
            ],
            [
                12037,
                12053
            ],
            [
                12069,
                12129
            ],
            [
                12170,
                12221
            ],
            [
                12255,
                12299
            ],
            [
                12331,
                12361
            ],
            [
                12361,
                12392
            ],
            [
                12392,
                12430
            ],
            [
                12431,
                12433
            ],
            [
                12450,
                12452
            ],
            [
                12496,
                12558
            ],
            [
                12558,
                12569
            ],
            [
                12570,
                12581
            ],
            [
                12593,
                12595
            ],
            [
                12607,
                12613
            ],
            [
                12616,
                12619
            ],
            [
                12656,
                12707
            ],
            [
                12727,
                12844
            ],
            [
                12884,
                12902
            ],
            [
                12902,
                12938
            ],
            [
                12942,
                12944
            ],
            [
                12952,
                12955
            ],
            [
                12963,
                12986
            ],
            [
                13005,
                13036
            ],
            [
                13036,
                13089
            ],
            [
                13112,
                13114
            ],
            [
                13114,
                13170
            ],
            [
                13341,
                13372
            ],
            [
                13374,
                13396
            ],
            [
                13403,
                13416
            ],
            [
                13419,
                13421
            ],
            [
                13427,
                13429
            ],
            [
                13479,
                13484
            ],
            [
                13490,
                13495
            ],
            [
                13518,
                13554
            ],
            [
                13583,
                13585
            ],
            [
                13585,
                13602
            ],
            [
                13635,
                13685
            ],
            [
                13703,
                13717
            ],
            [
                13717,
                13770
            ],
            [
                13780,
                13842
            ],
            [
                13842,
                13857
            ],
            [
                13866,
                13870
            ],
            [
                13858,
                13861
            ],
            [
                13874,
                13907
            ],
            [
                13991,
                13993
            ],
            [
                13993,
                14031
            ],
            [
                14063,
                14132
            ],
            [
                14034,
                14037
            ],
            [
                14145,
                14154
            ],
            [
                14245,
                14308
            ],
            [
                14362,
                14364
            ],
            [
                14369,
                14380
            ],
            [
                14397,
                14399
            ],
            [
                14478,
                14486
            ],
            [
                14408,
                14434
            ],
            [
                14441,
                14458
            ],
            [
                14592,
                14609
            ],
            [
                14631,
                14633
            ],
            [
                14761,
                14817
            ],
            [
                14817,
                14859
            ],
            [
                14874,
                14881
            ],
            [
                14868,
                14873
            ],
            [
                14907,
                14919
            ],
            [
                14958,
                14959
            ],
            [
                14986,
                15015
            ],
            [
                15032,
                15064
            ],
            [
                15064,
                15101
            ],
            [
                15104,
                15121
            ],
            [
                15121,
                15186
            ],
            [
                15186,
                15208
            ],
            [
                15587,
                15624
            ],
            [
                15635,
                15660
            ],
            [
                15660,
                15681
            ],
            [
                15703,
                15706
            ],
            [
                15682,
                15702
            ],
            [
                15755,
                15778
            ],
            [
                15819,
                15821
            ],
            [
                15914,
                15950
            ],
            [
                15957,
                15967
            ],
            [
                15951,
                15956
            ],
            [
                15968,
                15982
            ],
            [
                15982,
                16031
            ],
            [
                16090,
                16094
            ],
            [
                16105,
                16107
            ],
            [
                16108,
                16115
            ],
            [
                16095,
                16104
            ],
            [
                16121,
                16132
            ],
            [
                16175,
                16214
            ],
            [
                16233,
                16243
            ],
            [
                16243,
                16254
            ],
            [
                16255,
                16269
            ],
            [
                16289,
                16324
            ],
            [
                16354,
                16376
            ],
            [
                16334,
                16335
            ],
            [
                16510,
                16608
            ],
            [
                16613,
                16628
            ],
            [
                16461,
                16464
            ],
            [
                16652,
                16653
            ],
            [
                16654,
                16677
            ],
            [
                16685,
                16688
            ],
            [
                16717,
                16738
            ],
            [
                16752,
                16762
            ],
            [
                16777,
                16788
            ],
            [
                16789,
                16833
            ],
            [
                16848,
                16933
            ],
            [
                16942,
                16946
            ],
            [
                16960,
                16969
            ],
            [
                16986,
                17003
            ],
            [
                17005,
                17028
            ],
            [
                17064,
                17071
            ],
            [
                17076,
                17096
            ],
            [
                17201,
                17280
            ],
            [
                17347,
                17380
            ],
            [
                17380,
                17385
            ],
            [
                17387,
                17400
            ],
            [
                17400,
                17434
            ],
            [
                17434,
                17462
            ],
            [
                17462,
                17551
            ],
            [
                17632,
                17633
            ],
            [
                17633,
                17639
            ],
            [
                17646,
                17681
            ],
            [
                17687,
                17715
            ],
            [
                17718,
                17745
            ],
            [
                17755,
                17783
            ],
            [
                17850,
                17905
            ],
            [
                17905,
                17907
            ],
            [
                17907,
                17949
            ],
            [
                17958,
                17966
            ],
            [
                18020,
                18080
            ],
            [
                18080,
                18115
            ],
            [
                18115,
                18168
            ],
            [
                18170,
                18213
            ],
            [
                18218,
                18221
            ],
            [
                18214,
                18217
            ],
            [
                18226,
                18236
            ]
        ],
        "row_chars": [
            [
                0,
                42
            ],
            [
                42,
                285
            ],
            [
                285,
                579
            ],
            [
                579,
                689
            ],
            [
                689,
                784
            ],
            [
                784,
                854
            ],
            [
                854,
                915
            ],
            [
                915,
                1041
            ],
            [
                1041,
                1369
            ],
            [
                1369,
                1478
            ],
            [
                1478,
                1555
            ],
            [
                1555,
                1628
            ],
            [
                1628,
                1690
            ],
            [
                1690,
                1709
            ],
            [
                1709,
                1740
            ],
            [
                1740,
                1790
            ],
            [
                1790,
                1914
            ],
            [
                1914,
                1963
            ],
            [
                1963,
                2025
            ],
            [
                2025,
                2108
            ],
            [
                2108,
                2175
            ],
            [
                2175,
                2196
            ],
            [
                2196,
                2247
            ],
            [
                2247,
                2358
            ],
            [
                2358,
                2584
            ],
            [
                2584,
                2703
            ],
            [
                2703,
                2794
            ],
            [
                2794,
                3037
            ],
            [
                3037,
                3141
            ],
            [
                3141,
                3491
            ],
            [
                3491,
                3641
            ],
            [
                3641,
                3824
            ],
            [
                3824,
                3960
            ],
            [
                3960,
                3989
            ],
            [
                3989,
                4025
            ],
            [
                4025,
                4088
            ],
            [
                4088,
                4177
            ],
            [
                4177,
                4236
            ],
            [
                4236,
                4302
            ],
            [
                4302,
                4353
            ],
            [
                4353,
                4402
            ],
            [
                4402,
                4435
            ],
            [
                4435,
                4480
            ],
            [
                4480,
                4646
            ],
            [
                4646,
                4719
            ],
            [
                4719,
                4814
            ],
            [
                4814,
                4883
            ],
            [
                4883,
                5019
            ],
            [
                5019,
                5127
            ],
            [
                5127,
                5142
            ],
            [
                5142,
                5158
            ],
            [
                5158,
                5377
            ],
            [
                5377,
                5400
            ],
            [
                5400,
                5422
            ],
            [
                5422,
                5599
            ],
            [
                5599,
                5720
            ],
            [
                5720,
                5802
            ],
            [
                5802,
                5898
            ],
            [
                5898,
                6010
            ],
            [
                6010,
                6130
            ],
            [
                6130,
                6265
            ],
            [
                6265,
                6326
            ],
            [
                6326,
                6452
            ],
            [
                6452,
                6564
            ],
            [
                6564,
                6636
            ],
            [
                6636,
                6889
            ],
            [
                6889,
                6945
            ],
            [
                6945,
                7007
            ],
            [
                7007,
                7048
            ],
            [
                7048,
                7111
            ],
            [
                7111,
                7277
            ],
            [
                7277,
                7365
            ],
            [
                7365,
                7494
            ],
            [
                7494,
                7605
            ],
            [
                7605,
                7621
            ],
            [
                7621,
                7715
            ],
            [
                7715,
                7819
            ],
            [
                7819,
                7848
            ],
            [
                7848,
                7901
            ],
            [
                7901,
                7950
            ],
            [
                7950,
                8002
            ],
            [
                8002,
                8130
            ],
            [
                8130,
                8147
            ],
            [
                8147,
                8362
            ],
            [
                8362,
                8490
            ],
            [
                8490,
                8518
            ],
            [
                8518,
                8575
            ],
            [
                8575,
                8583
            ],
            [
                8583,
                8620
            ],
            [
                8620,
                8648
            ],
            [
                8648,
                8955
            ],
            [
                8955,
                9010
            ],
            [
                9010,
                9071
            ],
            [
                9071,
                9093
            ],
            [
                9093,
                9202
            ],
            [
                9202,
                9270
            ],
            [
                9270,
                9295
            ],
            [
                9295,
                9326
            ],
            [
                9326,
                9365
            ],
            [
                9365,
                9407
            ],
            [
                9407,
                9444
            ],
            [
                9444,
                9592
            ],
            [
                9592,
                9685
            ],
            [
                9685,
                9863
            ],
            [
                9863,
                9939
            ],
            [
                9939,
                9960
            ],
            [
                9960,
                10027
            ],
            [
                10027,
                10052
            ],
            [
                10052,
                10085
            ],
            [
                10085,
                10117
            ],
            [
                10117,
                10154
            ],
            [
                10154,
                10229
            ],
            [
                10229,
                10334
            ],
            [
                10334,
                10406
            ],
            [
                10406,
                10577
            ],
            [
                10577,
                10661
            ],
            [
                10661,
                10744
            ],
            [
                10744,
                10834
            ],
            [
                10834,
                11033
            ],
            [
                11033,
                11081
            ],
            [
                11081,
                11148
            ],
            [
                11148,
                11156
            ],
            [
                11156,
                11182
            ],
            [
                11182,
                11206
            ],
            [
                11206,
                11236
            ],
            [
                11236,
                11305
            ],
            [
                11305,
                11337
            ],
            [
                11337,
                11356
            ],
            [
                11356,
                11382
            ],
            [
                11382,
                11547
            ],
            [
                11547,
                11764
            ],
            [
                11764,
                11876
            ],
            [
                11876,
                11956
            ],
            [
                11956,
                12130
            ],
            [
                12130,
                12170
            ],
            [
                12170,
                12221
            ],
            [
                12221,
                12255
            ],
            [
                12255,
                12361
            ],
            [
                12361,
                12392
            ],
            [
                12392,
                12452
            ],
            [
                12452,
                12558
            ],
            [
                12558,
                12707
            ],
            [
                12707,
                12902
            ],
            [
                12902,
                13036
            ],
            [
                13036,
                13114
            ],
            [
                13114,
                13170
            ],
            [
                13170,
                13228
            ],
            [
                13228,
                13276
            ],
            [
                13276,
                13341
            ],
            [
                13341,
                13416
            ],
            [
                13416,
                13585
            ],
            [
                13585,
                13717
            ],
            [
                13717,
                13842
            ],
            [
                13842,
                13993
            ],
            [
                13993,
                14399
            ],
            [
                14399,
                14633
            ],
            [
                14633,
                14761
            ],
            [
                14761,
                14817
            ],
            [
                14817,
                15064
            ],
            [
                15064,
                15121
            ],
            [
                15121,
                15186
            ],
            [
                15186,
                15208
            ],
            [
                15208,
                15315
            ],
            [
                15315,
                15492
            ],
            [
                15492,
                15587
            ],
            [
                15587,
                15660
            ],
            [
                15660,
                15821
            ],
            [
                15821,
                15914
            ],
            [
                15914,
                15982
            ],
            [
                15982,
                16133
            ],
            [
                16133,
                16175
            ],
            [
                16175,
                16243
            ],
            [
                16243,
                16426
            ],
            [
                16426,
                16654
            ],
            [
                16654,
                16789
            ],
            [
                16789,
                16833
            ],
            [
                16833,
                17096
            ],
            [
                17096,
                17201
            ],
            [
                17201,
                17380
            ],
            [
                17380,
                17400
            ],
            [
                17400,
                17434
            ],
            [
                17434,
                17462
            ],
            [
                17462,
                17551
            ],
            [
                17551,
                17604
            ],
            [
                17604,
                17632
            ],
            [
                17632,
                17783
            ],
            [
                17783,
                17850
            ],
            [
                17850,
                17907
            ],
            [
                17907,
                17966
            ],
            [
                17966,
                18020
            ],
            [
                18020,
                18080
            ],
            [
                18080,
                18115
            ],
            [
                18115,
                18236
            ]
        ]
    },
    "abridged": {
        "text": "\"And now I have something to say to you.\" Mr. Broune as he spoke stood up, then sat down again, with a perturbed air.\n\"The susceptible old goose is going to do something highly ridiculous and disagreeable,\" she thought.\n\"Lady Carbury,\" said Mr. Broune, standing up a second time, \"we are neither of us so young as we used to be.\"\n\"No, indeed; and that is why we can afford the luxury of being friends. Nothing but age enables men and women to know each other intimately.\"\nThis speech was a great impediment to Mr. Broune's progress. It was evidently intended to imply that he had reached a time of life at which love would be absurd. And yet he was nearer fifty than sixty, was young for his age, could walk his four or five miles pleasantly, and work through four or five hours of the night with the easy steadiness of sound health. Mr. Broune could see no reason why he should not be in love.\n\"I hope we know each other intimately at any rate,\" he said somewhat lamely.\n\"Oh, yes; that is why I have come to you for advice.\"\n\"When I said that we were neither of us so young as we once were, I uttered a stupid platitude.\"\n\"I did not think so,\" said Lady Carbury, smiling.\n\"I intended something further.\" Mr. Broune had got himself into a difficulty and hardly knew how to get out of it. \"I was going on to say that I hoped we were not too old to - love.\"\nFoolish old darling! What did he mean by making such an ass of himself? This was more troublesome even than the kiss. Lady Carbury even now had no inkling that the editor of the Breakfast Table intended to make her an offer of marriage. That Mr. Broune, blessed with power, a large income, and influence - that he should desire to share her fortunes and misfortunes, her struggles and her poverty, was not within the scope of her imagination. She thought so badly of men and women generally, that she was unable to conceive the possibility of such a sacrifice.\n\"Mr. Broune,\" she said, \"I did not think that you would take advantage of the confidence I have placed in you to annoy me in this way.\"\n\"To annoy you, Lady Carbury! I have determined to ask you to be my wife. That I should be - annoyed by your refusal, is a matter of course. That I ought to expect such annoyance is perhaps too true. But you can extricate yourself from the dilemma easily.\"\nThe word \"wife\" came upon her like a thunder-clap. It at once changed all her feelings towards him. She did not dream of loving him. Had it been on the cards for her to love any man, it would have been some handsome spendthrift. This man was a friend, to be used because he knew the world. And now he showed that he knew as little of the world as any other man.\nBut mixed with these feelings was a tenderness which brought back some memory of her distant youth, and almost made her weep. That such a man should offer to take half her burdens! What an idiot! But what a God! She had looked upon him as all intellect, and now she found that he not only had a human heart in his bosom, but a heart that she could touch. How wonderfully sweet! How infinitely small!\nIt was necessary that she should answer him. It did not occur to her that she could love him; but it did occur to her that he might lift her out of her difficulties. What a benefit it would be to her to have such a father for Felix! How easy would be a literary career to the wife of the editor of the Morning Breakfast Table! Would not the world come to her drawing-room if she were the wife of Mr. Broune?\nIt all passed through her brain at once during that minute of silence which she allowed herself. But other feelings were present also. Perhaps the truest aspiration of her heart had been the love of freedom which the tyranny of her late husband had engendered. Once, she had fled from that tyranny and had been almost crushed by the censure that followed. Then her husband's protection and his tyranny had been restored to her.\nAfter that the freedom had come; accompanied by many hopes still unfulfilled, and embittered by many sorrows; but the memory of the tyranny was very clear. The minute was over, and she must speak.\n\"Mr. Broune,\" she said, \"you have quite taken away my breath. I never expected anything of this kind.\"\n\"Lady Carbury,\" he said, \"I have lived a long time without marrying. I have worked so hard all my life that when I was young I had no time to think of love. And my mind has been so fully employed that I have hardly realised the want which nevertheless I have felt. Then I met you. As I said, perhaps with little gallantry, you also are not as young as you once were. But you keep the beauty and energy of your youth, and the freshness of a young heart. And I have come to love you. I speak with absolute frankness, risking your anger. But if you can confide your happiness with me, I am prepared to entrust mine to your keeping.\"\nPoor Mr. Broune! Though a gifted editor, he showed little capacity for reading a woman's character when he talked of the freshness of Lady Carbury's young mind! And he must have surely been much blinded by love, in convincing himself that he could trust his happiness to such keeping.\n\"You do me infinite honour.\"\n\"Well?\"\n\"How am I to answer you at a moment? I expected nothing of this. It has come upon me like a dream; I can hardly yet believe it. How am I to know my own feelings so suddenly? Marriage as I have found it, Mr. Broune, has not been happy. I have suffered much. I have been hurt in every nerve - tortured till I could hardly endure it. At last I got my liberty, and to that I have looked for happiness.\"\n\"Has it made you happy?\"\n\"It has made me less wretched. And there is so much to be considered! I have a son and a daughter, Mr. Broune.\"\n\"Your daughter I can love as my own. I think I prove my devotion to you when I say that I am willing for your sake to encounter the troubles which your son may face.\"\n\"Mr. Broune, I shall always love him better than anything in the world.\" This was calculated to damp the lover's ardour, but he probably reflected that if he were successful, time might change her feelings. \"Mr. Broune,\" she said, \"you had better leave me. It is very late.\"\n\"When may I hope for an answer?\"\n\"I will write to you - tomorrow; say the day after tomorrow.\" He kissed her hand and left without another word.\nAs he was about to let himself out, the front door was opened from the other side, and Sir Felix entered. The young man looked at Mr. Broune with impudence and surprise.\n\"Halloo, old fellow,\" he said, \"you've been keeping up late, haven't you?\" He was nearly drunk, and Mr. Broune passed him without a word.\nLady Carbury was still standing in the drawing-room, struck with amazement at the proposal and wondering what she should do, when she heard her son stumbling up the stairs.\n\"Felix,\" she said, \"why do you make so much noise as you come in?\"\n\"Noish! I'm not making any noish. Your people's only just gone. I shaw that editor fellow at the door. He'sh great assh, that fellow. All right, mother.\" And so he stumbled up to bed, and his mother followed him to see that the candle was placed squarely on the table, beyond the reach of the bed curtains.\nMr. Broune as he walked to his newspaper office experienced many pangs of doubt. Would it have been better if he had not spoken? That last apparition at his lady love's door certainly did not reassure him. What curse can be greater than that inflicted by a drunken son? Why should a man unnecessarily afflict himself with so terrible a misfortune?\nThen thousands of other thoughts crowded upon him. He must have a new house, and new ways; must fit himself to new pleasures. And what was he to gain by it? Lady Carbury was a handsome woman, and, he thought, a clever woman. Because she had flattered him, he had liked her conversation. He had been around long enough to know better - and he almost felt that he ought to have known better. He warmed himself a little with the remembrance of her beauty, and told himself that his new home would be pleasanter than the old one. He tried to make the best of it; but he was repressed by the memory of that drunken young baronet.\nWhether for good or for evil, the step had been taken. It did not occur to him that the lady would refuse him. Of course she would accept him; and of course he would stick to his guns. He tried to feel complacent; but underneath there was a substratum of melancholy.\nLady Carbury went to her own chamber, and there sat thinking through most of the night. During these hours she perhaps became a better woman, more oblivious of herself, than she had been for many a year. It could not be good for this man that he should marry her. Although in the moments of her triumph she would buoy herself up with assurances that her Felix would become wealthy and brilliant, still in her heart of hearts she knew how great was the peril of catastrophe. He might go utterly to the dogs and take her with him - married or single. He was the one thing in the world that overpowered her. In all other matters she could scheme, and pretend, and overcome her feelings, telling herself that passions were simply weapons to be used. But her love for her son mastered her - and she knew it. As it was so, could it be fit that she should marry another man?\nAnd then her liberty! A repetition of marriage vows did not recommend itself to her. As to loving the man, and liking his caresses, she imagined no romance of that kind. If Felix should go to the dogs, then Mr. Broune would not want her. Should Felix go to the stars instead of the dogs, then he - and she - would not need Mr. Broune.\nShe thought very little of her daughter in all this. There was a comfortable home for Hetta, if Hetta would only condescend to marry her cousin Roger. Hetta's life was so much at her own disposal that her mother did not feel herself bound to be guided in this great matter by her wishes. But she must tell Hetta if she decided to marry the man, and the sooner the better.\nOn that night she did not make up her mind. Even as she declared to herself that she would not marry him, the picture of a comfortable home, and the power of the editor of the Morning Breakfast Table brought doubts to her mind. The next morning she met Hetta at breakfast, and with assumed nonchalance asked, \"Do you like Mr. Broune, Hetta?\"\n\"Yes; pretty well. I don't care very much about him. What makes you ask, mamma?\"\n\"Because among my acquaintances in London there is no one so truly kind to me as he is.\"\n\"I think he has that air of selfishness which is so common with people in London - as though what he said were out of surface politeness.\"\n\"Why should not London people be as kind as other people, Hetta? I think Mr. Broune is as obliging a man as anyone I know. But the only person you seem to think well of is Mr. Montague.\"\n\"Mamma, that is unfair and unkind. I never mention Mr. Montague's name if I can help it, and I should not have spoken of Mr. Broune, unless you had asked me.\"",
        "paragraph_chars": [
            [
                0,
                118
            ],
            [
                118,
                220
            ],
            [
                220,
                330
            ],
            [
                330,
                472
            ],
            [
                472,
                895
            ],
            [
                895,
                972
            ],
            [
                972,
                1026
            ],
            [
                1026,
                1123
            ],
            [
                1123,
                1173
            ],
            [
                1173,
                1356
            ],
            [
                1356,
                1917
            ],
            [
                1917,
                2053
            ],
            [
                2053,
                2309
            ],
            [
                2309,
                2671
            ],
            [
                2671,
                3071
            ],
            [
                3071,
                3479
            ],
            [
                3479,
                3907
            ],
            [
                3907,
                4104
            ],
            [
                4104,
                4207
            ],
            [
                4207,
                4837
            ],
            [
                4837,
                5122
            ],
            [
                5122,
                5151
            ],
            [
                5151,
                5159
            ],
            [
                5159,
                5558
            ],
            [
                5558,
                5583
            ],
            [
                5583,
                5695
            ],
            [
                5695,
                5862
            ],
            [
                5862,
                6137
            ],
            [
                6137,
                6170
            ],
            [
                6170,
                6282
            ],
            [
                6282,
                6452
            ],
            [
                6452,
                6590
            ],
            [
                6590,
                6763
            ],
            [
                6763,
                6830
            ],
            [
                6830,
                7137
            ],
            [
                7137,
                7485
            ],
            [
                7485,
                8110
            ],
            [
                8110,
                8377
            ],
            [
                8377,
                9245
            ],
            [
                9245,
                9580
            ],
            [
                9580,
                9952
            ],
            [
                9952,
                10294
            ],
            [
                10294,
                10375
            ],
            [
                10375,
                10464
            ],
            [
                10464,
                10603
            ],
            [
                10603,
                10790
            ],
            [
                10790,
                10948
            ]
        ],
        "segment_chars": [
            [
                0,
                42
            ],
            [
                42,
                118
            ],
            [
                118,
                220
            ],
            [
                220,
                330
            ],
            [
                330,
                402
            ],
            [
                402,
                472
            ],
            [
                472,
                533
            ],
            [
                533,
                634
            ],
            [
                634,
                834
            ],
            [
                834,
                895
            ],
            [
                895,
                972
            ],
            [
                972,
                1026
            ],
            [
                1026,
                1123
            ],
            [
                1123,
                1173
            ],
            [
                1173,
                1205
            ],
            [
                1205,
                1288
            ],
            [
                1288,
                1356
            ],
            [
                1356,
                1377
            ],
            [
                1377,
                1428
            ],
            [
                1428,
                1474
            ],
            [
                1474,
                1593
            ],
            [
                1593,
                1799
            ],
            [
                1799,
                1917
            ],
            [
                1917,
                2053
            ],
            [
                2053,
                2082
            ],
            [
                2082,
                2126
            ],
            [
                2126,
                2193
            ],
            [
                2193,
                2252
            ],
            [
                2252,
                2309
            ],
            [
                2309,
                2360
            ],
            [
                2360,
                2409
            ],
            [
                2409,
                2442
            ],
            [
                2442,
                2538
            ],
            [
                2538,
                2599
            ],
            [
                2599,
                2671
            ],
            [
                2671,
                2797
            ],
            [
                2797,
                2852
            ],
            [
                2852,
                2867
            ],
            [
                2867,
                2883
            ],
            [
                2883,
                3026
            ],
            [
                3026,
                3049
            ],
            [
                3049,
                3071
            ],
            [
                3071,
                3116
            ],
            [
                3116,
                3237
            ],
            [
                3237,
                3304
            ],
            [
                3304,
                3398
            ],
            [
                3398,
                3479
            ],
            [
                3479,
                3576
            ],
            [
                3576,
                3614
            ],
            [
                3614,
                3740
            ],
            [
                3740,
                3835
            ],
            [
                3835,
                3907
            ],
            [
                3907,
                4063
            ],
            [
                4063,
                4104
            ],
            [
                4104,
                4166
            ],
            [
                4166,
                4207
            ],
            [
                4207,
                4276
            ],
            [
                4276,
                4364
            ],
            [
                4364,
                4472
            ],
            [
                4472,
                4488
            ],
            [
                4488,
                4574
            ],
            [
                4574,
                4660
            ],
            [
                4660,
                4689
            ],
            [
                4689,
                4742
            ],
            [
                4742,
                4837
            ],
            [
                4837,
                4854
            ],
            [
                4854,
                4998
            ],
            [
                4998,
                5122
            ],
            [
                5122,
                5151
            ],
            [
                5151,
                5159
            ],
            [
                5159,
                5196
            ],
            [
                5196,
                5224
            ],
            [
                5224,
                5287
            ],
            [
                5287,
                5333
            ],
            [
                5333,
                5394
            ],
            [
                5394,
                5416
            ],
            [
                5416,
                5490
            ],
            [
                5490,
                5558
            ],
            [
                5558,
                5583
            ],
            [
                5583,
                5614
            ],
            [
                5614,
                5653
            ],
            [
                5653,
                5695
            ],
            [
                5695,
                5732
            ],
            [
                5732,
                5862
            ],
            [
                5862,
                5935
            ],
            [
                5935,
                6069
            ],
            [
                6069,
                6119
            ],
            [
                6119,
                6137
            ],
            [
                6137,
                6170
            ],
            [
                6170,
                6232
            ],
            [
                6232,
                6282
            ],
            [
                6282,
                6388
            ],
            [
                6388,
                6452
            ],
            [
                6452,
                6527
            ],
            [
                6527,
                6590
            ],
            [
                6590,
                6763
            ],
            [
                6763,
                6830
            ],
            [
                6830,
                6838
            ],
            [
                6838,
                6864
            ],
            [
                6864,
                6894
            ],
            [
                6894,
                6933
            ],
            [
                6933,
                6964
            ],
            [
                6964,
                6984
            ],
            [
                6984,
                7137
            ],
            [
                7137,
                7218
            ],
            [
                7218,
                7266
            ],
            [
                7266,
                7343
            ],
            [
                7343,
                7407
            ],
            [
                7407,
                7485
            ],
            [
                7485,
                7536
            ],
            [
                7536,
                7611
            ],
            [
                7611,
                7642
            ],
            [
                7642,
                7710
            ],
            [
                7710,
                7772
            ],
            [
                7772,
                7875
            ],
            [
                7875,
                8011
            ],
            [
                8011,
                8110
            ],
            [
                8110,
                8165
            ],
            [
                8165,
                8221
            ],
            [
                8221,
                8295
            ],
            [
                8295,
                8377
            ],
            [
                8377,
                8465
            ],
            [
                8465,
                8581
            ],
            [
                8581,
                8641
            ],
            [
                8641,
                8851
            ],
            [
                8851,
                8926
            ],
            [
                8926,
                8982
            ],
            [
                8982,
                9123
            ],
            [
                9123,
                9180
            ],
            [
                9180,
                9245
            ],
            [
                9245,
                9267
            ],
            [
                9267,
                9330
            ],
            [
                9330,
                9415
            ],
            [
                9415,
                9483
            ],
            [
                9483,
                9580
            ],
            [
                9580,
                9633
            ],
            [
                9633,
                9731
            ],
            [
                9731,
                9868
            ],
            [
                9868,
                9952
            ],
            [
                9952,
                9996
            ],
            [
                9996,
                10180
            ],
            [
                10180,
                10294
            ],
            [
                10294,
                10313
            ],
            [
                10313,
                10347
            ],
            [
                10347,
                10375
            ],
            [
                10375,
                10464
            ],
            [
                10464,
                10603
            ],
            [
                10603,
                10668
            ],
            [
                10668,
                10726
            ],
            [
                10726,
                10790
            ],
            [
                10790,
                10825
            ],
            [
                10825,
                10948
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                42,
                58
            ],
            [
                59,
                64
            ],
            [
                71,
                73
            ],
            [
                73,
                74
            ],
            [
                75,
                94
            ],
            [
                103,
                107
            ],
            [
                113,
                116
            ],
            [
                116,
                117
            ],
            [
                118,
                191
            ],
            [
                192,
                204
            ],
            [
                207,
                210
            ],
            [
                218,
                219
            ],
            [
                220,
                330
            ],
            [
                330,
                342
            ],
            [
                343,
                346
            ],
            [
                347,
                351
            ],
            [
                352,
                354
            ],
            [
                359,
                372
            ],
            [
                373,
                402
            ],
            [
                402,
                472
            ],
            [
                472,
                533
            ],
            [
                533,
                575
            ],
            [
                576,
                611
            ],
            [
                612,
                634
            ],
            [
                634,
                641
            ],
            [
                642,
                683
            ],
            [
                688,
                742
            ],
            [
                743,
                746
            ],
            [
                747,
                796
            ],
            [
                797,
                800
            ],
            [
                801,
                816
            ],
            [
                817,
                819
            ],
            [
                820,
                832
            ],
            [
                832,
                834
            ],
            [
                834,
                844
            ],
            [
                845,
                894
            ],
            [
                895,
                972
            ],
            [
                972,
                981
            ],
            [
                982,
                986
            ],
            [
                987,
                989
            ],
            [
                994,
                1023
            ],
            [
                1027,
                1101
            ],
            [
                1102,
                1120
            ],
            [
                1120,
                1123
            ],
            [
                1123,
                1162
            ],
            [
                1164,
                1173
            ],
            [
                1173,
                1174
            ],
            [
                1174,
                1205
            ],
            [
                1205,
                1288
            ],
            [
                1288,
                1346
            ],
            [
                1349,
                1356
            ],
            [
                1356,
                1377
            ],
            [
                1377,
                1428
            ],
            [
                1428,
                1436
            ],
            [
                1437,
                1453
            ],
            [
                1454,
                1472
            ],
            [
                1472,
                1474
            ],
            [
                1479,
                1486
            ],
            [
                1487,
                1491
            ],
            [
                1511,
                1533
            ],
            [
                1534,
                1549
            ],
            [
                1550,
                1593
            ],
            [
                1593,
                1597
            ],
            [
                1598,
                1608
            ],
            [
                1608,
                1609
            ],
            [
                1618,
                1629
            ],
            [
                1630,
                1645
            ],
            [
                1646,
                1649
            ],
            [
                1650,
                1659
            ],
            [
                1662,
                1705
            ],
            [
                1710,
                1736
            ],
            [
                1737,
                1744
            ],
            [
                1745,
                1752
            ],
            [
                1752,
                1799
            ],
            [
                1799,
                1846
            ],
            [
                1846,
                1916
            ],
            [
                1917,
                2053
            ],
            [
                2053,
                2082
            ],
            [
                2082,
                2126
            ],
            [
                2126,
                2142
            ],
            [
                2145,
                2193
            ],
            [
                2193,
                2252
            ],
            [
                2252,
                2299
            ],
            [
                2300,
                2309
            ],
            [
                2309,
                2360
            ],
            [
                2360,
                2409
            ],
            [
                2409,
                2442
            ],
            [
                2442,
                2466
            ],
            [
                2471,
                2490
            ],
            [
                2490,
                2536
            ],
            [
                2536,
                2538
            ],
            [
                2538,
                2559
            ],
            [
                2559,
                2560
            ],
            [
                2561,
                2599
            ],
            [
                2599,
                2609
            ],
            [
                2617,
                2670
            ],
            [
                2671,
                2685
            ],
            [
                2692,
                2700
            ],
            [
                2701,
                2797
            ],
            [
                2797,
                2801
            ],
            [
                2802,
                2812
            ],
            [
                2813,
                2850
            ],
            [
                2850,
                2852
            ],
            [
                2852,
                2867
            ],
            [
                2867,
                2883
            ],
            [
                2883,
                2902
            ],
            [
                2907,
                2924
            ],
            [
                2925,
                3026
            ],
            [
                3026,
                3049
            ],
            [
                3049,
                3071
            ],
            [
                3071,
                3114
            ],
            [
                3114,
                3116
            ],
            [
                3116,
                3237
            ],
            [
                3237,
                3278
            ],
            [
                3279,
                3292
            ],
            [
                3293,
                3304
            ],
            [
                3304,
                3372
            ],
            [
                3373,
                3396
            ],
            [
                3398,
                3417
            ],
            [
                3418,
                3478
            ],
            [
                3479,
                3574
            ],
            [
                3574,
                3576
            ],
            [
                3576,
                3579
            ],
            [
                3580,
                3607
            ],
            [
                3608,
                3614
            ],
            [
                3614,
                3740
            ],
            [
                3740,
                3744
            ],
            [
                3746,
                3819
            ],
            [
                3833,
                3835
            ],
            [
                3835,
                3906
            ],
            [
                3907,
                3938
            ],
            [
                3940,
                3965
            ],
            [
                3966,
                3971
            ],
            [
                3983,
                4015
            ],
            [
                4015,
                4020
            ],
            [
                4021,
                4024
            ],
            [
                4032,
                4061
            ],
            [
                4061,
                4063
            ],
            [
                4063,
                4082
            ],
            [
                4084,
                4091
            ],
            [
                4097,
                4103
            ],
            [
                4104,
                4166
            ],
            [
                4166,
                4207
            ],
            [
                4207,
                4274
            ],
            [
                4274,
                4276
            ],
            [
                4276,
                4364
            ],
            [
                4364,
                4367
            ],
            [
                4368,
                4402
            ],
            [
                4403,
                4472
            ],
            [
                4472,
                4488
            ],
            [
                4488,
                4497
            ],
            [
                4497,
                4511
            ],
            [
                4519,
                4574
            ],
            [
                4574,
                4597
            ],
            [
                4598,
                4601
            ],
            [
                4602,
                4608
            ],
            [
                4609,
                4627
            ],
            [
                4628,
                4660
            ],
            [
                4660,
                4689
            ],
            [
                4689,
                4742
            ],
            [
                4742,
                4745
            ],
            [
                4746,
                4805
            ],
            [
                4814,
                4836
            ],
            [
                4837,
                4854
            ],
            [
                4854,
                4860
            ],
            [
                4861,
                4862
            ],
            [
                4876,
                4880
            ],
            [
                4888,
                4998
            ],
            [
                4998,
                5048
            ],
            [
                5052,
                5122
            ],
            [
                5122,
                5148
            ],
            [
                5151,
                5159
            ],
            [
                5159,
                5196
            ],
            [
                5196,
                5224
            ],
            [
                5224,
                5256
            ],
            [
                5256,
                5257
            ],
            [
                5258,
                5287
            ],
            [
                5287,
                5333
            ],
            [
                5333,
                5394
            ],
            [
                5394,
                5416
            ],
            [
                5416,
                5427
            ],
            [
                5428,
                5447
            ],
            [
                5459,
                5485
            ],
            [
                5488,
                5490
            ],
            [
                5490,
                5558
            ],
            [
                5558,
                5583
            ],
            [
                5583,
                5614
            ],
            [
                5614,
                5653
            ],
            [
                5653,
                5695
            ],
            [
                5695,
                5732
            ],
            [
                5732,
                5841
            ],
            [
                5842,
                5850
            ],
            [
                5851,
                5854
            ],
            [
                5859,
                5862
            ],
            [
                5862,
                5876
            ],
            [
                5877,
                5882
            ],
            [
                5883,
                5889
            ],
            [
                5890,
                5905
            ],
            [
                5906,
                5935
            ],
            [
                5935,
                6013
            ],
            [
                6017,
                6019
            ],
            [
                6025,
                6047
            ],
            [
                6048,
                6054
            ],
            [
                6067,
                6069
            ],
            [
                6069,
                6094
            ],
            [
                6094,
                6119
            ],
            [
                6119,
                6134
            ],
            [
                6137,
                6170
            ],
            [
                6171,
                6190
            ],
            [
                6191,
                6192
            ],
            [
                6201,
                6220
            ],
            [
                6232,
                6234
            ],
            [
                6242,
                6250
            ],
            [
                6251,
                6254
            ],
            [
                6255,
                6259
            ],
            [
                6260,
                6282
            ],
            [
                6282,
                6300
            ],
            [
                6301,
                6317
            ],
            [
                6318,
                6332
            ],
            [
                6344,
                6363
            ],
            [
                6363,
                6378
            ],
            [
                6379,
                6386
            ],
            [
                6386,
                6388
            ],
            [
                6388,
                6408
            ],
            [
                6412,
                6422
            ],
            [
                6423,
                6427
            ],
            [
                6428,
                6451
            ],
            [
                6452,
                6503
            ],
            [
                6504,
                6511
            ],
            [
                6513,
                6527
            ],
            [
                6527,
                6562
            ],
            [
                6563,
                6589
            ],
            [
                6590,
                6671
            ],
            [
                6713,
                6762
            ],
            [
                6763,
                6830
            ],
            [
                6830,
                6838
            ],
            [
                6838,
                6864
            ],
            [
                6864,
                6894
            ],
            [
                6894,
                6900
            ],
            [
                6901,
                6905
            ],
            [
                6906,
                6931
            ],
            [
                6931,
                6933
            ],
            [
                6933,
                6948
            ],
            [
                6948,
                6964
            ],
            [
                6964,
                6981
            ],
            [
                6984,
                7068
            ],
            [
                7069,
                7137
            ],
            [
                7137,
                7196
            ],
            [
                7202,
                7210
            ],
            [
                7216,
                7217
            ],
            [
                7237,
                7243
            ],
            [
                7247,
                7253
            ],
            [
                7266,
                7286
            ],
            [
                7287,
                7320
            ],
            [
                7325,
                7328
            ],
            [
                7329,
                7343
            ],
            [
                7343,
                7360
            ],
            [
                7361,
                7401
            ],
            [
                7402,
                7407
            ],
            [
                7407,
                7423
            ],
            [
                7424,
                7484
            ],
            [
                7485,
                7536
            ],
            [
                7536,
                7580
            ],
            [
                7581,
                7611
            ],
            [
                7611,
                7642
            ],
            [
                7642,
                7680
            ],
            [
                7682,
                7684
            ],
            [
                7708,
                7710
            ],
            [
                7710,
                7772
            ],
            [
                7772,
                7783
            ],
            [
                7791,
                7802
            ],
            [
                7803,
                7805
            ],
            [
                7811,
                7817
            ],
            [
                7820,
                7823
            ],
            [
                7824,
                7875
            ],
            [
                7875,
                7992
            ],
            [
                7993,
                8011
            ],
            [
                8011,
                8047
            ],
            [
                8048,
                8050
            ],
            [
                8051,
                8054
            ],
            [
                8055,
                8078
            ],
            [
                8079,
                8110
            ],
            [
                8110,
                8163
            ],
            [
                8163,
                8165
            ],
            [
                8165,
                8221
            ],
            [
                8221,
                8252
            ],
            [
                8253,
                8275
            ],
            [
                8282,
                8295
            ],
            [
                8295,
                8297
            ],
            [
                8304,
                8306
            ],
            [
                8312,
                8317
            ],
            [
                8322,
                8327
            ],
            [
                8339,
                8375
            ],
            [
                8375,
                8377
            ],
            [
                8377,
                8394
            ],
            [
                8395,
                8445
            ],
            [
                8451,
                8465
            ],
            [
                8465,
                8518
            ],
            [
                8519,
                8581
            ],
            [
                8581,
                8596
            ],
            [
                8597,
                8601
            ],
            [
                8602,
                8605
            ],
            [
                8606,
                8639
            ],
            [
                8639,
                8641
            ],
            [
                8641,
                8679
            ],
            [
                8680,
                8749
            ],
            [
                8758,
                8761
            ],
            [
                8762,
                8771
            ],
            [
                8771,
                8834
            ],
            [
                8835,
                8837
            ],
            [
                8838,
                8849
            ],
            [
                8849,
                8851
            ],
            [
                8851,
                8859
            ],
            [
                8860,
                8886
            ],
            [
                8887,
                8904
            ],
            [
                8907,
                8924
            ],
            [
                8924,
                8926
            ],
            [
                8926,
                8982
            ],
            [
                8982,
                9024
            ],
            [
                9025,
                9032
            ],
            [
                9032,
                9037
            ],
            [
                9047,
                9059
            ],
            [
                9059,
                9060
            ],
            [
                9061,
                9090
            ],
            [
                9091,
                9123
            ],
            [
                9123,
                9160
            ],
            [
                9163,
                9180
            ],
            [
                9180,
                9245
            ],
            [
                9245,
                9267
            ],
            [
                9267,
                9304
            ],
            [
                9305,
                9330
            ],
            [
                9330,
                9351
            ],
            [
                9352,
                9355
            ],
            [
                9356,
                9376
            ],
            [
                9390,
                9413
            ],
            [
                9413,
                9415
            ],
            [
                9415,
                9451
            ],
            [
                9452,
                9462
            ],
            [
                9463,
                9468
            ],
            [
                9469,
                9483
            ],
            [
                9483,
                9532
            ],
            [
                9533,
                9537
            ],
            [
                9538,
                9540
            ],
            [
                9543,
                9550
            ],
            [
                9553,
                9562
            ],
            [
                9568,
                9579
            ],
            [
                9580,
                9619
            ],
            [
                9623,
                9633
            ],
            [
                9633,
                9644
            ],
            [
                9657,
                9671
            ],
            [
                9671,
                9706
            ],
            [
                9707,
                9729
            ],
            [
                9729,
                9730
            ],
            [
                9736,
                9834
            ],
            [
                9840,
                9855
            ],
            [
                9856,
                9859
            ],
            [
                9866,
                9867
            ],
            [
                9868,
                9891
            ],
            [
                9895,
                9898
            ],
            [
                9907,
                9928
            ],
            [
                9929,
                9939
            ],
            [
                9940,
                9951
            ],
            [
                9952,
                9996
            ],
            [
                10001,
                10086
            ],
            [
                10087,
                10091
            ],
            [
                10091,
                10100
            ],
            [
                10110,
                10127
            ],
            [
                10128,
                10151
            ],
            [
                10152,
                10159
            ],
            [
                10160,
                10180
            ],
            [
                10180,
                10259
            ],
            [
                10261,
                10294
            ],
            [
                10294,
                10299
            ],
            [
                10300,
                10313
            ],
            [
                10313,
                10347
            ],
            [
                10347,
                10375
            ],
            [
                10375,
                10464
            ],
            [
                10464,
                10465
            ],
            [
                10473,
                10479
            ],
            [
                10480,
                10515
            ],
            [
                10516,
                10544
            ],
            [
                10547,
                10574
            ],
            [
                10575,
                10603
            ],
            [
                10604,
                10659
            ],
            [
                10666,
                10668
            ],
            [
                10668,
                10710
            ],
            [
                10718,
                10726
            ],
            [
                10730,
                10790
            ],
            [
                10790,
                10825
            ],
            [
                10825,
                10878
            ],
            [
                10879,
                10922
            ],
            [
                10930,
                10933
            ],
            [
                10934,
                10937
            ],
            [
                10938,
                10948
            ]
        ],
        "row_chars": [
            [
                0,
                42
            ],
            [
                42,
                118
            ],
            [
                118,
                220
            ],
            [
                220,
                330
            ],
            [
                330,
                402
            ],
            [
                402,
                472
            ],
            [
                472,
                533
            ],
            [
                533,
                634
            ],
            [
                634,
                834
            ],
            [
                834,
                895
            ],
            [
                895,
                972
            ],
            [
                972,
                1026
            ],
            [
                1026,
                1026
            ],
            [
                1026,
                1026
            ],
            [
                1026,
                1026
            ],
            [
                1026,
                1026
            ],
            [
                1026,
                1123
            ],
            [
                1123,
                1173
            ],
            [
                1173,
                1205
            ],
            [
                1205,
                1288
            ],
            [
                1288,
                1356
            ],
            [
                1356,
                1377
            ],
            [
                1377,
                1428
            ],
            [
                1428,
                1474
            ],
            [
                1474,
                1593
            ],
            [
                1593,
                1593
            ],
            [
                1593,
                1593
            ],
            [
                1593,
                1593
            ],
            [
                1593,
                1593
            ],
            [
                1593,
                1799
            ],
            [
                1799,
                1799
            ],
            [
                1799,
                1917
            ],
            [
                1917,
                2053
            ],
            [
                2053,
                2082
            ],
            [
                2082,
                2082
            ],
            [
                2082,
                2126
            ],
            [
                2126,
                2193
            ],
            [
                2193,
                2252
            ],
            [
                2252,
                2309
            ],
            [
                2309,
                2360
            ],
            [
                2360,
                2409
            ],
            [
                2409,
                2442
            ],
            [
                2442,
                2442
            ],
            [
                2442,
                2538
            ],
            [
                2538,
                2599
            ],
            [
                2599,
                2671
            ],
            [
                2671,
                2671
            ],
            [
                2671,
                2797
            ],
            [
                2797,
                2852
            ],
            [
                2852,
                2867
            ],
            [
                2867,
                2883
            ],
            [
                2883,
                3026
            ],
            [
                3026,
                3049
            ],
            [
                3049,
                3071
            ],
            [
                3071,
                3116
            ],
            [
                3116,
                3237
            ],
            [
                3237,
                3304
            ],
            [
                3304,
                3398
            ],
            [
                3398,
                3398
            ],
            [
                3398,
                3479
            ],
            [
                3479,
                3576
            ],
            [
                3576,
                3614
            ],
            [
                3614,
                3740
            ],
            [
                3740,
                3835
            ],
            [
                3835,
                3907
            ],
            [
                3907,
                4063
            ],
            [
                4063,
                4104
            ],
            [
                4104,
                4166
            ],
            [
                4166,
                4207
            ],
            [
                4207,
                4207
            ],
            [
                4207,
                4276
            ],
            [
                4276,
                4364
            ],
            [
                4364,
                4472
            ],
            [
                4472,
                4472
            ],
            [
                4472,
                4488
            ],
            [
                4488,
                4574
            ],
            [
                4574,
                4660
            ],
            [
                4660,
                4689
            ],
            [
                4689,
                4742
            ],
            [
                4742,
                4742
            ],
            [
                4742,
                4742
            ],
            [
                4742,
                4837
            ],
            [
                4837,
                4854
            ],
            [
                4854,
                4998
            ],
            [
                4998,
                5122
            ],
            [
                5122,
                5151
            ],
            [
                5151,
                5151
            ],
            [
                5151,
                5159
            ],
            [
                5159,
                5196
            ],
            [
                5196,
                5224
            ],
            [
                5224,
                5287
            ],
            [
                5287,
                5333
            ],
            [
                5333,
                5394
            ],
            [
                5394,
                5416
            ],
            [
                5416,
                5490
            ],
            [
                5490,
                5558
            ],
            [
                5558,
                5583
            ],
            [
                5583,
                5614
            ],
            [
                5614,
                5653
            ],
            [
                5653,
                5695
            ],
            [
                5695,
                5732
            ],
            [
                5732,
                5862
            ],
            [
                5862,
                5935
            ],
            [
                5935,
                6069
            ],
            [
                6069,
                6119
            ],
            [
                6119,
                6137
            ],
            [
                6137,
                6137
            ],
            [
                6137,
                6137
            ],
            [
                6137,
                6170
            ],
            [
                6170,
                6170
            ],
            [
                6170,
                6170
            ],
            [
                6170,
                6232
            ],
            [
                6232,
                6232
            ],
            [
                6232,
                6282
            ],
            [
                6282,
                6388
            ],
            [
                6388,
                6452
            ],
            [
                6452,
                6527
            ],
            [
                6527,
                6590
            ],
            [
                6590,
                6763
            ],
            [
                6763,
                6763
            ],
            [
                6763,
                6830
            ],
            [
                6830,
                6838
            ],
            [
                6838,
                6864
            ],
            [
                6864,
                6864
            ],
            [
                6864,
                6894
            ],
            [
                6894,
                6933
            ],
            [
                6933,
                6964
            ],
            [
                6964,
                6984
            ],
            [
                6984,
                6984
            ],
            [
                6984,
                7137
            ],
            [
                7137,
                7266
            ],
            [
                7266,
                7343
            ],
            [
                7343,
                7407
            ],
            [
                7407,
                7485
            ],
            [
                7485,
                7485
            ],
            [
                7485,
                7536
            ],
            [
                7536,
                7536
            ],
            [
                7536,
                7611
            ],
            [
                7611,
                7642
            ],
            [
                7642,
                7710
            ],
            [
                7710,
                7772
            ],
            [
                7772,
                7875
            ],
            [
                7875,
                8011
            ],
            [
                8011,
                8110
            ],
            [
                8110,
                8165
            ],
            [
                8165,
                8221
            ],
            [
                8221,
                8221
            ],
            [
                8221,
                8221
            ],
            [
                8221,
                8221
            ],
            [
                8221,
                8295
            ],
            [
                8295,
                8377
            ],
            [
                8377,
                8465
            ],
            [
                8465,
                8581
            ],
            [
                8581,
                8641
            ],
            [
                8641,
                8851
            ],
            [
                8851,
                8926
            ],
            [
                8926,
                8926
            ],
            [
                8926,
                8982
            ],
            [
                8982,
                9123
            ],
            [
                9123,
                9180
            ],
            [
                9180,
                9245
            ],
            [
                9245,
                9267
            ],
            [
                9267,
                9267
            ],
            [
                9267,
                9267
            ],
            [
                9267,
                9267
            ],
            [
                9267,
                9330
            ],
            [
                9330,
                9415
            ],
            [
                9415,
                9415
            ],
            [
                9415,
                9483
            ],
            [
                9483,
                9580
            ],
            [
                9580,
                9580
            ],
            [
                9580,
                9633
            ],
            [
                9633,
                9731
            ],
            [
                9731,
                9868
            ],
            [
                9868,
                9952
            ],
            [
                9952,
                9996
            ],
            [
                9996,
                10180
            ],
            [
                10180,
                10180
            ],
            [
                10180,
                10294
            ],
            [
                10294,
                10313
            ],
            [
                10313,
                10347
            ],
            [
                10347,
                10375
            ],
            [
                10375,
                10464
            ],
            [
                10464,
                10464
            ],
            [
                10464,
                10464
            ],
            [
                10464,
                10603
            ],
            [
                10603,
                10603
            ],
            [
                10603,
                10668
            ],
            [
                10668,
                10726
            ],
            [
                10726,
                10726
            ],
            [
                10726,
                10790
            ],
            [
                10790,
                10825
            ],
            [
                10825,
                10948
            ]
        ]
    }
}