{
    "original": {
        "text": "Sir Felix Carbury made an appointment for meeting Ruby Ruggles a second time at the bottom of the kitchen-garden belonging to Sheep's Acre farm, which appointment he neglected, and had, indeed, made without any intention of keeping it. But Ruby was there, and remained hanging about among the cabbages till her grandfather returned from Harlestone market. An early hour had been named; but hours may be mistaken, and Ruby had thought that a fine gentleman, such as was her lover, used to live among fine people up in London, might well mistake the afternoon for the morning. If he would come at all she could easily forgive such a mistake. But he did not come, and late in the afternoon she was obliged to obey her grandfather's summons as he called her into the house.\nAfter that for three weeks she heard nothing of her London lover, but she was always thinking of him;--and though she could not altogether avoid her country lover, she was in his company as little as possible. One afternoon her grandfather returned from Bungay and told her that her country lover was coming to see her. \"John Crumb be a coming over by-and-by,\" said the old man. \"See and have a bit o' supper ready for him.\"\n\"John Crumb coming here, grandfather? He's welcome to stay away then, for me.\"\n\"That be dommed.\" The old man thrust his old hat on to his head and seated himself in a wooden arm-chair that stood by the kitchen-fire. Whenever he was angry he put on his hat, and the custom was well understood by Ruby. \"Why not welcome, and he all one as your husband? Look ye here, Ruby, I'm going to have an eend o' this. John Crumb is to marry you next month, and the banns is to be said.\"\n\"The parson may say what he pleases, grandfather. I can't stop his saying of 'em. It isn't likely I shall try, neither. But no parson among 'em all can marry me without I'm willing.\"\n\"And why should you no be willing, you contrairy young jade, you?\"\n\"You've been a' drinking, grandfather.\"\nHe turned round at her sharp, and threw his old hat at her head;--nothing to Ruby's consternation, as it was a practice to which she was well accustomed. She picked it up, and returned it to him with a cool indifference which was intended to exasperate him. \"Look ye here, Ruby,\" he said, \"out o' this place you go. If you go as John Crumb's wife you'll go with five hun'erd pound, and we'll have a dinner here, and a dance, and all Bungay.\"\n\"Who cares for all Bungay,--a set of beery chaps as knows nothing but swilling and smoking;--and John Crumb the main of 'em all? There never was a chap for beer like John Crumb.\"\n\"Never saw him the worse o' liquor in all my life.\" And the old farmer, as he gave this grand assurance, rattled his fist down upon the table.\n\"It ony just makes him stoopider and stoopider the more he swills. You can't tell me, grandfather, about John Crumb. I knows him.\"\n\"Didn't ye say as how ye'd have him? Didn't ye give him a promise?\"\n\"If I did, I ain't the first girl as has gone back of her word,--and I shan't be the last.\"\n\"You means you won't have him?\"\n\"That's about it, grandfather.\"\n\"Then you'll have to have somebody to fend for ye, and that pretty sharp,--for you won't have me.\"\n\"There ain't no difficulty about that, grandfather.\"\n\"Very well. He's a coming here to-night, and you may settle it along wi' him. Out o' this ye shall go. I know of your doings.\"\n\"What doings! You don't know of no doings. There ain't no doings. You don't know nothing ag'in me.\"\n\"He's a coming here to-night, and if you can make it up wi' him, well and good. There's five hun'erd pound, and ye shall have the dinner and the dance and all Bungay. He ain't a going to be put off no longer;--he ain't.\"\n\"Whoever wanted him to be put on? Let him go his own gait.\"\n\"If you can't make it up wi' him--\"\n\"Well, grandfather, I shan't anyways.\"\n\"Let me have my say, will ye, yer jade, you? There's five hun'erd pound! and there ain't ere a farmer in Suffolk or Norfolk paying rent for a bit of land like this can do as well for his darter as that,--let alone only a granddarter. You never thinks o' that;--you don't. If you don't like to take it,--leave it. But you'll leave Sheep's Acre too.\"\n\"Bother Sheep's Acre. Who wants to stop at Sheep's Acre? It's the stoopidest place in all England.\"\n\"Then find another. Then find another. That's all aboot it. John Crumb's a coming up for a bit o' supper. You tell him your own mind. I'm dommed if I trouble aboot it. On'y you don't stay here. Sheep's Acre ain't good enough for you, and you'd best find another home. Stoopid, is it? You'll have to put up wi' places stoopider nor Sheep's Acre, afore you've done.\"\nIn regard to the hospitality promised to Mr. Crumb, Miss Ruggles went about her work with sufficient alacrity. She was quite willing that the young man should have a supper, and she did understand that, so far as the preparation of the supper went, she owed her service to her grandfather. She therefore went to work herself, and gave directions to the servant girl who assisted her in keeping her grandfather's house. But as she did this, she determined that she would make John Crumb understand that she would never be his wife. Upon that she was now fully resolved. As she went about the kitchen, taking down the ham and cutting the slices that were to be broiled, and as she trussed the fowl that was to be boiled for John Crumb, she made mental comparisons between him and Sir Felix Carbury. She could see, as though present to her at the moment, the mealy, floury head of the one, with hair stiff with perennial dust from his sacks, and the sweet glossy dark well-combed locks of the other, so bright, so seductive, that she was ever longing to twine her fingers among them. And she remembered the heavy, flat, broad honest face of the meal-man, with his mouth slow in motion, and his broad nose looking like a huge white promontory, and his great staring eyes, from the corners of which he was always extracting meal and grit;--and then also she remembered the white teeth, the beautiful soft lips, the perfect eyebrows, and the rich complexion of her London lover. Surely a lease of Paradise with the one, though but for one short year, would be well purchased at the price of a life with the other! \"It's no good going against love,\" she said to herself, \"and I won't try. He shall have his supper, and be told all about it, and then go home. He cares more for his supper than he do for me.\" And then, with this final resolution firmly made, she popped the fowl into the pot. Her grandfather wanted her to leave Sheep's Acre. Very well. She had a little money of her own, and would take herself off to London. She knew what people would say, but she cared nothing for old women's tales. She would know how to take care of herself, and could always say in her own defence that her grandfather had turned her out of Sheep's Acre.\nSeven had been the hour named, and punctually at that hour John Crumb knocked at the back door of Sheep's Acre farm-house. Nor did he come alone. He was accompanied by his friend Joe Mixet, the baker of Bungay, who, as all Bungay knew, was to be his best man at his marriage. John Crumb's character was not without many fine attributes. He could earn money,--and having earned it could spend and keep it in fair proportion. He was afraid of no work, and,--to give him his due,--was afraid of no man. He was honest, and ashamed of nothing that he did. And after his fashion he had chivalrous ideas about women. He was willing to thrash any man that ill-used a woman, and would certainly be a most dangerous antagonist to any man who would misuse a woman belonging to him. But Ruby had told the truth of him in saying that he was slow of speech, and what the world calls stupid in regard to all forms of expression. He knew good meal from bad as well as any man, and the price at which he could buy it so as to leave himself a fair profit at the selling. He knew the value of a clear conscience, and without much argument had discovered for himself that honesty is in truth the best policy. Joe Mixet, who was dapper of person and glib of tongue, had often declared that any one buying John Crumb for a fool would lose his money. Joe Mixet was probably right; but there had been a want of prudence, a lack of worldly sagacity, in the way in which Crumb had allowed his proposed marriage with Ruby Ruggles to become a source of gossip to all Bungay. His love was now an old affair; and, though he never talked much, whenever he did talk, he talked about that. He was proud of Ruby's beauty, and of her fortune, and of his own status as her acknowledged lover,--and he did not hide his light under a bushel. Perhaps the publicity so produced had some effect in prejudicing Ruby against the man whose offer she had certainly once accepted. Now when he came to settle the day,--having heard more than once or twice that there was a difficulty with Ruby,--he brought his friend Mixet with him as though to be present at his triumph. \"If here isn't Joe Mixet,\" said Ruby to herself. \"Was there ever such a stoopid as John Crumb? There's no end to his being stoopid.\"\nThe old man had slept off his anger and his beer while Ruby had been preparing the feast, and now roused himself to entertain his guests. \"What, Joe Mixet; is that thou? Thou'rt welcome. Come in, man. Well, John, how is it wi' you? Ruby's a stewing o' something for us to eat a bit. Don't 'e smell it?\"--John Crumb lifted up his great nose, sniffed and grinned.\n\"John didn't like going home in the dark like,\" said the baker, with his little joke. \"So I just come along to drive away the bogies.\"\n\"The more the merrier;--the more the merrier. Ruby 'll have enough for the two o' you, I'll go bail. So John Crumb's afraid of bogies;--is he? The more need he to have some 'un in his house to scart 'em away.\"\nThe lover had seated himself without speaking a word; but now he was instigated to ask a question. \"Where be she, Muster Ruggles?\" They were seated in the outside or front kitchen, in which the old man and his granddaughter always lived; while Ruby was at work in the back kitchen. As John Crumb asked this question she could be heard distinctly among the pots and the plates. She now came out, and wiping her hands on her apron, shook hands with the two young men. She had enveloped herself in a big household apron when the cooking was in hand, and had not cared to take it off for the greeting of this lover. \"Grandfather said as how you was a coming out for your supper, so I've been a seeing to it. You'll excuse the apron, Mr. Mixet.\"\n\"You couldn't look nicer, miss, if you was to try it ever so. My mother says as it's housifery as recommends a girl to the young men. What do you say, John?\"\n\"I loiks to see her loik o' that,\" said John rubbing his hands down the back of his trowsers, and stooping till he had brought his eyes down to a level with those of his sweetheart.\n[Illlustration: \"I loiks to see her loik o' that.\"]\n\"It looks homely; don't it, John?\" said Mixet.\n\"Bother!\" said Ruby, turning round sharp, and going back to the other kitchen. John Crumb turned round also, and grinned at his friend, and then grinned at the old man.\n\"You've got it all afore you,\" said the farmer,--leaving the lover to draw what lesson he might from this oracular proposition.\n\"And I don't care how soon I ha'e it in hond;--that I don't,\" said John.\n\"That's the chat,\" said Joe Mixet. \"There ain't nothing wanting in his house;--is there, John? It's all there,--cradle, caudle-cup, and the rest of it. A young woman going to John knows what she'll have to eat when she gets up, and what she'll lie down upon when she goes to bed.\" This he declared in a loud voice for the benefit of Ruby in the back kitchen.\n\"That she do,\" said John, grinning again. \"There's a hun'erd and fifty poond o' things in my house forbye what mother left behind her.\"\nAfter this there was no more conversation till Ruby reappeared with the boiled fowl, and without her apron. She was followed by the girl with a dish of broiled ham and an enormous pyramid of cabbage. Then the old man got up slowly and opening some private little door of which he kept the key in his breeches pocket, drew a jug of ale and placed it on the table. And from a cupboard of which he also kept the key, he brought out a bottle of gin. Everything being thus prepared, the three men sat round the table, John Crumb looking at his chair again and again before he ventured to occupy it. \"If you'll sit yourself down, I'll give you a bit of something to eat,\" said Ruby at last. Then he sank at once into his chair. Ruby cut up the fowl standing, and dispensed the other good things, not even placing a chair for herself at the table,--and apparently not expected to do so, for no one invited her. \"Is it to be spirits or ale, Mr. Crumb?\" she said, when the other two men had helped themselves. He turned round and gave her a look of love that might have softened the heart of an Amazon; but instead of speaking he held up his tumbler, and bobbed his head at the beer jug. Then she filled it to the brim, frothing it in the manner in which he loved to have it frothed. He raised it to his mouth slowly, and poured the liquor in as though to a vat. Then she filled it again. He had been her lover, and she would be as kind to him as she knew how,--short of love.\nThere was a good deal of eating done, for more ham came in, and another mountain of cabbage; but very little or nothing was said. John Crumb ate whatever was given to him of the fowl, sedulously picking the bones, and almost swallowing them; and then finished the second dish of ham, and after that the second instalment of cabbage. He did not ask for more beer, but took it as often as Ruby replenished his glass. When the eating was done, Ruby retired into the back kitchen, and there regaled herself with some bone or merry-thought of the fowl, which she had with prudence reserved, sharing her spoils however with the other maiden. This she did standing, and then went to work, cleaning the dishes. The men lit their pipes and smoked in silence, while Ruby went through her domestic duties. So matters went on for half an hour; during which Ruby escaped by the back door, went round into the house, got into her own room, and formed the grand resolution of going to bed. She began her operations in fear and trembling, not being sure but that her grandfather would bring the man up-stairs to her. As she thought of this she stayed her hand, and looked to the door. She knew well that there was no bolt there. It would be terrible to her to be invaded by John Crumb after his fifth or sixth glass of beer. And, she declared to herself, that should he come he would be sure to bring Joe Mixet with him to speak his mind for him. So she paused and listened.\nWhen they had smoked for some half hour the old man called for his granddaughter, but called of course in vain. \"Where the mischief is the jade gone?\" he said, slowly making his way into the back kitchen. The maid as soon as she heard her master moving, escaped into the yard and made no response, while the old man stood bawling at the back door. \"The devil's in them. They're off some gates,\" he said aloud. \"She'll make the place hot for her, if she goes on this way.\" Then he returned to the two young men. \"She's playing off her games somwheres,\" he said. \"Take a glass of sperrits and water, Mr. Crumb, and I'll see after her.\"\n\"I'll just take a drop of y'ell,\" said John Crumb, apparently quite unmoved by the absence of his sweetheart.\nIt was sad work for the old man. He went down the yard and into the garden, hobbling among the cabbages, not daring to call very loud, as he did not wish to have it supposed that the girl was lost; but still anxious, and sore at heart as to the ingratitude shown to him. He was not bound to give the girl a home at all. She was not his own child. And he had offered her 500! \"Domm her,\" he said aloud as he made his way back to the house. After much search and considerable loss of time he returned to the kitchen in which the two men were sitting, leading Ruby in his hand. She was not smart in her apparel, for she had half undressed herself, and been then compelled by her grandfather to make herself fit to appear in public. She had acknowledged to herself that she had better go down and tell John Crumb the truth. For she was still determined that she would never be John Crumb's wife. \"You can answer him as well as I, grandfather,\" she had said. Then the farmer had cuffed her, and told her that she was an idiot. \"Oh, if it comes to that,\" said Ruby, \"I'm not afraid of John Crumb, nor yet of nobody else. Only I didn't think you'd go to strike me, grandfather.\" \"I'll knock the life out of thee, if thou goest on this gate,\" he had said. But she had consented to come down, and they entered the room together.\n\"We're a disturbing you a'most too late, miss,\" said Mr. Mixet.\n\"It ain't that at all, Mr. Mixet. If grandfather chooses to have a few friends, I ain't nothing against it. I wish he'd have a few friends a deal oftener than he do. I likes nothing better than to do for 'em;--only when I've done for 'em and they're smoking their pipes and that like, I don't see why I ain't to leave 'em to 'emselves.\"\n\"But we've come here on a hauspicious occasion, Miss Ruby.\"\n\"I don't know nothing about auspicious, Mr. Mixet. If you and Mr. Crumb've come out to Sheep's Acre farm for a bit of supper--\"\n\"Which we ain't,\" said John Crumb very loudly;--\"nor yet for beer;--not by no means.\"\n\"We've come for the smiles of beauty,\" said Joe Mixet.\nRuby chucked up her head. \"Mr. Mixet, if you'll be so good as to stow that! There ain't no beauty here as I knows of, and if there was it isn't nothing to you.\"\n\"Except in the way of friendship,\" said Mixet.\n\"I'm just as sick of all this as a man can be,\" said Mr. Ruggles, who was sitting low in his chair, with his back bent, and his head forward. \"I won't put up with it no more.\"\n\"Who wants you to put up with it?\" said Ruby. \"Who wants 'em to come here with their trash? Who brought 'em to-night? I don't know what business Mr. Mixet has interfering along o' me. I never interfere along o' him.\"\n\"John Crumb, have you anything to say?\" asked the old man.\nThen John Crumb slowly arose from his chair, and stood up at his full height. \"I hove,\" said he, swinging his head to one side.\n\"Then say it.\"\n\"I will,\" said he. He was still standing bolt upright with his hands down by his side. Then he stretched out his left to his glass which was half full of beer, and strengthened himself as far as that would strengthen him. Having done this he slowly deposited the pipe which he still held in his right hand.\n\"Now speak your mind, like a man,\" said Mixet.\n\"I intends it,\" said John. But he still stood dumb, looking down upon old Ruggles, who from his crouched position was looking up at him. Ruby was standing with both her hands upon the table and her eyes intent upon the wall over the fire-place.\n\"You've asked Miss Ruby to be your wife a dozen times;--haven't you, John?\" suggested Mixet.\n\"I hove.\"\n\"And you mean to be as good as your word?\"\n\"I do.\"\n\"And she has promised to have you?\"\n\"She hove.\"\n\"More nor once or twice?\" To this proposition Crumb found it only necessary to bob his head. \"You're ready,--and willing?\"\n\"I om.\"\n\"You're wishing to have the banns said without any more delay?\"\n\"There ain't no delay 'bout me;--never was.\"\n\"Everything is ready in your own house?\"\n\"They is.\"\n\"And you will expect Miss Ruby to come to the scratch?\"\n\"I sholl.\"\n\"That's about it, I think,\" said Joe Mixet, turning to the grandfather. \"I don't think there was ever anything much more straightforward than that. You know, I know, Miss Ruby knows all about John Crumb. John Crumb didn't come to Bungay yesterday,--nor yet the day before. There's been a talk of five hundred pounds, Mr. Ruggles.\" Mr. Ruggles made a slight gesture of assent with his head. \"Five hundred pounds is very comfortable; and added to what John has will make things that snug that things never was snugger. But John Crumb isn't after Miss Ruby along of her fortune.\"\n\"Nohow's,\" said the lover, shaking his head and still standing upright with his hands by his side.\n\"Not he;--it isn't his ways, and them as knows him'll never say it of him. John has a heart in his buzsom.\"\n\"I has,\" said John, raising his hand a little above his stomach.\n\"And feelings as a man. It's true love as has brought John Crumb to Sheep's Acre farm this night;--love of that young lady, if she'll let me make so free. He's a proposed to her, and she's a haccepted him, and now it's about time as they was married. That's what John Crumb has to say.\"\n\"That's what I has to say,\" repeated John Crumb, \"and I means it.\"\n\"And now, miss,\" continued Mixet, addressing himself to Ruby, \"you've heard what John has to say.\"\n\"I've heard you, Mr. Mixet, and I've heard quite enough.\"\n\"You can't have anything to say against it, miss; can you? There's your grandfather as is willing, and the money as one may say counted out,--and John Crumb is willing, with his house so ready that there isn't a ha'porth to do. All we want is for you to name the day.\"\n\"Say to-morrow, Ruby, and I'll not be agon it,\" said John Crumb, slapping his thigh.\n\"I won't say to-morrow, Mr. Crumb, nor yet the day after to-morrow, nor yet no day at all. I'm not going to have you. I've told you as much before.\"\n\"That was only in fun, loike.\"\n\"Then now I tell you in earnest. There's some folk wants such a deal of telling.\"\n\"You don't mean,--never?\"\n\"I do mean never, Mr. Crumb.\"\n\"Didn't you say as you would, Ruby? Didn't you say so as plain as the nose on my face?\" John as he asked these questions could hardly refrain from tears.\n\"Young women is allowed to change their minds,\" said Ruby.\n\"Brute!\" exclaimed old Ruggles. \"Pig! Jade! I'll tell'ee what, John. She'll go out o' this into the streets;--that's what she wull. I won't keep her here, no longer;--nasty, ungrateful, lying slut.\"\n\"She ain't that;--she ain't that,\" said John. \"She ain't that at all. She's no slut. I won't hear her called so;--not by her grandfather. But, oh, she has a mind to put me so abouts, that I'll have to go home and hang myself.\"\n\"Dash it, Miss Ruby, you ain't a going to serve a young man that way,\" said the baker.\n\"If you'll jist keep yourself to yourself, I'll be obliged to you, Mr. Mixet,\" said Ruby. \"If you hadn't come here at all things might have been different.\"\n\"Hark at that now,\" said John, looking at his friend almost with indignation.\nMr. Mixet, who was fully aware of his rare eloquence and of the absolute necessity there had been for its exercise if any arrangement were to be made at all, could not trust himself to words after this. He put on his hat and walked out through the back kitchen into the yard declaring that his friend would find him there, round by the pig-stye wall, whenever he was ready to return to Bungay. As soon as Mixet was gone John looked at his sweetheart out of the corners of his eyes and made a slow motion towards her, putting out his right hand as a feeler. \"He's aff now, Ruby,\" said John.\n\"And you'd better be aff after him,\" said the cruel girl.\n\"And when'll I come back again?\"\n\"Never. It ain't no use. What's the good of more words, Mr. Crumb?\"\n\"Domm her; domm her,\" said old Ruggles. \"I'll even it to her. She'll have to be out on the roads this night.\"\n\"She shall have the best bed in my house if she'll come for it,\" said John, \"and the old woman to look arter her; and I won't come nigh her till she sends for me.\"\n\"I can find a place for myself, thank ye, Mr. Crumb.\" Old Ruggles sat grinding his teeth, and swearing to himself, taking his hat off and putting it on again, and meditating vengeance. \"And now if you please, Mr. Crumb, I'll go up-stairs to my own room.\"\n\"You don't go up to any room here, you jade you.\" The old man as he said this got up from his chair as though to fly at her. And he would have struck her with his stick but that he was stopped by John Crumb.\n\"Don't hit the girl, no gate, Mr. Ruggles.\"\n\"Domm her, John; she breaks my heart.\" While her lover held her grandfather Ruby escaped, and seated herself on the bedside, again afraid to undress, lest she should be disturbed by her grandfather. \"Ain't it more nor a man ought to have to bear;--ain't it, Mr. Crumb?\" said the grandfather appealing to the young man.\n\"It's the ways on 'em, Mr. Ruggles.\"\n\"Ways on 'em! A whipping at the cart-tail ought to be the ways on her. She's been and seen some young buck.\"\nThen John Crumb turned red all over, through the flour, and sparks of anger flashed from his eyes. \"You ain't a meaning of it, master?\"\n\"I'm told there's been the squoire's cousin aboot,--him as they call the baronite.\"\n\"Been along wi' Ruby?\" The old man nodded at him. \"By the mortials I'll baronite him;--I wull,\" said John seizing his hat and stalking off through the back kitchen after his friend.",
        "paragraph_chars": [
            [
                0,
                770
            ],
            [
                770,
                1195
            ],
            [
                1195,
                1274
            ],
            [
                1274,
                1670
            ],
            [
                1670,
                1853
            ],
            [
                1853,
                1920
            ],
            [
                1920,
                1960
            ],
            [
                1960,
                2402
            ],
            [
                2402,
                2581
            ],
            [
                2581,
                2724
            ],
            [
                2724,
                2855
            ],
            [
                2855,
                2923
            ],
            [
                2923,
                3015
            ],
            [
                3015,
                3047
            ],
            [
                3047,
                3079
            ],
            [
                3079,
                3178
            ],
            [
                3178,
                3231
            ],
            [
                3231,
                3358
            ],
            [
                3358,
                3458
            ],
            [
                3458,
                3679
            ],
            [
                3679,
                3739
            ],
            [
                3739,
                3775
            ],
            [
                3775,
                3814
            ],
            [
                3814,
                4163
            ],
            [
                4163,
                4263
            ],
            [
                4263,
                4628
            ],
            [
                4628,
                6865
            ],
            [
                6865,
                9124
            ],
            [
                9124,
                9486
            ],
            [
                9486,
                9621
            ],
            [
                9621,
                9831
            ],
            [
                9831,
                10572
            ],
            [
                10572,
                10730
            ],
            [
                10730,
                10912
            ],
            [
                10912,
                10964
            ],
            [
                10964,
                11011
            ],
            [
                11011,
                11180
            ],
            [
                11180,
                11308
            ],
            [
                11308,
                11381
            ],
            [
                11381,
                11740
            ],
            [
                11740,
                11876
            ],
            [
                11876,
                13344
            ],
            [
                13344,
                14803
            ],
            [
                14803,
                15437
            ],
            [
                15437,
                15547
            ],
            [
                15547,
                16867
            ],
            [
                16867,
                16931
            ],
            [
                16931,
                17268
            ],
            [
                17268,
                17328
            ],
            [
                17328,
                17456
            ],
            [
                17456,
                17542
            ],
            [
                17542,
                17597
            ],
            [
                17597,
                17758
            ],
            [
                17758,
                17805
            ],
            [
                17805,
                17981
            ],
            [
                17981,
                18198
            ],
            [
                18198,
                18257
            ],
            [
                18257,
                18385
            ],
            [
                18385,
                18400
            ],
            [
                18400,
                18707
            ],
            [
                18707,
                18754
            ],
            [
                18754,
                18999
            ],
            [
                18999,
                19092
            ],
            [
                19092,
                19102
            ],
            [
                19102,
                19145
            ],
            [
                19145,
                19153
            ],
            [
                19153,
                19189
            ],
            [
                19189,
                19201
            ],
            [
                19201,
                19324
            ],
            [
                19324,
                19332
            ],
            [
                19332,
                19396
            ],
            [
                19396,
                19441
            ],
            [
                19441,
                19482
            ],
            [
                19482,
                19493
            ],
            [
                19493,
                19549
            ],
            [
                19549,
                19560
            ],
            [
                19560,
                20137
            ],
            [
                20137,
                20236
            ],
            [
                20236,
                20344
            ],
            [
                20344,
                20409
            ],
            [
                20409,
                20696
            ],
            [
                20696,
                20763
            ],
            [
                20763,
                20862
            ],
            [
                20862,
                20920
            ],
            [
                20920,
                21189
            ],
            [
                21189,
                21274
            ],
            [
                21274,
                21423
            ],
            [
                21423,
                21454
            ],
            [
                21454,
                21536
            ],
            [
                21536,
                21562
            ],
            [
                21562,
                21592
            ],
            [
                21592,
                21746
            ],
            [
                21746,
                21805
            ],
            [
                21805,
                22004
            ],
            [
                22004,
                22231
            ],
            [
                22231,
                22318
            ],
            [
                22318,
                22475
            ],
            [
                22475,
                22553
            ],
            [
                22553,
                23143
            ],
            [
                23143,
                23201
            ],
            [
                23201,
                23234
            ],
            [
                23234,
                23302
            ],
            [
                23302,
                23412
            ],
            [
                23412,
                23576
            ],
            [
                23576,
                23831
            ],
            [
                23831,
                24039
            ],
            [
                24039,
                24083
            ],
            [
                24083,
                24402
            ],
            [
                24402,
                24439
            ],
            [
                24439,
                24548
            ],
            [
                24548,
                24684
            ],
            [
                24684,
                24768
            ],
            [
                24768,
                24949
            ]
        ],
        "segment_chars": [
            [
                0,
                236
            ],
            [
                236,
                356
            ],
            [
                356,
                575
            ],
            [
                575,
                640
            ],
            [
                640,
                770
            ],
            [
                770,
                980
            ],
            [
                980,
                1090
            ],
            [
                1090,
                1149
            ],
            [
                1149,
                1195
            ],
            [
                1195,
                1233
            ],
            [
                1233,
                1274
            ],
            [
                1274,
                1292
            ],
            [
                1292,
                1411
            ],
            [
                1411,
                1496
            ],
            [
                1496,
                1546
            ],
            [
                1546,
                1601
            ],
            [
                1601,
                1670
            ],
            [
                1670,
                1720
            ],
            [
                1720,
                1752
            ],
            [
                1752,
                1790
            ],
            [
                1790,
                1853
            ],
            [
                1853,
                1920
            ],
            [
                1920,
                1960
            ],
            [
                1960,
                2114
            ],
            [
                2114,
                2218
            ],
            [
                2218,
                2276
            ],
            [
                2276,
                2402
            ],
            [
                2402,
                2531
            ],
            [
                2531,
                2581
            ],
            [
                2581,
                2633
            ],
            [
                2633,
                2724
            ],
            [
                2724,
                2791
            ],
            [
                2791,
                2841
            ],
            [
                2841,
                2855
            ],
            [
                2855,
                2892
            ],
            [
                2892,
                2923
            ],
            [
                2923,
                3015
            ],
            [
                3015,
                3047
            ],
            [
                3047,
                3079
            ],
            [
                3079,
                3178
            ],
            [
                3178,
                3231
            ],
            [
                3231,
                3243
            ],
            [
                3243,
                3309
            ],
            [
                3309,
                3334
            ],
            [
                3334,
                3358
            ],
            [
                3358,
                3372
            ],
            [
                3372,
                3401
            ],
            [
                3401,
                3424
            ],
            [
                3424,
                3458
            ],
            [
                3458,
                3538
            ],
            [
                3538,
                3625
            ],
            [
                3625,
                3679
            ],
            [
                3679,
                3713
            ],
            [
                3713,
                3739
            ],
            [
                3739,
                3775
            ],
            [
                3775,
                3814
            ],
            [
                3814,
                3859
            ],
            [
                3859,
                3887
            ],
            [
                3887,
                4048
            ],
            [
                4048,
                4086
            ],
            [
                4086,
                4127
            ],
            [
                4127,
                4163
            ],
            [
                4163,
                4185
            ],
            [
                4185,
                4220
            ],
            [
                4220,
                4263
            ],
            [
                4263,
                4283
            ],
            [
                4283,
                4302
            ],
            [
                4302,
                4323
            ],
            [
                4323,
                4369
            ],
            [
                4369,
                4397
            ],
            [
                4397,
                4431
            ],
            [
                4431,
                4457
            ],
            [
                4457,
                4531
            ],
            [
                4531,
                4547
            ],
            [
                4547,
                4628
            ],
            [
                4628,
                4739
            ],
            [
                4739,
                4918
            ],
            [
                4918,
                5047
            ],
            [
                5047,
                5159
            ],
            [
                5159,
                5197
            ],
            [
                5197,
                5425
            ],
            [
                5425,
                5709
            ],
            [
                5709,
                6101
            ],
            [
                6101,
                6236
            ],
            [
                6236,
                6310
            ],
            [
                6310,
                6380
            ],
            [
                6380,
                6429
            ],
            [
                6429,
                6513
            ],
            [
                6513,
                6563
            ],
            [
                6563,
                6574
            ],
            [
                6574,
                6647
            ],
            [
                6647,
                6724
            ],
            [
                6724,
                6865
            ],
            [
                6865,
                6988
            ],
            [
                6988,
                7011
            ],
            [
                7011,
                7141
            ],
            [
                7141,
                7202
            ],
            [
                7202,
                7289
            ],
            [
                7289,
                7365
            ],
            [
                7365,
                7416
            ],
            [
                7416,
                7475
            ],
            [
                7475,
                7636
            ],
            [
                7636,
                7779
            ],
            [
                7779,
                7918
            ],
            [
                7918,
                8054
            ],
            [
                8054,
                8193
            ],
            [
                8193,
                8412
            ],
            [
                8412,
                8522
            ],
            [
                8522,
                8669
            ],
            [
                8669,
                8800
            ],
            [
                8800,
                8991
            ],
            [
                8991,
                9040
            ],
            [
                9040,
                9086
            ],
            [
                9086,
                9124
            ],
            [
                9124,
                9262
            ],
            [
                9262,
                9294
            ],
            [
                9294,
                9311
            ],
            [
                9311,
                9325
            ],
            [
                9325,
                9356
            ],
            [
                9356,
                9407
            ],
            [
                9407,
                9426
            ],
            [
                9426,
                9486
            ],
            [
                9486,
                9572
            ],
            [
                9572,
                9621
            ],
            [
                9621,
                9667
            ],
            [
                9667,
                9722
            ],
            [
                9722,
                9764
            ],
            [
                9764,
                9831
            ],
            [
                9831,
                9930
            ],
            [
                9930,
                9962
            ],
            [
                9962,
                10113
            ],
            [
                10113,
                10208
            ],
            [
                10208,
                10297
            ],
            [
                10297,
                10443
            ],
            [
                10443,
                10535
            ],
            [
                10535,
                10572
            ],
            [
                10572,
                10634
            ],
            [
                10634,
                10706
            ],
            [
                10706,
                10730
            ],
            [
                10730,
                10912
            ],
            [
                10912,
                10964
            ],
            [
                10964,
                10999
            ],
            [
                10999,
                11011
            ],
            [
                11011,
                11021
            ],
            [
                11021,
                11090
            ],
            [
                11090,
                11180
            ],
            [
                11180,
                11308
            ],
            [
                11308,
                11381
            ],
            [
                11381,
                11416
            ],
            [
                11416,
                11476
            ],
            [
                11476,
                11533
            ],
            [
                11533,
                11662
            ],
            [
                11662,
                11740
            ],
            [
                11740,
                11782
            ],
            [
                11782,
                11876
            ],
            [
                11876,
                11984
            ],
            [
                11984,
                12076
            ],
            [
                12076,
                12239
            ],
            [
                12239,
                12322
            ],
            [
                12322,
                12470
            ],
            [
                12470,
                12561
            ],
            [
                12561,
                12598
            ],
            [
                12598,
                12780
            ],
            [
                12780,
                12821
            ],
            [
                12821,
                12877
            ],
            [
                12877,
                13055
            ],
            [
                13055,
                13151
            ],
            [
                13151,
                13230
            ],
            [
                13230,
                13256
            ],
            [
                13256,
                13344
            ],
            [
                13344,
                13474
            ],
            [
                13474,
                13677
            ],
            [
                13677,
                13759
            ],
            [
                13759,
                13980
            ],
            [
                13980,
                14047
            ],
            [
                14047,
                14139
            ],
            [
                14139,
                14319
            ],
            [
                14319,
                14445
            ],
            [
                14445,
                14513
            ],
            [
                14513,
                14557
            ],
            [
                14557,
                14653
            ],
            [
                14653,
                14775
            ],
            [
                14775,
                14803
            ],
            [
                14803,
                14915
            ],
            [
                14915,
                14954
            ],
            [
                14954,
                15008
            ],
            [
                15008,
                15151
            ],
            [
                15151,
                15173
            ],
            [
                15173,
                15213
            ],
            [
                15213,
                15275
            ],
            [
                15275,
                15314
            ],
            [
                15314,
                15364
            ],
            [
                15364,
                15437
            ],
            [
                15437,
                15547
            ],
            [
                15547,
                15580
            ],
            [
                15580,
                15818
            ],
            [
                15818,
                15867
            ],
            [
                15867,
                15894
            ],
            [
                15894,
                15922
            ],
            [
                15922,
                15986
            ],
            [
                15986,
                16122
            ],
            [
                16122,
                16276
            ],
            [
                16276,
                16367
            ],
            [
                16367,
                16439
            ],
            [
                16439,
                16501
            ],
            [
                16501,
                16569
            ],
            [
                16569,
                16662
            ],
            [
                16662,
                16719
            ],
            [
                16719,
                16795
            ],
            [
                16795,
                16867
            ],
            [
                16867,
                16931
            ],
            [
                16931,
                16965
            ],
            [
                16965,
                17039
            ],
            [
                17039,
                17097
            ],
            [
                17097,
                17268
            ],
            [
                17268,
                17328
            ],
            [
                17328,
                17379
            ],
            [
                17379,
                17456
            ],
            [
                17456,
                17542
            ],
            [
                17542,
                17597
            ],
            [
                17597,
                17623
            ],
            [
                17623,
                17673
            ],
            [
                17673,
                17758
            ],
            [
                17758,
                17805
            ],
            [
                17805,
                17947
            ],
            [
                17947,
                17981
            ],
            [
                17981,
                18016
            ],
            [
                18016,
                18027
            ],
            [
                18027,
                18073
            ],
            [
                18073,
                18099
            ],
            [
                18099,
                18165
            ],
            [
                18165,
                18198
            ],
            [
                18198,
                18238
            ],
            [
                18238,
                18257
            ],
            [
                18257,
                18335
            ],
            [
                18335,
                18385
            ],
            [
                18385,
                18400
            ],
            [
                18400,
                18419
            ],
            [
                18419,
                18487
            ],
            [
                18487,
                18622
            ],
            [
                18622,
                18707
            ],
            [
                18707,
                18754
            ],
            [
                18754,
                18781
            ],
            [
                18781,
                18891
            ],
            [
                18891,
                18999
            ],
            [
                18999,
                19075
            ],
            [
                19075,
                19092
            ],
            [
                19092,
                19102
            ],
            [
                19102,
                19145
            ],
            [
                19145,
                19153
            ],
            [
                19153,
                19189
            ],
            [
                19189,
                19201
            ],
            [
                19201,
                19227
            ],
            [
                19227,
                19294
            ],
            [
                19294,
                19324
            ],
            [
                19324,
                19332
            ],
            [
                19332,
                19396
            ],
            [
                19396,
                19441
            ],
            [
                19441,
                19482
            ],
            [
                19482,
                19493
            ],
            [
                19493,
                19549
            ],
            [
                19549,
                19560
            ],
            [
                19560,
                19632
            ],
            [
                19632,
                19708
            ],
            [
                19708,
                19764
            ],
            [
                19764,
                19833
            ],
            [
                19833,
                19891
            ],
            [
                19891,
                19950
            ],
            [
                19950,
                20077
            ],
            [
                20077,
                20137
            ],
            [
                20137,
                20236
            ],
            [
                20236,
                20311
            ],
            [
                20311,
                20344
            ],
            [
                20344,
                20409
            ],
            [
                20409,
                20433
            ],
            [
                20433,
                20564
            ],
            [
                20564,
                20660
            ],
            [
                20660,
                20696
            ],
            [
                20696,
                20763
            ],
            [
                20763,
                20862
            ],
            [
                20862,
                20920
            ],
            [
                20920,
                20979
            ],
            [
                20979,
                21148
            ],
            [
                21148,
                21189
            ],
            [
                21189,
                21274
            ],
            [
                21274,
                21365
            ],
            [
                21365,
                21392
            ],
            [
                21392,
                21423
            ],
            [
                21423,
                21454
            ],
            [
                21454,
                21487
            ],
            [
                21487,
                21536
            ],
            [
                21536,
                21562
            ],
            [
                21562,
                21592
            ],
            [
                21592,
                21628
            ],
            [
                21628,
                21680
            ],
            [
                21680,
                21746
            ],
            [
                21746,
                21805
            ],
            [
                21805,
                21814
            ],
            [
                21814,
                21837
            ],
            [
                21837,
                21843
            ],
            [
                21843,
                21849
            ],
            [
                21849,
                21874
            ],
            [
                21874,
                21937
            ],
            [
                21937,
                22004
            ],
            [
                22004,
                22050
            ],
            [
                22050,
                22074
            ],
            [
                22074,
                22089
            ],
            [
                22089,
                22142
            ],
            [
                22142,
                22231
            ],
            [
                22231,
                22318
            ],
            [
                22318,
                22408
            ],
            [
                22408,
                22475
            ],
            [
                22475,
                22553
            ],
            [
                22553,
                22756
            ],
            [
                22756,
                22947
            ],
            [
                22947,
                23110
            ],
            [
                23110,
                23143
            ],
            [
                23143,
                23201
            ],
            [
                23201,
                23234
            ],
            [
                23234,
                23242
            ],
            [
                23242,
                23259
            ],
            [
                23259,
                23302
            ],
            [
                23302,
                23342
            ],
            [
                23342,
                23364
            ],
            [
                23364,
                23412
            ],
            [
                23412,
                23576
            ],
            [
                23576,
                23630
            ],
            [
                23630,
                23761
            ],
            [
                23761,
                23831
            ],
            [
                23831,
                23881
            ],
            [
                23881,
                23956
            ],
            [
                23956,
                24039
            ],
            [
                24039,
                24083
            ],
            [
                24083,
                24122
            ],
            [
                24122,
                24282
            ],
            [
                24282,
                24353
            ],
            [
                24353,
                24402
            ],
            [
                24402,
                24439
            ],
            [
                24439,
                24453
            ],
            [
                24453,
                24510
            ],
            [
                24510,
                24548
            ],
            [
                24548,
                24647
            ],
            [
                24647,
                24684
            ],
            [
                24684,
                24768
            ],
            [
                24768,
                24791
            ],
            [
                24791,
                24818
            ],
            [
                24818,
                24949
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                123,
                125
            ],
            [
                50,
                112
            ],
            [
                126,
                143
            ],
            [
                163,
                165
            ],
            [
                18,
                22
            ],
            [
                26,
                37
            ],
            [
                199,
                236
            ],
            [
                236,
                259
            ],
            [
                277,
                356
            ],
            [
                426,
                445
            ],
            [
                517,
                523
            ],
            [
                446,
                455
            ],
            [
                469,
                478
            ],
            [
                525,
                535
            ],
            [
                400,
                402
            ],
            [
                573,
                575
            ],
            [
                640,
                664
            ],
            [
                687,
                702
            ],
            [
                703,
                705
            ],
            [
                754,
                770
            ],
            [
                770,
                817
            ],
            [
                834,
                871
            ],
            [
                873,
                979
            ],
            [
                980,
                1009
            ],
            [
                1035,
                1089
            ],
            [
                1090,
                1149
            ],
            [
                1149,
                1195
            ],
            [
                1195,
                1206
            ],
            [
                1231,
                1233
            ],
            [
                1233,
                1258
            ],
            [
                1263,
                1274
            ],
            [
                1274,
                1292
            ],
            [
                1292,
                1314
            ],
            [
                1319,
                1378
            ],
            [
                1390,
                1411
            ],
            [
                1411,
                1451
            ],
            [
                1490,
                1494
            ],
            [
                1494,
                1496
            ],
            [
                1496,
                1512
            ],
            [
                1544,
                1546
            ],
            [
                1546,
                1586
            ],
            [
                1588,
                1601
            ],
            [
                1601,
                1670
            ],
            [
                1670,
                1720
            ],
            [
                1720,
                1732
            ],
            [
                1750,
                1752
            ],
            [
                1790,
                1803
            ],
            [
                1818,
                1853
            ],
            [
                1853,
                1920
            ],
            [
                1920,
                1960
            ],
            [
                1960,
                1975
            ],
            [
                1983,
                2018
            ],
            [
                2112,
                2114
            ],
            [
                2114,
                2159
            ],
            [
                2162,
                2179
            ],
            [
                2216,
                2217
            ],
            [
                2218,
                2250
            ],
            [
                2276,
                2285
            ],
            [
                2366,
                2370
            ],
            [
                2286,
                2365
            ],
            [
                2370,
                2402
            ],
            [
                2402,
                2427
            ],
            [
                2439,
                2492
            ],
            [
                2529,
                2531
            ],
            [
                2531,
                2581
            ],
            [
                2581,
                2633
            ],
            [
                2633,
                2651
            ],
            [
                2686,
                2702
            ],
            [
                2708,
                2724
            ],
            [
                2724,
                2727
            ],
            [
                2732,
                2756
            ],
            [
                2855,
                2892
            ],
            [
                2892,
                2901
            ],
            [
                2913,
                2923
            ],
            [
                2923,
                2985
            ],
            [
                3012,
                3015
            ],
            [
                3015,
                3047
            ],
            [
                3047,
                3079
            ],
            [
                3079,
                3129
            ],
            [
                3154,
                3178
            ],
            [
                3178,
                3231
            ],
            [
                3231,
                3243
            ],
            [
                3245,
                3261
            ],
            [
                3270,
                3309
            ],
            [
                3334,
                3358
            ],
            [
                3358,
                3372
            ],
            [
                3401,
                3422
            ],
            [
                3458,
                3459
            ],
            [
                3492,
                3538
            ],
            [
                3859,
                3885
            ],
            [
                4015,
                4016
            ],
            [
                3887,
                3890
            ],
            [
                4086,
                4114
            ],
            [
                4117,
                4127
            ],
            [
                4127,
                4163
            ],
            [
                4163,
                4185
            ],
            [
                4185,
                4220
            ],
            [
                4220,
                4263
            ],
            [
                4263,
                4264
            ],
            [
                4536,
                4546
            ],
            [
                4264,
                4282
            ],
            [
                4408,
                4410
            ],
            [
                4457,
                4496
            ],
            [
                4501,
                4529
            ],
            [
                4680,
                4692
            ],
            [
                4794,
                4800
            ],
            [
                4673,
                4678
            ],
            [
                4739,
                4742
            ],
            [
                4761,
                4765
            ],
            [
                4877,
                4885
            ],
            [
                4825,
                4829
            ],
            [
                4890,
                4918
            ],
            [
                5047,
                5050
            ],
            [
                5068,
                5159
            ],
            [
                5197,
                5227
            ],
            [
                5252,
                5259
            ],
            [
                5264,
                5270
            ],
            [
                5244,
                5247
            ],
            [
                5294,
                5299
            ],
            [
                5307,
                5309
            ],
            [
                5315,
                5425
            ],
            [
                5425,
                5438
            ],
            [
                5480,
                5514
            ],
            [
                5556,
                5559
            ],
            [
                5520,
                5535
            ],
            [
                5546,
                5550
            ],
            [
                5565,
                5587
            ],
            [
                5593,
                5662
            ],
            [
                5668,
                5708
            ],
            [
                5709,
                5744
            ],
            [
                5751,
                5788
            ],
            [
                5789,
                5794
            ],
            [
                5809,
                5824
            ],
            [
                5850,
                5855
            ],
            [
                5825,
                5829
            ],
            [
                5866,
                5894
            ],
            [
                5960,
                5961
            ],
            [
                5963,
                5971
            ],
            [
                5977,
                6007
            ],
            [
                6032,
                6101
            ],
            [
                6101,
                6107
            ],
            [
                6137,
                6140
            ],
            [
                6167,
                6171
            ],
            [
                6116,
                6132
            ],
            [
                6173,
                6235
            ],
            [
                6236,
                6290
            ],
            [
                6308,
                6310
            ],
            [
                6310,
                6380
            ],
            [
                6380,
                6429
            ],
            [
                6429,
                6432
            ],
            [
                6439,
                6448
            ],
            [
                6455,
                6465
            ],
            [
                6479,
                6513
            ],
            [
                6513,
                6563
            ],
            [
                6563,
                6574
            ],
            [
                6574,
                6647
            ],
            [
                6647,
                6724
            ],
            [
                6724,
                6727
            ],
            [
                6739,
                6766
            ],
            [
                6863,
                6865
            ],
            [
                6911,
                6913
            ],
            [
                6865,
                6870
            ],
            [
                6924,
                6949
            ],
            [
                6955,
                6988
            ],
            [
                7011,
                7079
            ],
            [
                7101,
                7130
            ],
            [
                7139,
                7141
            ],
            [
                7141,
                7151
            ],
            [
                7180,
                7202
            ],
            [
                7289,
                7295
            ],
            [
                7296,
                7305
            ],
            [
                7309,
                7314
            ],
            [
                7354,
                7356
            ],
            [
                7360,
                7363
            ],
            [
                7378,
                7383
            ],
            [
                7365,
                7378
            ],
            [
                7414,
                7416
            ],
            [
                7420,
                7461
            ],
            [
                7475,
                7529
            ],
            [
                7473,
                7474
            ],
            [
                7636,
                7663
            ],
            [
                7671,
                7753
            ],
            [
                7777,
                7779
            ],
            [
                8054,
                8133
            ],
            [
                8149,
                8193
            ],
            [
                8193,
                8243
            ],
            [
                8264,
                8279
            ],
            [
                8290,
                8396
            ],
            [
                8410,
                8412
            ],
            [
                8522,
                8559
            ],
            [
                8580,
                8583
            ],
            [
                8588,
                8601
            ],
            [
                8615,
                8620
            ],
            [
                8623,
                8642
            ],
            [
                8667,
                8669
            ],
            [
                8800,
                8803
            ],
            [
                8834,
                8835
            ],
            [
                8804,
                8830
            ],
            [
                8831,
                8834
            ],
            [
                8837,
                8849
            ],
            [
                8874,
                8911
            ],
            [
                8914,
                8990
            ],
            [
                9124,
                9135
            ],
            [
                9222,
                9261
            ],
            [
                9262,
                9263
            ],
            [
                9273,
                9294
            ],
            [
                9311,
                9325
            ],
            [
                9325,
                9356
            ],
            [
                9356,
                9399
            ],
            [
                9930,
                9962
            ],
            [
                10116,
                10126
            ],
            [
                10111,
                10112
            ],
            [
                10075,
                10111
            ],
            [
                10010,
                10011
            ],
            [
                10147,
                10165
            ],
            [
                10177,
                10195
            ],
            [
                10200,
                10208
            ],
            [
                10208,
                10225
            ],
            [
                10230,
                10259
            ],
            [
                10295,
                10296
            ],
            [
                10443,
                10535
            ],
            [
                10535,
                10572
            ],
            [
                10572,
                10602
            ],
            [
                10632,
                10634
            ],
            [
                10634,
                10706
            ],
            [
                10706,
                10730
            ],
            [
                10730,
                10813
            ],
            [
                10910,
                10912
            ],
            [
                11011,
                11021
            ],
            [
                11021,
                11090
            ],
            [
                11090,
                11145
            ],
            [
                11147,
                11150
            ],
            [
                11167,
                11180
            ],
            [
                11180,
                11226
            ],
            [
                11306,
                11308
            ],
            [
                11416,
                11447
            ],
            [
                11470,
                11474
            ],
            [
                11386,
                11388
            ],
            [
                11452,
                11457
            ],
            [
                11397,
                11415
            ],
            [
                11533,
                11662
            ],
            [
                11662,
                11698
            ],
            [
                11714,
                11718
            ],
            [
                11703,
                11710
            ],
            [
                11738,
                11740
            ],
            [
                11740,
                11782
            ],
            [
                11782,
                11876
            ],
            [
                11876,
                11959
            ],
            [
                11982,
                11984
            ],
            [
                11984,
                12007
            ],
            [
                12008,
                12076
            ],
            [
                12076,
                12110
            ],
            [
                12243,
                12249
            ],
            [
                12132,
                12138
            ],
            [
                12124,
                12131
            ],
            [
                12139,
                12143
            ],
            [
                12193,
                12214
            ],
            [
                12305,
                12322
            ],
            [
                12322,
                12387
            ],
            [
                12468,
                12469
            ],
            [
                12598,
                12715
            ],
            [
                12718,
                12721
            ],
            [
                12760,
                12778
            ],
            [
                12746,
                12754
            ],
            [
                12778,
                12779
            ],
            [
                12780,
                12781
            ],
            [
                12801,
                12821
            ],
            [
                12821,
                12829
            ],
            [
                12875,
                12877
            ],
            [
                12877,
                12879
            ],
            [
                12897,
                12996
            ],
            [
                13022,
                13054
            ],
            [
                13060,
                13070
            ],
            [
                13005,
                13016
            ],
            [
                13074,
                13085
            ],
            [
                13149,
                13151
            ],
            [
                13283,
                13326
            ],
            [
                13329,
                13344
            ],
            [
                13344,
                13380
            ],
            [
                13435,
                13452
            ],
            [
                13464,
                13474
            ],
            [
                13474,
                13484
            ],
            [
                13595,
                13603
            ],
            [
                13608,
                13631
            ],
            [
                13647,
                13675
            ],
            [
                13556,
                13561
            ],
            [
                13731,
                13759
            ],
            [
                13759,
                13784
            ],
            [
                13898,
                13901
            ],
            [
                13790,
                13830
            ],
            [
                13902,
                13905
            ],
            [
                13879,
                13891
            ],
            [
                13993,
                14001
            ],
            [
                14001,
                14024
            ],
            [
                14026,
                14047
            ],
            [
                14047,
                14092
            ],
            [
                14137,
                14138
            ],
            [
                14139,
                14273
            ],
            [
                14311,
                14319
            ],
            [
                14382,
                14385
            ],
            [
                14319,
                14322
            ],
            [
                14538,
                14541
            ],
            [
                14391,
                14418
            ],
            [
                14500,
                14502
            ],
            [
                14437,
                14443
            ],
            [
                14352,
                14355
            ],
            [
                14329,
                14332
            ],
            [
                14507,
                14511
            ],
            [
                14542,
                14549
            ],
            [
                14555,
                14557
            ],
            [
                14557,
                14577
            ],
            [
                14585,
                14653
            ],
            [
                14653,
                14656
            ],
            [
                14703,
                14747
            ],
            [
                14773,
                14775
            ],
            [
                14775,
                14803
            ],
            [
                14803,
                14827
            ],
            [
                14833,
                14837
            ],
            [
                14838,
                14884
            ],
            [
                14906,
                14914
            ],
            [
                14915,
                14954
            ],
            [
                14954,
                14993
            ],
            [
                14994,
                15008
            ],
            [
                15213,
                15274
            ],
            [
                15275,
                15314
            ],
            [
                15314,
                15342
            ],
            [
                15352,
                15364
            ],
            [
                15364,
                15420
            ],
            [
                15431,
                15437
            ],
            [
                15437,
                15462
            ],
            [
                15468,
                15515
            ],
            [
                15531,
                15545
            ],
            [
                15520,
                15527
            ],
            [
                15545,
                15547
            ],
            [
                15547,
                15580
            ],
            [
                15580,
                15592
            ],
            [
                15606,
                15680
            ],
            [
                15743,
                15781
            ],
            [
                15792,
                15803
            ],
            [
                15816,
                15818
            ],
            [
                15867,
                15878
            ],
            [
                15879,
                15892
            ],
            [
                15898,
                15921
            ],
            [
                15922,
                15986
            ],
            [
                15986,
                15996
            ],
            [
                16034,
                16036
            ],
            [
                16104,
                16108
            ],
            [
                16094,
                16095
            ],
            [
                16004,
                16007
            ],
            [
                16046,
                16060
            ],
            [
                16120,
                16121
            ],
            [
                16867,
                16890
            ],
            [
                16898,
                16931
            ],
            [
                16931,
                16965
            ],
            [
                16965,
                17039
            ],
            [
                17379,
                17452
            ],
            [
                17456,
                17502
            ],
            [
                17504,
                17521
            ],
            [
                17539,
                17542
            ],
            [
                17542,
                17597
            ],
            [
                17597,
                17601
            ],
            [
                17613,
                17623
            ],
            [
                17623,
                17634
            ],
            [
                17662,
                17673
            ],
            [
                17673,
                17758
            ],
            [
                17805,
                17814
            ],
            [
                17818,
                17834
            ],
            [
                17850,
                17886
            ],
            [
                17919,
                17923
            ],
            [
                17891,
                17903
            ],
            [
                17945,
                17947
            ],
            [
                17947,
                17981
            ],
            [
                17981,
                18016
            ],
            [
                18016,
                18027
            ],
            [
                18073,
                18088
            ],
            [
                18097,
                18099
            ],
            [
                18099,
                18163
            ],
            [
                18198,
                18238
            ],
            [
                18238,
                18257
            ],
            [
                18257,
                18335
            ],
            [
                18335,
                18385
            ],
            [
                18385,
                18400
            ],
            [
                18400,
                18407
            ],
            [
                18492,
                18517
            ],
            [
                18518,
                18530
            ],
            [
                18558,
                18563
            ],
            [
                18551,
                18558
            ],
            [
                18620,
                18622
            ],
            [
                18639,
                18648
            ],
            [
                18691,
                18694
            ],
            [
                18663,
                18667
            ],
            [
                18705,
                18707
            ],
            [
                18707,
                18754
            ],
            [
                18754,
                18781
            ],
            [
                18781,
                18804
            ],
            [
                18889,
                18891
            ],
            [
                18891,
                18956
            ],
            [
                18969,
                18999
            ],
            [
                18999,
                19052
            ],
            [
                19055,
                19075
            ],
            [
                19075,
                19092
            ],
            [
                19092,
                19102
            ],
            [
                19153,
                19189
            ],
            [
                19189,
                19201
            ],
            [
                19441,
                19482
            ],
            [
                19482,
                19493
            ],
            [
                19493,
                19549
            ],
            [
                19549,
                19560
            ],
            [
                19560,
                19632
            ],
            [
                19833,
                19891
            ],
            [
                19891,
                19916
            ],
            [
                19948,
                19950
            ],
            [
                19950,
                20018
            ],
            [
                20019,
                20035
            ],
            [
                20041,
                20045
            ],
            [
                20075,
                20077
            ],
            [
                20077,
                20137
            ],
            [
                20137,
                20180
            ],
            [
                20234,
                20236
            ],
            [
                20236,
                20243
            ],
            [
                20309,
                20311
            ],
            [
                20311,
                20344
            ],
            [
                20344,
                20409
            ],
            [
                20409,
                20433
            ],
            [
                20433,
                20505
            ],
            [
                20562,
                20564
            ],
            [
                20564,
                20582
            ],
            [
                20586,
                20597
            ],
            [
                20600,
                20660
            ],
            [
                20660,
                20696
            ],
            [
                20696,
                20763
            ],
            [
                20763,
                20796
            ],
            [
                20920,
                20963
            ],
            [
                20970,
                20979
            ],
            [
                20987,
                21003
            ],
            [
                21007,
                21018
            ],
            [
                21062,
                21088
            ],
            [
                21019,
                21022
            ],
            [
                21094,
                21103
            ],
            [
                21107,
                21112
            ],
            [
                21146,
                21148
            ],
            [
                21148,
                21189
            ],
            [
                21189,
                21193
            ],
            [
                21203,
                21274
            ],
            [
                21274,
                21286
            ],
            [
                21296,
                21312
            ],
            [
                21317,
                21330
            ],
            [
                21340,
                21365
            ],
            [
                21365,
                21392
            ],
            [
                21392,
                21423
            ],
            [
                21423,
                21454
            ],
            [
                21454,
                21485
            ],
            [
                21536,
                21551
            ],
            [
                21554,
                21562
            ],
            [
                21562,
                21592
            ],
            [
                21592,
                21626
            ],
            [
                21680,
                21684
            ],
            [
                21739,
                21746
            ],
            [
                21746,
                21805
            ],
            [
                21805,
                21814
            ],
            [
                21814,
                21837
            ],
            [
                21837,
                21843
            ],
            [
                21843,
                21849
            ],
            [
                21849,
                21874
            ],
            [
                21874,
                21887
            ],
            [
                21896,
                21912
            ],
            [
                21935,
                21937
            ],
            [
                21937,
                21958
            ],
            [
                21960,
                21969
            ],
            [
                21977,
                22004
            ],
            [
                22004,
                22005
            ],
            [
                22022,
                22050
            ],
            [
                22074,
                22089
            ],
            [
                22089,
                22115
            ],
            [
                22140,
                22142
            ],
            [
                22142,
                22158
            ],
            [
                22169,
                22231
            ],
            [
                22231,
                22255
            ],
            [
                22259,
                22261
            ],
            [
                22291,
                22295
            ],
            [
                22299,
                22318
            ],
            [
                22318,
                22328
            ],
            [
                22334,
                22376
            ],
            [
                22383,
                22407
            ],
            [
                22553,
                22563
            ],
            [
                22717,
                22720
            ],
            [
                22727,
                22743
            ],
            [
                22709,
                22710
            ],
            [
                22759,
                22788
            ],
            [
                22814,
                22827
            ],
            [
                22874,
                22875
            ],
            [
                22828,
                22874
            ],
            [
                22904,
                22946
            ],
            [
                22947,
                22977
            ],
            [
                23038,
                23064
            ],
            [
                22988,
                23002
            ],
            [
                23068,
                23109
            ],
            [
                23143,
                23144
            ],
            [
                23148,
                23179
            ],
            [
                23180,
                23184
            ],
            [
                23199,
                23201
            ],
            [
                23201,
                23234
            ],
            [
                23234,
                23242
            ],
            [
                23242,
                23259
            ],
            [
                23259,
                23302
            ],
            [
                23302,
                23342
            ],
            [
                23364,
                23412
            ],
            [
                23412,
                23576
            ],
            [
                23576,
                23627
            ],
            [
                23762,
                23784
            ],
            [
                23796,
                23803
            ],
            [
                23814,
                23831
            ],
            [
                23831,
                23881
            ],
            [
                23881,
                23930
            ],
            [
                23956,
                23959
            ],
            [
                23963,
                23999
            ],
            [
                23960,
                23962
            ],
            [
                24016,
                24039
            ],
            [
                24039,
                24058
            ],
            [
                24067,
                24083
            ],
            [
                24083,
                24122
            ],
            [
                24122,
                24127
            ],
            [
                24138,
                24158
            ],
            [
                24171,
                24172
            ],
            [
                24159,
                24171
            ],
            [
                24221,
                24223
            ],
            [
                24128,
                24131
            ],
            [
                24280,
                24281
            ],
            [
                24282,
                24328
            ],
            [
                24350,
                24353
            ],
            [
                24358,
                24361
            ],
            [
                24397,
                24401
            ],
            [
                24481,
                24489
            ],
            [
                24453,
                24480
            ],
            [
                24508,
                24510
            ],
            [
                24510,
                24548
            ],
            [
                24548,
                24647
            ],
            [
                24647,
                24667
            ],
            [
                24671,
                24684
            ],
            [
                24684,
                24693
            ],
            [
                24707,
                24727
            ],
            [
                24702,
                24706
            ],
            [
                24736,
                24768
            ],
            [
                24768,
                24791
            ],
            [
                24791,
                24809
            ],
            [
                24816,
                24818
            ],
            [
                24818,
                24819
            ],
            [
                24835,
                24852
            ],
            [
                24855,
                24873
            ],
            [
                24874,
                24906
            ],
            [
                24932,
                24949
            ]
        ],
        "row_chars": [
            [
                0,
                236
            ],
            [
                236,
                356
            ],
            [
                356,
                575
            ],
            [
                575,
                640
            ],
            [
                640,
                770
            ],
            [
                770,
                980
            ],
            [
                980,
                1090
            ],
            [
                1090,
                1149
            ],
            [
                1149,
                1195
            ],
            [
                1195,
                1233
            ],
            [
                1233,
                1274
            ],
            [
                1274,
                1292
            ],
            [
                1292,
                1411
            ],
            [
                1411,
                1496
            ],
            [
                1496,
                1546
            ],
            [
                1546,
                1601
            ],
            [
                1601,
                1670
            ],
            [
                1670,
                1720
            ],
            [
                1720,
                1752
            ],
            [
                1752,
                1790
            ],
            [
                1790,
                1853
            ],
            [
                1853,
                1920
            ],
            [
                1920,
                1960
            ],
            [
                1960,
                2114
            ],
            [
                2114,
                2218
            ],
            [
                2218,
                2402
            ],
            [
                2402,
                2531
            ],
            [
                2531,
                2581
            ],
            [
                2581,
                2633
            ],
            [
                2633,
                2724
            ],
            [
                2724,
                2791
            ],
            [
                2791,
                2841
            ],
            [
                2841,
                2855
            ],
            [
                2855,
                2892
            ],
            [
                2892,
                2923
            ],
            [
                2923,
                3015
            ],
            [
                3015,
                3047
            ],
            [
                3047,
                3079
            ],
            [
                3079,
                3178
            ],
            [
                3178,
                3231
            ],
            [
                3231,
                3243
            ],
            [
                3243,
                3309
            ],
            [
                3309,
                3334
            ],
            [
                3334,
                3358
            ],
            [
                3358,
                3372
            ],
            [
                3372,
                3401
            ],
            [
                3401,
                3424
            ],
            [
                3424,
                3458
            ],
            [
                3458,
                3538
            ],
            [
                3538,
                3625
            ],
            [
                3625,
                3679
            ],
            [
                3679,
                3713
            ],
            [
                3713,
                3739
            ],
            [
                3739,
                3775
            ],
            [
                3775,
                3814
            ],
            [
                3814,
                3859
            ],
            [
                3859,
                4127
            ],
            [
                4127,
                4163
            ],
            [
                4163,
                4185
            ],
            [
                4185,
                4220
            ],
            [
                4220,
                4263
            ],
            [
                4263,
                4547
            ],
            [
                4547,
                4628
            ],
            [
                4628,
                4918
            ],
            [
                4918,
                5047
            ],
            [
                5047,
                5159
            ],
            [
                5159,
                5197
            ],
            [
                5197,
                5425
            ],
            [
                5425,
                5709
            ],
            [
                5709,
                6101
            ],
            [
                6101,
                6236
            ],
            [
                6236,
                6310
            ],
            [
                6310,
                6380
            ],
            [
                6380,
                6429
            ],
            [
                6429,
                6513
            ],
            [
                6513,
                6563
            ],
            [
                6563,
                6574
            ],
            [
                6574,
                6647
            ],
            [
                6647,
                6724
            ],
            [
                6724,
                6865
            ],
            [
                6865,
                6988
            ],
            [
                6988,
                7011
            ],
            [
                7011,
                7141
            ],
            [
                7141,
                7202
            ],
            [
                7202,
                7289
            ],
            [
                7289,
                7416
            ],
            [
                7416,
                7636
            ],
            [
                7636,
                7779
            ],
            [
                7779,
                7918
            ],
            [
                7918,
                8054
            ],
            [
                8054,
                8193
            ],
            [
                8193,
                8412
            ],
            [
                8412,
                8522
            ],
            [
                8522,
                8669
            ],
            [
                8669,
                8800
            ],
            [
                8800,
                8991
            ],
            [
                8991,
                9040
            ],
            [
                9040,
                9086
            ],
            [
                9086,
                9124
            ],
            [
                9124,
                9262
            ],
            [
                9262,
                9294
            ],
            [
                9294,
                9311
            ],
            [
                9311,
                9325
            ],
            [
                9325,
                9356
            ],
            [
                9356,
                9407
            ],
            [
                9407,
                9426
            ],
            [
                9426,
                9486
            ],
            [
                9486,
                9572
            ],
            [
                9572,
                9621
            ],
            [
                9621,
                9667
            ],
            [
                9667,
                9722
            ],
            [
                9722,
                9764
            ],
            [
                9764,
                9831
            ],
            [
                9831,
                9930
            ],
            [
                9930,
                9962
            ],
            [
                9962,
                10208
            ],
            [
                10208,
                10297
            ],
            [
                10297,
                10443
            ],
            [
                10443,
                10535
            ],
            [
                10535,
                10572
            ],
            [
                10572,
                10634
            ],
            [
                10634,
                10706
            ],
            [
                10706,
                10730
            ],
            [
                10730,
                10912
            ],
            [
                10912,
                10964
            ],
            [
                10964,
                10999
            ],
            [
                10999,
                11011
            ],
            [
                11011,
                11021
            ],
            [
                11021,
                11090
            ],
            [
                11090,
                11180
            ],
            [
                11180,
                11308
            ],
            [
                11308,
                11381
            ],
            [
                11381,
                11476
            ],
            [
                11476,
                11533
            ],
            [
                11533,
                11662
            ],
            [
                11662,
                11740
            ],
            [
                11740,
                11782
            ],
            [
                11782,
                11876
            ],
            [
                11876,
                11984
            ],
            [
                11984,
                12076
            ],
            [
                12076,
                12322
            ],
            [
                12322,
                12470
            ],
            [
                12470,
                12561
            ],
            [
                12561,
                12598
            ],
            [
                12598,
                12780
            ],
            [
                12780,
                12821
            ],
            [
                12821,
                12877
            ],
            [
                12877,
                13151
            ],
            [
                13151,
                13230
            ],
            [
                13230,
                13256
            ],
            [
                13256,
                13344
            ],
            [
                13344,
                13474
            ],
            [
                13474,
                13759
            ],
            [
                13759,
                14047
            ],
            [
                14047,
                14139
            ],
            [
                14139,
                14319
            ],
            [
                14319,
                14557
            ],
            [
                14557,
                14653
            ],
            [
                14653,
                14775
            ],
            [
                14775,
                14803
            ],
            [
                14803,
                14915
            ],
            [
                14915,
                14954
            ],
            [
                14954,
                15008
            ],
            [
                15008,
                15151
            ],
            [
                15151,
                15173
            ],
            [
                15173,
                15213
            ],
            [
                15213,
                15275
            ],
            [
                15275,
                15314
            ],
            [
                15314,
                15364
            ],
            [
                15364,
                15437
            ],
            [
                15437,
                15547
            ],
            [
                15547,
                15580
            ],
            [
                15580,
                15818
            ],
            [
                15818,
                15867
            ],
            [
                15867,
                15922
            ],
            [
                15922,
                15986
            ],
            [
                15986,
                16122
            ],
            [
                16122,
                16276
            ],
            [
                16276,
                16367
            ],
            [
                16367,
                16439
            ],
            [
                16439,
                16501
            ],
            [
                16501,
                16569
            ],
            [
                16569,
                16662
            ],
            [
                16662,
                16719
            ],
            [
                16719,
                16795
            ],
            [
                16795,
                16867
            ],
            [
                16867,
                16931
            ],
            [
                16931,
                16965
            ],
            [
                16965,
                17039
            ],
            [
                17039,
                17097
            ],
            [
                17097,
                17268
            ],
            [
                17268,
                17328
            ],
            [
                17328,
                17379
            ],
            [
                17379,
                17456
            ],
            [
                17456,
                17542
            ],
            [
                17542,
                17597
            ],
            [
                17597,
                17623
            ],
            [
                17623,
                17673
            ],
            [
                17673,
                17758
            ],
            [
                17758,
                17805
            ],
            [
                17805,
                17947
            ],
            [
                17947,
                17981
            ],
            [
                17981,
                18016
            ],
            [
                18016,
                18027
            ],
            [
                18027,
                18073
            ],
            [
                18073,
                18099
            ],
            [
                18099,
                18165
            ],
            [
                18165,
                18198
            ],
            [
                18198,
                18238
            ],
            [
                18238,
                18257
            ],
            [
                18257,
                18335
            ],
            [
                18335,
                18385
            ],
            [
                18385,
                18400
            ],
            [
                18400,
                18419
            ],
            [
                18419,
                18487
            ],
            [
                18487,
                18622
            ],
            [
                18622,
                18707
            ],
            [
                18707,
                18754
            ],
            [
                18754,
                18781
            ],
            [
                18781,
                18891
            ],
            [
                18891,
                18999
            ],
            [
                18999,
                19075
            ],
            [
                19075,
                19092
            ],
            [
                19092,
                19102
            ],
            [
                19102,
                19145
            ],
            [
                19145,
                19153
            ],
            [
                19153,
                19189
            ],
            [
                19189,
                19201
            ],
            [
                19201,
                19227
            ],
            [
                19227,
                19294
            ],
            [
                19294,
                19324
            ],
            [
                19324,
                19332
            ],
            [
                19332,
                19396
            ],
            [
                19396,
                19441
            ],
            [
                19441,
                19482
            ],
            [
                19482,
                19493
            ],
            [
                19493,
                19549
            ],
            [
                19549,
                19560
            ],
            [
                19560,
                19632
            ],
            [
                19632,
                19708
            ],
            [
                19708,
                19764
            ],
            [
                19764,
                19833
            ],
            [
                19833,
                19891
            ],
            [
                19891,
                19950
            ],
            [
                19950,
                20077
            ],
            [
                20077,
                20137
            ],
            [
                20137,
                20236
            ],
            [
                20236,
                20311
            ],
            [
                20311,
                20344
            ],
            [
                20344,
                20409
            ],
            [
                20409,
                20433
            ],
            [
                20433,
                20564
            ],
            [
                20564,
                20660
            ],
            [
                20660,
                20696
            ],
            [
                20696,
                20763
            ],
            [
                20763,
                20979
            ],
            [
                20979,
                21148
            ],
            [
                21148,
                21189
            ],
            [
                21189,
                21274
            ],
            [
                21274,
                21365
            ],
            [
                21365,
                21392
            ],
            [
                21392,
                21423
            ],
            [
                21423,
                21454
            ],
            [
                21454,
                21487
            ],
            [
                21487,
                21536
            ],
            [
                21536,
                21562
            ],
            [
                21562,
                21592
            ],
            [
                21592,
                21628
            ],
            [
                21628,
                21680
            ],
            [
                21680,
                21746
            ],
            [
                21746,
                21805
            ],
            [
                21805,
                21814
            ],
            [
                21814,
                21837
            ],
            [
                21837,
                21843
            ],
            [
                21843,
                21849
            ],
            [
                21849,
                21874
            ],
            [
                21874,
                21937
            ],
            [
                21937,
                22004
            ],
            [
                22004,
                22050
            ],
            [
                22050,
                22074
            ],
            [
                22074,
                22089
            ],
            [
                22089,
                22142
            ],
            [
                22142,
                22231
            ],
            [
                22231,
                22318
            ],
            [
                22318,
                22408
            ],
            [
                22408,
                22475
            ],
            [
                22475,
                22553
            ],
            [
                22553,
                22947
            ],
            [
                22947,
                23110
            ],
            [
                23110,
                23143
            ],
            [
                23143,
                23201
            ],
            [
                23201,
                23234
            ],
            [
                23234,
                23242
            ],
            [
                23242,
                23259
            ],
            [
                23259,
                23302
            ],
            [
                23302,
                23342
            ],
            [
                23342,
                23364
            ],
            [
                23364,
                23412
            ],
            [
                23412,
                23576
            ],
            [
                23576,
                23630
            ],
            [
                23630,
                23761
            ],
            [
                23761,
                23831
            ],
            [
                23831,
                23881
            ],
            [
                23881,
                24039
            ],
            [
                24039,
                24083
            ],
            [
                24083,
                24122
            ],
            [
                24122,
                24282
            ],
            [
                24282,
                24353
            ],
            [
                24353,
                24402
            ],
            [
                24402,
                24439
            ],
            [
                24439,
                24453
            ],
            [
                24453,
                24510
            ],
            [
                24510,
                24548
            ],
            [
                24548,
                24647
            ],
            [
                24647,
                24684
            ],
            [
                24684,
                24768
            ],
            [
                24768,
                24791
            ],
            [
                24791,
                24818
            ],
            [
                24818,
                24949
            ]
        ]
    },
    "abridged": {
        "text": "Sir Felix Carbury agreed to meet Ruby Ruggles a second time at the bottom of the kitchen-garden of Sheep's Acre farm. He made this appointment without any intention of keeping it. But Ruby was there, and hung about among the cabbages till her grandfather returned from Harlestone market. She thought that a fine London gentleman like her lover might well be late. But he did not come, and she was obliged at last to go into the house.\nAfter that for three weeks she heard nothing of him, but she was always thinking of him; and though she could not altogether avoid her country lover, she was in his company as little as possible.\nOne afternoon her grandfather told her that her country lover was coming to see her.\n\"John Crumb be a coming over by-and-by,\" said the old man. \"See and have a bit o' supper ready for him.\"\n\"John Crumb? He's welcome to stay away, for me.\"\n\"That be dommed.\" The old man thrust his hat on to his head and seated himself in a wooden arm-chair by the kitchen-fire. Whenever he was angry he put on his hat, as Ruby knew. \"Why not welcome? Look ye here, Ruby, I'm going to have an end o' this. John Crumb is to marry you next month, and the banns is to be said.\"\n\"The parson may say what he pleases, grandfather. I can't stop him. But no parson can marry me without I'm willing.\"\n\"And why should you no be willing, you contrairy young jade, you?\"\n\"You've been a' drinking, grandfather.\"\nHe turned round sharp, and threw his old hat at her. She picked it up, and returned it to him with cool indifference.\n\"Look ye here, Ruby,\" he said, \"if you go from here as John Crumb's wife you'll go with five hun'erd pound, and we'll have a dinner, and a dance, and all Bungay.\"\n\"Who cares for all Bungay - beery chaps as knows nothing but swilling and smoking? There never was a chap for beer like John Crumb.\"\n\"Never saw him the worse o' liquor in all my life.\" And the old farmer rattled his fist upon the table.\n\"It just makes him stoopider.\"\n\"Didn't ye say as how ye'd have him? Didn't ye promise?\"\n\"If I did, I ain't the first girl as has gone back of her word.\"\n\"You means you won't have him?\"\n\"That's about it, grandfather.\"\n\"Then you'll have to have somebody to fend for ye, for you won't have me.\"\n\"There ain't no difficulty about that, grandfather.\"\n\"Very well. John Crumb's a coming here tonight, and you may settle it along wi' him. I know of your doings.\"\n\"What doings! There ain't no doings.\"\n\"If you can make it up wi' him, well and good. There's five hun'erd pound, and if you don't like to take it - leave it. But you'll leave Sheep's Acre too.\"\n\"Bother Sheep's Acre. Who wants to stop at Sheep's Acre? It's the stoopidest place in all England.\"\n\"Stoopid, is it? Then find another. If Sheep's Acre ain't good enough for you, you'd best find another home.\"\nMiss Ruggles prepared supper for John Crumb; she knew that she owed that service to her grandfather. But she determined that she would make John Crumb understand that she would never be his wife. As she went about the kitchen, cutting slices of ham, and trussing the fowl that was to be boiled for John Crumb, she made mental comparisons between him and Sir Felix Carbury. She could see the mealy, floury head of the one, his hair stiff with dust, and the sweet glossy well-combed locks of the other, so bright, so seductive, that she was always longing to twine her fingers among them.\nAnd she remembered the heavy, flat, honest face of the meal-man, with his slowly-moving mouth, and his broad white nose, and his great staring eyes; and then she remembered the white teeth, the perfect eyebrows, and the rich complexion of her London lover. Surely even one year of Paradise with him would be well purchased at the price of a life with the other!\n\"It's no good going against love,\" she said to herself. \"He shall have his supper, and be told all about it, and then go home. He cares more for his supper than he do for me.\" And with this resolution she popped the fowl into the pot. Her grandfather wanted her to leave Sheep's Acre. Very well. She had a little money of her own, and would take herself off to London. She knew what people would say, but she cared nothing for old women's tales. She knew how to take care of herself.\nAt seven o'clock John Crumb knocked at the door of Sheep's Acre farm-house. He was accompanied by his friend Joe Mixet, the baker of Bungay, who was to be his best man at his wedding. John Crumb had many fine attributes. He was not afraid of work, nor of any man, and he was honest. After his fashion he had chivalrous ideas: he was willing to thrash any man that ill-used a woman.\nBut Ruby had told the truth in saying that he was slow of speech, and what the world calls stupid in regard to expressing himself. Joe Mixet, who was dapper of person and glib of tongue, had often declared that anyone taking John Crumb for a fool would lose his money. Joe Mixet was probably right; but there had been a lack of worldly wisdom in the way in which Crumb had allowed his proposed marriage with Ruby Ruggles to become a source of gossip. He was proud of Ruby's beauty, and of his status as her lover; and he did not hide it. Now, when he came to settle the wedding day - having heard that there was a difficulty with Ruby - he brought his friend Mixet with him as though to be present at his triumph.\nThe old man roused himself to entertain his guests.\n\"Joe Mixet; is that thou? Come in, man. Well, John, how is it wi' you? Ruby's a stewing o' something for us to eat.\"\n\"Where be she, Muster Ruggles?\" asked John Crumb. Ruby was at work in the back kitchen, where she could be heard among the pots and plates. She now came out, wiping her hands on her apron.\n\"Grandfather said as how you was a coming out for your supper, so I've been a seeing to it. You'll excuse the apron, Mr. Mixet.\"\n\"You couldn't look nicer, miss. My mother says as it's housifery as recommends a girl to the young men. What do you say, John?\"\n\"I loiks to see her loik o' that,\" said John rubbing his hands down the back of his trousers.\n\"Bother!\" said Ruby, turning round sharp, and going back to the other kitchen. John Crumb turned round also, and grinned at his friend and the old man.\n\"You've got it all afore you,\" said the farmer.\n\"There ain't nothing wanting in John's house,\" said Joe Mixet. \"A young woman going to John knows what she'll have to eat when she gets up, and what she'll lie down upon when she goes to bed.\" This he declared in a loud voice for Ruby's benefit.\n\"That she do,\" said John, grinning again. \"There's a hun'erd and fifty poond o' things in my house forbye what mother left behind her.\"\nAfter this there was no more conversation till Ruby reappeared with the boiled fowl. She was followed by the servant-girl with a dish of broiled ham and an enormous pyramid of cabbage. Then the old man got up slowly and from a little private door drew a jug of ale and a bottle of gin. Everything being thus prepared, the three men sat round the table.\nRuby cut up the fowl standing, and dispensed the other good things, not even placing a chair for herself at the table - and no one invited her to do so.\n\"Spirits or ale, Mr. Crumb?\" she said. He gave her a look of love that might have softened the heart of an Amazon; but instead of speaking he bobbed his head at the beer jug. She filled his tumbler to the brim. She would be as kind to him as she knew how - short of love.\nThere was a good deal of eating done; but very little was said. John Crumb finished a second dish of ham, and a second instalment of cabbage, and Ruby replenished his glass. When the eating was done, she retired into the back kitchen, and there had a bit of the fowl, standing up, and then went to work cleaning the dishes. The men lit their pipes and smoked in silence.\nSo matters went on for half an hour; during which Ruby escaped by the back door, went round into the house, got into her own room, and resolved to go to bed. But she was afraid her grandfather would bring John Crumb upstairs to speak to her; and her door had no bolt. It would be terrible to be invaded by John Crumb after his fifth or sixth glass of beer. And he would be sure to bring Joe Mixet with him. So she paused and listened.\nWhen they had smoked for half an hour the old man called for his granddaughter, in vain.\n\"Where the mischief is the jade gone?\" he said, slowly making his way into the empty back kitchen. \"She'll make the place hot for her, if she goes on this way.\"\nThen he returned to the two young men. \"She's playing off her games somewheres,\" he said. \"Take a glass of sperrits and water, Mr. Crumb, and I'll look for her.\"\n\"I'll just take a drop of ale,\" said John Crumb, apparently quite unmoved by his sweetheart's absence.\nIt was sad work for the old man. He went down into the garden, hobbling among the cabbages, not daring to call very loud; but still anxious, and sore at heart about Ruby's ingratitude. She was not even his own child - yet he had offered her 500!\n\"Domm her,\" he said aloud as he made his way back to the house. After much searching he found Ruby, cuffed her and led her to the kitchen.\n\"We're a disturbing you too late, miss,\" said Mr. Mixet.\n\"It ain't that at all, Mr. Mixet. If grandfather chooses to have a few friends, I ain't nothing against it. If you and Mr. Crumb've come out to Sheep's Acre farm for a bit of supper-\"\n\"Which we ain't,\" said John Crumb very loudly; \"nor yet for beer.\"\n\"We've come for the smiles of beauty,\" said Joe Mixet.\nRuby tossed her head. \"Mr. Mixet, stow that! There ain't no beauty here as I knows of, and if there was it isn't nothing to you.\"\n\"I'm just sick of all this,\" said Mr. Ruggles, who was sitting bent in his chair. \"I won't put up with it no more.\"\n\"Who wants you to put up with it?\" said Ruby. \"Who brought 'em tonight? I don't know what business Mr. Mixet has interfering along o' me.\"\n\"John Crumb, have you anything to say?\" asked the old man.\nThen John Crumb slowly arose from his chair, and stood up at his full height. \"I hove,\" said he, swinging his head to one side.\n\"Then say it.\"\n\"I will.\" He stretched out his left hand to his glass, and drained it of beer. Then he slowly put down his pipe.\n\"Now speak your mind, like a man,\" said Mixet.\n\"I intends it,\" said John. But he still stood dumb. Ruby was standing with both her hands upon the table and her eyes on the wall over the fire-place.\n\"You've asked Miss Ruby to be your wife a dozen times, haven't you, John?\" suggested Mixet.\n\"I hove.\"\n\"And she has promised to have you?\"\n\"She hove.\"\n\"Everything is ready in your own house?\"\n\"They is.\"\n\"And you will expect Miss Ruby to come to the scratch?\"\n\"I sholl.\"\n\"That's about it, I think,\" said Joe Mixet, turning to the grandfather. \"There's been a talk of five hundred pounds, Mr. Ruggles.\" Mr. Ruggles made a slight nod. \"Five hundred pounds is very comfortable; and added to what John has, will make things snug. But John Crumb isn't after Miss Ruby along of her fortune.\"\n\"Nohow's,\" said the lover, shaking his head.\n\"Not he. John has a heart in his buzsom.\"\n\"I has,\" said John, raising his hand a little above his stomach.\n\"And feelings as a man. It's true love as has brought John Crumb to Sheep's Acre farm this night. He's a proposed to this young lady, and she's haccepted him, and now it's about time as they was married. That's what John Crumb has to say.\"\n\"That's what I has to say,\" repeated John Crumb, \"and I means it.\"\n\"And now, miss,\" continued Mixet, \"you can't have anything to say against it, can you? Your grandfather is willing, and John Crumb is willing, and his house is ready. All we want is for you to name the day.\"\n\"Say tomorrow, Ruby, and I'll not be agon it,\" said John Crumb, slapping his thigh.\n\"I won't say tomorrow, Mr. Crumb, nor the day after tomorrow, nor yet no day at all. I'm not going to have you. I've told you as much before.\"\n\"That was only in fun, loike.\"\n\"Then now I tell you in earnest.\"\n\"You don't mean - never?\"\n\"I do mean never, Mr. Crumb.\"\n\"Didn't you say as you would, Ruby?\" John was almost in tears.\n\"Young women is allowed to change their minds,\" said Ruby.\n\"Brute!\" exclaimed old Ruggles. \"Pig! Jade! I'll tell'ee what, John. She'll go out into the streets. I won't keep her here no longer - nasty, ungrateful, lying slut.\"\n\"She ain't that,\" said John. \"She's no slut. I won't hear her called so. But, oh, she has put me so abouts, that I'll have to go home and hang myself.\"\n\"Dash it, Miss Ruby, you can't do that,\" said the baker.\n\"If you'll keep yourself to yourself, I'll be obliged, Mr. Mixet,\" said Ruby.\nMr. Mixet, not trusting himself to words, put on his hat and walked out into the yard, declaring that his friend would find him there whenever he was ready to return to Bungay.\nAs soon as Mixet was gone John made a slow motion towards his sweetheart, putting out his right hand as a feeler.\n\"You'd better be aff after him,\" she said.\n\"And when'll I come back again?\"\n\"Never. It ain't no use. What's the good of more words, Mr. Crumb?\"\n\"Domm her; domm her,\" said old Ruggles. \"She'll have to be out on the roads this night.\"\n\"She shall have the best bed in my house if she'll come for it,\" said John, \"and the old woman to look arter her; and I won't come nigh her till she sends for me.\"\n\"I can find a place for myself, thank ye, Mr. Crumb. And now if you please, I'll go upstairs to my own room.\"\n\"You don't go up to any room here, you jade you.\" The old man as he said this got up from his chair, and would have struck her with his stick had he not been stopped by John Crumb.\n\"Don't hit the girl, Mr. Ruggles.\"\n\"Domm her, John; she breaks my heart.\" While John held her grandfather, Ruby escaped to her bedroom.\n\"Ain't it more nor a man ought to have to bear?\" appealed the old man. \"She ought to have a whipping at the cart-tail. She's been and seen some young buck.\"\nThen John Crumb turned red all over, through the flour, and sparks of anger flashed from his eyes. \"You ain't a meaning it, master?\"\n\"I'm told the squoire's cousin been about - him as they call the baronite.\"\n\"Been along wi' Ruby?\" The old man nodded. \"I'll baronite him - I wull,\" said John, seizing his hat and stalking off after his friend.",
        "paragraph_chars": [
            [
                0,
                435
            ],
            [
                435,
                631
            ],
            [
                631,
                716
            ],
            [
                716,
                821
            ],
            [
                821,
                870
            ],
            [
                870,
                1188
            ],
            [
                1188,
                1305
            ],
            [
                1305,
                1372
            ],
            [
                1372,
                1412
            ],
            [
                1412,
                1530
            ],
            [
                1530,
                1693
            ],
            [
                1693,
                1826
            ],
            [
                1826,
                1930
            ],
            [
                1930,
                1961
            ],
            [
                1961,
                2018
            ],
            [
                2018,
                2083
            ],
            [
                2083,
                2115
            ],
            [
                2115,
                2147
            ],
            [
                2147,
                2222
            ],
            [
                2222,
                2275
            ],
            [
                2275,
                2384
            ],
            [
                2384,
                2422
            ],
            [
                2422,
                2578
            ],
            [
                2578,
                2678
            ],
            [
                2678,
                2788
            ],
            [
                2788,
                3375
            ],
            [
                3375,
                3737
            ],
            [
                3737,
                4221
            ],
            [
                4221,
                4603
            ],
            [
                4603,
                5317
            ],
            [
                5317,
                5369
            ],
            [
                5369,
                5486
            ],
            [
                5486,
                5675
            ],
            [
                5675,
                5804
            ],
            [
                5804,
                5932
            ],
            [
                5932,
                6026
            ],
            [
                6026,
                6178
            ],
            [
                6178,
                6226
            ],
            [
                6226,
                6472
            ],
            [
                6472,
                6608
            ],
            [
                6608,
                6961
            ],
            [
                6961,
                7114
            ],
            [
                7114,
                7386
            ],
            [
                7386,
                7757
            ],
            [
                7757,
                8192
            ],
            [
                8192,
                8281
            ],
            [
                8281,
                8442
            ],
            [
                8442,
                8604
            ],
            [
                8604,
                8707
            ],
            [
                8707,
                8953
            ],
            [
                8953,
                9092
            ],
            [
                9092,
                9149
            ],
            [
                9149,
                9333
            ],
            [
                9333,
                9400
            ],
            [
                9400,
                9455
            ],
            [
                9455,
                9585
            ],
            [
                9585,
                9701
            ],
            [
                9701,
                9840
            ],
            [
                9840,
                9899
            ],
            [
                9899,
                10027
            ],
            [
                10027,
                10042
            ],
            [
                10042,
                10155
            ],
            [
                10155,
                10202
            ],
            [
                10202,
                10353
            ],
            [
                10353,
                10445
            ],
            [
                10445,
                10455
            ],
            [
                10455,
                10491
            ],
            [
                10491,
                10503
            ],
            [
                10503,
                10544
            ],
            [
                10544,
                10555
            ],
            [
                10555,
                10611
            ],
            [
                10611,
                10622
            ],
            [
                10622,
                10937
            ],
            [
                10937,
                10982
            ],
            [
                10982,
                11024
            ],
            [
                11024,
                11089
            ],
            [
                11089,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11604
            ],
            [
                11604,
                11688
            ],
            [
                11688,
                11831
            ],
            [
                11831,
                11862
            ],
            [
                11862,
                11896
            ],
            [
                11896,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                12015
            ],
            [
                12015,
                12074
            ],
            [
                12074,
                12241
            ],
            [
                12241,
                12393
            ],
            [
                12393,
                12450
            ],
            [
                12450,
                12528
            ],
            [
                12528,
                12705
            ],
            [
                12705,
                12819
            ],
            [
                12819,
                12862
            ],
            [
                12862,
                12895
            ],
            [
                12895,
                12963
            ],
            [
                12963,
                13052
            ],
            [
                13052,
                13216
            ],
            [
                13216,
                13326
            ],
            [
                13326,
                13507
            ],
            [
                13507,
                13542
            ],
            [
                13542,
                13643
            ],
            [
                13643,
                13800
            ],
            [
                13800,
                13933
            ],
            [
                13933,
                14009
            ],
            [
                14009,
                14143
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                180
            ],
            [
                180,
                288
            ],
            [
                288,
                364
            ],
            [
                364,
                435
            ],
            [
                435,
                631
            ],
            [
                631,
                716
            ],
            [
                716,
                775
            ],
            [
                775,
                821
            ],
            [
                821,
                834
            ],
            [
                834,
                870
            ],
            [
                870,
                888
            ],
            [
                888,
                992
            ],
            [
                992,
                1047
            ],
            [
                1047,
                1065
            ],
            [
                1065,
                1119
            ],
            [
                1119,
                1188
            ],
            [
                1188,
                1238
            ],
            [
                1238,
                1256
            ],
            [
                1256,
                1305
            ],
            [
                1305,
                1372
            ],
            [
                1372,
                1412
            ],
            [
                1412,
                1465
            ],
            [
                1465,
                1530
            ],
            [
                1530,
                1693
            ],
            [
                1693,
                1776
            ],
            [
                1776,
                1826
            ],
            [
                1826,
                1878
            ],
            [
                1878,
                1930
            ],
            [
                1930,
                1961
            ],
            [
                1961,
                1998
            ],
            [
                1998,
                2018
            ],
            [
                2018,
                2083
            ],
            [
                2083,
                2115
            ],
            [
                2115,
                2147
            ],
            [
                2147,
                2222
            ],
            [
                2222,
                2275
            ],
            [
                2275,
                2287
            ],
            [
                2287,
                2360
            ],
            [
                2360,
                2384
            ],
            [
                2384,
                2398
            ],
            [
                2398,
                2422
            ],
            [
                2422,
                2469
            ],
            [
                2469,
                2542
            ],
            [
                2542,
                2578
            ],
            [
                2578,
                2600
            ],
            [
                2600,
                2635
            ],
            [
                2635,
                2678
            ],
            [
                2678,
                2695
            ],
            [
                2695,
                2714
            ],
            [
                2714,
                2788
            ],
            [
                2788,
                2889
            ],
            [
                2889,
                2984
            ],
            [
                2984,
                3161
            ],
            [
                3161,
                3375
            ],
            [
                3375,
                3632
            ],
            [
                3632,
                3737
            ],
            [
                3737,
                3793
            ],
            [
                3793,
                3864
            ],
            [
                3864,
                3913
            ],
            [
                3913,
                3972
            ],
            [
                3972,
                4022
            ],
            [
                4022,
                4033
            ],
            [
                4033,
                4106
            ],
            [
                4106,
                4183
            ],
            [
                4183,
                4221
            ],
            [
                4221,
                4297
            ],
            [
                4297,
                4405
            ],
            [
                4405,
                4442
            ],
            [
                4442,
                4504
            ],
            [
                4504,
                4603
            ],
            [
                4603,
                4734
            ],
            [
                4734,
                4872
            ],
            [
                4872,
                5054
            ],
            [
                5054,
                5141
            ],
            [
                5141,
                5317
            ],
            [
                5317,
                5369
            ],
            [
                5369,
                5395
            ],
            [
                5395,
                5409
            ],
            [
                5409,
                5440
            ],
            [
                5440,
                5486
            ],
            [
                5486,
                5518
            ],
            [
                5518,
                5536
            ],
            [
                5536,
                5626
            ],
            [
                5626,
                5675
            ],
            [
                5675,
                5767
            ],
            [
                5767,
                5804
            ],
            [
                5804,
                5836
            ],
            [
                5836,
                5908
            ],
            [
                5908,
                5932
            ],
            [
                5932,
                6026
            ],
            [
                6026,
                6036
            ],
            [
                6036,
                6105
            ],
            [
                6105,
                6178
            ],
            [
                6178,
                6226
            ],
            [
                6226,
                6289
            ],
            [
                6289,
                6419
            ],
            [
                6419,
                6472
            ],
            [
                6472,
                6514
            ],
            [
                6514,
                6608
            ],
            [
                6608,
                6693
            ],
            [
                6693,
                6793
            ],
            [
                6793,
                6894
            ],
            [
                6894,
                6961
            ],
            [
                6961,
                7114
            ],
            [
                7114,
                7143
            ],
            [
                7143,
                7153
            ],
            [
                7153,
                7289
            ],
            [
                7289,
                7325
            ],
            [
                7325,
                7386
            ],
            [
                7386,
                7450
            ],
            [
                7450,
                7560
            ],
            [
                7560,
                7710
            ],
            [
                7710,
                7757
            ],
            [
                7757,
                7915
            ],
            [
                7915,
                8025
            ],
            [
                8025,
                8114
            ],
            [
                8114,
                8164
            ],
            [
                8164,
                8192
            ],
            [
                8192,
                8281
            ],
            [
                8281,
                8320
            ],
            [
                8320,
                8380
            ],
            [
                8380,
                8442
            ],
            [
                8442,
                8481
            ],
            [
                8481,
                8532
            ],
            [
                8532,
                8604
            ],
            [
                8604,
                8707
            ],
            [
                8707,
                8740
            ],
            [
                8740,
                8892
            ],
            [
                8892,
                8953
            ],
            [
                8953,
                9017
            ],
            [
                9017,
                9092
            ],
            [
                9092,
                9149
            ],
            [
                9149,
                9183
            ],
            [
                9183,
                9257
            ],
            [
                9257,
                9333
            ],
            [
                9333,
                9400
            ],
            [
                9400,
                9455
            ],
            [
                9455,
                9477
            ],
            [
                9477,
                9500
            ],
            [
                9500,
                9585
            ],
            [
                9585,
                9667
            ],
            [
                9667,
                9701
            ],
            [
                9701,
                9736
            ],
            [
                9736,
                9747
            ],
            [
                9747,
                9773
            ],
            [
                9773,
                9840
            ],
            [
                9840,
                9880
            ],
            [
                9880,
                9899
            ],
            [
                9899,
                9977
            ],
            [
                9977,
                10027
            ],
            [
                10027,
                10042
            ],
            [
                10042,
                10052
            ],
            [
                10052,
                10121
            ],
            [
                10121,
                10155
            ],
            [
                10155,
                10202
            ],
            [
                10202,
                10229
            ],
            [
                10229,
                10254
            ],
            [
                10254,
                10353
            ],
            [
                10353,
                10428
            ],
            [
                10428,
                10445
            ],
            [
                10445,
                10455
            ],
            [
                10455,
                10491
            ],
            [
                10491,
                10503
            ],
            [
                10503,
                10544
            ],
            [
                10544,
                10555
            ],
            [
                10555,
                10611
            ],
            [
                10611,
                10622
            ],
            [
                10622,
                10694
            ],
            [
                10694,
                10753
            ],
            [
                10753,
                10784
            ],
            [
                10784,
                10877
            ],
            [
                10877,
                10937
            ],
            [
                10937,
                10982
            ],
            [
                10982,
                10991
            ],
            [
                10991,
                11024
            ],
            [
                11024,
                11089
            ],
            [
                11089,
                11113
            ],
            [
                11113,
                11187
            ],
            [
                11187,
                11293
            ],
            [
                11293,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11483
            ],
            [
                11483,
                11563
            ],
            [
                11563,
                11604
            ],
            [
                11604,
                11688
            ],
            [
                11688,
                11773
            ],
            [
                11773,
                11800
            ],
            [
                11800,
                11831
            ],
            [
                11831,
                11862
            ],
            [
                11862,
                11896
            ],
            [
                11896,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                11989
            ],
            [
                11989,
                12015
            ],
            [
                12015,
                12074
            ],
            [
                12074,
                12083
            ],
            [
                12083,
                12106
            ],
            [
                12106,
                12112
            ],
            [
                12112,
                12118
            ],
            [
                12118,
                12143
            ],
            [
                12143,
                12175
            ],
            [
                12175,
                12241
            ],
            [
                12241,
                12270
            ],
            [
                12270,
                12286
            ],
            [
                12286,
                12314
            ],
            [
                12314,
                12393
            ],
            [
                12393,
                12450
            ],
            [
                12450,
                12528
            ],
            [
                12528,
                12705
            ],
            [
                12705,
                12819
            ],
            [
                12819,
                12862
            ],
            [
                12862,
                12895
            ],
            [
                12895,
                12903
            ],
            [
                12903,
                12920
            ],
            [
                12920,
                12963
            ],
            [
                12963,
                13003
            ],
            [
                13003,
                13052
            ],
            [
                13052,
                13216
            ],
            [
                13216,
                13269
            ],
            [
                13269,
                13326
            ],
            [
                13326,
                13376
            ],
            [
                13376,
                13507
            ],
            [
                13507,
                13542
            ],
            [
                13542,
                13581
            ],
            [
                13581,
                13643
            ],
            [
                13643,
                13692
            ],
            [
                13692,
                13714
            ],
            [
                13714,
                13762
            ],
            [
                13762,
                13800
            ],
            [
                13800,
                13899
            ],
            [
                13899,
                13933
            ],
            [
                13933,
                14009
            ],
            [
                14009,
                14032
            ],
            [
                14032,
                14052
            ],
            [
                14052,
                14143
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                25,
                27
            ],
            [
                33,
                95
            ],
            [
                99,
                116
            ],
            [
                118,
                120
            ],
            [
                121,
                125
            ],
            [
                131,
                142
            ],
            [
                143,
                180
            ],
            [
                180,
                203
            ],
            [
                209,
                288
            ],
            [
                292,
                311
            ],
            [
                312,
                318
            ],
            [
                319,
                328
            ],
            [
                334,
                343
            ],
            [
                344,
                354
            ],
            [
                355,
                357
            ],
            [
                362,
                364
            ],
            [
                364,
                388
            ],
            [
                389,
                404
            ],
            [
                413,
                415
            ],
            [
                419,
                435
            ],
            [
                435,
                482
            ],
            [
                486,
                523
            ],
            [
                524,
                630
            ],
            [
                631,
                660
            ],
            [
                661,
                715
            ],
            [
                716,
                775
            ],
            [
                775,
                821
            ],
            [
                821,
                832
            ],
            [
                832,
                834
            ],
            [
                834,
                859
            ],
            [
                859,
                870
            ],
            [
                870,
                888
            ],
            [
                888,
                910
            ],
            [
                911,
                970
            ],
            [
                971,
                992
            ],
            [
                992,
                1032
            ],
            [
                1036,
                1040
            ],
            [
                1045,
                1047
            ],
            [
                1047,
                1063
            ],
            [
                1063,
                1065
            ],
            [
                1065,
                1105
            ],
            [
                1106,
                1119
            ],
            [
                1119,
                1188
            ],
            [
                1188,
                1238
            ],
            [
                1238,
                1250
            ],
            [
                1254,
                1256
            ],
            [
                1256,
                1269
            ],
            [
                1270,
                1305
            ],
            [
                1305,
                1372
            ],
            [
                1372,
                1412
            ],
            [
                1412,
                1427
            ],
            [
                1428,
                1463
            ],
            [
                1463,
                1465
            ],
            [
                1465,
                1510
            ],
            [
                1511,
                1528
            ],
            [
                1528,
                1529
            ],
            [
                1530,
                1562
            ],
            [
                1562,
                1571
            ],
            [
                1577,
                1581
            ],
            [
                1582,
                1661
            ],
            [
                1661,
                1693
            ],
            [
                1693,
                1718
            ],
            [
                1721,
                1774
            ],
            [
                1774,
                1776
            ],
            [
                1776,
                1826
            ],
            [
                1826,
                1878
            ],
            [
                1878,
                1896
            ],
            [
                1897,
                1913
            ],
            [
                1914,
                1930
            ],
            [
                1930,
                1933
            ],
            [
                1934,
                1958
            ],
            [
                1961,
                1998
            ],
            [
                1998,
                2007
            ],
            [
                2008,
                2018
            ],
            [
                2018,
                2080
            ],
            [
                2080,
                2083
            ],
            [
                2083,
                2115
            ],
            [
                2115,
                2147
            ],
            [
                2147,
                2197
            ],
            [
                2198,
                2222
            ],
            [
                2222,
                2275
            ],
            [
                2275,
                2287
            ],
            [
                2297,
                2313
            ],
            [
                2321,
                2360
            ],
            [
                2360,
                2384
            ],
            [
                2384,
                2398
            ],
            [
                2398,
                2419
            ],
            [
                2422,
                2423
            ],
            [
                2423,
                2469
            ],
            [
                2469,
                2495
            ],
            [
                2495,
                2496
            ],
            [
                2497,
                2500
            ],
            [
                2501,
                2529
            ],
            [
                2532,
                2542
            ],
            [
                2542,
                2578
            ],
            [
                2578,
                2600
            ],
            [
                2600,
                2635
            ],
            [
                2635,
                2678
            ],
            [
                2678,
                2679
            ],
            [
                2684,
                2694
            ],
            [
                2695,
                2713
            ],
            [
                2714,
                2716
            ],
            [
                2717,
                2756
            ],
            [
                2757,
                2785
            ],
            [
                2788,
                2800
            ],
            [
                2810,
                2816
            ],
            [
                2826,
                2831
            ],
            [
                2833,
                2836
            ],
            [
                2842,
                2846
            ],
            [
                2847,
                2855
            ],
            [
                2856,
                2860
            ],
            [
                2861,
                2889
            ],
            [
                2889,
                2892
            ],
            [
                2893,
                2984
            ],
            [
                2984,
                3014
            ],
            [
                3015,
                3022
            ],
            [
                3023,
                3029
            ],
            [
                3033,
                3036
            ],
            [
                3036,
                3041
            ],
            [
                3042,
                3044
            ],
            [
                3051,
                3161
            ],
            [
                3161,
                3174
            ],
            [
                3175,
                3209
            ],
            [
                3210,
                3213
            ],
            [
                3214,
                3229
            ],
            [
                3230,
                3234
            ],
            [
                3234,
                3256
            ],
            [
                3257,
                3326
            ],
            [
                3334,
                3374
            ],
            [
                3375,
                3410
            ],
            [
                3411,
                3448
            ],
            [
                3463,
                3468
            ],
            [
                3468,
                3483
            ],
            [
                3484,
                3489
            ],
            [
                3490,
                3494
            ],
            [
                3494,
                3522
            ],
            [
                3522,
                3523
            ],
            [
                3524,
                3532
            ],
            [
                3533,
                3563
            ],
            [
                3563,
                3632
            ],
            [
                3632,
                3638
            ],
            [
                3644,
                3647
            ],
            [
                3648,
                3652
            ],
            [
                3653,
                3669
            ],
            [
                3674,
                3736
            ],
            [
                3737,
                3791
            ],
            [
                3791,
                3793
            ],
            [
                3794,
                3864
            ],
            [
                3864,
                3913
            ],
            [
                3913,
                3916
            ],
            [
                3917,
                3926
            ],
            [
                3927,
                3937
            ],
            [
                3938,
                3972
            ],
            [
                3972,
                4022
            ],
            [
                4022,
                4033
            ],
            [
                4033,
                4106
            ],
            [
                4106,
                4183
            ],
            [
                4183,
                4186
            ],
            [
                4192,
                4219
            ],
            [
                4219,
                4221
            ],
            [
                4221,
                4223
            ],
            [
                4224,
                4229
            ],
            [
                4238,
                4263
            ],
            [
                4264,
                4297
            ],
            [
                4297,
                4365
            ],
            [
                4366,
                4395
            ],
            [
                4403,
                4405
            ],
            [
                4405,
                4415
            ],
            [
                4420,
                4442
            ],
            [
                4442,
                4448
            ],
            [
                4453,
                4462
            ],
            [
                4463,
                4468
            ],
            [
                4473,
                4475
            ],
            [
                4480,
                4483
            ],
            [
                4483,
                4488
            ],
            [
                4489,
                4502
            ],
            [
                4502,
                4504
            ],
            [
                4504,
                4545
            ],
            [
                4547,
                4601
            ],
            [
                4601,
                4602
            ],
            [
                4603,
                4630
            ],
            [
                4631,
                4713
            ],
            [
                4732,
                4734
            ],
            [
                4734,
                4813
            ],
            [
                4828,
                4872
            ],
            [
                4872,
                4922
            ],
            [
                4923,
                4938
            ],
            [
                4946,
                5052
            ],
            [
                5052,
                5054
            ],
            [
                5054,
                5091
            ],
            [
                5092,
                5095
            ],
            [
                5096,
                5109
            ],
            [
                5110,
                5115
            ],
            [
                5117,
                5136
            ],
            [
                5139,
                5141
            ],
            [
                5141,
                5144
            ],
            [
                5144,
                5145
            ],
            [
                5146,
                5172
            ],
            [
                5181,
                5184
            ],
            [
                5187,
                5199
            ],
            [
                5200,
                5237
            ],
            [
                5240,
                5316
            ],
            [
                5317,
                5328
            ],
            [
                5329,
                5368
            ],
            [
                5369,
                5370
            ],
            [
                5374,
                5395
            ],
            [
                5395,
                5409
            ],
            [
                5409,
                5440
            ],
            [
                5440,
                5483
            ],
            [
                5486,
                5518
            ],
            [
                5524,
                5534
            ],
            [
                5534,
                5535
            ],
            [
                5536,
                5572
            ],
            [
                5572,
                5573
            ],
            [
                5580,
                5598
            ],
            [
                5599,
                5617
            ],
            [
                5618,
                5626
            ],
            [
                5626,
                5643
            ],
            [
                5644,
                5673
            ],
            [
                5673,
                5674
            ],
            [
                5675,
                5767
            ],
            [
                5767,
                5804
            ],
            [
                5804,
                5834
            ],
            [
                5834,
                5836
            ],
            [
                5836,
                5908
            ],
            [
                5908,
                5932
            ],
            [
                5932,
                6015
            ],
            [
                6024,
                6026
            ],
            [
                6026,
                6036
            ],
            [
                6036,
                6105
            ],
            [
                6105,
                6160
            ],
            [
                6161,
                6164
            ],
            [
                6165,
                6178
            ],
            [
                6178,
                6224
            ],
            [
                6224,
                6226
            ],
            [
                6226,
                6257
            ],
            [
                6258,
                6262
            ],
            [
                6262,
                6264
            ],
            [
                6265,
                6270
            ],
            [
                6270,
                6288
            ],
            [
                6290,
                6419
            ],
            [
                6419,
                6455
            ],
            [
                6456,
                6460
            ],
            [
                6463,
                6470
            ],
            [
                6470,
                6472
            ],
            [
                6472,
                6514
            ],
            [
                6514,
                6608
            ],
            [
                6608,
                6691
            ],
            [
                6691,
                6693
            ],
            [
                6693,
                6716
            ],
            [
                6725,
                6793
            ],
            [
                6793,
                6827
            ],
            [
                6828,
                6834
            ],
            [
                6835,
                6841
            ],
            [
                6842,
                6849
            ],
            [
                6850,
                6854
            ],
            [
                6855,
                6876
            ],
            [
                6877,
                6894
            ],
            [
                6894,
                6959
            ],
            [
                6959,
                6960
            ],
            [
                6961,
                7078
            ],
            [
                7081,
                7084
            ],
            [
                7085,
                7103
            ],
            [
                7104,
                7112
            ],
            [
                7112,
                7113
            ],
            [
                7114,
                7115
            ],
            [
                7123,
                7143
            ],
            [
                7143,
                7151
            ],
            [
                7151,
                7153
            ],
            [
                7153,
                7155
            ],
            [
                7156,
                7255
            ],
            [
                7256,
                7288
            ],
            [
                7289,
                7299
            ],
            [
                7300,
                7311
            ],
            [
                7312,
                7323
            ],
            [
                7323,
                7325
            ],
            [
                7325,
                7368
            ],
            [
                7371,
                7386
            ],
            [
                7386,
                7422
            ],
            [
                7422,
                7439
            ],
            [
                7440,
                7450
            ],
            [
                7450,
                7460
            ],
            [
                7461,
                7469
            ],
            [
                7472,
                7495
            ],
            [
                7498,
                7526
            ],
            [
                7526,
                7531
            ],
            [
                7532,
                7560
            ],
            [
                7560,
                7585
            ],
            [
                7586,
                7589
            ],
            [
                7590,
                7630
            ],
            [
                7631,
                7634
            ],
            [
                7641,
                7653
            ],
            [
                7654,
                7662
            ],
            [
                7665,
                7688
            ],
            [
                7689,
                7710
            ],
            [
                7710,
                7755
            ],
            [
                7755,
                7756
            ],
            [
                7757,
                7891
            ],
            [
                7907,
                7915
            ],
            [
                7915,
                7918
            ],
            [
                7919,
                7922
            ],
            [
                7923,
                7926
            ],
            [
                7934,
                7961
            ],
            [
                7982,
                7984
            ],
            [
                7991,
                7997
            ],
            [
                7999,
                8002
            ],
            [
                8003,
                8006
            ],
            [
                8007,
                8011
            ],
            [
                8016,
                8023
            ],
            [
                8023,
                8025
            ],
            [
                8025,
                8045
            ],
            [
                8046,
                8114
            ],
            [
                8114,
                8117
            ],
            [
                8118,
                8162
            ],
            [
                8162,
                8164
            ],
            [
                8164,
                8192
            ],
            [
                8192,
                8216
            ],
            [
                8217,
                8221
            ],
            [
                8225,
                8271
            ],
            [
                8272,
                8280
            ],
            [
                8281,
                8320
            ],
            [
                8320,
                8359
            ],
            [
                8366,
                8380
            ],
            [
                8380,
                8441
            ],
            [
                8442,
                8481
            ],
            [
                8481,
                8509
            ],
            [
                8520,
                8532
            ],
            [
                8532,
                8588
            ],
            [
                8598,
                8604
            ],
            [
                8604,
                8629
            ],
            [
                8633,
                8680
            ],
            [
                8681,
                8695
            ],
            [
                8698,
                8705
            ],
            [
                8705,
                8707
            ],
            [
                8707,
                8740
            ],
            [
                8740,
                8752
            ],
            [
                8753,
                8827
            ],
            [
                8827,
                8865
            ],
            [
                8879,
                8890
            ],
            [
                8890,
                8892
            ],
            [
                8892,
                8903
            ],
            [
                8909,
                8922
            ],
            [
                8929,
                8952
            ],
            [
                8953,
                9017
            ],
            [
                9017,
                9027
            ],
            [
                9038,
                9040
            ],
            [
                9047,
                9051
            ],
            [
                9051,
                9052
            ],
            [
                9064,
                9067
            ],
            [
                9076,
                9090
            ],
            [
                9090,
                9091
            ],
            [
                9092,
                9115
            ],
            [
                9116,
                9149
            ],
            [
                9149,
                9183
            ],
            [
                9183,
                9257
            ],
            [
                9257,
                9330
            ],
            [
                9333,
                9379
            ],
            [
                9380,
                9397
            ],
            [
                9397,
                9400
            ],
            [
                9400,
                9455
            ],
            [
                9455,
                9459
            ],
            [
                9467,
                9477
            ],
            [
                9477,
                9488
            ],
            [
                9489,
                9500
            ],
            [
                9500,
                9585
            ],
            [
                9585,
                9594
            ],
            [
                9595,
                9611
            ],
            [
                9611,
                9647
            ],
            [
                9648,
                9652
            ],
            [
                9653,
                9665
            ],
            [
                9665,
                9667
            ],
            [
                9667,
                9701
            ],
            [
                9701,
                9736
            ],
            [
                9736,
                9747
            ],
            [
                9748,
                9763
            ],
            [
                9771,
                9773
            ],
            [
                9773,
                9837
            ],
            [
                9840,
                9880
            ],
            [
                9880,
                9899
            ],
            [
                9899,
                9977
            ],
            [
                9977,
                10027
            ],
            [
                10027,
                10042
            ],
            [
                10042,
                10049
            ],
            [
                10052,
                10077
            ],
            [
                10083,
                10095
            ],
            [
                10095,
                10100
            ],
            [
                10112,
                10119
            ],
            [
                10119,
                10121
            ],
            [
                10126,
                10135
            ],
            [
                10145,
                10148
            ],
            [
                10149,
                10153
            ],
            [
                10153,
                10155
            ],
            [
                10155,
                10202
            ],
            [
                10202,
                10229
            ],
            [
                10229,
                10252
            ],
            [
                10252,
                10254
            ],
            [
                10254,
                10319
            ],
            [
                10323,
                10353
            ],
            [
                10353,
                10406
            ],
            [
                10408,
                10428
            ],
            [
                10428,
                10445
            ],
            [
                10445,
                10455
            ],
            [
                10455,
                10491
            ],
            [
                10491,
                10503
            ],
            [
                10503,
                10544
            ],
            [
                10544,
                10555
            ],
            [
                10555,
                10611
            ],
            [
                10611,
                10622
            ],
            [
                10622,
                10694
            ],
            [
                10695,
                10753
            ],
            [
                10753,
                10778
            ],
            [
                10782,
                10784
            ],
            [
                10784,
                10852
            ],
            [
                10854,
                10870
            ],
            [
                10871,
                10875
            ],
            [
                10875,
                10877
            ],
            [
                10877,
                10937
            ],
            [
                10937,
                10980
            ],
            [
                10980,
                10982
            ],
            [
                10982,
                10989
            ],
            [
                10989,
                10991
            ],
            [
                10991,
                11024
            ],
            [
                11024,
                11089
            ],
            [
                11089,
                11113
            ],
            [
                11113,
                11185
            ],
            [
                11185,
                11187
            ],
            [
                11187,
                11205
            ],
            [
                11221,
                11232
            ],
            [
                11233,
                11293
            ],
            [
                11293,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11429
            ],
            [
                11430,
                11473
            ],
            [
                11474,
                11483
            ],
            [
                11483,
                11499
            ],
            [
                11500,
                11511
            ],
            [
                11512,
                11538
            ],
            [
                11539,
                11542
            ],
            [
                11543,
                11552
            ],
            [
                11556,
                11561
            ],
            [
                11561,
                11563
            ],
            [
                11563,
                11604
            ],
            [
                11604,
                11608
            ],
            [
                11617,
                11688
            ],
            [
                11688,
                11700
            ],
            [
                11709,
                11725
            ],
            [
                11726,
                11739
            ],
            [
                11748,
                11773
            ],
            [
                11773,
                11800
            ],
            [
                11800,
                11831
            ],
            [
                11831,
                11862
            ],
            [
                11862,
                11893
            ],
            [
                11896,
                11911
            ],
            [
                11914,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                11986
            ],
            [
                11989,
                11993
            ],
            [
                12008,
                12015
            ],
            [
                12015,
                12074
            ],
            [
                12074,
                12083
            ],
            [
                12083,
                12106
            ],
            [
                12106,
                12112
            ],
            [
                12112,
                12118
            ],
            [
                12118,
                12143
            ],
            [
                12143,
                12156
            ],
            [
                12157,
                12173
            ],
            [
                12173,
                12175
            ],
            [
                12175,
                12196
            ],
            [
                12197,
                12206
            ],
            [
                12214,
                12241
            ],
            [
                12241,
                12242
            ],
            [
                12242,
                12270
            ],
            [
                12271,
                12286
            ],
            [
                12286,
                12312
            ],
            [
                12312,
                12314
            ],
            [
                12314,
                12330
            ],
            [
                12331,
                12393
            ],
            [
                12393,
                12417
            ],
            [
                12421,
                12423
            ],
            [
                12427,
                12431
            ],
            [
                12431,
                12450
            ],
            [
                12450,
                12460
            ],
            [
                12461,
                12503
            ],
            [
                12503,
                12527
            ],
            [
                12528,
                12538
            ],
            [
                12539,
                12542
            ],
            [
                12552,
                12568
            ],
            [
                12568,
                12569
            ],
            [
                12570,
                12599
            ],
            [
                12600,
                12613
            ],
            [
                12613,
                12614
            ],
            [
                12615,
                12661
            ],
            [
                12662,
                12704
            ],
            [
                12705,
                12735
            ],
            [
                12736,
                12762
            ],
            [
                12763,
                12777
            ],
            [
                12777,
                12818
            ],
            [
                12819,
                12820
            ],
            [
                12820,
                12851
            ],
            [
                12856,
                12860
            ],
            [
                12860,
                12862
            ],
            [
                12862,
                12895
            ],
            [
                12895,
                12903
            ],
            [
                12903,
                12920
            ],
            [
                12920,
                12963
            ],
            [
                12963,
                13003
            ],
            [
                13004,
                13052
            ],
            [
                13052,
                13216
            ],
            [
                13216,
                13267
            ],
            [
                13269,
                13291
            ],
            [
                13292,
                13299
            ],
            [
                13309,
                13326
            ],
            [
                13326,
                13376
            ],
            [
                13376,
                13425
            ],
            [
                13427,
                13430
            ],
            [
                13431,
                13467
            ],
            [
                13472,
                13474
            ],
            [
                13484,
                13507
            ],
            [
                13507,
                13526
            ],
            [
                13526,
                13542
            ],
            [
                13542,
                13581
            ],
            [
                13581,
                13586
            ],
            [
                13592,
                13612
            ],
            [
                13612,
                13613
            ],
            [
                13614,
                13626
            ],
            [
                13627,
                13629
            ],
            [
                13630,
                13633
            ],
            [
                13641,
                13642
            ],
            [
                13643,
                13689
            ],
            [
                13689,
                13692
            ],
            [
                13701,
                13704
            ],
            [
                13709,
                13713
            ],
            [
                13719,
                13727
            ],
            [
                13733,
                13760
            ],
            [
                13760,
                13762
            ],
            [
                13762,
                13800
            ],
            [
                13800,
                13899
            ],
            [
                13899,
                13919
            ],
            [
                13920,
                13933
            ],
            [
                13933,
                13942
            ],
            [
                13943,
                13963
            ],
            [
                13964,
                13968
            ],
            [
                13977,
                14009
            ],
            [
                14009,
                14032
            ],
            [
                14032,
                14050
            ],
            [
                14050,
                14052
            ],
            [
                14052,
                14053
            ],
            [
                14053,
                14070
            ],
            [
                14073,
                14091
            ],
            [
                14093,
                14125
            ],
            [
                14126,
                14143
            ]
        ],
        "row_chars": [
            [
                0,
                180
            ],
            [
                180,
                288
            ],
            [
                288,
                364
            ],
            [
                364,
                364
            ],
            [
                364,
                435
            ],
            [
                435,
                631
            ],
            [
                631,
                716
            ],
            [
                716,
                775
            ],
            [
                775,
                821
            ],
            [
                821,
                834
            ],
            [
                834,
                870
            ],
            [
                870,
                888
            ],
            [
                888,
                992
            ],
            [
                992,
                1047
            ],
            [
                1047,
                1065
            ],
            [
                1065,
                1119
            ],
            [
                1119,
                1188
            ],
            [
                1188,
                1238
            ],
            [
                1238,
                1256
            ],
            [
                1256,
                1256
            ],
            [
                1256,
                1305
            ],
            [
                1305,
                1372
            ],
            [
                1372,
                1412
            ],
            [
                1412,
                1465
            ],
            [
                1465,
                1530
            ],
            [
                1530,
                1693
            ],
            [
                1693,
                1776
            ],
            [
                1776,
                1826
            ],
            [
                1826,
                1878
            ],
            [
                1878,
                1930
            ],
            [
                1930,
                1961
            ],
            [
                1961,
                1961
            ],
            [
                1961,
                1961
            ],
            [
                1961,
                1998
            ],
            [
                1998,
                2018
            ],
            [
                2018,
                2083
            ],
            [
                2083,
                2115
            ],
            [
                2115,
                2147
            ],
            [
                2147,
                2222
            ],
            [
                2222,
                2275
            ],
            [
                2275,
                2287
            ],
            [
                2287,
                2360
            ],
            [
                2360,
                2360
            ],
            [
                2360,
                2384
            ],
            [
                2384,
                2398
            ],
            [
                2398,
                2398
            ],
            [
                2398,
                2422
            ],
            [
                2422,
                2422
            ],
            [
                2422,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2469
            ],
            [
                2469,
                2542
            ],
            [
                2542,
                2578
            ],
            [
                2578,
                2600
            ],
            [
                2600,
                2635
            ],
            [
                2635,
                2678
            ],
            [
                2678,
                2788
            ],
            [
                2788,
                2788
            ],
            [
                2788,
                2889
            ],
            [
                2889,
                2889
            ],
            [
                2889,
                2984
            ],
            [
                2984,
                2984
            ],
            [
                2984,
                3161
            ],
            [
                3161,
                3375
            ],
            [
                3375,
                3632
            ],
            [
                3632,
                3737
            ],
            [
                3737,
                3793
            ],
            [
                3793,
                3864
            ],
            [
                3864,
                3913
            ],
            [
                3913,
                3972
            ],
            [
                3972,
                4022
            ],
            [
                4022,
                4033
            ],
            [
                4033,
                4106
            ],
            [
                4106,
                4183
            ],
            [
                4183,
                4221
            ],
            [
                4221,
                4297
            ],
            [
                4297,
                4297
            ],
            [
                4297,
                4405
            ],
            [
                4405,
                4442
            ],
            [
                4442,
                4442
            ],
            [
                4442,
                4504
            ],
            [
                4504,
                4603
            ],
            [
                4603,
                4734
            ],
            [
                4734,
                4734
            ],
            [
                4734,
                4734
            ],
            [
                4734,
                4872
            ],
            [
                4872,
                5054
            ],
            [
                5054,
                5054
            ],
            [
                5054,
                5141
            ],
            [
                5141,
                5141
            ],
            [
                5141,
                5317
            ],
            [
                5317,
                5317
            ],
            [
                5317,
                5317
            ],
            [
                5317,
                5317
            ],
            [
                5317,
                5369
            ],
            [
                5369,
                5395
            ],
            [
                5395,
                5395
            ],
            [
                5395,
                5409
            ],
            [
                5409,
                5440
            ],
            [
                5440,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5486
            ],
            [
                5486,
                5518
            ],
            [
                5518,
                5626
            ],
            [
                5626,
                5675
            ],
            [
                5675,
                5675
            ],
            [
                5675,
                5767
            ],
            [
                5767,
                5804
            ],
            [
                5804,
                5836
            ],
            [
                5836,
                5908
            ],
            [
                5908,
                5932
            ],
            [
                5932,
                6026
            ],
            [
                6026,
                6026
            ],
            [
                6026,
                6026
            ],
            [
                6026,
                6026
            ],
            [
                6026,
                6036
            ],
            [
                6036,
                6105
            ],
            [
                6105,
                6178
            ],
            [
                6178,
                6226
            ],
            [
                6226,
                6226
            ],
            [
                6226,
                6289
            ],
            [
                6289,
                6289
            ],
            [
                6289,
                6419
            ],
            [
                6419,
                6472
            ],
            [
                6472,
                6514
            ],
            [
                6514,
                6608
            ],
            [
                6608,
                6693
            ],
            [
                6693,
                6793
            ],
            [
                6793,
                6894
            ],
            [
                6894,
                6961
            ],
            [
                6961,
                6961
            ],
            [
                6961,
                6961
            ],
            [
                6961,
                7114
            ],
            [
                7114,
                7143
            ],
            [
                7143,
                7153
            ],
            [
                7153,
                7325
            ],
            [
                7325,
                7325
            ],
            [
                7325,
                7325
            ],
            [
                7325,
                7386
            ],
            [
                7386,
                7450
            ],
            [
                7450,
                7560
            ],
            [
                7560,
                7710
            ],
            [
                7710,
                7757
            ],
            [
                7757,
                7915
            ],
            [
                7915,
                8025
            ],
            [
                8025,
                8114
            ],
            [
                8114,
                8164
            ],
            [
                8164,
                8192
            ],
            [
                8192,
                8281
            ],
            [
                8281,
                8320
            ],
            [
                8320,
                8380
            ],
            [
                8380,
                8380
            ],
            [
                8380,
                8380
            ],
            [
                8380,
                8380
            ],
            [
                8380,
                8442
            ],
            [
                8442,
                8481
            ],
            [
                8481,
                8532
            ],
            [
                8532,
                8604
            ],
            [
                8604,
                8707
            ],
            [
                8707,
                8740
            ],
            [
                8740,
                8892
            ],
            [
                8892,
                8892
            ],
            [
                8892,
                8953
            ],
            [
                8953,
                9017
            ],
            [
                9017,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9149
            ],
            [
                9149,
                9183
            ],
            [
                9183,
                9257
            ],
            [
                9257,
                9257
            ],
            [
                9257,
                9257
            ],
            [
                9257,
                9257
            ],
            [
                9257,
                9257
            ],
            [
                9257,
                9333
            ],
            [
                9333,
                9400
            ],
            [
                9400,
                9455
            ],
            [
                9455,
                9477
            ],
            [
                9477,
                9500
            ],
            [
                9500,
                9585
            ],
            [
                9585,
                9585
            ],
            [
                9585,
                9667
            ],
            [
                9667,
                9701
            ],
            [
                9701,
                9736
            ],
            [
                9736,
                9747
            ],
            [
                9747,
                9747
            ],
            [
                9747,
                9773
            ],
            [
                9773,
                9840
            ],
            [
                9840,
                9840
            ],
            [
                9840,
                9880
            ],
            [
                9880,
                9899
            ],
            [
                9899,
                9977
            ],
            [
                9977,
                10027
            ],
            [
                10027,
                10042
            ],
            [
                10042,
                10052
            ],
            [
                10052,
                10052
            ],
            [
                10052,
                10121
            ],
            [
                10121,
                10155
            ],
            [
                10155,
                10202
            ],
            [
                10202,
                10229
            ],
            [
                10229,
                10254
            ],
            [
                10254,
                10353
            ],
            [
                10353,
                10428
            ],
            [
                10428,
                10445
            ],
            [
                10445,
                10455
            ],
            [
                10455,
                10455
            ],
            [
                10455,
                10455
            ],
            [
                10455,
                10491
            ],
            [
                10491,
                10503
            ],
            [
                10503,
                10503
            ],
            [
                10503,
                10503
            ],
            [
                10503,
                10503
            ],
            [
                10503,
                10503
            ],
            [
                10503,
                10503
            ],
            [
                10503,
                10503
            ],
            [
                10503,
                10544
            ],
            [
                10544,
                10555
            ],
            [
                10555,
                10611
            ],
            [
                10611,
                10622
            ],
            [
                10622,
                10694
            ],
            [
                10694,
                10694
            ],
            [
                10694,
                10694
            ],
            [
                10694,
                10694
            ],
            [
                10694,
                10753
            ],
            [
                10753,
                10784
            ],
            [
                10784,
                10877
            ],
            [
                10877,
                10937
            ],
            [
                10937,
                10982
            ],
            [
                10982,
                10991
            ],
            [
                10991,
                11024
            ],
            [
                11024,
                11089
            ],
            [
                11089,
                11113
            ],
            [
                11113,
                11187
            ],
            [
                11187,
                11293
            ],
            [
                11293,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11483
            ],
            [
                11483,
                11563
            ],
            [
                11563,
                11604
            ],
            [
                11604,
                11688
            ],
            [
                11688,
                11773
            ],
            [
                11773,
                11800
            ],
            [
                11800,
                11831
            ],
            [
                11831,
                11862
            ],
            [
                11862,
                11896
            ],
            [
                11896,
                11896
            ],
            [
                11896,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                11989
            ],
            [
                11989,
                11989
            ],
            [
                11989,
                12015
            ],
            [
                12015,
                12074
            ],
            [
                12074,
                12083
            ],
            [
                12083,
                12106
            ],
            [
                12106,
                12112
            ],
            [
                12112,
                12118
            ],
            [
                12118,
                12143
            ],
            [
                12143,
                12175
            ],
            [
                12175,
                12241
            ],
            [
                12241,
                12270
            ],
            [
                12270,
                12270
            ],
            [
                12270,
                12286
            ],
            [
                12286,
                12314
            ],
            [
                12314,
                12393
            ],
            [
                12393,
                12450
            ],
            [
                12450,
                12528
            ],
            [
                12528,
                12528
            ],
            [
                12528,
                12528
            ],
            [
                12528,
                12705
            ],
            [
                12705,
                12819
            ],
            [
                12819,
                12819
            ],
            [
                12819,
                12862
            ],
            [
                12862,
                12895
            ],
            [
                12895,
                12903
            ],
            [
                12903,
                12920
            ],
            [
                12920,
                12963
            ],
            [
                12963,
                13003
            ],
            [
                13003,
                13003
            ],
            [
                13003,
                13052
            ],
            [
                13052,
                13216
            ],
            [
                13216,
                13269
            ],
            [
                13269,
                13269
            ],
            [
                13269,
                13326
            ],
            [
                13326,
                13376
            ],
            [
                13376,
                13507
            ],
            [
                13507,
                13542
            ],
            [
                13542,
                13581
            ],
            [
                13581,
                13643
            ],
            [
                13643,
                13692
            ],
            [
                13692,
                13714
            ],
            [
                13714,
                13714
            ],
            [
                13714,
                13714
            ],
            [
                13714,
                13762
            ],
            [
                13762,
                13800
            ],
            [
                13800,
                13899
            ],
            [
                13899,
                13933
            ],
            [
                13933,
                14009
            ],
            [
                14009,
                14032
            ],
            [
                14032,
                14052
            ],
            [
                14052,
                14143
            ]
        ]
    }
}