{
    "original": {
        "text": "The next day there was great surprise at Sheep's Acre farm, which communicated itself to the towns of Bungay and Beccles, and even affected the ordinary quiet life of Carbury Manor. Ruby Ruggles had gone away, and at about twelve o'clock in the day the old farmer became aware of the fact. She had started early, at about seven in the morning; but Ruggles himself had been out long before that, and had not condescended to ask for her when he returned to the house for his breakfast. There had been a bad scene up in the bedroom overnight, after John Crumb had left the farm. The old man in his anger had tried to expel the girl; but she had hung on to the bed-post and would not go; and he had been frightened, when the maid came up crying and screaming murder. \"You'll be out o' this to-morrow as sure as my name's Dannel Ruggles,\" said the farmer panting for breath. But for the gin which he had taken he would hardly have struck her;--but he had struck her, and pulled her by the hair, and knocked her about;--and in the morning she took him at his word and was away. About twelve he heard from the servant girl that she had gone. She had packed a box and had started up the road carrying the box herself. \"Grandfather says I'm to go, and I'm gone,\" she had said to the girl. At the first cottage she had got a boy to carry her box into Beccles, and to Beccles she had walked. For an hour or two Ruggles sat, quiet, within the house, telling himself that she might do as she pleased with herself,--that he was well rid of her, and that from henceforth he would trouble himself no more about her. But by degrees there came upon him a feeling half of compassion and half of fear, with perhaps some mixture of love, instigating him to make search for her. She had been the same to him as a child, and what would people say of him if he allowed her to depart from him after this fashion? Then he remembered his violence the night before, and the fact that the servant girl had heard if she had not seen it. He could not drop his responsibility in regard to Ruby, even if he would. So, as a first step, he sent in a message to John Crumb, at Bungay, to tell him that Ruby Ruggles had gone off with a box to Beccles. John Crumb went open-mouthed with the news to Joe Mixet, and all Bungay soon knew that Ruby Ruggles had run away.\nAfter sending his message to Crumb the old man still sat thinking, and at last made up his mind that he would go to his landlord. He held a part of his farm under Roger Carbury, and Roger Carbury would tell him what he ought to do. A great trouble had come upon him. He would fain have been quiet, but his conscience and his heart and his terrors all were at work together,--and he found that he could not eat his dinner. So he had out his cart and horse and drove himself off to Carbury Hall.\nIt was past four when he started, and he found the squire seated on the terrace after an early dinner, and with him was Father Barham, the priest. The old man was shown at once round into the garden, and was not long in telling his story. There had been words between him and his granddaughter about her lover. Her lover had been accepted and had come to the farm to claim his bride. Ruby had behaved very badly. The old man made the most of Ruby's bad behaviour, and of course as little as possible of his own violence. But he did explain that there had been threats used when Ruby refused to take the man, and that Ruby had, this day, taken herself off.\n\"I always thought it was settled they were to be man and wife,\" said Roger.\n\"It was settled, squoire;--and he war to have five hun'erd pound down;--money as I'd saved myself. Drat the jade.\"\n\"Didn't she like him, Daniel?\"\n\"She liked him well enough till she'd seed somebody else.\" Then old Daniel paused, and shook his head, and was evidently the owner of a secret. The squire got up and walked round the garden with him,--and then the secret was told. The farmer was of opinion that there was something between the girl and Sir Felix. Sir Felix some weeks since had been seen near the farm and on the same occasion Ruby had been observed at some little distance from the house with her best clothes on.\n\"He's been so little here, Daniel,\" said the squire.\n\"It goes as tinder and a spark o' fire, that does,\" said the farmer. \"Girls like Ruby don't want no time to be wooed by one such as that, though they'll fall-lall with a man like John Crumb for years.\"\n\"I suppose she's gone to London.\"\n\"Don't know nothing of where she's gone, squoire;--only she have gone some'eres. May be it's Lowestoffe. There's lots of quality at Lowestoffe a' washing theyselves in the sea.\"\nThen they returned to the priest, who might be supposed to be cognisant of the guiles of the world and competent to give advice on such an occasion as this. \"If she was one of our people,\" said Father Barham, \"we should have her back quick enough.\"\n\"Would ye now?\" said Ruggles, wishing at the moment that he and all his family had been brought up as Roman Catholics.\n\"I don't see how you would have more chance of catching her than we have,\" said Carbury.\n\"She'd catch herself. Wherever she might be she'd go to the priest, and he wouldn't leave her till he'd seen her put on the way back to her friends.\"\n\"With a flea in her lug,\" suggested the farmer.\n\"Your people never go to a clergyman in their distress. It's the last thing they'd think of. Any one might more probably be regarded as a friend than the parson. But with us the poor know where to look for sympathy.\"\n\"She ain't that poor, neither,\" said the grandfather.\n\"She had money with her?\"\n\"I don't know just what she had; but she ain't been brought up poor. And I don't think as our Ruby'd go of herself to any clergyman. It never was her way.\"\n\"It never is the way with a Protestant,\" said the priest.\n\"We'll say no more about that for the present,\" said Roger, who was waxing wroth with the priest. That a man should be fond of his own religion is right; but Roger Carbury was beginning to think that Father Barham was too fond of his religion. \"What had we better do? I suppose we shall hear something of her at the railway. There are not so many people leaving Beccles but that she may be remembered.\" So the waggonette was ordered, and they all prepared to go off to the station together.\nBut before they started John Crumb rode up to the door. He had gone at once to the farm on hearing of Ruby's departure, and had followed the farmer from thence to Carbury. Now he found the squire and the priest and the old man standing around as the horses were being put to the carriage. \"Ye ain't a' found her, Mr. Ruggles, ha' ye?\" he asked as he wiped the sweat from his brow.\n\"Noa;--we ain't a' found no one yet.\"\n\"If it was as she was to come to harm, Mr. Carbury, I'd never forgive myself,--never,\" said Crumb.\n\"As far as I can understand it is no doing of yours, my friend,\" said the squire.\n\"In one way, it ain't; and in one way it is. I was over there last night a bothering of her. She'd a' come round may be, if she'd a' been left alone. She wouldn't a' been off now, only for our going over to Sheep's Acre. But,--oh!\"\n\"What is it, Mr. Crumb?\"\n\"He's a coosin o' yours, squoire; and long as I've known Suffolk, I've never known nothing but good o' you and yourn. But if your baronite has been and done this! Oh, Mr. Carbury! If I was to wring his neck round, you wouldn't say as how I was wrong; would ye, now?\" Roger could hardly answer the question. On general grounds the wringing of Sir Felix's neck, let the immediate cause for such a performance have been what it might, would have seemed to him to be a good deed. The world would be better, according to his thinking, with Sir Felix out of it than in it. But still the young man was his cousin and a Carbury, and to such a one as John Crumb he was bound to defend any member of his family as far as he might be defensible. \"They says as how he was groping about Sheep's Acre when he was last here, a hiding himself and skulking behind hedges. Drat 'em all. They've gals enough of their own,--them fellows. Why can't they let a fellow alone? I'll do him a mischief, Master Roger; I wull;--if he's had a hand in this.\" Poor John Crumb! When he had his mistress to win he could find no words for himself; but was obliged to take an eloquent baker with him to talk for him. Now in his anger he could talk freely enough.\n\"But you must first learn that Sir Felix has had anything to do with this, Mr. Crumb.\"\n\"In coorse; in coorse. That's right. That's right. Must l'arn as he did it, afore I does it. But when I have l'arned!\"-- And John Crumb clenched his fist as though a very short lesson would suffice for him upon this occasion.\nThey all went to the Beccles Station, and from thence to the Beccles post office,--so that Beccles soon knew as much about it as Bungay. At the railway station Ruby was distinctly remembered. She had taken a second-class ticket by the morning train for London, and had gone off without any appearance of secrecy. She had been decently dressed, with a hat and cloak, and her luggage had been such as she might have been expected to carry, had all her friends known that she was going. So much was made clear at the railway station, but nothing more could be learned there. Then a message was sent by telegraph to the station in London, and they all waited, loitering about the post office, for a reply. One of the porters in London remembered seeing such a girl as was described, but the man who was supposed to have carried her box for her to a cab had gone away for the day. It was believed that she had left the station in a four-wheel cab. \"I'll be arter her. I'll be arter her at once,\" said John Crumb. But there was no train till night, and Roger Carbury was doubtful whether his going would do any good. It was evidently fixed on Crumb's mind that the first step towards finding Ruby would be the breaking of every bone in the body of Sir Felix Carbury. Now it was not at all apparent to the squire that his cousin had had anything to do with this affair. It had been made quite clear to him that the old man had quarrelled with his granddaughter and had threatened to turn her out of his house, not because she had misbehaved with Sir Felix, but on account of her refusing to marry John Crumb. John Crumb had gone over to the farm expecting to arrange it all, and up to that time there had been no fear about Felix Carbury. Nor was it possible that there should have been communication between Ruby and Felix since the quarrel at the farm. Even if the old man were right in supposing that Ruby and the baronet had been acquainted,--and such acquaintance could not but be prejudicial to the girl,--not on that account would the baronet be responsible for her abduction. John Crumb was thirsting for blood and was not very capable in his present mood of arguing the matter out coolly, and Roger, little as he loved his cousin, was not desirous that all Suffolk should know that Sir Felix Carbury had been thrashed within an inch of his life by John Crumb of Bungay. \"I'll tell you what I'll do,\" said he, putting his hand kindly on the old man's shoulder. \"I'll go up myself by the first train to-morrow. I can trace her better than Mr. Crumb can do, and you will both trust me.\"\n\"There's not one in the two counties I'd trust so soon,\" said the old man.\n\"But you'll let us know the very truth,\" said John Crumb. Roger Carbury made him an indiscreet promise that he would let him know the truth. So the matter was settled, and the grandfather and lover returned together to Bungay.",
        "paragraph_chars": [
            [
                0,
                2329
            ],
            [
                2329,
                2823
            ],
            [
                2823,
                3479
            ],
            [
                3479,
                3555
            ],
            [
                3555,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                4183
            ],
            [
                4183,
                4236
            ],
            [
                4236,
                4438
            ],
            [
                4438,
                4472
            ],
            [
                4472,
                4650
            ],
            [
                4650,
                4899
            ],
            [
                4899,
                5018
            ],
            [
                5018,
                5107
            ],
            [
                5107,
                5257
            ],
            [
                5257,
                5305
            ],
            [
                5305,
                5522
            ],
            [
                5522,
                5576
            ],
            [
                5576,
                5602
            ],
            [
                5602,
                5758
            ],
            [
                5758,
                5816
            ],
            [
                5816,
                6307
            ],
            [
                6307,
                6688
            ],
            [
                6688,
                6726
            ],
            [
                6726,
                6825
            ],
            [
                6825,
                6907
            ],
            [
                6907,
                7139
            ],
            [
                7139,
                7164
            ],
            [
                7164,
                8392
            ],
            [
                8392,
                8479
            ],
            [
                8479,
                8705
            ],
            [
                8705,
                11291
            ],
            [
                11291,
                11366
            ],
            [
                11366,
                11592
            ]
        ],
        "segment_chars": [
            [
                0,
                182
            ],
            [
                182,
                290
            ],
            [
                290,
                484
            ],
            [
                484,
                576
            ],
            [
                576,
                763
            ],
            [
                763,
                870
            ],
            [
                870,
                1072
            ],
            [
                1072,
                1135
            ],
            [
                1135,
                1210
            ],
            [
                1210,
                1280
            ],
            [
                1280,
                1381
            ],
            [
                1381,
                1600
            ],
            [
                1600,
                1757
            ],
            [
                1757,
                1888
            ],
            [
                1888,
                2007
            ],
            [
                2007,
                2081
            ],
            [
                2081,
                2215
            ],
            [
                2215,
                2329
            ],
            [
                2329,
                2459
            ],
            [
                2459,
                2561
            ],
            [
                2561,
                2596
            ],
            [
                2596,
                2751
            ],
            [
                2751,
                2823
            ],
            [
                2823,
                2970
            ],
            [
                2970,
                3062
            ],
            [
                3062,
                3134
            ],
            [
                3134,
                3207
            ],
            [
                3207,
                3236
            ],
            [
                3236,
                3344
            ],
            [
                3344,
                3479
            ],
            [
                3479,
                3555
            ],
            [
                3555,
                3654
            ],
            [
                3654,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3760
            ],
            [
                3760,
                3845
            ],
            [
                3845,
                3932
            ],
            [
                3932,
                4015
            ],
            [
                4015,
                4183
            ],
            [
                4183,
                4236
            ],
            [
                4236,
                4305
            ],
            [
                4305,
                4438
            ],
            [
                4438,
                4472
            ],
            [
                4472,
                4553
            ],
            [
                4553,
                4577
            ],
            [
                4577,
                4650
            ],
            [
                4650,
                4807
            ],
            [
                4807,
                4899
            ],
            [
                4899,
                4915
            ],
            [
                4915,
                5018
            ],
            [
                5018,
                5107
            ],
            [
                5107,
                5129
            ],
            [
                5129,
                5257
            ],
            [
                5257,
                5305
            ],
            [
                5305,
                5361
            ],
            [
                5361,
                5398
            ],
            [
                5398,
                5467
            ],
            [
                5467,
                5522
            ],
            [
                5522,
                5576
            ],
            [
                5576,
                5602
            ],
            [
                5602,
                5671
            ],
            [
                5671,
                5735
            ],
            [
                5735,
                5758
            ],
            [
                5758,
                5816
            ],
            [
                5816,
                5914
            ],
            [
                5914,
                6060
            ],
            [
                6060,
                6084
            ],
            [
                6084,
                6141
            ],
            [
                6141,
                6219
            ],
            [
                6219,
                6307
            ],
            [
                6307,
                6363
            ],
            [
                6363,
                6479
            ],
            [
                6479,
                6596
            ],
            [
                6596,
                6642
            ],
            [
                6642,
                6688
            ],
            [
                6688,
                6726
            ],
            [
                6726,
                6825
            ],
            [
                6825,
                6907
            ],
            [
                6907,
                6952
            ],
            [
                6952,
                7000
            ],
            [
                7000,
                7057
            ],
            [
                7057,
                7128
            ],
            [
                7128,
                7139
            ],
            [
                7139,
                7164
            ],
            [
                7164,
                7282
            ],
            [
                7282,
                7327
            ],
            [
                7327,
                7344
            ],
            [
                7344,
                7431
            ],
            [
                7431,
                7471
            ],
            [
                7471,
                7640
            ],
            [
                7640,
                7731
            ],
            [
                7731,
                7899
            ],
            [
                7899,
                8019
            ],
            [
                8019,
                8033
            ],
            [
                8033,
                8082
            ],
            [
                8082,
                8117
            ],
            [
                8117,
                8193
            ],
            [
                8193,
                8210
            ],
            [
                8210,
                8346
            ],
            [
                8346,
                8392
            ],
            [
                8392,
                8479
            ],
            [
                8479,
                8502
            ],
            [
                8502,
                8516
            ],
            [
                8516,
                8530
            ],
            [
                8530,
                8572
            ],
            [
                8572,
                8597
            ],
            [
                8597,
                8705
            ],
            [
                8705,
                8842
            ],
            [
                8842,
                8897
            ],
            [
                8897,
                9018
            ],
            [
                9018,
                9189
            ],
            [
                9189,
                9277
            ],
            [
                9277,
                9407
            ],
            [
                9407,
                9581
            ],
            [
                9581,
                9648
            ],
            [
                9648,
                9668
            ],
            [
                9668,
                9713
            ],
            [
                9713,
                9816
            ],
            [
                9816,
                9966
            ],
            [
                9966,
                10068
            ],
            [
                10068,
                10307
            ],
            [
                10307,
                10437
            ],
            [
                10437,
                10553
            ],
            [
                10553,
                10782
            ],
            [
                10782,
                11077
            ],
            [
                11077,
                11167
            ],
            [
                11167,
                11216
            ],
            [
                11216,
                11291
            ],
            [
                11291,
                11366
            ],
            [
                11366,
                11424
            ],
            [
                11424,
                11507
            ],
            [
                11507,
                11592
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                180,
                182
            ],
            [
                182,
                208
            ],
            [
                288,
                289
            ],
            [
                249,
                263
            ],
            [
                277,
                279
            ],
            [
                241,
                244
            ],
            [
                214,
                222
            ],
            [
                294,
                297
            ],
            [
                313,
                315
            ],
            [
                322,
                355
            ],
            [
                399,
                406
            ],
            [
                427,
                442
            ],
            [
                364,
                367
            ],
            [
                469,
                484
            ],
            [
                484,
                576
            ],
            [
                576,
                687
            ],
            [
                717,
                762
            ],
            [
                763,
                777
            ],
            [
                796,
                849
            ],
            [
                850,
                870
            ],
            [
                892,
                898
            ],
            [
                882,
                885
            ],
            [
                1058,
                1061
            ],
            [
                905,
                907
            ],
            [
                950,
                1011
            ],
            [
                1014,
                1057
            ],
            [
                1143,
                1159
            ],
            [
                1208,
                1210
            ],
            [
                1280,
                1300
            ],
            [
                1301,
                1353
            ],
            [
                1365,
                1380
            ],
            [
                1381,
                1411
            ],
            [
                1436,
                1453
            ],
            [
                1502,
                1539
            ],
            [
                1556,
                1600
            ],
            [
                1600,
                1680
            ],
            [
                1755,
                1757
            ],
            [
                1757,
                1769
            ],
            [
                1789,
                1796
            ],
            [
                1779,
                1785
            ],
            [
                1796,
                1823
            ],
            [
                1831,
                1858
            ],
            [
                1874,
                1878
            ],
            [
                1886,
                1888
            ],
            [
                1888,
                1937
            ],
            [
                1956,
                1982
            ],
            [
                2005,
                2007
            ],
            [
                2007,
                2043
            ],
            [
                2057,
                2061
            ],
            [
                2079,
                2081
            ],
            [
                2081,
                2083
            ],
            [
                2102,
                2109
            ],
            [
                2113,
                2136
            ],
            [
                2147,
                2215
            ],
            [
                2215,
                2329
            ],
            [
                2329,
                2354
            ],
            [
                2364,
                2375
            ],
            [
                2382,
                2424
            ],
            [
                2355,
                2357
            ],
            [
                2439,
                2459
            ],
            [
                2511,
                2561
            ],
            [
                2631,
                2675
            ],
            [
                2680,
                2684
            ],
            [
                2676,
                2679
            ],
            [
                2685,
                2702
            ],
            [
                2704,
                2707
            ],
            [
                2722,
                2751
            ],
            [
                2751,
                2756
            ],
            [
                2788,
                2823
            ],
            [
                2861,
                2902
            ],
            [
                2930,
                2934
            ],
            [
                2943,
                2970
            ],
            [
                2970,
                2981
            ],
            [
                3027,
                3062
            ],
            [
                3248,
                3344
            ],
            [
                3344,
                3395
            ],
            [
                3429,
                3448
            ],
            [
                3460,
                3479
            ],
            [
                3479,
                3481
            ],
            [
                3489,
                3524
            ],
            [
                3540,
                3554
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3760
            ],
            [
                3765,
                3802
            ],
            [
                3843,
                3845
            ],
            [
                3896,
                3899
            ],
            [
                3863,
                3866
            ],
            [
                3911,
                3932
            ],
            [
                3932,
                3942
            ],
            [
                3963,
                4013
            ],
            [
                4042,
                4069
            ],
            [
                4070,
                4117
            ],
            [
                4142,
                4183
            ],
            [
                4183,
                4236
            ],
            [
                4305,
                4372
            ],
            [
                4285,
                4304
            ],
            [
                4438,
                4472
            ],
            [
                4472,
                4483
            ],
            [
                4511,
                4521
            ],
            [
                4560,
                4575
            ],
            [
                4655,
                4682
            ],
            [
                4805,
                4807
            ],
            [
                4807,
                4899
            ],
            [
                5018,
                5107
            ],
            [
                5107,
                5129
            ],
            [
                5129,
                5219
            ],
            [
                5235,
                5239
            ],
            [
                5243,
                5257
            ],
            [
                5257,
                5276
            ],
            [
                5280,
                5305
            ],
            [
                5305,
                5361
            ],
            [
                5361,
                5398
            ],
            [
                5467,
                5522
            ],
            [
                5522,
                5575
            ],
            [
                5671,
                5705
            ],
            [
                5717,
                5735
            ],
            [
                5735,
                5758
            ],
            [
                5758,
                5816
            ],
            [
                5816,
                5845
            ],
            [
                5861,
                5883
            ],
            [
                5912,
                5914
            ],
            [
                6084,
                6139
            ],
            [
                6139,
                6141
            ],
            [
                6151,
                6154
            ],
            [
                6158,
                6169
            ],
            [
                6178,
                6185
            ],
            [
                6155,
                6157
            ],
            [
                6195,
                6219
            ],
            [
                6241,
                6248
            ],
            [
                6222,
                6225
            ],
            [
                6219,
                6221
            ],
            [
                6254,
                6258
            ],
            [
                6275,
                6277
            ],
            [
                6282,
                6307
            ],
            [
                6307,
                6349
            ],
            [
                6361,
                6363
            ],
            [
                6596,
                6631
            ],
            [
                6639,
                6642
            ],
            [
                6642,
                6650
            ],
            [
                6663,
                6688
            ],
            [
                6688,
                6689
            ],
            [
                6720,
                6726
            ],
            [
                6726,
                6729
            ],
            [
                6740,
                6802
            ],
            [
                6810,
                6825
            ],
            [
                6825,
                6907
            ],
            [
                6907,
                6908
            ],
            [
                6945,
                6950
            ],
            [
                6930,
                6933
            ],
            [
                6920,
                6928
            ],
            [
                6950,
                6952
            ],
            [
                6952,
                7000
            ],
            [
                7000,
                7019
            ],
            [
                7026,
                7057
            ],
            [
                7128,
                7131
            ],
            [
                7134,
                7139
            ],
            [
                7139,
                7164
            ],
            [
                7164,
                7171
            ],
            [
                7179,
                7201
            ],
            [
                7230,
                7282
            ],
            [
                7282,
                7306
            ],
            [
                7316,
                7327
            ],
            [
                7327,
                7344
            ],
            [
                7344,
                7370
            ],
            [
                7376,
                7397
            ],
            [
                7402,
                7423
            ],
            [
                7428,
                7430
            ],
            [
                7431,
                7471
            ],
            [
                7471,
                7522
            ],
            [
                7607,
                7613
            ],
            [
                7627,
                7633
            ],
            [
                7638,
                7640
            ],
            [
                7640,
                7665
            ],
            [
                7694,
                7718
            ],
            [
                7729,
                7731
            ],
            [
                7731,
                7788
            ],
            [
                7817,
                7839
            ],
            [
                7897,
                7898
            ],
            [
                7899,
                7975
            ],
            [
                7995,
                8019
            ],
            [
                8033,
                8066
            ],
            [
                8068,
                8082
            ],
            [
                8082,
                8117
            ],
            [
                8164,
                8166
            ],
            [
                8167,
                8169
            ],
            [
                8117,
                8161
            ],
            [
                8190,
                8193
            ],
            [
                8193,
                8210
            ],
            [
                8350,
                8392
            ],
            [
                8705,
                8742
            ],
            [
                8865,
                8897
            ],
            [
                8897,
                8932
            ],
            [
                8936,
                8939
            ],
            [
                8948,
                9018
            ],
            [
                9018,
                9030
            ],
            [
                9054,
                9074
            ],
            [
                9087,
                9090
            ],
            [
                9079,
                9086
            ],
            [
                9236,
                9269
            ],
            [
                9187,
                9188
            ],
            [
                9277,
                9281
            ],
            [
                9344,
                9348
            ],
            [
                9377,
                9392
            ],
            [
                9282,
                9291
            ],
            [
                9301,
                9343
            ],
            [
                9353,
                9359
            ],
            [
                9394,
                9407
            ],
            [
                9407,
                9465
            ],
            [
                9482,
                9499
            ],
            [
                9521,
                9536
            ],
            [
                9545,
                9580
            ],
            [
                9668,
                9713
            ],
            [
                9713,
                9765
            ],
            [
                9779,
                9816
            ],
            [
                9842,
                9847
            ],
            [
                9823,
                9832
            ],
            [
                9855,
                9934
            ],
            [
                9947,
                9964
            ],
            [
                9847,
                9849
            ],
            [
                9939,
                9943
            ],
            [
                9964,
                9965
            ],
            [
                9966,
                9980
            ],
            [
                9997,
                10026
            ],
            [
                10031,
                10068
            ],
            [
                10109,
                10158
            ],
            [
                10208,
                10258
            ],
            [
                10071,
                10074
            ],
            [
                10286,
                10307
            ],
            [
                10307,
                10343
            ],
            [
                10354,
                10372
            ],
            [
                10393,
                10437
            ],
            [
                10437,
                10440
            ],
            [
                10507,
                10511
            ],
            [
                10475,
                10479
            ],
            [
                10516,
                10552
            ],
            [
                10553,
                10626
            ],
            [
                10642,
                10643
            ],
            [
                10736,
                10747
            ],
            [
                10673,
                10676
            ],
            [
                10767,
                10770
            ],
            [
                10780,
                10782
            ],
            [
                10782,
                10816
            ],
            [
                10894,
                10937
            ],
            [
                10825,
                10828
            ],
            [
                10960,
                10971
            ],
            [
                10979,
                11024
            ],
            [
                11052,
                11076
            ],
            [
                11077,
                11167
            ],
            [
                11167,
                11204
            ],
            [
                11214,
                11216
            ],
            [
                11216,
                11291
            ],
            [
                11366,
                11393
            ],
            [
                11399,
                11424
            ],
            [
                11424,
                11442
            ],
            [
                11447,
                11468
            ],
            [
                11505,
                11507
            ],
            [
                11507,
                11592
            ]
        ],
        "row_chars": [
            [
                0,
                182
            ],
            [
                182,
                484
            ],
            [
                484,
                576
            ],
            [
                576,
                763
            ],
            [
                763,
                870
            ],
            [
                870,
                1210
            ],
            [
                1210,
                1280
            ],
            [
                1280,
                1381
            ],
            [
                1381,
                1600
            ],
            [
                1600,
                1757
            ],
            [
                1757,
                1888
            ],
            [
                1888,
                2007
            ],
            [
                2007,
                2081
            ],
            [
                2081,
                2215
            ],
            [
                2215,
                2329
            ],
            [
                2329,
                2459
            ],
            [
                2459,
                2561
            ],
            [
                2561,
                2596
            ],
            [
                2596,
                2751
            ],
            [
                2751,
                2823
            ],
            [
                2823,
                2970
            ],
            [
                2970,
                3062
            ],
            [
                3062,
                3134
            ],
            [
                3134,
                3207
            ],
            [
                3207,
                3236
            ],
            [
                3236,
                3344
            ],
            [
                3344,
                3479
            ],
            [
                3479,
                3555
            ],
            [
                3555,
                3654
            ],
            [
                3654,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3760
            ],
            [
                3760,
                3845
            ],
            [
                3845,
                3932
            ],
            [
                3932,
                4183
            ],
            [
                4183,
                4236
            ],
            [
                4236,
                4438
            ],
            [
                4438,
                4472
            ],
            [
                4472,
                4577
            ],
            [
                4577,
                4650
            ],
            [
                4650,
                4807
            ],
            [
                4807,
                4899
            ],
            [
                4899,
                4915
            ],
            [
                4915,
                5018
            ],
            [
                5018,
                5107
            ],
            [
                5107,
                5129
            ],
            [
                5129,
                5257
            ],
            [
                5257,
                5305
            ],
            [
                5305,
                5361
            ],
            [
                5361,
                5398
            ],
            [
                5398,
                5467
            ],
            [
                5467,
                5522
            ],
            [
                5522,
                5576
            ],
            [
                5576,
                5602
            ],
            [
                5602,
                5671
            ],
            [
                5671,
                5735
            ],
            [
                5735,
                5758
            ],
            [
                5758,
                5816
            ],
            [
                5816,
                5914
            ],
            [
                5914,
                6060
            ],
            [
                6060,
                6084
            ],
            [
                6084,
                6141
            ],
            [
                6141,
                6219
            ],
            [
                6219,
                6307
            ],
            [
                6307,
                6363
            ],
            [
                6363,
                6479
            ],
            [
                6479,
                6596
            ],
            [
                6596,
                6642
            ],
            [
                6642,
                6688
            ],
            [
                6688,
                6726
            ],
            [
                6726,
                6825
            ],
            [
                6825,
                6907
            ],
            [
                6907,
                6952
            ],
            [
                6952,
                7000
            ],
            [
                7000,
                7057
            ],
            [
                7057,
                7128
            ],
            [
                7128,
                7139
            ],
            [
                7139,
                7164
            ],
            [
                7164,
                7282
            ],
            [
                7282,
                7327
            ],
            [
                7327,
                7344
            ],
            [
                7344,
                7431
            ],
            [
                7431,
                7471
            ],
            [
                7471,
                7640
            ],
            [
                7640,
                7731
            ],
            [
                7731,
                7899
            ],
            [
                7899,
                8019
            ],
            [
                8019,
                8033
            ],
            [
                8033,
                8082
            ],
            [
                8082,
                8117
            ],
            [
                8117,
                8193
            ],
            [
                8193,
                8210
            ],
            [
                8210,
                8346
            ],
            [
                8346,
                8392
            ],
            [
                8392,
                8479
            ],
            [
                8479,
                8502
            ],
            [
                8502,
                8516
            ],
            [
                8516,
                8530
            ],
            [
                8530,
                8572
            ],
            [
                8572,
                8597
            ],
            [
                8597,
                8705
            ],
            [
                8705,
                8897
            ],
            [
                8897,
                9018
            ],
            [
                9018,
                9277
            ],
            [
                9277,
                9407
            ],
            [
                9407,
                9581
            ],
            [
                9581,
                9648
            ],
            [
                9648,
                9668
            ],
            [
                9668,
                9713
            ],
            [
                9713,
                9816
            ],
            [
                9816,
                9966
            ],
            [
                9966,
                10068
            ],
            [
                10068,
                10307
            ],
            [
                10307,
                10437
            ],
            [
                10437,
                10553
            ],
            [
                10553,
                10782
            ],
            [
                10782,
                11077
            ],
            [
                11077,
                11167
            ],
            [
                11167,
                11216
            ],
            [
                11216,
                11291
            ],
            [
                11291,
                11366
            ],
            [
                11366,
                11424
            ],
            [
                11424,
                11507
            ],
            [
                11507,
                11592
            ]
        ]
    },
    "abridged": {
        "text": "The next day there was great surprise at Sheep's Acre farm. Ruby Ruggles had gone away. The old farmer learnt of this from the servant girl at about noon. Ruby had left at seven in the morning; but Ruggles had not asked for her when he had his breakfast. There had been a bad scene up in the bedroom overnight, after John Crumb had left the farm. The old man in his anger had tried to expel the girl; but she had hung on to the bed-post and would not go; and the maid came up crying and screaming murder.\n\"You'll be out tomorrow as sure as my name's Dannel Ruggles,\" said the farmer, panting for breath. He had been drinking gin, and he struck her, and pulled her by the hair, and knocked her about: and in the morning she took him at his word, packed a box and went. At the first cottage, she had got a boy to carry her box into Beccles, and she had walked.\nFor an hour or two Ruggles sat quietly, telling himself that he was well rid of her, and that he would trouble himself no more about her. But by degrees there came upon him a feeling half of compassion and half of fear. She had been like a child to him, and what would people say if he allowed her to depart like this? Then he remembered his violence the night before, which the servant girl had heard. He could not drop his responsibility for Ruby. So he sent a message to John Crumb, to tell him that Ruby Ruggles had gone off with a box to Beccles. John Crumb went open-mouthed with the news to Joe Mixet, and all Bungay soon knew that Ruby Ruggles had run away.\nAfter sending his message the old man sat thinking, and at last made up his mind to go to his landlord. Roger Carbury would tell him what he ought to do. His conscience and his heart and his terrors were all at work together, and he could not eat his dinner. So he drove himself off to Carbury Hall.\nHe found the squire seated on the terrace with Father Barham, the priest. The old man was not long in telling his story. He made the most of Ruby's bad behaviour, and of course as little as possible of his own violence. But he did explain that there had been threats used, and that Ruby had taken herself off.\n\"I thought it was settled they were to marry,\" said Roger. \"Didn't she like him, Daniel?\"\n\"She liked him well enough till she'd seed somebody else.\" Old Daniel paused, and shook his head. Roger took him aside; and at last the secret was told. The farmer thought there was something between the girl and Sir Felix, who had been seen near the farm; and on the same occasion Ruby had been observed away from the house with her best clothes on.\n\"He's been so little here, Daniel,\" said the squire.\n\"Girls like Ruby don't want no time to be wooed by one such as that,\" said the farmer.\n\"I suppose she's gone to London.\"\n\"Don't know, squoire; maybe it's Lowestoffe.\"\nThey returned to the priest. \"If she was one of our people,\" said Father Barham, \"we should have her back quick enough.\"\n\"I don't see how you would have more chance of catching her than we have,\" said Carbury.\n\"She'd catch herself. Wherever she might be she'd go to the priest, and he wouldn't leave her till he'd seen her back with her friends.\"\n\"With a flea in her ear,\" suggested the farmer.\n\"Your people never go to a clergyman in their distress. It's the last thing they'd think of. But with us the poor know where to look for sympathy.\"\n\"She ain't that poor, neither,\" said the grandfather. \"And I don't think as our Ruby'd go to any clergyman. It never was her way.\"\n\"It never is the way with a Protestant,\" said the priest.\n\"We'll say no more about that now,\" said Roger, who was growing annoyed. \"I suppose we shall hear something of her at the railway station. Not many people leave Beccles, so she may be remembered.\" He ordered the carriage so that they could go to the station together.\nBut before they started John Crumb rode up. \"Ye ain't a' found her, Mr. Ruggles?\" he asked, wiping the sweat from his brow.\n\"Not yet.\"\n\"If she was to come to harm, Mr. Carbury, I'd never forgive myself,\" said Crumb.\n\"As far as I can understand it is no doing of yours, my friend,\" said the squire.\n\"It is and it ain't. I was over there last night a bothering of her. She'd a' come round maybe, if she'd a' been left alone. But - oh!\"\n\"What is it, Mr. Crumb?\"\n\"He's a cousin o' yours, squoire; and I've never known nothing but good o' you and yourn. But if your baronite has done this! Oh, Mr. Carbury! If I was to wring his neck, you wouldn't say as I was wrong; would ye?\"\nRoger could hardly answer the question. On general grounds the wringing of Sir Felix's neck seemed a good idea. The world would be better with Sir Felix out of it. But still the young man was his cousin and a Carbury, and he was bound to defend him.\n\"They says as how he was groping about Sheep's Acre when he was last here, a skulking behind hedges. They've gals enough of their own, them fellows. Why can't they let a fellow alone? If I learn as he did it, I'll do him a mischief, Master Roger; I wull.\" Poor John Crumb! In his anger he could talk freely enough.\nThey all went to the Beccles Station, where Ruby was distinctly remembered. She had taken a second-class ticket on the train for London, and had gone off without any appearance of secrecy. She had been wearing a hat and cloak, and had some luggage; but nothing more could be learned.\nThen they went to the post office to send a message by telegraph to the station in London, and waited for a reply. One of the porters in London remembered seeing such a girl, but the man who had carried her box to a cab had gone away for the day.\n\"I'll be arter her at once,\" said John Crumb. But there was no train till night, and Roger Carbury doubted whether his going would do any good. Crumb evidently felt that the first step towards finding Ruby would be the breaking of every bone in Sir Felix Carbury's body.\nNow it was not clear to the squire that his cousin had anything to do with this affair. The old man had quarrelled with his granddaughter not because she had misbehaved with Sir Felix, but because she had refused to marry John Crumb. When John Crumb had gone over to the farm to arrange it all, there had been no fear about Felix Carbury. Nor could Ruby have communicated with Felix since the quarrel at the farm.\nEven if the old man were right in supposing that Ruby and the baronet had met, the baronet had not abducted her. John Crumb was thirsting for blood, and Roger, little as he loved his cousin, did not wish all Suffolk to know that Sir Felix Carbury had been thrashed by John Crumb of Bungay.\n\"I'll tell you what I'll do,\" said he, putting his hand kindly on the old man's shoulder. \"I'll go up myself by the first train tomorrow. I can trace her better than Mr. Crumb can do, and you will both trust me.\"\n\"But you'll let us know the truth,\" said John Crumb. Roger Carbury made an indiscreet promise of this. So the matter was settled, and the grandfather and lover returned together to Bungay.",
        "paragraph_chars": [
            [
                0,
                505
            ],
            [
                505,
                859
            ],
            [
                859,
                1525
            ],
            [
                1525,
                1825
            ],
            [
                1825,
                2135
            ],
            [
                2135,
                2225
            ],
            [
                2225,
                2576
            ],
            [
                2576,
                2629
            ],
            [
                2629,
                2716
            ],
            [
                2716,
                2750
            ],
            [
                2750,
                2796
            ],
            [
                2796,
                2917
            ],
            [
                2917,
                3006
            ],
            [
                3006,
                3143
            ],
            [
                3143,
                3191
            ],
            [
                3191,
                3339
            ],
            [
                3339,
                3470
            ],
            [
                3470,
                3528
            ],
            [
                3528,
                3796
            ],
            [
                3796,
                3920
            ],
            [
                3920,
                3931
            ],
            [
                3931,
                4012
            ],
            [
                4012,
                4094
            ],
            [
                4094,
                4230
            ],
            [
                4230,
                4255
            ],
            [
                4255,
                4470
            ],
            [
                4470,
                4720
            ],
            [
                4720,
                5035
            ],
            [
                5035,
                5319
            ],
            [
                5319,
                5566
            ],
            [
                5566,
                5837
            ],
            [
                5837,
                6251
            ],
            [
                6251,
                6541
            ],
            [
                6541,
                6754
            ],
            [
                6754,
                6942
            ]
        ],
        "segment_chars": [
            [
                0,
                60
            ],
            [
                60,
                88
            ],
            [
                88,
                155
            ],
            [
                155,
                255
            ],
            [
                255,
                347
            ],
            [
                347,
                505
            ],
            [
                505,
                604
            ],
            [
                604,
                768
            ],
            [
                768,
                859
            ],
            [
                859,
                997
            ],
            [
                997,
                1079
            ],
            [
                1079,
                1178
            ],
            [
                1178,
                1262
            ],
            [
                1262,
                1309
            ],
            [
                1309,
                1411
            ],
            [
                1411,
                1525
            ],
            [
                1525,
                1629
            ],
            [
                1629,
                1679
            ],
            [
                1679,
                1784
            ],
            [
                1784,
                1825
            ],
            [
                1825,
                1899
            ],
            [
                1899,
                1946
            ],
            [
                1946,
                2045
            ],
            [
                2045,
                2135
            ],
            [
                2135,
                2194
            ],
            [
                2194,
                2225
            ],
            [
                2225,
                2284
            ],
            [
                2284,
                2323
            ],
            [
                2323,
                2378
            ],
            [
                2378,
                2576
            ],
            [
                2576,
                2629
            ],
            [
                2629,
                2716
            ],
            [
                2716,
                2750
            ],
            [
                2750,
                2796
            ],
            [
                2796,
                2825
            ],
            [
                2825,
                2917
            ],
            [
                2917,
                3006
            ],
            [
                3006,
                3028
            ],
            [
                3028,
                3143
            ],
            [
                3143,
                3191
            ],
            [
                3191,
                3247
            ],
            [
                3247,
                3284
            ],
            [
                3284,
                3339
            ],
            [
                3339,
                3393
            ],
            [
                3393,
                3447
            ],
            [
                3447,
                3470
            ],
            [
                3470,
                3528
            ],
            [
                3528,
                3601
            ],
            [
                3601,
                3667
            ],
            [
                3667,
                3725
            ],
            [
                3725,
                3796
            ],
            [
                3796,
                3840
            ],
            [
                3840,
                3878
            ],
            [
                3878,
                3920
            ],
            [
                3920,
                3931
            ],
            [
                3931,
                4012
            ],
            [
                4012,
                4094
            ],
            [
                4094,
                4115
            ],
            [
                4115,
                4163
            ],
            [
                4163,
                4219
            ],
            [
                4219,
                4230
            ],
            [
                4230,
                4255
            ],
            [
                4255,
                4345
            ],
            [
                4345,
                4381
            ],
            [
                4381,
                4398
            ],
            [
                4398,
                4470
            ],
            [
                4470,
                4510
            ],
            [
                4510,
                4582
            ],
            [
                4582,
                4634
            ],
            [
                4634,
                4720
            ],
            [
                4720,
                4821
            ],
            [
                4821,
                4869
            ],
            [
                4869,
                4904
            ],
            [
                4904,
                4976
            ],
            [
                4976,
                4993
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5111
            ],
            [
                5111,
                5224
            ],
            [
                5224,
                5319
            ],
            [
                5319,
                5434
            ],
            [
                5434,
                5566
            ],
            [
                5566,
                5612
            ],
            [
                5612,
                5710
            ],
            [
                5710,
                5837
            ],
            [
                5837,
                5925
            ],
            [
                5925,
                6071
            ],
            [
                6071,
                6176
            ],
            [
                6176,
                6251
            ],
            [
                6251,
                6364
            ],
            [
                6364,
                6541
            ],
            [
                6541,
                6631
            ],
            [
                6631,
                6679
            ],
            [
                6679,
                6754
            ],
            [
                6754,
                6807
            ],
            [
                6807,
                6857
            ],
            [
                6857,
                6942
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                58,
                60
            ],
            [
                60,
                86
            ],
            [
                86,
                87
            ],
            [
                88,
                102
            ],
            [
                110,
                112
            ],
            [
                123,
                126
            ],
            [
                140,
                148
            ],
            [
                160,
                163
            ],
            [
                169,
                171
            ],
            [
                172,
                205
            ],
            [
                206,
                213
            ],
            [
                220,
                235
            ],
            [
                236,
                239
            ],
            [
                240,
                255
            ],
            [
                255,
                347
            ],
            [
                347,
                458
            ],
            [
                459,
                504
            ],
            [
                505,
                519
            ],
            [
                529,
                582
            ],
            [
                584,
                604
            ],
            [
                604,
                610
            ],
            [
                625,
                628
            ],
            [
                630,
                633
            ],
            [
                634,
                636
            ],
            [
                637,
                698
            ],
            [
                700,
                743
            ],
            [
                745,
                761
            ],
            [
                766,
                768
            ],
            [
                768,
                788
            ],
            [
                790,
                842
            ],
            [
                843,
                858
            ],
            [
                859,
                889
            ],
            [
                897,
                914
            ],
            [
                915,
                952
            ],
            [
                953,
                997
            ],
            [
                997,
                1077
            ],
            [
                1077,
                1079
            ],
            [
                1079,
                1091
            ],
            [
                1097,
                1104
            ],
            [
                1105,
                1111
            ],
            [
                1111,
                1138
            ],
            [
                1139,
                1166
            ],
            [
                1172,
                1176
            ],
            [
                1176,
                1178
            ],
            [
                1178,
                1227
            ],
            [
                1234,
                1260
            ],
            [
                1260,
                1262
            ],
            [
                1262,
                1298
            ],
            [
                1303,
                1307
            ],
            [
                1307,
                1309
            ],
            [
                1309,
                1311
            ],
            [
                1312,
                1319
            ],
            [
                1320,
                1343
            ],
            [
                1343,
                1411
            ],
            [
                1411,
                1525
            ],
            [
                1525,
                1550
            ],
            [
                1551,
                1562
            ],
            [
                1563,
                1605
            ],
            [
                1606,
                1608
            ],
            [
                1609,
                1629
            ],
            [
                1629,
                1679
            ],
            [
                1679,
                1723
            ],
            [
                1724,
                1728
            ],
            [
                1729,
                1732
            ],
            [
                1733,
                1750
            ],
            [
                1751,
                1754
            ],
            [
                1755,
                1784
            ],
            [
                1784,
                1789
            ],
            [
                1790,
                1825
            ],
            [
                1825,
                1866
            ],
            [
                1867,
                1871
            ],
            [
                1872,
                1899
            ],
            [
                1899,
                1910
            ],
            [
                1911,
                1946
            ],
            [
                1949,
                2045
            ],
            [
                2045,
                2096
            ],
            [
                2096,
                2115
            ],
            [
                2116,
                2135
            ],
            [
                2135,
                2137
            ],
            [
                2138,
                2173
            ],
            [
                2179,
                2193
            ],
            [
                2194,
                2225
            ],
            [
                2225,
                2284
            ],
            [
                2284,
                2321
            ],
            [
                2321,
                2323
            ],
            [
                2334,
                2337
            ],
            [
                2345,
                2348
            ],
            [
                2357,
                2378
            ],
            [
                2378,
                2388
            ],
            [
                2397,
                2447
            ],
            [
                2453,
                2480
            ],
            [
                2482,
                2529
            ],
            [
                2535,
                2576
            ],
            [
                2576,
                2629
            ],
            [
                2629,
                2696
            ],
            [
                2696,
                2715
            ],
            [
                2716,
                2750
            ],
            [
                2750,
                2761
            ],
            [
                2761,
                2771
            ],
            [
                2778,
                2793
            ],
            [
                2796,
                2823
            ],
            [
                2823,
                2825
            ],
            [
                2825,
                2917
            ],
            [
                2917,
                3006
            ],
            [
                3006,
                3028
            ],
            [
                3028,
                3118
            ],
            [
                3119,
                3123
            ],
            [
                3129,
                3143
            ],
            [
                3143,
                3162
            ],
            [
                3166,
                3191
            ],
            [
                3191,
                3247
            ],
            [
                3247,
                3284
            ],
            [
                3284,
                3339
            ],
            [
                3339,
                3392
            ],
            [
                3394,
                3428
            ],
            [
                3429,
                3447
            ],
            [
                3447,
                3470
            ],
            [
                3470,
                3528
            ],
            [
                3528,
                3557
            ],
            [
                3561,
                3583
            ],
            [
                3599,
                3601
            ],
            [
                3602,
                3657
            ],
            [
                3665,
                3667
            ],
            [
                3667,
                3670
            ],
            [
                3671,
                3682
            ],
            [
                3689,
                3696
            ],
            [
                3698,
                3700
            ],
            [
                3701,
                3725
            ],
            [
                3728,
                3735
            ],
            [
                3736,
                3739
            ],
            [
                3749,
                3751
            ],
            [
                3757,
                3761
            ],
            [
                3768,
                3770
            ],
            [
                3771,
                3796
            ],
            [
                3796,
                3838
            ],
            [
                3838,
                3840
            ],
            [
                3840,
                3875
            ],
            [
                3875,
                3878
            ],
            [
                3878,
                3886
            ],
            [
                3895,
                3920
            ],
            [
                3920,
                3921
            ],
            [
                3925,
                3931
            ],
            [
                3931,
                3934
            ],
            [
                3935,
                3997
            ],
            [
                3997,
                4012
            ],
            [
                4012,
                4094
            ],
            [
                4094,
                4095
            ],
            [
                4095,
                4100
            ],
            [
                4101,
                4104
            ],
            [
                4105,
                4113
            ],
            [
                4113,
                4115
            ],
            [
                4115,
                4163
            ],
            [
                4163,
                4182
            ],
            [
                4188,
                4219
            ],
            [
                4219,
                4222
            ],
            [
                4225,
                4230
            ],
            [
                4230,
                4255
            ],
            [
                4255,
                4262
            ],
            [
                4270,
                4292
            ],
            [
                4293,
                4345
            ],
            [
                4345,
                4369
            ],
            [
                4370,
                4381
            ],
            [
                4381,
                4398
            ],
            [
                4398,
                4424
            ],
            [
                4424,
                4445
            ],
            [
                4446,
                4467
            ],
            [
                4467,
                4469
            ],
            [
                4470,
                4510
            ],
            [
                4510,
                4561
            ],
            [
                4562,
                4568
            ],
            [
                4569,
                4575
            ],
            [
                4580,
                4582
            ],
            [
                4582,
                4607
            ],
            [
                4608,
                4632
            ],
            [
                4632,
                4634
            ],
            [
                4634,
                4691
            ],
            [
                4692,
                4714
            ],
            [
                4718,
                4719
            ],
            [
                4720,
                4796
            ],
            [
                4797,
                4821
            ],
            [
                4821,
                4854
            ],
            [
                4855,
                4869
            ],
            [
                4869,
                4904
            ],
            [
                4904,
                4906
            ],
            [
                4918,
                4920
            ],
            [
                4929,
                4973
            ],
            [
                4973,
                4976
            ],
            [
                4976,
                4993
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5072
            ],
            [
                5079,
                5111
            ],
            [
                5111,
                5146
            ],
            [
                5150,
                5153
            ],
            [
                5154,
                5224
            ],
            [
                5224,
                5236
            ],
            [
                5245,
                5265
            ],
            [
                5266,
                5269
            ],
            [
                5275,
                5282
            ],
            [
                5284,
                5317
            ],
            [
                5317,
                5318
            ],
            [
                5319,
                5323
            ],
            [
                5324,
                5328
            ],
            [
                5337,
                5352
            ],
            [
                5361,
                5370
            ],
            [
                5371,
                5413
            ],
            [
                5414,
                5420
            ],
            [
                5421,
                5434
            ],
            [
                5434,
                5492
            ],
            [
                5492,
                5509
            ],
            [
                5514,
                5529
            ],
            [
                5530,
                5565
            ],
            [
                5567,
                5612
            ],
            [
                5612,
                5664
            ],
            [
                5673,
                5710
            ],
            [
                5710,
                5715
            ],
            [
                5716,
                5725
            ],
            [
                5731,
                5810
            ],
            [
                5811,
                5828
            ],
            [
                5828,
                5830
            ],
            [
                5831,
                5835
            ],
            [
                5835,
                5836
            ],
            [
                5837,
                5851
            ],
            [
                5858,
                5887
            ],
            [
                5888,
                5925
            ],
            [
                5925,
                5974
            ],
            [
                5975,
                6025
            ],
            [
                6038,
                6041
            ],
            [
                6050,
                6071
            ],
            [
                6076,
                6112
            ],
            [
                6113,
                6131
            ],
            [
                6132,
                6176
            ],
            [
                6176,
                6179
            ],
            [
                6186,
                6190
            ],
            [
                6191,
                6195
            ],
            [
                6214,
                6250
            ],
            [
                6251,
                6324
            ],
            [
                6328,
                6329
            ],
            [
                6330,
                6341
            ],
            [
                6346,
                6349
            ],
            [
                6359,
                6362
            ],
            [
                6362,
                6364
            ],
            [
                6364,
                6398
            ],
            [
                6398,
                6441
            ],
            [
                6446,
                6449
            ],
            [
                6455,
                6466
            ],
            [
                6470,
                6515
            ],
            [
                6516,
                6540
            ],
            [
                6541,
                6631
            ],
            [
                6631,
                6668
            ],
            [
                6677,
                6679
            ],
            [
                6679,
                6754
            ],
            [
                6754,
                6781
            ],
            [
                6782,
                6807
            ],
            [
                6807,
                6825
            ],
            [
                6826,
                6847
            ],
            [
                6855,
                6857
            ],
            [
                6857,
                6942
            ]
        ],
        "row_chars": [
            [
                0,
                60
            ],
            [
                60,
                255
            ],
            [
                255,
                347
            ],
            [
                347,
                505
            ],
            [
                505,
                604
            ],
            [
                604,
                768
            ],
            [
                768,
                768
            ],
            [
                768,
                859
            ],
            [
                859,
                997
            ],
            [
                997,
                1079
            ],
            [
                1079,
                1178
            ],
            [
                1178,
                1262
            ],
            [
                1262,
                1309
            ],
            [
                1309,
                1411
            ],
            [
                1411,
                1525
            ],
            [
                1525,
                1629
            ],
            [
                1629,
                1679
            ],
            [
                1679,
                1679
            ],
            [
                1679,
                1784
            ],
            [
                1784,
                1825
            ],
            [
                1825,
                1899
            ],
            [
                1899,
                1946
            ],
            [
                1946,
                1946
            ],
            [
                1946,
                1946
            ],
            [
                1946,
                1946
            ],
            [
                1946,
                2045
            ],
            [
                2045,
                2135
            ],
            [
                2135,
                2194
            ],
            [
                2194,
                2194
            ],
            [
                2194,
                2194
            ],
            [
                2194,
                2225
            ],
            [
                2225,
                2284
            ],
            [
                2284,
                2323
            ],
            [
                2323,
                2378
            ],
            [
                2378,
                2576
            ],
            [
                2576,
                2629
            ],
            [
                2629,
                2716
            ],
            [
                2716,
                2750
            ],
            [
                2750,
                2796
            ],
            [
                2796,
                2796
            ],
            [
                2796,
                2825
            ],
            [
                2825,
                2917
            ],
            [
                2917,
                2917
            ],
            [
                2917,
                2917
            ],
            [
                2917,
                3006
            ],
            [
                3006,
                3028
            ],
            [
                3028,
                3143
            ],
            [
                3143,
                3191
            ],
            [
                3191,
                3247
            ],
            [
                3247,
                3284
            ],
            [
                3284,
                3284
            ],
            [
                3284,
                3339
            ],
            [
                3339,
                3393
            ],
            [
                3393,
                3393
            ],
            [
                3393,
                3393
            ],
            [
                3393,
                3447
            ],
            [
                3447,
                3470
            ],
            [
                3470,
                3528
            ],
            [
                3528,
                3601
            ],
            [
                3601,
                3601
            ],
            [
                3601,
                3601
            ],
            [
                3601,
                3667
            ],
            [
                3667,
                3725
            ],
            [
                3725,
                3796
            ],
            [
                3796,
                3840
            ],
            [
                3840,
                3840
            ],
            [
                3840,
                3840
            ],
            [
                3840,
                3878
            ],
            [
                3878,
                3920
            ],
            [
                3920,
                3931
            ],
            [
                3931,
                4012
            ],
            [
                4012,
                4094
            ],
            [
                4094,
                4115
            ],
            [
                4115,
                4163
            ],
            [
                4163,
                4219
            ],
            [
                4219,
                4219
            ],
            [
                4219,
                4230
            ],
            [
                4230,
                4255
            ],
            [
                4255,
                4345
            ],
            [
                4345,
                4381
            ],
            [
                4381,
                4398
            ],
            [
                4398,
                4470
            ],
            [
                4470,
                4510
            ],
            [
                4510,
                4582
            ],
            [
                4582,
                4634
            ],
            [
                4634,
                4720
            ],
            [
                4720,
                4821
            ],
            [
                4821,
                4821
            ],
            [
                4821,
                4869
            ],
            [
                4869,
                4904
            ],
            [
                4904,
                4976
            ],
            [
                4976,
                4993
            ],
            [
                4993,
                4993
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5111
            ],
            [
                5111,
                5224
            ],
            [
                5224,
                5319
            ],
            [
                5319,
                5434
            ],
            [
                5434,
                5566
            ],
            [
                5566,
                5566
            ],
            [
                5566,
                5566
            ],
            [
                5566,
                5612
            ],
            [
                5612,
                5710
            ],
            [
                5710,
                5837
            ],
            [
                5837,
                5925
            ],
            [
                5925,
                6071
            ],
            [
                6071,
                6176
            ],
            [
                6176,
                6251
            ],
            [
                6251,
                6364
            ],
            [
                6364,
                6541
            ],
            [
                6541,
                6631
            ],
            [
                6631,
                6679
            ],
            [
                6679,
                6754
            ],
            [
                6754,
                6754
            ],
            [
                6754,
                6807
            ],
            [
                6807,
                6857
            ],
            [
                6857,
                6942
            ]
        ]
    }
}