{
    "original": {
        "text": "On Friday, the 21st June, the Board of the South Central Pacific and Mexican Railway sat in its own room behind the Exchange, as was the Board's custom every Friday. On this occasion all the members were there, as it had been understood that the chairman was to make a special statement. There was the great chairman as a matter of course. In the midst of his numerous and immense concerns he never threw over the railway, or delegated to other less experienced hands those cares which the commercial world had intrusted to his own. Lord Alfred was there, with Mr. Cohenlupe, the Hebrew gentleman, and Paul Montague, and Lord Nidderdale,--and even Sir Felix Carbury. Sir Felix had come, being very anxious to buy and sell, and not as yet having had an opportunity of realising his golden hopes, although he had actually paid a thousand pounds in hard money into Mr. Melmotte's hands. The secretary, Mr. Miles Grendall, was also present as a matter of course. The Board always met at three, and had generally been dissolved at a quarter past three. Lord Alfred and Mr. Cohenlupe sat at the chairman's right and left hand. Paul Montague generally sat immediately below, with Miles Grendall opposite to him;--but on this occasion the young lord and the young baronet took the next places. It was a nice little family party, the great chairman with his two aspiring sons-in-law, his two particular friends,--the social friend, Lord Alfred, and the commercial friend Mr. Cohenlupe,--and Miles, who was Lord Alfred's son. It would have been complete in its friendliness, but for Paul Montague, who had lately made himself disagreeable to Mr. Melmotte;--and most ungratefully so, for certainly no one had been allowed so free a use of the shares as the younger member of the house of Fisker, Montague, and Montague.\n[Illustration: The Board-room.]\nIt was understood that Mr. Melmotte was to make a statement. Lord Nidderdale and Sir Felix had conceived that this was to be done as it were out of the great man's own heart, of his own wish, so that something of the condition of the company might be made known to the directors of the company. But this was not perhaps exactly the truth. Paul Montague had insisted on giving vent to certain doubts at the last meeting but one, and, having made himself very disagreeable indeed, had forced this trouble on the great chairman. On the intermediate Friday the chairman had made himself very unpleasant to Paul, and this had seemed to be an effort on his part to frighten the inimical director out of his opposition, so that the promise of a statement need not be fulfilled. What nuisance can be so great to a man busied with immense affairs, as to have to explain,--or to attempt to explain,--small details to men incapable of understanding them? But Montague had stood to his guns. He had not intended, he said, to dispute the commercial success of the company. But he felt very strongly, and he thought that his brother directors should feel as strongly, that it was necessary that they should know more than they did know. Lord Alfred had declared that he did not in the least agree with his brother director. \"If anybody don't understand, it's his own fault,\" said Mr. Cohenlupe. But Paul would not give way, and it was understood that Mr. Melmotte would make a statement.\nThe \"Boards\" were always commenced by the reading of a certain record of the last meeting out of a book. This was always done by Miles Grendall; and the record was supposed to have been written by him. But Montague had discovered that this statement in the book was always prepared and written by a satellite of Melmotte's from Abchurch Lane who was never present at the meeting. The adverse director had spoken to the secretary,--it will be remembered that they were both members of the Beargarden,--and Miles had given a somewhat evasive reply. \"A cussed deal of trouble and all that, you know! He's used to it, and it's what he's meant for. I'm not going to flurry myself about stuff of that kind.\" Montague after this had spoken on the subject both to Nidderdale and Felix Carbury. \"He couldn't do it, if it was ever so,\" Nidderdale had said. \"I don't think I'd bully him if I were you. He gets 500 a-year, and if you knew all he owes, and all he hasn't got, you wouldn't try to rob him of it.\" With Felix Carbury Montague had as little success. Sir Felix hated the secretary, had detected him cheating at cards, had resolved to expose him,--and had then been afraid to do so. He had told Dolly Longestaffe, and the reader will perhaps remember with what effect. He had not mentioned the affair again, and had gradually fallen back into the habit of playing at the club. Loo, however, had given way to whist, and Sir Felix had satisfied himself with the change. He still meditated some dreadful punishment for Miles Grendall, but, in the meantime, felt himself unable to oppose him at the Board. Since the day at which the aces had been manipulated at the club he had not spoken to Miles Grendall except in reference to the affairs of the whist-table. The \"Board\" was now commenced as usual. Miles read the short record out of the book,--stumbling over every other word, and going through the performance so badly that had there been anything to understand no one could have understood it. \"Gentlemen,\" said Mr. Melmotte, in his usual hurried way, \"is it your pleasure that I shall sign the record?\" Paul Montague rose to say that it was not his pleasure that the record should be signed. But Melmotte had made his scrawl, and was deep in conversation with Mr. Cohenlupe before Paul could get upon his legs.\nMelmotte, however, had watched the little struggle. Melmotte, whatever might be his faults, had eyes to see and ears to hear. He perceived that Montague had made a little struggle and had been cowed; and he knew how hard it is for one man to persevere against five or six, and for a young man to persevere against his elders. Nidderdale was filliping bits of paper across the table at Carbury. Miles Grendall was poring over the book which was in his charge. Lord Alfred sat back in his chair, the picture of a model director, with his right hand within his waistcoat. He looked aristocratic, respectable, and almost commercial. In that room he never by any chance opened his mouth, except when called on to say that Mr. Melmotte was right, and was considered by the chairman really to earn his money. Melmotte for a minute or two went on conversing with Cohenlupe, having perceived that Montague for the moment was cowed. Then Paul put both his hands upon the table, intending to rise and ask some perplexing question. Melmotte saw this also and was upon his legs before Montague had risen from his chair. \"Gentlemen,\" said Mr. Melmotte, \"it may perhaps be as well if I take this occasion of saying a few words to you about the affairs of the company.\" Then, instead of going on with his statement, he sat down again, and began to turn over sundry voluminous papers very slowly, whispering a word or two every now and then to Mr. Cohenlupe. Lord Alfred never changed his posture and never took his hand from his breast. Nidderdale and Carbury filliped their paper pellets backwards and forwards. Montague sat profoundly listening,--or ready to listen when anything should be said. As the chairman had risen from his chair to commence his statement, Paul felt that he was bound to be silent. When a speaker is in possession of the floor, he is in possession even though he be somewhat dilatory in looking to his references, and whispering to his neighbour. And, when that speaker is a chairman, of course some additional latitude must be allowed to him. Montague understood this, and sat silent. It seemed that Melmotte had much to say to Cohenlupe, and Cohenlupe much to say to Melmotte. Since Cohenlupe had sat at the Board he had never before developed such powers of conversation.\nNidderdale didn't quite understand it. He had been there twenty minutes, was tired of his present amusement, having been unable to hit Carbury on the nose, and suddenly remembered that the Beargarden would now be open. He was no respecter of persons, and had got over any little feeling of awe with which the big table and the solemnity of the room may have first inspired him. \"I suppose that's about all,\" he said, looking up at Melmotte.\n\"Well;--perhaps as your lordship is in a hurry, and as my lord here is engaged elsewhere,\"--turning round to Lord Alfred, who had not uttered a syllable or made a sign since he had been in his seat,--\"we had better adjourn this meeting for another week.\"\n\"I cannot allow that,\" said Paul Montague.\n\"I suppose then we must take the sense of the Board,\" said the Chairman.\n\"I have been discussing certain circumstances with our friend and Chairman,\" said Cohenlupe, \"and I must say that it is not expedient just at present to go into matters too freely.\"\n\"My lords and gentlemen,\" said Melmotte. \"I hope that you trust me.\"\nLord Alfred bowed down to the table and muttered something which was intended to convey most absolute confidence. \"Hear, hear,\" said Mr. Cohenlupe. \"All right,\" said Lord Nidderdale; \"go on;\" and he fired another pellet with improved success.\n\"I trust,\" said the Chairman, \"that my young friend, Sir Felix, doubts neither my discretion nor my ability.\"\n\"Oh dear, no;--not at all,\" said the baronet, much flattered at being addressed in this kindly tone. He had come there with objects of his own, and was quite prepared to support the Chairman on any matter whatever.\n\"My Lords and Gentlemen,\" continued Melmotte, \"I am delighted to receive this expression of your confidence. If I know anything in the world I know something of commercial matters. I am able to tell you that we are prospering. I do not know that greater prosperity has ever been achieved in a shorter time by a commercial company. I think our friend here, Mr. Montague, should be as feelingly aware of that as any gentleman.\"\n\"What do you mean by that, Mr. Melmotte?\" asked Paul.\n\"What do I mean?--Certainly nothing adverse to your character, sir. Your firm in San Francisco, sir, know very well how the affairs of the Company are being transacted on this side of the water. No doubt you are in correspondence with Mr. Fisker. Ask him. The telegraph wires are open to you, sir. But, my Lords and Gentlemen, I am able to inform you that in affairs of this nature great discretion is necessary. On behalf of the shareholders at large whose interests are in our hands, I think it expedient that any general statement should be postponed for a short time, and I flatter myself that in that opinion I shall carry the majority of this Board with me.\" Mr. Melmotte did not make his speech very fluently; but, being accustomed to the place which he occupied, he did manage to get the words spoken in such a way as to make them intelligible to the company. \"I now move that this meeting be adjourned to this day week,\" he added.\n\"I second that motion,\" said Lord Alfred, without moving his hand from his breast.\n\"I understood that we were to have a statement,\" said Montague.\n\"You've had a statement,\" said Mr. Cohenlupe.\n\"I will put my motion to the vote,\" said the Chairman.\n\"I shall move an amendment,\" said Paul, determined that he would not be altogether silenced.\n\"There is nobody to second it,\" said Mr. Cohenlupe.\n\"How do you know till I've made it?\" asked the rebel. \"I shall ask Lord Nidderdale to second it, and when he has heard it I think that he will not refuse.\"\n\"Oh, gracious me! why me? No;--don't ask me. I've got to go away. I have indeed.\"\n\"At any rate I claim the right of saying a few words. I do not say whether every affair of this Company should or should not be published to the world.\"\n\"You'd break up everything if you did,\" said Cohenlupe.\n\"Perhaps everything ought to be broken up. But I say nothing about that. What I do say is this. That as we sit here as directors and will be held to be responsible as such by the public, we ought to know what is being done. We ought to know where the shares really are. I for one do not even know what scrip has been issued.\"\n\"You've bought and sold enough to know something about it,\" said Melmotte.\nPaul Montague became very red in the face. \"I, at any rate, began,\" he said, \"by putting what was to me a large sum of money into the affair.\"\n\"That's more than I know,\" said Melmotte. \"Whatever shares you have, were issued at San Francisco, and not here.\"\n\"I have taken nothing that I haven't paid for,\" said Montague. \"Nor have I yet had allotted to me anything like the number of shares which my capital would represent. But I did not intend to speak of my own concerns.\"\n\"It looks very like it,\" said Cohenlupe.\n\"So far from it that I am prepared to risk the not improbable loss of everything I have in the world. I am determined to know what is being done with the shares, or to make it public to the world at large that I, one of the directors of the Company, do not in truth know anything about it. I cannot, I suppose, absolve myself from further responsibility; but I can at any rate do what is right from this time forward,--and that course I intend to take.\"\n\"The gentleman had better resign his seat at this Board,\" said Melmotte. \"There will be no difficulty about that.\"\n\"Bound up as I am with Fisker and Montague in California I fear that there will be difficulty.\"\n\"Not in the least,\" continued the Chairman. \"You need only gazette your resignation and the thing is done. I had intended, gentlemen, to propose an addition to our number. When I name to you a gentleman, personally known to many of you, and generally esteemed throughout England as a man of business, as a man of probity, and as a man of fortune, a man standing deservedly high in all British circles, I mean Mr. Longestaffe of Caversham--\"\n\"Young Dolly, or old?\" asked Lord Nidderdale.\n\"I mean Mr. Adolphus Longestaffe, senior, of Caversham. I am sure that you will all be glad to welcome him among you. I had thought to strengthen our number by this addition. But if Mr. Montague is determined to leave us,--and no one will regret the loss of his services so much as I shall,--it will be my pleasing duty to move that Adolphus Longestaffe, senior, Esquire, of Caversham, be requested to take his place. If on reconsideration Mr. Montague shall determine to remain with us,--and I for one most sincerely hope that such reconsideration may lead to such determination,--then I shall move that an additional director be added to our number, and that Mr. Longestaffe be requested to take the chair of that additional director.\" The latter speech Mr. Melmotte got through very glibly, and then immediately left the chair, so as to show that the business of the Board was closed for that day without any possibility of reopening it.\nPaul went up to him and took him by the sleeve, signifying that he wished to speak to him before they parted. \"Certainly,\" said the great man bowing. \"Carbury,\" he said, looking round on the young baronet with his blandest smile, \"if you are not in a hurry, wait a moment for me. I have a word or two to say before you go. Now, Mr. Montague, what can I do for you?\" Paul began his story, expressing again the opinion which he had already very plainly expressed at the table. But Melmotte stopped him very shortly, and with much less courtesy than he had shown in the speech which he had made from the chair. \"The thing is about this way, I take it, Mr. Montague;--you think you know more of this matter than I do.\"\n\"Not at all, Mr. Melmotte.\"\n\"And I think that I know more of it than you do. Either of us may be right. But as I don't intend to give way to you, perhaps the less we speak together about it the better. You can't be in earnest in the threat you made, because you would be making public things communicated to you under the seal of privacy,--and no gentleman would do that. But as long as you are hostile to me, I can't help you;--and so good afternoon.\" Then, without giving Montague the possibility of a reply, he escaped into an inner room which had the word \"Private\" painted on the door, and which was supposed to belong to the chairman individually. He shut the door behind him, and then, after a few moments, put out his head and beckoned to Sir Felix Carbury. Nidderdale was gone. Lord Alfred with his son were already on the stairs. Cohenlupe was engaged with Melmotte's clerk on the record-book. Paul Montague finding himself without support and alone, slowly made his way out into the court.\nSir Felix had come into the city intending to suggest to the Chairman that having paid his thousand pounds he should like to have a few shares to go on with. He was, indeed, at the present moment very nearly penniless, and had negotiated, or lost at cards, all the I.O.U.'s which were in any degree serviceable. He still had a pocket-book full of those issued by Miles Grendall; but it was now an understood thing at the Beargarden that no one was to be called upon to take them except Miles Grendall himself;--an arrangement which robbed the card-table of much of its delight. Beyond this, also, he had lately been forced to issue a little paper himself,--in doing which he had talked largely of his shares in the railway. His case certainly was hard. He had actually paid a thousand pounds down in hard cash, a commercial transaction which, as performed by himself, he regarded as stupendous. It was almost incredible to himself that he should have paid any one a thousand pounds, but he had done it with much difficulty,--having carried Dolly junior with him all the way into the city,--in the belief that he would thus put himself in the way of making a continual and unfailing income. He understood that as a director he would be always entitled to buy shares at par, and, as a matter of course, always able to sell them at the market price. This he understood to range from ten to fifteen and twenty per cent. profit. He would have nothing to do but to buy and sell daily. He was told that Lord Alfred was allowed to do it to a small extent; and that Melmotte was doing it to an enormous extent. But before he could do it he must get something,--he hardly knew what,--out of Melmotte's hands. Melmotte certainly did not seem disposed to shun him, and therefore there could be no difficulty about the shares. As to danger;--who could think of danger in reference to money intrusted to the hands of Augustus Melmotte?\n\"I am delighted to see you here,\" said Melmotte, shaking him cordially by the hand. \"You come regularly, and you'll find that it will be worth your while. There's nothing like attending to business. You should be here every Friday.\"\n\"I will,\" said the baronet.\n\"And let me see you sometimes up at my place in Abchurch Lane. I can put you more in the way of understanding things there than I can here. This is all a mere formal sort of thing. You can see that.\"\n\"Oh yes, I see that.\"\n\"We are obliged to have this kind of thing for men like that fellow Montague. By-the-bye, is he a friend of yours?\"\n\"Not particularly. He is a friend of a cousin of mine; and the women know him at home. He isn't a pal of mine if you mean that.\"\n\"If he makes himself disagreeable, he'll have to go to the wall;--that's all. But never mind him at present. Was your mother speaking to you of what I said to her?\"\n\"No, Mr. Melmotte,\" said Sir Felix, staring with all his eyes.\n\"I was talking to her about you, and I thought that perhaps she might have told you. This is all nonsense, you know, about you and Marie.\" Sir Felix looked into the man's face. It was not savage, as he had seen it. But there had suddenly come upon his brow that heavy look of a determined purpose which all who knew the man were wont to mark. Sir Felix had observed it a few minutes since in the Board-room, when the chairman was putting down the rebellious director. \"You understand that; don't you?\" Sir Felix still looked at him, but made no reply. \"It's all d---- nonsense. You haven't got a brass farthing, you know. You've no income at all; you're just living on your mother, and I'm afraid she's not very well off. How can you suppose that I shall give my girl to you?\" Felix still looked at him but did not dare to contradict a single statement made. Yet when the man told him that he had not a brass farthing he thought of his own thousand pounds which were now in the man's pocket. \"You're a baronet, and that's about all, you know,\" continued Melmotte. \"The Carbury property, which is a very small thing, belongs to a distant cousin who may leave it to me if he pleases;--and who isn't very much older than you are yourself.\"\n\"Oh, come, Mr. Melmotte; he's a great deal older than me.\"\n\"It wouldn't matter if he were as old as Adam. The thing is out of the question, and you must drop it.\" Then the look on his brow became a little heavier. \"You hear what I say. She is going to marry Lord Nidderdale. She was engaged to him before you ever saw her. What do you expect to get by it?\"\nSir Felix had not the courage to say that he expected to get the girl he loved. But as the man waited for an answer he was obliged to say something. \"I suppose it's the old story,\" he said.\n\"Just so;--the old story. You want my money, and she wants you, just because she has been told to take somebody else. You want something to live on;--that's what you want. Come;--out with it. Is not that it? When we understand each other I'll put you in the way of making money.\"\n\"Of course I'm not very well off,\" said Felix.\n\"About as badly as any young man that I can hear of. You give me your written promise that you'll drop this affair with Marie, and you shan't want for money.\"\n\"A written promise!\"\n\"Yes;--a written promise. I give nothing for nothing. I'll put you in the way of doing so well with these shares that you shall be able to marry any other girl you please;--or to live without marrying, which you'll find to be better.\"\nThere was something worthy of consideration in Mr. Melmotte's proposition. Marriage of itself, simply as a domestic institution, had not specially recommended itself to Sir Felix Carbury. A few horses at Leighton, Ruby Ruggles or any other beauty, and life at the Beargarden were much more to his taste. And then he was quite alive to the fact that it was possible that he might find himself possessed of the wife without the money. Marie, indeed, had a grand plan of her own, with reference to that settled income; but then Marie might be mistaken,--or she might be lying. If he were sure of making money in the way Melmotte now suggested, the loss of Marie would not break his heart. But then also Melmotte might be--lying. \"By-the-bye, Mr. Melmotte,\" said he, \"could you let me have those shares?\"\n\"What shares?\" And the heavy brow became still heavier.\n\"Don't you know?--I gave you a thousand pounds, and I was to have ten shares.\"\n\"You must come about that on the proper day, to the proper place.\"\n\"When is the proper day?\"\n\"It is the twentieth of each month I think.\" Sir Felix looked very blank at hearing this, knowing that this present was the twenty-first of the month. \"But what does that signify? Do you want a little money?\"\n\"Well, I do,\" said Sir Felix. \"A lot of fellows owe me money, but it's so hard to get it.\"\n\"That tells a story of gambling,\" said Mr. Melmotte. \"You think I'd give my girl to a gambler?\"\n\"Nidderdale's in it quite as thick as I am.\"\n\"Nidderdale has a settled property which neither he nor his father can destroy. But don't you be such a fool as to argue with me. You won't get anything by it. If you'll write that letter here now--\"\n\"What;--to Marie?\"\n\"No;--not to Marie at all; but to me. It need never be shown to her. If you'll do that I'll stick to you and make a man of you. And if you want a couple of hundred pounds I'll give you a cheque for it before you leave the room. Mind, I can tell you this. On my word of honour as a gentleman, if my daughter were to marry you, she'd never have a single shilling. I should immediately make a will and leave all my property to St. George's Hospital. I have quite made up my mind about that.\"\n\"And couldn't you manage that I should have the shares before the twentieth of next month?\"\n\"I'll see about it. Perhaps I could let you have a few of my own. At any rate I won't see you short of money.\"\nThe terms were enticing and the letter was of course written. Melmotte himself dictated the words, which were not romantic in their nature. The reader shall see the letter.\nDEAR SIR,\nIn consideration of the offers made by you to me, and on a clear understanding that such a marriage would be disagreeable to you and to the lady's mother, and would bring down a father's curse upon your daughter, I hereby declare and promise that I will not renew my suit to the young lady, which I hereby altogether renounce.\nI am, Dear Sir, Your obedient Servant,\nFELIX CARBURY.\nAUGUSTUS MELMOTTE, Esq., --, Grosvenor Square.\nThe letter was dated 21st July, and bore the printed address of the offices of the South Central Pacific and Mexican Railway.\n\"You'll give me that cheque for 200, Mr. Melmotte?\" The financier hesitated for a moment, but did give the baronet the cheque as promised. \"And you'll see about letting me have those shares?\"\n\"You can come to me in Abchurch Lane, you know.\" Sir Felix said that he would call in Abchurch Lane.\nAs he went westward towards the Beargarden, the baronet was not happy in his mind. Ignorant as he was as to the duties of a gentleman, indifferent as he was to the feelings of others, still he felt ashamed of himself. He was treating the girl very badly. Even he knew that he was behaving badly. He was so conscious of it that he tried to console himself by reflecting that his writing such a letter as that would not prevent his running away with the girl, should he, on consideration, find it to be worth his while to do so.\nThat night he was again playing at the Beargarden, and he lost a great part of Mr. Melmotte's money. He did in fact lose much more than the 200; but when he found his ready money going from him he issued paper.",
        "paragraph_chars": [
            [
                0,
                1809
            ],
            [
                1809,
                1841
            ],
            [
                1841,
                3315
            ],
            [
                3315,
                5627
            ],
            [
                5627,
                7912
            ],
            [
                7912,
                8353
            ],
            [
                8353,
                8608
            ],
            [
                8608,
                8651
            ],
            [
                8651,
                8724
            ],
            [
                8724,
                8906
            ],
            [
                8906,
                8975
            ],
            [
                8975,
                9218
            ],
            [
                9218,
                9328
            ],
            [
                9328,
                9543
            ],
            [
                9543,
                9969
            ],
            [
                9969,
                10023
            ],
            [
                10023,
                10963
            ],
            [
                10963,
                11046
            ],
            [
                11046,
                11110
            ],
            [
                11110,
                11156
            ],
            [
                11156,
                11211
            ],
            [
                11211,
                11304
            ],
            [
                11304,
                11356
            ],
            [
                11356,
                11512
            ],
            [
                11512,
                11594
            ],
            [
                11594,
                11747
            ],
            [
                11747,
                11803
            ],
            [
                11803,
                12129
            ],
            [
                12129,
                12204
            ],
            [
                12204,
                12347
            ],
            [
                12347,
                12461
            ],
            [
                12461,
                12679
            ],
            [
                12679,
                12720
            ],
            [
                12720,
                13174
            ],
            [
                13174,
                13289
            ],
            [
                13289,
                13385
            ],
            [
                13385,
                13826
            ],
            [
                13826,
                13872
            ],
            [
                13872,
                14813
            ],
            [
                14813,
                15528
            ],
            [
                15528,
                15556
            ],
            [
                15556,
                16529
            ],
            [
                16529,
                18451
            ],
            [
                18451,
                18684
            ],
            [
                18684,
                18712
            ],
            [
                18712,
                18912
            ],
            [
                18912,
                18934
            ],
            [
                18934,
                19050
            ],
            [
                19050,
                19179
            ],
            [
                19179,
                19344
            ],
            [
                19344,
                19407
            ],
            [
                19407,
                20644
            ],
            [
                20644,
                20703
            ],
            [
                20703,
                21001
            ],
            [
                21001,
                21191
            ],
            [
                21191,
                21471
            ],
            [
                21471,
                21518
            ],
            [
                21518,
                21677
            ],
            [
                21677,
                21698
            ],
            [
                21698,
                21933
            ],
            [
                21933,
                22734
            ],
            [
                22734,
                22790
            ],
            [
                22790,
                22869
            ],
            [
                22869,
                22936
            ],
            [
                22936,
                22962
            ],
            [
                22962,
                23171
            ],
            [
                23171,
                23262
            ],
            [
                23262,
                23358
            ],
            [
                23358,
                23403
            ],
            [
                23403,
                23603
            ],
            [
                23603,
                23622
            ],
            [
                23622,
                24111
            ],
            [
                24111,
                24203
            ],
            [
                24203,
                24314
            ],
            [
                24314,
                24487
            ],
            [
                24487,
                24497
            ],
            [
                24497,
                24824
            ],
            [
                24824,
                24863
            ],
            [
                24863,
                24878
            ],
            [
                24878,
                24925
            ],
            [
                24925,
                25051
            ],
            [
                25051,
                25243
            ],
            [
                25243,
                25344
            ],
            [
                25344,
                25871
            ],
            [
                25871,
                26081
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                288
            ],
            [
                288,
                340
            ],
            [
                340,
                533
            ],
            [
                533,
                667
            ],
            [
                667,
                884
            ],
            [
                884,
                959
            ],
            [
                959,
                1048
            ],
            [
                1048,
                1121
            ],
            [
                1121,
                1286
            ],
            [
                1286,
                1516
            ],
            [
                1516,
                1809
            ],
            [
                1809,
                1841
            ],
            [
                1841,
                1902
            ],
            [
                1902,
                2136
            ],
            [
                2136,
                2180
            ],
            [
                2180,
                2367
            ],
            [
                2367,
                2612
            ],
            [
                2612,
                2785
            ],
            [
                2785,
                2821
            ],
            [
                2821,
                2901
            ],
            [
                2901,
                3064
            ],
            [
                3064,
                3151
            ],
            [
                3151,
                3222
            ],
            [
                3222,
                3315
            ],
            [
                3315,
                3420
            ],
            [
                3420,
                3517
            ],
            [
                3517,
                3695
            ],
            [
                3695,
                3862
            ],
            [
                3862,
                3912
            ],
            [
                3912,
                3959
            ],
            [
                3959,
                4017
            ],
            [
                4017,
                4101
            ],
            [
                4101,
                4162
            ],
            [
                4162,
                4206
            ],
            [
                4206,
                4314
            ],
            [
                4314,
                4365
            ],
            [
                4365,
                4496
            ],
            [
                4496,
                4582
            ],
            [
                4582,
                4690
            ],
            [
                4690,
                4781
            ],
            [
                4781,
                4915
            ],
            [
                4915,
                5071
            ],
            [
                5071,
                5111
            ],
            [
                5111,
                5309
            ],
            [
                5309,
                5419
            ],
            [
                5419,
                5508
            ],
            [
                5508,
                5627
            ],
            [
                5627,
                5679
            ],
            [
                5679,
                5753
            ],
            [
                5753,
                5953
            ],
            [
                5953,
                6021
            ],
            [
                6021,
                6086
            ],
            [
                6086,
                6196
            ],
            [
                6196,
                6256
            ],
            [
                6256,
                6429
            ],
            [
                6429,
                6550
            ],
            [
                6550,
                6647
            ],
            [
                6647,
                6734
            ],
            [
                6734,
                6881
            ],
            [
                6881,
                7069
            ],
            [
                7069,
                7148
            ],
            [
                7148,
                7224
            ],
            [
                7224,
                7309
            ],
            [
                7309,
                7419
            ],
            [
                7419,
                7584
            ],
            [
                7584,
                7681
            ],
            [
                7681,
                7723
            ],
            [
                7723,
                7816
            ],
            [
                7816,
                7912
            ],
            [
                7912,
                7951
            ],
            [
                7951,
                8131
            ],
            [
                8131,
                8290
            ],
            [
                8290,
                8353
            ],
            [
                8353,
                8608
            ],
            [
                8608,
                8651
            ],
            [
                8651,
                8724
            ],
            [
                8724,
                8906
            ],
            [
                8906,
                8947
            ],
            [
                8947,
                8975
            ],
            [
                8975,
                9089
            ],
            [
                9089,
                9123
            ],
            [
                9123,
                9218
            ],
            [
                9218,
                9328
            ],
            [
                9328,
                9429
            ],
            [
                9429,
                9543
            ],
            [
                9543,
                9652
            ],
            [
                9652,
                9724
            ],
            [
                9724,
                9770
            ],
            [
                9770,
                9874
            ],
            [
                9874,
                9969
            ],
            [
                9969,
                10011
            ],
            [
                10011,
                10023
            ],
            [
                10023,
                10091
            ],
            [
                10091,
                10218
            ],
            [
                10218,
                10270
            ],
            [
                10270,
                10279
            ],
            [
                10279,
                10321
            ],
            [
                10321,
                10436
            ],
            [
                10436,
                10688
            ],
            [
                10688,
                10891
            ],
            [
                10891,
                10963
            ],
            [
                10963,
                11046
            ],
            [
                11046,
                11110
            ],
            [
                11110,
                11156
            ],
            [
                11156,
                11211
            ],
            [
                11211,
                11304
            ],
            [
                11304,
                11356
            ],
            [
                11356,
                11393
            ],
            [
                11393,
                11410
            ],
            [
                11410,
                11512
            ],
            [
                11512,
                11530
            ],
            [
                11530,
                11538
            ],
            [
                11538,
                11557
            ],
            [
                11557,
                11578
            ],
            [
                11578,
                11594
            ],
            [
                11594,
                11648
            ],
            [
                11648,
                11747
            ],
            [
                11747,
                11803
            ],
            [
                11803,
                11846
            ],
            [
                11846,
                11876
            ],
            [
                11876,
                11899
            ],
            [
                11899,
                12027
            ],
            [
                12027,
                12073
            ],
            [
                12073,
                12129
            ],
            [
                12129,
                12204
            ],
            [
                12204,
                12247
            ],
            [
                12247,
                12347
            ],
            [
                12347,
                12389
            ],
            [
                12389,
                12461
            ],
            [
                12461,
                12524
            ],
            [
                12524,
                12628
            ],
            [
                12628,
                12679
            ],
            [
                12679,
                12720
            ],
            [
                12720,
                12822
            ],
            [
                12822,
                13010
            ],
            [
                13010,
                13174
            ],
            [
                13174,
                13247
            ],
            [
                13247,
                13289
            ],
            [
                13289,
                13385
            ],
            [
                13385,
                13429
            ],
            [
                13429,
                13492
            ],
            [
                13492,
                13557
            ],
            [
                13557,
                13826
            ],
            [
                13826,
                13849
            ],
            [
                13849,
                13872
            ],
            [
                13872,
                13928
            ],
            [
                13928,
                13990
            ],
            [
                13990,
                14047
            ],
            [
                14047,
                14290
            ],
            [
                14290,
                14610
            ],
            [
                14610,
                14813
            ],
            [
                14813,
                14923
            ],
            [
                14923,
                14963
            ],
            [
                14963,
                15093
            ],
            [
                15093,
                15136
            ],
            [
                15136,
                15179
            ],
            [
                15179,
                15288
            ],
            [
                15288,
                15421
            ],
            [
                15421,
                15528
            ],
            [
                15528,
                15556
            ],
            [
                15556,
                15605
            ],
            [
                15605,
                15632
            ],
            [
                15632,
                15730
            ],
            [
                15730,
                15900
            ],
            [
                15900,
                15981
            ],
            [
                15981,
                16182
            ],
            [
                16182,
                16294
            ],
            [
                16294,
                16315
            ],
            [
                16315,
                16368
            ],
            [
                16368,
                16432
            ],
            [
                16432,
                16529
            ],
            [
                16529,
                16687
            ],
            [
                16687,
                16800
            ],
            [
                16800,
                16841
            ],
            [
                16841,
                17107
            ],
            [
                17107,
                17253
            ],
            [
                17253,
                17282
            ],
            [
                17282,
                17424
            ],
            [
                17424,
                17719
            ],
            [
                17719,
                17876
            ],
            [
                17876,
                17945
            ],
            [
                17945,
                17953
            ],
            [
                17953,
                18008
            ],
            [
                18008,
                18131
            ],
            [
                18131,
                18228
            ],
            [
                18228,
                18343
            ],
            [
                18343,
                18451
            ],
            [
                18451,
                18535
            ],
            [
                18535,
                18606
            ],
            [
                18606,
                18650
            ],
            [
                18650,
                18684
            ],
            [
                18684,
                18712
            ],
            [
                18712,
                18775
            ],
            [
                18775,
                18852
            ],
            [
                18852,
                18893
            ],
            [
                18893,
                18912
            ],
            [
                18912,
                18934
            ],
            [
                18934,
                19012
            ],
            [
                19012,
                19050
            ],
            [
                19050,
                19069
            ],
            [
                19069,
                19137
            ],
            [
                19137,
                19179
            ],
            [
                19179,
                19257
            ],
            [
                19257,
                19288
            ],
            [
                19288,
                19344
            ],
            [
                19344,
                19407
            ],
            [
                19407,
                19492
            ],
            [
                19492,
                19546
            ],
            [
                19546,
                19584
            ],
            [
                19584,
                19622
            ],
            [
                19622,
                19750
            ],
            [
                19750,
                19875
            ],
            [
                19875,
                19909
            ],
            [
                19909,
                19959
            ],
            [
                19959,
                19985
            ],
            [
                19985,
                20029
            ],
            [
                20029,
                20129
            ],
            [
                20129,
                20184
            ],
            [
                20184,
                20266
            ],
            [
                20266,
                20399
            ],
            [
                20399,
                20471
            ],
            [
                20471,
                20644
            ],
            [
                20644,
                20703
            ],
            [
                20703,
                20750
            ],
            [
                20750,
                20807
            ],
            [
                20807,
                20858
            ],
            [
                20858,
                20880
            ],
            [
                20880,
                20919
            ],
            [
                20919,
                20967
            ],
            [
                20967,
                21001
            ],
            [
                21001,
                21081
            ],
            [
                21081,
                21150
            ],
            [
                21150,
                21191
            ],
            [
                21191,
                21217
            ],
            [
                21217,
                21309
            ],
            [
                21309,
                21363
            ],
            [
                21363,
                21383
            ],
            [
                21383,
                21399
            ],
            [
                21399,
                21471
            ],
            [
                21471,
                21518
            ],
            [
                21518,
                21571
            ],
            [
                21571,
                21677
            ],
            [
                21677,
                21698
            ],
            [
                21698,
                21724
            ],
            [
                21724,
                21752
            ],
            [
                21752,
                21933
            ],
            [
                21933,
                22008
            ],
            [
                22008,
                22121
            ],
            [
                22121,
                22237
            ],
            [
                22237,
                22366
            ],
            [
                22366,
                22507
            ],
            [
                22507,
                22619
            ],
            [
                22619,
                22659
            ],
            [
                22659,
                22734
            ],
            [
                22734,
                22749
            ],
            [
                22749,
                22790
            ],
            [
                22790,
                22869
            ],
            [
                22869,
                22936
            ],
            [
                22936,
                22962
            ],
            [
                22962,
                23007
            ],
            [
                23007,
                23113
            ],
            [
                23113,
                23142
            ],
            [
                23142,
                23171
            ],
            [
                23171,
                23201
            ],
            [
                23201,
                23262
            ],
            [
                23262,
                23315
            ],
            [
                23315,
                23358
            ],
            [
                23358,
                23403
            ],
            [
                23403,
                23483
            ],
            [
                23483,
                23533
            ],
            [
                23533,
                23563
            ],
            [
                23563,
                23603
            ],
            [
                23603,
                23622
            ],
            [
                23622,
                23660
            ],
            [
                23660,
                23691
            ],
            [
                23691,
                23750
            ],
            [
                23750,
                23850
            ],
            [
                23850,
                23877
            ],
            [
                23877,
                23984
            ],
            [
                23984,
                24069
            ],
            [
                24069,
                24111
            ],
            [
                24111,
                24203
            ],
            [
                24203,
                24223
            ],
            [
                24223,
                24269
            ],
            [
                24269,
                24314
            ],
            [
                24314,
                24376
            ],
            [
                24376,
                24454
            ],
            [
                24454,
                24487
            ],
            [
                24487,
                24497
            ],
            [
                24497,
                24824
            ],
            [
                24824,
                24863
            ],
            [
                24863,
                24878
            ],
            [
                24878,
                24925
            ],
            [
                24925,
                25051
            ],
            [
                25051,
                25103
            ],
            [
                25103,
                25190
            ],
            [
                25190,
                25243
            ],
            [
                25243,
                25292
            ],
            [
                25292,
                25344
            ],
            [
                25344,
                25427
            ],
            [
                25427,
                25562
            ],
            [
                25562,
                25599
            ],
            [
                25599,
                25640
            ],
            [
                25640,
                25871
            ],
            [
                25871,
                25972
            ],
            [
                25972,
                26081
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                15,
                42
            ],
            [
                77,
                88
            ],
            [
                124,
                128
            ],
            [
                152,
                166
            ],
            [
                183,
                288
            ],
            [
                671,
                810
            ],
            [
                820,
                824
            ],
            [
                862,
                874
            ],
            [
                825,
                842
            ],
            [
                882,
                883
            ],
            [
                959,
                1040
            ],
            [
                1046,
                1048
            ],
            [
                1048,
                1081
            ],
            [
                1119,
                1121
            ],
            [
                1121,
                1134
            ],
            [
                1145,
                1196
            ],
            [
                1200,
                1204
            ],
            [
                1206,
                1226
            ],
            [
                1237,
                1241
            ],
            [
                1242,
                1245
            ],
            [
                1264,
                1268
            ],
            [
                1278,
                1285
            ],
            [
                2185,
                2193
            ],
            [
                2272,
                2280
            ],
            [
                2198,
                2272
            ],
            [
                2286,
                2311
            ],
            [
                2347,
                2367
            ],
            [
                2612,
                2701
            ],
            [
                2731,
                2784
            ],
            [
                2785,
                2821
            ],
            [
                2905,
                2927
            ],
            [
                2932,
                2934
            ],
            [
                2993,
                2999
            ],
            [
                2960,
                2969
            ],
            [
                3034,
                3064
            ],
            [
                3064,
                3104
            ],
            [
                3118,
                3123
            ],
            [
                3149,
                3150
            ],
            [
                3151,
                3222
            ],
            [
                3222,
                3296
            ],
            [
                3297,
                3315
            ],
            [
                3315,
                3327
            ],
            [
                3333,
                3339
            ],
            [
                3353,
                3369
            ],
            [
                3378,
                3404
            ],
            [
                3418,
                3420
            ],
            [
                3420,
                3428
            ],
            [
                3436,
                3517
            ],
            [
                3517,
                3549
            ],
            [
                3568,
                3571
            ],
            [
                3555,
                3564
            ],
            [
                3577,
                3580
            ],
            [
                3601,
                3656
            ],
            [
                3657,
                3664
            ],
            [
                3679,
                3695
            ],
            [
                3743,
                3744
            ],
            [
                3820,
                3861
            ],
            [
                3862,
                3912
            ],
            [
                3912,
                3927
            ],
            [
                4017,
                4025
            ],
            [
                4037,
                4100
            ],
            [
                4101,
                4119
            ],
            [
                4138,
                4162
            ],
            [
                4162,
                4206
            ],
            [
                4206,
                4208
            ],
            [
                4209,
                4219
            ],
            [
                4220,
                4224
            ],
            [
                4311,
                4314
            ],
            [
                4314,
                4332
            ],
            [
                4333,
                4365
            ],
            [
                4365,
                4380
            ],
            [
                4394,
                4458
            ],
            [
                4461,
                4496
            ],
            [
                4582,
                4688
            ],
            [
                4693,
                4694
            ],
            [
                4721,
                4726
            ],
            [
                4690,
                4693
            ],
            [
                4688,
                4689
            ],
            [
                5071,
                5082
            ],
            [
                5087,
                5109
            ],
            [
                5111,
                5155
            ],
            [
                5167,
                5189
            ],
            [
                5224,
                5226
            ],
            [
                5233,
                5237
            ],
            [
                5242,
                5247
            ],
            [
                5238,
                5241
            ],
            [
                5248,
                5308
            ],
            [
                5309,
                5368
            ],
            [
                5395,
                5400
            ],
            [
                5393,
                5394
            ],
            [
                5401,
                5418
            ],
            [
                5419,
                5440
            ],
            [
                5508,
                5549
            ],
            [
                5550,
                5589
            ],
            [
                5625,
                5627
            ],
            [
                5627,
                5657
            ],
            [
                5677,
                5679
            ],
            [
                5753,
                5898
            ],
            [
                5951,
                5953
            ],
            [
                5953,
                6021
            ],
            [
                6528,
                6531
            ],
            [
                6491,
                6492
            ],
            [
                6429,
                6437
            ],
            [
                6458,
                6465
            ],
            [
                6482,
                6491
            ],
            [
                6548,
                6549
            ],
            [
                6550,
                6647
            ],
            [
                6647,
                6691
            ],
            [
                6732,
                6733
            ],
            [
                6734,
                6881
            ],
            [
                6881,
                6968
            ],
            [
                6976,
                7069
            ],
            [
                7148,
                7224
            ],
            [
                7224,
                7236
            ],
            [
                7263,
                7278
            ],
            [
                7257,
                7258
            ],
            [
                7387,
                7419
            ],
            [
                7723,
                7816
            ],
            [
                7822,
                7835
            ],
            [
                7860,
                7872
            ],
            [
                7883,
                7912
            ],
            [
                7912,
                7951
            ],
            [
                7951,
                7983
            ],
            [
                8066,
                8130
            ],
            [
                8290,
                8336
            ],
            [
                8340,
                8353
            ],
            [
                8353,
                8358
            ],
            [
                8550,
                8551
            ],
            [
                8361,
                8443
            ],
            [
                8453,
                8505
            ],
            [
                8553,
                8608
            ],
            [
                8608,
                8651
            ],
            [
                8724,
                8778
            ],
            [
                8790,
                8906
            ],
            [
                8906,
                8947
            ],
            [
                8947,
                8975
            ],
            [
                8975,
                8986
            ],
            [
                9015,
                9033
            ],
            [
                9068,
                9088
            ],
            [
                9089,
                9122
            ],
            [
                9123,
                9156
            ],
            [
                9216,
                9218
            ],
            [
                9218,
                9328
            ],
            [
                9328,
                9340
            ],
            [
                9343,
                9388
            ],
            [
                9470,
                9475
            ],
            [
                9480,
                9543
            ],
            [
                9543,
                9652
            ],
            [
                9652,
                9724
            ],
            [
                9724,
                9770
            ],
            [
                9770,
                9874
            ],
            [
                9874,
                9925
            ],
            [
                9936,
                9969
            ],
            [
                9969,
                10011
            ],
            [
                10011,
                10023
            ],
            [
                10091,
                10190
            ],
            [
                10216,
                10218
            ],
            [
                10218,
                10270
            ],
            [
                10270,
                10279
            ],
            [
                10279,
                10321
            ],
            [
                10321,
                10349
            ],
            [
                10379,
                10436
            ],
            [
                10436,
                10448
            ],
            [
                10498,
                10501
            ],
            [
                10453,
                10465
            ],
            [
                10507,
                10685
            ],
            [
                10892,
                10950
            ],
            [
                10963,
                11003
            ],
            [
                11044,
                11046
            ],
            [
                11046,
                11110
            ],
            [
                11110,
                11156
            ],
            [
                11156,
                11211
            ],
            [
                11211,
                11261
            ],
            [
                11276,
                11279
            ],
            [
                11280,
                11282
            ],
            [
                11294,
                11304
            ],
            [
                11304,
                11356
            ],
            [
                11356,
                11372
            ],
            [
                11411,
                11451
            ],
            [
                11509,
                11512
            ],
            [
                11512,
                11530
            ],
            [
                11543,
                11557
            ],
            [
                11557,
                11578
            ],
            [
                11578,
                11594
            ],
            [
                11594,
                11646
            ],
            [
                11646,
                11648
            ],
            [
                11904,
                11948
            ],
            [
                11955,
                12027
            ],
            [
                12027,
                12073
            ],
            [
                12073,
                12129
            ],
            [
                12129,
                12204
            ],
            [
                12204,
                12247
            ],
            [
                12247,
                12249
            ],
            [
                12264,
                12347
            ],
            [
                12347,
                12389
            ],
            [
                12389,
                12461
            ],
            [
                12461,
                12524
            ],
            [
                12524,
                12628
            ],
            [
                12628,
                12679
            ],
            [
                12679,
                12720
            ],
            [
                12720,
                12766
            ],
            [
                12782,
                12822
            ],
            [
                12822,
                12887
            ],
            [
                12906,
                12953
            ],
            [
                12968,
                13010
            ],
            [
                13155,
                13166
            ],
            [
                13097,
                13113
            ],
            [
                13171,
                13174
            ],
            [
                13174,
                13247
            ],
            [
                13247,
                13289
            ],
            [
                13289,
                13385
            ],
            [
                13385,
                13429
            ],
            [
                13429,
                13443
            ],
            [
                13452,
                13492
            ],
            [
                13492,
                13557
            ],
            [
                13557,
                13625
            ],
            [
                13636,
                13644
            ],
            [
                13664,
                13685
            ],
            [
                13698,
                13710
            ],
            [
                13723,
                13730
            ],
            [
                13787,
                13822
            ],
            [
                13826,
                13849
            ],
            [
                13849,
                13872
            ],
            [
                13872,
                13912
            ],
            [
                13926,
                13928
            ],
            [
                13928,
                13990
            ],
            [
                13990,
                14047
            ],
            [
                14047,
                14093
            ],
            [
                14164,
                14225
            ],
            [
                14235,
                14242
            ],
            [
                14274,
                14290
            ],
            [
                14290,
                14358
            ],
            [
                14361,
                14366
            ],
            [
                14380,
                14399
            ],
            [
                14454,
                14476
            ],
            [
                14533,
                14536
            ],
            [
                14544,
                14548
            ],
            [
                14500,
                14522
            ],
            [
                14477,
                14479
            ],
            [
                14588,
                14610
            ],
            [
                14630,
                14640
            ],
            [
                14675,
                14771
            ],
            [
                14811,
                14813
            ],
            [
                14813,
                14895
            ],
            [
                14903,
                14922
            ],
            [
                14923,
                14954
            ],
            [
                14955,
                14963
            ],
            [
                14963,
                15093
            ],
            [
                15093,
                15106
            ],
            [
                15114,
                15136
            ],
            [
                15136,
                15178
            ],
            [
                15179,
                15189
            ],
            [
                15212,
                15250
            ],
            [
                15264,
                15288
            ],
            [
                15288,
                15312
            ],
            [
                15331,
                15335
            ],
            [
                15341,
                15359
            ],
            [
                15419,
                15420
            ],
            [
                15421,
                15434
            ],
            [
                15460,
                15474
            ],
            [
                15477,
                15528
            ],
            [
                15528,
                15556
            ],
            [
                15556,
                15605
            ],
            [
                15605,
                15632
            ],
            [
                15632,
                15730
            ],
            [
                15904,
                15955
            ],
            [
                15957,
                15980
            ],
            [
                15981,
                16068
            ],
            [
                16119,
                16122
            ],
            [
                16109,
                16117
            ],
            [
                16180,
                16182
            ],
            [
                16221,
                16241
            ],
            [
                16182,
                16184
            ],
            [
                16242,
                16294
            ],
            [
                16432,
                16445
            ],
            [
                16489,
                16521
            ],
            [
                16527,
                16529
            ],
            [
                16529,
                16547
            ],
            [
                16562,
                16687
            ],
            [
                16687,
                16693
            ],
            [
                16725,
                16800
            ],
            [
                16800,
                16813
            ],
            [
                16817,
                16820
            ],
            [
                16839,
                16841
            ],
            [
                16841,
                16922
            ],
            [
                16926,
                16936
            ],
            [
                16943,
                17020
            ],
            [
                17030,
                17037
            ],
            [
                17105,
                17106
            ],
            [
                17107,
                17119
            ],
            [
                17129,
                17160
            ],
            [
                17176,
                17183
            ],
            [
                17251,
                17253
            ],
            [
                17253,
                17282
            ],
            [
                17282,
                17288
            ],
            [
                17298,
                17339
            ],
            [
                17619,
                17696
            ],
            [
                17711,
                17719
            ],
            [
                17719,
                17805
            ],
            [
                17837,
                17874
            ],
            [
                17904,
                17915
            ],
            [
                17928,
                17943
            ],
            [
                17945,
                17953
            ],
            [
                17953,
                18000
            ],
            [
                18006,
                18008
            ],
            [
                18008,
                18131
            ],
            [
                18131,
                18178
            ],
            [
                18181,
                18200
            ],
            [
                18203,
                18228
            ],
            [
                18228,
                18259
            ],
            [
                18269,
                18313
            ],
            [
                18325,
                18342
            ],
            [
                18451,
                18535
            ],
            [
                18606,
                18650
            ],
            [
                18650,
                18684
            ],
            [
                18684,
                18712
            ],
            [
                18712,
                18741
            ],
            [
                18745,
                18775
            ],
            [
                18775,
                18852
            ],
            [
                18852,
                18893
            ],
            [
                18893,
                18912
            ],
            [
                18912,
                18934
            ],
            [
                18934,
                19012
            ],
            [
                19012,
                19050
            ],
            [
                19050,
                19067
            ],
            [
                19179,
                19230
            ],
            [
                19255,
                19257
            ],
            [
                19257,
                19288
            ],
            [
                19292,
                19303
            ],
            [
                19316,
                19319
            ],
            [
                19323,
                19344
            ],
            [
                19344,
                19387
            ],
            [
                19405,
                19407
            ],
            [
                19407,
                19492
            ],
            [
                19492,
                19545
            ],
            [
                19546,
                19584
            ],
            [
                19584,
                19601
            ],
            [
                19620,
                19622
            ],
            [
                19622,
                19649
            ],
            [
                19683,
                19684
            ],
            [
                19669,
                19682
            ],
            [
                19685,
                19703
            ],
            [
                19748,
                19749
            ],
            [
                19875,
                19908
            ],
            [
                19959,
                19970
            ],
            [
                19975,
                19985
            ],
            [
                19985,
                20017
            ],
            [
                20027,
                20029
            ],
            [
                20054,
                20092
            ],
            [
                20104,
                20113
            ],
            [
                20119,
                20129
            ],
            [
                20129,
                20183
            ],
            [
                20184,
                20189
            ],
            [
                20214,
                20240
            ],
            [
                20206,
                20209
            ],
            [
                20264,
                20266
            ],
            [
                20266,
                20342
            ],
            [
                20347,
                20398
            ],
            [
                20399,
                20438
            ],
            [
                20448,
                20450
            ],
            [
                20461,
                20471
            ],
            [
                20471,
                20567
            ],
            [
                20577,
                20588
            ],
            [
                20590,
                20603
            ],
            [
                20609,
                20644
            ],
            [
                20644,
                20703
            ],
            [
                20703,
                20750
            ],
            [
                20750,
                20804
            ],
            [
                20880,
                20919
            ],
            [
                20919,
                20967
            ],
            [
                20967,
                21001
            ],
            [
                21001,
                21081
            ],
            [
                21081,
                21084
            ],
            [
                21117,
                21150
            ],
            [
                21150,
                21191
            ],
            [
                21191,
                21200
            ],
            [
                21202,
                21217
            ],
            [
                21217,
                21234
            ],
            [
                21307,
                21309
            ],
            [
                21363,
                21368
            ],
            [
                21370,
                21383
            ],
            [
                21383,
                21399
            ],
            [
                21399,
                21468
            ],
            [
                21571,
                21677
            ],
            [
                21677,
                21698
            ],
            [
                21698,
                21702
            ],
            [
                21722,
                21724
            ],
            [
                21752,
                21868
            ],
            [
                21871,
                21933
            ],
            [
                22006,
                22008
            ],
            [
                22008,
                22016
            ],
            [
                22062,
                22101
            ],
            [
                22119,
                22121
            ],
            [
                22121,
                22133
            ],
            [
                22145,
                22237
            ],
            [
                22237,
                22240
            ],
            [
                22246,
                22258
            ],
            [
                22298,
                22366
            ],
            [
                22458,
                22481
            ],
            [
                22433,
                22440
            ],
            [
                22401,
                22404
            ],
            [
                22484,
                22507
            ],
            [
                22507,
                22538
            ],
            [
                22572,
                22618
            ],
            [
                22619,
                22650
            ],
            [
                22652,
                22659
            ],
            [
                22659,
                22734
            ],
            [
                22734,
                22749
            ],
            [
                22749,
                22790
            ],
            [
                22790,
                22791
            ],
            [
                22808,
                22869
            ],
            [
                22869,
                22936
            ],
            [
                22936,
                22962
            ],
            [
                22962,
                22996
            ],
            [
                23004,
                23007
            ],
            [
                23007,
                23051
            ],
            [
                23078,
                23081
            ],
            [
                23082,
                23098
            ],
            [
                23111,
                23113
            ],
            [
                23142,
                23148
            ],
            [
                23154,
                23171
            ],
            [
                23171,
                23201
            ],
            [
                23201,
                23262
            ],
            [
                23262,
                23273
            ],
            [
                23282,
                23315
            ],
            [
                23315,
                23358
            ],
            [
                23358,
                23403
            ],
            [
                23403,
                23443
            ],
            [
                23452,
                23454
            ],
            [
                23474,
                23483
            ],
            [
                23483,
                23492
            ],
            [
                23497,
                23533
            ],
            [
                23533,
                23563
            ],
            [
                23563,
                23599
            ],
            [
                23603,
                23609
            ],
            [
                23611,
                23622
            ],
            [
                23622,
                23625
            ],
            [
                23628,
                23660
            ],
            [
                23660,
                23691
            ],
            [
                23691,
                23750
            ],
            [
                23750,
                23850
            ],
            [
                23914,
                23982
            ],
            [
                24111,
                24203
            ],
            [
                24203,
                24223
            ],
            [
                24223,
                24269
            ],
            [
                24269,
                24314
            ],
            [
                24314,
                24376
            ],
            [
                24376,
                24436
            ],
            [
                24487,
                24497
            ],
            [
                24497,
                24539
            ],
            [
                24545,
                24650
            ],
            [
                24708,
                24824
            ],
            [
                24824,
                24839
            ],
            [
                24840,
                24863
            ],
            [
                24863,
                24878
            ],
            [
                24925,
                25007
            ],
            [
                25042,
                25051
            ],
            [
                25051,
                25103
            ],
            [
                25103,
                25190
            ],
            [
                25190,
                25243
            ],
            [
                25243,
                25292
            ],
            [
                25292,
                25320
            ],
            [
                25342,
                25344
            ],
            [
                25344,
                25413
            ],
            [
                25425,
                25427
            ],
            [
                25427,
                25445
            ],
            [
                25452,
                25549
            ],
            [
                25560,
                25562
            ],
            [
                25604,
                25616
            ],
            [
                25562,
                25598
            ],
            [
                25671,
                25743
            ],
            [
                25752,
                25838
            ],
            [
                25845,
                25871
            ],
            [
                25871,
                25972
            ],
            [
                25979,
                25986
            ],
            [
                25972,
                25974
            ],
            [
                25992,
                26019
            ],
            [
                26025,
                26027
            ],
            [
                26080,
                26081
            ]
        ],
        "row_chars": [
            [
                0,
                166
            ],
            [
                166,
                288
            ],
            [
                288,
                340
            ],
            [
                340,
                533
            ],
            [
                533,
                667
            ],
            [
                667,
                884
            ],
            [
                884,
                959
            ],
            [
                959,
                1048
            ],
            [
                1048,
                1121
            ],
            [
                1121,
                1286
            ],
            [
                1286,
                1516
            ],
            [
                1516,
                1809
            ],
            [
                1809,
                1841
            ],
            [
                1841,
                1902
            ],
            [
                1902,
                2136
            ],
            [
                2136,
                2180
            ],
            [
                2180,
                2367
            ],
            [
                2367,
                2612
            ],
            [
                2612,
                2785
            ],
            [
                2785,
                2821
            ],
            [
                2821,
                2901
            ],
            [
                2901,
                3064
            ],
            [
                3064,
                3151
            ],
            [
                3151,
                3222
            ],
            [
                3222,
                3315
            ],
            [
                3315,
                3420
            ],
            [
                3420,
                3517
            ],
            [
                3517,
                3695
            ],
            [
                3695,
                3862
            ],
            [
                3862,
                3912
            ],
            [
                3912,
                3959
            ],
            [
                3959,
                4017
            ],
            [
                4017,
                4101
            ],
            [
                4101,
                4162
            ],
            [
                4162,
                4206
            ],
            [
                4206,
                4314
            ],
            [
                4314,
                4365
            ],
            [
                4365,
                4496
            ],
            [
                4496,
                4582
            ],
            [
                4582,
                4781
            ],
            [
                4781,
                4915
            ],
            [
                4915,
                5071
            ],
            [
                5071,
                5309
            ],
            [
                5309,
                5419
            ],
            [
                5419,
                5627
            ],
            [
                5627,
                5679
            ],
            [
                5679,
                5753
            ],
            [
                5753,
                5953
            ],
            [
                5953,
                6021
            ],
            [
                6021,
                6086
            ],
            [
                6086,
                6196
            ],
            [
                6196,
                6256
            ],
            [
                6256,
                6429
            ],
            [
                6429,
                6550
            ],
            [
                6550,
                6647
            ],
            [
                6647,
                6734
            ],
            [
                6734,
                6881
            ],
            [
                6881,
                7069
            ],
            [
                7069,
                7148
            ],
            [
                7148,
                7224
            ],
            [
                7224,
                7419
            ],
            [
                7419,
                7584
            ],
            [
                7584,
                7681
            ],
            [
                7681,
                7723
            ],
            [
                7723,
                7816
            ],
            [
                7816,
                7912
            ],
            [
                7912,
                7951
            ],
            [
                7951,
                8131
            ],
            [
                8131,
                8290
            ],
            [
                8290,
                8353
            ],
            [
                8353,
                8608
            ],
            [
                8608,
                8651
            ],
            [
                8651,
                8724
            ],
            [
                8724,
                8906
            ],
            [
                8906,
                8947
            ],
            [
                8947,
                8975
            ],
            [
                8975,
                9089
            ],
            [
                9089,
                9123
            ],
            [
                9123,
                9218
            ],
            [
                9218,
                9328
            ],
            [
                9328,
                9543
            ],
            [
                9543,
                9652
            ],
            [
                9652,
                9724
            ],
            [
                9724,
                9770
            ],
            [
                9770,
                9874
            ],
            [
                9874,
                9969
            ],
            [
                9969,
                10011
            ],
            [
                10011,
                10023
            ],
            [
                10023,
                10091
            ],
            [
                10091,
                10218
            ],
            [
                10218,
                10270
            ],
            [
                10270,
                10279
            ],
            [
                10279,
                10321
            ],
            [
                10321,
                10436
            ],
            [
                10436,
                10688
            ],
            [
                10688,
                10891
            ],
            [
                10891,
                10963
            ],
            [
                10963,
                11046
            ],
            [
                11046,
                11110
            ],
            [
                11110,
                11156
            ],
            [
                11156,
                11211
            ],
            [
                11211,
                11304
            ],
            [
                11304,
                11356
            ],
            [
                11356,
                11393
            ],
            [
                11393,
                11410
            ],
            [
                11410,
                11512
            ],
            [
                11512,
                11530
            ],
            [
                11530,
                11538
            ],
            [
                11538,
                11557
            ],
            [
                11557,
                11578
            ],
            [
                11578,
                11594
            ],
            [
                11594,
                11648
            ],
            [
                11648,
                11747
            ],
            [
                11747,
                11803
            ],
            [
                11803,
                11846
            ],
            [
                11846,
                11876
            ],
            [
                11876,
                11899
            ],
            [
                11899,
                12027
            ],
            [
                12027,
                12073
            ],
            [
                12073,
                12129
            ],
            [
                12129,
                12204
            ],
            [
                12204,
                12247
            ],
            [
                12247,
                12347
            ],
            [
                12347,
                12389
            ],
            [
                12389,
                12461
            ],
            [
                12461,
                12524
            ],
            [
                12524,
                12628
            ],
            [
                12628,
                12679
            ],
            [
                12679,
                12720
            ],
            [
                12720,
                12822
            ],
            [
                12822,
                13010
            ],
            [
                13010,
                13174
            ],
            [
                13174,
                13247
            ],
            [
                13247,
                13289
            ],
            [
                13289,
                13385
            ],
            [
                13385,
                13429
            ],
            [
                13429,
                13492
            ],
            [
                13492,
                13557
            ],
            [
                13557,
                13826
            ],
            [
                13826,
                13849
            ],
            [
                13849,
                13872
            ],
            [
                13872,
                13928
            ],
            [
                13928,
                13990
            ],
            [
                13990,
                14047
            ],
            [
                14047,
                14290
            ],
            [
                14290,
                14610
            ],
            [
                14610,
                14813
            ],
            [
                14813,
                14923
            ],
            [
                14923,
                14963
            ],
            [
                14963,
                15093
            ],
            [
                15093,
                15136
            ],
            [
                15136,
                15179
            ],
            [
                15179,
                15288
            ],
            [
                15288,
                15421
            ],
            [
                15421,
                15528
            ],
            [
                15528,
                15556
            ],
            [
                15556,
                15605
            ],
            [
                15605,
                15632
            ],
            [
                15632,
                15730
            ],
            [
                15730,
                15900
            ],
            [
                15900,
                15981
            ],
            [
                15981,
                16182
            ],
            [
                16182,
                16294
            ],
            [
                16294,
                16315
            ],
            [
                16315,
                16368
            ],
            [
                16368,
                16432
            ],
            [
                16432,
                16529
            ],
            [
                16529,
                16687
            ],
            [
                16687,
                16800
            ],
            [
                16800,
                16841
            ],
            [
                16841,
                17107
            ],
            [
                17107,
                17253
            ],
            [
                17253,
                17282
            ],
            [
                17282,
                17719
            ],
            [
                17719,
                17953
            ],
            [
                17953,
                18008
            ],
            [
                18008,
                18131
            ],
            [
                18131,
                18228
            ],
            [
                18228,
                18343
            ],
            [
                18343,
                18451
            ],
            [
                18451,
                18535
            ],
            [
                18535,
                18606
            ],
            [
                18606,
                18650
            ],
            [
                18650,
                18684
            ],
            [
                18684,
                18712
            ],
            [
                18712,
                18775
            ],
            [
                18775,
                18852
            ],
            [
                18852,
                18893
            ],
            [
                18893,
                18912
            ],
            [
                18912,
                18934
            ],
            [
                18934,
                19012
            ],
            [
                19012,
                19050
            ],
            [
                19050,
                19069
            ],
            [
                19069,
                19137
            ],
            [
                19137,
                19179
            ],
            [
                19179,
                19257
            ],
            [
                19257,
                19288
            ],
            [
                19288,
                19344
            ],
            [
                19344,
                19407
            ],
            [
                19407,
                19492
            ],
            [
                19492,
                19546
            ],
            [
                19546,
                19584
            ],
            [
                19584,
                19622
            ],
            [
                19622,
                19750
            ],
            [
                19750,
                19875
            ],
            [
                19875,
                19909
            ],
            [
                19909,
                19959
            ],
            [
                19959,
                19985
            ],
            [
                19985,
                20029
            ],
            [
                20029,
                20129
            ],
            [
                20129,
                20184
            ],
            [
                20184,
                20266
            ],
            [
                20266,
                20399
            ],
            [
                20399,
                20471
            ],
            [
                20471,
                20644
            ],
            [
                20644,
                20703
            ],
            [
                20703,
                20750
            ],
            [
                20750,
                20807
            ],
            [
                20807,
                20858
            ],
            [
                20858,
                20880
            ],
            [
                20880,
                20919
            ],
            [
                20919,
                20967
            ],
            [
                20967,
                21001
            ],
            [
                21001,
                21081
            ],
            [
                21081,
                21150
            ],
            [
                21150,
                21191
            ],
            [
                21191,
                21217
            ],
            [
                21217,
                21309
            ],
            [
                21309,
                21363
            ],
            [
                21363,
                21383
            ],
            [
                21383,
                21399
            ],
            [
                21399,
                21471
            ],
            [
                21471,
                21518
            ],
            [
                21518,
                21571
            ],
            [
                21571,
                21677
            ],
            [
                21677,
                21698
            ],
            [
                21698,
                21724
            ],
            [
                21724,
                21752
            ],
            [
                21752,
                21933
            ],
            [
                21933,
                22008
            ],
            [
                22008,
                22121
            ],
            [
                22121,
                22237
            ],
            [
                22237,
                22366
            ],
            [
                22366,
                22507
            ],
            [
                22507,
                22619
            ],
            [
                22619,
                22659
            ],
            [
                22659,
                22734
            ],
            [
                22734,
                22749
            ],
            [
                22749,
                22790
            ],
            [
                22790,
                22869
            ],
            [
                22869,
                22936
            ],
            [
                22936,
                22962
            ],
            [
                22962,
                23007
            ],
            [
                23007,
                23113
            ],
            [
                23113,
                23142
            ],
            [
                23142,
                23171
            ],
            [
                23171,
                23201
            ],
            [
                23201,
                23262
            ],
            [
                23262,
                23315
            ],
            [
                23315,
                23358
            ],
            [
                23358,
                23403
            ],
            [
                23403,
                23483
            ],
            [
                23483,
                23533
            ],
            [
                23533,
                23563
            ],
            [
                23563,
                23603
            ],
            [
                23603,
                23622
            ],
            [
                23622,
                23660
            ],
            [
                23660,
                23691
            ],
            [
                23691,
                23750
            ],
            [
                23750,
                23850
            ],
            [
                23850,
                23877
            ],
            [
                23877,
                23984
            ],
            [
                23984,
                24069
            ],
            [
                24069,
                24111
            ],
            [
                24111,
                24203
            ],
            [
                24203,
                24223
            ],
            [
                24223,
                24269
            ],
            [
                24269,
                24314
            ],
            [
                24314,
                24376
            ],
            [
                24376,
                24454
            ],
            [
                24454,
                24487
            ],
            [
                24487,
                24497
            ],
            [
                24497,
                24824
            ],
            [
                24824,
                24863
            ],
            [
                24863,
                24878
            ],
            [
                24878,
                24925
            ],
            [
                24925,
                25051
            ],
            [
                25051,
                25103
            ],
            [
                25103,
                25190
            ],
            [
                25190,
                25243
            ],
            [
                25243,
                25292
            ],
            [
                25292,
                25344
            ],
            [
                25344,
                25427
            ],
            [
                25427,
                25562
            ],
            [
                25562,
                25640
            ],
            [
                25640,
                25871
            ],
            [
                25871,
                25972
            ],
            [
                25972,
                26081
            ]
        ]
    },
    "abridged": {
        "text": "On Friday 21st June, the Board of the Railway sat, as it did every Friday. All the members were there, as it had been understood that the chairman was to make a special statement. Even Sir Felix had come, being very anxious to buy and sell, and not as yet having had an opportunity of realising his golden hopes, although he had paid Mr. Melmotte a thousand pounds.\nThe Board always met at three, and had generally been dissolved at a quarter past. Lord Alfred and Mr. Cohenlupe sat next to Mr. Melmotte. Paul Montague usually sat immediately below, with Miles Grendall opposite him; but on this occasion Lord Nidderdale and Carbury took these places.\nMontague was out of favour, having insisted on giving vent to certain doubts at the last meeting but one, and making himself very disagreeable to the great chairman. What nuisance can be so great to a man busied with immense affairs, as to have to explain small details to men incapable of understanding them?\nBut Montague had stood to his guns. He felt very strongly, he said, that the directors needed to know more than they did know. Lord Alfred had declared that he did not agree.\n\"If anybody don't understand, it's his own fault,\" said Mr. Cohenlupe. But Paul would not give way, and it was understood that Mr. Melmotte would therefore make a statement.\nThe \"Boards\" always began with the reading of a record of the last meeting. This was done by Miles Grendall; and the record was supposed to have been written by him. But Montague had discovered that the statement was written by a satellite of Melmotte's from Abchurch Lane, who was not at the meeting. When he asked Miles about this, Miles had given a somewhat evasive reply.\n\"A cussed deal of trouble and all that, you know! He's used to it.\"\nSo Montague had spoken on the subject both to Nidderdale and Felix Carbury.\n\"He couldn't do it,\" Nidderdale had said. \"I don't think I'd bully him if I were you. He only gets 500 a year.\" With Felix Carbury, Montague had as little success. Sir Felix hated Miles Grendall, had detected him cheating at cards, had resolved to expose him - and had then been afraid to do so. He had not mentioned the affair again, and had gradually fallen back into the habit of playing at the club, since they were now playing whist instead of loo.\nThe \"Board\" now commenced as usual: Miles read the short record out of the book, stumbling over every other word, so that if there had been anything to understand no one could have understood it.\n\"Gentlemen,\" said Mr. Melmotte, in his usual hurried way, \"shall I sign the record?\"\nPaul Montague rose to object; but Melmotte had made his scrawl, and was already deep in conversation with Mr. Cohenlupe.\nMelmotte, however, had watched him. He perceived that Montague had made a little struggle and had been cowed; and he knew how hard it is for one man to persevere against five or six. Nidderdale was filliping bits of paper across the table at Carbury. The other men were unconcerned, so Melmotte went on talking to Cohenlupe.\nThen Paul put both his hands upon the table, intending to rise and ask some perplexing question. Melmotte saw this also and was upon his legs first.\n\"Gentlemen,\" said Mr. Melmotte, \"it may perhaps be as well if I take this occasion of saying a few words to you about the affairs of the company.\" Then, instead of going on with his statement, he sat down again, and began to turn over some voluminous papers very slowly, whispering a word or two every now and then to Mr. Cohenlupe. Nidderdale and Carbury filliped their paper pellets backwards and forwards. Montague sat ready to listen, feeling that he was bound to be silent. It seemed that Melmotte had much to say to Cohenlupe, and Cohenlupe much to say to Melmotte. Cohenlupe had never before shown such powers of conversation.\nNidderdale didn't quite understand it. He had been there twenty minutes, and suddenly remembered that the Beargarden would now be open.\n\"I suppose that's about all,\" he said, looking at Melmotte.\n\"Well, perhaps as your lordship is in a hurry, and as my lord here is engaged elsewhere,\" - turning round to Lord Alfred, who had not uttered a syllable - \"we had better adjourn this meeting for another week.\"\n\"I cannot allow that,\" said Paul Montague.\n\"I have been discussing certain circumstances with our Chairman,\" said Cohenlupe, \"and I must say that it is not expedient just at present to go into matters too freely.\"\n\"My lords and gentlemen,\" said Melmotte. \"I hope that you trust me.\"\nLord Alfred, bowing, muttered something about absolute confidence.\n\"Hear, hear,\" said Mr. Cohenlupe.\n\"All right,\" said Lord Nidderdale.\n\"I trust,\" said the Chairman, \"that my young friend, Sir Felix, doubts neither my discretion nor my ability.\"\n\"Oh dear, no, not at all,\" said the baronet, much flattered, and quite prepared to support the Chairman on any matter whatever.\n\"My Lords and Gentlemen,\" continued Melmotte, \"I am delighted to receive this expression of your confidence. If I know anything in the world I know something of commercial matters. I am able to tell you that we are prospering. I do not know that greater prosperity has ever been achieved in a shorter time by a commercial company. I think our friend here, Mr. Montague, should be as aware of that as any gentleman.\"\n\"What do you mean by that, Mr. Melmotte?\" asked Paul.\n\"Your firm in San Francisco, sir, know very well how the affairs of the Company are being transacted here. No doubt you are in correspondence with Mr. Fisker. Ask him. The telegraph wires are open to you, sir. But, my Lords and Gentlemen, in affairs of this nature great discretion is necessary. On behalf of our shareholders, I think it expedient that any general statement should be postponed for a short time, and I flatter myself that in that opinion I shall carry the majority of this Board with me. I now move that this meeting be adjourned to this day week.\"\n\"I second that motion,\" said Lord Alfred.\n\"I understood that we were to have a statement,\" said Montague.\n\"You've had a statement,\" said Mr. Cohenlupe.\n\"I will put my motion to the vote,\" said the Chairman.\n\"I shall move an amendment,\" said Paul, determined not to be silenced.\n\"There is nobody to second it,\" said Mr. Cohenlupe.\n\"How do you know? I shall ask Lord Nidderdale to second it.\"\n\"Oh, gracious me! Don't ask me. I've got to go away. I have indeed.\"\n\"At any rate I claim the right of saying a few words,\" continued Paul. \"As we sit here as directors and will be held responsible as such by the public, we ought to know what is being done. We ought to know where the shares really are. I for one do not even know what scrip has been issued.\"\n\"You've bought and sold enough to know something about it,\" said Melmotte.\nPaul Montague became very red in the face. \"I began,\" he said, \"by putting what was to me a large sum of money into the affair.\"\n\"That's more than I know,\" said Melmotte. \"Whatever shares you have, were issued at San Francisco, and not here.\"\n\"I have taken nothing that I haven't paid for,\" said Montague. \"Nor have I yet had allotted to me anything like the number of shares which my capital would represent. But I did not intend to speak of my own concerns.\"\n\"It looks very like it,\" said Cohenlupe.\n\"So far from it that I am prepared to risk the loss of everything I have in the world. I am determined to know what is being done with the shares, or to tell the world at large that I, one of the directors, do not in truth know anything about it. I intend to do what is right.\"\n\"The gentleman had better resign his seat at this Board,\" said Melmotte. \"There will be no difficulty about that.\"\n\"Bound up as I am with Fisker and Montague in California I fear that there will be difficulty.\"\n\"Not in the least,\" continued the Chairman. \"You need only give your resignation and the thing is done. I had intended, gentlemen, to propose an addition to our number. When I name to you a gentleman, personally known to many of you, and esteemed as a man of business, probity, and fortune - I mean Mr. Longestaffe of Caversham-\"\n\"Young Dolly, or old?\" asked Lord Nidderdale.\n\"I mean Mr. Adolphus Longestaffe, senior. I am sure that you will all be glad to welcome him among you. I had thought to strengthen our number by this addition. But if Mr. Montague is determined to leave us, it will be my pleasing duty to move that Adolphus Longestaffe Esquire should take his place. If on reconsideration Mr. Montague shall determine to remain with us - and I sincerely hope that he will - then I shall move that Mr. Longstaffe be added to our number as an additional director.\" Mr. Melmotte immediately left the chair, so as to show that the business of the Board was closed for that day.\nPaul went up to him and took him by the sleeve, signifying that he wished to speak before they parted.\n\"Certainly,\" said the great man, bowing. \"Carbury,\" he said, looking round on the young baronet with his blandest smile, \"if you are not in a hurry, wait a moment for me. I have a word to say before you go. Now, Mr. Montague, what can I do for you?\"\nPaul began to express again the opinion which he had already expressed at the table. But Melmotte stopped him with less courtesy than before.\n\"The thing is, Mr. Montague - you think you know more of this matter than I do.\"\n\"Not at all, Mr. Melmotte.\"\n\"And I think that I know more of it than you do. Either of us may be right. But as I don't intend to give way to you, perhaps the less we speak together about it the better. As long as you are hostile to me, I can't help you; and so good afternoon.\"\nThen, without giving Montague the possibility of a reply, he escaped into an inner room and shut the door behind him. After a few moments, he put out his head and beckoned to Sir Felix Carbury. Paul Montague slowly made his way out into the courtyard.\nSir Felix had come intending to suggest to the Chairman that having paid his thousand pounds he should like to have a few shares to go on with. He was very nearly penniless, and had negotiated, or lost at cards, all the I.O.U.'s which were of any value. He still had a pocket-book full of those issued by Miles Grendall; but it was now understood at the Beargarden that no one was to be called upon to take them except Miles himself.\nBeyond this, Felix had lately been forced to issue an I.O.U. or two himself. His case certainly was hard. He had paid a thousand pounds down in hard cash, in the belief that he would thus put himself in the way of making a continual income. He understood that as a director he would be always entitled to buy shares at par, and be able to sell them at the market price - giving him from ten to twenty per cent profit. He would have nothing to do but to buy and sell. He was told that Lord Alfred was allowed to do it to a small extent; and that Melmotte was doing it to an enormous extent. But before he could do it he must get something - he hardly knew what - out of Melmotte's hands. Melmotte certainly did not seem to shun him, and therefore there could be no danger about the shares.\n\"I am delighted to see you here,\" said Melmotte, shaking him cordially by the hand. \"There's nothing like attending to business. You should be here every Friday.\"\n\"I will,\" said the baronet.\n\"And let me see you sometimes at my place in Abchurch Lane. I can put you more in the way of understanding things there than I can here. This is all a mere formal sort of thing. You can see that.\"\n\"Oh yes, I see that.\"\n\"We are obliged to have this kind of thing for men like that fellow Montague. By-the-bye, is he a friend of yours?\"\n\"Not particularly.\"\n\"If he makes himself disagreeable, he'll have to go. But never mind him at present. Did your mother tell you what I said to her?\"\n\"No, Mr. Melmotte,\" said Sir Felix, staring.\n\"I was talking to her about you, and I thought that perhaps she might have told you. This is all nonsense, you know, about you and Marie.\"\nSir Felix looked into the man's face. It was not savage. But there had suddenly come into it a heavy look of determined purpose.\n\"You understand that; don't you?\" continued Melmotte. \"It's all d___ nonsense. You haven't got a brass farthing. You're just living on your mother, and she's not well off. How can you suppose that I shall give my girl to you?\"\nFelix did not dare to contradict him. Yet when the man told him that he had not a brass farthing he thought of his thousand pounds which were now in the man's pocket.\n\"You're a baronet, and that's about all,\" said Melmotte. \"The Carbury property, which is a very small thing, belongs to a distant cousin who may leave it however he pleases; and who isn't much older than you are yourself.\"\n\"Oh, come, Mr. Melmotte; he's a great deal older than me.\"\n\"It wouldn't matter if he were as old as Adam. The thing is out of the question, and you must drop it. She is going to marry Lord Nidderdale. She was engaged to him before you ever saw her. What do you expect to get by it?\"\nSir Felix had not the courage to say that he expected to get the girl he loved. But he was obliged to say something. \"I suppose it's the old story,\" he said.\n\"Just so; the old story. You want my money. Come; out with it. Is not that it? When we understand each other I'll put you in the way of making money. You give me your written promise that you'll drop this affair with Marie, and you shan't want for money.\"\n\"A written promise!\"\n\"Yes. And then I'll put you in the way of doing so well with these shares that you shall be able to marry any other girl you please - or to live without marrying, which you'll find to be better.\"\nFelix considered this. Marriage had not specially recommended itself to him. A few horses, Ruby Ruggles or any other beauty, and life at the Beargarden were much more to his taste. And he was quite aware that he might find himself possessed of the wife without the money. Marie might be mistaken about the amount settled on her - or she might be lying. If he were sure of making money, the loss of Marie would not break his heart.\nBut then also Melmotte might be lying. \"By-the-bye, Mr. Melmotte,\" said he, \"could you let me have those shares?\"\n\"What shares?\" And the heavy brow became still heavier.\n\"I gave you a thousand pounds, and I was to have ten shares.\"\n\"You must come about that on the proper day, to the proper place.\"\n\"When is the proper day?\"\n\"It is the twentieth of each month.\" Sir Felix looked very blank at hearing this, since it was now the twenty-first. \"Do you need a little money?\"\n\"Well, I do,\" said Sir Felix. \"A lot of fellows owe me money, but it's so hard to get it.\"\n\"That tells of gambling,\" said Mr. Melmotte. \"You think I'd give my girl to a gambler?\"\n\"Nidderdale's in it quite as thick as I am.\"\n\"Nidderdale has a settled property which he cannot destroy. But don't be such a fool as to argue with me. You won't get anything by it. If you'll write that letter here now-\"\n\"What; to Marie?\"\n\"No, not to Marie at all; but to me. It need never be shown to her. If you'll do that I'll stick to you and make a man of you. And if you want a couple of hundred pounds I'll give you a cheque for it before you leave the room. But if my daughter were to marry you, she'd never have a single shilling.\"\n\"And couldn't you manage that I should have the shares before the twentieth of next month?\"\n\"I'll see about it. Perhaps I could let you have a few of my own. At any rate I won't see you short of money.\"\nThe terms were enticing and the letter was of course written. Melmotte himself dictated the words, which were not romantic:\nDear Sir,\nIn consideration of the offers made by you, and on a clear understanding that such a marriage would be disagreeable to you and to the lady's mother, I hereby declare and promise that I will not renew my suit to the young lady, which I hereby altogether renounce.\nI am, Dear Sir,\nYour obedient Servant,\nFelix Carbury.\nThe letter was dated 21st July, and bore the printed address of the offices of the Railway.\n\"You'll give me that cheque for 200, Mr. Melmotte?\" The financier hesitated for a moment, but did give the baronet the cheque as promised. \"And you'll see about letting me have those shares?\"\n\"You can come to me in Abchurch Lane, you know.\" Sir Felix said that he would.\nAs he went westward towards the Beargarden, the baronet was not happy. Ignorant as he was about the duties of a gentleman, indifferent as he was to the feelings of others, still he felt ashamed. He knew that he was treating the girl very badly. He tried to console himself by reflecting that his writing such a letter would not prevent his running away with the girl, should he, on consideration, find it worth his while to do so.\nThat night he was again playing at the Beargarden, and he lost a great part of Mr. Melmotte's money. In fact he lost much more than the 200; but he paid in I.O.U.s.",
        "paragraph_chars": [
            [
                0,
                366
            ],
            [
                366,
                652
            ],
            [
                652,
                962
            ],
            [
                962,
                1137
            ],
            [
                1137,
                1311
            ],
            [
                1311,
                1687
            ],
            [
                1687,
                1755
            ],
            [
                1755,
                1831
            ],
            [
                1831,
                2285
            ],
            [
                2285,
                2481
            ],
            [
                2481,
                2566
            ],
            [
                2566,
                2687
            ],
            [
                2687,
                3012
            ],
            [
                3012,
                3161
            ],
            [
                3161,
                3795
            ],
            [
                3795,
                3931
            ],
            [
                3931,
                3991
            ],
            [
                3991,
                4201
            ],
            [
                4201,
                4244
            ],
            [
                4244,
                4415
            ],
            [
                4415,
                4484
            ],
            [
                4484,
                4551
            ],
            [
                4551,
                4585
            ],
            [
                4585,
                4620
            ],
            [
                4620,
                4730
            ],
            [
                4730,
                4858
            ],
            [
                4858,
                5274
            ],
            [
                5274,
                5328
            ],
            [
                5328,
                5894
            ],
            [
                5894,
                5936
            ],
            [
                5936,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6101
            ],
            [
                6101,
                6172
            ],
            [
                6172,
                6224
            ],
            [
                6224,
                6285
            ],
            [
                6285,
                6354
            ],
            [
                6354,
                6645
            ],
            [
                6645,
                6720
            ],
            [
                6720,
                6849
            ],
            [
                6849,
                6963
            ],
            [
                6963,
                7181
            ],
            [
                7181,
                7222
            ],
            [
                7222,
                7500
            ],
            [
                7500,
                7615
            ],
            [
                7615,
                7711
            ],
            [
                7711,
                8041
            ],
            [
                8041,
                8087
            ],
            [
                8087,
                8695
            ],
            [
                8695,
                8798
            ],
            [
                8798,
                9048
            ],
            [
                9048,
                9190
            ],
            [
                9190,
                9271
            ],
            [
                9271,
                9299
            ],
            [
                9299,
                9549
            ],
            [
                9549,
                9801
            ],
            [
                9801,
                10235
            ],
            [
                10235,
                11024
            ],
            [
                11024,
                11187
            ],
            [
                11187,
                11215
            ],
            [
                11215,
                11412
            ],
            [
                11412,
                11434
            ],
            [
                11434,
                11550
            ],
            [
                11550,
                11570
            ],
            [
                11570,
                11700
            ],
            [
                11700,
                11745
            ],
            [
                11745,
                11884
            ],
            [
                11884,
                12013
            ],
            [
                12013,
                12240
            ],
            [
                12240,
                12407
            ],
            [
                12407,
                12630
            ],
            [
                12630,
                12689
            ],
            [
                12689,
                12913
            ],
            [
                12913,
                13071
            ],
            [
                13071,
                13327
            ],
            [
                13327,
                13348
            ],
            [
                13348,
                13544
            ],
            [
                13544,
                13975
            ],
            [
                13975,
                14089
            ],
            [
                14089,
                14145
            ],
            [
                14145,
                14207
            ],
            [
                14207,
                14274
            ],
            [
                14274,
                14300
            ],
            [
                14300,
                14447
            ],
            [
                14447,
                14538
            ],
            [
                14538,
                14626
            ],
            [
                14626,
                14671
            ],
            [
                14671,
                14846
            ],
            [
                14846,
                14864
            ],
            [
                14864,
                15166
            ],
            [
                15166,
                15258
            ],
            [
                15258,
                15369
            ],
            [
                15369,
                15493
            ],
            [
                15493,
                15503
            ],
            [
                15503,
                15766
            ],
            [
                15766,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15820
            ],
            [
                15820,
                15912
            ],
            [
                15912,
                16104
            ],
            [
                16104,
                16183
            ],
            [
                16183,
                16614
            ],
            [
                16614,
                16778
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                180
            ],
            [
                180,
                366
            ],
            [
                366,
                449
            ],
            [
                449,
                505
            ],
            [
                505,
                652
            ],
            [
                652,
                818
            ],
            [
                818,
                962
            ],
            [
                962,
                998
            ],
            [
                998,
                1089
            ],
            [
                1089,
                1137
            ],
            [
                1137,
                1208
            ],
            [
                1208,
                1311
            ],
            [
                1311,
                1387
            ],
            [
                1387,
                1477
            ],
            [
                1477,
                1613
            ],
            [
                1613,
                1687
            ],
            [
                1687,
                1737
            ],
            [
                1737,
                1755
            ],
            [
                1755,
                1831
            ],
            [
                1831,
                1873
            ],
            [
                1873,
                1917
            ],
            [
                1917,
                1943
            ],
            [
                1943,
                1995
            ],
            [
                1995,
                2127
            ],
            [
                2127,
                2285
            ],
            [
                2285,
                2481
            ],
            [
                2481,
                2566
            ],
            [
                2566,
                2687
            ],
            [
                2687,
                2723
            ],
            [
                2723,
                2870
            ],
            [
                2870,
                2938
            ],
            [
                2938,
                3012
            ],
            [
                3012,
                3109
            ],
            [
                3109,
                3161
            ],
            [
                3161,
                3308
            ],
            [
                3308,
                3494
            ],
            [
                3494,
                3570
            ],
            [
                3570,
                3640
            ],
            [
                3640,
                3733
            ],
            [
                3733,
                3795
            ],
            [
                3795,
                3834
            ],
            [
                3834,
                3931
            ],
            [
                3931,
                3991
            ],
            [
                3991,
                4201
            ],
            [
                4201,
                4244
            ],
            [
                4244,
                4415
            ],
            [
                4415,
                4456
            ],
            [
                4456,
                4484
            ],
            [
                4484,
                4551
            ],
            [
                4551,
                4585
            ],
            [
                4585,
                4620
            ],
            [
                4620,
                4730
            ],
            [
                4730,
                4858
            ],
            [
                4858,
                4967
            ],
            [
                4967,
                5039
            ],
            [
                5039,
                5085
            ],
            [
                5085,
                5189
            ],
            [
                5189,
                5274
            ],
            [
                5274,
                5316
            ],
            [
                5316,
                5328
            ],
            [
                5328,
                5435
            ],
            [
                5435,
                5487
            ],
            [
                5487,
                5496
            ],
            [
                5496,
                5538
            ],
            [
                5538,
                5624
            ],
            [
                5624,
                5833
            ],
            [
                5833,
                5894
            ],
            [
                5894,
                5936
            ],
            [
                5936,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6101
            ],
            [
                6101,
                6172
            ],
            [
                6172,
                6224
            ],
            [
                6224,
                6242
            ],
            [
                6242,
                6285
            ],
            [
                6285,
                6303
            ],
            [
                6303,
                6317
            ],
            [
                6317,
                6338
            ],
            [
                6338,
                6354
            ],
            [
                6354,
                6425
            ],
            [
                6425,
                6543
            ],
            [
                6543,
                6589
            ],
            [
                6589,
                6645
            ],
            [
                6645,
                6720
            ],
            [
                6720,
                6763
            ],
            [
                6763,
                6849
            ],
            [
                6849,
                6891
            ],
            [
                6891,
                6963
            ],
            [
                6963,
                7026
            ],
            [
                7026,
                7130
            ],
            [
                7130,
                7181
            ],
            [
                7181,
                7222
            ],
            [
                7222,
                7309
            ],
            [
                7309,
                7469
            ],
            [
                7469,
                7500
            ],
            [
                7500,
                7573
            ],
            [
                7573,
                7615
            ],
            [
                7615,
                7711
            ],
            [
                7711,
                7755
            ],
            [
                7755,
                7815
            ],
            [
                7815,
                7880
            ],
            [
                7880,
                8041
            ],
            [
                8041,
                8064
            ],
            [
                8064,
                8087
            ],
            [
                8087,
                8129
            ],
            [
                8129,
                8191
            ],
            [
                8191,
                8248
            ],
            [
                8248,
                8388
            ],
            [
                8388,
                8584
            ],
            [
                8584,
                8695
            ],
            [
                8695,
                8798
            ],
            [
                8798,
                8839
            ],
            [
                8839,
                8969
            ],
            [
                8969,
                9005
            ],
            [
                9005,
                9048
            ],
            [
                9048,
                9133
            ],
            [
                9133,
                9190
            ],
            [
                9190,
                9271
            ],
            [
                9271,
                9299
            ],
            [
                9299,
                9348
            ],
            [
                9348,
                9375
            ],
            [
                9375,
                9473
            ],
            [
                9473,
                9549
            ],
            [
                9549,
                9667
            ],
            [
                9667,
                9743
            ],
            [
                9743,
                9801
            ],
            [
                9801,
                9945
            ],
            [
                9945,
                10027
            ],
            [
                10027,
                10055
            ],
            [
                10055,
                10235
            ],
            [
                10235,
                10296
            ],
            [
                10296,
                10312
            ],
            [
                10312,
                10341
            ],
            [
                10341,
                10476
            ],
            [
                10476,
                10653
            ],
            [
                10653,
                10702
            ],
            [
                10702,
                10825
            ],
            [
                10825,
                10922
            ],
            [
                10922,
                11024
            ],
            [
                11024,
                11108
            ],
            [
                11108,
                11153
            ],
            [
                11153,
                11187
            ],
            [
                11187,
                11215
            ],
            [
                11215,
                11275
            ],
            [
                11275,
                11352
            ],
            [
                11352,
                11393
            ],
            [
                11393,
                11412
            ],
            [
                11412,
                11434
            ],
            [
                11434,
                11512
            ],
            [
                11512,
                11550
            ],
            [
                11550,
                11570
            ],
            [
                11570,
                11623
            ],
            [
                11623,
                11654
            ],
            [
                11654,
                11700
            ],
            [
                11700,
                11745
            ],
            [
                11745,
                11830
            ],
            [
                11830,
                11884
            ],
            [
                11884,
                11922
            ],
            [
                11922,
                11941
            ],
            [
                11941,
                12013
            ],
            [
                12013,
                12047
            ],
            [
                12047,
                12067
            ],
            [
                12067,
                12092
            ],
            [
                12092,
                12126
            ],
            [
                12126,
                12185
            ],
            [
                12185,
                12240
            ],
            [
                12240,
                12278
            ],
            [
                12278,
                12407
            ],
            [
                12407,
                12464
            ],
            [
                12464,
                12630
            ],
            [
                12630,
                12689
            ],
            [
                12689,
                12736
            ],
            [
                12736,
                12792
            ],
            [
                12792,
                12831
            ],
            [
                12831,
                12879
            ],
            [
                12879,
                12913
            ],
            [
                12913,
                12993
            ],
            [
                12993,
                13030
            ],
            [
                13030,
                13071
            ],
            [
                13071,
                13096
            ],
            [
                13096,
                13115
            ],
            [
                13115,
                13134
            ],
            [
                13134,
                13150
            ],
            [
                13150,
                13221
            ],
            [
                13221,
                13327
            ],
            [
                13327,
                13348
            ],
            [
                13348,
                13354
            ],
            [
                13354,
                13544
            ],
            [
                13544,
                13567
            ],
            [
                13567,
                13621
            ],
            [
                13621,
                13725
            ],
            [
                13725,
                13816
            ],
            [
                13816,
                13897
            ],
            [
                13897,
                13975
            ],
            [
                13975,
                14014
            ],
            [
                14014,
                14089
            ],
            [
                14089,
                14104
            ],
            [
                14104,
                14145
            ],
            [
                14145,
                14207
            ],
            [
                14207,
                14274
            ],
            [
                14274,
                14300
            ],
            [
                14300,
                14337
            ],
            [
                14337,
                14417
            ],
            [
                14417,
                14447
            ],
            [
                14447,
                14477
            ],
            [
                14477,
                14538
            ],
            [
                14538,
                14583
            ],
            [
                14583,
                14626
            ],
            [
                14626,
                14671
            ],
            [
                14671,
                14731
            ],
            [
                14731,
                14777
            ],
            [
                14777,
                14807
            ],
            [
                14807,
                14846
            ],
            [
                14846,
                14864
            ],
            [
                14864,
                14901
            ],
            [
                14901,
                14932
            ],
            [
                14932,
                14991
            ],
            [
                14991,
                15091
            ],
            [
                15091,
                15166
            ],
            [
                15166,
                15258
            ],
            [
                15258,
                15278
            ],
            [
                15278,
                15324
            ],
            [
                15324,
                15369
            ],
            [
                15369,
                15431
            ],
            [
                15431,
                15493
            ],
            [
                15493,
                15503
            ],
            [
                15503,
                15766
            ],
            [
                15766,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15820
            ],
            [
                15820,
                15912
            ],
            [
                15912,
                15964
            ],
            [
                15964,
                16051
            ],
            [
                16051,
                16104
            ],
            [
                16104,
                16153
            ],
            [
                16153,
                16183
            ],
            [
                16183,
                16254
            ],
            [
                16254,
                16378
            ],
            [
                16378,
                16428
            ],
            [
                16428,
                16614
            ],
            [
                16614,
                16715
            ],
            [
                16715,
                16778
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                10,
                37
            ],
            [
                38,
                49
            ],
            [
                49,
                53
            ],
            [
                61,
                75
            ],
            [
                75,
                180
            ],
            [
                189,
                328
            ],
            [
                329,
                333
            ],
            [
                334,
                346
            ],
            [
                347,
                364
            ],
            [
                364,
                365
            ],
            [
                366,
                447
            ],
            [
                447,
                449
            ],
            [
                449,
                482
            ],
            [
                503,
                505
            ],
            [
                505,
                518
            ],
            [
                527,
                578
            ],
            [
                579,
                583
            ],
            [
                584,
                604
            ],
            [
                605,
                609
            ],
            [
                621,
                624
            ],
            [
                633,
                637
            ],
            [
                644,
                651
            ],
            [
                652,
                660
            ],
            [
                678,
                686
            ],
            [
                687,
                761
            ],
            [
                769,
                794
            ],
            [
                798,
                818
            ],
            [
                818,
                907
            ],
            [
                908,
                961
            ],
            [
                962,
                998
            ],
            [
                998,
                1020
            ],
            [
                1021,
                1023
            ],
            [
                1028,
                1034
            ],
            [
                1039,
                1048
            ],
            [
                1059,
                1089
            ],
            [
                1089,
                1129
            ],
            [
                1130,
                1135
            ],
            [
                1135,
                1136
            ],
            [
                1137,
                1208
            ],
            [
                1208,
                1282
            ],
            [
                1293,
                1311
            ],
            [
                1311,
                1323
            ],
            [
                1324,
                1330
            ],
            [
                1342,
                1358
            ],
            [
                1359,
                1385
            ],
            [
                1385,
                1387
            ],
            [
                1387,
                1395
            ],
            [
                1396,
                1477
            ],
            [
                1477,
                1509
            ],
            [
                1510,
                1513
            ],
            [
                1514,
                1523
            ],
            [
                1524,
                1527
            ],
            [
                1528,
                1583
            ],
            [
                1585,
                1592
            ],
            [
                1597,
                1613
            ],
            [
                1643,
                1644
            ],
            [
                1645,
                1686
            ],
            [
                1687,
                1737
            ],
            [
                1737,
                1752
            ],
            [
                1758,
                1766
            ],
            [
                1767,
                1830
            ],
            [
                1831,
                1849
            ],
            [
                1849,
                1873
            ],
            [
                1873,
                1917
            ],
            [
                1917,
                1919
            ],
            [
                1925,
                1935
            ],
            [
                1936,
                1940
            ],
            [
                1940,
                1943
            ],
            [
                1943,
                1961
            ],
            [
                1963,
                1995
            ],
            [
                1995,
                2010
            ],
            [
                2025,
                2089
            ],
            [
                2092,
                2127
            ],
            [
                2127,
                2233
            ],
            [
                2233,
                2234
            ],
            [
                2263,
                2268
            ],
            [
                2280,
                2283
            ],
            [
                2283,
                2284
            ],
            [
                2285,
                2296
            ],
            [
                2297,
                2319
            ],
            [
                2321,
                2365
            ],
            [
                2376,
                2398
            ],
            [
                2399,
                2401
            ],
            [
                2402,
                2406
            ],
            [
                2410,
                2415
            ],
            [
                2416,
                2419
            ],
            [
                2420,
                2480
            ],
            [
                2481,
                2540
            ],
            [
                2540,
                2545
            ],
            [
                2546,
                2547
            ],
            [
                2548,
                2565
            ],
            [
                2566,
                2587
            ],
            [
                2596,
                2637
            ],
            [
                2646,
                2685
            ],
            [
                2685,
                2687
            ],
            [
                2687,
                2717
            ],
            [
                2721,
                2723
            ],
            [
                2723,
                2868
            ],
            [
                2868,
                2870
            ],
            [
                2870,
                2938
            ],
            [
                2938,
                2941
            ],
            [
                2968,
                2969
            ],
            [
                2973,
                2981
            ],
            [
                2982,
                2989
            ],
            [
                3001,
                3010
            ],
            [
                3010,
                3011
            ],
            [
                3012,
                3109
            ],
            [
                3109,
                3153
            ],
            [
                3159,
                3160
            ],
            [
                3161,
                3308
            ],
            [
                3308,
                3395
            ],
            [
                3401,
                3494
            ],
            [
                3494,
                3570
            ],
            [
                3570,
                3582
            ],
            [
                3583,
                3598
            ],
            [
                3598,
                3599
            ],
            [
                3608,
                3640
            ],
            [
                3640,
                3733
            ],
            [
                3733,
                3746
            ],
            [
                3747,
                3759
            ],
            [
                3766,
                3795
            ],
            [
                3795,
                3834
            ],
            [
                3834,
                3866
            ],
            [
                3866,
                3930
            ],
            [
                3931,
                3977
            ],
            [
                3978,
                3991
            ],
            [
                3991,
                3996
            ],
            [
                3996,
                3997
            ],
            [
                3998,
                4080
            ],
            [
                4091,
                4143
            ],
            [
                4146,
                4201
            ],
            [
                4201,
                4244
            ],
            [
                4244,
                4298
            ],
            [
                4299,
                4415
            ],
            [
                4415,
                4456
            ],
            [
                4456,
                4484
            ],
            [
                4484,
                4495
            ],
            [
                4505,
                4523
            ],
            [
                4530,
                4550
            ],
            [
                4551,
                4584
            ],
            [
                4585,
                4618
            ],
            [
                4618,
                4620
            ],
            [
                4620,
                4730
            ],
            [
                4730,
                4742
            ],
            [
                4744,
                4789
            ],
            [
                4789,
                4794
            ],
            [
                4795,
                4858
            ],
            [
                4858,
                4967
            ],
            [
                4967,
                5039
            ],
            [
                5039,
                5085
            ],
            [
                5085,
                5189
            ],
            [
                5189,
                5240
            ],
            [
                5241,
                5274
            ],
            [
                5274,
                5316
            ],
            [
                5316,
                5328
            ],
            [
                5329,
                5428
            ],
            [
                5433,
                5435
            ],
            [
                5435,
                5487
            ],
            [
                5487,
                5496
            ],
            [
                5496,
                5538
            ],
            [
                5538,
                5566
            ],
            [
                5567,
                5624
            ],
            [
                5624,
                5636
            ],
            [
                5637,
                5640
            ],
            [
                5641,
                5653
            ],
            [
                5653,
                5831
            ],
            [
                5833,
                5891
            ],
            [
                5894,
                5934
            ],
            [
                5934,
                5936
            ],
            [
                5936,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6101
            ],
            [
                6101,
                6151
            ],
            [
                6152,
                6155
            ],
            [
                6159,
                6161
            ],
            [
                6162,
                6172
            ],
            [
                6172,
                6224
            ],
            [
                6224,
                6240
            ],
            [
                6242,
                6282
            ],
            [
                6282,
                6285
            ],
            [
                6285,
                6303
            ],
            [
                6303,
                6317
            ],
            [
                6317,
                6338
            ],
            [
                6338,
                6354
            ],
            [
                6354,
                6406
            ],
            [
                6423,
                6425
            ],
            [
                6426,
                6470
            ],
            [
                6471,
                6543
            ],
            [
                6543,
                6589
            ],
            [
                6589,
                6645
            ],
            [
                6645,
                6720
            ],
            [
                6720,
                6763
            ],
            [
                6763,
                6765
            ],
            [
                6766,
                6849
            ],
            [
                6849,
                6891
            ],
            [
                6891,
                6963
            ],
            [
                6963,
                7026
            ],
            [
                7026,
                7130
            ],
            [
                7130,
                7181
            ],
            [
                7181,
                7222
            ],
            [
                7222,
                7268
            ],
            [
                7269,
                7309
            ],
            [
                7309,
                7374
            ],
            [
                7380,
                7427
            ],
            [
                7427,
                7469
            ],
            [
                7469,
                7480
            ],
            [
                7481,
                7497
            ],
            [
                7497,
                7500
            ],
            [
                7500,
                7573
            ],
            [
                7573,
                7615
            ],
            [
                7615,
                7711
            ],
            [
                7711,
                7755
            ],
            [
                7755,
                7769
            ],
            [
                7775,
                7815
            ],
            [
                7815,
                7880
            ],
            [
                7880,
                7948
            ],
            [
                7949,
                7957
            ],
            [
                7958,
                7979
            ],
            [
                7980,
                7992
            ],
            [
                7993,
                8000
            ],
            [
                8003,
                8038
            ],
            [
                8041,
                8064
            ],
            [
                8064,
                8087
            ],
            [
                8087,
                8127
            ],
            [
                8127,
                8129
            ],
            [
                8129,
                8191
            ],
            [
                8191,
                8248
            ],
            [
                8248,
                8294
            ],
            [
                8295,
                8356
            ],
            [
                8357,
                8364
            ],
            [
                8372,
                8388
            ],
            [
                8388,
                8456
            ],
            [
                8459,
                8464
            ],
            [
                8465,
                8484
            ],
            [
                8495,
                8517
            ],
            [
                8518,
                8521
            ],
            [
                8528,
                8532
            ],
            [
                8533,
                8555
            ],
            [
                8559,
                8561
            ],
            [
                8562,
                8584
            ],
            [
                8586,
                8596
            ],
            [
                8597,
                8693
            ],
            [
                8693,
                8695
            ],
            [
                8695,
                8777
            ],
            [
                8778,
                8797
            ],
            [
                8798,
                8829
            ],
            [
                8831,
                8839
            ],
            [
                8839,
                8969
            ],
            [
                8969,
                8982
            ],
            [
                8983,
                9005
            ],
            [
                9005,
                9047
            ],
            [
                9048,
                9058
            ],
            [
                9070,
                9108
            ],
            [
                9109,
                9133
            ],
            [
                9133,
                9157
            ],
            [
                9158,
                9162
            ],
            [
                9163,
                9181
            ],
            [
                9188,
                9189
            ],
            [
                9190,
                9203
            ],
            [
                9203,
                9217
            ],
            [
                9220,
                9271
            ],
            [
                9271,
                9299
            ],
            [
                9299,
                9348
            ],
            [
                9348,
                9375
            ],
            [
                9375,
                9473
            ],
            [
                9473,
                9524
            ],
            [
                9525,
                9548
            ],
            [
                9549,
                9636
            ],
            [
                9637,
                9640
            ],
            [
                9646,
                9654
            ],
            [
                9665,
                9667
            ],
            [
                9667,
                9687
            ],
            [
                9688,
                9690
            ],
            [
                9691,
                9743
            ],
            [
                9743,
                9756
            ],
            [
                9757,
                9789
            ],
            [
                9799,
                9801
            ],
            [
                9801,
                9819
            ],
            [
                9820,
                9945
            ],
            [
                9945,
                9951
            ],
            [
                9952,
                10027
            ],
            [
                10027,
                10040
            ],
            [
                10044,
                10047
            ],
            [
                10053,
                10055
            ],
            [
                10055,
                10136
            ],
            [
                10137,
                10147
            ],
            [
                10148,
                10225
            ],
            [
                10226,
                10233
            ],
            [
                10233,
                10234
            ],
            [
                10235,
                10247
            ],
            [
                10254,
                10285
            ],
            [
                10303,
                10310
            ],
            [
                10310,
                10312
            ],
            [
                10312,
                10341
            ],
            [
                10341,
                10347
            ],
            [
                10348,
                10389
            ],
            [
                10390,
                10467
            ],
            [
                10468,
                10476
            ],
            [
                10476,
                10562
            ],
            [
                10566,
                10603
            ],
            [
                10617,
                10628
            ],
            [
                10629,
                10644
            ],
            [
                10645,
                10653
            ],
            [
                10653,
                10700
            ],
            [
                10700,
                10702
            ],
            [
                10702,
                10825
            ],
            [
                10825,
                10872
            ],
            [
                10875,
                10894
            ],
            [
                10897,
                10922
            ],
            [
                10922,
                10953
            ],
            [
                10954,
                10998
            ],
            [
                11006,
                11023
            ],
            [
                11024,
                11108
            ],
            [
                11109,
                11153
            ],
            [
                11153,
                11187
            ],
            [
                11187,
                11215
            ],
            [
                11215,
                11244
            ],
            [
                11245,
                11275
            ],
            [
                11275,
                11352
            ],
            [
                11352,
                11393
            ],
            [
                11393,
                11412
            ],
            [
                11412,
                11434
            ],
            [
                11434,
                11512
            ],
            [
                11512,
                11550
            ],
            [
                11550,
                11567
            ],
            [
                11570,
                11621
            ],
            [
                11621,
                11623
            ],
            [
                11623,
                11654
            ],
            [
                11658,
                11669
            ],
            [
                11675,
                11678
            ],
            [
                11679,
                11700
            ],
            [
                11700,
                11743
            ],
            [
                11743,
                11745
            ],
            [
                11745,
                11830
            ],
            [
                11830,
                11883
            ],
            [
                11884,
                11922
            ],
            [
                11922,
                11939
            ],
            [
                11939,
                11941
            ],
            [
                11941,
                11968
            ],
            [
                11977,
                11978
            ],
            [
                11979,
                11992
            ],
            [
                11993,
                12011
            ],
            [
                12011,
                12012
            ],
            [
                12013,
                12046
            ],
            [
                12067,
                12078
            ],
            [
                12082,
                12092
            ],
            [
                12092,
                12124
            ],
            [
                12124,
                12126
            ],
            [
                12126,
                12164
            ],
            [
                12165,
                12174
            ],
            [
                12175,
                12185
            ],
            [
                12185,
                12239
            ],
            [
                12240,
                12245
            ],
            [
                12246,
                12272
            ],
            [
                12273,
                12276
            ],
            [
                12276,
                12278
            ],
            [
                12278,
                12354
            ],
            [
                12355,
                12406
            ],
            [
                12407,
                12446
            ],
            [
                12446,
                12448
            ],
            [
                12454,
                12464
            ],
            [
                12464,
                12560
            ],
            [
                12569,
                12580
            ],
            [
                12581,
                12594
            ],
            [
                12595,
                12630
            ],
            [
                12630,
                12689
            ],
            [
                12689,
                12736
            ],
            [
                12736,
                12790
            ],
            [
                12792,
                12831
            ],
            [
                12831,
                12879
            ],
            [
                12879,
                12913
            ],
            [
                12913,
                12993
            ],
            [
                12993,
                12996
            ],
            [
                12997,
                13030
            ],
            [
                13030,
                13071
            ],
            [
                13071,
                13080
            ],
            [
                13081,
                13096
            ],
            [
                13096,
                13113
            ],
            [
                13113,
                13115
            ],
            [
                13115,
                13120
            ],
            [
                13121,
                13134
            ],
            [
                13134,
                13150
            ],
            [
                13150,
                13219
            ],
            [
                13221,
                13327
            ],
            [
                13327,
                13348
            ],
            [
                13348,
                13352
            ],
            [
                13352,
                13354
            ],
            [
                13363,
                13479
            ],
            [
                13482,
                13544
            ],
            [
                13565,
                13567
            ],
            [
                13567,
                13575
            ],
            [
                13576,
                13615
            ],
            [
                13619,
                13621
            ],
            [
                13621,
                13633
            ],
            [
                13633,
                13725
            ],
            [
                13725,
                13728
            ],
            [
                13729,
                13741
            ],
            [
                13748,
                13816
            ],
            [
                13816,
                13839
            ],
            [
                13857,
                13864
            ],
            [
                13868,
                13871
            ],
            [
                13874,
                13897
            ],
            [
                13897,
                13928
            ],
            [
                13928,
                13974
            ],
            [
                13975,
                14006
            ],
            [
                14007,
                14014
            ],
            [
                14014,
                14089
            ],
            [
                14089,
                14104
            ],
            [
                14104,
                14145
            ],
            [
                14145,
                14146
            ],
            [
                14146,
                14207
            ],
            [
                14207,
                14274
            ],
            [
                14274,
                14300
            ],
            [
                14300,
                14334
            ],
            [
                14334,
                14337
            ],
            [
                14337,
                14381
            ],
            [
                14391,
                14394
            ],
            [
                14399,
                14415
            ],
            [
                14415,
                14417
            ],
            [
                14418,
                14424
            ],
            [
                14430,
                14447
            ],
            [
                14447,
                14477
            ],
            [
                14477,
                14538
            ],
            [
                14538,
                14549
            ],
            [
                14550,
                14583
            ],
            [
                14583,
                14626
            ],
            [
                14626,
                14671
            ],
            [
                14671,
                14711
            ],
            [
                14712,
                14714
            ],
            [
                14722,
                14731
            ],
            [
                14731,
                14740
            ],
            [
                14741,
                14777
            ],
            [
                14777,
                14807
            ],
            [
                14807,
                14843
            ],
            [
                14846,
                14852
            ],
            [
                14853,
                14864
            ],
            [
                14864,
                14867
            ],
            [
                14869,
                14901
            ],
            [
                14901,
                14932
            ],
            [
                14932,
                14991
            ],
            [
                14991,
                15091
            ],
            [
                15095,
                15163
            ],
            [
                15166,
                15258
            ],
            [
                15258,
                15278
            ],
            [
                15278,
                15324
            ],
            [
                15324,
                15369
            ],
            [
                15369,
                15431
            ],
            [
                15431,
                15491
            ],
            [
                15493,
                15503
            ],
            [
                15503,
                15545
            ],
            [
                15545,
                15650
            ],
            [
                15650,
                15766
            ],
            [
                15766,
                15781
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15820
            ],
            [
                15820,
                15902
            ],
            [
                15903,
                15912
            ],
            [
                15912,
                15964
            ],
            [
                15964,
                16051
            ],
            [
                16051,
                16104
            ],
            [
                16104,
                16153
            ],
            [
                16153,
                16181
            ],
            [
                16181,
                16183
            ],
            [
                16183,
                16252
            ],
            [
                16252,
                16254
            ],
            [
                16254,
                16272
            ],
            [
                16279,
                16376
            ],
            [
                16376,
                16378
            ],
            [
                16378,
                16390
            ],
            [
                16391,
                16427
            ],
            [
                16428,
                16500
            ],
            [
                16501,
                16587
            ],
            [
                16588,
                16614
            ],
            [
                16614,
                16715
            ],
            [
                16715,
                16722
            ],
            [
                16723,
                16725
            ],
            [
                16731,
                16758
            ],
            [
                16759,
                16761
            ],
            [
                16771,
                16772
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                180
            ],
            [
                180,
                180
            ],
            [
                180,
                180
            ],
            [
                180,
                180
            ],
            [
                180,
                366
            ],
            [
                366,
                366
            ],
            [
                366,
                449
            ],
            [
                449,
                505
            ],
            [
                505,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                818
            ],
            [
                818,
                818
            ],
            [
                818,
                962
            ],
            [
                962,
                998
            ],
            [
                998,
                998
            ],
            [
                998,
                1089
            ],
            [
                1089,
                1137
            ],
            [
                1137,
                1208
            ],
            [
                1208,
                1311
            ],
            [
                1311,
                1387
            ],
            [
                1387,
                1477
            ],
            [
                1477,
                1613
            ],
            [
                1613,
                1687
            ],
            [
                1687,
                1737
            ],
            [
                1737,
                1755
            ],
            [
                1755,
                1755
            ],
            [
                1755,
                1831
            ],
            [
                1831,
                1873
            ],
            [
                1873,
                1917
            ],
            [
                1917,
                1943
            ],
            [
                1943,
                1995
            ],
            [
                1995,
                2127
            ],
            [
                2127,
                2127
            ],
            [
                2127,
                2285
            ],
            [
                2285,
                2285
            ],
            [
                2285,
                2285
            ],
            [
                2285,
                2481
            ],
            [
                2481,
                2566
            ],
            [
                2566,
                2687
            ],
            [
                2687,
                2723
            ],
            [
                2723,
                2723
            ],
            [
                2723,
                2870
            ],
            [
                2870,
                2938
            ],
            [
                2938,
                2938
            ],
            [
                2938,
                2938
            ],
            [
                2938,
                2938
            ],
            [
                2938,
                2938
            ],
            [
                2938,
                3012
            ],
            [
                3012,
                3109
            ],
            [
                3109,
                3161
            ],
            [
                3161,
                3308
            ],
            [
                3308,
                3494
            ],
            [
                3494,
                3494
            ],
            [
                3494,
                3570
            ],
            [
                3570,
                3640
            ],
            [
                3640,
                3640
            ],
            [
                3640,
                3640
            ],
            [
                3640,
                3640
            ],
            [
                3640,
                3733
            ],
            [
                3733,
                3795
            ],
            [
                3795,
                3834
            ],
            [
                3834,
                3931
            ],
            [
                3931,
                3931
            ],
            [
                3931,
                3991
            ],
            [
                3991,
                4201
            ],
            [
                4201,
                4244
            ],
            [
                4244,
                4244
            ],
            [
                4244,
                4415
            ],
            [
                4415,
                4456
            ],
            [
                4456,
                4484
            ],
            [
                4484,
                4551
            ],
            [
                4551,
                4585
            ],
            [
                4585,
                4620
            ],
            [
                4620,
                4730
            ],
            [
                4730,
                4858
            ],
            [
                4858,
                4967
            ],
            [
                4967,
                5039
            ],
            [
                5039,
                5085
            ],
            [
                5085,
                5189
            ],
            [
                5189,
                5274
            ],
            [
                5274,
                5316
            ],
            [
                5316,
                5328
            ],
            [
                5328,
                5328
            ],
            [
                5328,
                5435
            ],
            [
                5435,
                5487
            ],
            [
                5487,
                5496
            ],
            [
                5496,
                5538
            ],
            [
                5538,
                5624
            ],
            [
                5624,
                5833
            ],
            [
                5833,
                5833
            ],
            [
                5833,
                5894
            ],
            [
                5894,
                5936
            ],
            [
                5936,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6101
            ],
            [
                6101,
                6172
            ],
            [
                6172,
                6224
            ],
            [
                6224,
                6242
            ],
            [
                6242,
                6242
            ],
            [
                6242,
                6285
            ],
            [
                6285,
                6303
            ],
            [
                6303,
                6303
            ],
            [
                6303,
                6317
            ],
            [
                6317,
                6338
            ],
            [
                6338,
                6354
            ],
            [
                6354,
                6425
            ],
            [
                6425,
                6425
            ],
            [
                6425,
                6425
            ],
            [
                6425,
                6425
            ],
            [
                6425,
                6425
            ],
            [
                6425,
                6425
            ],
            [
                6425,
                6543
            ],
            [
                6543,
                6589
            ],
            [
                6589,
                6645
            ],
            [
                6645,
                6720
            ],
            [
                6720,
                6763
            ],
            [
                6763,
                6849
            ],
            [
                6849,
                6891
            ],
            [
                6891,
                6963
            ],
            [
                6963,
                7026
            ],
            [
                7026,
                7130
            ],
            [
                7130,
                7181
            ],
            [
                7181,
                7222
            ],
            [
                7222,
                7309
            ],
            [
                7309,
                7469
            ],
            [
                7469,
                7500
            ],
            [
                7500,
                7573
            ],
            [
                7573,
                7615
            ],
            [
                7615,
                7711
            ],
            [
                7711,
                7755
            ],
            [
                7755,
                7815
            ],
            [
                7815,
                7880
            ],
            [
                7880,
                8041
            ],
            [
                8041,
                8064
            ],
            [
                8064,
                8087
            ],
            [
                8087,
                8129
            ],
            [
                8129,
                8191
            ],
            [
                8191,
                8248
            ],
            [
                8248,
                8388
            ],
            [
                8388,
                8584
            ],
            [
                8584,
                8695
            ],
            [
                8695,
                8798
            ],
            [
                8798,
                8839
            ],
            [
                8839,
                8969
            ],
            [
                8969,
                9005
            ],
            [
                9005,
                9048
            ],
            [
                9048,
                9133
            ],
            [
                9133,
                9190
            ],
            [
                9190,
                9271
            ],
            [
                9271,
                9299
            ],
            [
                9299,
                9348
            ],
            [
                9348,
                9375
            ],
            [
                9375,
                9473
            ],
            [
                9473,
                9473
            ],
            [
                9473,
                9549
            ],
            [
                9549,
                9667
            ],
            [
                9667,
                9743
            ],
            [
                9743,
                9743
            ],
            [
                9743,
                9743
            ],
            [
                9743,
                9743
            ],
            [
                9743,
                9801
            ],
            [
                9801,
                9945
            ],
            [
                9945,
                10027
            ],
            [
                10027,
                10055
            ],
            [
                10055,
                10235
            ],
            [
                10235,
                10312
            ],
            [
                10312,
                10341
            ],
            [
                10341,
                10476
            ],
            [
                10476,
                10653
            ],
            [
                10653,
                10702
            ],
            [
                10702,
                10825
            ],
            [
                10825,
                10922
            ],
            [
                10922,
                11024
            ],
            [
                11024,
                11024
            ],
            [
                11024,
                11108
            ],
            [
                11108,
                11108
            ],
            [
                11108,
                11153
            ],
            [
                11153,
                11187
            ],
            [
                11187,
                11215
            ],
            [
                11215,
                11275
            ],
            [
                11275,
                11352
            ],
            [
                11352,
                11393
            ],
            [
                11393,
                11412
            ],
            [
                11412,
                11434
            ],
            [
                11434,
                11512
            ],
            [
                11512,
                11550
            ],
            [
                11550,
                11570
            ],
            [
                11570,
                11570
            ],
            [
                11570,
                11570
            ],
            [
                11570,
                11623
            ],
            [
                11623,
                11654
            ],
            [
                11654,
                11700
            ],
            [
                11700,
                11745
            ],
            [
                11745,
                11830
            ],
            [
                11830,
                11884
            ],
            [
                11884,
                11922
            ],
            [
                11922,
                11941
            ],
            [
                11941,
                12013
            ],
            [
                12013,
                12013
            ],
            [
                12013,
                12067
            ],
            [
                12067,
                12067
            ],
            [
                12067,
                12092
            ],
            [
                12092,
                12126
            ],
            [
                12126,
                12185
            ],
            [
                12185,
                12240
            ],
            [
                12240,
                12278
            ],
            [
                12278,
                12407
            ],
            [
                12407,
                12464
            ],
            [
                12464,
                12630
            ],
            [
                12630,
                12689
            ],
            [
                12689,
                12736
            ],
            [
                12736,
                12792
            ],
            [
                12792,
                12792
            ],
            [
                12792,
                12792
            ],
            [
                12792,
                12831
            ],
            [
                12831,
                12879
            ],
            [
                12879,
                12913
            ],
            [
                12913,
                12993
            ],
            [
                12993,
                13030
            ],
            [
                13030,
                13071
            ],
            [
                13071,
                13096
            ],
            [
                13096,
                13115
            ],
            [
                13115,
                13115
            ],
            [
                13115,
                13134
            ],
            [
                13134,
                13150
            ],
            [
                13150,
                13221
            ],
            [
                13221,
                13221
            ],
            [
                13221,
                13221
            ],
            [
                13221,
                13327
            ],
            [
                13327,
                13348
            ],
            [
                13348,
                13354
            ],
            [
                13354,
                13354
            ],
            [
                13354,
                13544
            ],
            [
                13544,
                13567
            ],
            [
                13567,
                13621
            ],
            [
                13621,
                13725
            ],
            [
                13725,
                13816
            ],
            [
                13816,
                13897
            ],
            [
                13897,
                13975
            ],
            [
                13975,
                14014
            ],
            [
                14014,
                14089
            ],
            [
                14089,
                14104
            ],
            [
                14104,
                14145
            ],
            [
                14145,
                14207
            ],
            [
                14207,
                14274
            ],
            [
                14274,
                14300
            ],
            [
                14300,
                14337
            ],
            [
                14337,
                14417
            ],
            [
                14417,
                14417
            ],
            [
                14417,
                14447
            ],
            [
                14447,
                14477
            ],
            [
                14477,
                14538
            ],
            [
                14538,
                14583
            ],
            [
                14583,
                14626
            ],
            [
                14626,
                14671
            ],
            [
                14671,
                14731
            ],
            [
                14731,
                14777
            ],
            [
                14777,
                14807
            ],
            [
                14807,
                14846
            ],
            [
                14846,
                14864
            ],
            [
                14864,
                14901
            ],
            [
                14901,
                14932
            ],
            [
                14932,
                14991
            ],
            [
                14991,
                15091
            ],
            [
                15091,
                15091
            ],
            [
                15091,
                15166
            ],
            [
                15166,
                15166
            ],
            [
                15166,
                15166
            ],
            [
                15166,
                15258
            ],
            [
                15258,
                15278
            ],
            [
                15278,
                15324
            ],
            [
                15324,
                15369
            ],
            [
                15369,
                15431
            ],
            [
                15431,
                15493
            ],
            [
                15493,
                15493
            ],
            [
                15493,
                15503
            ],
            [
                15503,
                15766
            ],
            [
                15766,
                15805
            ],
            [
                15805,
                15820
            ],
            [
                15820,
                15820
            ],
            [
                15820,
                15912
            ],
            [
                15912,
                15964
            ],
            [
                15964,
                16051
            ],
            [
                16051,
                16104
            ],
            [
                16104,
                16153
            ],
            [
                16153,
                16183
            ],
            [
                16183,
                16254
            ],
            [
                16254,
                16378
            ],
            [
                16378,
                16428
            ],
            [
                16428,
                16614
            ],
            [
                16614,
                16715
            ],
            [
                16715,
                16778
            ]
        ]
    }
}