{
    "original": {
        "text": "Paul Montague had other troubles on his mind beyond this trouble of the Mexican Railway. It was now more than a fortnight since he had taken Mrs. Hurtle to the play, and she was still living in lodgings at Islington. He had seen her twice, once on the following day, when he was allowed to come and go without any special reference to their engagement, and again, three or four days afterwards, when the meeting was by no means so pleasant. She had wept, and after weeping had stormed. She had stood upon what she called her rights, and had dared him to be false to her. Did he mean to deny that he had promised to marry her? Was not his conduct to her, ever since she had now been in London, a repetition of that promise? And then again she became soft, and pleaded with him. But for the storm he might have given way. At that moment he had felt that any fate in life would be better than a marriage on compulsion. Her tears and her pleadings, nevertheless, touched him very nearly. He had promised her most distinctly. He had loved her and had won her love. And she was lovely. The very violence of the storm made the sunshine more sweet. She would sit down on a stool at his feet, and it was impossible to drive her away from him. She would look up in his face and he could not but embrace her. Then there had come a passionate flood of tears and she was in his arms. How he had escaped he hardly knew, but he did know that he had promised to be with her again before two days should have passed.\nOn the day named he wrote to her a letter excusing himself, which was at any rate true in words. He had been summoned, he said, to Liverpool on business, and must postpone seeing her till his return. And he explained that the business on which he was called was connected with the great American railway, and, being important, demanded his attention. In words this was true. He had been corresponding with a gentleman at Liverpool with whom he had become acquainted on his return home after having involuntarily become a partner in the house of Fisker, Montague, and Montague. This man he trusted and had consulted, and the gentleman, Mr. Ramsbottom by name, had suggested that he should come to him at Liverpool. He had gone, and his conduct at the Board had been the result of the advice which he had received; but it may be doubted whether some dread of the coming interview with Mrs. Hurtle had not added strength to Mr. Ramsbottom's invitation.\nIn Liverpool he had heard tidings of Mrs. Hurtle, though it can hardly be said that he obtained any trustworthy information. The lady after landing from an American steamer had been at Mr. Ramsbottom's office, inquiring for him, Paul; and Mr. Ramsbottom had thought that the inquiries were made in a manner indicating danger. He therefore had spoken to a fellow-traveller with Mrs. Hurtle, and the fellow-traveller had opined that Mrs. Hurtle was \"a queer card.\" \"On board ship we all gave it up to her that she was about the handsomest woman we had ever seen, but we all said that there was a bit of the wild cat in her breeding.\" Then Mr. Ramsbottom had asked whether the lady was a widow. \"There was a man on board from Kansas,\" said the fellow-traveller, \"who knew a man named Hurtle at Leavenworth, who was separated from his wife and is still alive. There was, according to him, a queer story about the man and his wife having fought a duel with pistols, and then having separated.\" This Mr. Ramsbottom, who in an earlier stage of the affair had heard something of Paul and Mrs. Hurtle together, managed to communicate to the young man. His advice about the railway company was very clear and general, and such as an honest man would certainly give; but it might have been conveyed by letter. The information, such as it was, respecting Mrs. Hurtle, could only be given viv voce, and perhaps the invitation to Liverpool had originated in Mr. Ramsbottom's appreciation of this fact. \"As she was asking after you here, perhaps it is as well that you should know,\" his friend said to him. Paul had only thanked him, not daring on the spur of the moment to speak of his own difficulties.\nIn all this there had been increased dismay, but there had also been some comfort. It had only been at moments in which he had been subject to her softer influences that Paul had doubted as to his adherence to the letter which he had written to her, breaking off his engagement. When she told him of her wrongs and of her love; of his promise and his former devotion to her; when she assured him that she had given up everything in life for him, and threw her arms round him, looking into his eyes;--then he would almost yield. But when, what the traveller called the breeding of the wild cat, showed itself;--and when, having escaped from her, he thought of Hetta Carbury and of her breeding,--he was fully determined that, let his fate be what it might, it should not be that of being the husband of Mrs. Hurtle. That he was in a mass of troubles from which it would be very difficult for him to extricate himself he was well aware;--but if it were true that Mr. Hurtle was alive, that fact might help him. She certainly had declared him to be,--not separated, or even divorced,--but dead. And if it were true also that she had fought a duel with one husband, that also ought to be a reason why a gentleman should object to become her second husband. These facts would at any rate justify himself to himself, and would enable himself to break from his engagement without thinking himself to be a false traitor.\nBut he must make up his mind as to some line of conduct. She must be made to know the truth. If he meant to reject the lady finally on the score of her being a wild cat, he must tell her so. He felt very strongly that he must not flinch from the wild cat's claws. That he would have to undergo some severe handling, an amount of clawing which might perhaps go near his life, he could perceive. Having done what he had done he would have no right to shrink from such usage. He must tell her to her face that he was not satisfied with her past life, and that therefore he would not marry her. Of course he might write to her;--but when summoned to her presence he would be unable to excuse himself, even to himself, for not going. It was his misfortune,--and also his fault,--that he had submitted to be loved by a wild cat.\nBut it might be well that before he saw her he should get hold of information that might have the appearance of real evidence. He returned from Liverpool to London on the morning of the Friday on which the Board was held, and thought even more of all this than he did of the attack which he was prepared to make on Mr. Melmotte. If he could come across that traveller he might learn something. The husband's name had been Caradoc Carson Hurtle. If Caradoc Carson Hurtle had been seen in the State of Kansas within the last two years, that certainly would be sufficient evidence. As to the duel he felt that it might be very hard to prove that, and that if proved, it might be hard to found upon the fact any absolute right on his part to withdraw from the engagement. But there was a rumour also, though not corroborated during his last visit to Liverpool, that she had shot a gentleman in Oregon. Could he get at the truth of that story? If they were all true, surely he could justify himself to himself.\nBut this detective's work was very distasteful to him. After having had the woman in his arms how could he undertake such inquiries as these? And it would be almost necessary that he should take her in his arms again while he was making them,--unless indeed he made them with her knowledge. Was it not his duty, as a man, to tell everything to herself? To speak to her thus;--\"I am told that your life with your last husband was, to say the least of it, eccentric; that you even fought a duel with him. I could not marry a woman who had fought a duel,--certainly not a woman who had fought with her own husband. I am told also that you shot another gentleman in Oregon. It may well be that the gentleman deserved to be shot; but there is something in the deed so repulsive to me,--no doubt irrationally,--that, on that score also, I must decline to marry you. I am told also that Mr. Hurtle has been seen alive quite lately. I had understood from you that he is dead. No doubt you may have been deceived. But as I should not have engaged myself to you had I known the truth, so now I consider myself justified in absolving myself from an engagement which was based on a misconception.\" It would no doubt be difficult to get through all these details; but it might be accomplished gradually,--unless in the process of doing so he should incur the fate of the gentleman in Oregon. At any rate he would declare to her as well as he could the ground on which he claimed a right to consider himself free, and would bear the consequences. Such was the resolve which he made on his journey up from Liverpool, and that trouble was also on his mind when he rose up to attack Mr. Melmotte single-handed at the Board.\nWhen the Board was over, he also went down to the Beargarden. Perhaps, with reference to the Board, the feeling which hurt him most was the conviction that he was spending money which he would never have had to spend had there been no Board. He had been twitted with this at the Board-meeting, and had justified himself by referring to the money which had been invested in the Company of Fisker, Montague, and Montague, which money was now supposed to have been made over to the railway. But the money which he was spending had come to him after a loose fashion, and he knew that if called upon for an account, he could hardly make out one which would be square and intelligible to all parties. Nevertheless he spent much of his time at the Beargarden, dining there when no engagement carried him elsewhere. On this evening he joined his table with Nidderdale's, at the young lord's instigation. \"What made you so savage at old Melmotte to-day?\" said the young lord.\n\"I didn't mean to be savage, but I think that as we call ourselves Directors we ought to know something about it.\"\n\"I suppose we ought. I don't know, you know. I'll tell you what I've been thinking. I can't make out why the mischief they made me a Director.\"\n\"Because you're a lord,\" said Paul bluntly.\n\"I suppose there's something in that. But what good can I do them? Nobody thinks that I know anything about business. Of course I'm in Parliament, but I don't often go there unless they want me to vote. Everybody knows that I'm hard up. I can't understand it. The Governor said that I was to do it, and so I've done it.\"\n\"They say, you know,--there's something between you and Melmotte's daughter.\"\n\"But if there is, what has that to do with a railway in the city? And why should Carbury be there? And, heaven and earth, why should old Grendall be a Director? I'm impecunious; but if you were to pick out the two most hopeless men in London in regard to money, they would be old Grendall and young Carbury. I've been thinking a good deal about it, and I can't make it out.\"\n\"I have been thinking about it too,\" said Paul.\n\"I suppose old Melmotte is all right?\" asked Nidderdale. This was a question which Montague found it difficult to answer. How could he be justified in whispering suspicions to the man who was known to be at any rate one of the competitors for Marie Melmotte's hand? \"You can speak out to me, you know,\" said Nidderdale, nodding his head.\n\"I've got nothing to speak. People say that he is about the richest man alive.\"\n\"He lives as though he were.\"\n\"I don't see why it shouldn't be all true. Nobody, I take it, knows very much about him.\" When his companion had left him, Nidderdale sat down, thinking of it all. It occurred to him that he would \"be coming a cropper rather,\" were he to marry Melmotte's daughter for her money, and then find that she had got none.\nA little later in the evening he invited Montague to go up to the card-room. \"Carbury, and Grasslough, and Dolly Longestaffe are there waiting,\" he said. But Paul declined. He was too full of his troubles for play. \"Poor Miles isn't there, if you're afraid of that,\" said Nidderdale.\n\"Miles Grendall wouldn't hinder me,\" said Montague.\n\"Nor me either. Of course it's a confounded shame. I know that as well as any body. But, God bless me, I owe a fellow down in Leicestershire heaven knows how much for keeping horses, and that's a shame.\"\n\"You'll pay him some day.\"\n\"I suppose I shall,--if I don't die first. But I should have gone on with the horses just the same if there had never been anything to come;--only they wouldn't have given me tick, you know. As far as I'm concerned it's just the same. I like to live whether I've got money or not. And I fear I don't have many scruples about paying. But then I like to let live too. There's Carbury always saying nasty things about poor Miles. He's playing himself without a rap to back him. If he were to lose, Vossner wouldn't stand him a 10 note. But because he has won, he goes on as though he were old Melmotte himself. You'd better come up.\"\nBut Montague wouldn't go up. Without any fixed purpose he left the club, and slowly sauntered northwards through the streets till he found himself in Welbeck Street. He hardly knew why he went there, and certainly had not determined to call on Lady Carbury when he left the Beargarden. His mind was full of Mrs. Hurtle. As long as she was present in London,--as long at any rate as he was unable to tell himself that he had finally broken away from her,--he knew himself to be an unfit companion for Henrietta Carbury. And, indeed, he was still under some promise made to Roger Carbury, not that he would avoid Hetta's company, but that for a certain period, as yet unexpired, he would not ask her to be his wife. It had been a foolish promise, made and then repented without much attention to words;--but still it was existing, and Paul knew well that Roger trusted that it would be kept. Nevertheless Paul made his way up to Welbeck Street and almost unconsciously knocked at the door. No;--Lady Carbury was not at home. She was out somewhere with Mr. Roger Carbury. Up to that moment Paul had not heard that Roger was in town; but the reader may remember that he had come up in search of Ruby Ruggles. Miss Carbury was at home, the page went on to say. Would Mr. Montague go up and see Miss Carbury? Without much consideration Mr. Montague said that he would go up and see Miss Carbury. \"Mamma is out with Roger,\" said Hetta endeavouring to save herself from confusion. \"There is a soire of learned people somewhere, and she made poor Roger take her. The ticket was only for her and her friend, and therefore I could not go.\"\n\"I am so glad to see you. What an age it is since we met.\"\n\"Hardly since the Melmottes' ball,\" said Hetta.\n\"Hardly indeed. I have been here once since that. What has brought Roger up to town?\"\n\"I don't know what it is. Some mystery, I think. Whenever there is a mystery I am always afraid that there is something wrong about Felix. I do get so unhappy about Felix, Mr. Montague.\"\n\"I saw him to-day in the city, at the Railway Board.\"\n\"But Roger says the Railway Board is all a sham,\"--Paul could not keep himself from blushing as he heard this,--\"and that Felix should not be there. And then there is something going on about that horrid man's daughter.\"\n\"She is to marry Lord Nidderdale, I think.\"\n\"Is she? They are talking of her marrying Felix, and of course it is for her money. And I believe that man is determined to quarrel with them.\"\n\"What man, Miss Carbury?\"\n\"Mr. Melmotte himself. It's all horrid from beginning to end.\"\n\"But I saw them in the city to-day and they seemed to be the greatest friends. When I wanted to see Mr. Melmotte he bolted himself into an inner room, but he took your brother with him. He would not have done that if they had not been friends. When I saw it I almost thought that he had consented to the marriage.\"\n\"Roger has the greatest dislike to Mr. Melmotte.\"\n\"I know he has,\" said Paul.\n\"And Roger is always right. It is always safe to trust him. Don't you think so, Mr. Montague?\" Paul did think so, and was by no means disposed to deny to his rival the praise which rightly belonged to him; but still he found the subject difficult. \"Of course I will never go against mamma,\" continued Hetta, \"but I always feel that my Cousin Roger is a rock of strength, so that if one did whatever he said one would never get wrong. I never found any one else that I thought that of, but I do think it of him.\"\n\"No one has more reason to praise him than I have.\"\n\"I think everybody has reason to praise him that has to do with him. And I'll tell you why I think it is. Whenever he thinks anything he says it;--or, at least, he never says anything that he doesn't think. If he spent a thousand pounds, everybody would know that he'd got it to spend; but other people are not like that.\"\n\"You're thinking of Melmotte.\"\n\"I'm thinking of everybody, Mr. Montague;--of everybody except Roger.\"\n\"Is he the only man you can trust? But it is abominable to me to seem even to contradict you. Roger Carbury has been to me the best friend that any man ever had. I think as much of him as you do.\"\n\"I didn't say he was the only person;--or I didn't mean to say so. But of all my friends--\"\n\"Am I among the number, Miss Carbury?\"\n\"Yes;--I suppose so. Of course you are. Why not? Of course you are a friend,--because you are his friend.\"\n\"Look here, Hetta,\" he said. \"It is no good going on like this. I love Roger Carbury,--as well as one man can love another. He is all that you say,--and more. You hardly know how he denies himself, and how he thinks of everybody near him. He is a gentleman all round and every inch. He never lies. He never takes what is not his own. I believe he does love his neighbour as himself.\"\n\"Oh, Mr. Montague! I am so glad to hear you speak of him like that.\"\n\"I love him better than any man,--as well as a man can love a man. If you will say that you love him as well as a woman can love a man,--I will leave England at once, and never return to it.\"\n\"There's mamma,\" said Henrietta;--for at that moment there was a double knock at the door.",
        "paragraph_chars": [
            [
                0,
                1500
            ],
            [
                1500,
                2450
            ],
            [
                2450,
                4140
            ],
            [
                4140,
                5553
            ],
            [
                5553,
                6376
            ],
            [
                6376,
                7382
            ],
            [
                7382,
                9089
            ],
            [
                9089,
                10056
            ],
            [
                10056,
                10171
            ],
            [
                10171,
                10315
            ],
            [
                10315,
                10359
            ],
            [
                10359,
                10680
            ],
            [
                10680,
                10758
            ],
            [
                10758,
                11133
            ],
            [
                11133,
                11181
            ],
            [
                11181,
                11519
            ],
            [
                11519,
                11599
            ],
            [
                11599,
                11629
            ],
            [
                11629,
                11945
            ],
            [
                11945,
                12229
            ],
            [
                12229,
                12281
            ],
            [
                12281,
                12485
            ],
            [
                12485,
                12512
            ],
            [
                12512,
                13143
            ],
            [
                13143,
                14772
            ],
            [
                14772,
                14831
            ],
            [
                14831,
                14879
            ],
            [
                14879,
                14965
            ],
            [
                14965,
                15152
            ],
            [
                15152,
                15206
            ],
            [
                15206,
                15427
            ],
            [
                15427,
                15471
            ],
            [
                15471,
                15615
            ],
            [
                15615,
                15641
            ],
            [
                15641,
                15704
            ],
            [
                15704,
                16019
            ],
            [
                16019,
                16069
            ],
            [
                16069,
                16097
            ],
            [
                16097,
                16609
            ],
            [
                16609,
                16661
            ],
            [
                16661,
                16984
            ],
            [
                16984,
                17015
            ],
            [
                17015,
                17086
            ],
            [
                17086,
                17283
            ],
            [
                17283,
                17375
            ],
            [
                17375,
                17414
            ],
            [
                17414,
                17521
            ],
            [
                17521,
                17905
            ],
            [
                17905,
                17974
            ],
            [
                17974,
                18166
            ],
            [
                18166,
                18256
            ]
        ],
        "segment_chars": [
            [
                0,
                89
            ],
            [
                89,
                217
            ],
            [
                217,
                441
            ],
            [
                441,
                486
            ],
            [
                486,
                571
            ],
            [
                571,
                626
            ],
            [
                626,
                723
            ],
            [
                723,
                777
            ],
            [
                777,
                820
            ],
            [
                820,
                916
            ],
            [
                916,
                984
            ],
            [
                984,
                1021
            ],
            [
                1021,
                1060
            ],
            [
                1060,
                1080
            ],
            [
                1080,
                1141
            ],
            [
                1141,
                1234
            ],
            [
                1234,
                1298
            ],
            [
                1298,
                1371
            ],
            [
                1371,
                1500
            ],
            [
                1500,
                1597
            ],
            [
                1597,
                1700
            ],
            [
                1700,
                1851
            ],
            [
                1851,
                1875
            ],
            [
                1875,
                2077
            ],
            [
                2077,
                2214
            ],
            [
                2214,
                2450
            ],
            [
                2450,
                2575
            ],
            [
                2575,
                2776
            ],
            [
                2776,
                2913
            ],
            [
                2913,
                3082
            ],
            [
                3082,
                3142
            ],
            [
                3142,
                3306
            ],
            [
                3306,
                3439
            ],
            [
                3439,
                3593
            ],
            [
                3593,
                3749
            ],
            [
                3749,
                3938
            ],
            [
                3938,
                4042
            ],
            [
                4042,
                4140
            ],
            [
                4140,
                4223
            ],
            [
                4223,
                4419
            ],
            [
                4419,
                4668
            ],
            [
                4668,
                4955
            ],
            [
                4955,
                5149
            ],
            [
                5149,
                5232
            ],
            [
                5232,
                5393
            ],
            [
                5393,
                5553
            ],
            [
                5553,
                5610
            ],
            [
                5610,
                5646
            ],
            [
                5646,
                5744
            ],
            [
                5744,
                5817
            ],
            [
                5817,
                5947
            ],
            [
                5947,
                6026
            ],
            [
                6026,
                6144
            ],
            [
                6144,
                6282
            ],
            [
                6282,
                6376
            ],
            [
                6376,
                6503
            ],
            [
                6503,
                6705
            ],
            [
                6705,
                6770
            ],
            [
                6770,
                6821
            ],
            [
                6821,
                6955
            ],
            [
                6955,
                7144
            ],
            [
                7144,
                7274
            ],
            [
                7274,
                7315
            ],
            [
                7315,
                7382
            ],
            [
                7382,
                7437
            ],
            [
                7437,
                7524
            ],
            [
                7524,
                7673
            ],
            [
                7673,
                7735
            ],
            [
                7735,
                7885
            ],
            [
                7885,
                7994
            ],
            [
                7994,
                8052
            ],
            [
                8052,
                8242
            ],
            [
                8242,
                8307
            ],
            [
                8307,
                8350
            ],
            [
                8350,
                8387
            ],
            [
                8387,
                8568
            ],
            [
                8568,
                8761
            ],
            [
                8761,
                8915
            ],
            [
                8915,
                9089
            ],
            [
                9089,
                9151
            ],
            [
                9151,
                9331
            ],
            [
                9331,
                9577
            ],
            [
                9577,
                9784
            ],
            [
                9784,
                9897
            ],
            [
                9897,
                9985
            ],
            [
                9985,
                10035
            ],
            [
                10035,
                10056
            ],
            [
                10056,
                10171
            ],
            [
                10171,
                10192
            ],
            [
                10192,
                10216
            ],
            [
                10216,
                10255
            ],
            [
                10255,
                10315
            ],
            [
                10315,
                10359
            ],
            [
                10359,
                10397
            ],
            [
                10397,
                10426
            ],
            [
                10426,
                10477
            ],
            [
                10477,
                10562
            ],
            [
                10562,
                10596
            ],
            [
                10596,
                10619
            ],
            [
                10619,
                10680
            ],
            [
                10680,
                10758
            ],
            [
                10758,
                10824
            ],
            [
                10824,
                10857
            ],
            [
                10857,
                10919
            ],
            [
                10919,
                11066
            ],
            [
                11066,
                11133
            ],
            [
                11133,
                11181
            ],
            [
                11181,
                11220
            ],
            [
                11220,
                11238
            ],
            [
                11238,
                11303
            ],
            [
                11303,
                11447
            ],
            [
                11447,
                11519
            ],
            [
                11519,
                11547
            ],
            [
                11547,
                11599
            ],
            [
                11599,
                11629
            ],
            [
                11629,
                11672
            ],
            [
                11672,
                11719
            ],
            [
                11719,
                11793
            ],
            [
                11793,
                11945
            ],
            [
                11945,
                12022
            ],
            [
                12022,
                12099
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                12160
            ],
            [
                12160,
                12229
            ],
            [
                12229,
                12281
            ],
            [
                12281,
                12297
            ],
            [
                12297,
                12332
            ],
            [
                12332,
                12365
            ],
            [
                12365,
                12485
            ],
            [
                12485,
                12512
            ],
            [
                12512,
                12555
            ],
            [
                12555,
                12703
            ],
            [
                12703,
                12747
            ],
            [
                12747,
                12793
            ],
            [
                12793,
                12845
            ],
            [
                12845,
                12878
            ],
            [
                12878,
                12939
            ],
            [
                12939,
                12987
            ],
            [
                12987,
                13045
            ],
            [
                13045,
                13120
            ],
            [
                13120,
                13143
            ],
            [
                13143,
                13172
            ],
            [
                13172,
                13309
            ],
            [
                13309,
                13429
            ],
            [
                13429,
                13463
            ],
            [
                13463,
                13662
            ],
            [
                13662,
                13857
            ],
            [
                13857,
                14033
            ],
            [
                14033,
                14131
            ],
            [
                14131,
                14166
            ],
            [
                14166,
                14212
            ],
            [
                14212,
                14348
            ],
            [
                14348,
                14399
            ],
            [
                14399,
                14446
            ],
            [
                14446,
                14533
            ],
            [
                14533,
                14616
            ],
            [
                14616,
                14697
            ],
            [
                14697,
                14772
            ],
            [
                14772,
                14798
            ],
            [
                14798,
                14831
            ],
            [
                14831,
                14879
            ],
            [
                14879,
                14895
            ],
            [
                14895,
                14929
            ],
            [
                14929,
                14965
            ],
            [
                14965,
                14991
            ],
            [
                14991,
                15014
            ],
            [
                15014,
                15104
            ],
            [
                15104,
                15152
            ],
            [
                15152,
                15206
            ],
            [
                15206,
                15355
            ],
            [
                15355,
                15427
            ],
            [
                15427,
                15471
            ],
            [
                15471,
                15480
            ],
            [
                15480,
                15555
            ],
            [
                15555,
                15615
            ],
            [
                15615,
                15641
            ],
            [
                15641,
                15664
            ],
            [
                15664,
                15704
            ],
            [
                15704,
                15783
            ],
            [
                15783,
                15890
            ],
            [
                15890,
                15948
            ],
            [
                15948,
                16019
            ],
            [
                16019,
                16069
            ],
            [
                16069,
                16097
            ],
            [
                16097,
                16125
            ],
            [
                16125,
                16157
            ],
            [
                16157,
                16192
            ],
            [
                16192,
                16345
            ],
            [
                16345,
                16531
            ],
            [
                16531,
                16609
            ],
            [
                16609,
                16661
            ],
            [
                16661,
                16730
            ],
            [
                16730,
                16767
            ],
            [
                16767,
                16868
            ],
            [
                16868,
                16984
            ],
            [
                16984,
                17015
            ],
            [
                17015,
                17086
            ],
            [
                17086,
                17121
            ],
            [
                17121,
                17180
            ],
            [
                17180,
                17248
            ],
            [
                17248,
                17283
            ],
            [
                17283,
                17350
            ],
            [
                17350,
                17375
            ],
            [
                17375,
                17414
            ],
            [
                17414,
                17435
            ],
            [
                17435,
                17454
            ],
            [
                17454,
                17463
            ],
            [
                17463,
                17521
            ],
            [
                17521,
                17550
            ],
            [
                17550,
                17585
            ],
            [
                17585,
                17645
            ],
            [
                17645,
                17680
            ],
            [
                17680,
                17760
            ],
            [
                17760,
                17804
            ],
            [
                17804,
                17819
            ],
            [
                17819,
                17855
            ],
            [
                17855,
                17905
            ],
            [
                17905,
                17924
            ],
            [
                17924,
                17974
            ],
            [
                17974,
                18041
            ],
            [
                18041,
                18166
            ],
            [
                18166,
                18256
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                87,
                89
            ],
            [
                89,
                164
            ],
            [
                215,
                217
            ],
            [
                217,
                238
            ],
            [
                238,
                271
            ],
            [
                335,
                441
            ],
            [
                441,
                453
            ],
            [
                455,
                458
            ],
            [
                477,
                486
            ],
            [
                486,
                489
            ],
            [
                537,
                571
            ],
            [
                571,
                577
            ],
            [
                586,
                626
            ],
            [
                634,
                637
            ],
            [
                630,
                633
            ],
            [
                693,
                723
            ],
            [
                723,
                731
            ],
            [
                738,
                766
            ],
            [
                775,
                776
            ],
            [
                777,
                794
            ],
            [
                795,
                820
            ],
            [
                916,
                929
            ],
            [
                934,
                943
            ],
            [
                959,
                970
            ],
            [
                982,
                984
            ],
            [
                1021,
                1060
            ],
            [
                1060,
                1080
            ],
            [
                1188,
                1234
            ],
            [
                1234,
                1280
            ],
            [
                1293,
                1298
            ],
            [
                1298,
                1371
            ],
            [
                1371,
                1463
            ],
            [
                1471,
                1479
            ],
            [
                1498,
                1500
            ],
            [
                1500,
                1510
            ],
            [
                1517,
                1525
            ],
            [
                1529,
                1558
            ],
            [
                1595,
                1597
            ],
            [
                1597,
                1652
            ],
            [
                1762,
                1803
            ],
            [
                1652,
                1699
            ],
            [
                1860,
                1875
            ],
            [
                1875,
                1907
            ],
            [
                1918,
                1930
            ],
            [
                1991,
                1997
            ],
            [
                2012,
                2077
            ],
            [
                2137,
                2149
            ],
            [
                2114,
                2115
            ],
            [
                2086,
                2088
            ],
            [
                2105,
                2114
            ],
            [
                2097,
                2100
            ],
            [
                2089,
                2096
            ],
            [
                2157,
                2214
            ],
            [
                2214,
                2216
            ],
            [
                2225,
                2255
            ],
            [
                2265,
                2311
            ],
            [
                2448,
                2450
            ],
            [
                2450,
                2465
            ],
            [
                2470,
                2506
            ],
            [
                2514,
                2520
            ],
            [
                2550,
                2575
            ],
            [
                2575,
                2583
            ],
            [
                2658,
                2659
            ],
            [
                2584,
                2622
            ],
            [
                2677,
                2678
            ],
            [
                2623,
                2626
            ],
            [
                2670,
                2673
            ],
            [
                2679,
                2683
            ],
            [
                2745,
                2756
            ],
            [
                2716,
                2720
            ],
            [
                2635,
                2649
            ],
            [
                2708,
                2715
            ],
            [
                2768,
                2776
            ],
            [
                2776,
                2778
            ],
            [
                2789,
                2799
            ],
            [
                2822,
                2826
            ],
            [
                2803,
                2821
            ],
            [
                2838,
                2839
            ],
            [
                2865,
                2868
            ],
            [
                2876,
                2913
            ],
            [
                2913,
                2930
            ],
            [
                2958,
                3082
            ],
            [
                3082,
                3141
            ],
            [
                3142,
                3237
            ],
            [
                3252,
                3306
            ],
            [
                3306,
                3315
            ],
            [
                3335,
                3409
            ],
            [
                3436,
                3438
            ],
            [
                3927,
                3931
            ],
            [
                3753,
                3764
            ],
            [
                3793,
                3804
            ],
            [
                3806,
                3825
            ],
            [
                3764,
                3765
            ],
            [
                3894,
                3908
            ],
            [
                3876,
                3879
            ],
            [
                3863,
                3875
            ],
            [
                3936,
                3937
            ],
            [
                3938,
                3939
            ],
            [
                3981,
                4042
            ],
            [
                4042,
                4050
            ],
            [
                4056,
                4079
            ],
            [
                4106,
                4138
            ],
            [
                4083,
                4086
            ],
            [
                4138,
                4140
            ],
            [
                4140,
                4188
            ],
            [
                4199,
                4203
            ],
            [
                4209,
                4223
            ],
            [
                4310,
                4326
            ],
            [
                4260,
                4262
            ],
            [
                4399,
                4419
            ],
            [
                4515,
                4614
            ],
            [
                4640,
                4668
            ],
            [
                4668,
                4676
            ],
            [
                4678,
                4696
            ],
            [
                4697,
                4703
            ],
            [
                4720,
                4732
            ],
            [
                4734,
                4747
            ],
            [
                4750,
                4812
            ],
            [
                4835,
                4863
            ],
            [
                4906,
                4909
            ],
            [
                4942,
                4954
            ],
            [
                4955,
                4966
            ],
            [
                4967,
                4988
            ],
            [
                5056,
                5074
            ],
            [
                5076,
                5149
            ],
            [
                5149,
                5185
            ],
            [
                5226,
                5232
            ],
            [
                5232,
                5320
            ],
            [
                5423,
                5430
            ],
            [
                5485,
                5504
            ],
            [
                5551,
                5553
            ],
            [
                5557,
                5581
            ],
            [
                5585,
                5587
            ],
            [
                5608,
                5610
            ],
            [
                5646,
                5744
            ],
            [
                5744,
                5817
            ],
            [
                5817,
                5851
            ],
            [
                5882,
                5889
            ],
            [
                5926,
                5930
            ],
            [
                5945,
                5947
            ],
            [
                6026,
                6143
            ],
            [
                6376,
                6379
            ],
            [
                6402,
                6419
            ],
            [
                6380,
                6382
            ],
            [
                6389,
                6391
            ],
            [
                6392,
                6396
            ],
            [
                6430,
                6433
            ],
            [
                6488,
                6503
            ],
            [
                6503,
                6554
            ],
            [
                6569,
                6646
            ],
            [
                6651,
                6657
            ],
            [
                6688,
                6705
            ],
            [
                6770,
                6821
            ],
            [
                6821,
                6823
            ],
            [
                6846,
                6933
            ],
            [
                6945,
                6955
            ],
            [
                6955,
                6969
            ],
            [
                7018,
                7019
            ],
            [
                6970,
                7018
            ],
            [
                7142,
                7144
            ],
            [
                7144,
                7171
            ],
            [
                7233,
                7274
            ],
            [
                7274,
                7314
            ],
            [
                7386,
                7437
            ],
            [
                7437,
                7488
            ],
            [
                7499,
                7513
            ],
            [
                7522,
                7524
            ],
            [
                7524,
                7624
            ],
            [
                7626,
                7632
            ],
            [
                7640,
                7642
            ],
            [
                7658,
                7661
            ],
            [
                7671,
                7673
            ],
            [
                8681,
                8683
            ],
            [
                8705,
                8707
            ],
            [
                8699,
                8704
            ],
            [
                8708,
                8710
            ],
            [
                8640,
                8645
            ],
            [
                8718,
                8760
            ],
            [
                8761,
                8789
            ],
            [
                8817,
                8839
            ],
            [
                8868,
                8915
            ],
            [
                8920,
                8935
            ],
            [
                9013,
                9060
            ],
            [
                9075,
                9089
            ],
            [
                9089,
                9116
            ],
            [
                9122,
                9149
            ],
            [
                9158,
                9159
            ],
            [
                9245,
                9247
            ],
            [
                9895,
                9897
            ],
            [
                9900,
                9915
            ],
            [
                9933,
                9948
            ],
            [
                9950,
                9984
            ],
            [
                9985,
                10025
            ],
            [
                10032,
                10035
            ],
            [
                10035,
                10039
            ],
            [
                10054,
                10056
            ],
            [
                10056,
                10104
            ],
            [
                10123,
                10171
            ],
            [
                10171,
                10192
            ],
            [
                10192,
                10204
            ],
            [
                10214,
                10216
            ],
            [
                10255,
                10315
            ],
            [
                10315,
                10359
            ],
            [
                10397,
                10426
            ],
            [
                10426,
                10477
            ],
            [
                10477,
                10562
            ],
            [
                10596,
                10619
            ],
            [
                10619,
                10680
            ],
            [
                10680,
                10699
            ],
            [
                10702,
                10758
            ],
            [
                10758,
                10762
            ],
            [
                10776,
                10810
            ],
            [
                10822,
                10824
            ],
            [
                10824,
                10857
            ],
            [
                10857,
                10860
            ],
            [
                10880,
                10883
            ],
            [
                10873,
                10878
            ],
            [
                10884,
                10919
            ],
            [
                10940,
                11066
            ],
            [
                11066,
                11133
            ],
            [
                11133,
                11181
            ],
            [
                11181,
                11219
            ],
            [
                11238,
                11263
            ],
            [
                11273,
                11303
            ],
            [
                11303,
                11315
            ],
            [
                11343,
                11372
            ],
            [
                11420,
                11446
            ],
            [
                11447,
                11499
            ],
            [
                11517,
                11519
            ],
            [
                11519,
                11547
            ],
            [
                11547,
                11568
            ],
            [
                11575,
                11596
            ],
            [
                11630,
                11661
            ],
            [
                11666,
                11672
            ],
            [
                11672,
                11678
            ],
            [
                11691,
                11718
            ],
            [
                11793,
                11807
            ],
            [
                11812,
                11827
            ],
            [
                11837,
                11846
            ],
            [
                11856,
                11944
            ],
            [
                11975,
                12021
            ],
            [
                12022,
                12079
            ],
            [
                12087,
                12098
            ],
            [
                12099,
                12118
            ],
            [
                13198,
                13307
            ],
            [
                13309,
                13327
            ],
            [
                13307,
                13308
            ],
            [
                13328,
                13330
            ],
            [
                13357,
                13360
            ],
            [
                13347,
                13356
            ],
            [
                13376,
                13399
            ],
            [
                13427,
                13429
            ],
            [
                13429,
                13462
            ],
            [
                13662,
                13729
            ],
            [
                13775,
                13801
            ],
            [
                13809,
                13836
            ],
            [
                13754,
                13759
            ],
            [
                13841,
                13857
            ],
            [
                13857,
                13910
            ],
            [
                13942,
                13943
            ],
            [
                13945,
                13957
            ],
            [
                13970,
                13985
            ],
            [
                13991,
                14032
            ],
            [
                14033,
                14131
            ],
            [
                14131,
                14134
            ],
            [
                14141,
                14166
            ],
            [
                14166,
                14212
            ],
            [
                14212,
                14317
            ],
            [
                14321,
                14348
            ],
            [
                14348,
                14377
            ],
            [
                14397,
                14399
            ],
            [
                14399,
                14431
            ],
            [
                14444,
                14446
            ],
            [
                14446,
                14453
            ],
            [
                14473,
                14504
            ],
            [
                14531,
                14532
            ],
            [
                14533,
                14570
            ],
            [
                14584,
                14616
            ],
            [
                14616,
                14617
            ],
            [
                14667,
                14675
            ],
            [
                14687,
                14695
            ],
            [
                14628,
                14651
            ],
            [
                14772,
                14798
            ],
            [
                14798,
                14828
            ],
            [
                14929,
                14965
            ],
            [
                14965,
                14978
            ],
            [
                14989,
                14991
            ],
            [
                14991,
                15014
            ],
            [
                15014,
                15102
            ],
            [
                15152,
                15158
            ],
            [
                15130,
                15135
            ],
            [
                15181,
                15206
            ],
            [
                15206,
                15207
            ],
            [
                15211,
                15253
            ],
            [
                15257,
                15271
            ],
            [
                15290,
                15315
            ],
            [
                15353,
                15355
            ],
            [
                15355,
                15358
            ],
            [
                15364,
                15427
            ],
            [
                15427,
                15471
            ],
            [
                15471,
                15480
            ],
            [
                15480,
                15519
            ],
            [
                15540,
                15553
            ],
            [
                15524,
                15533
            ],
            [
                15553,
                15555
            ],
            [
                15555,
                15568
            ],
            [
                15644,
                15654
            ],
            [
                15578,
                15612
            ],
            [
                15662,
                15664
            ],
            [
                15664,
                15704
            ],
            [
                15704,
                15708
            ],
            [
                15743,
                15783
            ],
            [
                15806,
                15816
            ],
            [
                15867,
                15879
            ],
            [
                15835,
                15853
            ],
            [
                15880,
                15888
            ],
            [
                15853,
                15854
            ],
            [
                15918,
                15925
            ],
            [
                15939,
                15946
            ],
            [
                16019,
                16025
            ],
            [
                16054,
                16066
            ],
            [
                16098,
                16101
            ],
            [
                16125,
                16151
            ],
            [
                16102,
                16107
            ],
            [
                16155,
                16157
            ],
            [
                16157,
                16192
            ],
            [
                16192,
                16209
            ],
            [
                16301,
                16306
            ],
            [
                16313,
                16345
            ],
            [
                16345,
                16519
            ],
            [
                16524,
                16529
            ],
            [
                16609,
                16661
            ],
            [
                16661,
                16679
            ],
            [
                16725,
                16728
            ],
            [
                16680,
                16704
            ],
            [
                17086,
                17121
            ],
            [
                17121,
                17124
            ],
            [
                17164,
                17180
            ],
            [
                17180,
                17202
            ],
            [
                17209,
                17246
            ],
            [
                17283,
                17319
            ],
            [
                17348,
                17350
            ],
            [
                17350,
                17371
            ],
            [
                17375,
                17414
            ],
            [
                17414,
                17419
            ],
            [
                17454,
                17463
            ],
            [
                17463,
                17489
            ],
            [
                17492,
                17521
            ],
            [
                17521,
                17550
            ],
            [
                17550,
                17585
            ],
            [
                17585,
                17605
            ],
            [
                17643,
                17645
            ],
            [
                17645,
                17668
            ],
            [
                17670,
                17680
            ],
            [
                17760,
                17777
            ],
            [
                17792,
                17804
            ],
            [
                17804,
                17819
            ],
            [
                17819,
                17855
            ],
            [
                17855,
                17905
            ],
            [
                17905,
                17924
            ],
            [
                17924,
                17974
            ],
            [
                17974,
                17985
            ],
            [
                18008,
                18041
            ],
            [
                18041,
                18047
            ],
            [
                18053,
                18109
            ],
            [
                18111,
                18157
            ],
            [
                18163,
                18166
            ],
            [
                18166,
                18198
            ],
            [
                18200,
                18230
            ],
            [
                18238,
                18256
            ]
        ],
        "row_chars": [
            [
                0,
                89
            ],
            [
                89,
                217
            ],
            [
                217,
                441
            ],
            [
                441,
                486
            ],
            [
                486,
                571
            ],
            [
                571,
                626
            ],
            [
                626,
                723
            ],
            [
                723,
                777
            ],
            [
                777,
                820
            ],
            [
                820,
                916
            ],
            [
                916,
                984
            ],
            [
                984,
                1021
            ],
            [
                1021,
                1060
            ],
            [
                1060,
                1080
            ],
            [
                1080,
                1141
            ],
            [
                1141,
                1234
            ],
            [
                1234,
                1298
            ],
            [
                1298,
                1371
            ],
            [
                1371,
                1500
            ],
            [
                1500,
                1597
            ],
            [
                1597,
                1851
            ],
            [
                1851,
                1875
            ],
            [
                1875,
                2077
            ],
            [
                2077,
                2214
            ],
            [
                2214,
                2450
            ],
            [
                2450,
                2575
            ],
            [
                2575,
                2776
            ],
            [
                2776,
                2913
            ],
            [
                2913,
                3082
            ],
            [
                3082,
                3142
            ],
            [
                3142,
                3306
            ],
            [
                3306,
                3439
            ],
            [
                3439,
                3593
            ],
            [
                3593,
                3749
            ],
            [
                3749,
                3938
            ],
            [
                3938,
                4042
            ],
            [
                4042,
                4140
            ],
            [
                4140,
                4223
            ],
            [
                4223,
                4419
            ],
            [
                4419,
                4668
            ],
            [
                4668,
                4955
            ],
            [
                4955,
                5149
            ],
            [
                5149,
                5232
            ],
            [
                5232,
                5553
            ],
            [
                5553,
                5610
            ],
            [
                5610,
                5646
            ],
            [
                5646,
                5744
            ],
            [
                5744,
                5817
            ],
            [
                5817,
                5947
            ],
            [
                5947,
                6026
            ],
            [
                6026,
                6144
            ],
            [
                6144,
                6282
            ],
            [
                6282,
                6376
            ],
            [
                6376,
                6503
            ],
            [
                6503,
                6705
            ],
            [
                6705,
                6770
            ],
            [
                6770,
                6821
            ],
            [
                6821,
                6955
            ],
            [
                6955,
                7144
            ],
            [
                7144,
                7274
            ],
            [
                7274,
                7315
            ],
            [
                7315,
                7382
            ],
            [
                7382,
                7437
            ],
            [
                7437,
                7524
            ],
            [
                7524,
                7673
            ],
            [
                7673,
                7735
            ],
            [
                7735,
                7885
            ],
            [
                7885,
                7994
            ],
            [
                7994,
                8052
            ],
            [
                8052,
                8242
            ],
            [
                8242,
                8307
            ],
            [
                8307,
                8350
            ],
            [
                8350,
                8387
            ],
            [
                8387,
                8568
            ],
            [
                8568,
                8761
            ],
            [
                8761,
                8915
            ],
            [
                8915,
                9089
            ],
            [
                9089,
                9897
            ],
            [
                9897,
                9985
            ],
            [
                9985,
                10035
            ],
            [
                10035,
                10056
            ],
            [
                10056,
                10171
            ],
            [
                10171,
                10192
            ],
            [
                10192,
                10216
            ],
            [
                10216,
                10255
            ],
            [
                10255,
                10315
            ],
            [
                10315,
                10359
            ],
            [
                10359,
                10397
            ],
            [
                10397,
                10426
            ],
            [
                10426,
                10477
            ],
            [
                10477,
                10562
            ],
            [
                10562,
                10596
            ],
            [
                10596,
                10619
            ],
            [
                10619,
                10680
            ],
            [
                10680,
                10758
            ],
            [
                10758,
                10824
            ],
            [
                10824,
                10857
            ],
            [
                10857,
                10919
            ],
            [
                10919,
                11066
            ],
            [
                11066,
                11133
            ],
            [
                11133,
                11181
            ],
            [
                11181,
                11220
            ],
            [
                11220,
                11238
            ],
            [
                11238,
                11303
            ],
            [
                11303,
                11447
            ],
            [
                11447,
                11519
            ],
            [
                11519,
                11547
            ],
            [
                11547,
                11599
            ],
            [
                11599,
                11629
            ],
            [
                11629,
                11672
            ],
            [
                11672,
                11719
            ],
            [
                11719,
                11793
            ],
            [
                11793,
                11945
            ],
            [
                11945,
                12022
            ],
            [
                12022,
                12099
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                12160
            ],
            [
                12160,
                12229
            ],
            [
                12229,
                12281
            ],
            [
                12281,
                12297
            ],
            [
                12297,
                12332
            ],
            [
                12332,
                12365
            ],
            [
                12365,
                12485
            ],
            [
                12485,
                12512
            ],
            [
                12512,
                12555
            ],
            [
                12555,
                12703
            ],
            [
                12703,
                12747
            ],
            [
                12747,
                12793
            ],
            [
                12793,
                12845
            ],
            [
                12845,
                12878
            ],
            [
                12878,
                12939
            ],
            [
                12939,
                12987
            ],
            [
                12987,
                13045
            ],
            [
                13045,
                13120
            ],
            [
                13120,
                13143
            ],
            [
                13143,
                13172
            ],
            [
                13172,
                13429
            ],
            [
                13429,
                13463
            ],
            [
                13463,
                13662
            ],
            [
                13662,
                13857
            ],
            [
                13857,
                14033
            ],
            [
                14033,
                14131
            ],
            [
                14131,
                14166
            ],
            [
                14166,
                14212
            ],
            [
                14212,
                14348
            ],
            [
                14348,
                14399
            ],
            [
                14399,
                14446
            ],
            [
                14446,
                14533
            ],
            [
                14533,
                14616
            ],
            [
                14616,
                14697
            ],
            [
                14697,
                14772
            ],
            [
                14772,
                14798
            ],
            [
                14798,
                14831
            ],
            [
                14831,
                14879
            ],
            [
                14879,
                14895
            ],
            [
                14895,
                14929
            ],
            [
                14929,
                14965
            ],
            [
                14965,
                14991
            ],
            [
                14991,
                15014
            ],
            [
                15014,
                15104
            ],
            [
                15104,
                15206
            ],
            [
                15206,
                15355
            ],
            [
                15355,
                15427
            ],
            [
                15427,
                15471
            ],
            [
                15471,
                15480
            ],
            [
                15480,
                15555
            ],
            [
                15555,
                15664
            ],
            [
                15664,
                15704
            ],
            [
                15704,
                15783
            ],
            [
                15783,
                15948
            ],
            [
                15948,
                16019
            ],
            [
                16019,
                16069
            ],
            [
                16069,
                16097
            ],
            [
                16097,
                16157
            ],
            [
                16157,
                16192
            ],
            [
                16192,
                16345
            ],
            [
                16345,
                16531
            ],
            [
                16531,
                16609
            ],
            [
                16609,
                16661
            ],
            [
                16661,
                16730
            ],
            [
                16730,
                16767
            ],
            [
                16767,
                16868
            ],
            [
                16868,
                16984
            ],
            [
                16984,
                17015
            ],
            [
                17015,
                17086
            ],
            [
                17086,
                17121
            ],
            [
                17121,
                17180
            ],
            [
                17180,
                17248
            ],
            [
                17248,
                17283
            ],
            [
                17283,
                17350
            ],
            [
                17350,
                17375
            ],
            [
                17375,
                17414
            ],
            [
                17414,
                17463
            ],
            [
                17463,
                17521
            ],
            [
                17521,
                17550
            ],
            [
                17550,
                17585
            ],
            [
                17585,
                17645
            ],
            [
                17645,
                17680
            ],
            [
                17680,
                17760
            ],
            [
                17760,
                17804
            ],
            [
                17804,
                17819
            ],
            [
                17819,
                17855
            ],
            [
                17855,
                17905
            ],
            [
                17905,
                17924
            ],
            [
                17924,
                17974
            ],
            [
                17974,
                18041
            ],
            [
                18041,
                18166
            ],
            [
                18166,
                18256
            ]
        ]
    },
    "abridged": {
        "text": "Paul Montague had other troubles on his mind. It was now more than a fortnight since he had taken Mrs. Hurtle to the play. He had seen her twice since, once on the following day, when she had not mentioned their engagement, and again, three or four days afterwards, when the meeting was by no means so pleasant. She had wept and stormed. She had dared him to be false to her. Did he deny that he had promised to marry her? Were his visits not a repetition of that promise? And then she became soft, and pleaded.\nBut for the storm, he might have given way. Her tears and pleadings touched him. He had loved her and had won her love. And she was lovely. It was impossible to drive her away from him. She would look up in his face and he could not help embracing her. Then there had come a passionate flood of tears and she was in his arms. How he had escaped he hardly knew, but he did know that he had promised to be with her again in two days.\nOn the day he wrote her a letter excusing himself. He had been summoned, he said, to Liverpool on business connected with the great American railway, and must postpone seeing her till his return. This was true. He had been corresponding with a Mr. Ramsbottom at Liverpool since having become a partner in the house of Fisker, Montague, and Montague. Mr. Ramsbottom, whom he consulted and trusted, had suggested that he should come to him at Liverpool. He went, and his conduct at the Board was the result of the advice which he had received.\nIn Liverpool he heard tidings of Mrs. Hurtle, though hardly trustworthy information. The lady, after landing from an American steamer, had inquired for Paul, in a manner that Mr. Ramsbottom thought indicated danger. He had spoken about her with a fellow-traveller, who had said that Mrs. Hurtle was \"a queer card.\" \"On board ship we reckoned she was about the handsomest woman we had ever seen, but we all said that there was a bit of the wild cat in her breeding.\" Then Mr. Ramsbottom had asked whether the lady was a widow.\n\"There was a man on board from Kansas,\" said the fellow-traveller, \"who knew a man named Hurtle, who was separated from his wife and is still alive. There was a queer story about the man and his wife having fought a duel with pistols.\"\nThis information about Mrs. Hurtle could only be given to Paul face to face, which is why Mr. Ramsbottom had invited him to Liverpool.\n\"It is as well that you should know,\" his friend said to him. Paul had thanked him, not daring to speak of his own difficulties with the lady.\nIn all this there had been increased dismay, but also some comfort. Sometimes Paul had doubted whether he should break off his engagement. When she assured him that she had given up everything in life for him, and threw her arms round him - then he would almost yield. But when what the traveller had called the wild cat showed itself - and when, having escaped from her, he thought of Hetta Carbury - he was fully determined that he would not marry Mrs. Hurtle.\nThat he was tangled in a mass of troubles he was well aware; but if it were true that Mr. Hurtle was alive, that fact might help him. She certainly had declared him to be dead. And if it were true also that she had fought a duel with one husband, that also ought to justify him in breaking from his engagement.\nHe must make up his mind what to do. If he meant to reject the lady finally on the score of her being a wild cat, he must tell her so. He felt very strongly that he must not flinch from the wild cat's claws. That he would have to undergo some mauling and clawing, he understood. He must tell her to her face that he was not satisfied with her past life, and that therefore he would not marry her.\nBut before he saw her it would be as well to get some real evidence. He returned from Liverpool to London on the morning on which the Board was held, and thought even more of all this than he did of his attack on Mr. Melmotte. The husband's name had been Caradoc Carson Hurtle. If he had been seen in the State of Kansas within the last two years, that certainly would be evidence. As to the duel, he felt that it might be very hard to prove that. But there was a rumour also that she had shot a gentleman in Oregon. Could he get at the truth of that story?\nHowever, this detective's work was very distasteful to him. After having had the woman in his arms how could he make such inquiries? And it would be almost necessary that he should take her in his arms again while he was making them, unless he told her outright that he would not marry her because of what he had heard. In so doing he might incur the fate of the gentleman in Oregon.\nAt any rate he would declare the ground on which he considered himself free, and would bear the consequences. This was the resolve in his mind when he rose up to attack Mr. Melmotte at the Board.\nWhen the Board was over, he went down to the Beargarden, where he often dined. This evening he sat with Nidderdale, at the young lord's instigation.\n\"What made you so savage at old Melmotte today?\" said Nidderdale.\n\"I didn't mean to be savage, but I think that as Directors we ought to know something about it.\"\n\"I suppose we ought. I don't know. I can't make out why the mischief they made me a Director.\"\n\"Because you're a lord,\" said Paul bluntly.\n\"But what good can I do them? Nobody thinks that I know anything about business. Of course I'm in Parliament, but I don't often go there unless they want me to vote. I can't understand it. The Governor said that I was to do it, and so I've done it.\"\n\"They say, you know - there's something between you and Melmotte's daughter.\"\n\"But what has that to do with a railway? And why should Carbury be there? And why on earth should old Grendall be a Director? If you were to pick out the two most hopeless men in London in regard to money, they would be old Grendall and young Carbury. I've been thinking a good deal about it, and I can't make it out.\"\n\"I have been thinking about it too,\" said Paul.\n\"I suppose old Melmotte is all right?\"\nThis was a question which Paul found it difficult to answer. How could he whisper suspicions to the man who was a competitor for Marie Melmotte's hand?\n\"You can speak out to me, you know,\" said Nidderdale.\n\"I've got nothing to speak. People say that he is the richest man alive. I don't see why it shouldn't be true. Nobody knows very much about him.\"\nIt occurred to Nidderdale that he would \"come a cropper\" were he to marry Melmotte's daughter for her money, and then find that she had got none. After dinner he invited Montague to go up to the card-room.\n\"Carbury, and Grasslough, and Dolly Longestaffe are there,\" he said.\nBut Paul declined. He left the club, and slowly sauntered northwards through the streets till he found himself in Welbeck Street; he hardly knew why. He had certainly intended to call on Lady Carbury. But his mind was full of Mrs. Hurtle.\nAnd, indeed, he was still under some promise made to Roger Carbury, that for a certain period, still unexpired, he would not ask Hetta to be his wife. It had been a foolish promise, made and then repented; but still it existed, and Paul knew that Roger trusted that it would be kept.\nNevertheless Paul made his way up to Welbeck Street and almost unconsciously knocked at the door. No; Lady Carbury was not at home. She was out somewhere with Mr. Roger Carbury. Up to that moment Paul had not heard that Roger was in town; but the reader may remember that he had come in search of Ruby Ruggles. Miss Carbury was at home, the servant said. Would Mr. Montague go up and see her? Without considering, Mr. Montague said that he would.\n\"Mamma is out with Roger,\" said Hetta, trying to save herself from confusion. \"She made him take her to some soire of learned people.\"\n\"I am so glad to see you. What an age it is since we met. What has brought Roger up to town?\"\n\"I don't know. Some mystery, I think. Whenever there is a mystery I am always afraid that there is something wrong about Felix.\"\n\"I saw Felix today, at the Railway Board.\"\n\"Roger says the Railway Board is all a sham.\" Paul could not help blushing as he heard this. \"And there is something going on about that horrid man's daughter.\"\n\"She is to marry Lord Nidderdale, I think.\"\n\"Is she? They are talking of her marrying Felix, for her money of course. And I believe Mr. Melmotte is determined to quarrel with them. It's all horrid from beginning to end.\"\n\"But today they seemed to be the greatest friends. Mr. Melmotte asked your brother into an inner room with him, as if they were friends.\"\n\"Roger greatly dislikes Mr. Melmotte. And it is always safe to trust Roger. Don't you think so, Mr. Montague?\" Paul did think so; but he found the subject difficult. \"Of course I will never go against mamma,\" continued Hetta, \"but I always feel that my Cousin Roger is a rock of strength, so that if one did whatever he said one would never go wrong.\"\n\"No one has more reason to praise him than I have.\"\n\"I think everybody who knows him has reason to praise him.\"\n\"Is he the only man you can trust? But I should not contradict you. Roger Carbury has been the best friend that any man ever had.\"\n\"I didn't say he was the only person. But of all my friends-\"\n\"Am I among the number, Miss Carbury?\"\n\"Yes; why not? Of course you are a friend - because you are his friend.\"\n\"Look here, Hetta,\" he said. \"It is no good going on like this. I love Roger Carbury. He is all that you say, and more. He is a gentleman every inch. He never lies. He never takes what is not his own. I believe he does love his neighbour as himself.\"\n\"Oh, Mr. Montague! I am so glad to hear you speak of him like that.\"\n\"I love him as well as a man can love a man. If you say that you love him as well as a woman can love a man, I will leave England at once, and never return.\"\n\"There's mamma,\" said Henrietta; for at that moment there was a knock at the door.",
        "paragraph_chars": [
            [
                0,
                512
            ],
            [
                512,
                944
            ],
            [
                944,
                1486
            ],
            [
                1486,
                2012
            ],
            [
                2012,
                2248
            ],
            [
                2248,
                2383
            ],
            [
                2383,
                2526
            ],
            [
                2526,
                2989
            ],
            [
                2989,
                3300
            ],
            [
                3300,
                3697
            ],
            [
                3697,
                4255
            ],
            [
                4255,
                4639
            ],
            [
                4639,
                4835
            ],
            [
                4835,
                4984
            ],
            [
                4984,
                5050
            ],
            [
                5050,
                5147
            ],
            [
                5147,
                5242
            ],
            [
                5242,
                5286
            ],
            [
                5286,
                5536
            ],
            [
                5536,
                5614
            ],
            [
                5614,
                5933
            ],
            [
                5933,
                5981
            ],
            [
                5981,
                6020
            ],
            [
                6020,
                6172
            ],
            [
                6172,
                6226
            ],
            [
                6226,
                6372
            ],
            [
                6372,
                6578
            ],
            [
                6578,
                6647
            ],
            [
                6647,
                6886
            ],
            [
                6886,
                7170
            ],
            [
                7170,
                7617
            ],
            [
                7617,
                7752
            ],
            [
                7752,
                7846
            ],
            [
                7846,
                7975
            ],
            [
                7975,
                8018
            ],
            [
                8018,
                8179
            ],
            [
                8179,
                8223
            ],
            [
                8223,
                8400
            ],
            [
                8400,
                8538
            ],
            [
                8538,
                8890
            ],
            [
                8890,
                8942
            ],
            [
                8942,
                9002
            ],
            [
                9002,
                9133
            ],
            [
                9133,
                9195
            ],
            [
                9195,
                9234
            ],
            [
                9234,
                9307
            ],
            [
                9307,
                9558
            ],
            [
                9558,
                9627
            ],
            [
                9627,
                9785
            ],
            [
                9785,
                9867
            ]
        ],
        "segment_chars": [
            [
                0,
                46
            ],
            [
                46,
                123
            ],
            [
                123,
                312
            ],
            [
                312,
                338
            ],
            [
                338,
                376
            ],
            [
                376,
                423
            ],
            [
                423,
                473
            ],
            [
                473,
                512
            ],
            [
                512,
                556
            ],
            [
                556,
                593
            ],
            [
                593,
                632
            ],
            [
                632,
                652
            ],
            [
                652,
                698
            ],
            [
                698,
                765
            ],
            [
                765,
                838
            ],
            [
                838,
                944
            ],
            [
                944,
                995
            ],
            [
                995,
                1140
            ],
            [
                1140,
                1155
            ],
            [
                1155,
                1294
            ],
            [
                1294,
                1396
            ],
            [
                1396,
                1486
            ],
            [
                1486,
                1571
            ],
            [
                1571,
                1702
            ],
            [
                1702,
                1801
            ],
            [
                1801,
                1952
            ],
            [
                1952,
                2012
            ],
            [
                2012,
                2161
            ],
            [
                2161,
                2248
            ],
            [
                2248,
                2383
            ],
            [
                2383,
                2445
            ],
            [
                2445,
                2526
            ],
            [
                2526,
                2594
            ],
            [
                2594,
                2665
            ],
            [
                2665,
                2795
            ],
            [
                2795,
                2989
            ],
            [
                2989,
                3123
            ],
            [
                3123,
                3166
            ],
            [
                3166,
                3300
            ],
            [
                3300,
                3337
            ],
            [
                3337,
                3435
            ],
            [
                3435,
                3508
            ],
            [
                3508,
                3579
            ],
            [
                3579,
                3697
            ],
            [
                3697,
                3766
            ],
            [
                3766,
                3924
            ],
            [
                3924,
                3975
            ],
            [
                3975,
                4079
            ],
            [
                4079,
                4145
            ],
            [
                4145,
                4214
            ],
            [
                4214,
                4255
            ],
            [
                4255,
                4315
            ],
            [
                4315,
                4388
            ],
            [
                4388,
                4575
            ],
            [
                4575,
                4639
            ],
            [
                4639,
                4749
            ],
            [
                4749,
                4835
            ],
            [
                4835,
                4914
            ],
            [
                4914,
                4984
            ],
            [
                4984,
                5033
            ],
            [
                5033,
                5050
            ],
            [
                5050,
                5147
            ],
            [
                5147,
                5168
            ],
            [
                5168,
                5182
            ],
            [
                5182,
                5242
            ],
            [
                5242,
                5286
            ],
            [
                5286,
                5316
            ],
            [
                5316,
                5367
            ],
            [
                5367,
                5452
            ],
            [
                5452,
                5475
            ],
            [
                5475,
                5536
            ],
            [
                5536,
                5614
            ],
            [
                5614,
                5655
            ],
            [
                5655,
                5688
            ],
            [
                5688,
                5740
            ],
            [
                5740,
                5866
            ],
            [
                5866,
                5933
            ],
            [
                5933,
                5981
            ],
            [
                5981,
                6020
            ],
            [
                6020,
                6081
            ],
            [
                6081,
                6172
            ],
            [
                6172,
                6226
            ],
            [
                6226,
                6254
            ],
            [
                6254,
                6299
            ],
            [
                6299,
                6337
            ],
            [
                6337,
                6372
            ],
            [
                6372,
                6518
            ],
            [
                6518,
                6578
            ],
            [
                6578,
                6647
            ],
            [
                6647,
                6666
            ],
            [
                6666,
                6797
            ],
            [
                6797,
                6848
            ],
            [
                6848,
                6886
            ],
            [
                6886,
                7037
            ],
            [
                7037,
                7170
            ],
            [
                7170,
                7268
            ],
            [
                7268,
                7302
            ],
            [
                7302,
                7348
            ],
            [
                7348,
                7481
            ],
            [
                7481,
                7525
            ],
            [
                7525,
                7563
            ],
            [
                7563,
                7617
            ],
            [
                7617,
                7695
            ],
            [
                7695,
                7752
            ],
            [
                7752,
                7778
            ],
            [
                7778,
                7810
            ],
            [
                7810,
                7846
            ],
            [
                7846,
                7861
            ],
            [
                7861,
                7884
            ],
            [
                7884,
                7975
            ],
            [
                7975,
                8018
            ],
            [
                8018,
                8064
            ],
            [
                8064,
                8111
            ],
            [
                8111,
                8179
            ],
            [
                8179,
                8223
            ],
            [
                8223,
                8232
            ],
            [
                8232,
                8297
            ],
            [
                8297,
                8360
            ],
            [
                8360,
                8400
            ],
            [
                8400,
                8451
            ],
            [
                8451,
                8538
            ],
            [
                8538,
                8576
            ],
            [
                8576,
                8614
            ],
            [
                8614,
                8649
            ],
            [
                8649,
                8704
            ],
            [
                8704,
                8890
            ],
            [
                8890,
                8942
            ],
            [
                8942,
                9002
            ],
            [
                9002,
                9037
            ],
            [
                9037,
                9070
            ],
            [
                9070,
                9133
            ],
            [
                9133,
                9171
            ],
            [
                9171,
                9195
            ],
            [
                9195,
                9234
            ],
            [
                9234,
                9249
            ],
            [
                9249,
                9307
            ],
            [
                9307,
                9336
            ],
            [
                9336,
                9371
            ],
            [
                9371,
                9393
            ],
            [
                9393,
                9427
            ],
            [
                9427,
                9457
            ],
            [
                9457,
                9472
            ],
            [
                9472,
                9508
            ],
            [
                9508,
                9558
            ],
            [
                9558,
                9577
            ],
            [
                9577,
                9627
            ],
            [
                9627,
                9672
            ],
            [
                9672,
                9785
            ],
            [
                9785,
                9867
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                46
            ],
            [
                46,
                121
            ],
            [
                121,
                123
            ],
            [
                123,
                144
            ],
            [
                150,
                183
            ],
            [
                206,
                312
            ],
            [
                312,
                324
            ],
            [
                325,
                328
            ],
            [
                329,
                338
            ],
            [
                338,
                341
            ],
            [
                342,
                376
            ],
            [
                376,
                382
            ],
            [
                383,
                423
            ],
            [
                428,
                431
            ],
            [
                439,
                442
            ],
            [
                443,
                473
            ],
            [
                473,
                481
            ],
            [
                482,
                510
            ],
            [
                510,
                511
            ],
            [
                512,
                529
            ],
            [
                531,
                556
            ],
            [
                556,
                569
            ],
            [
                570,
                579
            ],
            [
                580,
                591
            ],
            [
                591,
                593
            ],
            [
                593,
                632
            ],
            [
                632,
                652
            ],
            [
                652,
                698
            ],
            [
                698,
                744
            ],
            [
                760,
                765
            ],
            [
                765,
                838
            ],
            [
                838,
                930
            ],
            [
                934,
                942
            ],
            [
                942,
                944
            ],
            [
                944,
                954
            ],
            [
                955,
                963
            ],
            [
                964,
                993
            ],
            [
                993,
                995
            ],
            [
                995,
                1050
            ],
            [
                1051,
                1092
            ],
            [
                1092,
                1139
            ],
            [
                1140,
                1155
            ],
            [
                1155,
                1187
            ],
            [
                1203,
                1215
            ],
            [
                1222,
                1228
            ],
            [
                1229,
                1294
            ],
            [
                1296,
                1308
            ],
            [
                1308,
                1309
            ],
            [
                1315,
                1317
            ],
            [
                1318,
                1327
            ],
            [
                1328,
                1331
            ],
            [
                1332,
                1339
            ],
            [
                1339,
                1396
            ],
            [
                1396,
                1398
            ],
            [
                1403,
                1433
            ],
            [
                1438,
                1484
            ],
            [
                1484,
                1486
            ],
            [
                1486,
                1501
            ],
            [
                1502,
                1538
            ],
            [
                1539,
                1545
            ],
            [
                1546,
                1571
            ],
            [
                1571,
                1579
            ],
            [
                1579,
                1580
            ],
            [
                1581,
                1619
            ],
            [
                1619,
                1620
            ],
            [
                1621,
                1624
            ],
            [
                1634,
                1637
            ],
            [
                1638,
                1642
            ],
            [
                1644,
                1655
            ],
            [
                1656,
                1660
            ],
            [
                1661,
                1675
            ],
            [
                1676,
                1683
            ],
            [
                1694,
                1702
            ],
            [
                1702,
                1704
            ],
            [
                1705,
                1715
            ],
            [
                1726,
                1730
            ],
            [
                1731,
                1749
            ],
            [
                1749,
                1750
            ],
            [
                1755,
                1758
            ],
            [
                1764,
                1801
            ],
            [
                1801,
                1818
            ],
            [
                1828,
                1952
            ],
            [
                1952,
                2011
            ],
            [
                2012,
                2107
            ],
            [
                2107,
                2161
            ],
            [
                2161,
                2170
            ],
            [
                2171,
                2245
            ],
            [
                2245,
                2247
            ],
            [
                2248,
                2252
            ],
            [
                2253,
                2264
            ],
            [
                2271,
                2282
            ],
            [
                2283,
                2302
            ],
            [
                2323,
                2324
            ],
            [
                2338,
                2352
            ],
            [
                2353,
                2356
            ],
            [
                2369,
                2381
            ],
            [
                2381,
                2382
            ],
            [
                2383,
                2384
            ],
            [
                2384,
                2445
            ],
            [
                2445,
                2453
            ],
            [
                2454,
                2477
            ],
            [
                2478,
                2510
            ],
            [
                2516,
                2519
            ],
            [
                2524,
                2526
            ],
            [
                2526,
                2574
            ],
            [
                2575,
                2579
            ],
            [
                2580,
                2594
            ],
            [
                2604,
                2620
            ],
            [
                2629,
                2631
            ],
            [
                2645,
                2665
            ],
            [
                2665,
                2764
            ],
            [
                2767,
                2795
            ],
            [
                2795,
                2803
            ],
            [
                2804,
                2822
            ],
            [
                2827,
                2833
            ],
            [
                2834,
                2846
            ],
            [
                2847,
                2860
            ],
            [
                2863,
                2925
            ],
            [
                2928,
                2956
            ],
            [
                2966,
                2969
            ],
            [
                2976,
                2988
            ],
            [
                2989,
                3000
            ],
            [
                3009,
                3030
            ],
            [
                3031,
                3049
            ],
            [
                3050,
                3123
            ],
            [
                3123,
                3159
            ],
            [
                3160,
                3166
            ],
            [
                3166,
                3254
            ],
            [
                3255,
                3262
            ],
            [
                3279,
                3298
            ],
            [
                3298,
                3300
            ],
            [
                3300,
                3324
            ],
            [
                3330,
                3332
            ],
            [
                3335,
                3337
            ],
            [
                3337,
                3435
            ],
            [
                3435,
                3508
            ],
            [
                3508,
                3542
            ],
            [
                3555,
                3562
            ],
            [
                3562,
                3566
            ],
            [
                3577,
                3579
            ],
            [
                3579,
                3696
            ],
            [
                3697,
                3700
            ],
            [
                3701,
                3718
            ],
            [
                3719,
                3721
            ],
            [
                3728,
                3730
            ],
            [
                3734,
                3738
            ],
            [
                3742,
                3745
            ],
            [
                3751,
                3766
            ],
            [
                3766,
                3817
            ],
            [
                3818,
                3895
            ],
            [
                3900,
                3906
            ],
            [
                3907,
                3924
            ],
            [
                3924,
                3975
            ],
            [
                3975,
                3977
            ],
            [
                3981,
                4068
            ],
            [
                4069,
                4079
            ],
            [
                4079,
                4093
            ],
            [
                4093,
                4094
            ],
            [
                4095,
                4143
            ],
            [
                4143,
                4145
            ],
            [
                4145,
                4172
            ],
            [
                4173,
                4214
            ],
            [
                4214,
                4254
            ],
            [
                4264,
                4315
            ],
            [
                4315,
                4366
            ],
            [
                4372,
                4386
            ],
            [
                4386,
                4388
            ],
            [
                4388,
                4488
            ],
            [
                4489,
                4495
            ],
            [
                4496,
                4498
            ],
            [
                4504,
                4507
            ],
            [
                4573,
                4575
            ],
            [
                4575,
                4577
            ],
            [
                4578,
                4580
            ],
            [
                4581,
                4586
            ],
            [
                4587,
                4589
            ],
            [
                4590,
                4595
            ],
            [
                4596,
                4638
            ],
            [
                4639,
                4667
            ],
            [
                4668,
                4690
            ],
            [
                4702,
                4749
            ],
            [
                4754,
                4769
            ],
            [
                4773,
                4820
            ],
            [
                4821,
                4835
            ],
            [
                4835,
                4862
            ],
            [
                4863,
                4890
            ],
            [
                4890,
                4891
            ],
            [
                4898,
                4900
            ],
            [
                4912,
                4914
            ],
            [
                4914,
                4929
            ],
            [
                4934,
                4949
            ],
            [
                4949,
                4983
            ],
            [
                4984,
                5024
            ],
            [
                5030,
                5033
            ],
            [
                5033,
                5037
            ],
            [
                5048,
                5050
            ],
            [
                5050,
                5098
            ],
            [
                5099,
                5147
            ],
            [
                5147,
                5168
            ],
            [
                5168,
                5180
            ],
            [
                5180,
                5182
            ],
            [
                5182,
                5242
            ],
            [
                5242,
                5286
            ],
            [
                5287,
                5316
            ],
            [
                5316,
                5367
            ],
            [
                5367,
                5452
            ],
            [
                5452,
                5475
            ],
            [
                5475,
                5536
            ],
            [
                5536,
                5555
            ],
            [
                5558,
                5614
            ],
            [
                5614,
                5618
            ],
            [
                5619,
                5653
            ],
            [
                5653,
                5655
            ],
            [
                5655,
                5688
            ],
            [
                5688,
                5691
            ],
            [
                5692,
                5695
            ],
            [
                5699,
                5704
            ],
            [
                5705,
                5740
            ],
            [
                5740,
                5866
            ],
            [
                5866,
                5933
            ],
            [
                5933,
                5981
            ],
            [
                5981,
                6019
            ],
            [
                6020,
                6045
            ],
            [
                6051,
                6081
            ],
            [
                6081,
                6093
            ],
            [
                6102,
                6131
            ],
            [
                6145,
                6171
            ],
            [
                6172,
                6224
            ],
            [
                6224,
                6226
            ],
            [
                6226,
                6254
            ],
            [
                6254,
                6275
            ],
            [
                6276,
                6297
            ],
            [
                6299,
                6330
            ],
            [
                6331,
                6337
            ],
            [
                6337,
                6343
            ],
            [
                6344,
                6371
            ],
            [
                6372,
                6386
            ],
            [
                6398,
                6413
            ],
            [
                6418,
                6427
            ],
            [
                6429,
                6517
            ],
            [
                6531,
                6577
            ],
            [
                6578,
                6635
            ],
            [
                6635,
                6646
            ],
            [
                6647,
                6666
            ],
            [
                6666,
                6775
            ],
            [
                6777,
                6795
            ],
            [
                6795,
                6796
            ],
            [
                6797,
                6799
            ],
            [
                6800,
                6803
            ],
            [
                6804,
                6813
            ],
            [
                6823,
                6846
            ],
            [
                6846,
                6848
            ],
            [
                6852,
                6885
            ],
            [
                6886,
                6953
            ],
            [
                6954,
                6980
            ],
            [
                6987,
                7014
            ],
            [
                7015,
                7020
            ],
            [
                7021,
                7037
            ],
            [
                7037,
                7090
            ],
            [
                7090,
                7091
            ],
            [
                7092,
                7104
            ],
            [
                7112,
                7127
            ],
            [
                7128,
                7169
            ],
            [
                7170,
                7268
            ],
            [
                7268,
                7271
            ],
            [
                7277,
                7302
            ],
            [
                7302,
                7348
            ],
            [
                7348,
                7453
            ],
            [
                7454,
                7481
            ],
            [
                7481,
                7510
            ],
            [
                7523,
                7525
            ],
            [
                7525,
                7557
            ],
            [
                7561,
                7563
            ],
            [
                7563,
                7570
            ],
            [
                7584,
                7615
            ],
            [
                7615,
                7616
            ],
            [
                7617,
                7654
            ],
            [
                7663,
                7695
            ],
            [
                7695,
                7696
            ],
            [
                7696,
                7704
            ],
            [
                7709,
                7717
            ],
            [
                7726,
                7749
            ],
            [
                7752,
                7778
            ],
            [
                7778,
                7808
            ],
            [
                7810,
                7846
            ],
            [
                7846,
                7859
            ],
            [
                7859,
                7861
            ],
            [
                7861,
                7884
            ],
            [
                7884,
                7972
            ],
            [
                7975,
                7981
            ],
            [
                7982,
                7987
            ],
            [
                7993,
                8018
            ],
            [
                8018,
                8019
            ],
            [
                8019,
                8061
            ],
            [
                8064,
                8078
            ],
            [
                8084,
                8109
            ],
            [
                8109,
                8111
            ],
            [
                8112,
                8115
            ],
            [
                8116,
                8179
            ],
            [
                8179,
                8223
            ],
            [
                8223,
                8232
            ],
            [
                8232,
                8271
            ],
            [
                8272,
                8285
            ],
            [
                8286,
                8295
            ],
            [
                8295,
                8297
            ],
            [
                8297,
                8310
            ],
            [
                8313,
                8323
            ],
            [
                8324,
                8358
            ],
            [
                8358,
                8360
            ],
            [
                8360,
                8400
            ],
            [
                8400,
                8404
            ],
            [
                8411,
                8451
            ],
            [
                8453,
                8463
            ],
            [
                8470,
                8482
            ],
            [
                8483,
                8501
            ],
            [
                8502,
                8510
            ],
            [
                8510,
                8511
            ],
            [
                8515,
                8522
            ],
            [
                8528,
                8535
            ],
            [
                8538,
                8544
            ],
            [
                8562,
                8574
            ],
            [
                8576,
                8579
            ],
            [
                8580,
                8606
            ],
            [
                8607,
                8612
            ],
            [
                8612,
                8614
            ],
            [
                8614,
                8649
            ],
            [
                8649,
                8666
            ],
            [
                8666,
                8671
            ],
            [
                8672,
                8704
            ],
            [
                8704,
                8878
            ],
            [
                8882,
                8887
            ],
            [
                8890,
                8942
            ],
            [
                8942,
                8960
            ],
            [
                8971,
                8974
            ],
            [
                8975,
                8999
            ],
            [
                9002,
                9037
            ],
            [
                9037,
                9040
            ],
            [
                9054,
                9070
            ],
            [
                9070,
                9092
            ],
            [
                9093,
                9130
            ],
            [
                9133,
                9169
            ],
            [
                9169,
                9171
            ],
            [
                9171,
                9192
            ],
            [
                9195,
                9234
            ],
            [
                9234,
                9239
            ],
            [
                9240,
                9249
            ],
            [
                9249,
                9275
            ],
            [
                9278,
                9307
            ],
            [
                9307,
                9336
            ],
            [
                9336,
                9371
            ],
            [
                9371,
                9391
            ],
            [
                9391,
                9393
            ],
            [
                9393,
                9416
            ],
            [
                9417,
                9427
            ],
            [
                9427,
                9444
            ],
            [
                9445,
                9457
            ],
            [
                9457,
                9472
            ],
            [
                9472,
                9508
            ],
            [
                9508,
                9558
            ],
            [
                9558,
                9577
            ],
            [
                9577,
                9627
            ],
            [
                9627,
                9638
            ],
            [
                9639,
                9672
            ],
            [
                9672,
                9678
            ],
            [
                9679,
                9735
            ],
            [
                9736,
                9782
            ],
            [
                9782,
                9785
            ],
            [
                9785,
                9817
            ],
            [
                9818,
                9848
            ],
            [
                9849,
                9867
            ]
        ],
        "row_chars": [
            [
                0,
                46
            ],
            [
                46,
                123
            ],
            [
                123,
                312
            ],
            [
                312,
                338
            ],
            [
                338,
                376
            ],
            [
                376,
                423
            ],
            [
                423,
                473
            ],
            [
                473,
                512
            ],
            [
                512,
                556
            ],
            [
                556,
                556
            ],
            [
                556,
                593
            ],
            [
                593,
                593
            ],
            [
                593,
                632
            ],
            [
                632,
                652
            ],
            [
                652,
                652
            ],
            [
                652,
                698
            ],
            [
                698,
                765
            ],
            [
                765,
                838
            ],
            [
                838,
                944
            ],
            [
                944,
                995
            ],
            [
                995,
                1140
            ],
            [
                1140,
                1155
            ],
            [
                1155,
                1294
            ],
            [
                1294,
                1396
            ],
            [
                1396,
                1486
            ],
            [
                1486,
                1571
            ],
            [
                1571,
                1702
            ],
            [
                1702,
                1801
            ],
            [
                1801,
                1952
            ],
            [
                1952,
                2012
            ],
            [
                2012,
                2161
            ],
            [
                2161,
                2248
            ],
            [
                2248,
                2248
            ],
            [
                2248,
                2248
            ],
            [
                2248,
                2383
            ],
            [
                2383,
                2445
            ],
            [
                2445,
                2526
            ],
            [
                2526,
                2594
            ],
            [
                2594,
                2665
            ],
            [
                2665,
                2795
            ],
            [
                2795,
                2989
            ],
            [
                2989,
                3123
            ],
            [
                3123,
                3166
            ],
            [
                3166,
                3300
            ],
            [
                3300,
                3337
            ],
            [
                3337,
                3337
            ],
            [
                3337,
                3435
            ],
            [
                3435,
                3508
            ],
            [
                3508,
                3579
            ],
            [
                3579,
                3579
            ],
            [
                3579,
                3697
            ],
            [
                3697,
                3697
            ],
            [
                3697,
                3697
            ],
            [
                3697,
                3766
            ],
            [
                3766,
                3924
            ],
            [
                3924,
                3924
            ],
            [
                3924,
                3975
            ],
            [
                3975,
                4079
            ],
            [
                4079,
                4145
            ],
            [
                4145,
                4214
            ],
            [
                4214,
                4255
            ],
            [
                4255,
                4255
            ],
            [
                4255,
                4315
            ],
            [
                4315,
                4388
            ],
            [
                4388,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4575
            ],
            [
                4575,
                4639
            ],
            [
                4639,
                4749
            ],
            [
                4749,
                4835
            ],
            [
                4835,
                4914
            ],
            [
                4914,
                4984
            ],
            [
                4984,
                5033
            ],
            [
                5033,
                5050
            ],
            [
                5050,
                5147
            ],
            [
                5147,
                5168
            ],
            [
                5168,
                5182
            ],
            [
                5182,
                5182
            ],
            [
                5182,
                5242
            ],
            [
                5242,
                5286
            ],
            [
                5286,
                5286
            ],
            [
                5286,
                5316
            ],
            [
                5316,
                5367
            ],
            [
                5367,
                5452
            ],
            [
                5452,
                5452
            ],
            [
                5452,
                5475
            ],
            [
                5475,
                5536
            ],
            [
                5536,
                5614
            ],
            [
                5614,
                5655
            ],
            [
                5655,
                5688
            ],
            [
                5688,
                5740
            ],
            [
                5740,
                5866
            ],
            [
                5866,
                5933
            ],
            [
                5933,
                5981
            ],
            [
                5981,
                6020
            ],
            [
                6020,
                6020
            ],
            [
                6020,
                6081
            ],
            [
                6081,
                6172
            ],
            [
                6172,
                6226
            ],
            [
                6226,
                6254
            ],
            [
                6254,
                6299
            ],
            [
                6299,
                6299
            ],
            [
                6299,
                6337
            ],
            [
                6337,
                6372
            ],
            [
                6372,
                6372
            ],
            [
                6372,
                6518
            ],
            [
                6518,
                6578
            ],
            [
                6578,
                6647
            ],
            [
                6647,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6848
            ],
            [
                6848,
                6886
            ],
            [
                6886,
                6886
            ],
            [
                6886,
                7037
            ],
            [
                7037,
                7170
            ],
            [
                7170,
                7268
            ],
            [
                7268,
                7302
            ],
            [
                7302,
                7348
            ],
            [
                7348,
                7481
            ],
            [
                7481,
                7525
            ],
            [
                7525,
                7563
            ],
            [
                7563,
                7617
            ],
            [
                7617,
                7695
            ],
            [
                7695,
                7752
            ],
            [
                7752,
                7752
            ],
            [
                7752,
                7778
            ],
            [
                7778,
                7810
            ],
            [
                7810,
                7810
            ],
            [
                7810,
                7810
            ],
            [
                7810,
                7810
            ],
            [
                7810,
                7846
            ],
            [
                7846,
                7861
            ],
            [
                7861,
                7884
            ],
            [
                7884,
                7975
            ],
            [
                7975,
                8018
            ],
            [
                8018,
                8111
            ],
            [
                8111,
                8179
            ],
            [
                8179,
                8223
            ],
            [
                8223,
                8232
            ],
            [
                8232,
                8297
            ],
            [
                8297,
                8360
            ],
            [
                8360,
                8400
            ],
            [
                8400,
                8451
            ],
            [
                8451,
                8538
            ],
            [
                8538,
                8538
            ],
            [
                8538,
                8576
            ],
            [
                8576,
                8576
            ],
            [
                8576,
                8614
            ],
            [
                8614,
                8649
            ],
            [
                8649,
                8704
            ],
            [
                8704,
                8890
            ],
            [
                8890,
                8890
            ],
            [
                8890,
                8942
            ],
            [
                8942,
                9002
            ],
            [
                9002,
                9002
            ],
            [
                9002,
                9002
            ],
            [
                9002,
                9002
            ],
            [
                9002,
                9002
            ],
            [
                9002,
                9002
            ],
            [
                9002,
                9037
            ],
            [
                9037,
                9070
            ],
            [
                9070,
                9133
            ],
            [
                9133,
                9133
            ],
            [
                9133,
                9171
            ],
            [
                9171,
                9195
            ],
            [
                9195,
                9234
            ],
            [
                9234,
                9249
            ],
            [
                9249,
                9307
            ],
            [
                9307,
                9336
            ],
            [
                9336,
                9371
            ],
            [
                9371,
                9393
            ],
            [
                9393,
                9427
            ],
            [
                9427,
                9427
            ],
            [
                9427,
                9457
            ],
            [
                9457,
                9472
            ],
            [
                9472,
                9508
            ],
            [
                9508,
                9558
            ],
            [
                9558,
                9577
            ],
            [
                9577,
                9627
            ],
            [
                9627,
                9672
            ],
            [
                9672,
                9785
            ],
            [
                9785,
                9867
            ]
        ]
    }
}