{
    "original": {
        "text": "So it was. Lady Carbury had returned home from the soire of learned people, and had brought Roger Carbury with her. They both came up to the drawing-room and found Paul and Henrietta together. It need hardly be said that they were both surprised. Roger supposed that Montague was still at Liverpool, and, knowing that he was not a frequent visitor in Welbeck Street, could hardly avoid a feeling that a meeting between the two had now been planned in the mother's absence. The reader knows that it was not so. Roger certainly was a man not liable to suspicion, but the circumstances in this case were suspicious. There would have been nothing to suspect,--no reason why Paul should not have been there,--but from the promise which had been given. There was, indeed, no breach of that promise proved by Paul's presence in Welbeck Street; but Roger felt rather than thought that the two could hardly have spent the evening together without such breach. Whether Paul had broken the promise by what he had already said the reader must be left to decide.\nLady Carbury was the first to speak. \"This is quite an unexpected pleasure, Mr. Montague.\" Whether Roger suspected anything or not, she did. The moment she saw Paul the idea occurred to her that the meeting between Hetta and him had been preconcerted.\n\"Yes,\" he said,--making a lame excuse, where no excuse should have been made,--\"I had nothing to do, and was lonely, and thought that I would come up and see you.\" Lady Carbury disbelieved him altogether, but Roger felt assured that his coming in Lady Carbury's absence had been an accident. The man had said so, and that was enough.\n\"I thought you were at Liverpool,\" said Roger.\n\"I came back to-day,--to be present at that Board in the city. I have had a good deal to trouble me. I will tell you all about it just now. What has brought you to London?\"\n\"A little business,\" said Roger.\nThen there was an awkward silence. Lady Carbury was angry, and hardly knew whether she ought or ought not to show her anger. For Henrietta it was very awkward. She, too, could not but feel that she had been caught, though no innocence could be whiter than hers. She knew well her mother's mind, and the way in which her mother's thoughts would run. Silence was frightful to her, and she found herself forced to speak. \"Have you had a pleasant evening, mamma?\"\n\"Have you had a pleasant evening, my dear?\" said Lady Carbury, forgetting herself in her desire to punish her daughter.\n\"Indeed, no,\" said Hetta, attempting to laugh, \"I have been trying to work hard at Dante, but one never does any good when one has to try to work. I was just going to bed when Mr. Montague came in. What did you think of the wise men and the wise women, Roger?\"\n\"I was out of my element, of course; but I think your mother liked it.\"\n\"I was very glad indeed to meet Dr. Palmoil. It seems that if we can only open the interior of Africa a little further, we can get everything that is wanted to complete the chemical combination necessary for feeding the human race. Isn't that a grand idea, Roger?\"\n\"A little more elbow grease is the combination that I look to.\"\n\"Surely, Roger, if the Bible is to go for anything, we are to believe that labour is a curse and not a blessing. Adam was not born to labour.\"\n\"But he fell; and I doubt whether Dr. Palmoil will be able to put his descendants back into Eden.\"\n\"Roger, for a religious man, you do say the strangest things! I have quite made up my mind to this;--if ever I can see things so settled here as to enable me to move, I will visit the interior of Africa. It is the garden of the world.\"\nThis scrap of enthusiasm so carried them through their immediate difficulties that the two men were able to take their leave and to get out of the room with fair comfort. As soon as the door was closed behind them Lady Carbury attacked her daughter. \"What brought him here?\"\n\"He brought himself, mamma.\"\n\"Don't answer me in that way, Hetta. Of course he brought himself. That is insolent.\"\n\"Insolent, mamma! How can you say such hard words? I meant that he came of his own accord.\"\n\"How long was he here?\"\n\"Two minutes before you came in. Why do you cross-question me like this? I could not help his coming. I did not desire that he might be shown up.\"\n\"You did not know that he was to come?\"\n\"Mamma, if I am to be suspected, all is over between us.\"\n\"What do you mean by that?\"\n\"If you can think that I would deceive you, you will think so always. If you will not trust me, how am I to live with you as though you did? I knew nothing of his coming.\"\n\"Tell me this, Hetta; are you engaged to marry him?\"\n\"No;--I am not.\"\n\"Has he asked you to marry him?\"\nHetta paused a moment, considering, before she answered this question. \"I do not think he ever has.\"\n\"You do not think?\"\n\"I was going on to explain. He never has asked me. But he has said that which makes me know that he wishes me to be his wife.\"\n\"What has he said? When did he say it?\"\nAgain she paused. But again she answered with straightforward simplicity. \"Just before you came in, he said--; I don't know what he said; but it meant that.\"\n\"You told me he had been here but a minute.\"\n\"It was but very little more. If you take me at my word in that way, of course you can make me out to be wrong, mamma. It was almost no time, and yet he said it.\"\n\"He had come prepared to say it.\"\n\"How could he,--expecting to find you?\"\n\"Psha! He expected nothing of the kind.\"\n\"I think you do him wrong, mamma. I am sure you are doing me wrong. I think his coming was an accident, and that what he said was--an accident.\"\n\"An accident!\"\n\"It was not intended,--not then, mamma. I have known it ever so long;--and so have you. It was natural that he should say so when we were alone together.\"\n\"And you;--what did you say?\"\n\"Nothing. You came.\"\n\"I am sorry that my coming should have been so inopportune. But I must ask one other question, Hetta. What do you intend to say?\" Hetta was again silent, and now for a longer space. She put her hand up to her brow and pushed back her hair as she thought whether her mother had a right to continue this cross-examination. She had told her mother everything as it had happened. She had kept back no deed done, no word spoken, either now or at any time. But she was not sure that her mother had a right to know her thoughts, feeling as she did that she had so little sympathy from her mother. \"How do you intend to answer him?\" demanded Lady Carbury.\n\"I do not know that he will ask again.\"\n\"That is prevaricating.\"\n\"No, mamma;--I do not prevaricate. It is unfair to say that to me. I do love him. There. I think it ought to have been enough for you to know that I should never give him encouragement without telling you about it. I do love him, and I shall never love any one else.\"\n\"He is a ruined man. Your cousin says that all this Company in which he is involved will go to pieces.\"\nHetta was too clever to allow this argument to pass. She did not doubt that Roger had so spoken of the Railway to her mother, but she did doubt that her mother had believed the story. \"If so,\" said she, \"Mr. Melmotte will be a ruined man too, and yet you want Felix to marry Marie Melmotte.\"\n\"It makes me ill to hear you talk,--as if you understood these things. And you think you will marry this man because he is to make a fortune out of the Railway!\" Lady Carbury was able to speak with an extremity of scorn in reference to the assumed pursuit by one of her children of an advantageous position which she was doing all in her power to recommend to the other child.\n\"I have not thought of his fortune. I have not thought of marrying him, mamma. I think you are very cruel to me. You say things so hard, that I cannot bear them.\"\n\"Why will you not marry your cousin?\"\n\"I am not good enough for him.\"\n\"Nonsense!\"\n\"Very well; you say so. But that is what I think. He is so much above me, that, though I do love him, I cannot think of him in that way. And I have told you that I do love some one else. I have no secret from you now. Good night, mamma,\" she said, coming up to her mother and kissing her. \"Do be kind to me; and pray,--pray,--do believe me.\" Lady Carbury then allowed herself to be kissed, and allowed her daughter to leave the room.\n[Illustration: Lady Carbury allowed herself to be kissed.]\nThere was a great deal said that night between Roger Carbury and Paul Montague before they parted. As they walked together to Roger's hotel he said not a word as to Paul's presence in Welbeck Street. Paul had declared his visit in Lady Carbury's absence to have been accidental,--and therefore there was nothing more to be said. Montague then asked as to the cause of Carbury's journey to London. \"I do not wish it to be talked of,\" said Roger after a pause,--\"and of course I could not speak of it before Hetta. A girl has gone away from our neighbourhood. You remember old Ruggles?\"\n\"You do not mean that Ruby has levanted? She was to have married John Crumb.\"\n\"Just so,--but she has gone off, leaving John Crumb in an unhappy frame of mind. John Crumb is an honest man and almost too good for her.\"\n\"Ruby is very pretty. Has she gone with any one?\"\n\"No;--she went alone. But the horror of it is this. They think down there that Felix has,--well, made love to her, and that she has been taken to London by him.\"\n\"That would be very bad.\"\n\"He certainly has known her. Though he lied, as he always lies, when I first spoke to him, I brought him to admit that he and she had been friends down in Suffolk. Of course we know what such friendship means. But I do not think that she came to London at his instance. Of course he would lie about that. He would lie about anything. If his horse cost him a hundred pounds, he would tell one man that he gave fifty, and another two hundred. But he has not lived long enough yet to be able to lie and tell the truth with the same eye. When he is as old as I am he'll be perfect.\"\n\"He knows nothing about her coming to town?\"\n\"He did not when I first asked him. I am not sure, but I fancy that I was too quick after her. She started last Saturday morning. I followed on the Sunday, and made him out at his club. I think that he knew nothing then of her being in town. He is very clever if he did. Since that he has avoided me. I caught him once but only for half a minute, and then he swore that he had not seen her.\"\n\"You still believed him?\"\n\"No;--he did it very well, but I knew that he was prepared for me. I cannot say how it may have been. To make matters worse old Ruggles has now quarrelled with Crumb, and is no longer anxious to get back his granddaughter. He was frightened at first; but that has gone off, and he is now reconciled to the loss of the girl and the saving of his money.\"\nAfter that Paul told all his own story,--the double story, both in regard to Melmotte and to Mrs. Hurtle. As regarded the Railway, Roger could only tell him to follow explicitly the advice of his Liverpool friend. \"I never believed in the thing, you know.\"\n\"Nor did I. But what could I do?\"\n\"I'm not going to blame you. Indeed, knowing you as I do, feeling sure that you intend to be honest, I would not for a moment insist on my own opinion, if it did not seem that Mr. Ramsbottom thinks as I do. In such a matter, when a man does not see his own way clearly, it behoves him to be able to show that he has followed the advice of some man whom the world esteems and recognises. You have to bind your character to another man's character; and that other man's character, if it be good, will carry you through. From what I hear Mr. Ramsbottom's character is sufficiently good;--but then you must do exactly what he tells you.\"\nBut the Railway business, though it comprised all that Montague had in the world, was not the heaviest of his troubles. What was he to do about Mrs. Hurtle? He had now, for the first time, to tell his friend that Mrs. Hurtle had come to London, and that he had been with her three or four times. There was this difficulty in the matter, too,--that it was very hard to speak of his engagement with Mrs. Hurtle without in some sort alluding to his love for Henrietta Carbury. Roger knew of both loves;--had been very urgent with his friend to abandon the widow, and at any rate equally urgent with him to give up the other passion. Were he to marry the widow, all danger on the other side would be at an end. And yet, in discussing the question of Mrs. Hurtle, he was to do so as though there were no such person existing as Henrietta Carbury. The discussion did take place exactly as though there were no such person as Henrietta Carbury. Paul told it all,--the rumoured duel, the rumoured murder, and the rumour of the existing husband.\n\"It may be necessary that you should go out to Kansas,--and to Oregon,\" said Roger.\n\"But even if the rumours be untrue I will not marry her,\" said Paul. Roger shrugged his shoulders. He was doubtless thinking of Hetta Carbury, but he said nothing. \"And what would she do, remaining here?\" continued Paul. Roger admitted that it would be awkward. \"I am determined that under no circumstances will I marry her. I know I have been a fool. I know I have been wrong. But of course, if there be a fair cause for my broken word, I will use it if I can.\"\n\"You will get out of it, honestly if you can; but you will get out of it honestly or--any other way.\"\n\"Did you not advise me to get out of it, Roger;--before we knew as much as we do now?\"\n\"I did,--and I do. If you make a bargain with the Devil, it may be dishonest to cheat him,--and yet I would have you cheat him if you could. As to this woman, I do believe she has deceived you. If I were you, nothing should induce me to marry her;--not though her claws were strong enough to tear me utterly in pieces. I'll tell you what I'll do. I'll go and see her if you like it.\"\nBut Paul would not submit to this. He felt that he was bound himself to incur the risk of those claws, and that no substitute could take his place. They sat long into the night, and it was at last resolved between them that on the next morning Paul should go to Islington, should tell Mrs. Hurtle all the stories which he had heard, and should end by declaring his resolution that under no circumstances would he marry her. They both felt how improbable it was that he should ever be allowed to get to the end of such a story,--how almost certain it was that the breeding of the wild cat would show itself before that time should come. But, still, that was the course to be pursued as far as circumstances would admit; and Paul was at any rate to declare, claws or no claws, husband or no husband,--whether the duel or the murder was admitted or denied,--that he would never make Mrs. Hurtle his wife. \"I wish it were over, old fellow,\" said Roger.\n\"So do I,\" said Paul, as he took his leave.\nHe went to bed like a man condemned to die on the next morning, and he awoke in the same condition. He had slept well, but as he shook from him his happy dream, the wretched reality at once overwhelmed him. But the man who is to be hung has no choice. He cannot, when he wakes, declare that he has changed his mind, and postpone the hour. It was quite open to Paul Montague to give himself such instant relief. He put his hand up to his brow, and almost made himself believe that his head was aching. This was Saturday. Would it not be well that he should think of it further, and put off his execution till Monday? Monday was so far distant that he felt that he could go to Islington quite comfortably on Monday. Was there not some hitherto forgotten point which it would be well that he should discuss with his friend Roger before he saw the lady? Should he not rush down to Liverpool, and ask a few more questions of Mr. Ramsbottom? Why should he go forth to execution, seeing that the matter was in his own hands?\nAt last he jumped out of bed and into his tub, and dressed himself as quickly as he could. He worked himself up into a fit of fortitude, and resolved that the thing should be done before the fit was over. He ate his breakfast about nine, and then asked himself whether he might not be too early were he to go at once to Islington. But he remembered that she was always early. In every respect she was an energetic woman, using her time for some purpose, either good or bad, not sleeping it away in bed. If one has to be hung on a given day, would it not be well to be hung as soon after waking as possible? I can fancy that the hangman would hardly come early enough. And if one had to be hung in a given week, would not one wish to be hung on the first day of the week, even at the risk of breaking one's last Sabbath day in this world? Whatever be the misery to be endured, get it over. The horror of every agony is in its anticipation. Paul had realised something of this when he threw himself into a Hansom cab, and ordered the man to drive him to Islington.\nHow quick that cab went! Nothing ever goes so quick as a Hansom cab when a man starts for a dinner-party a little too early;--nothing so slow when he starts too late. Of all cabs this, surely, was the quickest. Paul was lodging in Suffolk Street, close to Pall Mall,--whence the way to Islington, across Oxford Street, across Tottenham Court Road, across numerous squares north-east of the Museum, seems to be long. The end of Goswell Road is the outside of the world in that direction, and Islington is beyond the end of Goswell Road. And yet that Hansom cab was there before Paul Montague had been able to arrange the words with which he would begin the interview. He had given the street and the number of the street. It was not till after he had started that it occurred to him that it might be well that he should get out at the end of the street, and walk to the house,--so that he might, as it were, fetch his breath before the interview was commenced. But the cabman dashed up to the door in a manner purposely devised to make every inmate of the house aware that a cab had just arrived before it. There was a little garden before the house. We all know the garden;--twenty-four feet long, by twelve broad;--and an iron-grated door, with the landlady's name on a brass plate. Paul, when he had paid the cabman,--giving the man half-a-crown, and asking for no change in his agony,--pushed in the iron gate and walked very quickly up to the door, rang rather furiously, and before the door was well opened asked for Mrs. Hurtle.\n\"Mrs. Hurtle is out for the day,\" said the girl who opened the door. \"Leastways, she went out yesterday and won't be back till to-night.\" Providence had sent him a reprieve! But he almost forgot the reprieve, as he looked at the girl and saw that she was Ruby Ruggles. \"Oh laws, Mr. Montague, is that you?\" Ruby Ruggles had often seen Paul down in Suffolk, and recognised him as quickly as he did her. It occurred to her at once that he had come in search of herself. She knew that Roger Carbury was up in town looking for her. So much she had of course learned from Sir Felix,--for at this time she had seen the baronet more than once since her arrival. Montague, she knew, was Roger Carbury's intimate friend, and now she felt that she was caught. In her terror she did not at first remember that the visitor had asked for Mrs. Hurtle.\n\"Yes, it is I. I was sorry to hear, Miss Ruggles, that you had left your home.\"\n\"I'm all right, Mr. Montague;--I am. Mrs. Pipkin is my aunt, or, leastways, my mother's brother's widow, though grandfather never would speak to her. She's quite respectable, and has five children, and lets lodgings. There's a lady here now, and has gone away with her just for one night down to Southend. They'll be back this evening, and I've the children to mind, with the servant girl. I'm quite respectable here, Mr. Montague, and nobody need be a bit afraid about me.\"\n\"Mrs. Hurtle has gone down to Southend?\"\n\"Yes, Mr. Montague; she wasn't quite well, and wanted a breath of air, she said. And aunt didn't like she should go alone, as Mrs. Hurtle is such a stranger. And Mrs. Hurtle said as she didn't mind paying for two, and so they've gone, and the baby with them. Mrs. Pipkin said as the baby shouldn't be no trouble. And Mrs. Hurtle,--she's most as fond of the baby as aunt. Do you know Mrs. Hurtle, sir?\"\n\"Yes; she's a friend of mine.\"\n\"Oh; I didn't know. I did know as there was some friend as was expected and as didn't come. Be I to say, sir, as you was here?\"\nPaul thought it might be as well to shift the subject and to ask Ruby a few questions about herself while he made up his mind what message he would leave for Mrs. Hurtle. \"I'm afraid they are very unhappy about you down at Bungay, Miss Ruggles.\"\n\"Then they've got to be unhappy; that's all about it, Mr. Montague. Grandfather is that provoking as a young woman can't live with him, nor yet I won't try never again. He lugged me all about the room by my hair, Mr. Montague. How is a young woman to put up with that? And I did everything for him,--that careful that no one won't do it again;--did his linen, and his victuals, and even cleaned his boots of a Sunday, 'cause he was that mean he wouldn't have anybody about the place only me and the girl who had to milk the cows. There wasn't nobody to do anything, only me. And then he went to drag me about by the hairs of my head. You won't see me again at Sheep's Acre, Mr. Montague;--nor yet won't the Squire.\"\n\"But I thought there was somebody else was to give you a home.\"\n\"John Crumb! Oh, yes, there's John Crumb. There's plenty of people to give me a home, Mr. Montague.\"\n\"You were to have been married to John Crumb, I thought.\"\n\"Ladies is to change their minds if they like it, Mr. Montague. I'm sure you've heard that before. Grandfather made me say I'd have him,--but I never cared that for him.\"\n\"I'm afraid, Miss Ruggles, you won't find a better man up here in London.\"\n\"I didn't come here to look for a man, Mr. Montague; I can tell you that. They has to look for me, if they want me. But I am looked after; and that by one as John Crumb ain't fit to touch.\" That told the whole story. Paul when he heard the little boast was quite sure that Roger's fear about Felix was well founded. And as for John Crumb's fitness to touch Sir Felix, Paul felt that the Bungay mealman might have an opinion of his own on that matter. \"But there's Betsy a crying up-stairs, and I promised not to leave them children for one minute.\"\n\"I will tell the Squire that I saw you, Miss Ruggles.\"\n\"What does the Squire want o' me? I ain't nothing to the Squire,--except that I respects him. You can tell if you please, Mr. Montague, of course. I'm a coming, my darling.\"\nPaul made his way into Mrs. Hurtle's sitting-room and wrote a note for her in pencil. He had come, he said, immediately on his return from Liverpool, and was sorry to find that she was away for the day. When should he call again? If she would make an appointment he would attend to it. He felt as he wrote this that he might very safely have himself made an appointment for the morrow; but he cheated himself into half believing that the suggestion he now made was the more gracious and civil. At any rate it would certainly give him another day. Mrs. Hurtle would not return till late in the evening, and as the following day was Sunday there would be no delivery by post. When the note was finished he left it on the table, and called to Ruby to tell her that he was going. \"Mr. Montague,\" she said in a confidential whisper, as she tripped down the stairs, \"I don't see why you need be saying anything about me, you know.\"\n\"Mr. Carbury is up in town looking after you.\"\n\"What 'm I to Mr. Carbury?\"\n\"Your grandfather is very anxious about you.\"\n\"Not a bit of it, Mr. Montague. Grandfather knows very well where I am. There! Grandfather doesn't want me back, and I ain't a going. Why should the Squire bother himself about me? I don't bother myself about him.\"\n\"He's afraid, Miss Ruggles, that you are trusting yourself to a young man who is not trustworthy.\"\n\"I can mind myself very well, Mr. Montague.\"\n\"Tell me this. Have you seen Sir Felix Carbury since you've been in town?\" Ruby, whose blushes came very easily, now flushed up to her forehead. \"You may be sure that he means no good to you. What can come of an intimacy between you and such a one as he?\"\n\"I don't see why I shouldn't have my friend, Mr. Montague, as well as you. Howsomever, if you'll not tell, I'll be ever so much obliged.\"\n\"But I must tell Mr. Carbury.\"\n\"Then I ain't obliged to you one bit,\" said Ruby, shutting the door.\nPaul as he walked away could not help thinking of the justice of Ruby's reproach to him. What business had he to take upon himself to be a Mentor to any one in regard to an affair of love;--he, who had engaged himself to marry Mrs. Hurtle, and who the evening before had for the first time declared his love to Hetta Carbury?\nIn regard to Mrs. Hurtle he had got a reprieve, as he thought, for two days;--but it did not make him happy or even comfortable. As he walked back to his lodgings he knew it would have been better for him to have had the interview over. But, at any rate, he could now think of Hetta Carbury, and the words he had spoken to her. Had he heard that declaration which she had made to her mother, he would have been able for the hour to have forgotten Mrs. Hurtle.",
        "paragraph_chars": [
            [
                0,
                1050
            ],
            [
                1050,
                1302
            ],
            [
                1302,
                1636
            ],
            [
                1636,
                1683
            ],
            [
                1683,
                1856
            ],
            [
                1856,
                1889
            ],
            [
                1889,
                2349
            ],
            [
                2349,
                2469
            ],
            [
                2469,
                2730
            ],
            [
                2730,
                2802
            ],
            [
                2802,
                3067
            ],
            [
                3067,
                3131
            ],
            [
                3131,
                3274
            ],
            [
                3274,
                3373
            ],
            [
                3373,
                3609
            ],
            [
                3609,
                3884
            ],
            [
                3884,
                3913
            ],
            [
                3913,
                3999
            ],
            [
                3999,
                4091
            ],
            [
                4091,
                4115
            ],
            [
                4115,
                4262
            ],
            [
                4262,
                4302
            ],
            [
                4302,
                4360
            ],
            [
                4360,
                4388
            ],
            [
                4388,
                4560
            ],
            [
                4560,
                4613
            ],
            [
                4613,
                4630
            ],
            [
                4630,
                4663
            ],
            [
                4663,
                4764
            ],
            [
                4764,
                4784
            ],
            [
                4784,
                4911
            ],
            [
                4911,
                4951
            ],
            [
                4951,
                5109
            ],
            [
                5109,
                5154
            ],
            [
                5154,
                5317
            ],
            [
                5317,
                5351
            ],
            [
                5351,
                5391
            ],
            [
                5391,
                5432
            ],
            [
                5432,
                5577
            ],
            [
                5577,
                5592
            ],
            [
                5592,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5798
            ],
            [
                5798,
                6446
            ],
            [
                6446,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6779
            ],
            [
                6779,
                6883
            ],
            [
                6883,
                7175
            ],
            [
                7175,
                7552
            ],
            [
                7552,
                7715
            ],
            [
                7715,
                7753
            ],
            [
                7753,
                7785
            ],
            [
                7785,
                7797
            ],
            [
                7797,
                8231
            ],
            [
                8231,
                8290
            ],
            [
                8290,
                8875
            ],
            [
                8875,
                8953
            ],
            [
                8953,
                9092
            ],
            [
                9092,
                9142
            ],
            [
                9142,
                9304
            ],
            [
                9304,
                9330
            ],
            [
                9330,
                9909
            ],
            [
                9909,
                9954
            ],
            [
                9954,
                10346
            ],
            [
                10346,
                10372
            ],
            [
                10372,
                10725
            ],
            [
                10725,
                10982
            ],
            [
                10982,
                11016
            ],
            [
                11016,
                11650
            ],
            [
                11650,
                12687
            ],
            [
                12687,
                12771
            ],
            [
                12771,
                13234
            ],
            [
                13234,
                13336
            ],
            [
                13336,
                13423
            ],
            [
                13423,
                13807
            ],
            [
                13807,
                14756
            ],
            [
                14756,
                14800
            ],
            [
                14800,
                15818
            ],
            [
                15818,
                16881
            ],
            [
                16881,
                18416
            ],
            [
                18416,
                19254
            ],
            [
                19254,
                19334
            ],
            [
                19334,
                19809
            ],
            [
                19809,
                19850
            ],
            [
                19850,
                20252
            ],
            [
                20252,
                20283
            ],
            [
                20283,
                20411
            ],
            [
                20411,
                20657
            ],
            [
                20657,
                21373
            ],
            [
                21373,
                21437
            ],
            [
                21437,
                21538
            ],
            [
                21538,
                21596
            ],
            [
                21596,
                21767
            ],
            [
                21767,
                21842
            ],
            [
                21842,
                22391
            ],
            [
                22391,
                22446
            ],
            [
                22446,
                22620
            ],
            [
                22620,
                23546
            ],
            [
                23546,
                23593
            ],
            [
                23593,
                23621
            ],
            [
                23621,
                23667
            ],
            [
                23667,
                23882
            ],
            [
                23882,
                23981
            ],
            [
                23981,
                24026
            ],
            [
                24026,
                24282
            ],
            [
                24282,
                24420
            ],
            [
                24420,
                24451
            ],
            [
                24451,
                24520
            ],
            [
                24520,
                24846
            ],
            [
                24846,
                25305
            ]
        ],
        "segment_chars": [
            [
                0,
                11
            ],
            [
                11,
                116
            ],
            [
                116,
                193
            ],
            [
                193,
                247
            ],
            [
                247,
                473
            ],
            [
                473,
                510
            ],
            [
                510,
                613
            ],
            [
                613,
                747
            ],
            [
                747,
                951
            ],
            [
                951,
                1050
            ],
            [
                1050,
                1087
            ],
            [
                1087,
                1141
            ],
            [
                1141,
                1191
            ],
            [
                1191,
                1302
            ],
            [
                1302,
                1466
            ],
            [
                1466,
                1594
            ],
            [
                1594,
                1636
            ],
            [
                1636,
                1683
            ],
            [
                1683,
                1746
            ],
            [
                1746,
                1784
            ],
            [
                1784,
                1823
            ],
            [
                1823,
                1856
            ],
            [
                1856,
                1889
            ],
            [
                1889,
                1924
            ],
            [
                1924,
                2014
            ],
            [
                2014,
                2049
            ],
            [
                2049,
                2151
            ],
            [
                2151,
                2238
            ],
            [
                2238,
                2307
            ],
            [
                2307,
                2349
            ],
            [
                2349,
                2393
            ],
            [
                2393,
                2469
            ],
            [
                2469,
                2616
            ],
            [
                2616,
                2667
            ],
            [
                2667,
                2730
            ],
            [
                2730,
                2802
            ],
            [
                2802,
                2847
            ],
            [
                2847,
                3034
            ],
            [
                3034,
                3067
            ],
            [
                3067,
                3131
            ],
            [
                3131,
                3244
            ],
            [
                3244,
                3274
            ],
            [
                3274,
                3373
            ],
            [
                3373,
                3435
            ],
            [
                3435,
                3577
            ],
            [
                3577,
                3609
            ],
            [
                3609,
                3780
            ],
            [
                3780,
                3859
            ],
            [
                3859,
                3884
            ],
            [
                3884,
                3913
            ],
            [
                3913,
                3950
            ],
            [
                3950,
                3980
            ],
            [
                3980,
                3999
            ],
            [
                3999,
                4017
            ],
            [
                4017,
                4050
            ],
            [
                4050,
                4091
            ],
            [
                4091,
                4115
            ],
            [
                4115,
                4148
            ],
            [
                4148,
                4188
            ],
            [
                4188,
                4217
            ],
            [
                4217,
                4262
            ],
            [
                4262,
                4302
            ],
            [
                4302,
                4360
            ],
            [
                4360,
                4388
            ],
            [
                4388,
                4458
            ],
            [
                4458,
                4529
            ],
            [
                4529,
                4560
            ],
            [
                4560,
                4613
            ],
            [
                4613,
                4630
            ],
            [
                4630,
                4663
            ],
            [
                4663,
                4734
            ],
            [
                4734,
                4764
            ],
            [
                4764,
                4784
            ],
            [
                4784,
                4812
            ],
            [
                4812,
                4835
            ],
            [
                4835,
                4911
            ],
            [
                4911,
                4930
            ],
            [
                4930,
                4951
            ],
            [
                4951,
                4969
            ],
            [
                4969,
                5025
            ],
            [
                5025,
                5109
            ],
            [
                5109,
                5154
            ],
            [
                5154,
                5184
            ],
            [
                5184,
                5273
            ],
            [
                5273,
                5317
            ],
            [
                5317,
                5351
            ],
            [
                5351,
                5391
            ],
            [
                5391,
                5398
            ],
            [
                5398,
                5432
            ],
            [
                5432,
                5466
            ],
            [
                5466,
                5500
            ],
            [
                5500,
                5577
            ],
            [
                5577,
                5592
            ],
            [
                5592,
                5632
            ],
            [
                5632,
                5680
            ],
            [
                5680,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5787
            ],
            [
                5787,
                5798
            ],
            [
                5798,
                5858
            ],
            [
                5858,
                5900
            ],
            [
                5900,
                5928
            ],
            [
                5928,
                5980
            ],
            [
                5980,
                6119
            ],
            [
                6119,
                6174
            ],
            [
                6174,
                6249
            ],
            [
                6249,
                6388
            ],
            [
                6388,
                6423
            ],
            [
                6423,
                6446
            ],
            [
                6446,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6546
            ],
            [
                6546,
                6578
            ],
            [
                6578,
                6593
            ],
            [
                6593,
                6600
            ],
            [
                6600,
                6726
            ],
            [
                6726,
                6779
            ],
            [
                6779,
                6800
            ],
            [
                6800,
                6883
            ],
            [
                6883,
                6936
            ],
            [
                6936,
                7067
            ],
            [
                7067,
                7175
            ],
            [
                7175,
                7246
            ],
            [
                7246,
                7337
            ],
            [
                7337,
                7552
            ],
            [
                7552,
                7588
            ],
            [
                7588,
                7631
            ],
            [
                7631,
                7665
            ],
            [
                7665,
                7715
            ],
            [
                7715,
                7753
            ],
            [
                7753,
                7785
            ],
            [
                7785,
                7797
            ],
            [
                7797,
                7821
            ],
            [
                7821,
                7847
            ],
            [
                7847,
                7934
            ],
            [
                7934,
                7984
            ],
            [
                7984,
                8015
            ],
            [
                8015,
                8086
            ],
            [
                8086,
                8139
            ],
            [
                8139,
                8231
            ],
            [
                8231,
                8290
            ],
            [
                8290,
                8389
            ],
            [
                8389,
                8490
            ],
            [
                8490,
                8619
            ],
            [
                8619,
                8687
            ],
            [
                8687,
                8803
            ],
            [
                8803,
                8848
            ],
            [
                8848,
                8875
            ],
            [
                8875,
                8916
            ],
            [
                8916,
                8953
            ],
            [
                8953,
                9034
            ],
            [
                9034,
                9092
            ],
            [
                9092,
                9114
            ],
            [
                9114,
                9142
            ],
            [
                9142,
                9164
            ],
            [
                9164,
                9194
            ],
            [
                9194,
                9304
            ],
            [
                9304,
                9330
            ],
            [
                9330,
                9359
            ],
            [
                9359,
                9494
            ],
            [
                9494,
                9540
            ],
            [
                9540,
                9600
            ],
            [
                9600,
                9635
            ],
            [
                9635,
                9664
            ],
            [
                9664,
                9771
            ],
            [
                9771,
                9864
            ],
            [
                9864,
                9909
            ],
            [
                9909,
                9954
            ],
            [
                9954,
                9990
            ],
            [
                9990,
                10049
            ],
            [
                10049,
                10084
            ],
            [
                10084,
                10140
            ],
            [
                10140,
                10196
            ],
            [
                10196,
                10225
            ],
            [
                10225,
                10255
            ],
            [
                10255,
                10346
            ],
            [
                10346,
                10372
            ],
            [
                10372,
                10439
            ],
            [
                10439,
                10474
            ],
            [
                10474,
                10595
            ],
            [
                10595,
                10725
            ],
            [
                10725,
                10831
            ],
            [
                10831,
                10939
            ],
            [
                10939,
                10982
            ],
            [
                10982,
                10994
            ],
            [
                10994,
                11016
            ],
            [
                11016,
                11045
            ],
            [
                11045,
                11223
            ],
            [
                11223,
                11403
            ],
            [
                11403,
                11534
            ],
            [
                11534,
                11650
            ],
            [
                11650,
                11770
            ],
            [
                11770,
                11807
            ],
            [
                11807,
                11946
            ],
            [
                11946,
                12124
            ],
            [
                12124,
                12280
            ],
            [
                12280,
                12357
            ],
            [
                12357,
                12492
            ],
            [
                12492,
                12588
            ],
            [
                12588,
                12687
            ],
            [
                12687,
                12771
            ],
            [
                12771,
                12840
            ],
            [
                12840,
                12870
            ],
            [
                12870,
                12935
            ],
            [
                12935,
                12976
            ],
            [
                12976,
                12992
            ],
            [
                12992,
                13033
            ],
            [
                13033,
                13096
            ],
            [
                13096,
                13123
            ],
            [
                13123,
                13149
            ],
            [
                13149,
                13234
            ],
            [
                13234,
                13336
            ],
            [
                13336,
                13423
            ],
            [
                13423,
                13442
            ],
            [
                13442,
                13564
            ],
            [
                13564,
                13617
            ],
            [
                13617,
                13742
            ],
            [
                13742,
                13770
            ],
            [
                13770,
                13807
            ],
            [
                13807,
                13842
            ],
            [
                13842,
                13955
            ],
            [
                13955,
                14231
            ],
            [
                14231,
                14443
            ],
            [
                14443,
                14709
            ],
            [
                14709,
                14756
            ],
            [
                14756,
                14800
            ],
            [
                14800,
                14900
            ],
            [
                14900,
                15007
            ],
            [
                15007,
                15052
            ],
            [
                15052,
                15139
            ],
            [
                15139,
                15211
            ],
            [
                15211,
                15301
            ],
            [
                15301,
                15320
            ],
            [
                15320,
                15416
            ],
            [
                15416,
                15514
            ],
            [
                15514,
                15650
            ],
            [
                15650,
                15736
            ],
            [
                15736,
                15818
            ],
            [
                15818,
                15909
            ],
            [
                15909,
                16023
            ],
            [
                16023,
                16149
            ],
            [
                16149,
                16194
            ],
            [
                16194,
                16321
            ],
            [
                16321,
                16425
            ],
            [
                16425,
                16486
            ],
            [
                16486,
                16656
            ],
            [
                16656,
                16707
            ],
            [
                16707,
                16757
            ],
            [
                16757,
                16881
            ],
            [
                16881,
                16906
            ],
            [
                16906,
                17048
            ],
            [
                17048,
                17092
            ],
            [
                17092,
                17297
            ],
            [
                17297,
                17417
            ],
            [
                17417,
                17548
            ],
            [
                17548,
                17602
            ],
            [
                17602,
                17841
            ],
            [
                17841,
                17987
            ],
            [
                17987,
                18031
            ],
            [
                18031,
                18165
            ],
            [
                18165,
                18416
            ],
            [
                18416,
                18485
            ],
            [
                18485,
                18554
            ],
            [
                18554,
                18590
            ],
            [
                18590,
                18685
            ],
            [
                18685,
                18723
            ],
            [
                18723,
                18818
            ],
            [
                18818,
                18884
            ],
            [
                18884,
                18944
            ],
            [
                18944,
                19071
            ],
            [
                19071,
                19166
            ],
            [
                19166,
                19254
            ],
            [
                19254,
                19334
            ],
            [
                19334,
                19371
            ],
            [
                19371,
                19484
            ],
            [
                19484,
                19551
            ],
            [
                19551,
                19640
            ],
            [
                19640,
                19724
            ],
            [
                19724,
                19809
            ],
            [
                19809,
                19850
            ],
            [
                19850,
                19931
            ],
            [
                19931,
                20008
            ],
            [
                20008,
                20109
            ],
            [
                20109,
                20163
            ],
            [
                20163,
                20221
            ],
            [
                20221,
                20252
            ],
            [
                20252,
                20283
            ],
            [
                20283,
                20303
            ],
            [
                20303,
                20375
            ],
            [
                20375,
                20411
            ],
            [
                20411,
                20582
            ],
            [
                20582,
                20657
            ],
            [
                20657,
                20725
            ],
            [
                20725,
                20826
            ],
            [
                20826,
                20884
            ],
            [
                20884,
                20926
            ],
            [
                20926,
                21187
            ],
            [
                21187,
                21232
            ],
            [
                21232,
                21291
            ],
            [
                21291,
                21373
            ],
            [
                21373,
                21437
            ],
            [
                21437,
                21450
            ],
            [
                21450,
                21479
            ],
            [
                21479,
                21538
            ],
            [
                21538,
                21596
            ],
            [
                21596,
                21660
            ],
            [
                21660,
                21695
            ],
            [
                21695,
                21767
            ],
            [
                21767,
                21842
            ],
            [
                21842,
                21916
            ],
            [
                21916,
                21958
            ],
            [
                21958,
                22032
            ],
            [
                22032,
                22059
            ],
            [
                22059,
                22158
            ],
            [
                22158,
                22293
            ],
            [
                22293,
                22391
            ],
            [
                22391,
                22446
            ],
            [
                22446,
                22480
            ],
            [
                22480,
                22540
            ],
            [
                22540,
                22593
            ],
            [
                22593,
                22620
            ],
            [
                22620,
                22706
            ],
            [
                22706,
                22823
            ],
            [
                22823,
                22850
            ],
            [
                22850,
                22906
            ],
            [
                22906,
                23114
            ],
            [
                23114,
                23167
            ],
            [
                23167,
                23294
            ],
            [
                23294,
                23396
            ],
            [
                23396,
                23546
            ],
            [
                23546,
                23593
            ],
            [
                23593,
                23621
            ],
            [
                23621,
                23667
            ],
            [
                23667,
                23699
            ],
            [
                23699,
                23739
            ],
            [
                23739,
                23746
            ],
            [
                23746,
                23801
            ],
            [
                23801,
                23848
            ],
            [
                23848,
                23882
            ],
            [
                23882,
                23981
            ],
            [
                23981,
                24026
            ],
            [
                24026,
                24041
            ],
            [
                24041,
                24101
            ],
            [
                24101,
                24171
            ],
            [
                24171,
                24218
            ],
            [
                24218,
                24282
            ],
            [
                24282,
                24357
            ],
            [
                24357,
                24420
            ],
            [
                24420,
                24451
            ],
            [
                24451,
                24520
            ],
            [
                24520,
                24609
            ],
            [
                24609,
                24846
            ],
            [
                24846,
                24975
            ],
            [
                24975,
                25083
            ],
            [
                25083,
                25174
            ],
            [
                25174,
                25305
            ]
        ],
        "overlap_chars": [
            [
                11,
                36
            ],
            [
                42,
                56
            ],
            [
                106,
                110
            ],
            [
                92,
                97
            ],
            [
                114,
                116
            ],
            [
                116,
                120
            ],
            [
                126,
                193
            ],
            [
                247,
                252
            ],
            [
                253,
                303
            ],
            [
                367,
                385
            ],
            [
                388,
                430
            ],
            [
                435,
                473
            ],
            [
                510,
                515
            ],
            [
                526,
                529
            ],
            [
                536,
                539
            ],
            [
                530,
                535
            ],
            [
                540,
                582
            ],
            [
                596,
                612
            ],
            [
                1050,
                1087
            ],
            [
                1087,
                1095
            ],
            [
                1102,
                1141
            ],
            [
                1191,
                1214
            ],
            [
                1240,
                1291
            ],
            [
                1300,
                1302
            ],
            [
                1302,
                1316
            ],
            [
                1328,
                1332
            ],
            [
                1316,
                1317
            ],
            [
                1381,
                1406
            ],
            [
                1423,
                1430
            ],
            [
                1436,
                1448
            ],
            [
                1452,
                1466
            ],
            [
                1466,
                1494
            ],
            [
                1505,
                1545
            ],
            [
                1572,
                1593
            ],
            [
                1636,
                1683
            ],
            [
                1683,
                1695
            ],
            [
                1702,
                1703
            ],
            [
                1722,
                1746
            ],
            [
                1784,
                1812
            ],
            [
                1821,
                1823
            ],
            [
                1823,
                1856
            ],
            [
                1856,
                1889
            ],
            [
                1894,
                1924
            ],
            [
                1924,
                1951
            ],
            [
                2018,
                2027
            ],
            [
                2052,
                2053
            ],
            [
                2188,
                2236
            ],
            [
                2057,
                2058
            ],
            [
                2290,
                2296
            ],
            [
                2282,
                2289
            ],
            [
                2297,
                2306
            ],
            [
                2307,
                2349
            ],
            [
                2349,
                2393
            ],
            [
                2393,
                2469
            ],
            [
                2469,
                2543
            ],
            [
                2549,
                2562
            ],
            [
                2616,
                2667
            ],
            [
                2667,
                2692
            ],
            [
                2720,
                2730
            ],
            [
                2730,
                2754
            ],
            [
                2765,
                2802
            ],
            [
                2802,
                2847
            ],
            [
                2847,
                2928
            ],
            [
                3018,
                3034
            ],
            [
                3034,
                3067
            ],
            [
                3274,
                3275
            ],
            [
                3292,
                3373
            ],
            [
                3373,
                3435
            ],
            [
                3435,
                3447
            ],
            [
                3474,
                3476
            ],
            [
                3482,
                3483
            ],
            [
                3477,
                3481
            ],
            [
                3538,
                3577
            ],
            [
                3577,
                3609
            ],
            [
                3609,
                3663
            ],
            [
                3674,
                3733
            ],
            [
                3761,
                3780
            ],
            [
                3780,
                3858
            ],
            [
                3859,
                3884
            ],
            [
                3884,
                3913
            ],
            [
                3913,
                3950
            ],
            [
                3950,
                3980
            ],
            [
                3980,
                3999
            ],
            [
                3999,
                4017
            ],
            [
                4017,
                4050
            ],
            [
                4050,
                4091
            ],
            [
                4091,
                4115
            ],
            [
                4115,
                4148
            ],
            [
                4148,
                4188
            ],
            [
                4188,
                4217
            ],
            [
                4217,
                4262
            ],
            [
                4262,
                4302
            ],
            [
                4302,
                4360
            ],
            [
                4360,
                4388
            ],
            [
                4388,
                4458
            ],
            [
                4458,
                4509
            ],
            [
                4527,
                4529
            ],
            [
                4529,
                4560
            ],
            [
                4560,
                4613
            ],
            [
                4613,
                4617
            ],
            [
                4619,
                4630
            ],
            [
                4630,
                4663
            ],
            [
                4663,
                4718
            ],
            [
                4732,
                4734
            ],
            [
                4734,
                4764
            ],
            [
                4764,
                4784
            ],
            [
                4784,
                4812
            ],
            [
                4812,
                4835
            ],
            [
                4835,
                4911
            ],
            [
                4911,
                4930
            ],
            [
                4930,
                4951
            ],
            [
                4951,
                4956
            ],
            [
                4961,
                4969
            ],
            [
                4969,
                5025
            ],
            [
                5025,
                5058
            ],
            [
                5062,
                5109
            ],
            [
                5109,
                5154
            ],
            [
                5154,
                5161
            ],
            [
                5166,
                5184
            ],
            [
                5273,
                5317
            ],
            [
                5317,
                5351
            ],
            [
                5351,
                5365
            ],
            [
                5377,
                5391
            ],
            [
                5391,
                5398
            ],
            [
                5398,
                5432
            ],
            [
                5432,
                5466
            ],
            [
                5466,
                5500
            ],
            [
                5500,
                5561
            ],
            [
                5563,
                5577
            ],
            [
                5577,
                5592
            ],
            [
                5592,
                5613
            ],
            [
                5625,
                5630
            ],
            [
                5623,
                5624
            ],
            [
                5632,
                5661
            ],
            [
                5663,
                5678
            ],
            [
                5747,
                5751
            ],
            [
                5758,
                5777
            ],
            [
                5777,
                5787
            ],
            [
                5787,
                5798
            ],
            [
                5798,
                5858
            ],
            [
                5858,
                5900
            ],
            [
                5900,
                5927
            ],
            [
                5928,
                5963
            ],
            [
                5966,
                5972
            ],
            [
                5978,
                5980
            ],
            [
                5980,
                5999
            ],
            [
                6012,
                6119
            ],
            [
                6119,
                6174
            ],
            [
                6174,
                6194
            ],
            [
                6209,
                6220
            ],
            [
                6247,
                6249
            ],
            [
                6249,
                6285
            ],
            [
                6318,
                6319
            ],
            [
                6352,
                6354
            ],
            [
                6286,
                6318
            ],
            [
                6386,
                6387
            ],
            [
                6388,
                6423
            ],
            [
                6423,
                6446
            ],
            [
                6446,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6522
            ],
            [
                6524,
                6546
            ],
            [
                6546,
                6570
            ],
            [
                6576,
                6578
            ],
            [
                6578,
                6593
            ],
            [
                6593,
                6600
            ],
            [
                6641,
                6644
            ],
            [
                6648,
                6715
            ],
            [
                6724,
                6726
            ],
            [
                6726,
                6763
            ],
            [
                6772,
                6779
            ],
            [
                6779,
                6800
            ],
            [
                6800,
                6821
            ],
            [
                6826,
                6883
            ],
            [
                6883,
                6936
            ],
            [
                7067,
                7175
            ],
            [
                7175,
                7208
            ],
            [
                7211,
                7246
            ],
            [
                7246,
                7337
            ],
            [
                7337,
                7349
            ],
            [
                7368,
                7372
            ],
            [
                7389,
                7394
            ],
            [
                7550,
                7552
            ],
            [
                7552,
                7588
            ],
            [
                7588,
                7631
            ],
            [
                7631,
                7665
            ],
            [
                7665,
                7715
            ],
            [
                7715,
                7753
            ],
            [
                7753,
                7785
            ],
            [
                7785,
                7797
            ],
            [
                7797,
                7808
            ],
            [
                7821,
                7847
            ],
            [
                7847,
                7934
            ],
            [
                7984,
                8015
            ],
            [
                8015,
                8086
            ],
            [
                8086,
                8114
            ],
            [
                8123,
                8138
            ],
            [
                8139,
                8151
            ],
            [
                8157,
                8190
            ],
            [
                8199,
                8211
            ],
            [
                8221,
                8231
            ],
            [
                8290,
                8368
            ],
            [
                8438,
                8448
            ],
            [
                8455,
                8490
            ],
            [
                8633,
                8638
            ],
            [
                8645,
                8686
            ],
            [
                8687,
                8688
            ],
            [
                8765,
                8801
            ],
            [
                8720,
                8733
            ],
            [
                8801,
                8803
            ],
            [
                8875,
                8879
            ],
            [
                8852,
                8860
            ],
            [
                8897,
                8901
            ],
            [
                8865,
                8872
            ],
            [
                8914,
                8916
            ],
            [
                8916,
                8950
            ],
            [
                8961,
                8962
            ],
            [
                8964,
                8993
            ],
            [
                9011,
                9018
            ],
            [
                9032,
                9034
            ],
            [
                9034,
                9047
            ],
            [
                9066,
                9092
            ],
            [
                9092,
                9114
            ],
            [
                9114,
                9131
            ],
            [
                9139,
                9142
            ],
            [
                9142,
                9146
            ],
            [
                9148,
                9164
            ],
            [
                9164,
                9194
            ],
            [
                9194,
                9204
            ],
            [
                9216,
                9230
            ],
            [
                9233,
                9304
            ],
            [
                9304,
                9330
            ],
            [
                9330,
                9343
            ],
            [
                9354,
                9359
            ],
            [
                9359,
                9373
            ],
            [
                9394,
                9422
            ],
            [
                9431,
                9494
            ],
            [
                9504,
                9516
            ],
            [
                9533,
                9540
            ],
            [
                9540,
                9589
            ],
            [
                9909,
                9954
            ],
            [
                9954,
                9955
            ],
            [
                9988,
                9990
            ],
            [
                10084,
                10085
            ],
            [
                10119,
                10122
            ],
            [
                10098,
                10101
            ],
            [
                10049,
                10052
            ],
            [
                10108,
                10113
            ],
            [
                10140,
                10168
            ],
            [
                10169,
                10173
            ],
            [
                10194,
                10196
            ],
            [
                10225,
                10255
            ],
            [
                10474,
                10495
            ],
            [
                10496,
                10593
            ],
            [
                10725,
                10763
            ],
            [
                10766,
                10783
            ],
            [
                10784,
                10788
            ],
            [
                10802,
                10814
            ],
            [
                10818,
                10831
            ],
            [
                10831,
                10891
            ],
            [
                10903,
                10939
            ],
            [
                10939,
                10959
            ],
            [
                10969,
                10979
            ],
            [
                11534,
                11580
            ],
            [
                11594,
                11599
            ],
            [
                11619,
                11650
            ],
            [
                11650,
                11674
            ],
            [
                11732,
                11755
            ],
            [
                11760,
                11770
            ],
            [
                11807,
                11946
            ],
            [
                11998,
                12066
            ],
            [
                12080,
                12123
            ],
            [
                12124,
                12149
            ],
            [
                12151,
                12154
            ],
            [
                12177,
                12213
            ],
            [
                12226,
                12233
            ],
            [
                12246,
                12280
            ],
            [
                12280,
                12357
            ],
            [
                12357,
                12364
            ],
            [
                12409,
                12411
            ],
            [
                12416,
                12418
            ],
            [
                12396,
                12407
            ],
            [
                12425,
                12460
            ],
            [
                12470,
                12482
            ],
            [
                12490,
                12492
            ],
            [
                12588,
                12604
            ],
            [
                12607,
                12687
            ],
            [
                12687,
                12740
            ],
            [
                12756,
                12771
            ],
            [
                12771,
                12795
            ],
            [
                12799,
                12840
            ],
            [
                12840,
                12854
            ],
            [
                12912,
                12917
            ],
            [
                12921,
                12935
            ],
            [
                12935,
                12936
            ],
            [
                13096,
                13121
            ],
            [
                12976,
                12991
            ],
            [
                13123,
                13149
            ],
            [
                13149,
                13152
            ],
            [
                13164,
                13222
            ],
            [
                13231,
                13234
            ],
            [
                13234,
                13235
            ],
            [
                13244,
                13257
            ],
            [
                13259,
                13283
            ],
            [
                13293,
                13306
            ],
            [
                13424,
                13425
            ],
            [
                13341,
                13344
            ],
            [
                13359,
                13361
            ],
            [
                13414,
                13416
            ],
            [
                13385,
                13391
            ],
            [
                13440,
                13442
            ],
            [
                13582,
                13583
            ],
            [
                13587,
                13594
            ],
            [
                13570,
                13580
            ],
            [
                13599,
                13617
            ],
            [
                13617,
                13669
            ],
            [
                13740,
                13742
            ],
            [
                13770,
                13801
            ],
            [
                13804,
                13807
            ],
            [
                13807,
                13825
            ],
            [
                13836,
                13842
            ],
            [
                13955,
                14012
            ],
            [
                14026,
                14030
            ],
            [
                14051,
                14065
            ],
            [
                14038,
                14042
            ],
            [
                14066,
                14079
            ],
            [
                14087,
                14119
            ],
            [
                14126,
                14143
            ],
            [
                14168,
                14182
            ],
            [
                14220,
                14231
            ],
            [
                14231,
                14282
            ],
            [
                14302,
                14332
            ],
            [
                14413,
                14419
            ],
            [
                14382,
                14405
            ],
            [
                14441,
                14443
            ],
            [
                14443,
                14446
            ],
            [
                14530,
                14534
            ],
            [
                14455,
                14459
            ],
            [
                14561,
                14581
            ],
            [
                14667,
                14708
            ],
            [
                14709,
                14756
            ],
            [
                14756,
                14776
            ],
            [
                14798,
                14800
            ],
            [
                14800,
                14867
            ],
            [
                14868,
                14876
            ],
            [
                14961,
                15007
            ],
            [
                15211,
                15301
            ],
            [
                15301,
                15320
            ],
            [
                15320,
                15340
            ],
            [
                15381,
                15416
            ],
            [
                15518,
                15527
            ],
            [
                15648,
                15650
            ],
            [
                15650,
                15736
            ],
            [
                15736,
                15771
            ],
            [
                15816,
                15818
            ],
            [
                15818,
                15859
            ],
            [
                15860,
                15876
            ],
            [
                15888,
                15895
            ],
            [
                15907,
                15909
            ],
            [
                15909,
                16023
            ],
            [
                16023,
                16043
            ],
            [
                16054,
                16064
            ],
            [
                16237,
                16238
            ],
            [
                16305,
                16307
            ],
            [
                16176,
                16179
            ],
            [
                16107,
                16112
            ],
            [
                16270,
                16271
            ],
            [
                16798,
                16881
            ],
            [
                16881,
                16906
            ],
            [
                17451,
                17462
            ],
            [
                17472,
                17546
            ],
            [
                17732,
                17733
            ],
            [
                17845,
                17852
            ],
            [
                17441,
                17444
            ],
            [
                17878,
                17880
            ],
            [
                17417,
                17420
            ],
            [
                17856,
                17862
            ],
            [
                17863,
                17872
            ],
            [
                17750,
                17755
            ],
            [
                17985,
                17987
            ],
            [
                18165,
                18169
            ],
            [
                18183,
                18199
            ],
            [
                18280,
                18317
            ],
            [
                18020,
                18023
            ],
            [
                17999,
                18012
            ],
            [
                18318,
                18332
            ],
            [
                18029,
                18030
            ],
            [
                18176,
                18178
            ],
            [
                18334,
                18360
            ],
            [
                18393,
                18416
            ],
            [
                18416,
                18485
            ],
            [
                18485,
                18542
            ],
            [
                18551,
                18553
            ],
            [
                18554,
                18590
            ],
            [
                18590,
                18684
            ],
            [
                18685,
                18723
            ],
            [
                18723,
                18727
            ],
            [
                18777,
                18787
            ],
            [
                18751,
                18755
            ],
            [
                18792,
                18816
            ],
            [
                18773,
                18776
            ],
            [
                18837,
                18874
            ],
            [
                18833,
                18836
            ],
            [
                18882,
                18884
            ],
            [
                18884,
                18915
            ],
            [
                18919,
                18944
            ],
            [
                18952,
                18959
            ],
            [
                18970,
                18977
            ],
            [
                19002,
                19006
            ],
            [
                18978,
                18992
            ],
            [
                18995,
                18998
            ],
            [
                19012,
                19071
            ],
            [
                19132,
                19166
            ],
            [
                19166,
                19191
            ],
            [
                19201,
                19254
            ],
            [
                19254,
                19258
            ],
            [
                19267,
                19268
            ],
            [
                19269,
                19334
            ],
            [
                19334,
                19362
            ],
            [
                19369,
                19371
            ],
            [
                19371,
                19484
            ],
            [
                19484,
                19551
            ],
            [
                19551,
                19640
            ],
            [
                19640,
                19724
            ],
            [
                19724,
                19809
            ],
            [
                19809,
                19850
            ],
            [
                19850,
                19931
            ],
            [
                19931,
                19972
            ],
            [
                20068,
                20109
            ],
            [
                20221,
                20252
            ],
            [
                20252,
                20283
            ],
            [
                20283,
                20286
            ],
            [
                20288,
                20303
            ],
            [
                20378,
                20379
            ],
            [
                20383,
                20411
            ],
            [
                20582,
                20654
            ],
            [
                20411,
                20415
            ],
            [
                20572,
                20573
            ],
            [
                20657,
                20700
            ],
            [
                20723,
                20725
            ],
            [
                20725,
                20754
            ],
            [
                20758,
                20791
            ],
            [
                20824,
                20826
            ],
            [
                20826,
                20884
            ],
            [
                20884,
                20926
            ],
            [
                20926,
                20955
            ],
            [
                21006,
                21073
            ],
            [
                21185,
                21187
            ],
            [
                21291,
                21329
            ],
            [
                21370,
                21373
            ],
            [
                21373,
                21411
            ],
            [
                21416,
                21437
            ],
            [
                21450,
                21477
            ],
            [
                21538,
                21555
            ],
            [
                21561,
                21568
            ],
            [
                21582,
                21596
            ],
            [
                21596,
                21641
            ],
            [
                21644,
                21660
            ],
            [
                21695,
                21732
            ],
            [
                21734,
                21767
            ],
            [
                21767,
                21842
            ],
            [
                21842,
                21893
            ],
            [
                21914,
                21916
            ],
            [
                21916,
                21958
            ],
            [
                21958,
                22031
            ],
            [
                22032,
                22059
            ],
            [
                22059,
                22063
            ],
            [
                22095,
                22157
            ],
            [
                22293,
                22320
            ],
            [
                22391,
                22446
            ],
            [
                22540,
                22593
            ],
            [
                22593,
                22620
            ],
            [
                22620,
                22694
            ],
            [
                22704,
                22706
            ],
            [
                22706,
                22823
            ],
            [
                22823,
                22850
            ],
            [
                22850,
                22905
            ],
            [
                23129,
                23134
            ],
            [
                23145,
                23167
            ],
            [
                23167,
                23275
            ],
            [
                23276,
                23284
            ],
            [
                23292,
                23294
            ],
            [
                23321,
                23328
            ],
            [
                23299,
                23307
            ],
            [
                23332,
                23395
            ],
            [
                23396,
                23447
            ],
            [
                23455,
                23458
            ],
            [
                23463,
                23546
            ],
            [
                23621,
                23667
            ],
            [
                23667,
                23699
            ],
            [
                23699,
                23739
            ],
            [
                23758,
                23801
            ],
            [
                23801,
                23846
            ],
            [
                23882,
                23981
            ],
            [
                23981,
                24026
            ],
            [
                24041,
                24101
            ],
            [
                24101,
                24105
            ],
            [
                24143,
                24171
            ],
            [
                24171,
                24201
            ],
            [
                24213,
                24216
            ],
            [
                24202,
                24209
            ],
            [
                24282,
                24357
            ],
            [
                24357,
                24420
            ],
            [
                24420,
                24451
            ],
            [
                24451,
                24520
            ],
            [
                24520,
                24600
            ],
            [
                24607,
                24609
            ],
            [
                24609,
                24632
            ],
            [
                24677,
                24679
            ],
            [
                24703,
                24707
            ],
            [
                24710,
                24790
            ],
            [
                24810,
                24846
            ],
            [
                24846,
                24893
            ],
            [
                24897,
                24922
            ],
            [
                24924,
                24947
            ],
            [
                24962,
                24975
            ],
            [
                25101,
                25103
            ],
            [
                25120,
                25174
            ],
            [
                25178,
                25180
            ],
            [
                25174,
                25177
            ],
            [
                25181,
                25186
            ],
            [
                25192,
                25277
            ],
            [
                25293,
                25305
            ]
        ],
        "row_chars": [
            [
                0,
                11
            ],
            [
                11,
                116
            ],
            [
                116,
                193
            ],
            [
                193,
                247
            ],
            [
                247,
                473
            ],
            [
                473,
                510
            ],
            [
                510,
                613
            ],
            [
                613,
                747
            ],
            [
                747,
                951
            ],
            [
                951,
                1050
            ],
            [
                1050,
                1087
            ],
            [
                1087,
                1141
            ],
            [
                1141,
                1191
            ],
            [
                1191,
                1302
            ],
            [
                1302,
                1466
            ],
            [
                1466,
                1594
            ],
            [
                1594,
                1636
            ],
            [
                1636,
                1683
            ],
            [
                1683,
                1746
            ],
            [
                1746,
                1784
            ],
            [
                1784,
                1823
            ],
            [
                1823,
                1856
            ],
            [
                1856,
                1889
            ],
            [
                1889,
                1924
            ],
            [
                1924,
                2307
            ],
            [
                2307,
                2349
            ],
            [
                2349,
                2393
            ],
            [
                2393,
                2469
            ],
            [
                2469,
                2667
            ],
            [
                2667,
                2730
            ],
            [
                2730,
                2802
            ],
            [
                2802,
                2847
            ],
            [
                2847,
                3034
            ],
            [
                3034,
                3067
            ],
            [
                3067,
                3131
            ],
            [
                3131,
                3244
            ],
            [
                3244,
                3274
            ],
            [
                3274,
                3373
            ],
            [
                3373,
                3435
            ],
            [
                3435,
                3577
            ],
            [
                3577,
                3609
            ],
            [
                3609,
                3780
            ],
            [
                3780,
                3859
            ],
            [
                3859,
                3884
            ],
            [
                3884,
                3913
            ],
            [
                3913,
                3950
            ],
            [
                3950,
                3980
            ],
            [
                3980,
                3999
            ],
            [
                3999,
                4017
            ],
            [
                4017,
                4050
            ],
            [
                4050,
                4091
            ],
            [
                4091,
                4115
            ],
            [
                4115,
                4148
            ],
            [
                4148,
                4188
            ],
            [
                4188,
                4217
            ],
            [
                4217,
                4262
            ],
            [
                4262,
                4302
            ],
            [
                4302,
                4360
            ],
            [
                4360,
                4388
            ],
            [
                4388,
                4458
            ],
            [
                4458,
                4529
            ],
            [
                4529,
                4560
            ],
            [
                4560,
                4613
            ],
            [
                4613,
                4630
            ],
            [
                4630,
                4663
            ],
            [
                4663,
                4734
            ],
            [
                4734,
                4764
            ],
            [
                4764,
                4784
            ],
            [
                4784,
                4812
            ],
            [
                4812,
                4835
            ],
            [
                4835,
                4911
            ],
            [
                4911,
                4930
            ],
            [
                4930,
                4951
            ],
            [
                4951,
                4969
            ],
            [
                4969,
                5025
            ],
            [
                5025,
                5109
            ],
            [
                5109,
                5154
            ],
            [
                5154,
                5184
            ],
            [
                5184,
                5273
            ],
            [
                5273,
                5317
            ],
            [
                5317,
                5351
            ],
            [
                5351,
                5391
            ],
            [
                5391,
                5398
            ],
            [
                5398,
                5432
            ],
            [
                5432,
                5466
            ],
            [
                5466,
                5500
            ],
            [
                5500,
                5577
            ],
            [
                5577,
                5592
            ],
            [
                5592,
                5680
            ],
            [
                5680,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5787
            ],
            [
                5787,
                5798
            ],
            [
                5798,
                5858
            ],
            [
                5858,
                5900
            ],
            [
                5900,
                5928
            ],
            [
                5928,
                5980
            ],
            [
                5980,
                6119
            ],
            [
                6119,
                6174
            ],
            [
                6174,
                6249
            ],
            [
                6249,
                6388
            ],
            [
                6388,
                6423
            ],
            [
                6423,
                6446
            ],
            [
                6446,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6546
            ],
            [
                6546,
                6578
            ],
            [
                6578,
                6593
            ],
            [
                6593,
                6600
            ],
            [
                6600,
                6726
            ],
            [
                6726,
                6779
            ],
            [
                6779,
                6800
            ],
            [
                6800,
                6883
            ],
            [
                6883,
                6936
            ],
            [
                6936,
                7067
            ],
            [
                7067,
                7175
            ],
            [
                7175,
                7246
            ],
            [
                7246,
                7337
            ],
            [
                7337,
                7552
            ],
            [
                7552,
                7588
            ],
            [
                7588,
                7631
            ],
            [
                7631,
                7665
            ],
            [
                7665,
                7715
            ],
            [
                7715,
                7753
            ],
            [
                7753,
                7785
            ],
            [
                7785,
                7797
            ],
            [
                7797,
                7847
            ],
            [
                7847,
                7934
            ],
            [
                7934,
                7984
            ],
            [
                7984,
                8015
            ],
            [
                8015,
                8086
            ],
            [
                8086,
                8139
            ],
            [
                8139,
                8231
            ],
            [
                8231,
                8290
            ],
            [
                8290,
                8490
            ],
            [
                8490,
                8619
            ],
            [
                8619,
                8687
            ],
            [
                8687,
                8803
            ],
            [
                8803,
                8848
            ],
            [
                8848,
                8916
            ],
            [
                8916,
                9034
            ],
            [
                9034,
                9092
            ],
            [
                9092,
                9114
            ],
            [
                9114,
                9142
            ],
            [
                9142,
                9164
            ],
            [
                9164,
                9194
            ],
            [
                9194,
                9304
            ],
            [
                9304,
                9330
            ],
            [
                9330,
                9359
            ],
            [
                9359,
                9494
            ],
            [
                9494,
                9540
            ],
            [
                9540,
                9600
            ],
            [
                9600,
                9635
            ],
            [
                9635,
                9664
            ],
            [
                9664,
                9771
            ],
            [
                9771,
                9864
            ],
            [
                9864,
                9909
            ],
            [
                9909,
                9954
            ],
            [
                9954,
                9990
            ],
            [
                9990,
                10049
            ],
            [
                10049,
                10196
            ],
            [
                10196,
                10225
            ],
            [
                10225,
                10255
            ],
            [
                10255,
                10346
            ],
            [
                10346,
                10372
            ],
            [
                10372,
                10439
            ],
            [
                10439,
                10474
            ],
            [
                10474,
                10595
            ],
            [
                10595,
                10725
            ],
            [
                10725,
                10831
            ],
            [
                10831,
                10939
            ],
            [
                10939,
                10982
            ],
            [
                10982,
                10994
            ],
            [
                10994,
                11016
            ],
            [
                11016,
                11045
            ],
            [
                11045,
                11223
            ],
            [
                11223,
                11403
            ],
            [
                11403,
                11534
            ],
            [
                11534,
                11650
            ],
            [
                11650,
                11770
            ],
            [
                11770,
                11807
            ],
            [
                11807,
                11946
            ],
            [
                11946,
                12124
            ],
            [
                12124,
                12280
            ],
            [
                12280,
                12357
            ],
            [
                12357,
                12492
            ],
            [
                12492,
                12588
            ],
            [
                12588,
                12687
            ],
            [
                12687,
                12771
            ],
            [
                12771,
                12840
            ],
            [
                12840,
                12935
            ],
            [
                12935,
                13123
            ],
            [
                13123,
                13149
            ],
            [
                13149,
                13234
            ],
            [
                13234,
                13336
            ],
            [
                13336,
                13442
            ],
            [
                13442,
                13564
            ],
            [
                13564,
                13617
            ],
            [
                13617,
                13742
            ],
            [
                13742,
                13770
            ],
            [
                13770,
                13807
            ],
            [
                13807,
                13842
            ],
            [
                13842,
                13955
            ],
            [
                13955,
                14231
            ],
            [
                14231,
                14443
            ],
            [
                14443,
                14709
            ],
            [
                14709,
                14756
            ],
            [
                14756,
                14800
            ],
            [
                14800,
                15007
            ],
            [
                15007,
                15052
            ],
            [
                15052,
                15139
            ],
            [
                15139,
                15211
            ],
            [
                15211,
                15301
            ],
            [
                15301,
                15320
            ],
            [
                15320,
                15416
            ],
            [
                15416,
                15514
            ],
            [
                15514,
                15650
            ],
            [
                15650,
                15736
            ],
            [
                15736,
                15818
            ],
            [
                15818,
                15909
            ],
            [
                15909,
                16023
            ],
            [
                16023,
                16881
            ],
            [
                16881,
                16906
            ],
            [
                16906,
                17048
            ],
            [
                17048,
                17092
            ],
            [
                17092,
                17297
            ],
            [
                17297,
                17417
            ],
            [
                17417,
                17987
            ],
            [
                17987,
                18416
            ],
            [
                18416,
                18485
            ],
            [
                18485,
                18554
            ],
            [
                18554,
                18590
            ],
            [
                18590,
                18685
            ],
            [
                18685,
                18723
            ],
            [
                18723,
                18884
            ],
            [
                18884,
                18944
            ],
            [
                18944,
                19071
            ],
            [
                19071,
                19166
            ],
            [
                19166,
                19254
            ],
            [
                19254,
                19334
            ],
            [
                19334,
                19371
            ],
            [
                19371,
                19484
            ],
            [
                19484,
                19551
            ],
            [
                19551,
                19640
            ],
            [
                19640,
                19724
            ],
            [
                19724,
                19809
            ],
            [
                19809,
                19850
            ],
            [
                19850,
                19931
            ],
            [
                19931,
                20109
            ],
            [
                20109,
                20163
            ],
            [
                20163,
                20221
            ],
            [
                20221,
                20252
            ],
            [
                20252,
                20283
            ],
            [
                20283,
                20303
            ],
            [
                20303,
                20375
            ],
            [
                20375,
                20411
            ],
            [
                20411,
                20657
            ],
            [
                20657,
                20725
            ],
            [
                20725,
                20826
            ],
            [
                20826,
                20884
            ],
            [
                20884,
                20926
            ],
            [
                20926,
                21187
            ],
            [
                21187,
                21232
            ],
            [
                21232,
                21291
            ],
            [
                21291,
                21373
            ],
            [
                21373,
                21437
            ],
            [
                21437,
                21450
            ],
            [
                21450,
                21479
            ],
            [
                21479,
                21538
            ],
            [
                21538,
                21596
            ],
            [
                21596,
                21660
            ],
            [
                21660,
                21695
            ],
            [
                21695,
                21767
            ],
            [
                21767,
                21842
            ],
            [
                21842,
                21916
            ],
            [
                21916,
                21958
            ],
            [
                21958,
                22032
            ],
            [
                22032,
                22059
            ],
            [
                22059,
                22158
            ],
            [
                22158,
                22293
            ],
            [
                22293,
                22391
            ],
            [
                22391,
                22446
            ],
            [
                22446,
                22480
            ],
            [
                22480,
                22540
            ],
            [
                22540,
                22593
            ],
            [
                22593,
                22620
            ],
            [
                22620,
                22706
            ],
            [
                22706,
                22823
            ],
            [
                22823,
                22850
            ],
            [
                22850,
                22906
            ],
            [
                22906,
                23114
            ],
            [
                23114,
                23167
            ],
            [
                23167,
                23294
            ],
            [
                23294,
                23396
            ],
            [
                23396,
                23546
            ],
            [
                23546,
                23593
            ],
            [
                23593,
                23621
            ],
            [
                23621,
                23667
            ],
            [
                23667,
                23699
            ],
            [
                23699,
                23739
            ],
            [
                23739,
                23746
            ],
            [
                23746,
                23801
            ],
            [
                23801,
                23848
            ],
            [
                23848,
                23882
            ],
            [
                23882,
                23981
            ],
            [
                23981,
                24026
            ],
            [
                24026,
                24041
            ],
            [
                24041,
                24101
            ],
            [
                24101,
                24171
            ],
            [
                24171,
                24218
            ],
            [
                24218,
                24282
            ],
            [
                24282,
                24357
            ],
            [
                24357,
                24420
            ],
            [
                24420,
                24451
            ],
            [
                24451,
                24520
            ],
            [
                24520,
                24609
            ],
            [
                24609,
                24846
            ],
            [
                24846,
                24975
            ],
            [
                24975,
                25083
            ],
            [
                25083,
                25174
            ],
            [
                25174,
                25305
            ]
        ]
    },
    "abridged": {
        "text": "Lady Carbury had returned from the soire with Roger. They came up to the drawing-room and found Paul and Henrietta together. Roger had supposed that Montague was still at Liverpool, and could hardly avoid feeling that a meeting between the two had been planned in the mother's absence. Roger was not a man liable to suspicion, but the circumstances were suspicious.\nLady Carbury was the first to speak. \"This is an unexpected pleasure, Mr. Montague.\" The moment she saw Paul she thought that the meeting between Hetta and him had been pre-arranged.\n\"Yes,\" he said lamely, \"I had nothing to do, and thought I would come and see you.\" Lady Carbury disbelieved him, but Roger felt assured that his coming truly had been an accident.\n\"I thought you were at Liverpool,\" said Roger.\n\"I came back today, for that Board in the city. I will tell you all about it later. What has brought you to London?\"\n\"A little business,\" said Roger.\nThere was an awkward silence. Lady Carbury was angry, and Henrietta, knowing the way in which her mother's thoughts would run, forced herself to speak.\n\"Have you had a pleasant evening, mamma?\"\n\"Have you had a pleasant evening, my dear?\" said Lady Carbury, forgetting herself in her desire to punish her daughter.\n\"Indeed, no,\" said Hetta, attempting to laugh, \"I have been trying to work at Dante, but I was just going to bed when Mr. Montague came in. What did you think of the soire, Roger?\"\n\"I was out of my element; but I think your mother liked it.\"\n\"I was very glad indeed to meet Dr. Palmoil. It seems that if we can only open the interior of Africa a little further, we can feed the human race. Isn't that a grand idea, Roger?\"\n\"I doubt whether Dr. Palmoil will be able to put his descendants back into Eden.\"\n\"Roger, for a religious man, you do say the strangest things! I have quite decided that if I am ever able, I will visit the interior of Africa. It is the garden of the world.\"\nThis scrap of enthusiasm so carried them through their difficulties that the two men were able to take their leave with fair comfort. As soon as the door was closed behind them Lady Carbury attacked her daughter.\n\"What brought him here?\"\n\"He brought himself, mamma.\"\n\"Don't answer me in that way, Hetta. Of course he brought himself. That is insolent.\"\n\"Insolent, mamma! How can you say such hard words? I meant that he came of his own accord.\"\n\"How long was he here?\"\n\"Two minutes before you came in. Why do you cross-question me like this? I could not help his coming. I did not desire that he might be shown up.\"\n\"You did not know that he was to come?\"\n\"Mamma, if I am to be suspected, all is over between us.\"\n\"What do you mean by that?\"\n\"If you can think that I would deceive you, you will think so always. If you will not trust me, how am I to live with you? I knew nothing of his coming.\"\n\"Tell me this, Hetta; are you engaged to marry him?\"\n\"No; I am not.\"\n\"Has he asked you to marry him?\"\nHetta paused a moment, considering, before she answered. \"I do not think he ever has.\"\n\"You do not think?\"\n\"I was going on to explain. He never has asked me. But he has said that which makes me know that he wishes me to be his wife.\"\n\"What has he said? When did he say it?\"\nAgain Hetta paused. But again she answered with straightforward simplicity. \"Just before you came in, he said - I don't know what he said; but it meant that.\"\n\"You told me he had been here but a minute.\"\n\"It was very little more. It was almost no time, and yet he said it.\"\n\"He had come prepared to say it.\"\n\"How could he, expecting to find you?\"\n\"Psha! He expected nothing of the kind.\"\n\"I think you do him wrong, mamma. I am sure you are doing me wrong. I think his coming was an accident, and that what he said was also - an accident.\"\n\"An accident!\"\n\"It was not intended, mamma, though I have known it ever so long; and so have you.\"\n\"And what did you say?\"\n\"Nothing. You came.\"\n\"I am sorry that my coming should have been so inopportune. But I must ask one other question, Hetta. What do you intend to say?\"\nHetta was again silent, and now for longer. She put her hand up and pushed back her hair as she thought whether her mother had a right to continue this cross-examination. She had told her mother everything as it had happened. She had kept back no word spoken. But she was not sure that her mother, being so unsympathetic, had a right to know her thoughts.\n\"How do you intend to answer him?\" demanded Lady Carbury.\n\"I do not know that he will ask again.\"\n\"That is prevaricating.\"\n\"No, mamma; I do not prevaricate. It is unfair to say that. I do love him. There. You should know that I should never give him encouragement without telling you. I do love him, and I shall never love anyone else.\"\n\"He is a ruined man. Your cousin says that this Company in which he is involved will go to pieces.\"\nHetta was too clever to allow this argument to pass. \"If so,\" said she, \"Mr. Melmotte will be a ruined man too, and yet you want Felix to marry Marie Melmotte.\"\n\"It makes me ill to hear you talk - as if you understood these things. And you think you will marry this man because he is to make a fortune out of the Railway!\" Lady Carbury spoke with extreme scorn.\n\"I have not thought of his fortune. I have not thought of marrying him, mamma. I think you are very cruel to me. You say things so hard, that I cannot bear them.\"\n\"Why will you not marry your cousin?\"\n\"I am not good enough for him.\"\n\"Nonsense!\"\n\"Very well; but that is what I think. He is so much above me, that, though I do love him, I cannot think of him in that way. I have no secret from you now. Good night, mamma,\" she said, coming up to her mother and kissing her. \"Do be kind to me; and pray, do believe me.\"\nLady Carbury allowed herself to be kissed, and her daughter left the room.\nThere was a great deal said that night between Roger Carbury and Paul Montague; but not a word about Paul's presence in Welbeck Street. Paul asked about the cause of Carbury's journey to London.\n\"I could not speak of it before Hetta,\" said Roger. \"You remember Ruby Ruggles? She was to have married John Crumb, but she has gone off, leaving him most unhappy. John Crumb is almost too good for her.\"\n\"Ruby is very pretty. Has she gone with anyone?\"\n\"No; she went alone. But the horror of it is this. They think that Felix has - well, made love to her, and that she has been taken to London by him.\"\n\"That would be very bad.\"\n\"He certainly knew her. Though he lied when I first spoke to him, I got him to admit that he and she had been friends down in Suffolk. And we know what that means. But I do not think that she came to London at his request.\"\n\"He knows nothing about her coming to town?\"\n\"No. I found him the day after she left, and I think that he knew nothing about it then. Since that he has avoided me. To make matters worse, old Ruggles has now quarrelled with Crumb, and is no longer anxious to get back his granddaughter.\"\nAfter that Paul told all his own story - the double story, about both Melmotte and Mrs. Hurtle. As regarded the Railway, Roger could only tell him to follow the advice of his Liverpool friend. \"I never believed in it, you know. From what I hear Mr. Ramsbottom's character is good; do exactly what he tells you.\"\nBut the Railway business was not the heaviest of Paul's troubles. He had now, for the first time, to tell his friend that Mrs. Hurtle had come to London, and that he had been with her three or four times. It was very hard to speak of his engagement with Mrs. Hurtle without alluding to his love for Henrietta Carbury.\nRoger knew of both loves; he had urged his friend to abandon the widow, and equally urged him to give up the other passion. Were he to marry the widow, all danger on the other side would be at an end. And yet he had to discuss Mrs. Hurtle as though there were no such person as Henrietta. Paul told it all - the rumoured duel, the rumoured murder, and the rumour of the existing husband.\n\"It may be necessary that you should go out to Kansas,\" said Roger.\n\"But even if the rumours are untrue I will not marry her,\" said Paul. Roger shrugged, but said nothing. \"I know I have been a fool,\" continued Paul. \"I know I have been wrong. But if there be a fair cause for my broken word, I will use it.\"\n\"Get out of it honestly if you can; but get out of it. I advised you to do this before. I believe this woman has deceived you. If I were you, nothing should induce me to marry her. I'll go and see her if you like.\"\nBut Paul would not allow this. They sat long into the night, and it was at last resolved that Paul should go next day to Islington, tell Mrs. Hurtle all the stories he had heard, and declare his resolution not to marry her. They both felt how improbable it was that he should get to the end of such a story before the wild cat would show its claws. But Paul declared that, claws or no claws, he would never make Mrs. Hurtle his wife.\n\"I wish it were over, old fellow,\" said Roger.\n\"So do I,\" said Paul.\nHe went to bed like a man condemned to die on the next morning, and when he awoke the wretched reality at once overwhelmed him. He put his hand up to his brow, and almost made himself believe that his head was aching. This was Saturday. Would it not be well to put off his execution till Monday? Were there not still matters to consider? Should he not rush down to Liverpool, and ask a few more questions of Mr. Ramsbottom? Why should he go forth to execution today?\nAt last he jumped out of bed and into his bath-tub, and dressed quickly. He worked himself up into a fit of fortitude, and resolved that the thing should be done before the fit was over. He ate his breakfast, and then, although it was still early, he threw himself into a Hansom cab, and ordered the man to drive him to Islington.\nHow quick that cab went! Before Paul had been able to arrange the words with which he would begin the interview, the cab was in Islington and dashed noisily up to the house. Paul paid the cabman, pushed open the iron gate and walked very quickly past the little garden up to the door. He rang rather furiously, and asked for Mrs. Hurtle.\n\"Mrs. Hurtle is out for the day,\" said the girl who opened the door. \"Leastways, she went out yesterday and won't be back till tonight.\"\nProvidence had sent him a reprieve! But he almost forgot the reprieve, as he looked at the girl and saw that she was Ruby Ruggles.\n\"Oh laws, Mr. Montague, is that you?\" Ruby recognised Paul as quickly as he did her; and thought at once that he had come in search of her. She knew that Roger Carbury was in town looking for her. She had learned this from Sir Felix - for she had seen the baronet more than once since her arrival. Now she felt that she was caught. In her terror she did not remember that the visitor had asked for Mrs. Hurtle.\n\"Yes. I was sorry to hear, Miss Ruggles, that you had left your home.\"\n\"I'm all right, Mr. Montague. Mrs. Pipkin is my aunt, or, leastways, my mother's brother's widow, though grandfather never would speak to her. She's quite respectable, and has five children, and lets lodgings. There's a lady here now, and has gone away with her just for one night down to Southend. They'll be back this evening, and I've the children to mind, with the servant girl. I'm quite respectable here, Mr. Montague, and nobody need be a bit afraid about me.\"\n\"Mrs. Hurtle has gone down to Southend?\"\n\"Yes, Mr. Montague; she wasn't quite well, and wanted a breath of air, she said. And aunt didn't like she should go alone, so they've gone, and the baby with them. Do you know Mrs. Hurtle, sir?\"\n\"Yes; she's a friend of mine.\"\n\"Oh, I didn't know. Should I say, sir, as you was here?\"\n\"I'm afraid they are very unhappy about you down at Bungay, Miss Ruggles,\" said Paul.\n\"Then they've got to be unhappy; that's all. Grandfather is that provoking a young woman can't live with him. He lugged me all about the room by my hair, Mr. Montague. How is a young woman to put up with that? And I did everything for him, his linen, and his victuals, and even cleaned his boots of a Sunday. You won't see me again at Sheep's Acre.\"\n\"But I thought there was somebody else to give you a home.\"\n\"Oh, yes, there's John Crumb.\"\n\"You were to have married him, I thought.\"\n\"Ladies is to change their minds if they like, Mr. Montague. Grandfather made me say I'd have him, but I never cared that for him.\"\n\"I'm afraid, Miss Ruggles, you won't find a better man up here in London.\"\n\"I didn't come here to look for a man, Mr. Montague. They has to look for me, if they want me. But I am looked after; and that by one as John Crumb ain't fit to touch.\"\nThat told the whole story. Paul was quite sure that Roger's fear about Felix was well founded.\n\"But there's Betsy a crying upstairs,\" said Ruby.\n\"I will tell the Squire that I saw you, Miss Ruggles.\"\n\"You can tell if you please, Mr. Montague, of course. I'm a coming, my darling.\"\nPaul made his way into Mrs. Hurtle's sitting-room and wrote a note for her. He had come, he said, immediately on his return from Liverpool, and was sorry to find that she was away for the day. When should he call again? If she would make an appointment he would attend to it.\nThis would give him another day. Mrs. Hurtle would not return till late in the evening, and as the following day was Sunday there would be no postal delivery. He left the note on the table, and called to Ruby to tell her that he was going.\n\"Mr. Montague,\" she said in a confidential whisper, tripping down the stairs, \"I don't see why you need be saying anything about me, you know.\"\n\"Your grandfather is very anxious about you.\"\n\"Not a bit of it, Mr. Montague. Grandfather knows very well where I am. He doesn't want me back, and I ain't a going. Why should the Squire bother himself about me?\"\n\"He's afraid, Miss Ruggles, that you are trusting yourself to a young man who is not trustworthy.\"\n\"I can mind myself very well, Mr. Montague.\"\n\"Have you seen Sir Felix Carbury since you've been in town?\" Ruby flushed up to her forehead. \"You may be sure that he means you no good.\"\n\"I don't see why I shouldn't have my friend, Mr. Montague, as well as you. Howsomever, if you'll not tell, I'll be ever so much obliged.\"\n\"But I must tell Mr. Carbury.\"\n\"Then I ain't obliged to you one bit,\" said Ruby, shutting the door.\nPaul as he walked away could not help thinking of the justice of Ruby's reproach. What business had he to advise her in love - he, who had engaged himself to marry Mrs. Hurtle, and who the evening before had declared his love to Hetta Carbury?\nIn regard to Mrs. Hurtle he had got a reprieve, he thought, for two days; but it did not make him comfortable. He thought of Hetta Carbury, and the words he had spoken to her. If he had heard the declaration which she had made to her mother, he would have been able for the hour to forget Mrs. Hurtle.",
        "paragraph_chars": [
            [
                0,
                366
            ],
            [
                366,
                549
            ],
            [
                549,
                730
            ],
            [
                730,
                777
            ],
            [
                777,
                894
            ],
            [
                894,
                927
            ],
            [
                927,
                1079
            ],
            [
                1079,
                1121
            ],
            [
                1121,
                1241
            ],
            [
                1241,
                1422
            ],
            [
                1422,
                1483
            ],
            [
                1483,
                1664
            ],
            [
                1664,
                1746
            ],
            [
                1746,
                1922
            ],
            [
                1922,
                2135
            ],
            [
                2135,
                2160
            ],
            [
                2160,
                2189
            ],
            [
                2189,
                2275
            ],
            [
                2275,
                2367
            ],
            [
                2367,
                2391
            ],
            [
                2391,
                2538
            ],
            [
                2538,
                2578
            ],
            [
                2578,
                2636
            ],
            [
                2636,
                2664
            ],
            [
                2664,
                2818
            ],
            [
                2818,
                2871
            ],
            [
                2871,
                2887
            ],
            [
                2887,
                2920
            ],
            [
                2920,
                3007
            ],
            [
                3007,
                3027
            ],
            [
                3027,
                3154
            ],
            [
                3154,
                3194
            ],
            [
                3194,
                3353
            ],
            [
                3353,
                3398
            ],
            [
                3398,
                3468
            ],
            [
                3468,
                3502
            ],
            [
                3502,
                3541
            ],
            [
                3541,
                3582
            ],
            [
                3582,
                3733
            ],
            [
                3733,
                3748
            ],
            [
                3748,
                3832
            ],
            [
                3832,
                3856
            ],
            [
                3856,
                3877
            ],
            [
                3877,
                4007
            ],
            [
                4007,
                4363
            ],
            [
                4363,
                4421
            ],
            [
                4421,
                4461
            ],
            [
                4461,
                4486
            ],
            [
                4486,
                4700
            ],
            [
                4700,
                4800
            ],
            [
                4800,
                4961
            ],
            [
                4961,
                5162
            ],
            [
                5162,
                5325
            ],
            [
                5325,
                5363
            ],
            [
                5363,
                5395
            ],
            [
                5395,
                5407
            ],
            [
                5407,
                5679
            ],
            [
                5679,
                5754
            ],
            [
                5754,
                5949
            ],
            [
                5949,
                6153
            ],
            [
                6153,
                6202
            ],
            [
                6202,
                6352
            ],
            [
                6352,
                6378
            ],
            [
                6378,
                6602
            ],
            [
                6602,
                6647
            ],
            [
                6647,
                6889
            ],
            [
                6889,
                7201
            ],
            [
                7201,
                7519
            ],
            [
                7519,
                7907
            ],
            [
                7907,
                7975
            ],
            [
                7975,
                8216
            ],
            [
                8216,
                8431
            ],
            [
                8431,
                8865
            ],
            [
                8865,
                8912
            ],
            [
                8912,
                8934
            ],
            [
                8934,
                9401
            ],
            [
                9401,
                9732
            ],
            [
                9732,
                10070
            ],
            [
                10070,
                10207
            ],
            [
                10207,
                10338
            ],
            [
                10338,
                10749
            ],
            [
                10749,
                10820
            ],
            [
                10820,
                11288
            ],
            [
                11288,
                11329
            ],
            [
                11329,
                11524
            ],
            [
                11524,
                11555
            ],
            [
                11555,
                11612
            ],
            [
                11612,
                11698
            ],
            [
                11698,
                12048
            ],
            [
                12048,
                12108
            ],
            [
                12108,
                12139
            ],
            [
                12139,
                12182
            ],
            [
                12182,
                12314
            ],
            [
                12314,
                12389
            ],
            [
                12389,
                12558
            ],
            [
                12558,
                12653
            ],
            [
                12653,
                12703
            ],
            [
                12703,
                12758
            ],
            [
                12758,
                12839
            ],
            [
                12839,
                13115
            ],
            [
                13115,
                13355
            ],
            [
                13355,
                13499
            ],
            [
                13499,
                13545
            ],
            [
                13545,
                13711
            ],
            [
                13711,
                13810
            ],
            [
                13810,
                13855
            ],
            [
                13855,
                13994
            ],
            [
                13994,
                14132
            ],
            [
                14132,
                14163
            ],
            [
                14163,
                14232
            ],
            [
                14232,
                14476
            ],
            [
                14476,
                14777
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                125
            ],
            [
                125,
                286
            ],
            [
                286,
                366
            ],
            [
                366,
                403
            ],
            [
                403,
                451
            ],
            [
                451,
                549
            ],
            [
                549,
                633
            ],
            [
                633,
                730
            ],
            [
                730,
                777
            ],
            [
                777,
                825
            ],
            [
                825,
                861
            ],
            [
                861,
                894
            ],
            [
                894,
                927
            ],
            [
                927,
                957
            ],
            [
                957,
                1079
            ],
            [
                1079,
                1121
            ],
            [
                1121,
                1165
            ],
            [
                1165,
                1241
            ],
            [
                1241,
                1381
            ],
            [
                1381,
                1422
            ],
            [
                1422,
                1483
            ],
            [
                1483,
                1528
            ],
            [
                1528,
                1631
            ],
            [
                1631,
                1664
            ],
            [
                1664,
                1746
            ],
            [
                1746,
                1808
            ],
            [
                1808,
                1890
            ],
            [
                1890,
                1922
            ],
            [
                1922,
                2056
            ],
            [
                2056,
                2135
            ],
            [
                2135,
                2160
            ],
            [
                2160,
                2189
            ],
            [
                2189,
                2226
            ],
            [
                2226,
                2256
            ],
            [
                2256,
                2275
            ],
            [
                2275,
                2293
            ],
            [
                2293,
                2326
            ],
            [
                2326,
                2367
            ],
            [
                2367,
                2391
            ],
            [
                2391,
                2424
            ],
            [
                2424,
                2464
            ],
            [
                2464,
                2493
            ],
            [
                2493,
                2538
            ],
            [
                2538,
                2578
            ],
            [
                2578,
                2636
            ],
            [
                2636,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2787
            ],
            [
                2787,
                2818
            ],
            [
                2818,
                2871
            ],
            [
                2871,
                2887
            ],
            [
                2887,
                2920
            ],
            [
                2920,
                2977
            ],
            [
                2977,
                3007
            ],
            [
                3007,
                3027
            ],
            [
                3027,
                3055
            ],
            [
                3055,
                3078
            ],
            [
                3078,
                3154
            ],
            [
                3154,
                3173
            ],
            [
                3173,
                3194
            ],
            [
                3194,
                3214
            ],
            [
                3214,
                3270
            ],
            [
                3270,
                3353
            ],
            [
                3353,
                3398
            ],
            [
                3398,
                3424
            ],
            [
                3424,
                3468
            ],
            [
                3468,
                3502
            ],
            [
                3502,
                3541
            ],
            [
                3541,
                3548
            ],
            [
                3548,
                3582
            ],
            [
                3582,
                3616
            ],
            [
                3616,
                3650
            ],
            [
                3650,
                3733
            ],
            [
                3733,
                3748
            ],
            [
                3748,
                3832
            ],
            [
                3832,
                3856
            ],
            [
                3856,
                3866
            ],
            [
                3866,
                3877
            ],
            [
                3877,
                3937
            ],
            [
                3937,
                3979
            ],
            [
                3979,
                4007
            ],
            [
                4007,
                4051
            ],
            [
                4051,
                4178
            ],
            [
                4178,
                4233
            ],
            [
                4233,
                4267
            ],
            [
                4267,
                4363
            ],
            [
                4363,
                4398
            ],
            [
                4398,
                4421
            ],
            [
                4421,
                4461
            ],
            [
                4461,
                4486
            ],
            [
                4486,
                4520
            ],
            [
                4520,
                4546
            ],
            [
                4546,
                4561
            ],
            [
                4561,
                4568
            ],
            [
                4568,
                4648
            ],
            [
                4648,
                4700
            ],
            [
                4700,
                4721
            ],
            [
                4721,
                4800
            ],
            [
                4800,
                4853
            ],
            [
                4853,
                4961
            ],
            [
                4961,
                5032
            ],
            [
                5032,
                5123
            ],
            [
                5123,
                5162
            ],
            [
                5162,
                5198
            ],
            [
                5198,
                5241
            ],
            [
                5241,
                5275
            ],
            [
                5275,
                5325
            ],
            [
                5325,
                5363
            ],
            [
                5363,
                5395
            ],
            [
                5395,
                5407
            ],
            [
                5407,
                5445
            ],
            [
                5445,
                5532
            ],
            [
                5532,
                5563
            ],
            [
                5563,
                5634
            ],
            [
                5634,
                5679
            ],
            [
                5679,
                5754
            ],
            [
                5754,
                5890
            ],
            [
                5890,
                5949
            ],
            [
                5949,
                6001
            ],
            [
                6001,
                6029
            ],
            [
                6029,
                6113
            ],
            [
                6113,
                6153
            ],
            [
                6153,
                6175
            ],
            [
                6175,
                6202
            ],
            [
                6202,
                6223
            ],
            [
                6223,
                6253
            ],
            [
                6253,
                6352
            ],
            [
                6352,
                6378
            ],
            [
                6378,
                6402
            ],
            [
                6402,
                6513
            ],
            [
                6513,
                6542
            ],
            [
                6542,
                6602
            ],
            [
                6602,
                6647
            ],
            [
                6647,
                6652
            ],
            [
                6652,
                6736
            ],
            [
                6736,
                6766
            ],
            [
                6766,
                6889
            ],
            [
                6889,
                6985
            ],
            [
                6985,
                7082
            ],
            [
                7082,
                7117
            ],
            [
                7117,
                7201
            ],
            [
                7201,
                7267
            ],
            [
                7267,
                7406
            ],
            [
                7406,
                7519
            ],
            [
                7519,
                7643
            ],
            [
                7643,
                7720
            ],
            [
                7720,
                7808
            ],
            [
                7808,
                7907
            ],
            [
                7907,
                7975
            ],
            [
                7975,
                8045
            ],
            [
                8045,
                8079
            ],
            [
                8079,
                8124
            ],
            [
                8124,
                8151
            ],
            [
                8151,
                8216
            ],
            [
                8216,
                8271
            ],
            [
                8271,
                8304
            ],
            [
                8304,
                8343
            ],
            [
                8343,
                8397
            ],
            [
                8397,
                8431
            ],
            [
                8431,
                8462
            ],
            [
                8462,
                8655
            ],
            [
                8655,
                8780
            ],
            [
                8780,
                8865
            ],
            [
                8865,
                8912
            ],
            [
                8912,
                8934
            ],
            [
                8934,
                9062
            ],
            [
                9062,
                9152
            ],
            [
                9152,
                9171
            ],
            [
                9171,
                9230
            ],
            [
                9230,
                9272
            ],
            [
                9272,
                9358
            ],
            [
                9358,
                9401
            ],
            [
                9401,
                9474
            ],
            [
                9474,
                9588
            ],
            [
                9588,
                9732
            ],
            [
                9732,
                9757
            ],
            [
                9757,
                9906
            ],
            [
                9906,
                10017
            ],
            [
                10017,
                10070
            ],
            [
                10070,
                10139
            ],
            [
                10139,
                10207
            ],
            [
                10207,
                10243
            ],
            [
                10243,
                10338
            ],
            [
                10338,
                10376
            ],
            [
                10376,
                10478
            ],
            [
                10478,
                10535
            ],
            [
                10535,
                10636
            ],
            [
                10636,
                10670
            ],
            [
                10670,
                10749
            ],
            [
                10749,
                10755
            ],
            [
                10755,
                10820
            ],
            [
                10820,
                10850
            ],
            [
                10850,
                10963
            ],
            [
                10963,
                11030
            ],
            [
                11030,
                11119
            ],
            [
                11119,
                11203
            ],
            [
                11203,
                11288
            ],
            [
                11288,
                11329
            ],
            [
                11329,
                11410
            ],
            [
                11410,
                11493
            ],
            [
                11493,
                11524
            ],
            [
                11524,
                11555
            ],
            [
                11555,
                11575
            ],
            [
                11575,
                11612
            ],
            [
                11612,
                11698
            ],
            [
                11698,
                11743
            ],
            [
                11743,
                11808
            ],
            [
                11808,
                11866
            ],
            [
                11866,
                11908
            ],
            [
                11908,
                12007
            ],
            [
                12007,
                12048
            ],
            [
                12048,
                12108
            ],
            [
                12108,
                12139
            ],
            [
                12139,
                12182
            ],
            [
                12182,
                12243
            ],
            [
                12243,
                12314
            ],
            [
                12314,
                12389
            ],
            [
                12389,
                12442
            ],
            [
                12442,
                12484
            ],
            [
                12484,
                12558
            ],
            [
                12558,
                12585
            ],
            [
                12585,
                12653
            ],
            [
                12653,
                12703
            ],
            [
                12703,
                12758
            ],
            [
                12758,
                12812
            ],
            [
                12812,
                12839
            ],
            [
                12839,
                12915
            ],
            [
                12915,
                13032
            ],
            [
                13032,
                13059
            ],
            [
                13059,
                13115
            ],
            [
                13115,
                13148
            ],
            [
                13148,
                13274
            ],
            [
                13274,
                13355
            ],
            [
                13355,
                13499
            ],
            [
                13499,
                13545
            ],
            [
                13545,
                13577
            ],
            [
                13577,
                13617
            ],
            [
                13617,
                13663
            ],
            [
                13663,
                13711
            ],
            [
                13711,
                13810
            ],
            [
                13810,
                13855
            ],
            [
                13855,
                13916
            ],
            [
                13916,
                13949
            ],
            [
                13949,
                13994
            ],
            [
                13994,
                14069
            ],
            [
                14069,
                14132
            ],
            [
                14132,
                14163
            ],
            [
                14163,
                14232
            ],
            [
                14232,
                14314
            ],
            [
                14314,
                14476
            ],
            [
                14476,
                14587
            ],
            [
                14587,
                14652
            ],
            [
                14652,
                14777
            ]
        ],
        "overlap_chars": [
            [
                0,
                25
            ],
            [
                26,
                40
            ],
            [
                41,
                45
            ],
            [
                46,
                51
            ],
            [
                51,
                53
            ],
            [
                53,
                57
            ],
            [
                58,
                125
            ],
            [
                125,
                130
            ],
            [
                135,
                185
            ],
            [
                186,
                204
            ],
            [
                205,
                247
            ],
            [
                248,
                286
            ],
            [
                286,
                291
            ],
            [
                292,
                295
            ],
            [
                296,
                299
            ],
            [
                300,
                305
            ],
            [
                306,
                348
            ],
            [
                349,
                365
            ],
            [
                366,
                403
            ],
            [
                403,
                411
            ],
            [
                412,
                451
            ],
            [
                451,
                474
            ],
            [
                487,
                538
            ],
            [
                547,
                549
            ],
            [
                549,
                563
            ],
            [
                564,
                568
            ],
            [
                570,
                571
            ],
            [
                572,
                597
            ],
            [
                598,
                605
            ],
            [
                606,
                618
            ],
            [
                619,
                633
            ],
            [
                633,
                661
            ],
            [
                661,
                701
            ],
            [
                708,
                729
            ],
            [
                730,
                777
            ],
            [
                777,
                789
            ],
            [
                795,
                796
            ],
            [
                801,
                825
            ],
            [
                825,
                853
            ],
            [
                859,
                861
            ],
            [
                861,
                894
            ],
            [
                894,
                927
            ],
            [
                927,
                957
            ],
            [
                957,
                984
            ],
            [
                985,
                994
            ],
            [
                994,
                995
            ],
            [
                1004,
                1052
            ],
            [
                1052,
                1053
            ],
            [
                1054,
                1060
            ],
            [
                1061,
                1068
            ],
            [
                1069,
                1078
            ],
            [
                1079,
                1121
            ],
            [
                1121,
                1165
            ],
            [
                1165,
                1241
            ],
            [
                1241,
                1315
            ],
            [
                1316,
                1329
            ],
            [
                1330,
                1381
            ],
            [
                1381,
                1406
            ],
            [
                1412,
                1422
            ],
            [
                1422,
                1446
            ],
            [
                1446,
                1483
            ],
            [
                1483,
                1528
            ],
            [
                1528,
                1609
            ],
            [
                1615,
                1631
            ],
            [
                1631,
                1664
            ],
            [
                1664,
                1665
            ],
            [
                1665,
                1746
            ],
            [
                1746,
                1808
            ],
            [
                1808,
                1820
            ],
            [
                1834,
                1836
            ],
            [
                1837,
                1838
            ],
            [
                1842,
                1846
            ],
            [
                1851,
                1890
            ],
            [
                1890,
                1922
            ],
            [
                1922,
                1976
            ],
            [
                1977,
                2036
            ],
            [
                2037,
                2056
            ],
            [
                2056,
                2134
            ],
            [
                2135,
                2160
            ],
            [
                2160,
                2189
            ],
            [
                2189,
                2226
            ],
            [
                2226,
                2256
            ],
            [
                2256,
                2275
            ],
            [
                2275,
                2293
            ],
            [
                2293,
                2326
            ],
            [
                2326,
                2367
            ],
            [
                2367,
                2391
            ],
            [
                2391,
                2424
            ],
            [
                2424,
                2464
            ],
            [
                2464,
                2493
            ],
            [
                2493,
                2538
            ],
            [
                2538,
                2578
            ],
            [
                2578,
                2636
            ],
            [
                2636,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2785
            ],
            [
                2785,
                2787
            ],
            [
                2787,
                2818
            ],
            [
                2818,
                2871
            ],
            [
                2871,
                2875
            ],
            [
                2876,
                2887
            ],
            [
                2887,
                2920
            ],
            [
                2920,
                2975
            ],
            [
                2975,
                2977
            ],
            [
                2977,
                3007
            ],
            [
                3007,
                3027
            ],
            [
                3027,
                3055
            ],
            [
                3055,
                3078
            ],
            [
                3078,
                3154
            ],
            [
                3154,
                3173
            ],
            [
                3173,
                3194
            ],
            [
                3194,
                3199
            ],
            [
                3206,
                3214
            ],
            [
                3214,
                3270
            ],
            [
                3270,
                3303
            ],
            [
                3306,
                3353
            ],
            [
                3353,
                3398
            ],
            [
                3398,
                3405
            ],
            [
                3406,
                3424
            ],
            [
                3424,
                3468
            ],
            [
                3468,
                3502
            ],
            [
                3502,
                3516
            ],
            [
                3527,
                3541
            ],
            [
                3541,
                3548
            ],
            [
                3548,
                3582
            ],
            [
                3582,
                3616
            ],
            [
                3616,
                3650
            ],
            [
                3650,
                3711
            ],
            [
                3719,
                3733
            ],
            [
                3733,
                3748
            ],
            [
                3748,
                3769
            ],
            [
                3770,
                3775
            ],
            [
                3775,
                3776
            ],
            [
                3784,
                3813
            ],
            [
                3814,
                3829
            ],
            [
                3832,
                3836
            ],
            [
                3837,
                3856
            ],
            [
                3856,
                3866
            ],
            [
                3866,
                3877
            ],
            [
                3877,
                3937
            ],
            [
                3937,
                3979
            ],
            [
                3979,
                4006
            ],
            [
                4007,
                4042
            ],
            [
                4043,
                4049
            ],
            [
                4049,
                4051
            ],
            [
                4051,
                4070
            ],
            [
                4071,
                4178
            ],
            [
                4178,
                4233
            ],
            [
                4233,
                4253
            ],
            [
                4254,
                4265
            ],
            [
                4265,
                4267
            ],
            [
                4267,
                4303
            ],
            [
                4303,
                4304
            ],
            [
                4311,
                4313
            ],
            [
                4329,
                4361
            ],
            [
                4361,
                4362
            ],
            [
                4363,
                4398
            ],
            [
                4398,
                4421
            ],
            [
                4421,
                4461
            ],
            [
                4461,
                4486
            ],
            [
                4486,
                4497
            ],
            [
                4498,
                4520
            ],
            [
                4520,
                4544
            ],
            [
                4544,
                4546
            ],
            [
                4546,
                4561
            ],
            [
                4561,
                4568
            ],
            [
                4568,
                4571
            ],
            [
                4579,
                4646
            ],
            [
                4646,
                4648
            ],
            [
                4648,
                4685
            ],
            [
                4693,
                4700
            ],
            [
                4700,
                4721
            ],
            [
                4721,
                4742
            ],
            [
                4743,
                4800
            ],
            [
                4800,
                4853
            ],
            [
                4853,
                4961
            ],
            [
                4961,
                4994
            ],
            [
                4997,
                5032
            ],
            [
                5032,
                5123
            ],
            [
                5123,
                5135
            ],
            [
                5142,
                5146
            ],
            [
                5155,
                5160
            ],
            [
                5160,
                5162
            ],
            [
                5162,
                5198
            ],
            [
                5198,
                5241
            ],
            [
                5241,
                5275
            ],
            [
                5275,
                5325
            ],
            [
                5325,
                5363
            ],
            [
                5363,
                5395
            ],
            [
                5395,
                5407
            ],
            [
                5407,
                5418
            ],
            [
                5419,
                5445
            ],
            [
                5445,
                5532
            ],
            [
                5532,
                5563
            ],
            [
                5563,
                5634
            ],
            [
                5634,
                5662
            ],
            [
                5663,
                5678
            ],
            [
                5679,
                5691
            ],
            [
                5692,
                5725
            ],
            [
                5726,
                5738
            ],
            [
                5744,
                5754
            ],
            [
                5754,
                5832
            ],
            [
                5838,
                5848
            ],
            [
                5855,
                5890
            ],
            [
                5895,
                5900
            ],
            [
                5907,
                5948
            ],
            [
                5949,
                5950
            ],
            [
                5950,
                5986
            ],
            [
                5986,
                5999
            ],
            [
                5999,
                6001
            ],
            [
                6001,
                6005
            ],
            [
                6006,
                6014
            ],
            [
                6015,
                6019
            ],
            [
                6020,
                6027
            ],
            [
                6027,
                6029
            ],
            [
                6029,
                6063
            ],
            [
                6063,
                6064
            ],
            [
                6065,
                6094
            ],
            [
                6104,
                6111
            ],
            [
                6111,
                6113
            ],
            [
                6113,
                6126
            ],
            [
                6127,
                6153
            ],
            [
                6153,
                6175
            ],
            [
                6175,
                6192
            ],
            [
                6199,
                6202
            ],
            [
                6202,
                6206
            ],
            [
                6207,
                6223
            ],
            [
                6223,
                6253
            ],
            [
                6253,
                6263
            ],
            [
                6264,
                6278
            ],
            [
                6281,
                6352
            ],
            [
                6352,
                6378
            ],
            [
                6378,
                6391
            ],
            [
                6397,
                6402
            ],
            [
                6402,
                6416
            ],
            [
                6417,
                6445
            ],
            [
                6450,
                6513
            ],
            [
                6517,
                6529
            ],
            [
                6535,
                6542
            ],
            [
                6542,
                6591
            ],
            [
                6602,
                6647
            ],
            [
                6647,
                6648
            ],
            [
                6650,
                6652
            ],
            [
                6652,
                6653
            ],
            [
                6660,
                6663
            ],
            [
                6664,
                6667
            ],
            [
                6678,
                6681
            ],
            [
                6686,
                6691
            ],
            [
                6692,
                6720
            ],
            [
                6730,
                6734
            ],
            [
                6734,
                6736
            ],
            [
                6736,
                6766
            ],
            [
                6766,
                6787
            ],
            [
                6789,
                6886
            ],
            [
                6889,
                6927
            ],
            [
                6930,
                6947
            ],
            [
                6954,
                6958
            ],
            [
                6959,
                6971
            ],
            [
                6972,
                6985
            ],
            [
                6985,
                7045
            ],
            [
                7046,
                7082
            ],
            [
                7082,
                7102
            ],
            [
                7105,
                7115
            ],
            [
                7117,
                7163
            ],
            [
                7164,
                7169
            ],
            [
                7170,
                7201
            ],
            [
                7201,
                7225
            ],
            [
                7226,
                7249
            ],
            [
                7257,
                7267
            ],
            [
                7267,
                7406
            ],
            [
                7406,
                7474
            ],
            [
                7475,
                7518
            ],
            [
                7519,
                7544
            ],
            [
                7548,
                7551
            ],
            [
                7558,
                7594
            ],
            [
                7595,
                7602
            ],
            [
                7609,
                7643
            ],
            [
                7643,
                7720
            ],
            [
                7720,
                7727
            ],
            [
                7728,
                7730
            ],
            [
                7735,
                7737
            ],
            [
                7746,
                7757
            ],
            [
                7758,
                7793
            ],
            [
                7794,
                7806
            ],
            [
                7806,
                7808
            ],
            [
                7808,
                7824
            ],
            [
                7827,
                7907
            ],
            [
                7907,
                7960
            ],
            [
                7960,
                7975
            ],
            [
                7975,
                7999
            ],
            [
                8004,
                8045
            ],
            [
                8045,
                8059
            ],
            [
                8059,
                8064
            ],
            [
                8065,
                8079
            ],
            [
                8079,
                8080
            ],
            [
                8080,
                8105
            ],
            [
                8108,
                8123
            ],
            [
                8125,
                8151
            ],
            [
                8151,
                8154
            ],
            [
                8155,
                8213
            ],
            [
                8213,
                8216
            ],
            [
                8216,
                8217
            ],
            [
                8217,
                8230
            ],
            [
                8231,
                8255
            ],
            [
                8256,
                8269
            ],
            [
                8271,
                8272
            ],
            [
                8281,
                8284
            ],
            [
                8285,
                8287
            ],
            [
                8288,
                8290
            ],
            [
                8296,
                8302
            ],
            [
                8302,
                8304
            ],
            [
                8304,
                8305
            ],
            [
                8306,
                8313
            ],
            [
                8314,
                8324
            ],
            [
                8325,
                8343
            ],
            [
                8343,
                8395
            ],
            [
                8395,
                8397
            ],
            [
                8397,
                8428
            ],
            [
                8428,
                8431
            ],
            [
                8431,
                8449
            ],
            [
                8456,
                8462
            ],
            [
                8462,
                8519
            ],
            [
                8520,
                8524
            ],
            [
                8525,
                8539
            ],
            [
                8540,
                8544
            ],
            [
                8549,
                8562
            ],
            [
                8563,
                8595
            ],
            [
                8596,
                8613
            ],
            [
                8622,
                8636
            ],
            [
                8644,
                8655
            ],
            [
                8655,
                8706
            ],
            [
                8707,
                8737
            ],
            [
                8738,
                8744
            ],
            [
                8745,
                8768
            ],
            [
                8778,
                8780
            ],
            [
                8780,
                8783
            ],
            [
                8784,
                8788
            ],
            [
                8798,
                8802
            ],
            [
                8802,
                8822
            ],
            [
                8823,
                8864
            ],
            [
                8865,
                8912
            ],
            [
                8912,
                8932
            ],
            [
                8932,
                8934
            ],
            [
                8934,
                9001
            ],
            [
                9007,
                9015
            ],
            [
                9016,
                9062
            ],
            [
                9062,
                9152
            ],
            [
                9152,
                9171
            ],
            [
                9171,
                9191
            ],
            [
                9195,
                9230
            ],
            [
                9235,
                9244
            ],
            [
                9270,
                9272
            ],
            [
                9272,
                9358
            ],
            [
                9358,
                9393
            ],
            [
                9399,
                9401
            ],
            [
                9401,
                9442
            ],
            [
                9448,
                9464
            ],
            [
                9465,
                9472
            ],
            [
                9472,
                9474
            ],
            [
                9474,
                9588
            ],
            [
                9588,
                9608
            ],
            [
                9608,
                9618
            ],
            [
                9618,
                9619
            ],
            [
                9629,
                9631
            ],
            [
                9632,
                9635
            ],
            [
                9642,
                9647
            ],
            [
                9647,
                9648
            ],
            [
                9649,
                9732
            ],
            [
                9732,
                9757
            ],
            [
                9757,
                9768
            ],
            [
                9769,
                9843
            ],
            [
                9843,
                9844
            ],
            [
                9845,
                9852
            ],
            [
                9853,
                9856
            ],
            [
                9857,
                9859
            ],
            [
                9870,
                9873
            ],
            [
                9874,
                9880
            ],
            [
                9889,
                9898
            ],
            [
                9899,
                9904
            ],
            [
                9904,
                9906
            ],
            [
                9906,
                9910
            ],
            [
                9911,
                9927
            ],
            [
                9940,
                9977
            ],
            [
                9983,
                9986
            ],
            [
                9987,
                10000
            ],
            [
                10001,
                10015
            ],
            [
                10015,
                10016
            ],
            [
                10017,
                10019
            ],
            [
                10020,
                10046
            ],
            [
                10047,
                10070
            ],
            [
                10070,
                10139
            ],
            [
                10139,
                10196
            ],
            [
                10204,
                10206
            ],
            [
                10207,
                10243
            ],
            [
                10243,
                10337
            ],
            [
                10338,
                10376
            ],
            [
                10376,
                10380
            ],
            [
                10381,
                10391
            ],
            [
                10392,
                10396
            ],
            [
                10397,
                10421
            ],
            [
                10423,
                10426
            ],
            [
                10435,
                10472
            ],
            [
                10473,
                10476
            ],
            [
                10476,
                10478
            ],
            [
                10478,
                10509
            ],
            [
                10510,
                10535
            ],
            [
                10535,
                10542
            ],
            [
                10543,
                10550
            ],
            [
                10551,
                10555
            ],
            [
                10556,
                10570
            ],
            [
                10573,
                10576
            ],
            [
                10577,
                10636
            ],
            [
                10636,
                10670
            ],
            [
                10670,
                10695
            ],
            [
                10696,
                10749
            ],
            [
                10749,
                10753
            ],
            [
                10753,
                10754
            ],
            [
                10755,
                10820
            ],
            [
                10820,
                10848
            ],
            [
                10848,
                10850
            ],
            [
                10850,
                10963
            ],
            [
                10963,
                11030
            ],
            [
                11030,
                11119
            ],
            [
                11119,
                11203
            ],
            [
                11203,
                11288
            ],
            [
                11288,
                11329
            ],
            [
                11329,
                11410
            ],
            [
                11410,
                11451
            ],
            [
                11452,
                11493
            ],
            [
                11493,
                11524
            ],
            [
                11524,
                11555
            ],
            [
                11555,
                11558
            ],
            [
                11560,
                11575
            ],
            [
                11582,
                11583
            ],
            [
                11584,
                11612
            ],
            [
                11612,
                11684
            ],
            [
                11692,
                11696
            ],
            [
                11696,
                11697
            ],
            [
                11698,
                11741
            ],
            [
                11741,
                11743
            ],
            [
                11743,
                11772
            ],
            [
                11773,
                11806
            ],
            [
                11806,
                11808
            ],
            [
                11808,
                11866
            ],
            [
                11866,
                11908
            ],
            [
                11908,
                11937
            ],
            [
                11938,
                12005
            ],
            [
                12005,
                12007
            ],
            [
                12007,
                12045
            ],
            [
                12045,
                12048
            ],
            [
                12048,
                12086
            ],
            [
                12087,
                12108
            ],
            [
                12109,
                12136
            ],
            [
                12139,
                12156
            ],
            [
                12157,
                12164
            ],
            [
                12168,
                12182
            ],
            [
                12182,
                12227
            ],
            [
                12227,
                12243
            ],
            [
                12243,
                12280
            ],
            [
                12281,
                12314
            ],
            [
                12314,
                12389
            ],
            [
                12389,
                12440
            ],
            [
                12440,
                12442
            ],
            [
                12442,
                12484
            ],
            [
                12484,
                12557
            ],
            [
                12558,
                12585
            ],
            [
                12585,
                12589
            ],
            [
                12590,
                12652
            ],
            [
                12653,
                12680
            ],
            [
                12703,
                12758
            ],
            [
                12759,
                12812
            ],
            [
                12812,
                12839
            ],
            [
                12839,
                12913
            ],
            [
                12913,
                12915
            ],
            [
                12915,
                13032
            ],
            [
                13032,
                13059
            ],
            [
                13059,
                13114
            ],
            [
                13120,
                13125
            ],
            [
                13126,
                13148
            ],
            [
                13148,
                13256
            ],
            [
                13264,
                13272
            ],
            [
                13272,
                13274
            ],
            [
                13274,
                13281
            ],
            [
                13282,
                13290
            ],
            [
                13291,
                13354
            ],
            [
                13355,
                13406
            ],
            [
                13407,
                13410
            ],
            [
                13416,
                13499
            ],
            [
                13499,
                13545
            ],
            [
                13545,
                13577
            ],
            [
                13577,
                13617
            ],
            [
                13620,
                13663
            ],
            [
                13663,
                13708
            ],
            [
                13711,
                13810
            ],
            [
                13810,
                13855
            ],
            [
                13856,
                13916
            ],
            [
                13916,
                13920
            ],
            [
                13921,
                13949
            ],
            [
                13949,
                13979
            ],
            [
                13980,
                13983
            ],
            [
                13984,
                13991
            ],
            [
                13994,
                14069
            ],
            [
                14069,
                14132
            ],
            [
                14132,
                14163
            ],
            [
                14163,
                14232
            ],
            [
                14232,
                14312
            ],
            [
                14312,
                14314
            ],
            [
                14314,
                14337
            ],
            [
                14349,
                14351
            ],
            [
                14352,
                14356
            ],
            [
                14359,
                14439
            ],
            [
                14440,
                14476
            ],
            [
                14476,
                14523
            ],
            [
                14524,
                14549
            ],
            [
                14550,
                14573
            ],
            [
                14574,
                14587
            ],
            [
                14587,
                14589
            ],
            [
                14598,
                14652
            ],
            [
                14655,
                14657
            ],
            [
                14658,
                14661
            ],
            [
                14662,
                14667
            ],
            [
                14672,
                14757
            ],
            [
                14765,
                14777
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                53
            ],
            [
                53,
                125
            ],
            [
                125,
                125
            ],
            [
                125,
                286
            ],
            [
                286,
                286
            ],
            [
                286,
                366
            ],
            [
                366,
                366
            ],
            [
                366,
                366
            ],
            [
                366,
                366
            ],
            [
                366,
                403
            ],
            [
                403,
                451
            ],
            [
                451,
                451
            ],
            [
                451,
                549
            ],
            [
                549,
                633
            ],
            [
                633,
                730
            ],
            [
                730,
                730
            ],
            [
                730,
                777
            ],
            [
                777,
                825
            ],
            [
                825,
                825
            ],
            [
                825,
                861
            ],
            [
                861,
                894
            ],
            [
                894,
                927
            ],
            [
                927,
                957
            ],
            [
                957,
                1079
            ],
            [
                1079,
                1121
            ],
            [
                1121,
                1165
            ],
            [
                1165,
                1241
            ],
            [
                1241,
                1381
            ],
            [
                1381,
                1422
            ],
            [
                1422,
                1483
            ],
            [
                1483,
                1528
            ],
            [
                1528,
                1631
            ],
            [
                1631,
                1664
            ],
            [
                1664,
                1664
            ],
            [
                1664,
                1664
            ],
            [
                1664,
                1664
            ],
            [
                1664,
                1746
            ],
            [
                1746,
                1808
            ],
            [
                1808,
                1890
            ],
            [
                1890,
                1922
            ],
            [
                1922,
                2056
            ],
            [
                2056,
                2135
            ],
            [
                2135,
                2160
            ],
            [
                2160,
                2189
            ],
            [
                2189,
                2226
            ],
            [
                2226,
                2256
            ],
            [
                2256,
                2275
            ],
            [
                2275,
                2293
            ],
            [
                2293,
                2326
            ],
            [
                2326,
                2367
            ],
            [
                2367,
                2391
            ],
            [
                2391,
                2424
            ],
            [
                2424,
                2464
            ],
            [
                2464,
                2493
            ],
            [
                2493,
                2538
            ],
            [
                2538,
                2578
            ],
            [
                2578,
                2636
            ],
            [
                2636,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2787
            ],
            [
                2787,
                2818
            ],
            [
                2818,
                2871
            ],
            [
                2871,
                2887
            ],
            [
                2887,
                2920
            ],
            [
                2920,
                2977
            ],
            [
                2977,
                3007
            ],
            [
                3007,
                3027
            ],
            [
                3027,
                3055
            ],
            [
                3055,
                3078
            ],
            [
                3078,
                3154
            ],
            [
                3154,
                3173
            ],
            [
                3173,
                3194
            ],
            [
                3194,
                3214
            ],
            [
                3214,
                3270
            ],
            [
                3270,
                3353
            ],
            [
                3353,
                3398
            ],
            [
                3398,
                3424
            ],
            [
                3424,
                3424
            ],
            [
                3424,
                3468
            ],
            [
                3468,
                3502
            ],
            [
                3502,
                3541
            ],
            [
                3541,
                3548
            ],
            [
                3548,
                3582
            ],
            [
                3582,
                3616
            ],
            [
                3616,
                3650
            ],
            [
                3650,
                3733
            ],
            [
                3733,
                3748
            ],
            [
                3748,
                3832
            ],
            [
                3832,
                3832
            ],
            [
                3832,
                3856
            ],
            [
                3856,
                3866
            ],
            [
                3866,
                3877
            ],
            [
                3877,
                3937
            ],
            [
                3937,
                3979
            ],
            [
                3979,
                4007
            ],
            [
                4007,
                4051
            ],
            [
                4051,
                4178
            ],
            [
                4178,
                4233
            ],
            [
                4233,
                4267
            ],
            [
                4267,
                4363
            ],
            [
                4363,
                4398
            ],
            [
                4398,
                4421
            ],
            [
                4421,
                4461
            ],
            [
                4461,
                4486
            ],
            [
                4486,
                4520
            ],
            [
                4520,
                4546
            ],
            [
                4546,
                4561
            ],
            [
                4561,
                4568
            ],
            [
                4568,
                4648
            ],
            [
                4648,
                4700
            ],
            [
                4700,
                4721
            ],
            [
                4721,
                4800
            ],
            [
                4800,
                4853
            ],
            [
                4853,
                4853
            ],
            [
                4853,
                4961
            ],
            [
                4961,
                5032
            ],
            [
                5032,
                5123
            ],
            [
                5123,
                5162
            ],
            [
                5162,
                5198
            ],
            [
                5198,
                5241
            ],
            [
                5241,
                5275
            ],
            [
                5275,
                5325
            ],
            [
                5325,
                5363
            ],
            [
                5363,
                5395
            ],
            [
                5395,
                5407
            ],
            [
                5407,
                5445
            ],
            [
                5445,
                5532
            ],
            [
                5532,
                5532
            ],
            [
                5532,
                5563
            ],
            [
                5563,
                5634
            ],
            [
                5634,
                5679
            ],
            [
                5679,
                5754
            ],
            [
                5754,
                5754
            ],
            [
                5754,
                5890
            ],
            [
                5890,
                5890
            ],
            [
                5890,
                5949
            ],
            [
                5949,
                6001
            ],
            [
                6001,
                6001
            ],
            [
                6001,
                6029
            ],
            [
                6029,
                6113
            ],
            [
                6113,
                6153
            ],
            [
                6153,
                6175
            ],
            [
                6175,
                6202
            ],
            [
                6202,
                6223
            ],
            [
                6223,
                6253
            ],
            [
                6253,
                6352
            ],
            [
                6352,
                6378
            ],
            [
                6378,
                6402
            ],
            [
                6402,
                6513
            ],
            [
                6513,
                6542
            ],
            [
                6542,
                6602
            ],
            [
                6602,
                6602
            ],
            [
                6602,
                6602
            ],
            [
                6602,
                6602
            ],
            [
                6602,
                6602
            ],
            [
                6602,
                6602
            ],
            [
                6602,
                6647
            ],
            [
                6647,
                6652
            ],
            [
                6652,
                6652
            ],
            [
                6652,
                6736
            ],
            [
                6736,
                6736
            ],
            [
                6736,
                6766
            ],
            [
                6766,
                6766
            ],
            [
                6766,
                6766
            ],
            [
                6766,
                6766
            ],
            [
                6766,
                6766
            ],
            [
                6766,
                6889
            ],
            [
                6889,
                6889
            ],
            [
                6889,
                6985
            ],
            [
                6985,
                7082
            ],
            [
                7082,
                7117
            ],
            [
                7117,
                7117
            ],
            [
                7117,
                7117
            ],
            [
                7117,
                7117
            ],
            [
                7117,
                7117
            ],
            [
                7117,
                7117
            ],
            [
                7117,
                7117
            ],
            [
                7117,
                7201
            ],
            [
                7201,
                7267
            ],
            [
                7267,
                7267
            ],
            [
                7267,
                7406
            ],
            [
                7406,
                7519
            ],
            [
                7519,
                7643
            ],
            [
                7643,
                7720
            ],
            [
                7720,
                7808
            ],
            [
                7808,
                7808
            ],
            [
                7808,
                7907
            ],
            [
                7907,
                7975
            ],
            [
                7975,
                8045
            ],
            [
                8045,
                8079
            ],
            [
                8079,
                8124
            ],
            [
                8124,
                8151
            ],
            [
                8151,
                8216
            ],
            [
                8216,
                8271
            ],
            [
                8271,
                8304
            ],
            [
                8304,
                8304
            ],
            [
                8304,
                8343
            ],
            [
                8343,
                8397
            ],
            [
                8397,
                8397
            ],
            [
                8397,
                8431
            ],
            [
                8431,
                8462
            ],
            [
                8462,
                8462
            ],
            [
                8462,
                8655
            ],
            [
                8655,
                8780
            ],
            [
                8780,
                8865
            ],
            [
                8865,
                8912
            ],
            [
                8912,
                8934
            ],
            [
                8934,
                9062
            ],
            [
                9062,
                9062
            ],
            [
                9062,
                9062
            ],
            [
                9062,
                9062
            ],
            [
                9062,
                9152
            ],
            [
                9152,
                9171
            ],
            [
                9171,
                9230
            ],
            [
                9230,
                9230
            ],
            [
                9230,
                9272
            ],
            [
                9272,
                9358
            ],
            [
                9358,
                9401
            ],
            [
                9401,
                9474
            ],
            [
                9474,
                9588
            ],
            [
                9588,
                9732
            ],
            [
                9732,
                9757
            ],
            [
                9757,
                9757
            ],
            [
                9757,
                9757
            ],
            [
                9757,
                9757
            ],
            [
                9757,
                9757
            ],
            [
                9757,
                9906
            ],
            [
                9906,
                10070
            ],
            [
                10070,
                10139
            ],
            [
                10139,
                10207
            ],
            [
                10207,
                10243
            ],
            [
                10243,
                10338
            ],
            [
                10338,
                10376
            ],
            [
                10376,
                10478
            ],
            [
                10478,
                10535
            ],
            [
                10535,
                10636
            ],
            [
                10636,
                10670
            ],
            [
                10670,
                10749
            ],
            [
                10749,
                10820
            ],
            [
                10820,
                10850
            ],
            [
                10850,
                10963
            ],
            [
                10963,
                11030
            ],
            [
                11030,
                11119
            ],
            [
                11119,
                11203
            ],
            [
                11203,
                11288
            ],
            [
                11288,
                11329
            ],
            [
                11329,
                11410
            ],
            [
                11410,
                11493
            ],
            [
                11493,
                11493
            ],
            [
                11493,
                11493
            ],
            [
                11493,
                11524
            ],
            [
                11524,
                11555
            ],
            [
                11555,
                11575
            ],
            [
                11575,
                11575
            ],
            [
                11575,
                11612
            ],
            [
                11612,
                11698
            ],
            [
                11698,
                11743
            ],
            [
                11743,
                11808
            ],
            [
                11808,
                11866
            ],
            [
                11866,
                11908
            ],
            [
                11908,
                12007
            ],
            [
                12007,
                12007
            ],
            [
                12007,
                12007
            ],
            [
                12007,
                12048
            ],
            [
                12048,
                12108
            ],
            [
                12108,
                12108
            ],
            [
                12108,
                12139
            ],
            [
                12139,
                12139
            ],
            [
                12139,
                12182
            ],
            [
                12182,
                12243
            ],
            [
                12243,
                12243
            ],
            [
                12243,
                12314
            ],
            [
                12314,
                12389
            ],
            [
                12389,
                12442
            ],
            [
                12442,
                12484
            ],
            [
                12484,
                12558
            ],
            [
                12558,
                12585
            ],
            [
                12585,
                12653
            ],
            [
                12653,
                12653
            ],
            [
                12653,
                12703
            ],
            [
                12703,
                12758
            ],
            [
                12758,
                12758
            ],
            [
                12758,
                12758
            ],
            [
                12758,
                12812
            ],
            [
                12812,
                12839
            ],
            [
                12839,
                12915
            ],
            [
                12915,
                13032
            ],
            [
                13032,
                13059
            ],
            [
                13059,
                13115
            ],
            [
                13115,
                13115
            ],
            [
                13115,
                13148
            ],
            [
                13148,
                13274
            ],
            [
                13274,
                13355
            ],
            [
                13355,
                13499
            ],
            [
                13499,
                13499
            ],
            [
                13499,
                13499
            ],
            [
                13499,
                13545
            ],
            [
                13545,
                13577
            ],
            [
                13577,
                13617
            ],
            [
                13617,
                13617
            ],
            [
                13617,
                13663
            ],
            [
                13663,
                13711
            ],
            [
                13711,
                13711
            ],
            [
                13711,
                13810
            ],
            [
                13810,
                13855
            ],
            [
                13855,
                13855
            ],
            [
                13855,
                13916
            ],
            [
                13916,
                13949
            ],
            [
                13949,
                13994
            ],
            [
                13994,
                13994
            ],
            [
                13994,
                14069
            ],
            [
                14069,
                14132
            ],
            [
                14132,
                14163
            ],
            [
                14163,
                14232
            ],
            [
                14232,
                14314
            ],
            [
                14314,
                14476
            ],
            [
                14476,
                14587
            ],
            [
                14587,
                14587
            ],
            [
                14587,
                14652
            ],
            [
                14652,
                14777
            ]
        ]
    }
}