{
    "original": {
        "text": "\"It's weary work,\" said Sir Felix as he got into the brougham with his mother and sister.\n\"What must it have been to me then, who had nothing to do?\" said his mother.\n\"It's the having something to do that makes me call it weary work. By-the-bye, now I think of it, I'll run down to the club before I go home.\" So saying he put his head out of the brougham, and stopped the driver.\n\"It is two o'clock, Felix,\" said his mother.\n\"I'm afraid it is, but you see I'm hungry. You had supper, perhaps; I had none.\"\n\"Are you going down to the club for supper at this time in the morning?\"\n\"I must go to bed hungry if I don't. Good night.\" Then he jumped out of the brougham, called a cab, and had himself driven to the Beargarden. He declared to himself that the men there would think it mean of him if he did not give them their revenge. He had renewed his play on the preceding night, and had again won. Dolly Longestaffe owed him now a considerable sum of money, and Lord Grasslough was also in his debt. He was sure that Grasslough would go to the club after the ball, and he was determined that they should not think that he had submitted to be carried home by his mother and sister. So he argued with himself; but in truth the devil of gambling was hot within his bosom; and though he feared that in losing he might lose real money, and that if he won it would be long before he was paid, yet he could not keep himself from the card-table.\nNeither mother or daughter said a word till they reached home and had got up-stairs. Then the elder spoke of the trouble that was nearest to her heart at the moment. \"Do you think he gambles?\"\n\"He has got no money, mamma.\"\n\"I fear that might not hinder him. And he has money with him, though, for him and such friends as he has, it is not much. If he gambles everything is lost.\"\n\"I suppose they all do play,--more or less.\"\n\"I have not known that he played. I am wearied too, out of all heart, by his want of consideration to me. It is not that he will not obey me. A mother perhaps should not expect obedience from a grown-up son. But my word is nothing to him. He has no respect for me. He would as soon do what is wrong before me as before the merest stranger.\"\n\"He has been so long his own master, mamma.\"\n\"Yes,--his own master! And yet I must provide for him as though he were but a child. Hetta, you spent the whole evening talking to Paul Montague.\"\n\"No, mamma;--that is unjust.\"\n\"He was always with you.\"\n\"I knew nobody else. I could not tell him not to speak to me. I danced with him twice.\" Her mother was seated, with both her hands up to her forehead, and shook her head. \"If you did not want me to speak to Paul you should not have taken me there.\"\n\"I don't wish to prevent your speaking to him. You know what I want.\" Henrietta came up and kissed her, and bade her good night. \"I think I am the unhappiest woman in all London,\" she said, sobbing hysterically.\n\"Is it my fault, mamma?\"\n\"You could save me from much if you would. I work like a horse, and I never spend a shilling that I can help. I want nothing for myself,--nothing for myself. Nobody has suffered as I have. But Felix never thinks of me for a moment.\"\n\"I think of you, mamma.\"\n\"If you did you would accept your cousin's offer. What right have you to refuse him? I believe it is all because of that young man.\"\n\"No, mamma; it is not because of that young man. I like my cousin very much;--but that is all. Good night, mamma.\" Lady Carbury just allowed herself to be kissed, and then was left alone.\nAt eight o'clock the next morning daybreak found four young men who had just risen from a card-table at the Beargarden. The Beargarden was so pleasant a club that there was no rule whatsoever as to its being closed,--the only law being that it should not be opened before three in the afternoon. A sort of sanction had, however, been given to the servants to demur to producing supper or drinks after six in the morning, so that, about eight, unrelieved tobacco began to be too heavy even for juvenile constitutions. The party consisted of Dolly Longestaffe, Lord Grasslough, Miles Grendall, and Felix Carbury, and the four had amused themselves during the last six hours with various innocent games. They had commenced with whist, and had culminated during the last half-hour with blind hookey. But during the whole night Felix had won. Miles Grendall hated him, and there had been an expressed opinion between Miles and the young lord that it would be both profitable and proper to relieve Sir Felix of the winnings of the last two nights. The two men had played with the same object, and being young had shown their intention,--so that a certain feeling of hostility had been engendered. The reader is not to understand that either of them had cheated, or that the baronet had entertained any suspicion of foul play. But Felix had felt that Grendall and Grasslough were his enemies, and had thrown himself on Dolly for sympathy and friendship. Dolly, however, was very tipsy.\nAt eight o'clock in the morning there came a sort of settling, though no money then passed. The ready-money transactions had not lasted long through the night. Grasslough was the chief loser, and the figures and scraps of paper which had been passed over to Carbury, when counted up, amounted to nearly 2,000. His lordship contested the fact bitterly, but contested it in vain. There were his own initials and his own figures, and even Miles Grendall, who was supposed to be quite wide awake, could not reduce the amount. Then Grendall had lost over 400 to Carbury,--an amount, indeed, that mattered little, as Miles could, at present, as easily have raised 40,000. However, he gave his I.O.U. to his opponent with an easy air. Grasslough, also, was impecunious; but he had a father,--also impecunious, indeed; but with them the matter would not be hopeless. Dolly Longestaffe was so tipsy that he could not even assist in making up his own account. That was to be left between him and Carbury for some future occasion.\n\"I suppose you'll be here to-morrow,--that is to-night,\" said Miles.\n\"Certainly,--only one thing,\" answered Felix.\n\"What one thing?\"\n\"I think these things should be squared before we play any more!\"\n\"What do you mean by that?\" said Grasslough angrily. \"Do you mean to hint anything?\"\n\"I never hint anything, my Grassy,\" said Felix. \"I believe when people play cards, it's intended to be ready-money, that's all. But I'm not going to stand on P's and Q's with you. I'll give you your revenge to-night.\"\n\"That's all right,\" said Miles.\n\"I was speaking to Lord Grasslough,\" said Felix. \"He is an old friend, and we know each other. You have been rather rough to-night, Mr. Grendall.\"\n\"Rough;--what the devil do you mean by that?\"\n\"And I think it will be as well that our account should be settled before we begin again.\"\n\"A settlement once a week is the kind of thing I'm used to,\" said Grendall.\nThere was nothing more said; but the young men did not part on good terms. Felix, as he got himself taken home, calculated that if he could realize his spoil, he might begin the campaign again with horses, servants, and all luxuries as before. If all were paid, he would have over 3,000!",
        "paragraph_chars": [
            [
                0,
                90
            ],
            [
                90,
                167
            ],
            [
                167,
                381
            ],
            [
                381,
                426
            ],
            [
                426,
                507
            ],
            [
                507,
                580
            ],
            [
                580,
                1437
            ],
            [
                1437,
                1630
            ],
            [
                1630,
                1660
            ],
            [
                1660,
                1817
            ],
            [
                1817,
                1862
            ],
            [
                1862,
                2203
            ],
            [
                2203,
                2248
            ],
            [
                2248,
                2395
            ],
            [
                2395,
                2425
            ],
            [
                2425,
                2451
            ],
            [
                2451,
                2700
            ],
            [
                2700,
                2912
            ],
            [
                2912,
                2937
            ],
            [
                2937,
                3170
            ],
            [
                3170,
                3195
            ],
            [
                3195,
                3328
            ],
            [
                3328,
                3516
            ],
            [
                3516,
                4995
            ],
            [
                4995,
                6015
            ],
            [
                6015,
                6084
            ],
            [
                6084,
                6130
            ],
            [
                6130,
                6148
            ],
            [
                6148,
                6214
            ],
            [
                6214,
                6299
            ],
            [
                6299,
                6517
            ],
            [
                6517,
                6549
            ],
            [
                6549,
                6696
            ],
            [
                6696,
                6742
            ],
            [
                6742,
                6833
            ],
            [
                6833,
                6909
            ],
            [
                6909,
                7196
            ]
        ],
        "segment_chars": [
            [
                0,
                90
            ],
            [
                90,
                150
            ],
            [
                150,
                167
            ],
            [
                167,
                234
            ],
            [
                234,
                310
            ],
            [
                310,
                381
            ],
            [
                381,
                426
            ],
            [
                426,
                469
            ],
            [
                469,
                507
            ],
            [
                507,
                580
            ],
            [
                580,
                617
            ],
            [
                617,
                630
            ],
            [
                630,
                722
            ],
            [
                722,
                830
            ],
            [
                830,
                897
            ],
            [
                897,
                999
            ],
            [
                999,
                1180
            ],
            [
                1180,
                1437
            ],
            [
                1437,
                1522
            ],
            [
                1522,
                1603
            ],
            [
                1603,
                1630
            ],
            [
                1630,
                1660
            ],
            [
                1660,
                1695
            ],
            [
                1695,
                1782
            ],
            [
                1782,
                1817
            ],
            [
                1817,
                1862
            ],
            [
                1862,
                1896
            ],
            [
                1896,
                1968
            ],
            [
                1968,
                2004
            ],
            [
                2004,
                2070
            ],
            [
                2070,
                2101
            ],
            [
                2101,
                2127
            ],
            [
                2127,
                2203
            ],
            [
                2203,
                2248
            ],
            [
                2248,
                2271
            ],
            [
                2271,
                2333
            ],
            [
                2333,
                2395
            ],
            [
                2395,
                2425
            ],
            [
                2425,
                2451
            ],
            [
                2451,
                2472
            ],
            [
                2472,
                2513
            ],
            [
                2513,
                2539
            ],
            [
                2539,
                2622
            ],
            [
                2622,
                2700
            ],
            [
                2700,
                2747
            ],
            [
                2747,
                2770
            ],
            [
                2770,
                2829
            ],
            [
                2829,
                2912
            ],
            [
                2912,
                2937
            ],
            [
                2937,
                2980
            ],
            [
                2980,
                3047
            ],
            [
                3047,
                3095
            ],
            [
                3095,
                3126
            ],
            [
                3126,
                3170
            ],
            [
                3170,
                3195
            ],
            [
                3195,
                3245
            ],
            [
                3245,
                3280
            ],
            [
                3280,
                3328
            ],
            [
                3328,
                3377
            ],
            [
                3377,
                3423
            ],
            [
                3423,
                3443
            ],
            [
                3443,
                3516
            ],
            [
                3516,
                3636
            ],
            [
                3636,
                3812
            ],
            [
                3812,
                4033
            ],
            [
                4033,
                4217
            ],
            [
                4217,
                4312
            ],
            [
                4312,
                4354
            ],
            [
                4354,
                4558
            ],
            [
                4558,
                4707
            ],
            [
                4707,
                4836
            ],
            [
                4836,
                4963
            ],
            [
                4963,
                4995
            ],
            [
                4995,
                5087
            ],
            [
                5087,
                5155
            ],
            [
                5155,
                5305
            ],
            [
                5305,
                5373
            ],
            [
                5373,
                5517
            ],
            [
                5517,
                5661
            ],
            [
                5661,
                5689
            ],
            [
                5689,
                5723
            ],
            [
                5723,
                5854
            ],
            [
                5854,
                5945
            ],
            [
                5945,
                6015
            ],
            [
                6015,
                6084
            ],
            [
                6084,
                6130
            ],
            [
                6130,
                6148
            ],
            [
                6148,
                6214
            ],
            [
                6214,
                6242
            ],
            [
                6242,
                6267
            ],
            [
                6267,
                6299
            ],
            [
                6299,
                6347
            ],
            [
                6347,
                6427
            ],
            [
                6427,
                6479
            ],
            [
                6479,
                6517
            ],
            [
                6517,
                6549
            ],
            [
                6549,
                6598
            ],
            [
                6598,
                6644
            ],
            [
                6644,
                6696
            ],
            [
                6696,
                6742
            ],
            [
                6742,
                6833
            ],
            [
                6833,
                6909
            ],
            [
                6909,
                6984
            ],
            [
                6984,
                7153
            ],
            [
                7153,
                7196
            ]
        ],
        "overlap_chars": [
            [
                0,
                33
            ],
            [
                49,
                52
            ],
            [
                62,
                89
            ],
            [
                250,
                257
            ],
            [
                265,
                310
            ],
            [
                320,
                339
            ],
            [
                355,
                381
            ],
            [
                381,
                399
            ],
            [
                399,
                426
            ],
            [
                426,
                469
            ],
            [
                494,
                499
            ],
            [
                477,
                483
            ],
            [
                617,
                629
            ],
            [
                635,
                655
            ],
            [
                664,
                722
            ],
            [
                722,
                724
            ],
            [
                737,
                830
            ],
            [
                830,
                836
            ],
            [
                892,
                895
            ],
            [
                886,
                891
            ],
            [
                854,
                860
            ],
            [
                871,
                876
            ],
            [
                895,
                897
            ],
            [
                897,
                914
            ],
            [
                957,
                976
            ],
            [
                915,
                923
            ],
            [
                950,
                955
            ],
            [
                1062,
                1124
            ],
            [
                1141,
                1180
            ],
            [
                1180,
                1219
            ],
            [
                1390,
                1407
            ],
            [
                1416,
                1437
            ],
            [
                1437,
                1451
            ],
            [
                1455,
                1498
            ],
            [
                1520,
                1522
            ],
            [
                1522,
                1530
            ],
            [
                1537,
                1587
            ],
            [
                1601,
                1602
            ],
            [
                1603,
                1630
            ],
            [
                1630,
                1660
            ],
            [
                1660,
                1682
            ],
            [
                1690,
                1695
            ],
            [
                1782,
                1817
            ],
            [
                1817,
                1836
            ],
            [
                1840,
                1845
            ],
            [
                1847,
                1862
            ],
            [
                1896,
                1908
            ],
            [
                1914,
                1930
            ],
            [
                1932,
                1938
            ],
            [
                1944,
                1968
            ],
            [
                1968,
                1982
            ],
            [
                2032,
                2070
            ],
            [
                2070,
                2101
            ],
            [
                2101,
                2127
            ],
            [
                2127,
                2203
            ],
            [
                2203,
                2248
            ],
            [
                2248,
                2249
            ],
            [
                2255,
                2271
            ],
            [
                2271,
                2319
            ],
            [
                2324,
                2333
            ],
            [
                2333,
                2395
            ],
            [
                2395,
                2406
            ],
            [
                2408,
                2422
            ],
            [
                2452,
                2472
            ],
            [
                2472,
                2513
            ],
            [
                2513,
                2538
            ],
            [
                2539,
                2549
            ],
            [
                2606,
                2621
            ],
            [
                2622,
                2662
            ],
            [
                2663,
                2700
            ],
            [
                2700,
                2747
            ],
            [
                2747,
                2770
            ],
            [
                2770,
                2779
            ],
            [
                2792,
                2798
            ],
            [
                2813,
                2827
            ],
            [
                2802,
                2803
            ],
            [
                2827,
                2829
            ],
            [
                2829,
                2877
            ],
            [
                2912,
                2937
            ],
            [
                2937,
                2972
            ],
            [
                2978,
                2980
            ],
            [
                2980,
                3029
            ],
            [
                3087,
                3095
            ],
            [
                3095,
                3126
            ],
            [
                3126,
                3170
            ],
            [
                3170,
                3195
            ],
            [
                3195,
                3245
            ],
            [
                3245,
                3280
            ],
            [
                3280,
                3295
            ],
            [
                3300,
                3328
            ],
            [
                3328,
                3377
            ],
            [
                3377,
                3393
            ],
            [
                3394,
                3404
            ],
            [
                3406,
                3423
            ],
            [
                3423,
                3442
            ],
            [
                3516,
                3549
            ],
            [
                3565,
                3579
            ],
            [
                3584,
                3636
            ],
            [
                4033,
                4125
            ],
            [
                4140,
                4217
            ],
            [
                4217,
                4255
            ],
            [
                4293,
                4312
            ],
            [
                4312,
                4315
            ],
            [
                4333,
                4354
            ],
            [
                4354,
                4383
            ],
            [
                4448,
                4452
            ],
            [
                4453,
                4469
            ],
            [
                4490,
                4520
            ],
            [
                4525,
                4533
            ],
            [
                4556,
                4558
            ],
            [
                4558,
                4569
            ],
            [
                4619,
                4645
            ],
            [
                4655,
                4664
            ],
            [
                4676,
                4685
            ],
            [
                4705,
                4707
            ],
            [
                4843,
                4946
            ],
            [
                4961,
                4963
            ],
            [
                4963,
                4995
            ],
            [
                4995,
                5056
            ],
            [
                5056,
                5073
            ],
            [
                5079,
                5085
            ],
            [
                5085,
                5087
            ],
            [
                5155,
                5194
            ],
            [
                5217,
                5222
            ],
            [
                5223,
                5305
            ],
            [
                5305,
                5331
            ],
            [
                5337,
                5350
            ],
            [
                5364,
                5373
            ],
            [
                5527,
                5560
            ],
            [
                5562,
                5571
            ],
            [
                5581,
                5585
            ],
            [
                5612,
                5617
            ],
            [
                5659,
                5661
            ],
            [
                5661,
                5689
            ],
            [
                5689,
                5723
            ],
            [
                5854,
                5875
            ],
            [
                5879,
                5884
            ],
            [
                5925,
                5945
            ],
            [
                5945,
                5964
            ],
            [
                5989,
                6015
            ],
            [
                6015,
                6040
            ],
            [
                6050,
                6051
            ],
            [
                6043,
                6044
            ],
            [
                6053,
                6060
            ],
            [
                6069,
                6084
            ],
            [
                6084,
                6094
            ],
            [
                6111,
                6129
            ],
            [
                6148,
                6149
            ],
            [
                6149,
                6211
            ],
            [
                6214,
                6242
            ],
            [
                6242,
                6267
            ],
            [
                6267,
                6299
            ],
            [
                6299,
                6347
            ],
            [
                6347,
                6407
            ],
            [
                6408,
                6427
            ],
            [
                6479,
                6505
            ],
            [
                6514,
                6517
            ],
            [
                6517,
                6518
            ],
            [
                6525,
                6549
            ],
            [
                6549,
                6598
            ],
            [
                6598,
                6618
            ],
            [
                6642,
                6644
            ],
            [
                6644,
                6670
            ],
            [
                6679,
                6696
            ],
            [
                6696,
                6702
            ],
            [
                6705,
                6742
            ],
            [
                6742,
                6833
            ],
            [
                6833,
                6834
            ],
            [
                6880,
                6891
            ],
            [
                6847,
                6858
            ],
            [
                6891,
                6909
            ],
            [
                6909,
                6984
            ],
            [
                6984,
                6996
            ],
            [
                7015,
                7042
            ],
            [
                7066,
                7106
            ],
            [
                7129,
                7153
            ],
            [
                7171,
                7196
            ]
        ],
        "row_chars": [
            [
                0,
                90
            ],
            [
                90,
                150
            ],
            [
                150,
                167
            ],
            [
                167,
                234
            ],
            [
                234,
                310
            ],
            [
                310,
                381
            ],
            [
                381,
                426
            ],
            [
                426,
                469
            ],
            [
                469,
                507
            ],
            [
                507,
                580
            ],
            [
                580,
                617
            ],
            [
                617,
                630
            ],
            [
                630,
                722
            ],
            [
                722,
                830
            ],
            [
                830,
                897
            ],
            [
                897,
                1180
            ],
            [
                1180,
                1437
            ],
            [
                1437,
                1522
            ],
            [
                1522,
                1603
            ],
            [
                1603,
                1630
            ],
            [
                1630,
                1660
            ],
            [
                1660,
                1695
            ],
            [
                1695,
                1782
            ],
            [
                1782,
                1817
            ],
            [
                1817,
                1862
            ],
            [
                1862,
                1896
            ],
            [
                1896,
                1968
            ],
            [
                1968,
                2070
            ],
            [
                2070,
                2101
            ],
            [
                2101,
                2127
            ],
            [
                2127,
                2203
            ],
            [
                2203,
                2248
            ],
            [
                2248,
                2271
            ],
            [
                2271,
                2333
            ],
            [
                2333,
                2395
            ],
            [
                2395,
                2425
            ],
            [
                2425,
                2451
            ],
            [
                2451,
                2472
            ],
            [
                2472,
                2513
            ],
            [
                2513,
                2539
            ],
            [
                2539,
                2622
            ],
            [
                2622,
                2700
            ],
            [
                2700,
                2747
            ],
            [
                2747,
                2770
            ],
            [
                2770,
                2829
            ],
            [
                2829,
                2912
            ],
            [
                2912,
                2937
            ],
            [
                2937,
                2980
            ],
            [
                2980,
                3095
            ],
            [
                3095,
                3126
            ],
            [
                3126,
                3170
            ],
            [
                3170,
                3195
            ],
            [
                3195,
                3245
            ],
            [
                3245,
                3280
            ],
            [
                3280,
                3328
            ],
            [
                3328,
                3377
            ],
            [
                3377,
                3423
            ],
            [
                3423,
                3443
            ],
            [
                3443,
                3516
            ],
            [
                3516,
                3636
            ],
            [
                3636,
                3812
            ],
            [
                3812,
                4033
            ],
            [
                4033,
                4217
            ],
            [
                4217,
                4312
            ],
            [
                4312,
                4354
            ],
            [
                4354,
                4558
            ],
            [
                4558,
                4707
            ],
            [
                4707,
                4836
            ],
            [
                4836,
                4963
            ],
            [
                4963,
                4995
            ],
            [
                4995,
                5087
            ],
            [
                5087,
                5155
            ],
            [
                5155,
                5305
            ],
            [
                5305,
                5373
            ],
            [
                5373,
                5517
            ],
            [
                5517,
                5661
            ],
            [
                5661,
                5689
            ],
            [
                5689,
                5723
            ],
            [
                5723,
                5854
            ],
            [
                5854,
                5945
            ],
            [
                5945,
                6015
            ],
            [
                6015,
                6084
            ],
            [
                6084,
                6130
            ],
            [
                6130,
                6148
            ],
            [
                6148,
                6214
            ],
            [
                6214,
                6242
            ],
            [
                6242,
                6267
            ],
            [
                6267,
                6299
            ],
            [
                6299,
                6347
            ],
            [
                6347,
                6427
            ],
            [
                6427,
                6479
            ],
            [
                6479,
                6517
            ],
            [
                6517,
                6549
            ],
            [
                6549,
                6598
            ],
            [
                6598,
                6644
            ],
            [
                6644,
                6696
            ],
            [
                6696,
                6742
            ],
            [
                6742,
                6833
            ],
            [
                6833,
                6909
            ],
            [
                6909,
                6984
            ],
            [
                6984,
                7153
            ],
            [
                7153,
                7196
            ]
        ]
    },
    "abridged": {
        "text": "\"It's weary work,\" said Sir Felix in the carriage with his mother and sister. \"I think I'll run down to the club before I go home.\" He put his head out, and stopped the driver.\n\"It is two o'clock in the morning, Felix,\" said his mother.\n\"I'm afraid it is, but you see I'm hungry. I had no supper. Good night.\"\nHe jumped out of the carriage, called a cab, and had himself driven to the Beargarden. He told himself that the men there would think it mean of him if he did not give them their revenge. He had won again on the previous night. Dolly Longestaffe and Lord Grasslough owed him money, and he was determined that they should not think that he had been carried home by his mother and sister. So he argued with himself; but in truth he could not keep away from the card-table.\nNeither mother nor daughter said a word till they reached home. Then the mother spoke of the trouble that was nearest to her heart.\n\"Do you think he gambles?\"\n\"He has got no money, mamma.\"\n\"I fear that might not stop him. If he gambles everything is lost.\"\n\"I suppose they all play, more or less.\"\n\"I am wearied out of all heart by his lack of consideration to me. It is not that I expect obedience from a grown-up son. But my word is nothing to him. He has no respect for me. He would as soon do what is wrong before me as before the merest stranger.\"\n\"He has been so long his own master, mamma.\"\n\"His own master! And yet I must provide for him as though he were a child. Hetta, you spent the whole evening talking to Paul Montague.\"\n\"No, mamma; that is unjust. I knew nobody else. I could not tell him not to speak to me. I danced with him twice.\"\nHer mother shook her head.\n\"If you did not want me to speak to Paul,\" said Hetta, \"you should not have taken me there.\"\n\"I don't wish to prevent your speaking to him. You know what I want.\" As Henrietta kissed her good night, Lady Carbury began to sob. \"I think I am the unhappiest woman in all London.\"\n\"Is it my fault, mamma?\"\n\"You could save me from much if you wished. I work like a horse, and I never spend a shilling on myself. Nobody has suffered as I have. But Felix never thinks of me for a moment.\"\n\"I think of you, mamma.\"\n\"If you did you would accept your cousin's offer. What right have you to refuse him? I believe it is because of that young man.\"\n\"No, mamma; it is not because of that young man. I like my cousin Roger very much; - but that is all. Good night, mamma.\"\nAt eight o'clock the next morning four young men had just risen from a card-table at the Beargarden. The party consisted of Dolly Longestaffe, Lord Grasslough, Miles Grendall, and Felix Carbury; they had amused themselves during the last six hours with various innocent games. They had commenced with whist, and had finished with blind hookey. But all night Felix had won. Miles Grendall hated him, and agreed with Lord Grasslough that it would be proper to relieve Sir Felix of his previous winnings. The two men had shown their intention, causing a certain hostility. Felix had felt that Grendall and Grasslough were his enemies, and had thrown himself on Dolly for sympathy. Dolly, however, was very tipsy.\nAt eight o'clock in the morning there came a sort of settling-up, though no money passed hands. Grasslough was the chief loser, and the paper I.O.U.s which had been passed over to Carbury, when counted up, amounted to nearly 2,000. His lordship contested the amount bitterly, but in vain. Grendall had lost over 400 to Carbury, an amount that he could never hope to raise. However, he gave his I.O.U. to his opponent with an easy air. Dolly Longestaffe was too tipsy to make up his own account. That was to be left for some future occasion.\n\"I suppose you'll be here tomorrow, - that is, tonight,\" said Miles.\n\"Certainly,\" answered Felix. \"Only I think these things should be squared before we play any more.\"\n\"What do you mean by that?\" said Grasslough angrily. \"Do you mean to hint anything?\"\n\"I never hint anything, my Grassy,\" said Felix. \"I believe when people play cards, it's intended to be ready money, that's all. But I'll give you your revenge tonight.\"\n\"All right,\" said Miles.\n\"I was speaking to Lord Grasslough,\" said Felix. \"He is an old friend. You have been rather rough tonight, Mr. Grendall.\"\n\"Rough - what the devil do you mean by that?\"\n\"And I think it will be as well that our account should be settled before we begin again.\"\n\"I'm used to settling once a week,\" said Grendall.\nThere was nothing more said; but the young men did not part on good terms. Felix, as he went home, calculated that if he were fully paid, he might begin the campaign again with all luxuries as before. He would have over 3,000!",
        "paragraph_chars": [
            [
                0,
                177
            ],
            [
                177,
                237
            ],
            [
                237,
                310
            ],
            [
                310,
                781
            ],
            [
                781,
                913
            ],
            [
                913,
                940
            ],
            [
                940,
                970
            ],
            [
                970,
                1038
            ],
            [
                1038,
                1079
            ],
            [
                1079,
                1334
            ],
            [
                1334,
                1379
            ],
            [
                1379,
                1516
            ],
            [
                1516,
                1631
            ],
            [
                1631,
                1658
            ],
            [
                1658,
                1751
            ],
            [
                1751,
                1935
            ],
            [
                1935,
                1960
            ],
            [
                1960,
                2140
            ],
            [
                2140,
                2165
            ],
            [
                2165,
                2294
            ],
            [
                2294,
                2416
            ],
            [
                2416,
                3126
            ],
            [
                3126,
                3667
            ],
            [
                3667,
                3736
            ],
            [
                3736,
                3836
            ],
            [
                3836,
                3921
            ],
            [
                3921,
                4090
            ],
            [
                4090,
                4115
            ],
            [
                4115,
                4237
            ],
            [
                4237,
                4283
            ],
            [
                4283,
                4374
            ],
            [
                4374,
                4425
            ],
            [
                4425,
                4651
            ]
        ],
        "segment_chars": [
            [
                0,
                78
            ],
            [
                78,
                132
            ],
            [
                132,
                177
            ],
            [
                177,
                237
            ],
            [
                237,
                280
            ],
            [
                280,
                297
            ],
            [
                297,
                310
            ],
            [
                310,
                397
            ],
            [
                397,
                498
            ],
            [
                498,
                538
            ],
            [
                538,
                697
            ],
            [
                697,
                781
            ],
            [
                781,
                845
            ],
            [
                845,
                913
            ],
            [
                913,
                940
            ],
            [
                940,
                970
            ],
            [
                970,
                1003
            ],
            [
                1003,
                1038
            ],
            [
                1038,
                1079
            ],
            [
                1079,
                1146
            ],
            [
                1146,
                1201
            ],
            [
                1201,
                1232
            ],
            [
                1232,
                1258
            ],
            [
                1258,
                1334
            ],
            [
                1334,
                1379
            ],
            [
                1379,
                1396
            ],
            [
                1396,
                1454
            ],
            [
                1454,
                1516
            ],
            [
                1516,
                1544
            ],
            [
                1544,
                1564
            ],
            [
                1564,
                1605
            ],
            [
                1605,
                1631
            ],
            [
                1631,
                1658
            ],
            [
                1658,
                1751
            ],
            [
                1751,
                1798
            ],
            [
                1798,
                1821
            ],
            [
                1821,
                1884
            ],
            [
                1884,
                1935
            ],
            [
                1935,
                1960
            ],
            [
                1960,
                2004
            ],
            [
                2004,
                2065
            ],
            [
                2065,
                2096
            ],
            [
                2096,
                2140
            ],
            [
                2140,
                2165
            ],
            [
                2165,
                2215
            ],
            [
                2215,
                2250
            ],
            [
                2250,
                2294
            ],
            [
                2294,
                2343
            ],
            [
                2343,
                2396
            ],
            [
                2396,
                2416
            ],
            [
                2416,
                2517
            ],
            [
                2517,
                2693
            ],
            [
                2693,
                2760
            ],
            [
                2760,
                2789
            ],
            [
                2789,
                2918
            ],
            [
                2918,
                2986
            ],
            [
                2986,
                3094
            ],
            [
                3094,
                3126
            ],
            [
                3126,
                3222
            ],
            [
                3222,
                3358
            ],
            [
                3358,
                3415
            ],
            [
                3415,
                3499
            ],
            [
                3499,
                3527
            ],
            [
                3527,
                3561
            ],
            [
                3561,
                3621
            ],
            [
                3621,
                3667
            ],
            [
                3667,
                3736
            ],
            [
                3736,
                3765
            ],
            [
                3765,
                3836
            ],
            [
                3836,
                3864
            ],
            [
                3864,
                3889
            ],
            [
                3889,
                3921
            ],
            [
                3921,
                3969
            ],
            [
                3969,
                4049
            ],
            [
                4049,
                4090
            ],
            [
                4090,
                4115
            ],
            [
                4115,
                4164
            ],
            [
                4164,
                4186
            ],
            [
                4186,
                4237
            ],
            [
                4237,
                4283
            ],
            [
                4283,
                4374
            ],
            [
                4374,
                4425
            ],
            [
                4425,
                4500
            ],
            [
                4500,
                4626
            ],
            [
                4626,
                4651
            ]
        ],
        "overlap_chars": [
            [
                0,
                33
            ],
            [
                37,
                40
            ],
            [
                50,
                77
            ],
            [
                79,
                86
            ],
            [
                87,
                132
            ],
            [
                132,
                151
            ],
            [
                151,
                177
            ],
            [
                177,
                195
            ],
            [
                210,
                237
            ],
            [
                237,
                280
            ],
            [
                280,
                285
            ],
            [
                289,
                295
            ],
            [
                297,
                309
            ],
            [
                310,
                330
            ],
            [
                339,
                397
            ],
            [
                397,
                399
            ],
            [
                405,
                498
            ],
            [
                498,
                504
            ],
            [
                505,
                508
            ],
            [
                509,
                514
            ],
            [
                515,
                521
            ],
            [
                531,
                536
            ],
            [
                536,
                538
            ],
            [
                538,
                555
            ],
            [
                556,
                575
            ],
            [
                576,
                584
            ],
            [
                585,
                590
            ],
            [
                590,
                652
            ],
            [
                658,
                697
            ],
            [
                697,
                736
            ],
            [
                737,
                754
            ],
            [
                760,
                781
            ],
            [
                781,
                795
            ],
            [
                800,
                843
            ],
            [
                843,
                845
            ],
            [
                845,
                853
            ],
            [
                861,
                911
            ],
            [
                911,
                912
            ],
            [
                913,
                940
            ],
            [
                940,
                970
            ],
            [
                970,
                992
            ],
            [
                998,
                1003
            ],
            [
                1003,
                1038
            ],
            [
                1038,
                1057
            ],
            [
                1058,
                1063
            ],
            [
                1064,
                1079
            ],
            [
                1080,
                1092
            ],
            [
                1093,
                1109
            ],
            [
                1110,
                1116
            ],
            [
                1122,
                1146
            ],
            [
                1146,
                1160
            ],
            [
                1163,
                1201
            ],
            [
                1201,
                1232
            ],
            [
                1232,
                1258
            ],
            [
                1258,
                1334
            ],
            [
                1334,
                1379
            ],
            [
                1379,
                1380
            ],
            [
                1380,
                1396
            ],
            [
                1396,
                1444
            ],
            [
                1445,
                1454
            ],
            [
                1454,
                1516
            ],
            [
                1516,
                1527
            ],
            [
                1528,
                1542
            ],
            [
                1544,
                1564
            ],
            [
                1564,
                1605
            ],
            [
                1605,
                1630
            ],
            [
                1631,
                1641
            ],
            [
                1642,
                1657
            ],
            [
                1658,
                1698
            ],
            [
                1714,
                1751
            ],
            [
                1751,
                1798
            ],
            [
                1798,
                1821
            ],
            [
                1824,
                1833
            ],
            [
                1834,
                1840
            ],
            [
                1841,
                1855
            ],
            [
                1855,
                1856
            ],
            [
                1882,
                1884
            ],
            [
                1884,
                1932
            ],
            [
                1935,
                1960
            ],
            [
                1960,
                1995
            ],
            [
                2002,
                2004
            ],
            [
                2004,
                2053
            ],
            [
                2057,
                2065
            ],
            [
                2065,
                2096
            ],
            [
                2096,
                2140
            ],
            [
                2140,
                2165
            ],
            [
                2165,
                2215
            ],
            [
                2215,
                2250
            ],
            [
                2250,
                2265
            ],
            [
                2266,
                2294
            ],
            [
                2294,
                2343
            ],
            [
                2343,
                2359
            ],
            [
                2366,
                2376
            ],
            [
                2379,
                2396
            ],
            [
                2396,
                2415
            ],
            [
                2416,
                2449
            ],
            [
                2450,
                2464
            ],
            [
                2465,
                2517
            ],
            [
                2517,
                2609
            ],
            [
                2616,
                2693
            ],
            [
                2693,
                2731
            ],
            [
                2741,
                2760
            ],
            [
                2760,
                2763
            ],
            [
                2768,
                2789
            ],
            [
                2789,
                2818
            ],
            [
                2831,
                2835
            ],
            [
                2847,
                2863
            ],
            [
                2864,
                2894
            ],
            [
                2908,
                2916
            ],
            [
                2916,
                2918
            ],
            [
                2918,
                2929
            ],
            [
                2930,
                2956
            ],
            [
                2965,
                2974
            ],
            [
                2975,
                2984
            ],
            [
                2984,
                2986
            ],
            [
                2989,
                3092
            ],
            [
                3092,
                3094
            ],
            [
                3094,
                3126
            ],
            [
                3126,
                3187
            ],
            [
                3190,
                3207
            ],
            [
                3208,
                3214
            ],
            [
                3220,
                3222
            ],
            [
                3222,
                3261
            ],
            [
                3262,
                3267
            ],
            [
                3276,
                3358
            ],
            [
                3358,
                3384
            ],
            [
                3392,
                3405
            ],
            [
                3406,
                3415
            ],
            [
                3420,
                3453
            ],
            [
                3454,
                3463
            ],
            [
                3464,
                3468
            ],
            [
                3472,
                3477
            ],
            [
                3497,
                3499
            ],
            [
                3499,
                3527
            ],
            [
                3527,
                3561
            ],
            [
                3561,
                3582
            ],
            [
                3587,
                3592
            ],
            [
                3601,
                3621
            ],
            [
                3621,
                3640
            ],
            [
                3641,
                3667
            ],
            [
                3667,
                3692
            ],
            [
                3701,
                3702
            ],
            [
                3703,
                3704
            ],
            [
                3705,
                3712
            ],
            [
                3721,
                3736
            ],
            [
                3736,
                3746
            ],
            [
                3746,
                3764
            ],
            [
                3765,
                3766
            ],
            [
                3771,
                3833
            ],
            [
                3836,
                3864
            ],
            [
                3864,
                3889
            ],
            [
                3889,
                3921
            ],
            [
                3921,
                3969
            ],
            [
                3969,
                4029
            ],
            [
                4030,
                4049
            ],
            [
                4053,
                4079
            ],
            [
                4087,
                4090
            ],
            [
                4090,
                4091
            ],
            [
                4091,
                4115
            ],
            [
                4115,
                4164
            ],
            [
                4164,
                4184
            ],
            [
                4184,
                4186
            ],
            [
                4186,
                4212
            ],
            [
                4220,
                4237
            ],
            [
                4237,
                4243
            ],
            [
                4246,
                4283
            ],
            [
                4283,
                4374
            ],
            [
                4374,
                4375
            ],
            [
                4375,
                4386
            ],
            [
                4396,
                4407
            ],
            [
                4407,
                4425
            ],
            [
                4425,
                4500
            ],
            [
                4500,
                4512
            ],
            [
                4518,
                4545
            ],
            [
                4561,
                4601
            ],
            [
                4602,
                4626
            ],
            [
                4626,
                4651
            ]
        ],
        "row_chars": [
            [
                0,
                78
            ],
            [
                78,
                78
            ],
            [
                78,
                78
            ],
            [
                78,
                78
            ],
            [
                78,
                132
            ],
            [
                132,
                177
            ],
            [
                177,
                237
            ],
            [
                237,
                280
            ],
            [
                280,
                297
            ],
            [
                297,
                297
            ],
            [
                297,
                297
            ],
            [
                297,
                310
            ],
            [
                310,
                397
            ],
            [
                397,
                498
            ],
            [
                498,
                538
            ],
            [
                538,
                697
            ],
            [
                697,
                781
            ],
            [
                781,
                845
            ],
            [
                845,
                913
            ],
            [
                913,
                940
            ],
            [
                940,
                970
            ],
            [
                970,
                1003
            ],
            [
                1003,
                1003
            ],
            [
                1003,
                1038
            ],
            [
                1038,
                1079
            ],
            [
                1079,
                1079
            ],
            [
                1079,
                1146
            ],
            [
                1146,
                1201
            ],
            [
                1201,
                1232
            ],
            [
                1232,
                1258
            ],
            [
                1258,
                1334
            ],
            [
                1334,
                1379
            ],
            [
                1379,
                1396
            ],
            [
                1396,
                1454
            ],
            [
                1454,
                1516
            ],
            [
                1516,
                1544
            ],
            [
                1544,
                1544
            ],
            [
                1544,
                1564
            ],
            [
                1564,
                1605
            ],
            [
                1605,
                1631
            ],
            [
                1631,
                1658
            ],
            [
                1658,
                1751
            ],
            [
                1751,
                1798
            ],
            [
                1798,
                1821
            ],
            [
                1821,
                1884
            ],
            [
                1884,
                1935
            ],
            [
                1935,
                1960
            ],
            [
                1960,
                2004
            ],
            [
                2004,
                2065
            ],
            [
                2065,
                2096
            ],
            [
                2096,
                2140
            ],
            [
                2140,
                2165
            ],
            [
                2165,
                2215
            ],
            [
                2215,
                2250
            ],
            [
                2250,
                2294
            ],
            [
                2294,
                2343
            ],
            [
                2343,
                2396
            ],
            [
                2396,
                2416
            ],
            [
                2416,
                2416
            ],
            [
                2416,
                2517
            ],
            [
                2517,
                2517
            ],
            [
                2517,
                2517
            ],
            [
                2517,
                2693
            ],
            [
                2693,
                2760
            ],
            [
                2760,
                2789
            ],
            [
                2789,
                2918
            ],
            [
                2918,
                2986
            ],
            [
                2986,
                2986
            ],
            [
                2986,
                3094
            ],
            [
                3094,
                3126
            ],
            [
                3126,
                3222
            ],
            [
                3222,
                3222
            ],
            [
                3222,
                3358
            ],
            [
                3358,
                3415
            ],
            [
                3415,
                3415
            ],
            [
                3415,
                3499
            ],
            [
                3499,
                3527
            ],
            [
                3527,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3621
            ],
            [
                3621,
                3667
            ],
            [
                3667,
                3736
            ],
            [
                3736,
                3765
            ],
            [
                3765,
                3765
            ],
            [
                3765,
                3836
            ],
            [
                3836,
                3864
            ],
            [
                3864,
                3889
            ],
            [
                3889,
                3921
            ],
            [
                3921,
                3969
            ],
            [
                3969,
                4049
            ],
            [
                4049,
                4049
            ],
            [
                4049,
                4090
            ],
            [
                4090,
                4115
            ],
            [
                4115,
                4164
            ],
            [
                4164,
                4186
            ],
            [
                4186,
                4237
            ],
            [
                4237,
                4283
            ],
            [
                4283,
                4374
            ],
            [
                4374,
                4425
            ],
            [
                4425,
                4500
            ],
            [
                4500,
                4626
            ],
            [
                4626,
                4651
            ]
        ]
    }
}