{
    "original": {
        "text": "During all these days Miss Melmotte was by no means contented with her lover's prowess, though she would not allow herself to doubt his sincerity. She had not only assured him of her undying affection in the presence of her father and mother, had not only offered to be chopped in pieces on his behalf, but had also written to him, telling how she had a large sum of her father's money within her power, and how willing she was to make it her own, to throw over her father and mother, and give herself and her fortune to her lover. She felt that she had been very gracious to her lover, and that her lover was a little slow in acknowledging the favours conferred upon him. But, nevertheless, she was true to her lover, and believed that he was true to her. Didon had been hitherto faithful. Marie had written various letters to Sir Felix, and had received two or three very short notes in reply, containing hardly more than a word or two each. But now she was told that a day was absolutely fixed for her marriage with Lord Nidderdale, and that her things were to be got ready. She was to be married in the middle of August, and here they were, approaching the end of June. \"You may buy what you like, mamma,\" she said; \"and if papa agrees about Felix, why then I suppose they'll do. But they'll never be of any use about Lord Nidderdale. If you were to sew me up in the things by main force, I wouldn't have him.\" Madame Melmotte groaned, and scolded in English, French, and German, and wished that she were dead; she told Marie that she was a pig, and ass, and a toad, and a dog. And ended, as she always did end, by swearing that Melmotte must manage the matter himself. \"Nobody shall manage this matter for me,\" said Marie. \"I know what I'm about now, and I won't marry anybody just because it will suit papa.\" \"Que nous tions encore Francfort, ou New York,\" said the elder lady, remembering the humbler but less troubled times of her earlier life. Marie did not care for Francfort or New York; for Paris or for London;--but she did care for Sir Felix Carbury.\nWhile her father on Sunday morning was transacting business in his own house with Paul Montague and the great commercial magnates of the city,--though it may be doubted whether that very respectable gentleman Sir Gregory Gribe was really in Grosvenor Square when his name was mentioned,--Marie was walking inside the gardens; Didon was also there at some distance from her; and Sir Felix Carbury was there also close along side of her. Marie had the key of the gardens for her own use; and had already learned that her neighbours in the square did not much frequent the place during church time on Sunday morning. Her lover's letter to her father had of course been shown to her, and she had taxed him with it immediately. Sir Felix, who had thought much of the letter as he came from Welbeck Street to keep his appointment,--having been assured by Didon that the gate should be left unlocked, and that she would be there to close it after he had come in,--was of course ready with a lie. \"It was the only thing to do, Marie;--it was indeed.\"\n\"But you said you had accepted some offer.\"\n\"You don't suppose I wrote the letter?\"\n\"It was your handwriting, Felix.\"\n\"Of course it was. I copied just what he put down. He'd have sent you clean away where I couldn't have got near you if I hadn't written it.\"\n\"And you have accepted nothing?\"\n\"Not at all. As it is, he owes me money. Is not that odd? I gave him a thousand pounds to buy shares, and I haven't got anything from him yet.\" Sir Felix, no doubt, forgot the cheque for 200.\n\"Nobody ever does who gives papa money,\" said the observant daughter.\n\"Don't they? Dear me! But I just wrote it because I thought anything better than a downright quarrel.\"\n\"I wouldn't have written it, if it had been ever so.\"\n\"It's no good scolding, Marie. I did it for the best. What do you think we'd best do now?\" Marie looked at him, almost with scorn. Surely it was for him to propose and for her to yield. \"I wonder whether you're sure you're right about that money which you say is settled.\"\n[Illustration: \"It's no good scolding.\"]\n\"I'm quite sure. Mamma told me in Paris,--just when we were coming away,--that it was done so that there might be something if things went wrong. And papa told me that he should want me to sign something from time to time; and of course I said I would. But of course I won't,--if I should have a husband of my own.\" Felix walked along, pondering the matter, with his hands in his trowsers pockets. He entertained those very fears which had latterly fallen upon Lord Nidderdale. There would be no \"cropper\" which a man could \"come\" so bad as would be his cropper were he to marry Marie Melmotte, and then find that he was not to have a shilling! And, were he now to run off with Marie, after having written that letter, the father would certainly not forgive him. This assurance of Marie's as to the settled money was too doubtful! The game to be played was too full of danger! And in that case he would certainly get neither his 800, nor the shares. And if he were true to Melmotte, Melmotte would probably supply him with ready money. But then here was the girl at his elbow, and he no more dared to tell her to her face that he meant to give her up, than he dared to tell Melmotte that he intended to stick to his engagement. Some half promise would be the only escape for the present. \"What are you thinking of, Felix?\" she asked.\n\"It's d---- difficult to know what to do.\"\n\"But you do love me?\"\n\"Of course I do. If I didn't love you why should I be here walking round this stupid place? They talk of your being married to Nidderdale about the end of August.\"\n\"Some day in August. But that's all nonsense, you know. They can't take me up and marry me, as they used to do the girls ever so long ago. I won't marry him. He don't care a bit for me, and never did. I don't think you care much, Felix.\"\n\"Yes, I do. A fellow can't go on saying so over and over again in a beastly place like this. If we were anywhere jolly together, then I could say it often enough.\"\n\"I wish we were, Felix. I wonder whether we ever shall be.\"\n\"Upon my word I hardly see my way as yet.\"\n\"You're not going to give it up!\"\n\"Oh no;--not give it up; certainly not. But the bother is a fellow doesn't know what to do.\"\n\"You've heard of young Mr. Goldsheiner, haven't you?\" suggested Marie.\n\"He's one of those city chaps.\"\n\"And Lady Julia Start?\"\n\"She's old Lady Catchboy's daughter. Yes; I've heard of them. They got spliced last winter.\"\n\"Yes,--somewhere in Switzerland, I think. At any rate they went to Switzerland, and now they've got a house close to Albert Gate.\"\n\"How jolly for them! He is awfully rich, isn't he?\"\n\"I don't suppose he's half so rich as papa. They did all they could to prevent her going, but she met him down at Folkestone just as the tidal boat was starting. Didon says that nothing was easier.\"\n\"Oh;--ah. Didon knows all about it.\"\n\"That she does.\"\n\"But she'd lose her place.\"\n\"There are plenty of places. She could come and live with us, and be my maid. If you would give her 50 for herself, she'd arrange it all.\"\n\"And would you come to Folkestone?\"\n\"I think that would be stupid, because Lady Julia did that. We should make it a little different. If you liked I wouldn't mind going to--New York. And then, perhaps, we might--get--married, you know, on board. That's what Didon thinks.\"\n\"And would Didon go too?\"\n\"That's what she proposes. She could go as my aunt, and I'd call myself by her name;--any French name you know. I should go as a French girl. And you could call yourself Smith, and be an American. We wouldn't go together, but we'd get on board just at the last moment. If they wouldn't--marry us on board, they would at New York, instantly.\"\n\"That's Didon's plan?\"\n\"That's what she thinks best,--and she'll do it, if you'll give her 50 for herself, you know. The 'Adriatic,'--that's a White Star boat, goes on Thursday week at noon. There's an early train that would take us down that morning. You had better go and sleep at Liverpool, and take no notice of us at all till we meet on board. We could be back in a month,--and then papa would be obliged to make the best of it.\"\nSir Felix at once felt that it would be quite unnecessary for him to go to Herr Vossner or to any other male counsellor for advice as to the best means of carrying off his love. The young lady had it all at her fingers' ends,--even to the amount of the fee required by the female counsellor. But Thursday week was very near, and the whole thing was taking uncomfortably defined proportions. Where was he to get funds if he were to resolve that he would do this thing? He had been fool enough to intrust his ready money to Melmotte, and now he was told that when Melmotte got hold of ready money he was not apt to release it. And he had nothing to show;--no security that he could offer to Vossner. And then,--this idea of starting to New York with Melmotte's daughter immediately after he had written to Melmotte renouncing the girl, frightened him.\n\"There is a tide in the affairs of men, Which taken at the flood leads on to fortune.\"\nSir Felix did not know these lines, but the lesson taught by them came home to him at this moment. Now was the tide in his affairs at which he might make himself, or utterly mar himself. \"It's deuced important,\" he said at last with a groan.\n\"It's not more important for you than me,\" said Marie.\n\"If you're wrong about the money, and he shouldn't come round, where should we be then?\"\n\"Nothing venture, nothing have,\" said the heiress.\n\"That's all very well; but one might venture everything and get nothing after all.\"\n\"You'd get me,\" said Marie with a pout.\n\"Yes;--and I'm awfully fond of you. Of course I should get you! But--\"\n\"Very well then;--if that's your love,\" said Marie, turning back from him.\nSir Felix gave a great sigh, and then announced his resolution. \"I'll venture it.\"\n\"Oh, Felix, how grand it will be!\"\n\"There's a great deal to do, you know. I don't know whether it can be Thursday week.\" He was putting in the coward's plea for a reprieve.\n\"I shall be afraid of Didon if it's delayed long.\"\n\"There's the money to get, and all that.\"\n\"I can get some money. Mamma has money in the house.\"\n\"How much?\" asked the baronet eagerly.\n\"A hundred pounds, perhaps;--perhaps two hundred.\"\n\"That would help certainly. I must go to your father for money. Won't that be a sell? To get it from him, to take you away!\"\nIt was decided that they were to go to New York, on a Thursday,--on Thursday week if possible, but as to that he was to let her know in a day or two. Didon was to pack up the clothes and get it sent out of the house. Didon was to have 50 before she went on board; and as one of the men must know about it, and must assist in having the trunks smuggled out of the house, he was to have 10. All had been settled beforehand, so that Sir Felix really had no need to think about anything. \"And now,\" said Marie, \"there's Didon. Nobody's looking and she can open that gate for you. When we're gone, do you creep out. The gate can be left, you know. Then we'll get out on the other side.\" Marie Melmotte was certainly a clever girl.",
        "paragraph_chars": [
            [
                0,
                2065
            ],
            [
                2065,
                3108
            ],
            [
                3108,
                3152
            ],
            [
                3152,
                3192
            ],
            [
                3192,
                3226
            ],
            [
                3226,
                3367
            ],
            [
                3367,
                3400
            ],
            [
                3400,
                3592
            ],
            [
                3592,
                3662
            ],
            [
                3662,
                3765
            ],
            [
                3765,
                3819
            ],
            [
                3819,
                4092
            ],
            [
                4092,
                4133
            ],
            [
                4133,
                5467
            ],
            [
                5467,
                5510
            ],
            [
                5510,
                5532
            ],
            [
                5532,
                5696
            ],
            [
                5696,
                5934
            ],
            [
                5934,
                6098
            ],
            [
                6098,
                6158
            ],
            [
                6158,
                6201
            ],
            [
                6201,
                6235
            ],
            [
                6235,
                6328
            ],
            [
                6328,
                6399
            ],
            [
                6399,
                6431
            ],
            [
                6431,
                6455
            ],
            [
                6455,
                6548
            ],
            [
                6548,
                6679
            ],
            [
                6679,
                6731
            ],
            [
                6731,
                6930
            ],
            [
                6930,
                6967
            ],
            [
                6967,
                6984
            ],
            [
                6984,
                7012
            ],
            [
                7012,
                7151
            ],
            [
                7151,
                7187
            ],
            [
                7187,
                7424
            ],
            [
                7424,
                7450
            ],
            [
                7450,
                7792
            ],
            [
                7792,
                7815
            ],
            [
                7815,
                8227
            ],
            [
                8227,
                9077
            ],
            [
                9077,
                9164
            ],
            [
                9164,
                9406
            ],
            [
                9406,
                9461
            ],
            [
                9461,
                9550
            ],
            [
                9550,
                9601
            ],
            [
                9601,
                9685
            ],
            [
                9685,
                9725
            ],
            [
                9725,
                9796
            ],
            [
                9796,
                9871
            ],
            [
                9871,
                9954
            ],
            [
                9954,
                9989
            ],
            [
                9989,
                10127
            ],
            [
                10127,
                10178
            ],
            [
                10178,
                10220
            ],
            [
                10220,
                10274
            ],
            [
                10274,
                10313
            ],
            [
                10313,
                10364
            ],
            [
                10364,
                10489
            ],
            [
                10489,
                11214
            ]
        ],
        "segment_chars": [
            [
                0,
                147
            ],
            [
                147,
                532
            ],
            [
                532,
                673
            ],
            [
                673,
                757
            ],
            [
                757,
                791
            ],
            [
                791,
                944
            ],
            [
                944,
                1078
            ],
            [
                1078,
                1174
            ],
            [
                1174,
                1284
            ],
            [
                1284,
                1339
            ],
            [
                1339,
                1415
            ],
            [
                1415,
                1582
            ],
            [
                1582,
                1674
            ],
            [
                1674,
                1728
            ],
            [
                1728,
                1815
            ],
            [
                1815,
                1953
            ],
            [
                1953,
                2065
            ],
            [
                2065,
                2501
            ],
            [
                2501,
                2679
            ],
            [
                2679,
                2788
            ],
            [
                2788,
                3054
            ],
            [
                3054,
                3108
            ],
            [
                3108,
                3152
            ],
            [
                3152,
                3192
            ],
            [
                3192,
                3226
            ],
            [
                3226,
                3245
            ],
            [
                3245,
                3277
            ],
            [
                3277,
                3367
            ],
            [
                3367,
                3400
            ],
            [
                3400,
                3413
            ],
            [
                3413,
                3441
            ],
            [
                3441,
                3458
            ],
            [
                3458,
                3544
            ],
            [
                3544,
                3592
            ],
            [
                3592,
                3662
            ],
            [
                3662,
                3675
            ],
            [
                3675,
                3684
            ],
            [
                3684,
                3765
            ],
            [
                3765,
                3819
            ],
            [
                3819,
                3850
            ],
            [
                3850,
                3873
            ],
            [
                3873,
                3910
            ],
            [
                3910,
                3950
            ],
            [
                3950,
                4005
            ],
            [
                4005,
                4092
            ],
            [
                4092,
                4133
            ],
            [
                4133,
                4150
            ],
            [
                4150,
                4279
            ],
            [
                4279,
                4386
            ],
            [
                4386,
                4449
            ],
            [
                4449,
                4531
            ],
            [
                4531,
                4611
            ],
            [
                4611,
                4778
            ],
            [
                4778,
                4896
            ],
            [
                4896,
                4964
            ],
            [
                4964,
                5010
            ],
            [
                5010,
                5083
            ],
            [
                5083,
                5169
            ],
            [
                5169,
                5361
            ],
            [
                5361,
                5421
            ],
            [
                5421,
                5456
            ],
            [
                5456,
                5467
            ],
            [
                5467,
                5510
            ],
            [
                5510,
                5532
            ],
            [
                5532,
                5549
            ],
            [
                5549,
                5624
            ],
            [
                5624,
                5696
            ],
            [
                5696,
                5717
            ],
            [
                5717,
                5752
            ],
            [
                5752,
                5835
            ],
            [
                5835,
                5854
            ],
            [
                5854,
                5897
            ],
            [
                5897,
                5934
            ],
            [
                5934,
                5946
            ],
            [
                5946,
                6027
            ],
            [
                6027,
                6098
            ],
            [
                6098,
                6122
            ],
            [
                6122,
                6158
            ],
            [
                6158,
                6201
            ],
            [
                6201,
                6235
            ],
            [
                6235,
                6275
            ],
            [
                6275,
                6328
            ],
            [
                6328,
                6382
            ],
            [
                6382,
                6399
            ],
            [
                6399,
                6431
            ],
            [
                6431,
                6455
            ],
            [
                6455,
                6492
            ],
            [
                6492,
                6517
            ],
            [
                6517,
                6548
            ],
            [
                6548,
                6590
            ],
            [
                6590,
                6679
            ],
            [
                6679,
                6700
            ],
            [
                6700,
                6731
            ],
            [
                6731,
                6775
            ],
            [
                6775,
                6893
            ],
            [
                6893,
                6930
            ],
            [
                6930,
                6940
            ],
            [
                6940,
                6967
            ],
            [
                6967,
                6984
            ],
            [
                6984,
                7012
            ],
            [
                7012,
                7041
            ],
            [
                7041,
                7090
            ],
            [
                7090,
                7151
            ],
            [
                7151,
                7187
            ],
            [
                7187,
                7247
            ],
            [
                7247,
                7285
            ],
            [
                7285,
                7334
            ],
            [
                7334,
                7397
            ],
            [
                7397,
                7424
            ],
            [
                7424,
                7450
            ],
            [
                7450,
                7477
            ],
            [
                7477,
                7562
            ],
            [
                7562,
                7592
            ],
            [
                7592,
                7647
            ],
            [
                7647,
                7719
            ],
            [
                7719,
                7792
            ],
            [
                7792,
                7815
            ],
            [
                7815,
                7909
            ],
            [
                7909,
                7983
            ],
            [
                7983,
                8044
            ],
            [
                8044,
                8141
            ],
            [
                8141,
                8227
            ],
            [
                8227,
                8405
            ],
            [
                8405,
                8519
            ],
            [
                8519,
                8618
            ],
            [
                8618,
                8695
            ],
            [
                8695,
                8852
            ],
            [
                8852,
                8925
            ],
            [
                8925,
                9077
            ],
            [
                9077,
                9164
            ],
            [
                9164,
                9263
            ],
            [
                9263,
                9351
            ],
            [
                9351,
                9406
            ],
            [
                9406,
                9461
            ],
            [
                9461,
                9550
            ],
            [
                9550,
                9601
            ],
            [
                9601,
                9685
            ],
            [
                9685,
                9725
            ],
            [
                9725,
                9761
            ],
            [
                9761,
                9789
            ],
            [
                9789,
                9796
            ],
            [
                9796,
                9871
            ],
            [
                9871,
                9935
            ],
            [
                9935,
                9954
            ],
            [
                9954,
                9989
            ],
            [
                9989,
                10028
            ],
            [
                10028,
                10075
            ],
            [
                10075,
                10127
            ],
            [
                10127,
                10178
            ],
            [
                10178,
                10220
            ],
            [
                10220,
                10243
            ],
            [
                10243,
                10274
            ],
            [
                10274,
                10286
            ],
            [
                10286,
                10313
            ],
            [
                10313,
                10364
            ],
            [
                10364,
                10392
            ],
            [
                10392,
                10428
            ],
            [
                10428,
                10450
            ],
            [
                10450,
                10489
            ],
            [
                10489,
                10639
            ],
            [
                10639,
                10706
            ],
            [
                10706,
                10878
            ],
            [
                10878,
                10973
            ],
            [
                10973,
                11012
            ],
            [
                11012,
                11065
            ],
            [
                11065,
                11100
            ],
            [
                11100,
                11132
            ],
            [
                11132,
                11171
            ],
            [
                11171,
                11214
            ]
        ],
        "overlap_chars": [
            [
                22,
                39
            ],
            [
                105,
                108
            ],
            [
                52,
                98
            ],
            [
                126,
                147
            ],
            [
                147,
                200
            ],
            [
                483,
                488
            ],
            [
                243,
                246
            ],
            [
                256,
                323
            ],
            [
                332,
                339
            ],
            [
                327,
                330
            ],
            [
                344,
                407
            ],
            [
                424,
                427
            ],
            [
                412,
                419
            ],
            [
                324,
                326
            ],
            [
                489,
                532
            ],
            [
                532,
                540
            ],
            [
                591,
                673
            ],
            [
                673,
                695
            ],
            [
                723,
                756
            ],
            [
                894,
                895
            ],
            [
                791,
                894
            ],
            [
                942,
                944
            ],
            [
                944,
                951
            ],
            [
                1123,
                1124
            ],
            [
                1168,
                1172
            ],
            [
                1143,
                1144
            ],
            [
                952,
                979
            ],
            [
                991,
                1035
            ],
            [
                1100,
                1123
            ],
            [
                1076,
                1077
            ],
            [
                1174,
                1191
            ],
            [
                1192,
                1221
            ],
            [
                1284,
                1287
            ],
            [
                1339,
                1380
            ],
            [
                1386,
                1408
            ],
            [
                1322,
                1337
            ],
            [
                1412,
                1414
            ],
            [
                1415,
                1438
            ],
            [
                1440,
                1451
            ],
            [
                1482,
                1549
            ],
            [
                1554,
                1558
            ],
            [
                1563,
                1582
            ],
            [
                1596,
                1599
            ],
            [
                1586,
                1595
            ],
            [
                1600,
                1606
            ],
            [
                1614,
                1673
            ],
            [
                1674,
                1728
            ],
            [
                1728,
                1786
            ],
            [
                1803,
                1814
            ],
            [
                2082,
                2099
            ],
            [
                2206,
                2207
            ],
            [
                2065,
                2081
            ],
            [
                2100,
                2103
            ],
            [
                2116,
                2124
            ],
            [
                2142,
                2160
            ],
            [
                2303,
                2322
            ],
            [
                2350,
                2351
            ],
            [
                2353,
                2370
            ],
            [
                2125,
                2127
            ],
            [
                2165,
                2168
            ],
            [
                2382,
                2389
            ],
            [
                2391,
                2400
            ],
            [
                2406,
                2411
            ],
            [
                2412,
                2428
            ],
            [
                2437,
                2464
            ],
            [
                2496,
                2501
            ],
            [
                2501,
                2510
            ],
            [
                2567,
                2594
            ],
            [
                2609,
                2616
            ],
            [
                2622,
                2634
            ],
            [
                2602,
                2608
            ],
            [
                2641,
                2678
            ],
            [
                2679,
                2752
            ],
            [
                2757,
                2788
            ],
            [
                2788,
                2797
            ],
            [
                3022,
                3025
            ],
            [
                3036,
                3053
            ],
            [
                3054,
                3090
            ],
            [
                3092,
                3105
            ],
            [
                3245,
                3246
            ],
            [
                3254,
                3258
            ],
            [
                3247,
                3253
            ],
            [
                3259,
                3277
            ],
            [
                3277,
                3295
            ],
            [
                3302,
                3367
            ],
            [
                3367,
                3397
            ],
            [
                3397,
                3400
            ],
            [
                3400,
                3413
            ],
            [
                3413,
                3441
            ],
            [
                3458,
                3544
            ],
            [
                3544,
                3592
            ],
            [
                3592,
                3662
            ],
            [
                3662,
                3675
            ],
            [
                3675,
                3684
            ],
            [
                3873,
                3909
            ],
            [
                3910,
                3929
            ],
            [
                3931,
                3950
            ],
            [
                3950,
                4004
            ],
            [
                4005,
                4034
            ],
            [
                4048,
                4089
            ],
            [
                4133,
                4150
            ],
            [
                4150,
                4172
            ],
            [
                4207,
                4279
            ],
            [
                4279,
                4359
            ],
            [
                4370,
                4386
            ],
            [
                4386,
                4407
            ],
            [
                4410,
                4414
            ],
            [
                4422,
                4448
            ],
            [
                4449,
                4454
            ],
            [
                4469,
                4473
            ],
            [
                4479,
                4489
            ],
            [
                4529,
                4531
            ],
            [
                4788,
                4790
            ],
            [
                4783,
                4787
            ],
            [
                4795,
                4896
            ],
            [
                4896,
                4962
            ],
            [
                4964,
                5008
            ],
            [
                5083,
                5168
            ],
            [
                5169,
                5361
            ],
            [
                5361,
                5378
            ],
            [
                5388,
                5420
            ],
            [
                5467,
                5474
            ],
            [
                5479,
                5507
            ],
            [
                5510,
                5532
            ],
            [
                5532,
                5549
            ],
            [
                5549,
                5585
            ],
            [
                5591,
                5624
            ],
            [
                5624,
                5641
            ],
            [
                5659,
                5669
            ],
            [
                5687,
                5696
            ],
            [
                5721,
                5740
            ],
            [
                5750,
                5752
            ],
            [
                5752,
                5762
            ],
            [
                5768,
                5770
            ],
            [
                5833,
                5835
            ],
            [
                5854,
                5897
            ],
            [
                5897,
                5934
            ],
            [
                5934,
                5946
            ],
            [
                5946,
                6027
            ],
            [
                6027,
                6098
            ],
            [
                6098,
                6122
            ],
            [
                6122,
                6158
            ],
            [
                6158,
                6201
            ],
            [
                6201,
                6212
            ],
            [
                6227,
                6235
            ],
            [
                6235,
                6241
            ],
            [
                6258,
                6275
            ],
            [
                6275,
                6328
            ],
            [
                6328,
                6382
            ],
            [
                6382,
                6398
            ],
            [
                6399,
                6402
            ],
            [
                6436,
                6452
            ],
            [
                6534,
                6545
            ],
            [
                6565,
                6567
            ],
            [
                6615,
                6679
            ],
            [
                6679,
                6689
            ],
            [
                6698,
                6700
            ],
            [
                6700,
                6731
            ],
            [
                6731,
                6732
            ],
            [
                6753,
                6775
            ],
            [
                6775,
                6855
            ],
            [
                6891,
                6893
            ],
            [
                6893,
                6930
            ],
            [
                6930,
                6934
            ],
            [
                6936,
                6940
            ],
            [
                6940,
                6967
            ],
            [
                7115,
                7118
            ],
            [
                7112,
                7114
            ],
            [
                7126,
                7127
            ],
            [
                7097,
                7102
            ],
            [
                7134,
                7151
            ],
            [
                7151,
                7187
            ],
            [
                7187,
                7247
            ],
            [
                7298,
                7322
            ],
            [
                7324,
                7334
            ],
            [
                7334,
                7361
            ],
            [
                7363,
                7366
            ],
            [
                7368,
                7395
            ],
            [
                7395,
                7397
            ],
            [
                7397,
                7424
            ],
            [
                7424,
                7450
            ],
            [
                7477,
                7500
            ],
            [
                7560,
                7562
            ],
            [
                7562,
                7592
            ],
            [
                7592,
                7647
            ],
            [
                7647,
                7719
            ],
            [
                7719,
                7735
            ],
            [
                7743,
                7778
            ],
            [
                7909,
                7912
            ],
            [
                7914,
                7922
            ],
            [
                7926,
                7950
            ],
            [
                7952,
                7956
            ],
            [
                7957,
                7983
            ],
            [
                7983,
                8005
            ],
            [
                8042,
                8044
            ],
            [
                8044,
                8110
            ],
            [
                8118,
                8141
            ],
            [
                8141,
                8168
            ],
            [
                8171,
                8227
            ],
            [
                8227,
                8236
            ],
            [
                8245,
                8254
            ],
            [
                8405,
                8451
            ],
            [
                8517,
                8519
            ],
            [
                8519,
                8618
            ],
            [
                8618,
                8643
            ],
            [
                8655,
                8657
            ],
            [
                8680,
                8687
            ],
            [
                8693,
                8695
            ],
            [
                8925,
                8928
            ],
            [
                8941,
                8994
            ],
            [
                8933,
                8934
            ],
            [
                8995,
                9076
            ],
            [
                9263,
                9274
            ],
            [
                9304,
                9350
            ],
            [
                9351,
                9383
            ],
            [
                9392,
                9405
            ],
            [
                9461,
                9529
            ],
            [
                9537,
                9550
            ],
            [
                9550,
                9601
            ],
            [
                9601,
                9685
            ],
            [
                9685,
                9725
            ],
            [
                9725,
                9729
            ],
            [
                9732,
                9759
            ],
            [
                9761,
                9770
            ],
            [
                9759,
                9760
            ],
            [
                9789,
                9792
            ],
            [
                9796,
                9806
            ],
            [
                9811,
                9812
            ],
            [
                9814,
                9835
            ],
            [
                9836,
                9840
            ],
            [
                9846,
                9855
            ],
            [
                9869,
                9871
            ],
            [
                9871,
                9898
            ],
            [
                9933,
                9935
            ],
            [
                9935,
                9954
            ],
            [
                9954,
                9989
            ],
            [
                9989,
                10028
            ],
            [
                10028,
                10074
            ],
            [
                10127,
                10178
            ],
            [
                10178,
                10220
            ],
            [
                10220,
                10243
            ],
            [
                10243,
                10274
            ],
            [
                10274,
                10286
            ],
            [
                10286,
                10313
            ],
            [
                10313,
                10330
            ],
            [
                10339,
                10340
            ],
            [
                10342,
                10364
            ],
            [
                10364,
                10380
            ],
            [
                10381,
                10392
            ],
            [
                10392,
                10428
            ],
            [
                10428,
                10450
            ],
            [
                10450,
                10489
            ],
            [
                10489,
                10540
            ],
            [
                10557,
                10582
            ],
            [
                10637,
                10639
            ],
            [
                10639,
                10671
            ],
            [
                10704,
                10706
            ],
            [
                10706,
                10711
            ],
            [
                10724,
                10726
            ],
            [
                10751,
                10798
            ],
            [
                10821,
                10831
            ],
            [
                10841,
                10844
            ],
            [
                10857,
                10878
            ],
            [
                10923,
                10972
            ],
            [
                10973,
                11012
            ],
            [
                11122,
                11125
            ],
            [
                11104,
                11108
            ],
            [
                11120,
                11121
            ],
            [
                11137,
                11171
            ],
            [
                11171,
                11214
            ]
        ],
        "row_chars": [
            [
                0,
                147
            ],
            [
                147,
                532
            ],
            [
                532,
                673
            ],
            [
                673,
                757
            ],
            [
                757,
                791
            ],
            [
                791,
                944
            ],
            [
                944,
                1174
            ],
            [
                1174,
                1415
            ],
            [
                1415,
                1582
            ],
            [
                1582,
                1674
            ],
            [
                1674,
                1728
            ],
            [
                1728,
                1815
            ],
            [
                1815,
                1953
            ],
            [
                1953,
                2065
            ],
            [
                2065,
                2501
            ],
            [
                2501,
                2679
            ],
            [
                2679,
                2788
            ],
            [
                2788,
                3054
            ],
            [
                3054,
                3108
            ],
            [
                3108,
                3152
            ],
            [
                3152,
                3192
            ],
            [
                3192,
                3226
            ],
            [
                3226,
                3245
            ],
            [
                3245,
                3277
            ],
            [
                3277,
                3367
            ],
            [
                3367,
                3400
            ],
            [
                3400,
                3413
            ],
            [
                3413,
                3441
            ],
            [
                3441,
                3458
            ],
            [
                3458,
                3544
            ],
            [
                3544,
                3592
            ],
            [
                3592,
                3662
            ],
            [
                3662,
                3675
            ],
            [
                3675,
                3684
            ],
            [
                3684,
                3765
            ],
            [
                3765,
                3819
            ],
            [
                3819,
                3850
            ],
            [
                3850,
                3873
            ],
            [
                3873,
                3910
            ],
            [
                3910,
                3950
            ],
            [
                3950,
                4005
            ],
            [
                4005,
                4092
            ],
            [
                4092,
                4133
            ],
            [
                4133,
                4150
            ],
            [
                4150,
                4279
            ],
            [
                4279,
                4386
            ],
            [
                4386,
                4449
            ],
            [
                4449,
                4531
            ],
            [
                4531,
                4611
            ],
            [
                4611,
                4778
            ],
            [
                4778,
                4896
            ],
            [
                4896,
                4964
            ],
            [
                4964,
                5010
            ],
            [
                5010,
                5083
            ],
            [
                5083,
                5169
            ],
            [
                5169,
                5361
            ],
            [
                5361,
                5421
            ],
            [
                5421,
                5456
            ],
            [
                5456,
                5467
            ],
            [
                5467,
                5510
            ],
            [
                5510,
                5532
            ],
            [
                5532,
                5549
            ],
            [
                5549,
                5624
            ],
            [
                5624,
                5696
            ],
            [
                5696,
                5717
            ],
            [
                5717,
                5752
            ],
            [
                5752,
                5835
            ],
            [
                5835,
                5854
            ],
            [
                5854,
                5897
            ],
            [
                5897,
                5934
            ],
            [
                5934,
                5946
            ],
            [
                5946,
                6027
            ],
            [
                6027,
                6098
            ],
            [
                6098,
                6122
            ],
            [
                6122,
                6158
            ],
            [
                6158,
                6201
            ],
            [
                6201,
                6235
            ],
            [
                6235,
                6275
            ],
            [
                6275,
                6328
            ],
            [
                6328,
                6382
            ],
            [
                6382,
                6399
            ],
            [
                6399,
                6679
            ],
            [
                6679,
                6700
            ],
            [
                6700,
                6731
            ],
            [
                6731,
                6775
            ],
            [
                6775,
                6893
            ],
            [
                6893,
                6930
            ],
            [
                6930,
                6940
            ],
            [
                6940,
                6967
            ],
            [
                6967,
                6984
            ],
            [
                6984,
                7012
            ],
            [
                7012,
                7041
            ],
            [
                7041,
                7090
            ],
            [
                7090,
                7151
            ],
            [
                7151,
                7187
            ],
            [
                7187,
                7247
            ],
            [
                7247,
                7285
            ],
            [
                7285,
                7334
            ],
            [
                7334,
                7397
            ],
            [
                7397,
                7424
            ],
            [
                7424,
                7450
            ],
            [
                7450,
                7477
            ],
            [
                7477,
                7562
            ],
            [
                7562,
                7592
            ],
            [
                7592,
                7647
            ],
            [
                7647,
                7719
            ],
            [
                7719,
                7792
            ],
            [
                7792,
                7815
            ],
            [
                7815,
                7909
            ],
            [
                7909,
                7983
            ],
            [
                7983,
                8044
            ],
            [
                8044,
                8141
            ],
            [
                8141,
                8227
            ],
            [
                8227,
                8519
            ],
            [
                8519,
                8618
            ],
            [
                8618,
                8695
            ],
            [
                8695,
                8852
            ],
            [
                8852,
                8925
            ],
            [
                8925,
                9077
            ],
            [
                9077,
                9164
            ],
            [
                9164,
                9263
            ],
            [
                9263,
                9351
            ],
            [
                9351,
                9406
            ],
            [
                9406,
                9461
            ],
            [
                9461,
                9550
            ],
            [
                9550,
                9601
            ],
            [
                9601,
                9685
            ],
            [
                9685,
                9725
            ],
            [
                9725,
                9789
            ],
            [
                9789,
                9796
            ],
            [
                9796,
                9871
            ],
            [
                9871,
                9935
            ],
            [
                9935,
                9954
            ],
            [
                9954,
                9989
            ],
            [
                9989,
                10028
            ],
            [
                10028,
                10075
            ],
            [
                10075,
                10127
            ],
            [
                10127,
                10178
            ],
            [
                10178,
                10220
            ],
            [
                10220,
                10243
            ],
            [
                10243,
                10274
            ],
            [
                10274,
                10286
            ],
            [
                10286,
                10313
            ],
            [
                10313,
                10364
            ],
            [
                10364,
                10392
            ],
            [
                10392,
                10428
            ],
            [
                10428,
                10450
            ],
            [
                10450,
                10489
            ],
            [
                10489,
                10639
            ],
            [
                10639,
                10706
            ],
            [
                10706,
                10878
            ],
            [
                10878,
                10973
            ],
            [
                10973,
                11012
            ],
            [
                11012,
                11065
            ],
            [
                11065,
                11100
            ],
            [
                11100,
                11171
            ],
            [
                11171,
                11214
            ]
        ]
    },
    "abridged": {
        "text": "Meanwhile Miss Melmotte was not contented with her lover's prowess, though she did not doubt his sincerity. She had not only assured him of her undying affection, and had offered to be chopped in pieces on his behalf, but had also written telling him she had a large sum of her father's money within her power, and was willing to give herself and her fortune to her lover. She felt that her lover was a little slow in acknowledging the favours conferred upon him. But, nevertheless, she believed that he was true to her.\nThrough Didon, Marie had written various letters to Sir Felix, and had received two or three very short notes in reply. But now, in June, she was told that a day was fixed for her marriage with Lord Nidderdale, in the middle of August.\n\"You may buy what wedding clothes you like, mamma,\" she said; \"but if you were to sew me up in the things by force, I wouldn't have Lord Nidderdale.\"\nMadame Melmotte groaned and scolded, and wished that she were dead; she told Marie that she was a pig, an ass, a toad, and a dog. She ended, as always, by swearing that Melmotte must manage the matter himself.\n\"Nobody shall manage this matter for me,\" said Marie. \"I know what I'm about now, and I won't marry anybody just to suit papa.\"\nOn Sunday morning, while her father was doing business with Paul Montague in Grosvenor Square, Marie was walking in the square's gardens. Didon was there, at some distance; and Sir Felix Carbury was alongside her. Marie had learned that her neighbours did not frequent the square during church time on Sunday morning.\nHer lover's letter to her father had of course been shown to her, and she taxed him with it immediately. Sir Felix was ready with a lie.\n\"It was the only thing to do, Marie; it was indeed. I just copied what he put down. He'd have sent you away where I couldn't have got near you if I hadn't written it.\"\n\"And you have accepted nothing for it?\"\n\"Not at all. As it is, he owes me money. I gave him a thousand pounds to buy shares, and I haven't got anything from him yet.\" Sir Felix, no doubt, forgot the cheque for 200.\n\"Nobody ever does who gives papa money,\" said the observant daughter.\n\"Don't they? Dear me! What do you think we'd best do now?\"\nMarie looked at him almost with scorn. Surely it was for him to propose and for her to yield.\n\"I wonder whether you're sure about that money which you say is settled,\" said Felix.\n\"I'm quite sure. Mamma told me in Paris that it was done so that there might be something if things went wrong. And papa told me that he should want me to sign something from time to time; and I said I would. But of course I won't if I have a husband of my own.\"\nFelix pondered the matter. If he were to run off with Marie, after having written that letter, the father would certainly not forgive him. This assurance of Marie's as to the settled money was too doubtful. The game to be played was too full of danger. And if he were true to Melmotte, Melmotte would probably supply him with ready money.\nBut then here was the girl at his elbow, and he no more dared to tell her to her face that he meant to give her up, than he dared to tell Melmotte that he intended to stick to his engagement. Some half promise was the only escape for the present.\n\"It's d___ difficult to know what to do,\" he said.\n\"But you do love me?\"\n\"Of course I do. If I didn't love you why should I be walking round this stupid place? They talk of your marrying Nidderdale in August.\"\n\"That's all nonsense. They can't make me. He don't care a bit for me, and never did. I don't think you care much, Felix.\"\n\"Yes, I do. A fellow can't go on saying so over and over again in a beastly place like this. If we were anywhere jolly together, then I could say it often enough.\"\n\"I wish we were, Felix. I wonder whether we ever shall be.\"\n\"Upon my word I hardly see my way as yet.\"\n\"You're not giving it up!\"\n\"Oh no; certainly not. But the bother is a fellow doesn't know what to do.\"\n\"You've heard of young Mr. Goldsheiner, haven't you?\" suggested Marie. \"He married Lady Julia Start last winter in Switzerland, and now they've got a house close to Albert Gate.\"\n\"How jolly! He is awfully rich, isn't he?\"\n\"Not half so rich as papa. They did all they could to prevent her going, but she met him down at Folkestone. Didon says that nothing was easier.\"\n\"Oh; ah. Didon knows all about it.\"\n\"For 50, Didon would arrange it all.\"\n\"And would you come to Folkestone?\"\n\"I think that would be stupid, because Lady Julia did that. I wouldn't mind going to New York. And then, perhaps, we might - get married, you know, on board ship. That's what Didon thinks.\"\n\"And would Didon go too?\"\n\"She could go as my aunt. I should go as a French girl. And you could call yourself Smith, and be an American. We wouldn't go together, but we'd get on board just at the last moment. If they wouldn't marry us on board, they would at New York. The Adriatic - that's a White Star boat - goes from Liverpool on Thursday week at noon. There's an early train we could get. You had better go and sleep at Liverpool, and take no notice of us till we meet on board. We could be back in a month - and then papa would be obliged to make the best of it.\"\nSir Felix felt that the young lady had it all at her fingers' ends. But Thursday week was very near, and the whole thing was taking uncomfortably defined proportions. Where was he to get funds to do this? And the idea of starting to New York with Melmotte's daughter, immediately after he had written to Melmotte renouncing the girl, frightened him. Now was the time come when he might make himself, or utterly mar himself.\n\"It's deuced important,\" he said with a groan. \"If you're wrong about the money, and he shouldn't come round, where would we be then?\"\n\"Nothing venture, nothing have,\" said the heiress.\n\"That's all very well; but one might venture everything and get nothing after all.\"\n\"You'd get me,\" said Marie with a pout.\n\"Yes - and I'm awfully fond of you, of course. But-\"\n\"Very well; if that's your love,\" she said, turning away.\nSir Felix gave a great sigh. \"I'll venture it.\"\n\"Oh, Felix, how grand it will be!\"\n\"There's a great deal to do, you know. I don't know whether it can be Thursday week.\"\n\"I shall be afraid of Didon if it's delayed long.\"\n\"There's the money to get, and all that.\"\n\"I can get some money. Mamma has money in the house.\"\n\"How much?\" asked the baronet eagerly.\n\"A hundred pounds; perhaps two hundred.\"\n\"That would help, certainly. I must go to your father for money. Won't that be a sell? To get it from him, to take you away!\"\nIt was decided that they were to go to New York, on Thursday week if possible. Didon was to pack up the clothes. Didon would be paid 50; and as one of the men must know about it, and help smuggle the trunks out, he was to have 10. Sir Felix really had no need to think about anything.\n\"And now,\" said Marie, \"there's Didon. You leave through that gate, and we'll get out on the other side.\" Marie Melmotte was certainly a clever girl.",
        "paragraph_chars": [
            [
                0,
                521
            ],
            [
                521,
                757
            ],
            [
                757,
                907
            ],
            [
                907,
                1117
            ],
            [
                1117,
                1245
            ],
            [
                1245,
                1563
            ],
            [
                1563,
                1700
            ],
            [
                1700,
                1868
            ],
            [
                1868,
                1908
            ],
            [
                1908,
                2083
            ],
            [
                2083,
                2153
            ],
            [
                2153,
                2212
            ],
            [
                2212,
                2306
            ],
            [
                2306,
                2392
            ],
            [
                2392,
                2655
            ],
            [
                2655,
                2994
            ],
            [
                2994,
                3241
            ],
            [
                3241,
                3292
            ],
            [
                3292,
                3314
            ],
            [
                3314,
                3451
            ],
            [
                3451,
                3573
            ],
            [
                3573,
                3737
            ],
            [
                3737,
                3797
            ],
            [
                3797,
                3840
            ],
            [
                3840,
                3867
            ],
            [
                3867,
                3943
            ],
            [
                3943,
                4122
            ],
            [
                4122,
                4165
            ],
            [
                4165,
                4311
            ],
            [
                4311,
                4347
            ],
            [
                4347,
                4385
            ],
            [
                4385,
                4421
            ],
            [
                4421,
                4611
            ],
            [
                4611,
                4637
            ],
            [
                4637,
                5181
            ],
            [
                5181,
                5605
            ],
            [
                5605,
                5740
            ],
            [
                5740,
                5791
            ],
            [
                5791,
                5875
            ],
            [
                5875,
                5915
            ],
            [
                5915,
                5968
            ],
            [
                5968,
                6026
            ],
            [
                6026,
                6074
            ],
            [
                6074,
                6109
            ],
            [
                6109,
                6195
            ],
            [
                6195,
                6246
            ],
            [
                6246,
                6288
            ],
            [
                6288,
                6342
            ],
            [
                6342,
                6381
            ],
            [
                6381,
                6422
            ],
            [
                6422,
                6548
            ],
            [
                6548,
                6833
            ],
            [
                6833,
                6982
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                373
            ],
            [
                373,
                464
            ],
            [
                464,
                521
            ],
            [
                521,
                641
            ],
            [
                641,
                757
            ],
            [
                757,
                907
            ],
            [
                907,
                1037
            ],
            [
                1037,
                1117
            ],
            [
                1117,
                1171
            ],
            [
                1171,
                1245
            ],
            [
                1245,
                1383
            ],
            [
                1383,
                1459
            ],
            [
                1459,
                1563
            ],
            [
                1563,
                1668
            ],
            [
                1668,
                1700
            ],
            [
                1700,
                1752
            ],
            [
                1752,
                1784
            ],
            [
                1784,
                1868
            ],
            [
                1868,
                1908
            ],
            [
                1908,
                1921
            ],
            [
                1921,
                1949
            ],
            [
                1949,
                2035
            ],
            [
                2035,
                2083
            ],
            [
                2083,
                2153
            ],
            [
                2153,
                2166
            ],
            [
                2166,
                2175
            ],
            [
                2175,
                2212
            ],
            [
                2212,
                2251
            ],
            [
                2251,
                2306
            ],
            [
                2306,
                2392
            ],
            [
                2392,
                2409
            ],
            [
                2409,
                2504
            ],
            [
                2504,
                2601
            ],
            [
                2601,
                2655
            ],
            [
                2655,
                2682
            ],
            [
                2682,
                2794
            ],
            [
                2794,
                2862
            ],
            [
                2862,
                2908
            ],
            [
                2908,
                2994
            ],
            [
                2994,
                3186
            ],
            [
                3186,
                3241
            ],
            [
                3241,
                3292
            ],
            [
                3292,
                3314
            ],
            [
                3314,
                3331
            ],
            [
                3331,
                3401
            ],
            [
                3401,
                3451
            ],
            [
                3451,
                3473
            ],
            [
                3473,
                3493
            ],
            [
                3493,
                3536
            ],
            [
                3536,
                3573
            ],
            [
                3573,
                3585
            ],
            [
                3585,
                3666
            ],
            [
                3666,
                3737
            ],
            [
                3737,
                3761
            ],
            [
                3761,
                3797
            ],
            [
                3797,
                3840
            ],
            [
                3840,
                3867
            ],
            [
                3867,
                3890
            ],
            [
                3890,
                3943
            ],
            [
                3943,
                3997
            ],
            [
                3997,
                4014
            ],
            [
                4014,
                4122
            ],
            [
                4122,
                4134
            ],
            [
                4134,
                4165
            ],
            [
                4165,
                4192
            ],
            [
                4192,
                4274
            ],
            [
                4274,
                4311
            ],
            [
                4311,
                4320
            ],
            [
                4320,
                4347
            ],
            [
                4347,
                4385
            ],
            [
                4385,
                4421
            ],
            [
                4421,
                4481
            ],
            [
                4481,
                4516
            ],
            [
                4516,
                4584
            ],
            [
                4584,
                4611
            ],
            [
                4611,
                4637
            ],
            [
                4637,
                4663
            ],
            [
                4663,
                4693
            ],
            [
                4693,
                4748
            ],
            [
                4748,
                4820
            ],
            [
                4820,
                4880
            ],
            [
                4880,
                4968
            ],
            [
                4968,
                5005
            ],
            [
                5005,
                5095
            ],
            [
                5095,
                5181
            ],
            [
                5181,
                5249
            ],
            [
                5249,
                5348
            ],
            [
                5348,
                5386
            ],
            [
                5386,
                5531
            ],
            [
                5531,
                5605
            ],
            [
                5605,
                5652
            ],
            [
                5652,
                5740
            ],
            [
                5740,
                5791
            ],
            [
                5791,
                5875
            ],
            [
                5875,
                5915
            ],
            [
                5915,
                5962
            ],
            [
                5962,
                5968
            ],
            [
                5968,
                6026
            ],
            [
                6026,
                6055
            ],
            [
                6055,
                6074
            ],
            [
                6074,
                6109
            ],
            [
                6109,
                6148
            ],
            [
                6148,
                6195
            ],
            [
                6195,
                6246
            ],
            [
                6246,
                6288
            ],
            [
                6288,
                6311
            ],
            [
                6311,
                6342
            ],
            [
                6342,
                6354
            ],
            [
                6354,
                6381
            ],
            [
                6381,
                6422
            ],
            [
                6422,
                6451
            ],
            [
                6451,
                6487
            ],
            [
                6487,
                6509
            ],
            [
                6509,
                6548
            ],
            [
                6548,
                6627
            ],
            [
                6627,
                6661
            ],
            [
                6661,
                6779
            ],
            [
                6779,
                6833
            ],
            [
                6833,
                6872
            ],
            [
                6872,
                6939
            ],
            [
                6939,
                6982
            ]
        ],
        "overlap_chars": [
            [
                10,
                27
            ],
            [
                28,
                31
            ],
            [
                32,
                78
            ],
            [
                87,
                108
            ],
            [
                108,
                161
            ],
            [
                161,
                166
            ],
            [
                167,
                170
            ],
            [
                171,
                238
            ],
            [
                239,
                246
            ],
            [
                247,
                250
            ],
            [
                251,
                314
            ],
            [
                315,
                318
            ],
            [
                319,
                326
            ],
            [
                327,
                329
            ],
            [
                330,
                373
            ],
            [
                373,
                381
            ],
            [
                382,
                464
            ],
            [
                464,
                486
            ],
            [
                487,
                520
            ],
            [
                534,
                535
            ],
            [
                536,
                639
            ],
            [
                639,
                641
            ],
            [
                641,
                648
            ],
            [
                648,
                649
            ],
            [
                653,
                657
            ],
            [
                657,
                658
            ],
            [
                659,
                686
            ],
            [
                687,
                731
            ],
            [
                732,
                755
            ],
            [
                755,
                756
            ],
            [
                757,
                774
            ],
            [
                791,
                820
            ],
            [
                820,
                823
            ],
            [
                824,
                865
            ],
            [
                866,
                888
            ],
            [
                889,
                904
            ],
            [
                904,
                906
            ],
            [
                907,
                930
            ],
            [
                931,
                942
            ],
            [
                942,
                1009
            ],
            [
                1013,
                1017
            ],
            [
                1018,
                1037
            ],
            [
                1037,
                1040
            ],
            [
                1041,
                1050
            ],
            [
                1051,
                1057
            ],
            [
                1057,
                1116
            ],
            [
                1117,
                1171
            ],
            [
                1171,
                1229
            ],
            [
                1233,
                1244
            ],
            [
                1245,
                1262
            ],
            [
                1262,
                1263
            ],
            [
                1264,
                1280
            ],
            [
                1281,
                1284
            ],
            [
                1291,
                1299
            ],
            [
                1300,
                1318
            ],
            [
                1319,
                1338
            ],
            [
                1338,
                1339
            ],
            [
                1340,
                1357
            ],
            [
                1358,
                1360
            ],
            [
                1361,
                1364
            ],
            [
                1374,
                1381
            ],
            [
                1383,
                1392
            ],
            [
                1393,
                1398
            ],
            [
                1400,
                1416
            ],
            [
                1416,
                1443
            ],
            [
                1454,
                1459
            ],
            [
                1459,
                1468
            ],
            [
                1469,
                1496
            ],
            [
                1497,
                1504
            ],
            [
                1505,
                1517
            ],
            [
                1518,
                1524
            ],
            [
                1525,
                1562
            ],
            [
                1563,
                1636
            ],
            [
                1637,
                1668
            ],
            [
                1668,
                1677
            ],
            [
                1678,
                1681
            ],
            [
                1682,
                1699
            ],
            [
                1700,
                1736
            ],
            [
                1737,
                1750
            ],
            [
                1752,
                1753
            ],
            [
                1754,
                1758
            ],
            [
                1759,
                1765
            ],
            [
                1766,
                1784
            ],
            [
                1784,
                1802
            ],
            [
                1803,
                1868
            ],
            [
                1868,
                1898
            ],
            [
                1905,
                1908
            ],
            [
                1908,
                1921
            ],
            [
                1921,
                1949
            ],
            [
                1949,
                2035
            ],
            [
                2035,
                2083
            ],
            [
                2083,
                2153
            ],
            [
                2153,
                2166
            ],
            [
                2166,
                2175
            ],
            [
                2175,
                2211
            ],
            [
                2212,
                2231
            ],
            [
                2232,
                2251
            ],
            [
                2251,
                2305
            ],
            [
                2306,
                2335
            ],
            [
                2336,
                2377
            ],
            [
                2392,
                2409
            ],
            [
                2409,
                2431
            ],
            [
                2432,
                2504
            ],
            [
                2504,
                2584
            ],
            [
                2585,
                2601
            ],
            [
                2601,
                2622
            ],
            [
                2623,
                2627
            ],
            [
                2628,
                2654
            ],
            [
                2655,
                2660
            ],
            [
                2661,
                2665
            ],
            [
                2670,
                2680
            ],
            [
                2680,
                2682
            ],
            [
                2685,
                2687
            ],
            [
                2688,
                2692
            ],
            [
                2693,
                2794
            ],
            [
                2794,
                2860
            ],
            [
                2862,
                2906
            ],
            [
                2908,
                2993
            ],
            [
                2994,
                3186
            ],
            [
                3186,
                3203
            ],
            [
                3208,
                3240
            ],
            [
                3241,
                3248
            ],
            [
                3252,
                3280
            ],
            [
                3292,
                3314
            ],
            [
                3314,
                3331
            ],
            [
                3331,
                3367
            ],
            [
                3368,
                3401
            ],
            [
                3401,
                3418
            ],
            [
                3428,
                3438
            ],
            [
                3442,
                3451
            ],
            [
                3452,
                3471
            ],
            [
                3471,
                3473
            ],
            [
                3473,
                3483
            ],
            [
                3489,
                3491
            ],
            [
                3491,
                3493
            ],
            [
                3493,
                3536
            ],
            [
                3536,
                3573
            ],
            [
                3573,
                3585
            ],
            [
                3585,
                3666
            ],
            [
                3666,
                3737
            ],
            [
                3737,
                3761
            ],
            [
                3761,
                3797
            ],
            [
                3797,
                3840
            ],
            [
                3840,
                3851
            ],
            [
                3859,
                3867
            ],
            [
                3867,
                3873
            ],
            [
                3873,
                3890
            ],
            [
                3890,
                3943
            ],
            [
                3943,
                3997
            ],
            [
                3997,
                4013
            ],
            [
                4014,
                4017
            ],
            [
                4026,
                4042
            ],
            [
                4043,
                4054
            ],
            [
                4055,
                4057
            ],
            [
                4058,
                4122
            ],
            [
                4122,
                4132
            ],
            [
                4132,
                4134
            ],
            [
                4134,
                4165
            ],
            [
                4165,
                4166
            ],
            [
                4170,
                4192
            ],
            [
                4192,
                4272
            ],
            [
                4272,
                4274
            ],
            [
                4274,
                4311
            ],
            [
                4311,
                4315
            ],
            [
                4316,
                4320
            ],
            [
                4320,
                4347
            ],
            [
                4348,
                4351
            ],
            [
                4352,
                4354
            ],
            [
                4354,
                4355
            ],
            [
                4362,
                4367
            ],
            [
                4368,
                4385
            ],
            [
                4385,
                4421
            ],
            [
                4421,
                4481
            ],
            [
                4481,
                4505
            ],
            [
                4506,
                4516
            ],
            [
                4516,
                4543
            ],
            [
                4546,
                4549
            ],
            [
                4550,
                4577
            ],
            [
                4582,
                4584
            ],
            [
                4584,
                4611
            ],
            [
                4611,
                4637
            ],
            [
                4638,
                4661
            ],
            [
                4661,
                4663
            ],
            [
                4663,
                4693
            ],
            [
                4693,
                4748
            ],
            [
                4748,
                4820
            ],
            [
                4820,
                4836
            ],
            [
                4843,
                4878
            ],
            [
                4880,
                4883
            ],
            [
                4884,
                4892
            ],
            [
                4895,
                4919
            ],
            [
                4922,
                4926
            ],
            [
                4942,
                4968
            ],
            [
                4968,
                4990
            ],
            [
                5003,
                5005
            ],
            [
                5005,
                5071
            ],
            [
                5072,
                5095
            ],
            [
                5095,
                5122
            ],
            [
                5125,
                5181
            ],
            [
                5181,
                5190
            ],
            [
                5191,
                5200
            ],
            [
                5201,
                5247
            ],
            [
                5247,
                5249
            ],
            [
                5249,
                5348
            ],
            [
                5348,
                5373
            ],
            [
                5374,
                5376
            ],
            [
                5377,
                5384
            ],
            [
                5384,
                5386
            ],
            [
                5386,
                5389
            ],
            [
                5394,
                5447
            ],
            [
                5447,
                5448
            ],
            [
                5449,
                5530
            ],
            [
                5531,
                5542
            ],
            [
                5558,
                5604
            ],
            [
                5605,
                5637
            ],
            [
                5638,
                5651
            ],
            [
                5652,
                5720
            ],
            [
                5727,
                5740
            ],
            [
                5740,
                5791
            ],
            [
                5791,
                5875
            ],
            [
                5875,
                5915
            ],
            [
                5915,
                5919
            ],
            [
                5922,
                5949
            ],
            [
                5951,
                5960
            ],
            [
                5960,
                5961
            ],
            [
                5962,
                5965
            ],
            [
                5968,
                5978
            ],
            [
                5978,
                5979
            ],
            [
                5980,
                6001
            ],
            [
                6006,
                6010
            ],
            [
                6010,
                6019
            ],
            [
                6024,
                6026
            ],
            [
                6026,
                6053
            ],
            [
                6053,
                6055
            ],
            [
                6055,
                6074
            ],
            [
                6074,
                6109
            ],
            [
                6109,
                6148
            ],
            [
                6148,
                6194
            ],
            [
                6195,
                6246
            ],
            [
                6246,
                6288
            ],
            [
                6288,
                6311
            ],
            [
                6311,
                6342
            ],
            [
                6342,
                6354
            ],
            [
                6354,
                6381
            ],
            [
                6381,
                6398
            ],
            [
                6398,
                6399
            ],
            [
                6400,
                6422
            ],
            [
                6422,
                6438
            ],
            [
                6440,
                6451
            ],
            [
                6451,
                6487
            ],
            [
                6487,
                6509
            ],
            [
                6509,
                6548
            ],
            [
                6548,
                6599
            ],
            [
                6600,
                6625
            ],
            [
                6625,
                6627
            ],
            [
                6627,
                6659
            ],
            [
                6659,
                6661
            ],
            [
                6661,
                6666
            ],
            [
                6681,
                6683
            ],
            [
                6683,
                6730
            ],
            [
                6744,
                6754
            ],
            [
                6755,
                6758
            ],
            [
                6758,
                6779
            ],
            [
                6783,
                6832
            ],
            [
                6833,
                6872
            ],
            [
                6872,
                6875
            ],
            [
                6895,
                6899
            ],
            [
                6899,
                6900
            ],
            [
                6905,
                6939
            ],
            [
                6939,
                6982
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                373
            ],
            [
                373,
                464
            ],
            [
                464,
                521
            ],
            [
                521,
                521
            ],
            [
                521,
                641
            ],
            [
                641,
                757
            ],
            [
                757,
                907
            ],
            [
                907,
                1037
            ],
            [
                1037,
                1117
            ],
            [
                1117,
                1171
            ],
            [
                1171,
                1245
            ],
            [
                1245,
                1245
            ],
            [
                1245,
                1245
            ],
            [
                1245,
                1459
            ],
            [
                1459,
                1563
            ],
            [
                1563,
                1668
            ],
            [
                1668,
                1700
            ],
            [
                1700,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1784
            ],
            [
                1784,
                1868
            ],
            [
                1868,
                1908
            ],
            [
                1908,
                1921
            ],
            [
                1921,
                1949
            ],
            [
                1949,
                1949
            ],
            [
                1949,
                2035
            ],
            [
                2035,
                2083
            ],
            [
                2083,
                2153
            ],
            [
                2153,
                2166
            ],
            [
                2166,
                2175
            ],
            [
                2175,
                2175
            ],
            [
                2175,
                2175
            ],
            [
                2175,
                2175
            ],
            [
                2175,
                2175
            ],
            [
                2175,
                2212
            ],
            [
                2212,
                2251
            ],
            [
                2251,
                2306
            ],
            [
                2306,
                2392
            ],
            [
                2392,
                2392
            ],
            [
                2392,
                2409
            ],
            [
                2409,
                2504
            ],
            [
                2504,
                2601
            ],
            [
                2601,
                2655
            ],
            [
                2655,
                2682
            ],
            [
                2682,
                2682
            ],
            [
                2682,
                2682
            ],
            [
                2682,
                2794
            ],
            [
                2794,
                2862
            ],
            [
                2862,
                2908
            ],
            [
                2908,
                2908
            ],
            [
                2908,
                2994
            ],
            [
                2994,
                3186
            ],
            [
                3186,
                3241
            ],
            [
                3241,
                3241
            ],
            [
                3241,
                3241
            ],
            [
                3241,
                3292
            ],
            [
                3292,
                3314
            ],
            [
                3314,
                3331
            ],
            [
                3331,
                3401
            ],
            [
                3401,
                3451
            ],
            [
                3451,
                3451
            ],
            [
                3451,
                3473
            ],
            [
                3473,
                3493
            ],
            [
                3493,
                3493
            ],
            [
                3493,
                3536
            ],
            [
                3536,
                3573
            ],
            [
                3573,
                3585
            ],
            [
                3585,
                3666
            ],
            [
                3666,
                3737
            ],
            [
                3737,
                3761
            ],
            [
                3761,
                3797
            ],
            [
                3797,
                3840
            ],
            [
                3840,
                3867
            ],
            [
                3867,
                3890
            ],
            [
                3890,
                3943
            ],
            [
                3943,
                3997
            ],
            [
                3997,
                4014
            ],
            [
                4014,
                4122
            ],
            [
                4122,
                4134
            ],
            [
                4134,
                4165
            ],
            [
                4165,
                4192
            ],
            [
                4192,
                4274
            ],
            [
                4274,
                4311
            ],
            [
                4311,
                4320
            ],
            [
                4320,
                4347
            ],
            [
                4347,
                4347
            ],
            [
                4347,
                4347
            ],
            [
                4347,
                4347
            ],
            [
                4347,
                4347
            ],
            [
                4347,
                4385
            ],
            [
                4385,
                4421
            ],
            [
                4421,
                4481
            ],
            [
                4481,
                4481
            ],
            [
                4481,
                4516
            ],
            [
                4516,
                4584
            ],
            [
                4584,
                4611
            ],
            [
                4611,
                4637
            ],
            [
                4637,
                4637
            ],
            [
                4637,
                4663
            ],
            [
                4663,
                4693
            ],
            [
                4693,
                4748
            ],
            [
                4748,
                4820
            ],
            [
                4820,
                4880
            ],
            [
                4880,
                4880
            ],
            [
                4880,
                4880
            ],
            [
                4880,
                4968
            ],
            [
                4968,
                5005
            ],
            [
                5005,
                5095
            ],
            [
                5095,
                5181
            ],
            [
                5181,
                5249
            ],
            [
                5249,
                5348
            ],
            [
                5348,
                5386
            ],
            [
                5386,
                5386
            ],
            [
                5386,
                5386
            ],
            [
                5386,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5605
            ],
            [
                5605,
                5652
            ],
            [
                5652,
                5652
            ],
            [
                5652,
                5740
            ],
            [
                5740,
                5791
            ],
            [
                5791,
                5875
            ],
            [
                5875,
                5915
            ],
            [
                5915,
                5962
            ],
            [
                5962,
                5968
            ],
            [
                5968,
                6026
            ],
            [
                6026,
                6055
            ],
            [
                6055,
                6074
            ],
            [
                6074,
                6109
            ],
            [
                6109,
                6148
            ],
            [
                6148,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6246
            ],
            [
                6246,
                6288
            ],
            [
                6288,
                6311
            ],
            [
                6311,
                6342
            ],
            [
                6342,
                6354
            ],
            [
                6354,
                6381
            ],
            [
                6381,
                6422
            ],
            [
                6422,
                6451
            ],
            [
                6451,
                6487
            ],
            [
                6487,
                6509
            ],
            [
                6509,
                6548
            ],
            [
                6548,
                6627
            ],
            [
                6627,
                6661
            ],
            [
                6661,
                6779
            ],
            [
                6779,
                6833
            ],
            [
                6833,
                6872
            ],
            [
                6872,
                6872
            ],
            [
                6872,
                6872
            ],
            [
                6872,
                6939
            ],
            [
                6939,
                6982
            ]
        ]
    }
}