{
    "original": {
        "text": "The statement made by Ruby as to her connection with Mrs. Pipkin was quite true. Ruby's father had married a Pipkin whose brother had died leaving a widow behind him at Islington. The old man at Sheep's Acre farm had greatly resented this marriage, had never spoken to his daughter-in-law,--or to his son after the marriage, and had steeled himself against the whole Pipkin race. When he undertook the charge of Ruby he had made it matter of agreement that she should have no intercourse with the Pipkins. This agreement Ruby had broken, corresponding on the sly with her uncle's widow at Islington. When therefore she ran away from Suffolk she did the best she could with herself in going to her aunt's house. Mrs. Pipkin was a poor woman, and could not offer a permanent home to Ruby; but she was good-natured, and came to terms. Ruby was to be allowed to stay at any rate for a month, and was to work in the house for her bread. But she made it a part of her bargain that she should be allowed to go out occasionally. Mrs. Pipkin immediately asked after a lover. \"I'm all right,\" said Ruby. If the lover was what he ought to be, had he not better come and see her? This was Mrs. Pipkin's suggestion. Mrs. Pipkin thought that scandal might in this way be avoided. \"That's as it may be, by-and-by,\" said Ruby. Then she told all the story of John Crumb:--how she hated John Crumb; how resolved she was that nothing should make her marry John Crumb. And she gave her own account of that night on which John Crumb and Mr. Mixet ate their supper at the farm, and of the manner in which her grandfather had treated her because she would not have John Crumb. Mrs. Pipkin was a respectable woman in her way, always preferring respectable lodgers if she could get them;--but bound to live. She gave Ruby very good advice. Of course if she was \"dead-set\" against John Crumb, that was one thing! But then there was nothing a young woman should look to so much as a decent house over her head,--and victuals. \"What's all the love in the world, Ruby, if a man can't do for you?\" Ruby declared that she knew somebody who could do for her, and could do very well for her. She knew what she was about, and wasn't going to be put off it. Mrs. Pipkin's morals were good wearing morals, but she was not strait-laced. If Ruby chose to manage in her own way about her lover she must. Mrs. Pipkin had an idea that young women in these days did have, and would have, and must have more liberty than was allowed when she was young. The world was being changed very fast. Mrs. Pipkin knew that as well as others. And therefore when Ruby went to the theatre once and again,--by herself as far as Mrs. Pipkin knew, but probably in company with her lover,--and did not get home till past midnight, Mrs. Pipkin said very little about it, attributing such novel circumstances to the altered condition of her country. She had not been allowed to go to the theatre with a young man when she had been a girl,--but that had been in the earlier days of Queen Victoria, fifteen years ago, before the new dispensation had come. Ruby had never yet told the name of her lover to Mrs. Pipkin, having answered all inquiries by saying that she was all right. Sir Felix's name had never even been mentioned in Islington till Paul Montague had mentioned it. She had been managing her own affairs after her own fashion,--not altogether with satisfaction, but still without interruption; but now she knew that interference would come. Mr. Montague had found her out, and had told her grandfather's landlord. The Squire would be after her, and then John Crumb would come, accompanied of course by Mr. Mixet,--and after that, as she said to herself on retiring to the couch which she shared with two little Pipkins, \"the fat would be in the fire.\"\n\"Who do you think was at our place yesterday?\" said Ruby one evening to her lover. They were sitting together at a music-hall,--half music-hall, half theatre, which pleasantly combined the allurements of the gin-palace, the theatre, and the ball-room, trenching hard on those of other places. Sir Felix was smoking, dressed, as he himself called it, \"incognito,\" with a Tom-and-Jerry hat, and a blue silk cravat, and a green coat. Ruby thought it was charming. Felix entertained an idea that were his West End friends to see him in this attire they would not know him. He was smoking, and had before him a glass of hot brandy and water, which was common to himself and Ruby. He was enjoying life. Poor Ruby! She was half-ashamed of herself, half-frightened, and yet supported by a feeling that it was a grand thing to have got rid of restraints, and be able to be with her young man. Why not? The Miss Longestaffes were allowed to sit and dance and walk about with their young men,--when they had any. Why was she to be given up to a great mass of stupid dust like John Crumb, without seeing anything of the world? But yet as she sat sipping her lover's brandy and water between eleven and twelve at the music-hall in the City Road, she was not altogether comfortable. She saw things which she did not like to see. And she heard things which she did not like to hear. And her lover, though he was beautiful,--oh, so beautiful!--was not all that a lover should be. She was still a little afraid of him, and did not dare as yet to ask him for the promise which she expected him to make to her. Her mind was set upon--marriage, but the word had hardly passed between them. To have his arm round her waist was heaven to her! Could it be possible that he and John Crumb were of the same order of human beings? But how was this to go on? Even Mrs. Pipkin made disagreeable allusions, and she could not live always with Mrs. Pipkin, coming out at nights to drink brandy and water and hear music with Sir Felix Carbury. She was glad therefore to take the first opportunity of telling her lover that something was going to happen. \"Who do you suppose was at our place yesterday?\"\nSir Felix changed colour, thinking of Marie Melmotte, thinking that perhaps some emissary from Marie Melmotte had been there; perhaps Didon herself. He was amusing himself during these last evenings of his in London; but the business of his life was about to take him to New York. That project was still being elaborated. He had had an interview with Didon, and nothing was wanting but the money. Didon had heard of the funds which had been intrusted by him to Melmotte, and had been very urgent with him to recover them. Therefore, though his body was not unfrequently present, late in the night, at the City Road Music-Hall, his mind was ever in Grosvenor Square. \"Who was it, Ruby?\"\n\"A friend of the Squire's, a Mr. Montague. I used to see him about in Bungay and Beccles.\"\n\"Paul Montague!\"\n\"Do you know him, Felix?\"\n\"Well;--rather. He's a member of our club, and I see him constantly in the city--and I know him at home.\"\n\"Is he nice?\"\n\"Well;--that depends on what you call nice. He's a prig of a fellow.\"\n\"He's got a lady friend where I live.\"\n\"The devil he has!\" Sir Felix of course had heard of Roger Carbury's suit to his sister, and of the opposition to this suit on the part of Hetta, which was supposed to have been occasioned by her preference for Paul Montague. \"Who is she, Ruby?\"\n\"Well;--she's a Mrs. Hurtle. Such a stunning woman! Aunt says she's an American. She's got lots of money.\"\n\"Is Montague going to marry her?\"\n\"Oh dear yes. It's all arranged. Mr. Montague comes quite regular to see her;--not so regular as he ought, though. When gentlemen are fixed as they're to be married, they never are regular afterwards. I wonder whether it'll be the same with you?\"\n\"Wasn't John Crumb regular, Ruby?\"\n\"Bother John Crumb! That wasn't none of my doings. Oh, he'd been regular enough, if I'd let him; he'd been like clockwork,--only the slowest clock out. But Mr. Montague has been and told the Squire as he saw me. He told me so himself. The Squire's coming about John Crumb. I know that. What am I to tell him, Felix?\"\n\"Tell him to mind his own business. He can't do anything to you.\"\n\"No;--he can't do nothing. I ain't done nothing wrong, and he can't send for the police to have me took back to Sheep's Acre. But he can talk,--and he can look. I ain't one of those, Felix, as don't mind about their characters,--so don't you think it. Shall I tell him as I'm with you?\"\n\"Gracious goodness, no! What would you say that for?\"\n\"I didn't know. I must say something.\"\n\"Tell him you're nothing to him.\"\n\"But aunt will be letting on about my being out late o'nights; I know she will. And who am I with? He'll be asking that.\"\n\"Your aunt does not know?\"\n\"No;--I've told nobody yet. But it won't do to go on like that, you know,--will it? You don't want it to go on always like that;--do you?\"\n\"It's very jolly, I think.\"\n\"It ain't jolly for me. Of course, Felix, I like to be with you. That's jolly. But I have to mind them brats all the day, and to be doing the bedrooms. And that's not the worst of it.\"\n\"What is the worst of it?\"\n\"I'm pretty nigh ashamed of myself. Yes, I am.\" And now Ruby burst out into tears. \"Because I wouldn't have John Crumb, I didn't mean to be a bad girl. Nor yet I won't. But what'll I do, if everybody turns again me? Aunt won't go on for ever in this way. She said last night that--\"\n\"Bother what she says!\" Felix was not at all anxious to hear what aunt Pipkin might have to say upon such an occasion.\n\"She's right too. Of course she knows there's somebody. She ain't such a fool as to think that I'm out at these hours to sing psalms with a lot of young women. She says that whoever it is ought to speak out his mind. There;--that's what she says. And she's right. A girl has to mind herself, though she's ever so fond of a young man.\"\nSir Felix sucked his cigar and then took a long drink of brandy and water. Having emptied the beaker before him, he rapped for the waiter and called for another. He intended to avoid the necessity of making any direct reply to Ruby's importunities. He was going to New York very shortly, and looked on his journey thither as an horizon in his future beyond which it was unnecessary to speculate as to any farther distance. He had not troubled himself to think how it might be with Ruby when he was gone. He had not even considered whether he would or would not tell her that he was going, before he started. It was not his fault that she had come up to London. She was an \"awfully jolly girl,\" and he liked the feeling of the intrigue better perhaps than the girl herself. But he assured himself that he wasn't going to give himself any \"d----d trouble.\" The idea of John Crumb coming up to London in his wrath had never occurred to him,--or he would probably have hurried on his journey to New York instead of delaying it, as he was doing now. \"Let's go in and have a dance,\" he said.\nRuby was very fond of dancing,--perhaps liked it better than anything in the world. It was heaven to her to be spinning round the big room with her lover's arm tight round her waist, with one hand in his and her other hanging over his back. She loved the music, and loved the motion. Her ear was good, and her strength was great, and she never lacked breath. She could spin along and dance a whole room down, and feel at the time that the world could have nothing to give better worth having than that;--and such moments were too precious to be lost. She went and danced, resolving as she did so that she would have some answer to her question before she left her lover on that night.\n\"And now I must go,\" she said at last. \"You'll see me as far as the Angel, won't you?\" Of course he was ready to see her as far as the Angel. \"What am I to say to the Squire?\"\n\"Say nothing.\"\n\"And what am I to say to aunt?\"\n\"Say to her? Just say what you have said all along.\"\n\"I've said nothing all along,--just to oblige you, Felix. I must say something. A girl has got herself to mind. What have you got to say to me, Felix?\"\nHe was silent for about a minute, meditating his answer. \"If you bother me I shall cut it, you know.\"\n\"Cut it!\"\n\"Yes;--cut it. Can't you wait till I am ready to say something?\"\n\"Waiting will be the ruin o' me, if I wait much longer. Where am I to go, if Mrs. Pipkin won't have me no more?\"\n\"I'll find a place for you.\"\n\"You find a place! No; that won't do. I've told you all that before. I'd sooner go into service, or--\"\n\"Go back to John Crumb.\"\n\"John Crumb has more respect for me nor you. He'd make me his wife to-morrow, and only be too happy.\"\n\"I didn't tell you to come away from him,\" said Sir Felix.\n\"Yes, you did. You told me as I was to come up to London when I saw you at Sheepstone Beeches;--didn't you? And you told me you loved me;--didn't you? And that if I wanted anything you'd get it done for me;--didn't you?\"\n\"So I will. What do you want? I can give you a couple of sovereigns, if that's what it is.\"\n\"No it isn't;--and I won't have your money. I'd sooner work my fingers off. I want you to say whether you mean to marry me. There!\"\nAs to the additional lie which Sir Felix might now have told, that would have been nothing to him. He was going to New York, and would be out of the way of any trouble; and he thought that lies of that kind to young women never went for anything. Young women, he thought, didn't believe them, but liked to be able to believe afterwards that they had been deceived. It wasn't the lie that stuck in his throat, but the fact that he was a baronet. It was in his estimation \"confounded impudence\" on the part of Ruby Ruggles to ask to be his wife. He did not care for the lie, but he did not like to seem to lower himself by telling such a lie as that at her dictation. \"Marry, Ruby! No, I don't ever mean to marry. It's the greatest bore out. I know a trick worth two of that.\"\nShe stopped in the street and looked at him. This was a state of things of which she had never dreamed. She could imagine that a man should wish to put it off, but that he should have the face to declare to his young woman that he never meant to marry at all, was a thing that she could not understand. What business had such a man to go after any young woman? \"And what do you mean that I'm to do, Sir Felix?\" she said.\n\"Just go easy, and not make yourself a bother.\"\n\"Not make myself a bother! Oh, but I will; I will. I'm to be carrying on with you, and nothing to come of it; but for you to tell me that you don't mean to marry, never at all! Never?\"\n\"Don't you see lots of old bachelors about, Ruby?\"\n\"Of course I does. There's the Squire. But he don't come asking girls to keep him company.\"\n\"That's more than you know, Ruby.\"\n\"If he did he'd marry her out of hand,--because he's a gentleman. That's what he is, every inch of him. He never said a word to a girl,--not to do her any harm, I'm sure,\" and Ruby began to cry. \"You mustn't come no further now, and I'll never see you again--never! I think you're the falsest young man, and the basest, and the lowest-minded that I ever heard tell of. I know there are them as don't keep their words. Things turn up, and they can't. Or they gets to like others better; or there ain't nothing to live on. But for a young man to come after a young woman, and then say, right out, as he never means to marry at all, is the lowest-spirited fellow that ever was. I never read of such a one in none of the books. No, I won't. You go your way, and I'll go mine.\" In her passion she was as good as her word, and escaped from him, running all the way to her aunt's door. There was in her mind a feeling of anger against the man, which she did not herself understand, in that he would incur no risk on her behalf. He would not even make a lover's easy promise, in order that the present hour might be made pleasant. Ruby let herself into her aunt's house, and cried herself to sleep with a child on each side of her.\nOn the next day Roger called. She had begged Mrs. Pipkin to attend the door, and had asked her to declare, should any gentleman ask for Ruby Ruggles, that Ruby Ruggles was out. Mrs. Pipkin had not refused to do so; but, having heard sufficient of Roger Carbury to imagine the cause which might possibly bring him to the house, and having made up her mind that Ruby's present condition of independence was equally unfavourable to the lodging-house and to Ruby herself, she determined that the Squire, if he did come, should see the young lady. When therefore Ruby was called into the little back parlour and found Roger Carbury there, she thought that she had been caught in a trap. She had been very cross all the morning. Though in her rage she had been able on the previous evening to dismiss her titled lover, and to imply that she never meant to see him again, now, when the remembrance of the loss came upon her amidst her daily work,--when she could no longer console herself in her drudgery by thinking of the beautiful things that were in store for her, and by flattering herself that though at this moment she was little better than a maid of all work in a lodging-house, the time was soon coming in which she would bloom forth as a baronet's bride,--now in her solitude she almost regretted the precipitancy of her own conduct. Could it be that she would never see him again;--that she would dance no more in that gilded bright saloon? And might it not be possible that she had pressed him too hard? A baronet of course would not like to be brought to book, as she could bring to book such a one as John Crumb. But yet,--that he should have said never;--that he would never marry! Looking at it in any light, she was very unhappy, and this coming of the Squire did not serve to cure her misery.\nRoger was very kind to her, taking her by the hand, and bidding her sit down, and telling her how glad he was to find that she was comfortably settled with her aunt. \"We were all alarmed, of course, when you went away without telling anybody where you were going.\"\n\"Grandfather 'd been that cruel to me that I couldn't tell him.\"\n\"He wanted you to keep your word to an old friend of yours.\"\n\"To pull me all about by the hairs of my head wasn't the way to make a girl keep her word;--was it, Mr. Carbury? That's what he did, then;--and Sally Hockett, who is there, heard it. I've been good to grandfather, whatever I may have been to John Crumb; and he shouldn't have treated me like that. No girl 'd like to be pulled about the room by the hairs of her head, and she with her things all off, just getting into bed.\"\nThe Squire had no answer to make to this. That old Ruggles should be a violent brute under the influence of gin and water did not surprise him. And the girl, when driven away from her home by such usage, had not done amiss in coming to her aunt. But Roger had already heard a few words from Mrs. Pipkin as to Ruby's late hours, had heard also that there was a lover, and knew very well who that lover was. He also was quite familiar with John Crumb's state of mind. John Crumb was a gallant, loving fellow who might be induced to forgive everything, if Ruby would only go back to him; but would certainly persevere, after some slow fashion of his own, and \"see the matter out,\" as he would say himself, if she did not go back. \"As you found yourself obliged to run away,\" said Roger, \"I'm glad that you should be here; but you don't mean to stay here always?\"\n\"I don't know,\" said Ruby.\n\"You must think of your future life. You don't want to be always your aunt's maid.\"\n\"Oh dear, no.\"\n\"It would be very odd if you did, when you may be the wife of such a man as Mr. Crumb.\"\n\"Oh, Mr. Crumb! Everybody is going on about Mr. Crumb. I don't like Mr. Crumb, and I never will like him.\"\n\"Now look here, Ruby; I have come to speak to you very seriously, and I expect you to hear me. Nobody can make you marry Mr. Crumb, unless you please.\"\n\"Nobody can't, of course, sir.\"\n\"But I fear you have given him up for somebody else, who certainly won't marry you, and who can only mean to ruin you.\"\n\"Nobody won't ruin me,\" said Ruby. \"A girl has to look to herself, and I mean to look to myself.\"\n\"I'm glad to hear you say so, but being out at night with such a one as Sir Felix Carbury is not looking to yourself. That means going to the devil head foremost.\"\n\"I ain't a going to the devil,\" said Ruby, sobbing and blushing.\n\"But you will, if you put yourself into the hands of that young man. He's as bad as bad can be. He's my own cousin, and yet I'm obliged to tell you so. He has no more idea of marrying you than I have; but were he to marry you, he could not support you. He is ruined himself, and would ruin any young woman who trusted him. I'm almost old enough to be your father, and in all my experience I never came across so vile a young man as he is. He would ruin you and cast you from him without a pang of remorse. He has no heart in his bosom;--none.\" Ruby had now given way altogether, and was sobbing with her apron to her eyes in one corner of the room. \"That's what Sir Felix Carbury is,\" said the Squire, standing up so that he might speak with the more energy, and talk her down more thoroughly. \"And if I understand it rightly,\" he continued, \"it is for a vile thing such as he, that you have left a man who is as much above him in character, as the sun is above the earth. You think little of John Crumb because he does not wear a fine coat.\"\n\"I don't care about any man's coat,\" said Ruby; \"but John hasn't ever a word to say, was it ever so.\"\n[Illustration: \"I don't care about any man's coat.\"]\n\"Words to say! what do words matter? He loves you. He loves you after that fashion that he wants to make you happy and respectable, not to make you a bye-word and a disgrace.\" Ruby struggled hard to make some opposition to the suggestion, but found herself to be incapable of speech at the moment. \"He thinks more of you than of himself, and would give you all that he has. What would that other man give you? If you were once married to John Crumb, would any one then pull you by the hairs of your head? Would there be any want then, or any disgrace?\"\n\"There ain't no disgrace, Mr. Carbury.\"\n\"No disgrace in going about at midnight with such a one as Felix Carbury? You are not a fool, and you know that it is disgraceful. If you are not unfit to be an honest man's wife, go back and beg that man's pardon.\"\n\"John Crumb's pardon! No!\"\n\"Oh, Ruby, if you knew how highly I respect that man, and how lowly I think of the other; how I look on the one as a noble fellow, and regard the other as dust beneath my feet, you would perhaps change your mind a little.\"\nHer mind was being changed. His words did have their effect, though the poor girl struggled against the conviction that was borne in upon her. She had never expected to hear any one call John Crumb noble. But she had never respected any one more highly than Squire Carbury, and he said that John Crumb was noble. Amidst all her misery and trouble she still told herself that it was but a dusty, mealy,--and also a dumb nobility.\n\"I'll tell you what will take place,\" continued Roger. \"Mr. Crumb won't put up with this you know.\"\n\"He can't do nothing to me, sir.\"\n\"That's true enough. Unless it be to take you in his arms and press you to his heart, he wants to do nothing to you. Do you think he'd injure you if he could? You don't know what a man's love really means, Ruby. But he could do something to somebody else. How do you think it would be with Felix Carbury, if they two were in a room together and nobody else by?\"\n\"John's mortial strong, Mr. Carbury.\"\n\"If two men have equal pluck, strength isn't much needed. One is a brave man, and the other--a coward. Which do you think is which?\"\n\"He's your own cousin, and I don't know why you should say everything again him.\"\n\"You know I'm telling you the truth. You know it as well as I do myself;--and you're throwing yourself away, and throwing the man who loves you over,--for such a fellow as that! Go back to him, Ruby, and beg his pardon.\"\n\"I never will;--never.\"\n\"I've spoken to Mrs. Pipkin, and while you're here she will see that you don't keep such hours any longer. You tell me that you're not disgraced, and yet you are out at midnight with a young blackguard like that! I've said what I've got to say, and I'm going away. But I'll let your grandfather know.\"\n\"Grandfather don't want me no more.\"\n\"And I'll come again. If you want money to go home, I will let you have it. Take my advice at least in this;--do not see Sir Felix Carbury any more.\" Then he took his leave. If he had failed to impress her with admiration for John Crumb, he had certainly been efficacious in lessening that which she had entertained for Sir Felix.",
        "paragraph_chars": [
            [
                0,
                3802
            ],
            [
                3802,
                5973
            ],
            [
                5973,
                6659
            ],
            [
                6659,
                6750
            ],
            [
                6750,
                6767
            ],
            [
                6767,
                6793
            ],
            [
                6793,
                6899
            ],
            [
                6899,
                6913
            ],
            [
                6913,
                6983
            ],
            [
                6983,
                7022
            ],
            [
                7022,
                7268
            ],
            [
                7268,
                7375
            ],
            [
                7375,
                7409
            ],
            [
                7409,
                7656
            ],
            [
                7656,
                7691
            ],
            [
                7691,
                8008
            ],
            [
                8008,
                8074
            ],
            [
                8074,
                8361
            ],
            [
                8361,
                8415
            ],
            [
                8415,
                8454
            ],
            [
                8454,
                8488
            ],
            [
                8488,
                8610
            ],
            [
                8610,
                8637
            ],
            [
                8637,
                8776
            ],
            [
                8776,
                8804
            ],
            [
                8804,
                8989
            ],
            [
                8989,
                9016
            ],
            [
                9016,
                9299
            ],
            [
                9299,
                9418
            ],
            [
                9418,
                9753
            ],
            [
                9753,
                10839
            ],
            [
                10839,
                11524
            ],
            [
                11524,
                11700
            ],
            [
                11700,
                11715
            ],
            [
                11715,
                11747
            ],
            [
                11747,
                11800
            ],
            [
                11800,
                11952
            ],
            [
                11952,
                12054
            ],
            [
                12054,
                12064
            ],
            [
                12064,
                12129
            ],
            [
                12129,
                12242
            ],
            [
                12242,
                12271
            ],
            [
                12271,
                12374
            ],
            [
                12374,
                12399
            ],
            [
                12399,
                12501
            ],
            [
                12501,
                12560
            ],
            [
                12560,
                12781
            ],
            [
                12781,
                12873
            ],
            [
                12873,
                13005
            ],
            [
                13005,
                13780
            ],
            [
                13780,
                14201
            ],
            [
                14201,
                14249
            ],
            [
                14249,
                14434
            ],
            [
                14434,
                14485
            ],
            [
                14485,
                14577
            ],
            [
                14577,
                14612
            ],
            [
                14612,
                15836
            ],
            [
                15836,
                17641
            ],
            [
                17641,
                17906
            ],
            [
                17906,
                17971
            ],
            [
                17971,
                18032
            ],
            [
                18032,
                18457
            ],
            [
                18457,
                19317
            ],
            [
                19317,
                19344
            ],
            [
                19344,
                19428
            ],
            [
                19428,
                19443
            ],
            [
                19443,
                19531
            ],
            [
                19531,
                19638
            ],
            [
                19638,
                19790
            ],
            [
                19790,
                19822
            ],
            [
                19822,
                19942
            ],
            [
                19942,
                20040
            ],
            [
                20040,
                20204
            ],
            [
                20204,
                20269
            ],
            [
                20269,
                21312
            ],
            [
                21312,
                21414
            ],
            [
                21414,
                21467
            ],
            [
                21467,
                22020
            ],
            [
                22020,
                22060
            ],
            [
                22060,
                22276
            ],
            [
                22276,
                22303
            ],
            [
                22303,
                22526
            ],
            [
                22526,
                22955
            ],
            [
                22955,
                23055
            ],
            [
                23055,
                23089
            ],
            [
                23089,
                23451
            ],
            [
                23451,
                23489
            ],
            [
                23489,
                23622
            ],
            [
                23622,
                23704
            ],
            [
                23704,
                23925
            ],
            [
                23925,
                23949
            ],
            [
                23949,
                24251
            ],
            [
                24251,
                24288
            ],
            [
                24288,
                24618
            ]
        ],
        "segment_chars": [
            [
                0,
                81
            ],
            [
                81,
                180
            ],
            [
                180,
                380
            ],
            [
                380,
                506
            ],
            [
                506,
                600
            ],
            [
                600,
                711
            ],
            [
                711,
                832
            ],
            [
                832,
                932
            ],
            [
                932,
                1021
            ],
            [
                1021,
                1066
            ],
            [
                1066,
                1094
            ],
            [
                1094,
                1168
            ],
            [
                1168,
                1203
            ],
            [
                1203,
                1266
            ],
            [
                1266,
                1311
            ],
            [
                1311,
                1449
            ],
            [
                1449,
                1654
            ],
            [
                1654,
                1783
            ],
            [
                1783,
                1815
            ],
            [
                1815,
                1887
            ],
            [
                1887,
                1999
            ],
            [
                1999,
                2068
            ],
            [
                2068,
                2159
            ],
            [
                2159,
                2223
            ],
            [
                2223,
                2300
            ],
            [
                2300,
                2365
            ],
            [
                2365,
                2510
            ],
            [
                2510,
                2549
            ],
            [
                2549,
                2590
            ],
            [
                2590,
                2889
            ],
            [
                2889,
                3093
            ],
            [
                3093,
                3219
            ],
            [
                3219,
                3316
            ],
            [
                3316,
                3491
            ],
            [
                3491,
                3564
            ],
            [
                3564,
                3802
            ],
            [
                3802,
                3849
            ],
            [
                3849,
                3885
            ],
            [
                3885,
                4095
            ],
            [
                4095,
                4233
            ],
            [
                4233,
                4263
            ],
            [
                4263,
                4371
            ],
            [
                4371,
                4477
            ],
            [
                4477,
                4499
            ],
            [
                4499,
                4510
            ],
            [
                4510,
                4686
            ],
            [
                4686,
                4695
            ],
            [
                4695,
                4804
            ],
            [
                4804,
                4917
            ],
            [
                4917,
                5071
            ],
            [
                5071,
                5117
            ],
            [
                5117,
                5170
            ],
            [
                5170,
                5266
            ],
            [
                5266,
                5394
            ],
            [
                5394,
                5472
            ],
            [
                5472,
                5523
            ],
            [
                5523,
                5607
            ],
            [
                5607,
                5634
            ],
            [
                5634,
                5814
            ],
            [
                5814,
                5924
            ],
            [
                5924,
                5973
            ],
            [
                5973,
                6122
            ],
            [
                6122,
                6254
            ],
            [
                6254,
                6295
            ],
            [
                6295,
                6370
            ],
            [
                6370,
                6495
            ],
            [
                6495,
                6639
            ],
            [
                6639,
                6659
            ],
            [
                6659,
                6702
            ],
            [
                6702,
                6750
            ],
            [
                6750,
                6767
            ],
            [
                6767,
                6793
            ],
            [
                6793,
                6809
            ],
            [
                6809,
                6899
            ],
            [
                6899,
                6913
            ],
            [
                6913,
                6957
            ],
            [
                6957,
                6983
            ],
            [
                6983,
                7022
            ],
            [
                7022,
                7042
            ],
            [
                7042,
                7248
            ],
            [
                7248,
                7268
            ],
            [
                7268,
                7297
            ],
            [
                7297,
                7320
            ],
            [
                7320,
                7349
            ],
            [
                7349,
                7375
            ],
            [
                7375,
                7409
            ],
            [
                7409,
                7423
            ],
            [
                7423,
                7442
            ],
            [
                7442,
                7524
            ],
            [
                7524,
                7610
            ],
            [
                7610,
                7656
            ],
            [
                7656,
                7691
            ],
            [
                7691,
                7711
            ],
            [
                7711,
                7742
            ],
            [
                7742,
                7843
            ],
            [
                7843,
                7903
            ],
            [
                7903,
                7926
            ],
            [
                7926,
                7964
            ],
            [
                7964,
                7977
            ],
            [
                7977,
                8008
            ],
            [
                8008,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8101
            ],
            [
                8101,
                8200
            ],
            [
                8200,
                8235
            ],
            [
                8235,
                8326
            ],
            [
                8326,
                8361
            ],
            [
                8361,
                8385
            ],
            [
                8385,
                8415
            ],
            [
                8415,
                8431
            ],
            [
                8431,
                8454
            ],
            [
                8454,
                8488
            ],
            [
                8488,
                8568
            ],
            [
                8568,
                8587
            ],
            [
                8587,
                8610
            ],
            [
                8610,
                8637
            ],
            [
                8637,
                8665
            ],
            [
                8665,
                8721
            ],
            [
                8721,
                8776
            ],
            [
                8776,
                8804
            ],
            [
                8804,
                8828
            ],
            [
                8828,
                8869
            ],
            [
                8869,
                8883
            ],
            [
                8883,
                8956
            ],
            [
                8956,
                8989
            ],
            [
                8989,
                9016
            ],
            [
                9016,
                9052
            ],
            [
                9052,
                9064
            ],
            [
                9064,
                9099
            ],
            [
                9099,
                9168
            ],
            [
                9168,
                9185
            ],
            [
                9185,
                9232
            ],
            [
                9232,
                9271
            ],
            [
                9271,
                9299
            ],
            [
                9299,
                9323
            ],
            [
                9323,
                9418
            ],
            [
                9418,
                9436
            ],
            [
                9436,
                9474
            ],
            [
                9474,
                9578
            ],
            [
                9578,
                9635
            ],
            [
                9635,
                9665
            ],
            [
                9665,
                9682
            ],
            [
                9682,
                9753
            ],
            [
                9753,
                9828
            ],
            [
                9828,
                9915
            ],
            [
                9915,
                10002
            ],
            [
                10002,
                10176
            ],
            [
                10176,
                10257
            ],
            [
                10257,
                10361
            ],
            [
                10361,
                10414
            ],
            [
                10414,
                10526
            ],
            [
                10526,
                10608
            ],
            [
                10608,
                10798
            ],
            [
                10798,
                10839
            ],
            [
                10839,
                10923
            ],
            [
                10923,
                11080
            ],
            [
                11080,
                11123
            ],
            [
                11123,
                11198
            ],
            [
                11198,
                11390
            ],
            [
                11390,
                11524
            ],
            [
                11524,
                11563
            ],
            [
                11563,
                11611
            ],
            [
                11611,
                11666
            ],
            [
                11666,
                11700
            ],
            [
                11700,
                11715
            ],
            [
                11715,
                11747
            ],
            [
                11747,
                11760
            ],
            [
                11760,
                11800
            ],
            [
                11800,
                11858
            ],
            [
                11858,
                11880
            ],
            [
                11880,
                11912
            ],
            [
                11912,
                11952
            ],
            [
                11952,
                12009
            ],
            [
                12009,
                12054
            ],
            [
                12054,
                12064
            ],
            [
                12064,
                12079
            ],
            [
                12079,
                12129
            ],
            [
                12129,
                12185
            ],
            [
                12185,
                12242
            ],
            [
                12242,
                12271
            ],
            [
                12271,
                12290
            ],
            [
                12290,
                12309
            ],
            [
                12309,
                12340
            ],
            [
                12340,
                12374
            ],
            [
                12374,
                12399
            ],
            [
                12399,
                12444
            ],
            [
                12444,
                12501
            ],
            [
                12501,
                12560
            ],
            [
                12560,
                12575
            ],
            [
                12575,
                12668
            ],
            [
                12668,
                12711
            ],
            [
                12711,
                12781
            ],
            [
                12781,
                12793
            ],
            [
                12793,
                12811
            ],
            [
                12811,
                12873
            ],
            [
                12873,
                12917
            ],
            [
                12917,
                12949
            ],
            [
                12949,
                12997
            ],
            [
                12997,
                13005
            ],
            [
                13005,
                13104
            ],
            [
                13104,
                13252
            ],
            [
                13252,
                13370
            ],
            [
                13370,
                13450
            ],
            [
                13450,
                13549
            ],
            [
                13549,
                13671
            ],
            [
                13671,
                13685
            ],
            [
                13685,
                13717
            ],
            [
                13717,
                13745
            ],
            [
                13745,
                13780
            ],
            [
                13780,
                13825
            ],
            [
                13825,
                13884
            ],
            [
                13884,
                14083
            ],
            [
                14083,
                14141
            ],
            [
                14141,
                14191
            ],
            [
                14191,
                14201
            ],
            [
                14201,
                14249
            ],
            [
                14249,
                14276
            ],
            [
                14276,
                14300
            ],
            [
                14300,
                14426
            ],
            [
                14426,
                14434
            ],
            [
                14434,
                14485
            ],
            [
                14485,
                14504
            ],
            [
                14504,
                14524
            ],
            [
                14524,
                14577
            ],
            [
                14577,
                14612
            ],
            [
                14612,
                14678
            ],
            [
                14678,
                14716
            ],
            [
                14716,
                14807
            ],
            [
                14807,
                14878
            ],
            [
                14878,
                14981
            ],
            [
                14981,
                15030
            ],
            [
                15030,
                15062
            ],
            [
                15062,
                15133
            ],
            [
                15133,
                15287
            ],
            [
                15287,
                15336
            ],
            [
                15336,
                15349
            ],
            [
                15349,
                15385
            ],
            [
                15385,
                15491
            ],
            [
                15491,
                15633
            ],
            [
                15633,
                15735
            ],
            [
                15735,
                15836
            ],
            [
                15836,
                15866
            ],
            [
                15866,
                16013
            ],
            [
                16013,
                16379
            ],
            [
                16379,
                16518
            ],
            [
                16518,
                16559
            ],
            [
                16559,
                17174
            ],
            [
                17174,
                17282
            ],
            [
                17282,
                17346
            ],
            [
                17346,
                17457
            ],
            [
                17457,
                17527
            ],
            [
                17527,
                17641
            ],
            [
                17641,
                17807
            ],
            [
                17807,
                17906
            ],
            [
                17906,
                17971
            ],
            [
                17971,
                18032
            ],
            [
                18032,
                18145
            ],
            [
                18145,
                18215
            ],
            [
                18215,
                18330
            ],
            [
                18330,
                18457
            ],
            [
                18457,
                18499
            ],
            [
                18499,
                18601
            ],
            [
                18601,
                18703
            ],
            [
                18703,
                18863
            ],
            [
                18863,
                18923
            ],
            [
                18923,
                19184
            ],
            [
                19184,
                19317
            ],
            [
                19317,
                19344
            ],
            [
                19344,
                19381
            ],
            [
                19381,
                19428
            ],
            [
                19428,
                19443
            ],
            [
                19443,
                19531
            ],
            [
                19531,
                19547
            ],
            [
                19547,
                19586
            ],
            [
                19586,
                19638
            ],
            [
                19638,
                19733
            ],
            [
                19733,
                19790
            ],
            [
                19790,
                19822
            ],
            [
                19822,
                19942
            ],
            [
                19942,
                19977
            ],
            [
                19977,
                20040
            ],
            [
                20040,
                20158
            ],
            [
                20158,
                20204
            ],
            [
                20204,
                20269
            ],
            [
                20269,
                20338
            ],
            [
                20338,
                20365
            ],
            [
                20365,
                20421
            ],
            [
                20421,
                20522
            ],
            [
                20522,
                20592
            ],
            [
                20592,
                20708
            ],
            [
                20708,
                20775
            ],
            [
                20775,
                20813
            ],
            [
                20813,
                20918
            ],
            [
                20918,
                21063
            ],
            [
                21063,
                21242
            ],
            [
                21242,
                21312
            ],
            [
                21312,
                21414
            ],
            [
                21414,
                21467
            ],
            [
                21467,
                21482
            ],
            [
                21482,
                21504
            ],
            [
                21504,
                21518
            ],
            [
                21518,
                21643
            ],
            [
                21643,
                21765
            ],
            [
                21765,
                21841
            ],
            [
                21841,
                21877
            ],
            [
                21877,
                21972
            ],
            [
                21972,
                22020
            ],
            [
                22020,
                22060
            ],
            [
                22060,
                22134
            ],
            [
                22134,
                22191
            ],
            [
                22191,
                22276
            ],
            [
                22276,
                22298
            ],
            [
                22298,
                22303
            ],
            [
                22303,
                22526
            ],
            [
                22526,
                22554
            ],
            [
                22554,
                22669
            ],
            [
                22669,
                22731
            ],
            [
                22731,
                22839
            ],
            [
                22839,
                22955
            ],
            [
                22955,
                23010
            ],
            [
                23010,
                23055
            ],
            [
                23055,
                23089
            ],
            [
                23089,
                23110
            ],
            [
                23110,
                23206
            ],
            [
                23206,
                23248
            ],
            [
                23248,
                23301
            ],
            [
                23301,
                23345
            ],
            [
                23345,
                23451
            ],
            [
                23451,
                23489
            ],
            [
                23489,
                23547
            ],
            [
                23547,
                23592
            ],
            [
                23592,
                23622
            ],
            [
                23622,
                23704
            ],
            [
                23704,
                23741
            ],
            [
                23741,
                23882
            ],
            [
                23882,
                23925
            ],
            [
                23925,
                23949
            ],
            [
                23949,
                24056
            ],
            [
                24056,
                24162
            ],
            [
                24162,
                24214
            ],
            [
                24214,
                24251
            ],
            [
                24251,
                24288
            ],
            [
                24288,
                24310
            ],
            [
                24310,
                24364
            ],
            [
                24364,
                24438
            ],
            [
                24438,
                24462
            ],
            [
                24462,
                24618
            ]
        ],
        "overlap_chars": [
            [
                22,
                26
            ],
            [
                33,
                68
            ],
            [
                75,
                81
            ],
            [
                81,
                138
            ],
            [
                139,
                154
            ],
            [
                166,
                180
            ],
            [
                180,
                216
            ],
            [
                225,
                248
            ],
            [
                325,
                328
            ],
            [
                249,
                288
            ],
            [
                378,
                379
            ],
            [
                600,
                604
            ],
            [
                619,
                667
            ],
            [
                681,
                711
            ],
            [
                711,
                830
            ],
            [
                830,
                832
            ],
            [
                832,
                843
            ],
            [
                858,
                862
            ],
            [
                875,
                891
            ],
            [
                896,
                932
            ],
            [
                932,
                1020
            ],
            [
                1021,
                1050
            ],
            [
                1057,
                1066
            ],
            [
                1066,
                1094
            ],
            [
                1094,
                1131
            ],
            [
                1136,
                1142
            ],
            [
                1150,
                1168
            ],
            [
                1168,
                1201
            ],
            [
                1223,
                1241
            ],
            [
                1254,
                1265
            ],
            [
                1266,
                1267
            ],
            [
                1286,
                1311
            ],
            [
                1311,
                1324
            ],
            [
                1329,
                1353
            ],
            [
                1355,
                1379
            ],
            [
                1431,
                1436
            ],
            [
                1447,
                1449
            ],
            [
                1453,
                1559
            ],
            [
                1583,
                1614
            ],
            [
                1652,
                1653
            ],
            [
                1654,
                1701
            ],
            [
                1783,
                1815
            ],
            [
                1815,
                1887
            ],
            [
                1887,
                1890
            ],
            [
                1914,
                1942
            ],
            [
                1954,
                1983
            ],
            [
                1985,
                1988
            ],
            [
                1997,
                1999
            ],
            [
                1999,
                2067
            ],
            [
                2068,
                2117
            ],
            [
                2140,
                2159
            ],
            [
                2159,
                2186
            ],
            [
                2221,
                2223
            ],
            [
                2365,
                2419
            ],
            [
                2460,
                2510
            ],
            [
                2510,
                2523
            ],
            [
                2538,
                2549
            ],
            [
                2590,
                2633
            ],
            [
                2648,
                2649
            ],
            [
                2694,
                2729
            ],
            [
                2731,
                2800
            ],
            [
                2675,
                2676
            ],
            [
                3093,
                3107
            ],
            [
                3112,
                3116
            ],
            [
                3129,
                3138
            ],
            [
                3121,
                3125
            ],
            [
                3139,
                3153
            ],
            [
                3217,
                3219
            ],
            [
                3316,
                3353
            ],
            [
                3442,
                3451
            ],
            [
                3461,
                3465
            ],
            [
                3491,
                3517
            ],
            [
                3375,
                3376
            ],
            [
                3564,
                3661
            ],
            [
                3664,
                3702
            ],
            [
                3768,
                3802
            ],
            [
                3802,
                3849
            ],
            [
                3849,
                3885
            ],
            [
                3885,
                3927
            ],
            [
                4093,
                4095
            ],
            [
                4095,
                4108
            ],
            [
                4118,
                4132
            ],
            [
                4141,
                4169
            ],
            [
                4195,
                4233
            ],
            [
                4281,
                4293
            ],
            [
                4299,
                4319
            ],
            [
                4327,
                4371
            ],
            [
                4371,
                4438
            ],
            [
                4471,
                4477
            ],
            [
                4499,
                4510
            ],
            [
                4510,
                4530
            ],
            [
                4541,
                4567
            ],
            [
                4591,
                4654
            ],
            [
                4666,
                4686
            ],
            [
                4686,
                4695
            ],
            [
                4695,
                4732
            ],
            [
                4751,
                4782
            ],
            [
                4802,
                4804
            ],
            [
                4804,
                4916
            ],
            [
                4921,
                4943
            ],
            [
                4956,
                4972
            ],
            [
                4999,
                5071
            ],
            [
                5071,
                5115
            ],
            [
                5117,
                5170
            ],
            [
                5170,
                5208
            ],
            [
                5211,
                5227
            ],
            [
                5230,
                5266
            ],
            [
                5266,
                5320
            ],
            [
                5328,
                5385
            ],
            [
                5392,
                5394
            ],
            [
                5394,
                5415
            ],
            [
                5417,
                5472
            ],
            [
                5472,
                5523
            ],
            [
                5607,
                5634
            ],
            [
                5634,
                5726
            ],
            [
                5812,
                5814
            ],
            [
                5814,
                5839
            ],
            [
                5878,
                5924
            ],
            [
                5924,
                5973
            ],
            [
                5973,
                6025
            ],
            [
                6097,
                6112
            ],
            [
                6083,
                6097
            ],
            [
                6120,
                6122
            ],
            [
                6295,
                6346
            ],
            [
                6194,
                6197
            ],
            [
                6244,
                6252
            ],
            [
                6355,
                6370
            ],
            [
                6370,
                6379
            ],
            [
                6474,
                6488
            ],
            [
                6393,
                6398
            ],
            [
                6434,
                6442
            ],
            [
                6493,
                6495
            ],
            [
                6495,
                6504
            ],
            [
                6600,
                6612
            ],
            [
                6618,
                6638
            ],
            [
                6639,
                6659
            ],
            [
                6659,
                6700
            ],
            [
                6750,
                6767
            ],
            [
                6767,
                6793
            ],
            [
                6793,
                6794
            ],
            [
                6801,
                6809
            ],
            [
                6809,
                6834
            ],
            [
                6957,
                6983
            ],
            [
                6983,
                7022
            ],
            [
                7022,
                7042
            ],
            [
                7042,
                7061
            ],
            [
                7072,
                7114
            ],
            [
                7214,
                7217
            ],
            [
                7178,
                7186
            ],
            [
                7218,
                7248
            ],
            [
                7248,
                7268
            ],
            [
                7268,
                7269
            ],
            [
                7276,
                7297
            ],
            [
                7297,
                7320
            ],
            [
                7320,
                7349
            ],
            [
                7349,
                7375
            ],
            [
                7375,
                7409
            ],
            [
                7409,
                7412
            ],
            [
                7418,
                7423
            ],
            [
                7423,
                7442
            ],
            [
                7442,
                7486
            ],
            [
                7488,
                7524
            ],
            [
                7524,
                7548
            ],
            [
                7560,
                7610
            ],
            [
                7610,
                7656
            ],
            [
                7656,
                7691
            ],
            [
                7691,
                7711
            ],
            [
                7742,
                7763
            ],
            [
                7803,
                7812
            ],
            [
                7772,
                7776
            ],
            [
                7779,
                7786
            ],
            [
                7815,
                7843
            ],
            [
                7843,
                7863
            ],
            [
                7873,
                7901
            ],
            [
                7869,
                7872
            ],
            [
                7926,
                7945
            ],
            [
                7962,
                7964
            ],
            [
                7977,
                8008
            ],
            [
                8008,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8078
            ],
            [
                8101,
                8127
            ],
            [
                8198,
                8200
            ],
            [
                8200,
                8216
            ],
            [
                8218,
                8221
            ],
            [
                8235,
                8255
            ],
            [
                8264,
                8300
            ],
            [
                8324,
                8326
            ],
            [
                8326,
                8361
            ],
            [
                8361,
                8385
            ],
            [
                8385,
                8415
            ],
            [
                8488,
                8549
            ],
            [
                8566,
                8568
            ],
            [
                8587,
                8602
            ],
            [
                8572,
                8575
            ],
            [
                8579,
                8580
            ],
            [
                8581,
                8585
            ],
            [
                8607,
                8610
            ],
            [
                8610,
                8637
            ],
            [
                8637,
                8641
            ],
            [
                8643,
                8659
            ],
            [
                8663,
                8665
            ],
            [
                8665,
                8699
            ],
            [
                8699,
                8700
            ],
            [
                8712,
                8719
            ],
            [
                8776,
                8804
            ],
            [
                8804,
                8828
            ],
            [
                8828,
                8869
            ],
            [
                8883,
                8886
            ],
            [
                9017,
                9052
            ],
            [
                9052,
                9064
            ],
            [
                9064,
                9082
            ],
            [
                9087,
                9099
            ],
            [
                9099,
                9168
            ],
            [
                9168,
                9185
            ],
            [
                9185,
                9232
            ],
            [
                9232,
                9236
            ],
            [
                9275,
                9295
            ],
            [
                9299,
                9322
            ],
            [
                9446,
                9474
            ],
            [
                9474,
                9483
            ],
            [
                9489,
                9495
            ],
            [
                9576,
                9578
            ],
            [
                9578,
                9624
            ],
            [
                9633,
                9635
            ],
            [
                9665,
                9682
            ],
            [
                9682,
                9753
            ],
            [
                9753,
                9762
            ],
            [
                9789,
                9828
            ],
            [
                9866,
                9868
            ],
            [
                9895,
                9901
            ],
            [
                9880,
                9890
            ],
            [
                9902,
                9913
            ],
            [
                9864,
                9865
            ],
            [
                9927,
                9935
            ],
            [
                9953,
                9963
            ],
            [
                9971,
                9984
            ],
            [
                10000,
                10002
            ],
            [
                10002,
                10044
            ],
            [
                10176,
                10257
            ],
            [
                10257,
                10300
            ],
            [
                10314,
                10340
            ],
            [
                10359,
                10361
            ],
            [
                10361,
                10414
            ],
            [
                10451,
                10459
            ],
            [
                10475,
                10526
            ],
            [
                10526,
                10532
            ],
            [
                10541,
                10589
            ],
            [
                10598,
                10605
            ],
            [
                10608,
                10637
            ],
            [
                10641,
                10689
            ],
            [
                10796,
                10797
            ],
            [
                10798,
                10807
            ],
            [
                10811,
                10839
            ],
            [
                10839,
                10868
            ],
            [
                10921,
                10923
            ],
            [
                10923,
                10929
            ],
            [
                10944,
                10968
            ],
            [
                10973,
                11020
            ],
            [
                11078,
                11080
            ],
            [
                11080,
                11104
            ],
            [
                11111,
                11123
            ],
            [
                11198,
                11256
            ],
            [
                11269,
                11289
            ],
            [
                11295,
                11302
            ],
            [
                11311,
                11317
            ],
            [
                11388,
                11390
            ],
            [
                11432,
                11434
            ],
            [
                11390,
                11420
            ],
            [
                11450,
                11508
            ],
            [
                11512,
                11524
            ],
            [
                11524,
                11525
            ],
            [
                11529,
                11563
            ],
            [
                11666,
                11700
            ],
            [
                11700,
                11715
            ],
            [
                11715,
                11747
            ],
            [
                11760,
                11800
            ],
            [
                11800,
                11828
            ],
            [
                11856,
                11858
            ],
            [
                11858,
                11880
            ],
            [
                11880,
                11912
            ],
            [
                11912,
                11952
            ],
            [
                11952,
                11984
            ],
            [
                12007,
                12009
            ],
            [
                12009,
                12054
            ],
            [
                12054,
                12064
            ],
            [
                12064,
                12068
            ],
            [
                12077,
                12079
            ],
            [
                12079,
                12129
            ],
            [
                12129,
                12185
            ],
            [
                12185,
                12242
            ],
            [
                12242,
                12271
            ],
            [
                12271,
                12290
            ],
            [
                12290,
                12309
            ],
            [
                12309,
                12340
            ],
            [
                12340,
                12370
            ],
            [
                12374,
                12399
            ],
            [
                12399,
                12444
            ],
            [
                12444,
                12465
            ],
            [
                12475,
                12480
            ],
            [
                12486,
                12488
            ],
            [
                12481,
                12485
            ],
            [
                12489,
                12501
            ],
            [
                12501,
                12560
            ],
            [
                12560,
                12575
            ],
            [
                12575,
                12654
            ],
            [
                12656,
                12668
            ],
            [
                12668,
                12697
            ],
            [
                12699,
                12711
            ],
            [
                12711,
                12766
            ],
            [
                12768,
                12781
            ],
            [
                12781,
                12793
            ],
            [
                12793,
                12811
            ],
            [
                12811,
                12873
            ],
            [
                12873,
                12885
            ],
            [
                12892,
                12917
            ],
            [
                12917,
                12949
            ],
            [
                12949,
                12997
            ],
            [
                12997,
                13005
            ],
            [
                13015,
                13029
            ],
            [
                13072,
                13098
            ],
            [
                13040,
                13045
            ],
            [
                13102,
                13104
            ],
            [
                13104,
                13129
            ],
            [
                13143,
                13232
            ],
            [
                13250,
                13252
            ],
            [
                13252,
                13263
            ],
            [
                13277,
                13370
            ],
            [
                13370,
                13450
            ],
            [
                13450,
                13456
            ],
            [
                13475,
                13497
            ],
            [
                13513,
                13548
            ],
            [
                13671,
                13685
            ],
            [
                13685,
                13717
            ],
            [
                13717,
                13743
            ],
            [
                13780,
                13825
            ],
            [
                13825,
                13884
            ],
            [
                14083,
                14140
            ],
            [
                14141,
                14191
            ],
            [
                14191,
                14201
            ],
            [
                14201,
                14249
            ],
            [
                14249,
                14276
            ],
            [
                14276,
                14290
            ],
            [
                14298,
                14300
            ],
            [
                14300,
                14410
            ],
            [
                14424,
                14426
            ],
            [
                14426,
                14434
            ],
            [
                14434,
                14485
            ],
            [
                14485,
                14504
            ],
            [
                14504,
                14524
            ],
            [
                14613,
                14618
            ],
            [
                14542,
                14548
            ],
            [
                14555,
                14574
            ],
            [
                14603,
                14604
            ],
            [
                14623,
                14637
            ],
            [
                14652,
                14676
            ],
            [
                14574,
                14576
            ],
            [
                14788,
                14807
            ],
            [
                14807,
                14869
            ],
            [
                14871,
                14878
            ],
            [
                14878,
                14931
            ],
            [
                14954,
                14981
            ],
            [
                15349,
                15384
            ],
            [
                15385,
                15491
            ],
            [
                15491,
                15512
            ],
            [
                15526,
                15539
            ],
            [
                15547,
                15586
            ],
            [
                15590,
                15603
            ],
            [
                15610,
                15633
            ],
            [
                15633,
                15678
            ],
            [
                15694,
                15697
            ],
            [
                15725,
                15735
            ],
            [
                15735,
                15801
            ],
            [
                15834,
                15836
            ],
            [
                15836,
                15866
            ],
            [
                15972,
                15976
            ],
            [
                15870,
                15895
            ],
            [
                15950,
                15963
            ],
            [
                15986,
                15990
            ],
            [
                15866,
                15869
            ],
            [
                16004,
                16011
            ],
            [
                16049,
                16054
            ],
            [
                16013,
                16024
            ],
            [
                16054,
                16068
            ],
            [
                16080,
                16096
            ],
            [
                15911,
                15912
            ],
            [
                16319,
                16334
            ],
            [
                16352,
                16378
            ],
            [
                16379,
                16454
            ],
            [
                16463,
                16518
            ],
            [
                16518,
                16545
            ],
            [
                16550,
                16559
            ],
            [
                16559,
                16630
            ],
            [
                16699,
                16704
            ],
            [
                17116,
                17136
            ],
            [
                17147,
                17149
            ],
            [
                17172,
                17174
            ],
            [
                17174,
                17220
            ],
            [
                17223,
                17282
            ],
            [
                17316,
                17344
            ],
            [
                17346,
                17355
            ],
            [
                17366,
                17402
            ],
            [
                17455,
                17457
            ],
            [
                17457,
                17460
            ],
            [
                17482,
                17491
            ],
            [
                17500,
                17527
            ],
            [
                17555,
                17575
            ],
            [
                17639,
                17641
            ],
            [
                17641,
                17696
            ],
            [
                17723,
                17758
            ],
            [
                17705,
                17708
            ],
            [
                17772,
                17806
            ],
            [
                17807,
                17906
            ],
            [
                17906,
                17918
            ],
            [
                17922,
                17971
            ],
            [
                17971,
                18003
            ],
            [
                18029,
                18032
            ],
            [
                18032,
                18043
            ],
            [
                18048,
                18056
            ],
            [
                18070,
                18072
            ],
            [
                18078,
                18122
            ],
            [
                18124,
                18145
            ],
            [
                18215,
                18245
            ],
            [
                18286,
                18328
            ],
            [
                18457,
                18484
            ],
            [
                18493,
                18499
            ],
            [
                18499,
                18568
            ],
            [
                18579,
                18601
            ],
            [
                18601,
                18613
            ],
            [
                18661,
                18703
            ],
            [
                18703,
                18730
            ],
            [
                18743,
                18759
            ],
            [
                18766,
                18784
            ],
            [
                18815,
                18832
            ],
            [
                18843,
                18863
            ],
            [
                18863,
                18870
            ],
            [
                18923,
                18972
            ],
            [
                18987,
                19005
            ],
            [
                19007,
                19078
            ],
            [
                19100,
                19103
            ],
            [
                19084,
                19096
            ],
            [
                19107,
                19132
            ],
            [
                19160,
                19183
            ],
            [
                19241,
                19274
            ],
            [
                19226,
                19239
            ],
            [
                19274,
                19275
            ],
            [
                19184,
                19185
            ],
            [
                19276,
                19317
            ],
            [
                19317,
                19344
            ],
            [
                19344,
                19381
            ],
            [
                19381,
                19428
            ],
            [
                19428,
                19443
            ],
            [
                19443,
                19531
            ],
            [
                19531,
                19547
            ],
            [
                19547,
                19586
            ],
            [
                19586,
                19598
            ],
            [
                19610,
                19638
            ],
            [
                19638,
                19702
            ],
            [
                19731,
                19733
            ],
            [
                19733,
                19768
            ],
            [
                19823,
                19942
            ],
            [
                19942,
                19977
            ],
            [
                19977,
                19978
            ],
            [
                20013,
                20040
            ],
            [
                20040,
                20097
            ],
            [
                20112,
                20158
            ],
            [
                20158,
                20204
            ],
            [
                20204,
                20269
            ],
            [
                20269,
                20326
            ],
            [
                20327,
                20338
            ],
            [
                20421,
                20430
            ],
            [
                20436,
                20456
            ],
            [
                20479,
                20481
            ],
            [
                20494,
                20522
            ],
            [
                20522,
                20592
            ],
            [
                20644,
                20646
            ],
            [
                20631,
                20632
            ],
            [
                20658,
                20708
            ],
            [
                20708,
                20738
            ],
            [
                20748,
                20775
            ],
            [
                20775,
                20790
            ],
            [
                20810,
                20813
            ],
            [
                20813,
                20817
            ],
            [
                20852,
                20890
            ],
            [
                20916,
                20918
            ],
            [
                21063,
                21067
            ],
            [
                21112,
                21121
            ],
            [
                21124,
                21128
            ],
            [
                21147,
                21242
            ],
            [
                21242,
                21312
            ],
            [
                21312,
                21395
            ],
            [
                21411,
                21414
            ],
            [
                21467,
                21473
            ],
            [
                21480,
                21482
            ],
            [
                21482,
                21504
            ],
            [
                21504,
                21518
            ],
            [
                21555,
                21605
            ],
            [
                21632,
                21640
            ],
            [
                21527,
                21530
            ],
            [
                21766,
                21841
            ],
            [
                21841,
                21877
            ],
            [
                21877,
                21922
            ],
            [
                21931,
                21951
            ],
            [
                21970,
                21972
            ],
            [
                21972,
                21990
            ],
            [
                22009,
                22020
            ],
            [
                22020,
                22060
            ],
            [
                22060,
                22104
            ],
            [
                22119,
                22134
            ],
            [
                22158,
                22191
            ],
            [
                22191,
                22201
            ],
            [
                22212,
                22276
            ],
            [
                22276,
                22298
            ],
            [
                22298,
                22303
            ],
            [
                22303,
                22304
            ],
            [
                22308,
                22346
            ],
            [
                22355,
                22514
            ],
            [
                22523,
                22526
            ],
            [
                22526,
                22554
            ],
            [
                22554,
                22563
            ],
            [
                22573,
                22625
            ],
            [
                22667,
                22669
            ],
            [
                22669,
                22699
            ],
            [
                22708,
                22731
            ],
            [
                22735,
                22738
            ],
            [
                22749,
                22758
            ],
            [
                22763,
                22798
            ],
            [
                22837,
                22839
            ],
            [
                22839,
                22860
            ],
            [
                22873,
                22920
            ],
            [
                22940,
                22955
            ],
            [
                23010,
                23043
            ],
            [
                23044,
                23052
            ],
            [
                22990,
                23009
            ],
            [
                23055,
                23089
            ],
            [
                23089,
                23110
            ],
            [
                23110,
                23146
            ],
            [
                23173,
                23206
            ],
            [
                23206,
                23234
            ],
            [
                23246,
                23248
            ],
            [
                23248,
                23301
            ],
            [
                23301,
                23345
            ],
            [
                23345,
                23405
            ],
            [
                23448,
                23451
            ],
            [
                23451,
                23458
            ],
            [
                23467,
                23473
            ],
            [
                23486,
                23489
            ],
            [
                23547,
                23580
            ],
            [
                23582,
                23592
            ],
            [
                23741,
                23768
            ],
            [
                23775,
                23776
            ],
            [
                23778,
                23825
            ],
            [
                23848,
                23852
            ],
            [
                23826,
                23847
            ],
            [
                23855,
                23882
            ],
            [
                23882,
                23925
            ],
            [
                23925,
                23939
            ],
            [
                23941,
                23949
            ],
            [
                23949,
                24037
            ],
            [
                24038,
                24056
            ],
            [
                24198,
                24207
            ],
            [
                24212,
                24214
            ],
            [
                24214,
                24217
            ],
            [
                24293,
                24310
            ],
            [
                24310,
                24364
            ],
            [
                24364,
                24378
            ],
            [
                24398,
                24437
            ],
            [
                24438,
                24462
            ],
            [
                24462,
                24542
            ],
            [
                24560,
                24572
            ],
            [
                24604,
                24618
            ]
        ],
        "row_chars": [
            [
                0,
                81
            ],
            [
                81,
                180
            ],
            [
                180,
                380
            ],
            [
                380,
                506
            ],
            [
                506,
                600
            ],
            [
                600,
                711
            ],
            [
                711,
                832
            ],
            [
                832,
                932
            ],
            [
                932,
                1021
            ],
            [
                1021,
                1066
            ],
            [
                1066,
                1094
            ],
            [
                1094,
                1168
            ],
            [
                1168,
                1266
            ],
            [
                1266,
                1311
            ],
            [
                1311,
                1449
            ],
            [
                1449,
                1654
            ],
            [
                1654,
                1815
            ],
            [
                1815,
                1887
            ],
            [
                1887,
                1999
            ],
            [
                1999,
                2068
            ],
            [
                2068,
                2159
            ],
            [
                2159,
                2223
            ],
            [
                2223,
                2300
            ],
            [
                2300,
                2365
            ],
            [
                2365,
                2510
            ],
            [
                2510,
                2549
            ],
            [
                2549,
                2590
            ],
            [
                2590,
                2889
            ],
            [
                2889,
                3093
            ],
            [
                3093,
                3219
            ],
            [
                3219,
                3316
            ],
            [
                3316,
                3802
            ],
            [
                3802,
                3849
            ],
            [
                3849,
                3885
            ],
            [
                3885,
                4095
            ],
            [
                4095,
                4233
            ],
            [
                4233,
                4263
            ],
            [
                4263,
                4371
            ],
            [
                4371,
                4477
            ],
            [
                4477,
                4499
            ],
            [
                4499,
                4510
            ],
            [
                4510,
                4686
            ],
            [
                4686,
                4695
            ],
            [
                4695,
                4804
            ],
            [
                4804,
                4917
            ],
            [
                4917,
                5071
            ],
            [
                5071,
                5170
            ],
            [
                5170,
                5266
            ],
            [
                5266,
                5394
            ],
            [
                5394,
                5472
            ],
            [
                5472,
                5523
            ],
            [
                5523,
                5607
            ],
            [
                5607,
                5634
            ],
            [
                5634,
                5814
            ],
            [
                5814,
                5924
            ],
            [
                5924,
                5973
            ],
            [
                5973,
                6122
            ],
            [
                6122,
                6370
            ],
            [
                6370,
                6495
            ],
            [
                6495,
                6639
            ],
            [
                6639,
                6659
            ],
            [
                6659,
                6702
            ],
            [
                6702,
                6750
            ],
            [
                6750,
                6767
            ],
            [
                6767,
                6793
            ],
            [
                6793,
                6809
            ],
            [
                6809,
                6899
            ],
            [
                6899,
                6913
            ],
            [
                6913,
                6957
            ],
            [
                6957,
                6983
            ],
            [
                6983,
                7022
            ],
            [
                7022,
                7042
            ],
            [
                7042,
                7248
            ],
            [
                7248,
                7268
            ],
            [
                7268,
                7297
            ],
            [
                7297,
                7320
            ],
            [
                7320,
                7349
            ],
            [
                7349,
                7375
            ],
            [
                7375,
                7409
            ],
            [
                7409,
                7423
            ],
            [
                7423,
                7442
            ],
            [
                7442,
                7524
            ],
            [
                7524,
                7610
            ],
            [
                7610,
                7656
            ],
            [
                7656,
                7691
            ],
            [
                7691,
                7711
            ],
            [
                7711,
                7742
            ],
            [
                7742,
                7843
            ],
            [
                7843,
                7964
            ],
            [
                7964,
                7977
            ],
            [
                7977,
                8008
            ],
            [
                8008,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8200
            ],
            [
                8200,
                8326
            ],
            [
                8326,
                8361
            ],
            [
                8361,
                8385
            ],
            [
                8385,
                8415
            ],
            [
                8415,
                8431
            ],
            [
                8431,
                8454
            ],
            [
                8454,
                8488
            ],
            [
                8488,
                8568
            ],
            [
                8568,
                8610
            ],
            [
                8610,
                8637
            ],
            [
                8637,
                8665
            ],
            [
                8665,
                8721
            ],
            [
                8721,
                8776
            ],
            [
                8776,
                8804
            ],
            [
                8804,
                8828
            ],
            [
                8828,
                8869
            ],
            [
                8869,
                8883
            ],
            [
                8883,
                9052
            ],
            [
                9052,
                9064
            ],
            [
                9064,
                9099
            ],
            [
                9099,
                9168
            ],
            [
                9168,
                9185
            ],
            [
                9185,
                9232
            ],
            [
                9232,
                9299
            ],
            [
                9299,
                9323
            ],
            [
                9323,
                9418
            ],
            [
                9418,
                9436
            ],
            [
                9436,
                9474
            ],
            [
                9474,
                9578
            ],
            [
                9578,
                9635
            ],
            [
                9635,
                9665
            ],
            [
                9665,
                9682
            ],
            [
                9682,
                9753
            ],
            [
                9753,
                9828
            ],
            [
                9828,
                10002
            ],
            [
                10002,
                10257
            ],
            [
                10257,
                10361
            ],
            [
                10361,
                10414
            ],
            [
                10414,
                10526
            ],
            [
                10526,
                10798
            ],
            [
                10798,
                10839
            ],
            [
                10839,
                10923
            ],
            [
                10923,
                11080
            ],
            [
                11080,
                11123
            ],
            [
                11123,
                11198
            ],
            [
                11198,
                11390
            ],
            [
                11390,
                11524
            ],
            [
                11524,
                11563
            ],
            [
                11563,
                11611
            ],
            [
                11611,
                11666
            ],
            [
                11666,
                11700
            ],
            [
                11700,
                11715
            ],
            [
                11715,
                11747
            ],
            [
                11747,
                11760
            ],
            [
                11760,
                11800
            ],
            [
                11800,
                11858
            ],
            [
                11858,
                11880
            ],
            [
                11880,
                11912
            ],
            [
                11912,
                11952
            ],
            [
                11952,
                12009
            ],
            [
                12009,
                12054
            ],
            [
                12054,
                12064
            ],
            [
                12064,
                12079
            ],
            [
                12079,
                12129
            ],
            [
                12129,
                12185
            ],
            [
                12185,
                12242
            ],
            [
                12242,
                12271
            ],
            [
                12271,
                12290
            ],
            [
                12290,
                12309
            ],
            [
                12309,
                12340
            ],
            [
                12340,
                12374
            ],
            [
                12374,
                12399
            ],
            [
                12399,
                12444
            ],
            [
                12444,
                12501
            ],
            [
                12501,
                12560
            ],
            [
                12560,
                12575
            ],
            [
                12575,
                12668
            ],
            [
                12668,
                12711
            ],
            [
                12711,
                12781
            ],
            [
                12781,
                12793
            ],
            [
                12793,
                12811
            ],
            [
                12811,
                12873
            ],
            [
                12873,
                12917
            ],
            [
                12917,
                12949
            ],
            [
                12949,
                12997
            ],
            [
                12997,
                13005
            ],
            [
                13005,
                13104
            ],
            [
                13104,
                13252
            ],
            [
                13252,
                13370
            ],
            [
                13370,
                13450
            ],
            [
                13450,
                13549
            ],
            [
                13549,
                13671
            ],
            [
                13671,
                13685
            ],
            [
                13685,
                13717
            ],
            [
                13717,
                13745
            ],
            [
                13745,
                13780
            ],
            [
                13780,
                13825
            ],
            [
                13825,
                13884
            ],
            [
                13884,
                14083
            ],
            [
                14083,
                14141
            ],
            [
                14141,
                14191
            ],
            [
                14191,
                14201
            ],
            [
                14201,
                14249
            ],
            [
                14249,
                14276
            ],
            [
                14276,
                14300
            ],
            [
                14300,
                14426
            ],
            [
                14426,
                14434
            ],
            [
                14434,
                14485
            ],
            [
                14485,
                14504
            ],
            [
                14504,
                14524
            ],
            [
                14524,
                14678
            ],
            [
                14678,
                14716
            ],
            [
                14716,
                14807
            ],
            [
                14807,
                14878
            ],
            [
                14878,
                14981
            ],
            [
                14981,
                15030
            ],
            [
                15030,
                15062
            ],
            [
                15062,
                15133
            ],
            [
                15133,
                15287
            ],
            [
                15287,
                15336
            ],
            [
                15336,
                15349
            ],
            [
                15349,
                15385
            ],
            [
                15385,
                15491
            ],
            [
                15491,
                15633
            ],
            [
                15633,
                15735
            ],
            [
                15735,
                15836
            ],
            [
                15836,
                15866
            ],
            [
                15866,
                16379
            ],
            [
                16379,
                16518
            ],
            [
                16518,
                16559
            ],
            [
                16559,
                17174
            ],
            [
                17174,
                17282
            ],
            [
                17282,
                17346
            ],
            [
                17346,
                17457
            ],
            [
                17457,
                17527
            ],
            [
                17527,
                17641
            ],
            [
                17641,
                17807
            ],
            [
                17807,
                17906
            ],
            [
                17906,
                17971
            ],
            [
                17971,
                18032
            ],
            [
                18032,
                18145
            ],
            [
                18145,
                18215
            ],
            [
                18215,
                18330
            ],
            [
                18330,
                18457
            ],
            [
                18457,
                18499
            ],
            [
                18499,
                18601
            ],
            [
                18601,
                18703
            ],
            [
                18703,
                18863
            ],
            [
                18863,
                19184
            ],
            [
                19184,
                19317
            ],
            [
                19317,
                19344
            ],
            [
                19344,
                19381
            ],
            [
                19381,
                19428
            ],
            [
                19428,
                19443
            ],
            [
                19443,
                19531
            ],
            [
                19531,
                19547
            ],
            [
                19547,
                19586
            ],
            [
                19586,
                19638
            ],
            [
                19638,
                19733
            ],
            [
                19733,
                19790
            ],
            [
                19790,
                19822
            ],
            [
                19822,
                19942
            ],
            [
                19942,
                19977
            ],
            [
                19977,
                20040
            ],
            [
                20040,
                20158
            ],
            [
                20158,
                20204
            ],
            [
                20204,
                20269
            ],
            [
                20269,
                20338
            ],
            [
                20338,
                20365
            ],
            [
                20365,
                20421
            ],
            [
                20421,
                20522
            ],
            [
                20522,
                20592
            ],
            [
                20592,
                20708
            ],
            [
                20708,
                20775
            ],
            [
                20775,
                20813
            ],
            [
                20813,
                20918
            ],
            [
                20918,
                21063
            ],
            [
                21063,
                21242
            ],
            [
                21242,
                21312
            ],
            [
                21312,
                21414
            ],
            [
                21414,
                21467
            ],
            [
                21467,
                21482
            ],
            [
                21482,
                21504
            ],
            [
                21504,
                21518
            ],
            [
                21518,
                21643
            ],
            [
                21643,
                21765
            ],
            [
                21765,
                21841
            ],
            [
                21841,
                21877
            ],
            [
                21877,
                21972
            ],
            [
                21972,
                22020
            ],
            [
                22020,
                22060
            ],
            [
                22060,
                22134
            ],
            [
                22134,
                22191
            ],
            [
                22191,
                22276
            ],
            [
                22276,
                22298
            ],
            [
                22298,
                22303
            ],
            [
                22303,
                22526
            ],
            [
                22526,
                22554
            ],
            [
                22554,
                22669
            ],
            [
                22669,
                22731
            ],
            [
                22731,
                22839
            ],
            [
                22839,
                22955
            ],
            [
                22955,
                23055
            ],
            [
                23055,
                23089
            ],
            [
                23089,
                23110
            ],
            [
                23110,
                23206
            ],
            [
                23206,
                23248
            ],
            [
                23248,
                23301
            ],
            [
                23301,
                23345
            ],
            [
                23345,
                23451
            ],
            [
                23451,
                23489
            ],
            [
                23489,
                23547
            ],
            [
                23547,
                23592
            ],
            [
                23592,
                23622
            ],
            [
                23622,
                23704
            ],
            [
                23704,
                23741
            ],
            [
                23741,
                23882
            ],
            [
                23882,
                23925
            ],
            [
                23925,
                23949
            ],
            [
                23949,
                24056
            ],
            [
                24056,
                24162
            ],
            [
                24162,
                24214
            ],
            [
                24214,
                24310
            ],
            [
                24310,
                24364
            ],
            [
                24364,
                24438
            ],
            [
                24438,
                24462
            ],
            [
                24462,
                24618
            ]
        ]
    },
    "abridged": {
        "text": "What Ruby had said about her connection with Mrs. Pipkin was true. Ruby's father had married a Pipkin whose brother had died, leaving a widow at Islington. The old man at Sheep's Acre farm had resented this marriage, and had never spoken to his daughter-in-law.\nWhen Ruby ran away from Suffolk she did the best she could in going to her aunt's house. Mrs. Pipkin was a poor woman, and could not offer a permanent home to Ruby; but she was good-natured, and came to terms with her. Ruby was to stay for a month, and to work in the house for her bread. But she made it a part of her bargain that she should be allowed to go out occasionally.\nMrs. Pipkin immediately asked about a lover. \"I'm all right,\" said Ruby. If the lover was what he ought to be, should he not come and see her? This was Mrs. Pipkin's suggestion, so that scandal might be avoided.\n\"Maybe, by-and-by,\" said Ruby. Then she told the story of John Crumb: how she hated John Crumb, and would not marry him. She gave her own account of that night on which John Crumb and Mr. Mixet ate their supper at the farm, and how her grandfather had treated her.\nMrs. Pipkin was a respectable woman in her way, and she gave Ruby very good advice. Of course if she was \"dead-set\" against John Crumb, that was one thing! But a young woman should look to a decent house over her head, and food. \"What's all the love in the world, Ruby, if a man can't do for you?\"\nRuby declared that she knew somebody who could do very well for her. She knew what she was about. Mrs. Pipkin had an idea that young women in these days had more liberty than was allowed when she was young. The world was changing very fast. And therefore when Ruby went to the theatre, probably in company with her lover, and did not get home till past midnight, Mrs. Pipkin said very little.\nRuby had never told her lover's name to Mrs. Pipkin. She had been managing her own affairs; but now that Mr. Montague had found her, the Squire would be after her, and then John Crumb would come, accompanied of course by Mr. Mixet - and after that, as she said to herself, \"the fat would be in the fire.\"\n\"Who do you think was at our place yesterday?\" said Ruby one evening to her lover. They were sitting together at a music-hall. Sir Felix was dressed, as he called it, \"incognito,\" with a blue silk cravat, and a green coat. He had an idea that if his West End friends saw him in this attire they would not know him. He was smoking, and had before him a glass of hot brandy and water, shared by Ruby. Poor Ruby! She was half-ashamed, half-frightened, and yet felt that it was a grand thing to have got rid of restraints, and be with her young man. Why not? The Miss Longestaffes were allowed to walk about with their young men. Why was she to be given up to a great mass of stupid dust like John Crumb, without seeing anything of the world?\nYet as she sat sipping brandy and water at the music-hall in the City Road, she was not altogether comfortable. She saw things which she did not like to see, and she heard things which she did not like to hear. And her lover, though he was beautiful - oh, so beautiful! - was not all that a lover should be. She was still a little afraid of him, and did not dare to ask him for the promise which she expected him to make. Her mind was set upon marriage, but the word had hardly passed between them. To have his arm round her waist was heaven to her! But how was this to go on? Even Mrs. Pipkin made disagreeable allusions, and she could not live always with Mrs. Pipkin. She was glad therefore to tell her lover that something was going to happen. \"Who do you suppose was at our place yesterday?\"\nSir Felix changed colour, thinking of Marie Melmotte; perhaps Didon had been there. He had had an interview with Didon, and nothing was lacking for the New York journey but the money. Didon had urged him to recover his funds from Melmotte. Therefore his mind was in Grosvenor Square.\n\"Who was it, Ruby?\"\n\"A friend of the Squire's, a Mr. Montague.\"\n\"Paul Montague!\"\n\"Do you know him, Felix?\"\n\"Rather. He's a member of our club. He's a prig of a fellow.\"\n\"He's got a lady friend where I live.\"\n\"The devil he has!\" Sir Felix of course knew of Roger Carbury's suit to his sister, and her supposed preference for Paul Montague. \"Who is she, Ruby?\"\n\"She's a Mrs. Hurtle. Such a stunning woman! Aunt says she's an American. She's got lots of money.\"\n\"Is Montague going to marry her?\"\n\"Oh yes. It's all arranged. Mr. Montague comes quite regular to see her; not so regular as he ought, though. When gentlemen are fixed to be married, they never are regular afterwards. I wonder whether it'll be the same with you?\"\n\"Wasn't John Crumb regular, Ruby?\"\n\"Bother John Crumb! Oh, he'd been regular as clockwork if I let him - only the slowest clock out. But Mr. Montague has told the Squire as he saw me, and the Squire's coming. What am I to tell him, Felix?\"\n\"Tell him to mind his own business. He can't do anything to you.\"\n\"No; I ain't done nothing wrong. But he can talk, and I ain't one of those as don't mind about their characters. Shall I tell him as I'm with you?\"\n\"Gracious goodness, no! What would you say that for?\"\n\"But aunt will be letting on about my being out late o'nights. He'll be asking who I'm with.\"\n\"Your aunt does not know?\"\n\"No; I've told nobody. But it won't do to go on like that always, will it?\"\n\"It's very jolly, I think.\"\n\"It ain't jolly for me. Of course, Felix, I like to be with you. But I'm pretty nigh ashamed of myself. Yes, I am.\" And now Ruby burst into tears. \"Because I wouldn't have John Crumb, I didn't mean to be a bad girl. Nor yet I won't. But what'll I do, if everybody turns again me? Aunt said last night that-\"\n\"Bother what she says!\"\n\"She knows there's somebody. She ain't a fool. She says that whoever it is ought to speak out. And she's right. A girl has to mind herself, though she's ever so fond of a young man.\"\nSir Felix took a long drink of brandy and water. Then he called the waiter for another, intending to avoid making any reply to Ruby. He was going to New York very shortly, and he had not troubled himself to think how it might be with Ruby when he was gone. He had not even considered whether he would tell her that he was going. It was not his fault that she had come up to London. He liked the intrigue better perhaps than the girl herself. But he told himself that he wasn't going to give himself any trouble; and the idea of John Crumb coming to London in his wrath had never occurred to him.\n\"Let's go and have a dance,\" he said.\nRuby was very fond of dancing. It was delightful to be spinning round the room with her lover's arm tight round her waist. She loved the music, and the motion. She could spin along and dance a whole room down, and feel that the world could hold nothing better. So she went and danced, resolving to have some answer to her question before she left her lover that night.\n\"Now I must go,\" she said at last. \"What am I to say to the Squire?\"\n\"Say nothing.\"\n\"And what am I to say to aunt?\"\n\"Just say what you have said all along.\"\n\"I've said nothing all along. I must say something. A girl has got herself to mind. What have you got to say to me, Felix?\"\nHe was silent for about a minute. \"If you bother me I shall cut it, you know.\"\n\"Cut it!\"\n\"Yes. Can't you wait till I am ready to say something?\"\n\"Waiting will be the ruin o' me, if I wait much longer. Where am I to go, if Mrs. Pipkin won't have me no more?\"\n\"I'll find a place for you.\"\n\"You find a place! No; that won't do. I've told you all that before. I'd sooner go into service, or-\"\n\"Go back to John Crumb.\"\n\"John Crumb has more respect for me nor you. He'd make me his wife tomorrow, and be only too happy.\"\n\"I didn't tell you to come away from him,\" said Sir Felix.\n\"Yes, you did. You told me as I was to come up to London when I saw you at Sheepstone Beeches; didn't you? And you told me you loved me; didn't you? And that if I wanted anything you'd get it done for me; didn't you?\"\n\"So I will. What do you want? I can give you a couple of sovereigns, if that's what it is.\"\n\"No it isn't. I won't have your money. I'd sooner work my fingers off. I want you to say whether you mean to marry me. There!\"\nAn additional lie would have been nothing to Felix. He was going to New York, out of the way of any trouble; and he thought that lies of that kind to young women never mattered. Young women didn't believe them, but liked to be able to believe afterwards that they had been deceived. It wasn't the lie that stuck in his throat, but the fact that he was a baronet. He felt it was \"confounded impudence\" by Ruby Ruggles to ask to be his wife.\n\"Marry, Ruby! No, I don't ever mean to marry. It's the greatest bore out.\"\nShe stopped in the street and looked at him. This was a state of things of which she had never dreamed. What business had such a man to go after any young woman?\n\"And what do you mean that I'm to do, Sir Felix?\" she said.\n\"Just go easy, and not make yourself a bother.\"\n\"Not make myself a bother! Oh, but I will. I'm to be carrying on with you, and nothing to come of it; but for you to tell me that you don't mean to marry! Never?\"\n\"Don't you see lots of old bachelors about, Ruby?\"\n\"Of course I does. There's the Squire. If he came asking a girl to keep him company, he'd marry her - because he's a gentleman.\" Ruby began to cry. \"You mustn't come no further now, and I'll never see you again - never! I think you're the falsest young man, and the basest, that I ever heard tell of. You go your way, and I'll go mine.\"\nIn her passion she was as good as her word, and escaped from him, running all the way to her aunt's door. There was in her mind an anger against him, which she did not herself understand, that he would take no risk on her behalf. He would not even make a lover's easy promise to make the evening pleasant. Ruby let herself into her aunt's house, and cried herself to sleep.\nOn the next day Roger called. Ruby had begged Mrs. Pipkin to tell any gentleman callers that she was out; but Mrs. Pipkin, having heard something of Roger Carbury, decided that the Squire should see the young lady.\nWhen therefore Ruby was called into the little back parlour and found Roger there, she thought that she had been caught in a trap. She had been very cross all morning. Though in her rage she had been able on the previous evening to dismiss Felix, now she almost regretted it. Could it be that she would never see him again - that she would dance no more in that gilded bright saloon? Maybe she had pressed him too hard. A baronet would not like to be brought to book. But to have said that he would never marry! She was very unhappy.\nRoger was very kind to her, taking her by the hand, and telling her how glad he was to find her comfortably settled with her aunt.\n\"We were all alarmed, of course, when you went away without telling anybody where you were going.\"\n\"Grandfather'd been that cruel to me that I couldn't tell him.\"\n\"He wanted you to keep your word.\"\n\"To pull me about by my hair wasn't the way to make a girl keep her word; was it, Mr. Carbury? I've been good to grandfather, and he shouldn't have treated me like that.\"\nThe Squire had no answer to this. That old Ruggles should be a violent brute under the influence of gin did not surprise him. And the girl had not done amiss in coming to her aunt. But Roger had already heard from Mrs. Pipkin about Ruby's late hours, and a lover, and knew who that lover was. He also knew that John Crumb was a gallant, loving fellow who might forgive everything if Ruby would only go back to him; but would certainly persevere, after his slow fashion, and \"see the matter out\" if she did not go back.\n\"I'm glad that you should be here,\" said Roger; \"but you don't mean to stay here always?\"\n\"I don't know,\" said Ruby.\n\"You must think of your future life. You don't want to be always your aunt's maid.\"\n\"Oh dear, no.\"\n\"It would be very odd if you did, when you may be the wife of such a man as Mr. Crumb.\"\n\"Oh, Mr. Crumb! Everybody is going on about Mr. Crumb. I don't like him and I never will like him.\"\n\"Now look here, Ruby; I have come to speak to you very seriously. Nobody can make you marry Mr. Crumb. But I fear you have given him up for somebody else, who certainly won't marry you, and who can only mean to ruin you.\"\n\"Nobody won't ruin me,\" said Ruby. \"I mean to look to myself.\"\n\"I'm glad to hear you say so, but being out at night with Sir Felix Carbury is not looking to yourself. That means going to the devil head foremost.\"\n\"I ain't a going to the devil,\" said Ruby, sobbing and blushing.\n\"But you will, if you put yourself into the hands of that bad young man. He has no idea of marrying you, and if he did, he could not support you. He is ruined himself, and would ruin any young woman who trusted him. Though he is my cousin, I never came across so vile a young man as he is. He would ruin you and cast you away without a pang of remorse. He has no heart.\" Ruby was sobbing with her apron to her eyes. \"And it is for that vile man that you have left a man who is as much above him in character, as the sun is above the earth. You think little of John Crumb because he does not wear a fine coat.\"\n\"I don't care about any man's coat,\" said Ruby; \"but John hasn't ever a word to say.\"\n\"Words! What do words matter? He loves you. He wants to make you happy and respectable, not to disgrace you. He thinks more of you than of himself, and would give you all that he has. What would that other man give you? If you were once married to John Crumb, would anyone then pull you by the hair? Would there be any disgrace?\"\n\"There ain't no disgrace, Mr. Carbury.\"\n\"No disgrace in going about at midnight with Felix Carbury? You know that it is disgraceful. If you are fit to be an honest man's wife, go back and beg that man's pardon.\"\n\"John Crumb's pardon! No!\"\n\"Ruby, if you knew how highly I respect him, and how lowly I think of the other; how I look on the one as a noble fellow, and regard the other as dust beneath my feet, you would perhaps change your mind.\"\nHer mind was being changed. His words had their effect, though the poor girl struggled against it. She had never expected to hear anyone call John Crumb noble. She respected no one more highly than Squire Carbury. Amidst all her misery she still told herself that it was but a dusty, dumb nobility.\n\"Mr. Crumb won't put up with this, you know,\" continued Roger.\n\"He can't do nothing to me, sir.\"\n\"That's true enough. Unless it be to take you in his arms, he wants to do nothing to you. Do you think he'd injure you? You don't know what a man's love really means, Ruby. But he could do something to somebody else. How do you think it would be with Felix Carbury, if they two met?\"\n\"John's mortal strong.\"\n\"One is a brave man, and the other a coward. You know it as well as I do; and you're throwing yourself away, and throwing over the man who loves you - for such a fellow as that! Go back to him, Ruby, and beg his pardon.\"\n\"I never will; never.\"\n\"I've spoken to Mrs. Pipkin, and while you're here she will see that you don't keep such late hours any longer. I'm going now. But I'll come again. If you want money to go home, I will let you have it. Take my advice: do not see Sir Felix Carbury any more.\"\nThen he took his leave. If he had failed to impress her with admiration for John Crumb, he had certainly succeeded in lessening her admiration for Sir Felix.",
        "paragraph_chars": [
            [
                0,
                262
            ],
            [
                262,
                640
            ],
            [
                640,
                852
            ],
            [
                852,
                1117
            ],
            [
                1117,
                1415
            ],
            [
                1415,
                1808
            ],
            [
                1808,
                2113
            ],
            [
                2113,
                2852
            ],
            [
                2852,
                3649
            ],
            [
                3649,
                3933
            ],
            [
                3933,
                3953
            ],
            [
                3953,
                3997
            ],
            [
                3997,
                4014
            ],
            [
                4014,
                4040
            ],
            [
                4040,
                4102
            ],
            [
                4102,
                4141
            ],
            [
                4141,
                4292
            ],
            [
                4292,
                4392
            ],
            [
                4392,
                4426
            ],
            [
                4426,
                4656
            ],
            [
                4656,
                4691
            ],
            [
                4691,
                4896
            ],
            [
                4896,
                4962
            ],
            [
                4962,
                5110
            ],
            [
                5110,
                5164
            ],
            [
                5164,
                5258
            ],
            [
                5258,
                5285
            ],
            [
                5285,
                5361
            ],
            [
                5361,
                5389
            ],
            [
                5389,
                5697
            ],
            [
                5697,
                5721
            ],
            [
                5721,
                5904
            ],
            [
                5904,
                6500
            ],
            [
                6500,
                6538
            ],
            [
                6538,
                6907
            ],
            [
                6907,
                6976
            ],
            [
                6976,
                6991
            ],
            [
                6991,
                7023
            ],
            [
                7023,
                7064
            ],
            [
                7064,
                7188
            ],
            [
                7188,
                7267
            ],
            [
                7267,
                7277
            ],
            [
                7277,
                7333
            ],
            [
                7333,
                7446
            ],
            [
                7446,
                7475
            ],
            [
                7475,
                7577
            ],
            [
                7577,
                7602
            ],
            [
                7602,
                7703
            ],
            [
                7703,
                7762
            ],
            [
                7762,
                7980
            ],
            [
                7980,
                8072
            ],
            [
                8072,
                8199
            ],
            [
                8199,
                8639
            ],
            [
                8639,
                8714
            ],
            [
                8714,
                8876
            ],
            [
                8876,
                8936
            ],
            [
                8936,
                8984
            ],
            [
                8984,
                9147
            ],
            [
                9147,
                9198
            ],
            [
                9198,
                9535
            ],
            [
                9535,
                9909
            ],
            [
                9909,
                10124
            ],
            [
                10124,
                10658
            ],
            [
                10658,
                10789
            ],
            [
                10789,
                10888
            ],
            [
                10888,
                10952
            ],
            [
                10952,
                10987
            ],
            [
                10987,
                11158
            ],
            [
                11158,
                11677
            ],
            [
                11677,
                11767
            ],
            [
                11767,
                11794
            ],
            [
                11794,
                11878
            ],
            [
                11878,
                11893
            ],
            [
                11893,
                11981
            ],
            [
                11981,
                12081
            ],
            [
                12081,
                12303
            ],
            [
                12303,
                12366
            ],
            [
                12366,
                12516
            ],
            [
                12516,
                12581
            ],
            [
                12581,
                13191
            ],
            [
                13191,
                13277
            ],
            [
                13277,
                13607
            ],
            [
                13607,
                13647
            ],
            [
                13647,
                13819
            ],
            [
                13819,
                13846
            ],
            [
                13846,
                14051
            ],
            [
                14051,
                14350
            ],
            [
                14350,
                14413
            ],
            [
                14413,
                14447
            ],
            [
                14447,
                14731
            ],
            [
                14731,
                14755
            ],
            [
                14755,
                14976
            ],
            [
                14976,
                14999
            ],
            [
                14999,
                15257
            ],
            [
                15257,
                15414
            ]
        ],
        "segment_chars": [
            [
                0,
                67
            ],
            [
                67,
                156
            ],
            [
                156,
                262
            ],
            [
                262,
                351
            ],
            [
                351,
                481
            ],
            [
                481,
                551
            ],
            [
                551,
                640
            ],
            [
                640,
                685
            ],
            [
                685,
                713
            ],
            [
                713,
                783
            ],
            [
                783,
                852
            ],
            [
                852,
                883
            ],
            [
                883,
                973
            ],
            [
                973,
                1117
            ],
            [
                1117,
                1201
            ],
            [
                1201,
                1273
            ],
            [
                1273,
                1346
            ],
            [
                1346,
                1415
            ],
            [
                1415,
                1484
            ],
            [
                1484,
                1513
            ],
            [
                1513,
                1622
            ],
            [
                1622,
                1656
            ],
            [
                1656,
                1808
            ],
            [
                1808,
                1861
            ],
            [
                1861,
                2113
            ],
            [
                2113,
                2160
            ],
            [
                2160,
                2196
            ],
            [
                2196,
                2240
            ],
            [
                2240,
                2336
            ],
            [
                2336,
                2428
            ],
            [
                2428,
                2512
            ],
            [
                2512,
                2523
            ],
            [
                2523,
                2659
            ],
            [
                2659,
                2668
            ],
            [
                2668,
                2739
            ],
            [
                2739,
                2852
            ],
            [
                2852,
                2964
            ],
            [
                2964,
                3063
            ],
            [
                3063,
                3122
            ],
            [
                3122,
                3160
            ],
            [
                3160,
                3274
            ],
            [
                3274,
                3351
            ],
            [
                3351,
                3402
            ],
            [
                3402,
                3429
            ],
            [
                3429,
                3523
            ],
            [
                3523,
                3600
            ],
            [
                3600,
                3649
            ],
            [
                3649,
                3733
            ],
            [
                3733,
                3833
            ],
            [
                3833,
                3889
            ],
            [
                3889,
                3933
            ],
            [
                3933,
                3953
            ],
            [
                3953,
                3997
            ],
            [
                3997,
                4014
            ],
            [
                4014,
                4040
            ],
            [
                4040,
                4049
            ],
            [
                4049,
                4076
            ],
            [
                4076,
                4102
            ],
            [
                4102,
                4141
            ],
            [
                4141,
                4161
            ],
            [
                4161,
                4272
            ],
            [
                4272,
                4292
            ],
            [
                4292,
                4314
            ],
            [
                4314,
                4337
            ],
            [
                4337,
                4366
            ],
            [
                4366,
                4392
            ],
            [
                4392,
                4426
            ],
            [
                4426,
                4435
            ],
            [
                4435,
                4454
            ],
            [
                4454,
                4535
            ],
            [
                4535,
                4610
            ],
            [
                4610,
                4656
            ],
            [
                4656,
                4691
            ],
            [
                4691,
                4711
            ],
            [
                4711,
                4789
            ],
            [
                4789,
                4865
            ],
            [
                4865,
                4896
            ],
            [
                4896,
                4932
            ],
            [
                4932,
                4962
            ],
            [
                4962,
                4995
            ],
            [
                4995,
                5075
            ],
            [
                5075,
                5110
            ],
            [
                5110,
                5134
            ],
            [
                5134,
                5164
            ],
            [
                5164,
                5227
            ],
            [
                5227,
                5258
            ],
            [
                5258,
                5285
            ],
            [
                5285,
                5308
            ],
            [
                5308,
                5361
            ],
            [
                5361,
                5389
            ],
            [
                5389,
                5413
            ],
            [
                5413,
                5454
            ],
            [
                5454,
                5493
            ],
            [
                5493,
                5505
            ],
            [
                5505,
                5536
            ],
            [
                5536,
                5605
            ],
            [
                5605,
                5622
            ],
            [
                5622,
                5669
            ],
            [
                5669,
                5697
            ],
            [
                5697,
                5721
            ],
            [
                5721,
                5750
            ],
            [
                5750,
                5768
            ],
            [
                5768,
                5816
            ],
            [
                5816,
                5833
            ],
            [
                5833,
                5904
            ],
            [
                5904,
                5953
            ],
            [
                5953,
                6037
            ],
            [
                6037,
                6161
            ],
            [
                6161,
                6233
            ],
            [
                6233,
                6286
            ],
            [
                6286,
                6346
            ],
            [
                6346,
                6500
            ],
            [
                6500,
                6538
            ],
            [
                6538,
                6569
            ],
            [
                6569,
                6661
            ],
            [
                6661,
                6698
            ],
            [
                6698,
                6799
            ],
            [
                6799,
                6907
            ],
            [
                6907,
                6942
            ],
            [
                6942,
                6976
            ],
            [
                6976,
                6991
            ],
            [
                6991,
                7023
            ],
            [
                7023,
                7064
            ],
            [
                7064,
                7094
            ],
            [
                7094,
                7116
            ],
            [
                7116,
                7148
            ],
            [
                7148,
                7188
            ],
            [
                7188,
                7222
            ],
            [
                7222,
                7267
            ],
            [
                7267,
                7277
            ],
            [
                7277,
                7283
            ],
            [
                7283,
                7333
            ],
            [
                7333,
                7389
            ],
            [
                7389,
                7446
            ],
            [
                7446,
                7475
            ],
            [
                7475,
                7494
            ],
            [
                7494,
                7513
            ],
            [
                7513,
                7544
            ],
            [
                7544,
                7577
            ],
            [
                7577,
                7602
            ],
            [
                7602,
                7647
            ],
            [
                7647,
                7703
            ],
            [
                7703,
                7762
            ],
            [
                7762,
                7777
            ],
            [
                7777,
                7869
            ],
            [
                7869,
                7911
            ],
            [
                7911,
                7980
            ],
            [
                7980,
                7992
            ],
            [
                7992,
                8010
            ],
            [
                8010,
                8072
            ],
            [
                8072,
                8086
            ],
            [
                8086,
                8111
            ],
            [
                8111,
                8143
            ],
            [
                8143,
                8191
            ],
            [
                8191,
                8199
            ],
            [
                8199,
                8251
            ],
            [
                8251,
                8377
            ],
            [
                8377,
                8482
            ],
            [
                8482,
                8562
            ],
            [
                8562,
                8639
            ],
            [
                8639,
                8653
            ],
            [
                8653,
                8685
            ],
            [
                8685,
                8714
            ],
            [
                8714,
                8759
            ],
            [
                8759,
                8818
            ],
            [
                8818,
                8876
            ],
            [
                8876,
                8926
            ],
            [
                8926,
                8936
            ],
            [
                8936,
                8984
            ],
            [
                8984,
                9011
            ],
            [
                9011,
                9027
            ],
            [
                9027,
                9139
            ],
            [
                9139,
                9147
            ],
            [
                9147,
                9198
            ],
            [
                9198,
                9217
            ],
            [
                9217,
                9237
            ],
            [
                9237,
                9327
            ],
            [
                9327,
                9346
            ],
            [
                9346,
                9418
            ],
            [
                9418,
                9499
            ],
            [
                9499,
                9535
            ],
            [
                9535,
                9641
            ],
            [
                9641,
                9765
            ],
            [
                9765,
                9841
            ],
            [
                9841,
                9909
            ],
            [
                9909,
                9939
            ],
            [
                9939,
                10124
            ],
            [
                10124,
                10255
            ],
            [
                10255,
                10292
            ],
            [
                10292,
                10400
            ],
            [
                10400,
                10508
            ],
            [
                10508,
                10544
            ],
            [
                10544,
                10592
            ],
            [
                10592,
                10636
            ],
            [
                10636,
                10658
            ],
            [
                10658,
                10789
            ],
            [
                10789,
                10888
            ],
            [
                10888,
                10952
            ],
            [
                10952,
                10987
            ],
            [
                10987,
                11082
            ],
            [
                11082,
                11158
            ],
            [
                11158,
                11192
            ],
            [
                11192,
                11284
            ],
            [
                11284,
                11339
            ],
            [
                11339,
                11451
            ],
            [
                11451,
                11677
            ],
            [
                11677,
                11767
            ],
            [
                11767,
                11794
            ],
            [
                11794,
                11831
            ],
            [
                11831,
                11878
            ],
            [
                11878,
                11893
            ],
            [
                11893,
                11981
            ],
            [
                11981,
                11997
            ],
            [
                11997,
                12036
            ],
            [
                12036,
                12081
            ],
            [
                12081,
                12147
            ],
            [
                12147,
                12184
            ],
            [
                12184,
                12303
            ],
            [
                12303,
                12338
            ],
            [
                12338,
                12366
            ],
            [
                12366,
                12470
            ],
            [
                12470,
                12516
            ],
            [
                12516,
                12581
            ],
            [
                12581,
                12654
            ],
            [
                12654,
                12727
            ],
            [
                12727,
                12797
            ],
            [
                12797,
                12871
            ],
            [
                12871,
                12934
            ],
            [
                12934,
                12952
            ],
            [
                12952,
                12997
            ],
            [
                12997,
                13121
            ],
            [
                13121,
                13191
            ],
            [
                13191,
                13277
            ],
            [
                13277,
                13285
            ],
            [
                13285,
                13307
            ],
            [
                13307,
                13321
            ],
            [
                13321,
                13386
            ],
            [
                13386,
                13461
            ],
            [
                13461,
                13497
            ],
            [
                13497,
                13577
            ],
            [
                13577,
                13607
            ],
            [
                13607,
                13647
            ],
            [
                13647,
                13707
            ],
            [
                13707,
                13740
            ],
            [
                13740,
                13819
            ],
            [
                13819,
                13841
            ],
            [
                13841,
                13846
            ],
            [
                13846,
                14051
            ],
            [
                14051,
                14079
            ],
            [
                14079,
                14150
            ],
            [
                14150,
                14211
            ],
            [
                14211,
                14265
            ],
            [
                14265,
                14350
            ],
            [
                14350,
                14413
            ],
            [
                14413,
                14447
            ],
            [
                14447,
                14468
            ],
            [
                14468,
                14537
            ],
            [
                14537,
                14567
            ],
            [
                14567,
                14620
            ],
            [
                14620,
                14664
            ],
            [
                14664,
                14731
            ],
            [
                14731,
                14755
            ],
            [
                14755,
                14800
            ],
            [
                14800,
                14933
            ],
            [
                14933,
                14976
            ],
            [
                14976,
                14999
            ],
            [
                14999,
                15111
            ],
            [
                15111,
                15126
            ],
            [
                15126,
                15147
            ],
            [
                15147,
                15201
            ],
            [
                15201,
                15257
            ],
            [
                15257,
                15281
            ],
            [
                15281,
                15414
            ]
        ],
        "overlap_chars": [
            [
                5,
                9
            ],
            [
                25,
                60
            ],
            [
                61,
                67
            ],
            [
                67,
                124
            ],
            [
                126,
                141
            ],
            [
                142,
                156
            ],
            [
                156,
                192
            ],
            [
                193,
                216
            ],
            [
                217,
                220
            ],
            [
                221,
                260
            ],
            [
                260,
                261
            ],
            [
                262,
                266
            ],
            [
                272,
                320
            ],
            [
                321,
                351
            ],
            [
                351,
                470
            ],
            [
                479,
                481
            ],
            [
                481,
                492
            ],
            [
                493,
                497
            ],
            [
                498,
                514
            ],
            [
                515,
                551
            ],
            [
                551,
                639
            ],
            [
                640,
                669
            ],
            [
                676,
                685
            ],
            [
                685,
                713
            ],
            [
                713,
                750
            ],
            [
                758,
                764
            ],
            [
                765,
                783
            ],
            [
                783,
                816
            ],
            [
                821,
                839
            ],
            [
                840,
                851
            ],
            [
                852,
                853
            ],
            [
                858,
                883
            ],
            [
                883,
                896
            ],
            [
                897,
                921
            ],
            [
                922,
                946
            ],
            [
                962,
                967
            ],
            [
                971,
                973
            ],
            [
                973,
                1079
            ],
            [
                1084,
                1115
            ],
            [
                1115,
                1116
            ],
            [
                1117,
                1164
            ],
            [
                1169,
                1201
            ],
            [
                1201,
                1273
            ],
            [
                1273,
                1276
            ],
            [
                1277,
                1305
            ],
            [
                1306,
                1335
            ],
            [
                1336,
                1339
            ],
            [
                1344,
                1346
            ],
            [
                1346,
                1414
            ],
            [
                1415,
                1464
            ],
            [
                1465,
                1484
            ],
            [
                1484,
                1511
            ],
            [
                1511,
                1513
            ],
            [
                1513,
                1567
            ],
            [
                1572,
                1622
            ],
            [
                1622,
                1635
            ],
            [
                1645,
                1656
            ],
            [
                1656,
                1699
            ],
            [
                1699,
                1700
            ],
            [
                1701,
                1736
            ],
            [
                1737,
                1806
            ],
            [
                1806,
                1807
            ],
            [
                1808,
                1822
            ],
            [
                1823,
                1827
            ],
            [
                1828,
                1837
            ],
            [
                1840,
                1844
            ],
            [
                1845,
                1859
            ],
            [
                1859,
                1861
            ],
            [
                1861,
                1898
            ],
            [
                1898,
                1907
            ],
            [
                1908,
                1912
            ],
            [
                1913,
                1939
            ],
            [
                1939,
                1940
            ],
            [
                1941,
                2038
            ],
            [
                2041,
                2079
            ],
            [
                2079,
                2113
            ],
            [
                2113,
                2160
            ],
            [
                2160,
                2196
            ],
            [
                2196,
                2238
            ],
            [
                2238,
                2240
            ],
            [
                2240,
                2253
            ],
            [
                2254,
                2268
            ],
            [
                2269,
                2297
            ],
            [
                2298,
                2336
            ],
            [
                2343,
                2355
            ],
            [
                2359,
                2379
            ],
            [
                2384,
                2428
            ],
            [
                2428,
                2495
            ],
            [
                2506,
                2512
            ],
            [
                2512,
                2523
            ],
            [
                2523,
                2543
            ],
            [
                2543,
                2569
            ],
            [
                2575,
                2638
            ],
            [
                2639,
                2659
            ],
            [
                2659,
                2668
            ],
            [
                2668,
                2705
            ],
            [
                2706,
                2737
            ],
            [
                2737,
                2739
            ],
            [
                2739,
                2851
            ],
            [
                2852,
                2874
            ],
            [
                2875,
                2891
            ],
            [
                2892,
                2964
            ],
            [
                2964,
                3008
            ],
            [
                3010,
                3063
            ],
            [
                3063,
                3101
            ],
            [
                3104,
                3120
            ],
            [
                3124,
                3160
            ],
            [
                3160,
                3214
            ],
            [
                3215,
                3272
            ],
            [
                3272,
                3274
            ],
            [
                3274,
                3295
            ],
            [
                3296,
                3351
            ],
            [
                3351,
                3402
            ],
            [
                3402,
                3429
            ],
            [
                3429,
                3521
            ],
            [
                3521,
                3523
            ],
            [
                3523,
                3548
            ],
            [
                3554,
                3600
            ],
            [
                3600,
                3649
            ],
            [
                3649,
                3701
            ],
            [
                3701,
                3716
            ],
            [
                3717,
                3731
            ],
            [
                3731,
                3733
            ],
            [
                3733,
                3784
            ],
            [
                3797,
                3800
            ],
            [
                3801,
                3809
            ],
            [
                3818,
                3833
            ],
            [
                3833,
                3842
            ],
            [
                3849,
                3863
            ],
            [
                3868,
                3873
            ],
            [
                3879,
                3887
            ],
            [
                3887,
                3889
            ],
            [
                3889,
                3898
            ],
            [
                3899,
                3911
            ],
            [
                3912,
                3932
            ],
            [
                3933,
                3953
            ],
            [
                3953,
                3994
            ],
            [
                3997,
                4014
            ],
            [
                4014,
                4040
            ],
            [
                4040,
                4041
            ],
            [
                4041,
                4049
            ],
            [
                4049,
                4074
            ],
            [
                4076,
                4102
            ],
            [
                4102,
                4141
            ],
            [
                4141,
                4161
            ],
            [
                4161,
                4180
            ],
            [
                4186,
                4228
            ],
            [
                4229,
                4232
            ],
            [
                4233,
                4241
            ],
            [
                4242,
                4272
            ],
            [
                4272,
                4292
            ],
            [
                4292,
                4293
            ],
            [
                4293,
                4314
            ],
            [
                4314,
                4337
            ],
            [
                4337,
                4366
            ],
            [
                4366,
                4392
            ],
            [
                4392,
                4426
            ],
            [
                4426,
                4429
            ],
            [
                4430,
                4435
            ],
            [
                4435,
                4454
            ],
            [
                4454,
                4498
            ],
            [
                4499,
                4535
            ],
            [
                4535,
                4559
            ],
            [
                4560,
                4610
            ],
            [
                4610,
                4656
            ],
            [
                4656,
                4691
            ],
            [
                4691,
                4711
            ],
            [
                4711,
                4732
            ],
            [
                4736,
                4745
            ],
            [
                4746,
                4750
            ],
            [
                4751,
                4758
            ],
            [
                4761,
                4789
            ],
            [
                4789,
                4809
            ],
            [
                4810,
                4838
            ],
            [
                4840,
                4843
            ],
            [
                4844,
                4863
            ],
            [
                4863,
                4865
            ],
            [
                4865,
                4896
            ],
            [
                4896,
                4932
            ],
            [
                4932,
                4962
            ],
            [
                4962,
                4966
            ],
            [
                4967,
                4993
            ],
            [
                4993,
                4995
            ],
            [
                4995,
                5011
            ],
            [
                5012,
                5015
            ],
            [
                5016,
                5036
            ],
            [
                5037,
                5073
            ],
            [
                5073,
                5075
            ],
            [
                5075,
                5110
            ],
            [
                5110,
                5134
            ],
            [
                5134,
                5164
            ],
            [
                5164,
                5225
            ],
            [
                5225,
                5227
            ],
            [
                5227,
                5242
            ],
            [
                5243,
                5246
            ],
            [
                5247,
                5248
            ],
            [
                5251,
                5255
            ],
            [
                5255,
                5258
            ],
            [
                5258,
                5285
            ],
            [
                5285,
                5289
            ],
            [
                5290,
                5306
            ],
            [
                5306,
                5308
            ],
            [
                5308,
                5342
            ],
            [
                5349,
                5350
            ],
            [
                5351,
                5358
            ],
            [
                5361,
                5389
            ],
            [
                5389,
                5413
            ],
            [
                5413,
                5454
            ],
            [
                5454,
                5457
            ],
            [
                5458,
                5493
            ],
            [
                5493,
                5505
            ],
            [
                5505,
                5523
            ],
            [
                5524,
                5536
            ],
            [
                5536,
                5605
            ],
            [
                5605,
                5622
            ],
            [
                5622,
                5669
            ],
            [
                5669,
                5673
            ],
            [
                5674,
                5694
            ],
            [
                5697,
                5720
            ],
            [
                5722,
                5750
            ],
            [
                5750,
                5759
            ],
            [
                5760,
                5766
            ],
            [
                5766,
                5768
            ],
            [
                5768,
                5814
            ],
            [
                5814,
                5816
            ],
            [
                5816,
                5833
            ],
            [
                5833,
                5904
            ],
            [
                5904,
                5913
            ],
            [
                5914,
                5953
            ],
            [
                5958,
                5960
            ],
            [
                5961,
                5967
            ],
            [
                5968,
                5978
            ],
            [
                5979,
                5990
            ],
            [
                5990,
                5991
            ],
            [
                6002,
                6010
            ],
            [
                6011,
                6021
            ],
            [
                6022,
                6035
            ],
            [
                6035,
                6037
            ],
            [
                6037,
                6079
            ],
            [
                6080,
                6161
            ],
            [
                6161,
                6204
            ],
            [
                6205,
                6231
            ],
            [
                6231,
                6233
            ],
            [
                6233,
                6286
            ],
            [
                6286,
                6294
            ],
            [
                6295,
                6346
            ],
            [
                6346,
                6352
            ],
            [
                6358,
                6406
            ],
            [
                6407,
                6414
            ],
            [
                6420,
                6449
            ],
            [
                6450,
                6498
            ],
            [
                6498,
                6499
            ],
            [
                6500,
                6509
            ],
            [
                6510,
                6538
            ],
            [
                6538,
                6567
            ],
            [
                6567,
                6569
            ],
            [
                6569,
                6575
            ],
            [
                6587,
                6611
            ],
            [
                6612,
                6659
            ],
            [
                6659,
                6661
            ],
            [
                6661,
                6685
            ],
            [
                6686,
                6698
            ],
            [
                6698,
                6756
            ],
            [
                6757,
                6777
            ],
            [
                6783,
                6790
            ],
            [
                6791,
                6797
            ],
            [
                6797,
                6799
            ],
            [
                6799,
                6801
            ],
            [
                6802,
                6832
            ],
            [
                6836,
                6894
            ],
            [
                6895,
                6907
            ],
            [
                6907,
                6908
            ],
            [
                6908,
                6942
            ],
            [
                6942,
                6976
            ],
            [
                6976,
                6991
            ],
            [
                6991,
                7023
            ],
            [
                7024,
                7064
            ],
            [
                7064,
                7092
            ],
            [
                7092,
                7094
            ],
            [
                7094,
                7116
            ],
            [
                7116,
                7148
            ],
            [
                7148,
                7188
            ],
            [
                7188,
                7220
            ],
            [
                7220,
                7222
            ],
            [
                7222,
                7267
            ],
            [
                7267,
                7277
            ],
            [
                7277,
                7281
            ],
            [
                7281,
                7283
            ],
            [
                7283,
                7333
            ],
            [
                7333,
                7389
            ],
            [
                7389,
                7446
            ],
            [
                7446,
                7475
            ],
            [
                7475,
                7494
            ],
            [
                7494,
                7513
            ],
            [
                7513,
                7544
            ],
            [
                7544,
                7574
            ],
            [
                7577,
                7602
            ],
            [
                7602,
                7647
            ],
            [
                7647,
                7668
            ],
            [
                7677,
                7682
            ],
            [
                7683,
                7685
            ],
            [
                7686,
                7690
            ],
            [
                7691,
                7703
            ],
            [
                7703,
                7762
            ],
            [
                7762,
                7777
            ],
            [
                7777,
                7856
            ],
            [
                7857,
                7869
            ],
            [
                7869,
                7898
            ],
            [
                7899,
                7911
            ],
            [
                7911,
                7966
            ],
            [
                7967,
                7980
            ],
            [
                7980,
                7992
            ],
            [
                7992,
                8010
            ],
            [
                8010,
                8072
            ],
            [
                8072,
                8084
            ],
            [
                8086,
                8111
            ],
            [
                8111,
                8143
            ],
            [
                8143,
                8191
            ],
            [
                8191,
                8199
            ],
            [
                8202,
                8216
            ],
            [
                8217,
                8243
            ],
            [
                8244,
                8249
            ],
            [
                8249,
                8251
            ],
            [
                8251,
                8276
            ],
            [
                8277,
                8366
            ],
            [
                8375,
                8377
            ],
            [
                8377,
                8388
            ],
            [
                8389,
                8482
            ],
            [
                8482,
                8562
            ],
            [
                8570,
                8576
            ],
            [
                8577,
                8599
            ],
            [
                8603,
                8638
            ],
            [
                8639,
                8653
            ],
            [
                8653,
                8685
            ],
            [
                8685,
                8711
            ],
            [
                8714,
                8759
            ],
            [
                8759,
                8818
            ],
            [
                8818,
                8875
            ],
            [
                8876,
                8926
            ],
            [
                8926,
                8936
            ],
            [
                8936,
                8984
            ],
            [
                8984,
                9011
            ],
            [
                9011,
                9025
            ],
            [
                9025,
                9027
            ],
            [
                9027,
                9137
            ],
            [
                9137,
                9139
            ],
            [
                9139,
                9147
            ],
            [
                9147,
                9198
            ],
            [
                9198,
                9217
            ],
            [
                9217,
                9237
            ],
            [
                9237,
                9242
            ],
            [
                9248,
                9254
            ],
            [
                9262,
                9281
            ],
            [
                9281,
                9282
            ],
            [
                9283,
                9297
            ],
            [
                9300,
                9324
            ],
            [
                9324,
                9326
            ],
            [
                9327,
                9346
            ],
            [
                9346,
                9408
            ],
            [
                9411,
                9418
            ],
            [
                9418,
                9471
            ],
            [
                9472,
                9499
            ],
            [
                9499,
                9534
            ],
            [
                9535,
                9641
            ],
            [
                9641,
                9662
            ],
            [
                9666,
                9679
            ],
            [
                9683,
                9722
            ],
            [
                9723,
                9736
            ],
            [
                9742,
                9765
            ],
            [
                9765,
                9810
            ],
            [
                9819,
                9822
            ],
            [
                9831,
                9841
            ],
            [
                9841,
                9907
            ],
            [
                9907,
                9909
            ],
            [
                9909,
                9939
            ],
            [
                9939,
                9943
            ],
            [
                9944,
                9969
            ],
            [
                9975,
                9988
            ],
            [
                9997,
                10001
            ],
            [
                10002,
                10005
            ],
            [
                10006,
                10013
            ],
            [
                10013,
                10018
            ],
            [
                10019,
                10030
            ],
            [
                10030,
                10044
            ],
            [
                10055,
                10071
            ],
            [
                10071,
                10072
            ],
            [
                10081,
                10096
            ],
            [
                10097,
                10123
            ],
            [
                10124,
                10199
            ],
            [
                10200,
                10255
            ],
            [
                10255,
                10282
            ],
            [
                10283,
                10292
            ],
            [
                10292,
                10363
            ],
            [
                10369,
                10374
            ],
            [
                10375,
                10395
            ],
            [
                10396,
                10398
            ],
            [
                10398,
                10400
            ],
            [
                10400,
                10446
            ],
            [
                10449,
                10508
            ],
            [
                10514,
                10542
            ],
            [
                10544,
                10553
            ],
            [
                10554,
                10590
            ],
            [
                10590,
                10592
            ],
            [
                10592,
                10595
            ],
            [
                10599,
                10608
            ],
            [
                10609,
                10636
            ],
            [
                10636,
                10656
            ],
            [
                10656,
                10658
            ],
            [
                10658,
                10713
            ],
            [
                10714,
                10749
            ],
            [
                10750,
                10753
            ],
            [
                10754,
                10788
            ],
            [
                10789,
                10888
            ],
            [
                10888,
                10900
            ],
            [
                10903,
                10952
            ],
            [
                10952,
                10984
            ],
            [
                10984,
                10987
            ],
            [
                10987,
                10998
            ],
            [
                10999,
                11007
            ],
            [
                11008,
                11010
            ],
            [
                11016,
                11060
            ],
            [
                11061,
                11082
            ],
            [
                11082,
                11112
            ],
            [
                11113,
                11155
            ],
            [
                11158,
                11185
            ],
            [
                11186,
                11192
            ],
            [
                11192,
                11261
            ],
            [
                11262,
                11284
            ],
            [
                11284,
                11296
            ],
            [
                11297,
                11339
            ],
            [
                11339,
                11366
            ],
            [
                11367,
                11383
            ],
            [
                11390,
                11408
            ],
            [
                11413,
                11430
            ],
            [
                11431,
                11451
            ],
            [
                11451,
                11458
            ],
            [
                11469,
                11518
            ],
            [
                11519,
                11537
            ],
            [
                11538,
                11609
            ],
            [
                11610,
                11613
            ],
            [
                11614,
                11626
            ],
            [
                11626,
                11651
            ],
            [
                11653,
                11676
            ],
            [
                11677,
                11710
            ],
            [
                11710,
                11723
            ],
            [
                11723,
                11724
            ],
            [
                11725,
                11726
            ],
            [
                11726,
                11767
            ],
            [
                11767,
                11794
            ],
            [
                11794,
                11831
            ],
            [
                11831,
                11878
            ],
            [
                11878,
                11893
            ],
            [
                11893,
                11981
            ],
            [
                11981,
                11997
            ],
            [
                11997,
                12036
            ],
            [
                12036,
                12048
            ],
            [
                12053,
                12081
            ],
            [
                12081,
                12145
            ],
            [
                12145,
                12147
            ],
            [
                12147,
                12182
            ],
            [
                12184,
                12303
            ],
            [
                12303,
                12338
            ],
            [
                12338,
                12339
            ],
            [
                12339,
                12366
            ],
            [
                12366,
                12423
            ],
            [
                12424,
                12470
            ],
            [
                12470,
                12516
            ],
            [
                12516,
                12581
            ],
            [
                12581,
                12638
            ],
            [
                12643,
                12654
            ],
            [
                12654,
                12663
            ],
            [
                12664,
                12684
            ],
            [
                12693,
                12695
            ],
            [
                12699,
                12727
            ],
            [
                12727,
                12797
            ],
            [
                12810,
                12812
            ],
            [
                12819,
                12820
            ],
            [
                12821,
                12871
            ],
            [
                12871,
                12901
            ],
            [
                12907,
                12934
            ],
            [
                12934,
                12949
            ],
            [
                12949,
                12952
            ],
            [
                12952,
                12956
            ],
            [
                12957,
                12995
            ],
            [
                12995,
                12997
            ],
            [
                12997,
                13001
            ],
            [
                13002,
                13011
            ],
            [
                13017,
                13021
            ],
            [
                13026,
                13121
            ],
            [
                13121,
                13191
            ],
            [
                13191,
                13274
            ],
            [
                13274,
                13277
            ],
            [
                13277,
                13283
            ],
            [
                13283,
                13285
            ],
            [
                13285,
                13307
            ],
            [
                13307,
                13321
            ],
            [
                13321,
                13371
            ],
            [
                13372,
                13380
            ],
            [
                13381,
                13384
            ],
            [
                13386,
                13461
            ],
            [
                13461,
                13497
            ],
            [
                13497,
                13542
            ],
            [
                13550,
                13570
            ],
            [
                13575,
                13577
            ],
            [
                13577,
                13595
            ],
            [
                13596,
                13607
            ],
            [
                13607,
                13647
            ],
            [
                13647,
                13691
            ],
            [
                13692,
                13707
            ],
            [
                13707,
                13740
            ],
            [
                13740,
                13750
            ],
            [
                13755,
                13819
            ],
            [
                13819,
                13841
            ],
            [
                13841,
                13846
            ],
            [
                13846,
                13847
            ],
            [
                13847,
                13885
            ],
            [
                13889,
                14048
            ],
            [
                14048,
                14051
            ],
            [
                14051,
                14079
            ],
            [
                14079,
                14088
            ],
            [
                14093,
                14145
            ],
            [
                14148,
                14150
            ],
            [
                14150,
                14180
            ],
            [
                14188,
                14211
            ],
            [
                14211,
                14214
            ],
            [
                14215,
                14224
            ],
            [
                14228,
                14263
            ],
            [
                14263,
                14265
            ],
            [
                14265,
                14286
            ],
            [
                14287,
                14334
            ],
            [
                14335,
                14350
            ],
            [
                14350,
                14383
            ],
            [
                14385,
                14393
            ],
            [
                14393,
                14412
            ],
            [
                14413,
                14447
            ],
            [
                14447,
                14468
            ],
            [
                14468,
                14504
            ],
            [
                14504,
                14537
            ],
            [
                14537,
                14565
            ],
            [
                14565,
                14567
            ],
            [
                14567,
                14620
            ],
            [
                14620,
                14664
            ],
            [
                14664,
                14724
            ],
            [
                14728,
                14731
            ],
            [
                14731,
                14738
            ],
            [
                14746,
                14752
            ],
            [
                14752,
                14755
            ],
            [
                14756,
                14789
            ],
            [
                14790,
                14800
            ],
            [
                14800,
                14827
            ],
            [
                14827,
                14828
            ],
            [
                14829,
                14876
            ],
            [
                14877,
                14881
            ],
            [
                14882,
                14903
            ],
            [
                14906,
                14933
            ],
            [
                14933,
                14976
            ],
            [
                14976,
                14990
            ],
            [
                14991,
                14999
            ],
            [
                14999,
                15087
            ],
            [
                15093,
                15111
            ],
            [
                15111,
                15120
            ],
            [
                15124,
                15126
            ],
            [
                15126,
                15129
            ],
            [
                15130,
                15147
            ],
            [
                15147,
                15201
            ],
            [
                15201,
                15215
            ],
            [
                15217,
                15256
            ],
            [
                15257,
                15281
            ],
            [
                15281,
                15361
            ],
            [
                15372,
                15384
            ],
            [
                15400,
                15414
            ]
        ],
        "row_chars": [
            [
                0,
                67
            ],
            [
                67,
                156
            ],
            [
                156,
                262
            ],
            [
                262,
                262
            ],
            [
                262,
                262
            ],
            [
                262,
                351
            ],
            [
                351,
                481
            ],
            [
                481,
                551
            ],
            [
                551,
                640
            ],
            [
                640,
                685
            ],
            [
                685,
                713
            ],
            [
                713,
                783
            ],
            [
                783,
                852
            ],
            [
                852,
                883
            ],
            [
                883,
                973
            ],
            [
                973,
                1117
            ],
            [
                1117,
                1201
            ],
            [
                1201,
                1273
            ],
            [
                1273,
                1346
            ],
            [
                1346,
                1415
            ],
            [
                1415,
                1484
            ],
            [
                1484,
                1513
            ],
            [
                1513,
                1513
            ],
            [
                1513,
                1513
            ],
            [
                1513,
                1622
            ],
            [
                1622,
                1656
            ],
            [
                1656,
                1656
            ],
            [
                1656,
                1808
            ],
            [
                1808,
                1808
            ],
            [
                1808,
                1861
            ],
            [
                1861,
                1861
            ],
            [
                1861,
                2113
            ],
            [
                2113,
                2160
            ],
            [
                2160,
                2196
            ],
            [
                2196,
                2240
            ],
            [
                2240,
                2336
            ],
            [
                2336,
                2336
            ],
            [
                2336,
                2428
            ],
            [
                2428,
                2512
            ],
            [
                2512,
                2512
            ],
            [
                2512,
                2523
            ],
            [
                2523,
                2659
            ],
            [
                2659,
                2668
            ],
            [
                2668,
                2739
            ],
            [
                2739,
                2852
            ],
            [
                2852,
                2964
            ],
            [
                2964,
                3063
            ],
            [
                3063,
                3160
            ],
            [
                3160,
                3274
            ],
            [
                3274,
                3351
            ],
            [
                3351,
                3402
            ],
            [
                3402,
                3402
            ],
            [
                3402,
                3429
            ],
            [
                3429,
                3523
            ],
            [
                3523,
                3600
            ],
            [
                3600,
                3649
            ],
            [
                3649,
                3733
            ],
            [
                3733,
                3833
            ],
            [
                3833,
                3889
            ],
            [
                3889,
                3933
            ],
            [
                3933,
                3953
            ],
            [
                3953,
                3997
            ],
            [
                3997,
                3997
            ],
            [
                3997,
                4014
            ],
            [
                4014,
                4040
            ],
            [
                4040,
                4049
            ],
            [
                4049,
                4076
            ],
            [
                4076,
                4076
            ],
            [
                4076,
                4076
            ],
            [
                4076,
                4102
            ],
            [
                4102,
                4141
            ],
            [
                4141,
                4161
            ],
            [
                4161,
                4272
            ],
            [
                4272,
                4292
            ],
            [
                4292,
                4314
            ],
            [
                4314,
                4337
            ],
            [
                4337,
                4366
            ],
            [
                4366,
                4392
            ],
            [
                4392,
                4426
            ],
            [
                4426,
                4435
            ],
            [
                4435,
                4454
            ],
            [
                4454,
                4535
            ],
            [
                4535,
                4610
            ],
            [
                4610,
                4656
            ],
            [
                4656,
                4691
            ],
            [
                4691,
                4711
            ],
            [
                4711,
                4711
            ],
            [
                4711,
                4789
            ],
            [
                4789,
                4865
            ],
            [
                4865,
                4865
            ],
            [
                4865,
                4896
            ],
            [
                4896,
                4932
            ],
            [
                4932,
                4962
            ],
            [
                4962,
                4995
            ],
            [
                4995,
                5075
            ],
            [
                5075,
                5110
            ],
            [
                5110,
                5134
            ],
            [
                5134,
                5164
            ],
            [
                5164,
                5164
            ],
            [
                5164,
                5164
            ],
            [
                5164,
                5164
            ],
            [
                5164,
                5227
            ],
            [
                5227,
                5258
            ],
            [
                5258,
                5285
            ],
            [
                5285,
                5308
            ],
            [
                5308,
                5361
            ],
            [
                5361,
                5361
            ],
            [
                5361,
                5389
            ],
            [
                5389,
                5413
            ],
            [
                5413,
                5454
            ],
            [
                5454,
                5454
            ],
            [
                5454,
                5493
            ],
            [
                5493,
                5505
            ],
            [
                5505,
                5536
            ],
            [
                5536,
                5605
            ],
            [
                5605,
                5622
            ],
            [
                5622,
                5669
            ],
            [
                5669,
                5697
            ],
            [
                5697,
                5721
            ],
            [
                5721,
                5721
            ],
            [
                5721,
                5721
            ],
            [
                5721,
                5750
            ],
            [
                5750,
                5768
            ],
            [
                5768,
                5816
            ],
            [
                5816,
                5816
            ],
            [
                5816,
                5833
            ],
            [
                5833,
                5904
            ],
            [
                5904,
                5953
            ],
            [
                5953,
                6037
            ],
            [
                6037,
                6161
            ],
            [
                6161,
                6233
            ],
            [
                6233,
                6286
            ],
            [
                6286,
                6346
            ],
            [
                6346,
                6500
            ],
            [
                6500,
                6538
            ],
            [
                6538,
                6569
            ],
            [
                6569,
                6661
            ],
            [
                6661,
                6698
            ],
            [
                6698,
                6698
            ],
            [
                6698,
                6799
            ],
            [
                6799,
                6907
            ],
            [
                6907,
                6942
            ],
            [
                6942,
                6942
            ],
            [
                6942,
                6942
            ],
            [
                6942,
                6976
            ],
            [
                6976,
                6991
            ],
            [
                6991,
                7023
            ],
            [
                7023,
                7023
            ],
            [
                7023,
                7064
            ],
            [
                7064,
                7094
            ],
            [
                7094,
                7116
            ],
            [
                7116,
                7148
            ],
            [
                7148,
                7188
            ],
            [
                7188,
                7222
            ],
            [
                7222,
                7267
            ],
            [
                7267,
                7277
            ],
            [
                7277,
                7283
            ],
            [
                7283,
                7333
            ],
            [
                7333,
                7389
            ],
            [
                7389,
                7446
            ],
            [
                7446,
                7475
            ],
            [
                7475,
                7494
            ],
            [
                7494,
                7513
            ],
            [
                7513,
                7544
            ],
            [
                7544,
                7577
            ],
            [
                7577,
                7602
            ],
            [
                7602,
                7647
            ],
            [
                7647,
                7703
            ],
            [
                7703,
                7762
            ],
            [
                7762,
                7777
            ],
            [
                7777,
                7869
            ],
            [
                7869,
                7911
            ],
            [
                7911,
                7980
            ],
            [
                7980,
                7992
            ],
            [
                7992,
                8010
            ],
            [
                8010,
                8072
            ],
            [
                8072,
                8111
            ],
            [
                8111,
                8143
            ],
            [
                8143,
                8191
            ],
            [
                8191,
                8199
            ],
            [
                8199,
                8251
            ],
            [
                8251,
                8377
            ],
            [
                8377,
                8482
            ],
            [
                8482,
                8562
            ],
            [
                8562,
                8639
            ],
            [
                8639,
                8639
            ],
            [
                8639,
                8653
            ],
            [
                8653,
                8685
            ],
            [
                8685,
                8714
            ],
            [
                8714,
                8714
            ],
            [
                8714,
                8759
            ],
            [
                8759,
                8818
            ],
            [
                8818,
                8818
            ],
            [
                8818,
                8876
            ],
            [
                8876,
                8926
            ],
            [
                8926,
                8936
            ],
            [
                8936,
                8984
            ],
            [
                8984,
                9011
            ],
            [
                9011,
                9027
            ],
            [
                9027,
                9139
            ],
            [
                9139,
                9147
            ],
            [
                9147,
                9198
            ],
            [
                9198,
                9217
            ],
            [
                9217,
                9237
            ],
            [
                9237,
                9327
            ],
            [
                9327,
                9327
            ],
            [
                9327,
                9346
            ],
            [
                9346,
                9418
            ],
            [
                9418,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9535
            ],
            [
                9535,
                9641
            ],
            [
                9641,
                9765
            ],
            [
                9765,
                9841
            ],
            [
                9841,
                9909
            ],
            [
                9909,
                9939
            ],
            [
                9939,
                10124
            ],
            [
                10124,
                10255
            ],
            [
                10255,
                10292
            ],
            [
                10292,
                10400
            ],
            [
                10400,
                10508
            ],
            [
                10508,
                10544
            ],
            [
                10544,
                10592
            ],
            [
                10592,
                10636
            ],
            [
                10636,
                10658
            ],
            [
                10658,
                10789
            ],
            [
                10789,
                10888
            ],
            [
                10888,
                10952
            ],
            [
                10952,
                10987
            ],
            [
                10987,
                11082
            ],
            [
                11082,
                11082
            ],
            [
                11082,
                11158
            ],
            [
                11158,
                11158
            ],
            [
                11158,
                11192
            ],
            [
                11192,
                11284
            ],
            [
                11284,
                11339
            ],
            [
                11339,
                11451
            ],
            [
                11451,
                11677
            ],
            [
                11677,
                11767
            ],
            [
                11767,
                11794
            ],
            [
                11794,
                11831
            ],
            [
                11831,
                11878
            ],
            [
                11878,
                11893
            ],
            [
                11893,
                11981
            ],
            [
                11981,
                11997
            ],
            [
                11997,
                12036
            ],
            [
                12036,
                12081
            ],
            [
                12081,
                12147
            ],
            [
                12147,
                12184
            ],
            [
                12184,
                12184
            ],
            [
                12184,
                12303
            ],
            [
                12303,
                12338
            ],
            [
                12338,
                12366
            ],
            [
                12366,
                12470
            ],
            [
                12470,
                12516
            ],
            [
                12516,
                12581
            ],
            [
                12581,
                12654
            ],
            [
                12654,
                12654
            ],
            [
                12654,
                12654
            ],
            [
                12654,
                12727
            ],
            [
                12727,
                12797
            ],
            [
                12797,
                12871
            ],
            [
                12871,
                12934
            ],
            [
                12934,
                12952
            ],
            [
                12952,
                12997
            ],
            [
                12997,
                12997
            ],
            [
                12997,
                13121
            ],
            [
                13121,
                13191
            ],
            [
                13191,
                13277
            ],
            [
                13277,
                13277
            ],
            [
                13277,
                13285
            ],
            [
                13285,
                13307
            ],
            [
                13307,
                13321
            ],
            [
                13321,
                13386
            ],
            [
                13386,
                13386
            ],
            [
                13386,
                13461
            ],
            [
                13461,
                13497
            ],
            [
                13497,
                13577
            ],
            [
                13577,
                13607
            ],
            [
                13607,
                13647
            ],
            [
                13647,
                13707
            ],
            [
                13707,
                13740
            ],
            [
                13740,
                13819
            ],
            [
                13819,
                13841
            ],
            [
                13841,
                13846
            ],
            [
                13846,
                14051
            ],
            [
                14051,
                14079
            ],
            [
                14079,
                14150
            ],
            [
                14150,
                14211
            ],
            [
                14211,
                14265
            ],
            [
                14265,
                14350
            ],
            [
                14350,
                14413
            ],
            [
                14413,
                14447
            ],
            [
                14447,
                14468
            ],
            [
                14468,
                14537
            ],
            [
                14537,
                14567
            ],
            [
                14567,
                14620
            ],
            [
                14620,
                14664
            ],
            [
                14664,
                14731
            ],
            [
                14731,
                14755
            ],
            [
                14755,
                14755
            ],
            [
                14755,
                14800
            ],
            [
                14800,
                14800
            ],
            [
                14800,
                14800
            ],
            [
                14800,
                14800
            ],
            [
                14800,
                14933
            ],
            [
                14933,
                14976
            ],
            [
                14976,
                14999
            ],
            [
                14999,
                15111
            ],
            [
                15111,
                15111
            ],
            [
                15111,
                15126
            ],
            [
                15126,
                15147
            ],
            [
                15147,
                15201
            ],
            [
                15201,
                15257
            ],
            [
                15257,
                15281
            ],
            [
                15281,
                15414
            ]
        ]
    }
}