{
    "original": {
        "text": "About this time, a fortnight or nearly so before the election, Mr. Longestaffe came up to town and saw Mr. Melmotte very frequently. He could not go into his own house, as he had let that for a month to the great financier, nor had he any establishment in town; but he slept at an hotel and lived at the Carlton. He was quite delighted to find that his new friend was an honest Conservative, and he himself proposed the honest Conservative at the club. There was some idea of electing Mr. Melmotte out of hand, but it was decided that the club could not go beyond its rule, and could only admit Mr. Melmotte out of his regular turn as soon as he should occupy a seat in the House of Commons. Mr. Melmotte, who was becoming somewhat arrogant, was heard to declare that if the club did not take him when he was willing to be taken, it might do without him. If not elected at once, he should withdraw his name. So great was his prestige at this moment with his own party that there were some, Mr. Longestaffe among the number, who pressed the thing on the committee. Mr. Melmotte was not like other men. It was a great thing to have Mr. Melmotte in the party. Mr. Melmotte's financial capabilities would in themselves be a tower of strength. Rules were not made to control the club in a matter of such importance as this. A noble lord, one among seven who had been named as a fit leader of the Upper House on the Conservative side in the next session, was asked to take the matter up; and men thought that the thing might have been done had he complied. But he was old-fashioned, perhaps pig-headed; and the club for the time lost the honour of entertaining Mr. Melmotte.\nIt may be remembered that Mr. Longestaffe had been anxious to become one of the directors of the Mexican Railway, and that he was rather snubbed than encouraged when he expressed his wish to Mr. Melmotte. Like other great men, Mr. Melmotte liked to choose his own time for bestowing favours. Since that request was made the proper time had come, and he had now intimated to Mr. Longestaffe that in a somewhat altered condition of things there would be a place for him at the Board, and that he and his brother directors would be delighted to avail themselves of his assistance. The alliance between Mr. Melmotte and Mr. Longestaffe had become very close. The Melmottes had visited the Longestaffes at Caversham. Georgiana Longestaffe was staying with Madame Melmotte in London. The Melmottes were living in Mr. Longestaffe's town house, having taken it for a month at a very high rent. Mr. Longestaffe now had a seat at Mr. Melmotte's board. And Mr. Melmotte had bought Mr. Longestaffe's estate at Pickering on terms very favourable to the Longestaffes. It had been suggested to Mr. Longestaffe by Mr. Melmotte that he had better qualify for his seat at the Board by taking shares in the Company to the amount of--perhaps two or three thousand pounds, and Mr. Longestaffe had of course consented. There would be no need of any transaction in absolute cash. The shares could of course be paid for out of Mr. Longestaffe's half of the purchase money for Pickering Park, and could remain for the present in Mr. Melmotte's hands. To this also Mr. Longestaffe had consented, not quite understanding why the scrip should not be made over to him at once.\nIt was a part of the charm of all dealings with this great man that no ready money seemed ever to be necessary for anything. Great purchases were made and great transactions apparently completed without the signing even of a cheque. Mr. Longestaffe found himself to be afraid even to give a hint to Mr. Melmotte about ready money. In speaking of all such matters Melmotte seemed to imply that everything necessary had been done, when he had said that it was done. Pickering had been purchased and the title-deeds made over to Mr. Melmotte; but the 80,000 had not been paid,--had not been absolutely paid, though of course Mr. Melmotte's note assenting to the terms was security sufficient for any reasonable man. The property had been mortgaged, though not heavily, and Mr. Melmotte had no doubt satisfied the mortgagee; but there was still a sum of 50,000 to come, of which Dolly was to have one half and the other was to be employed in paying off Mr. Longestaffe's debts to tradesmen and debts to the bank. It would have been very pleasant to have had this at once,--but Mr. Longestaffe felt the absurdity of pressing such a man as Mr. Melmotte, and was partly conscious of the gradual consummation of a new ra in money matters. \"If your banker is pressing you, refer him to me,\" Mr. Melmotte had said. As for many years past we have exchanged paper instead of actual money for our commodities, so now it seemed that, under the new Melmotte rgime, an exchange of words was to suffice.\nBut Dolly wanted his money. Dolly, idle as he was, foolish as he was, dissipated as he was and generally indifferent to his debts, liked to have what belonged to him. It had all been arranged. 5,000 would pay off all his tradesmen's debts and leave him comfortably possessed of money in hand, while the other 20,000 would make his own property free. There was a charm in this which awakened even Dolly, and for the time almost reconciled him to his father's society. But now a shade of impatience was coming over him. He had actually gone down to Caversham to arrange the terms with his father,--and had in fact made his own terms. His father had been unable to move him, and had consequently suffered much in spirit. Dolly had been almost triumphant,--thinking that the money would come on the next day, or at any rate during the next week. Now he came to his father early in the morning,--at about two o'clock,--to enquire what was being done. He had not as yet been made blessed with a single ten-pound note in his hand, as the result of the sale.\n\"Are you going to see Melmotte, sir?\" he asked somewhat abruptly.\n\"Yes;--I'm to be with him to-morrow, and he is to introduce me to the Board.\"\n\"You're going in for that, are you, sir? Do they pay anything?\"\n\"I believe not.\"\n\"Nidderdale and young Carbury belong to it. It's a sort of Beargarden affair.\"\n\"A bear-garden affair, Adolphus. How so?\"\n\"I mean the club. We had them all there for dinner one day, and a jolly dinner we gave them. Miles Grendall and old Alfred belong to it. I don't think they'd go in for it, if there was no money going. I'd make them fork out something if I took the trouble of going all that way.\"\n\"I think that perhaps, Adolphus, you hardly understand these things.\"\n\"No, I don't. I don't understand much about business, I know. What I want to understand is, when Melmotte is going to pay up this money.\"\n\"I suppose he'll arrange it with the banks,\" said the father.\n\"I beg that he won't arrange my money with the banks, sir. You'd better tell him not. A cheque upon his bank which I can pay in to mine is about the best thing going. You'll be in the city to-morrow, and you'd better tell him. If you don't like, you know, I'll get Squercum to do it.\" Mr. Squercum was a lawyer whom Dolly had employed of late years much to the annoyance of his parent. Mr. Squercum's name was odious to Mr. Longestaffe.\n\"I beg you'll do nothing of the kind. It will be very foolish if you do;--perhaps ruinous.\"\n\"Then he'd better pay up, like anybody else,\" said Dolly as he left the room. The father knew the son, and was quite sure that Squercum would have his finger in the pie unless the money were paid quickly. When Dolly had taken an idea into his head, no power on earth,--no power at least of which the father could avail himself,--would turn him.\nOn that same day Melmotte received two visits in the city from two of his fellow directors. At the time he was very busy. Though his electioneering speeches were neither long nor pithy, still he had to think of them beforehand. Members of his Committee were always trying to see him. Orders as to the dinner and the preparation of the house could not be given by Lord Alfred without some reference to him. And then those gigantic commercial affairs which were enumerated in the last chapter could not be adjusted without much labour on his part. His hands were not empty, but still he saw each of these young men,--for a few minutes. \"My dear young friend, what can I do for you?\" he said to Sir Felix, not sitting down, so that Sir Felix also should remain standing.\n\"About that money, Mr. Melmotte?\"\n\"What money, my dear fellow? You see that a good many money matters pass through my hands.\"\n\"The thousand pounds I gave you for shares. If you don't mind, and as the shares seem to be a bother, I'll take the money back.\"\n\"It was only the other day you had 200,\" said Melmotte, showing that he could apply his memory to small transactions when he pleased.\n\"Exactly;--and you might as well let me have the 800.\"\n\"I've ordered the shares;--gave the order to my broker the other day.\"\n\"Then I'd better take the shares,\" said Sir Felix, feeling that it might very probably be that day fortnight before he could start for New York. \"Could I get them, Mr. Melmotte?\"\n\"My dear fellow, I really think you hardly calculate the value of my time when you come to me about such an affair as this.\"\n\"I'd like to have the money or the shares,\" said Sir Felix, who was not specially averse to quarrelling with Mr. Melmotte now that he had resolved upon taking that gentleman's daughter to New York in direct opposition to his written promise. Their quarrel would be so thoroughly internecine when the departure should be discovered, that any present anger could hardly increase its bitterness. What Felix thought of now was simply his money, and the best means of getting it out of Melmotte's hands.\n\"You're a spendthrift,\" said Melmotte, apparently relenting, \"and I'm afraid a gambler. I suppose I must give you 200 more on account.\"\nSir Felix could not resist the touch of ready money, and consented to take the sum offered. As he pocketed the cheque he asked for the name of the brokers who were employed to buy the shares. But here Melmotte demurred. \"No, my friend,\" said Melmotte; \"you are only entitled to shares for 600 pounds now. I will see that the thing is put right.\" So Sir Felix departed with 200 only. Marie had said that she could get 200. Perhaps if he bestirred himself and wrote to some of Miles's big relations he could obtain payment of a part of that gentleman's debt to him.\nSir Felix going down the stairs in Abchurch Lane met Paul Montague coming up. Carbury, on the spur of the moment, thought that he would \"take a rise\" as he called it out of Montague. \"What's this I hear about a lady at Islington?\" he asked.\n\"Who has told you anything about a lady at Islington?\"\n\"A little bird. There are always little birds about telling of ladies. I'm told that I'm to congratulate you on your coming marriage.\"\n\"Then you've been told an infernal falsehood,\" said Montague passing on. He paused a moment and added, \"I don't know who can have told you, but if you hear it again, I'll trouble you to contradict it.\" As he was waiting in Melmotte's outer room while the Duke's nephew went in to see whether it was the great man's pleasure to see him, he remembered whence Carbury must have heard tidings of Mrs. Hurtle. Of course the rumour had come through Ruby Ruggles.\nMiles Grendall brought out word that the great man would see Mr. Montague; but he added a caution. \"He's awfully full of work just now,--you won't forget that;--will you?\" Montague assured the duke's nephew that he would be concise, and was shown in.\n\"I should not have troubled you,\" said Paul, \"only that I understood that I was to see you before the Board met.\"\n\"Exactly;--of course. It was quite necessary,--only you see I am a little busy. If this d----d dinner were over I shouldn't mind. It's a deal easier to make a treaty with an Emperor, than to give him a dinner; I can tell you that. Well;--let me see. Oh;--I was proposing that you should go out to Pekin?\"\n\"To Mexico.\"\n\"Yes, yes;--to Mexico. I've so many things running in my head! Well;--if you'll say when you're ready to start, we'll draw up something of instructions. You'd know better, however, than we can tell you what to do. You'll see Fisker, of course. You and Fisker will manage it. The chief thing will be a cheque for the expenses; eh? We must get that passed at the next Board.\"\nMr. Melmotte had been so quick that Montague had been unable to interrupt him. \"There need be no trouble about that, Mr. Melmotte, as I have made up my mind that it would not be fit that I should go.\"\n\"Oh, indeed!\"\nThere had been a shade of doubt on Montague's mind, till the tone in which Melmotte had spoken of the embassy grated on his ears. The reference to the expenses disgusted him altogether. \"No;--even did I see my way to do any good in America my duties here would not be compatible with the undertaking.\"\n\"I don't see that at all. What duties have you got here? What good are you doing the Company? If you do stay, I hope you'll be unanimous; that's all;--or perhaps you intend to go out. If that's it, I'll look to your money. I think I told you that before.\"\n\"That, Mr. Melmotte, is what I should prefer.\"\n\"Very well,--very well. I'll arrange it. Sorry to lose you,--that's all. Miles, isn't Mr. Goldsheiner waiting to see me?\"\n\"You're a little too quick, Mr. Melmotte,\" said Paul.\n\"A man with my business on his hands is bound to be quick, sir.\"\n\"But I must be precise. I cannot tell you as a fact that I shall withdraw from the Board till I receive the advice of a friend with whom I am consulting. I hardly yet know what my duty may be.\"\n\"I'll tell you, sir, what can not be your duty. It cannot be your duty to make known out of that Board-room any of the affairs of the Company which you have learned in that Board-room. It cannot be your duty to divulge the circumstances of the Company or any differences which may exist between Directors of the Company, to any gentleman who is a stranger to the Company. It cannot be your duty--.\"\n\"Thank you, Mr. Melmotte. On matters such as that I think that I can see my own way. I have been in fault in coming in to the Board without understanding what duties I should have to perform--.\"\n\"Very much in fault, I should say,\" replied Melmotte, whose arrogance in the midst of his inflated glory was overcoming him.\n\"But in reference to what I may or may not say to any friend, or how far I should be restricted by the scruples of a gentleman, I do not want advice from you.\"\n\"Very well;--very well. I can't ask you to stay, because a partner from the house of Todd, Brehgert, and Goldsheiner is waiting to see me, about matters which are rather more important than this of yours.\" Montague had said what he had to say, and departed.\nOn the following day, three-quarters of an hour before the meeting of the Board of Directors, old Mr. Longestaffe called in Abchurch Lane. He was received very civilly by Miles Grendall, and asked to sit down. Mr. Melmotte quite expected him, and would walk with him over to the offices of the railway, and introduce him to the Board. Mr. Longestaffe, with some shyness, intimated his desire to have a few moments conversation with the chairman before the Board met. Fearing his son, especially fearing Squercum, he had made up his mind to suggest that the little matter about Pickering Park should be settled. Miles assured him that the opportunity should be given him, but that at the present moment the chief secretary of the Russian Legation was with Mr. Melmotte. Either the chief secretary was very tedious with his business, or else other big men must have come in, for Mr. Longestaffe was not relieved till he was summoned to walk off to the Board five minutes after the hour at which the Board should have met. He thought that he could explain his views in the street; but on the stairs they were joined by Mr. Cohenlupe, and in three minutes they were in the Board-room. Mr. Longestaffe was then presented, and took the chair opposite to Miles Grendall. Montague was not there, but had sent a letter to the secretary explaining that for reasons with which the chairman was acquainted he should absent himself from the present meeting. \"All right,\" said Melmotte. \"I know all about it. Go on. I'm not sure but that Mr. Montague's retirement from among us may be an advantage. He could not be made to understand that unanimity in such an enterprise as this is essential. I am confident that the new director whom I have had the pleasure of introducing to you to-day will not sin in the same direction.\" Then Mr. Melmotte bowed and smiled very sweetly on Mr. Longestaffe.\nMr. Longestaffe was astonished to find how soon the business was done, and how very little he had been called on to do. Miles Grendall had read something out of a book which he had been unable to follow. Then the chairman had read some figures. Mr. Cohenlupe had declared that their prosperity was unprecedented;--and the Board was over. When Mr. Longestaffe explained to Miles Grendall that he still wished to speak to Mr. Melmotte, Miles explained to him that the chairman had been obliged to run off to a meeting of gentlemen connected with the interior of Africa, which was now being held at the Cannon Street Hotel.",
        "paragraph_chars": [
            [
                0,
                1669
            ],
            [
                1669,
                3317
            ],
            [
                3317,
                4804
            ],
            [
                4804,
                5855
            ],
            [
                5855,
                5921
            ],
            [
                5921,
                5999
            ],
            [
                5999,
                6063
            ],
            [
                6063,
                6080
            ],
            [
                6080,
                6159
            ],
            [
                6159,
                6201
            ],
            [
                6201,
                6481
            ],
            [
                6481,
                6551
            ],
            [
                6551,
                6689
            ],
            [
                6689,
                6751
            ],
            [
                6751,
                7188
            ],
            [
                7188,
                7280
            ],
            [
                7280,
                7625
            ],
            [
                7625,
                8393
            ],
            [
                8393,
                8427
            ],
            [
                8427,
                8519
            ],
            [
                8519,
                8648
            ],
            [
                8648,
                8782
            ],
            [
                8782,
                8837
            ],
            [
                8837,
                8908
            ],
            [
                8908,
                9087
            ],
            [
                9087,
                9212
            ],
            [
                9212,
                9711
            ],
            [
                9711,
                9847
            ],
            [
                9847,
                10411
            ],
            [
                10411,
                10652
            ],
            [
                10652,
                10707
            ],
            [
                10707,
                10842
            ],
            [
                10842,
                11299
            ],
            [
                11299,
                11550
            ],
            [
                11550,
                11664
            ],
            [
                11664,
                11969
            ],
            [
                11969,
                11982
            ],
            [
                11982,
                12356
            ],
            [
                12356,
                12557
            ],
            [
                12557,
                12571
            ],
            [
                12571,
                12873
            ],
            [
                12873,
                13129
            ],
            [
                13129,
                13176
            ],
            [
                13176,
                13298
            ],
            [
                13298,
                13352
            ],
            [
                13352,
                13417
            ],
            [
                13417,
                13611
            ],
            [
                13611,
                14010
            ],
            [
                14010,
                14205
            ],
            [
                14205,
                14330
            ],
            [
                14330,
                14490
            ],
            [
                14490,
                14748
            ],
            [
                14748,
                16627
            ],
            [
                16627,
                17247
            ]
        ],
        "segment_chars": [
            [
                0,
                133
            ],
            [
                133,
                313
            ],
            [
                313,
                453
            ],
            [
                453,
                692
            ],
            [
                692,
                855
            ],
            [
                855,
                908
            ],
            [
                908,
                1064
            ],
            [
                1064,
                1101
            ],
            [
                1101,
                1157
            ],
            [
                1157,
                1239
            ],
            [
                1239,
                1319
            ],
            [
                1319,
                1551
            ],
            [
                1551,
                1669
            ],
            [
                1669,
                1874
            ],
            [
                1874,
                1961
            ],
            [
                1961,
                2247
            ],
            [
                2247,
                2324
            ],
            [
                2324,
                2381
            ],
            [
                2381,
                2447
            ],
            [
                2447,
                2555
            ],
            [
                2555,
                2611
            ],
            [
                2611,
                2723
            ],
            [
                2723,
                2966
            ],
            [
                2966,
                3026
            ],
            [
                3026,
                3195
            ],
            [
                3195,
                3317
            ],
            [
                3317,
                3442
            ],
            [
                3442,
                3550
            ],
            [
                3550,
                3648
            ],
            [
                3648,
                3781
            ],
            [
                3781,
                4030
            ],
            [
                4030,
                4326
            ],
            [
                4326,
                4548
            ],
            [
                4548,
                4622
            ],
            [
                4622,
                4804
            ],
            [
                4804,
                4832
            ],
            [
                4832,
                4971
            ],
            [
                4971,
                4997
            ],
            [
                4997,
                5154
            ],
            [
                5154,
                5271
            ],
            [
                5271,
                5322
            ],
            [
                5322,
                5436
            ],
            [
                5436,
                5522
            ],
            [
                5522,
                5646
            ],
            [
                5646,
                5750
            ],
            [
                5750,
                5855
            ],
            [
                5855,
                5893
            ],
            [
                5893,
                5921
            ],
            [
                5921,
                5999
            ],
            [
                5999,
                6040
            ],
            [
                6040,
                6063
            ],
            [
                6063,
                6080
            ],
            [
                6080,
                6124
            ],
            [
                6124,
                6159
            ],
            [
                6159,
                6192
            ],
            [
                6192,
                6201
            ],
            [
                6201,
                6219
            ],
            [
                6219,
                6294
            ],
            [
                6294,
                6338
            ],
            [
                6338,
                6402
            ],
            [
                6402,
                6481
            ],
            [
                6481,
                6551
            ],
            [
                6551,
                6565
            ],
            [
                6565,
                6613
            ],
            [
                6613,
                6689
            ],
            [
                6689,
                6751
            ],
            [
                6751,
                6810
            ],
            [
                6810,
                6837
            ],
            [
                6837,
                6918
            ],
            [
                6918,
                6978
            ],
            [
                6978,
                7036
            ],
            [
                7036,
                7137
            ],
            [
                7137,
                7188
            ],
            [
                7188,
                7226
            ],
            [
                7226,
                7280
            ],
            [
                7280,
                7358
            ],
            [
                7358,
                7485
            ],
            [
                7485,
                7625
            ],
            [
                7625,
                7717
            ],
            [
                7717,
                7747
            ],
            [
                7747,
                7853
            ],
            [
                7853,
                7909
            ],
            [
                7909,
                8031
            ],
            [
                8031,
                8171
            ],
            [
                8171,
                8259
            ],
            [
                8259,
                8306
            ],
            [
                8306,
                8393
            ],
            [
                8393,
                8427
            ],
            [
                8427,
                8456
            ],
            [
                8456,
                8519
            ],
            [
                8519,
                8563
            ],
            [
                8563,
                8648
            ],
            [
                8648,
                8782
            ],
            [
                8782,
                8837
            ],
            [
                8837,
                8908
            ],
            [
                8908,
                9053
            ],
            [
                9053,
                9087
            ],
            [
                9087,
                9212
            ],
            [
                9212,
                9454
            ],
            [
                9454,
                9605
            ],
            [
                9605,
                9711
            ],
            [
                9711,
                9799
            ],
            [
                9799,
                9847
            ],
            [
                9847,
                9939
            ],
            [
                9939,
                10039
            ],
            [
                10039,
                10067
            ],
            [
                10067,
                10152
            ],
            [
                10152,
                10193
            ],
            [
                10193,
                10230
            ],
            [
                10230,
                10269
            ],
            [
                10269,
                10411
            ],
            [
                10411,
                10489
            ],
            [
                10489,
                10594
            ],
            [
                10594,
                10642
            ],
            [
                10642,
                10652
            ],
            [
                10652,
                10707
            ],
            [
                10707,
                10723
            ],
            [
                10723,
                10778
            ],
            [
                10778,
                10842
            ],
            [
                10842,
                10915
            ],
            [
                10915,
                11044
            ],
            [
                11044,
                11247
            ],
            [
                11247,
                11299
            ],
            [
                11299,
                11398
            ],
            [
                11398,
                11471
            ],
            [
                11471,
                11550
            ],
            [
                11550,
                11664
            ],
            [
                11664,
                11686
            ],
            [
                11686,
                11744
            ],
            [
                11744,
                11794
            ],
            [
                11794,
                11895
            ],
            [
                11895,
                11914
            ],
            [
                11914,
                11969
            ],
            [
                11969,
                11982
            ],
            [
                11982,
                12005
            ],
            [
                12005,
                12045
            ],
            [
                12045,
                12135
            ],
            [
                12135,
                12196
            ],
            [
                12196,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12257,
                12312
            ],
            [
                12312,
                12356
            ],
            [
                12356,
                12435
            ],
            [
                12435,
                12557
            ],
            [
                12557,
                12571
            ],
            [
                12571,
                12701
            ],
            [
                12701,
                12757
            ],
            [
                12757,
                12873
            ],
            [
                12873,
                12899
            ],
            [
                12899,
                12930
            ],
            [
                12930,
                12967
            ],
            [
                12967,
                13057
            ],
            [
                13057,
                13096
            ],
            [
                13096,
                13129
            ],
            [
                13129,
                13176
            ],
            [
                13176,
                13200
            ],
            [
                13200,
                13217
            ],
            [
                13217,
                13249
            ],
            [
                13249,
                13298
            ],
            [
                13298,
                13352
            ],
            [
                13352,
                13417
            ],
            [
                13417,
                13441
            ],
            [
                13441,
                13571
            ],
            [
                13571,
                13611
            ],
            [
                13611,
                13659
            ],
            [
                13659,
                13796
            ],
            [
                13796,
                13983
            ],
            [
                13983,
                14010
            ],
            [
                14010,
                14036
            ],
            [
                14036,
                14095
            ],
            [
                14095,
                14205
            ],
            [
                14205,
                14330
            ],
            [
                14330,
                14490
            ],
            [
                14490,
                14514
            ],
            [
                14514,
                14696
            ],
            [
                14696,
                14748
            ],
            [
                14748,
                14887
            ],
            [
                14887,
                14958
            ],
            [
                14958,
                15083
            ],
            [
                15083,
                15215
            ],
            [
                15215,
                15359
            ],
            [
                15359,
                15517
            ],
            [
                15517,
                15768
            ],
            [
                15768,
                15929
            ],
            [
                15929,
                16012
            ],
            [
                16012,
                16193
            ],
            [
                16193,
                16221
            ],
            [
                16221,
                16243
            ],
            [
                16243,
                16250
            ],
            [
                16250,
                16333
            ],
            [
                16333,
                16427
            ],
            [
                16427,
                16559
            ],
            [
                16559,
                16627
            ],
            [
                16627,
                16747
            ],
            [
                16747,
                16831
            ],
            [
                16831,
                16872
            ],
            [
                16872,
                16965
            ],
            [
                16965,
                17247
            ]
        ],
        "overlap_chars": [
            [
                6,
                28
            ],
            [
                42,
                133
            ],
            [
                133,
                223
            ],
            [
                262,
                268
            ],
            [
                291,
                313
            ],
            [
                313,
                319
            ],
            [
                326,
                395
            ],
            [
                407,
                415
            ],
            [
                440,
                453
            ],
            [
                509,
                510
            ],
            [
                515,
                543
            ],
            [
                578,
                607
            ],
            [
                643,
                645
            ],
            [
                660,
                691
            ],
            [
                692,
                767
            ],
            [
                771,
                779
            ],
            [
                833,
                855
            ],
            [
                855,
                908
            ],
            [
                908,
                948
            ],
            [
                968,
                1005
            ],
            [
                1022,
                1027
            ],
            [
                1049,
                1062
            ],
            [
                1064,
                1101
            ],
            [
                1239,
                1244
            ],
            [
                1250,
                1253
            ],
            [
                1262,
                1319
            ],
            [
                1551,
                1554
            ],
            [
                1601,
                1669
            ],
            [
                1669,
                1798
            ],
            [
                1806,
                1813
            ],
            [
                1830,
                1874
            ],
            [
                1874,
                1961
            ],
            [
                1989,
                1992
            ],
            [
                2000,
                2008
            ],
            [
                2026,
                2029
            ],
            [
                2009,
                2025
            ],
            [
                2043,
                2058
            ],
            [
                1967,
                1971
            ],
            [
                2106,
                2149
            ],
            [
                2245,
                2246
            ],
            [
                2247,
                2324
            ],
            [
                2611,
                2723
            ],
            [
                2769,
                2779
            ],
            [
                2735,
                2763
            ],
            [
                2780,
                2881
            ],
            [
                2891,
                2966
            ],
            [
                2981,
                2983
            ],
            [
                3020,
                3024
            ],
            [
                3024,
                3026
            ],
            [
                3026,
                3042
            ],
            [
                3053,
                3195
            ],
            [
                3195,
                3317
            ],
            [
                3317,
                3442
            ],
            [
                3472,
                3490
            ],
            [
                3458,
                3462
            ],
            [
                3491,
                3550
            ],
            [
                3550,
                3565
            ],
            [
                3586,
                3648
            ],
            [
                3781,
                3890
            ],
            [
                3922,
                4030
            ],
            [
                4030,
                4062
            ],
            [
                4138,
                4242
            ],
            [
                4252,
                4289
            ],
            [
                4324,
                4326
            ],
            [
                4326,
                4383
            ],
            [
                4386,
                4463
            ],
            [
                4546,
                4547
            ],
            [
                4804,
                4832
            ],
            [
                4832,
                4843
            ],
            [
                4895,
                4898
            ],
            [
                4855,
                4872
            ],
            [
                4933,
                4971
            ],
            [
                4997,
                5154
            ],
            [
                5160,
                5163
            ],
            [
                5320,
                5322
            ],
            [
                5322,
                5398
            ],
            [
                5400,
                5403
            ],
            [
                5528,
                5555
            ],
            [
                5557,
                5591
            ],
            [
                5595,
                5645
            ],
            [
                5646,
                5649
            ],
            [
                5653,
                5671
            ],
            [
                5718,
                5750
            ],
            [
                5750,
                5772
            ],
            [
                5778,
                5814
            ],
            [
                5828,
                5855
            ],
            [
                5855,
                5893
            ],
            [
                5893,
                5921
            ],
            [
                5921,
                5925
            ],
            [
                5956,
                5957
            ],
            [
                5925,
                5926
            ],
            [
                5958,
                5999
            ],
            [
                5999,
                6040
            ],
            [
                6040,
                6063
            ],
            [
                6063,
                6080
            ],
            [
                6080,
                6122
            ],
            [
                6259,
                6264
            ],
            [
                6294,
                6323
            ],
            [
                6336,
                6338
            ],
            [
                6338,
                6402
            ],
            [
                6402,
                6434
            ],
            [
                6478,
                6481
            ],
            [
                6481,
                6551
            ],
            [
                6565,
                6613
            ],
            [
                6613,
                6689
            ],
            [
                6689,
                6751
            ],
            [
                6751,
                6810
            ],
            [
                6837,
                6886
            ],
            [
                6916,
                6918
            ],
            [
                6955,
                6978
            ],
            [
                6978,
                7036
            ],
            [
                7036,
                7085
            ],
            [
                7100,
                7136
            ],
            [
                7188,
                7224
            ],
            [
                7280,
                7358
            ],
            [
                7362,
                7368
            ],
            [
                7387,
                7485
            ],
            [
                7485,
                7546
            ],
            [
                7609,
                7625
            ],
            [
                7625,
                7659
            ],
            [
                7664,
                7670
            ],
            [
                7683,
                7717
            ],
            [
                7717,
                7747
            ],
            [
                7817,
                7823
            ],
            [
                7773,
                7781
            ],
            [
                7824,
                7826
            ],
            [
                7851,
                7853
            ],
            [
                7853,
                7909
            ],
            [
                7909,
                7965
            ],
            [
                8023,
                8025
            ],
            [
                7976,
                7984
            ],
            [
                8029,
                8031
            ],
            [
                8031,
                8039
            ],
            [
                8046,
                8073
            ],
            [
                8146,
                8170
            ],
            [
                8201,
                8237
            ],
            [
                8240,
                8259
            ],
            [
                8259,
                8306
            ],
            [
                8306,
                8393
            ],
            [
                8393,
                8427
            ],
            [
                8427,
                8456
            ],
            [
                8469,
                8519
            ],
            [
                8519,
                8563
            ],
            [
                8563,
                8581
            ],
            [
                8586,
                8648
            ],
            [
                8648,
                8702
            ],
            [
                8780,
                8782
            ],
            [
                8782,
                8791
            ],
            [
                8793,
                8837
            ],
            [
                8837,
                8862
            ],
            [
                8869,
                8908
            ],
            [
                8908,
                8957
            ],
            [
                9051,
                9053
            ],
            [
                9053,
                9087
            ],
            [
                9087,
                9212
            ],
            [
                9212,
                9283
            ],
            [
                9294,
                9408
            ],
            [
                9452,
                9454
            ],
            [
                9454,
                9479
            ],
            [
                9503,
                9605
            ],
            [
                9605,
                9651
            ],
            [
                9709,
                9711
            ],
            [
                9711,
                9799
            ],
            [
                9799,
                9800
            ],
            [
                9816,
                9847
            ],
            [
                9847,
                9913
            ],
            [
                9937,
                9939
            ],
            [
                9939,
                10038
            ],
            [
                10039,
                10067
            ],
            [
                10067,
                10081
            ],
            [
                10100,
                10139
            ],
            [
                10147,
                10152
            ],
            [
                10152,
                10192
            ],
            [
                10193,
                10230
            ],
            [
                10230,
                10269
            ],
            [
                10269,
                10282
            ],
            [
                10305,
                10329
            ],
            [
                10334,
                10370
            ],
            [
                10373,
                10411
            ],
            [
                10411,
                10489
            ],
            [
                10489,
                10524
            ],
            [
                10594,
                10641
            ],
            [
                10652,
                10707
            ],
            [
                10707,
                10723
            ],
            [
                10778,
                10842
            ],
            [
                10842,
                10902
            ],
            [
                10903,
                10915
            ],
            [
                10915,
                10924
            ],
            [
                10934,
                11044
            ],
            [
                11044,
                11086
            ],
            [
                11176,
                11180
            ],
            [
                11247,
                11299
            ],
            [
                11299,
                11313
            ],
            [
                11322,
                11325
            ],
            [
                11331,
                11359
            ],
            [
                11372,
                11377
            ],
            [
                11362,
                11363
            ],
            [
                11480,
                11487
            ],
            [
                11506,
                11550
            ],
            [
                11550,
                11593
            ],
            [
                11593,
                11600
            ],
            [
                11606,
                11664
            ],
            [
                11664,
                11673
            ],
            [
                11675,
                11684
            ],
            [
                11711,
                11744
            ],
            [
                11744,
                11753
            ],
            [
                11757,
                11794
            ],
            [
                11902,
                11914
            ],
            [
                11914,
                11917
            ],
            [
                11919,
                11963
            ],
            [
                11966,
                11969
            ],
            [
                11969,
                11982
            ],
            [
                11982,
                11992
            ],
            [
                11994,
                12005
            ],
            [
                12005,
                12045
            ],
            [
                12045,
                12050
            ],
            [
                12052,
                12107
            ],
            [
                12121,
                12135
            ],
            [
                12196,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12257,
                12312
            ],
            [
                12312,
                12356
            ],
            [
                12435,
                12436
            ],
            [
                12475,
                12486
            ],
            [
                12490,
                12557
            ],
            [
                12557,
                12571
            ],
            [
                12757,
                12761
            ],
            [
                12763,
                12767
            ],
            [
                12772,
                12773
            ],
            [
                12778,
                12810
            ],
            [
                12811,
                12858
            ],
            [
                12870,
                12873
            ],
            [
                12873,
                12899
            ],
            [
                12899,
                12930
            ],
            [
                12967,
                13022
            ],
            [
                13024,
                13048
            ],
            [
                13052,
                13057
            ],
            [
                13057,
                13094
            ],
            [
                13129,
                13176
            ],
            [
                13176,
                13187
            ],
            [
                13189,
                13200
            ],
            [
                13200,
                13217
            ],
            [
                13217,
                13235
            ],
            [
                13237,
                13249
            ],
            [
                13249,
                13298
            ],
            [
                13298,
                13351
            ],
            [
                13441,
                13571
            ],
            [
                13571,
                13572
            ],
            [
                13580,
                13611
            ],
            [
                13611,
                13636
            ],
            [
                13645,
                13659
            ],
            [
                13662,
                13668
            ],
            [
                13685,
                13695
            ],
            [
                13719,
                13796
            ],
            [
                13799,
                13805
            ],
            [
                13822,
                13862
            ],
            [
                13932,
                13981
            ],
            [
                14010,
                14036
            ],
            [
                14036,
                14095
            ],
            [
                14095,
                14163
            ],
            [
                14169,
                14175
            ],
            [
                14202,
                14205
            ],
            [
                14205,
                14274
            ],
            [
                14310,
                14330
            ],
            [
                14330,
                14391
            ],
            [
                14458,
                14490
            ],
            [
                14490,
                14501
            ],
            [
                14503,
                14514
            ],
            [
                14514,
                14546
            ],
            [
                14595,
                14634
            ],
            [
                14660,
                14674
            ],
            [
                14635,
                14642
            ],
            [
                14693,
                14696
            ],
            [
                14696,
                14748
            ],
            [
                14748,
                14769
            ],
            [
                14796,
                14887
            ],
            [
                14887,
                14933
            ],
            [
                14956,
                14958
            ],
            [
                14958,
                15082
            ],
            [
                15083,
                15118
            ],
            [
                15140,
                15161
            ],
            [
                15162,
                15215
            ],
            [
                15215,
                15230
            ],
            [
                15251,
                15358
            ],
            [
                15359,
                15517
            ],
            [
                15524,
                15543
            ],
            [
                15602,
                15611
            ],
            [
                15548,
                15578
            ],
            [
                15619,
                15648
            ],
            [
                15670,
                15703
            ],
            [
                15704,
                15722
            ],
            [
                15741,
                15768
            ],
            [
                15768,
                15928
            ],
            [
                15929,
                15948
            ],
            [
                15954,
                15992
            ],
            [
                15996,
                16012
            ],
            [
                16012,
                16102
            ],
            [
                16114,
                16126
            ],
            [
                16142,
                16144
            ],
            [
                16127,
                16130
            ],
            [
                16152,
                16158
            ],
            [
                16191,
                16192
            ],
            [
                16193,
                16221
            ],
            [
                16221,
                16243
            ],
            [
                16274,
                16297
            ],
            [
                16312,
                16333
            ],
            [
                16333,
                16404
            ],
            [
                16413,
                16427
            ],
            [
                16427,
                16446
            ],
            [
                16451,
                16463
            ],
            [
                16522,
                16559
            ],
            [
                16566,
                16627
            ],
            [
                16627,
                16747
            ],
            [
                16747,
                16831
            ],
            [
                16831,
                16872
            ],
            [
                16872,
                16939
            ],
            [
                16941,
                16965
            ],
            [
                16965,
                16985
            ],
            [
                16999,
                17004
            ],
            [
                17014,
                17142
            ],
            [
                17171,
                17204
            ],
            [
                17209,
                17247
            ]
        ],
        "row_chars": [
            [
                0,
                133
            ],
            [
                133,
                313
            ],
            [
                313,
                453
            ],
            [
                453,
                692
            ],
            [
                692,
                855
            ],
            [
                855,
                908
            ],
            [
                908,
                1101
            ],
            [
                1101,
                1157
            ],
            [
                1157,
                1239
            ],
            [
                1239,
                1319
            ],
            [
                1319,
                1551
            ],
            [
                1551,
                1669
            ],
            [
                1669,
                1874
            ],
            [
                1874,
                1961
            ],
            [
                1961,
                2247
            ],
            [
                2247,
                2324
            ],
            [
                2324,
                2381
            ],
            [
                2381,
                2447
            ],
            [
                2447,
                2555
            ],
            [
                2555,
                2611
            ],
            [
                2611,
                2723
            ],
            [
                2723,
                2966
            ],
            [
                2966,
                3026
            ],
            [
                3026,
                3195
            ],
            [
                3195,
                3317
            ],
            [
                3317,
                3442
            ],
            [
                3442,
                3550
            ],
            [
                3550,
                3648
            ],
            [
                3648,
                3781
            ],
            [
                3781,
                4030
            ],
            [
                4030,
                4326
            ],
            [
                4326,
                4548
            ],
            [
                4548,
                4622
            ],
            [
                4622,
                4804
            ],
            [
                4804,
                4832
            ],
            [
                4832,
                4971
            ],
            [
                4971,
                4997
            ],
            [
                4997,
                5154
            ],
            [
                5154,
                5322
            ],
            [
                5322,
                5646
            ],
            [
                5646,
                5750
            ],
            [
                5750,
                5855
            ],
            [
                5855,
                5893
            ],
            [
                5893,
                5921
            ],
            [
                5921,
                5999
            ],
            [
                5999,
                6040
            ],
            [
                6040,
                6063
            ],
            [
                6063,
                6080
            ],
            [
                6080,
                6338
            ],
            [
                6338,
                6402
            ],
            [
                6402,
                6481
            ],
            [
                6481,
                6551
            ],
            [
                6551,
                6565
            ],
            [
                6565,
                6613
            ],
            [
                6613,
                6689
            ],
            [
                6689,
                6751
            ],
            [
                6751,
                6810
            ],
            [
                6810,
                6837
            ],
            [
                6837,
                6918
            ],
            [
                6918,
                6978
            ],
            [
                6978,
                7036
            ],
            [
                7036,
                7137
            ],
            [
                7137,
                7188
            ],
            [
                7188,
                7226
            ],
            [
                7226,
                7280
            ],
            [
                7280,
                7358
            ],
            [
                7358,
                7485
            ],
            [
                7485,
                7625
            ],
            [
                7625,
                7717
            ],
            [
                7717,
                7747
            ],
            [
                7747,
                7853
            ],
            [
                7853,
                7909
            ],
            [
                7909,
                8031
            ],
            [
                8031,
                8171
            ],
            [
                8171,
                8259
            ],
            [
                8259,
                8306
            ],
            [
                8306,
                8393
            ],
            [
                8393,
                8427
            ],
            [
                8427,
                8456
            ],
            [
                8456,
                8519
            ],
            [
                8519,
                8563
            ],
            [
                8563,
                8648
            ],
            [
                8648,
                8782
            ],
            [
                8782,
                8837
            ],
            [
                8837,
                8908
            ],
            [
                8908,
                9053
            ],
            [
                9053,
                9087
            ],
            [
                9087,
                9212
            ],
            [
                9212,
                9454
            ],
            [
                9454,
                9605
            ],
            [
                9605,
                9711
            ],
            [
                9711,
                9799
            ],
            [
                9799,
                9847
            ],
            [
                9847,
                9939
            ],
            [
                9939,
                10039
            ],
            [
                10039,
                10067
            ],
            [
                10067,
                10152
            ],
            [
                10152,
                10193
            ],
            [
                10193,
                10230
            ],
            [
                10230,
                10269
            ],
            [
                10269,
                10411
            ],
            [
                10411,
                10489
            ],
            [
                10489,
                10642
            ],
            [
                10642,
                10652
            ],
            [
                10652,
                10707
            ],
            [
                10707,
                10723
            ],
            [
                10723,
                10778
            ],
            [
                10778,
                10842
            ],
            [
                10842,
                10915
            ],
            [
                10915,
                11044
            ],
            [
                11044,
                11299
            ],
            [
                11299,
                11471
            ],
            [
                11471,
                11550
            ],
            [
                11550,
                11664
            ],
            [
                11664,
                11744
            ],
            [
                11744,
                11794
            ],
            [
                11794,
                11895
            ],
            [
                11895,
                11914
            ],
            [
                11914,
                11969
            ],
            [
                11969,
                11982
            ],
            [
                11982,
                12005
            ],
            [
                12005,
                12045
            ],
            [
                12045,
                12135
            ],
            [
                12135,
                12196
            ],
            [
                12196,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12257,
                12312
            ],
            [
                12312,
                12356
            ],
            [
                12356,
                12435
            ],
            [
                12435,
                12557
            ],
            [
                12557,
                12571
            ],
            [
                12571,
                12701
            ],
            [
                12701,
                12757
            ],
            [
                12757,
                12873
            ],
            [
                12873,
                12899
            ],
            [
                12899,
                12930
            ],
            [
                12930,
                12967
            ],
            [
                12967,
                13057
            ],
            [
                13057,
                13096
            ],
            [
                13096,
                13129
            ],
            [
                13129,
                13176
            ],
            [
                13176,
                13200
            ],
            [
                13200,
                13217
            ],
            [
                13217,
                13249
            ],
            [
                13249,
                13298
            ],
            [
                13298,
                13352
            ],
            [
                13352,
                13417
            ],
            [
                13417,
                13441
            ],
            [
                13441,
                13571
            ],
            [
                13571,
                13611
            ],
            [
                13611,
                13659
            ],
            [
                13659,
                13796
            ],
            [
                13796,
                13983
            ],
            [
                13983,
                14010
            ],
            [
                14010,
                14036
            ],
            [
                14036,
                14095
            ],
            [
                14095,
                14205
            ],
            [
                14205,
                14330
            ],
            [
                14330,
                14490
            ],
            [
                14490,
                14514
            ],
            [
                14514,
                14696
            ],
            [
                14696,
                14748
            ],
            [
                14748,
                14887
            ],
            [
                14887,
                14958
            ],
            [
                14958,
                15083
            ],
            [
                15083,
                15215
            ],
            [
                15215,
                15359
            ],
            [
                15359,
                15517
            ],
            [
                15517,
                15768
            ],
            [
                15768,
                15929
            ],
            [
                15929,
                16012
            ],
            [
                16012,
                16193
            ],
            [
                16193,
                16221
            ],
            [
                16221,
                16243
            ],
            [
                16243,
                16250
            ],
            [
                16250,
                16333
            ],
            [
                16333,
                16427
            ],
            [
                16427,
                16559
            ],
            [
                16559,
                16627
            ],
            [
                16627,
                16747
            ],
            [
                16747,
                16831
            ],
            [
                16831,
                16872
            ],
            [
                16872,
                16965
            ],
            [
                16965,
                17247
            ]
        ]
    },
    "abridged": {
        "text": "At this time, a fortnight before the election, Mr. Longestaffe came up to town and saw Mr. Melmotte very frequently. He could not go into his own house, as he had let that for a month to the great financier, but he lived at the Carlton. He was delighted to find that his new friend was an honest Conservative, and proposed him as a member at the club. However, according to the rules it was decided that the club could only admit Mr. Melmotte once he occupied a seat in the House of Commons.\nMr. Melmotte, who was becoming somewhat arrogant, was heard to declare that the club might do without him. If not elected at once, he should withdraw his name. So great was his prestige at this moment that there were some, Mr. Longestaffe included, who tried to persuade the committee that Mr. Melmotte was not like other men. Rules should not control the club in a matter of such importance as this. But the club for the time lost the honour of entertaining Mr. Melmotte.\nIt may be remembered that Mr. Longestaffe had been anxious to become one of the directors of the Mexican Railway, and that he was snubbed when he expressed his wish to Mr. Melmotte. Like other great men, Mr. Melmotte liked to choose his own time for bestowing favours. The time had now come, and he had let Mr. Longestaffe know that there would be a place for him at the Board.\nThe alliance between Mr. Melmotte and Mr. Longestaffe had become very close. And Mr. Melmotte had bought Mr. Longestaffe's estate at Pickering on terms very favourable to the Longestaffes. Mr. Melmotte suggested to Mr. Longestaffe that he had better qualify for his seat at the Board by taking shares in the Company to the amount of two or three thousand pounds, and Mr. Longestaffe had of course consented. No ready cash was needed. The shares could be paid for out of Mr. Longestaffe's half of the purchase money for Pickering Park, and could remain for the present in Mr. Melmotte's hands. To this also Mr. Longestaffe had consented, not quite understanding why the scrip should not be made over to him at once.\nIt was a part of the charm of all dealings with this great man that no ready money seemed ever to be necessary for anything. Great transactions were apparently completed without the signing even of a cheque. Mr. Longestaffe was afraid even to give a hint to Mr. Melmotte about ready money. Pickering had been purchased and the title-deeds made over to Mr. Melmotte; but the 80,000 had not been paid, though of course Mr. Melmotte's note assenting to the terms was security sufficient for any reasonable man. The property had been mortgaged, but there was still a sum of 50,000 to come, of which Dolly was to have one half and the other was to be used in paying off Mr. Longestaffe's debts. It would have been very pleasant to have had this at once - but Mr. Longestaffe felt the absurdity of pressing such a man as Mr. Melmotte.\nBut Dolly wanted his money. Dolly, idle and foolish as he was, liked to have what belonged to him. 5,000 would pay off all his tradesmen's debts and leave him comfortably possessed of money in hand, while the other 20,000 would make his own property free. Dolly was growing impatient. He had actually gone down to Caversham to arrange the terms with his father, and had been almost triumphant, thinking that the money would come the next day, or at any rate during the next week.\nNow Dolly came to his father to enquire what was being done. He had not as yet been blessed with a single ten-pound note as the result of the sale.\n\"Are you going to see Melmotte, sir?\" he asked somewhat abruptly.\n\"Yes, tomorrow; and he is to introduce me to the Board.\"\n\"You're going in for that, are you, sir? Do they pay anything?\"\n\"I believe not.\"\n\"Nidderdale and young Carbury belong to it, and Miles Grendall and old Alfred. I don't think they'd go in for it, if there was no money going. I'd make them fork out something.\"\n\"I think that perhaps, Adolphus, you hardly understand these things.\"\n\"No, I don't understand much about business, I know. What I want to understand is, when Melmotte is going to pay up this money.\"\n\"I suppose he'll arrange it with the banks,\" said the father.\n\"I beg that he won't arrange my money with the banks, sir. I want a cheque upon his bank which I can pay in to mine. You'd better tell him. If you don't like, you know, I'll get Squercum to do it.\" Mr. Squercum was a lawyer whom Dolly had employed lately, much to the annoyance of his parent.\n\"I beg you'll do nothing of the kind.\"\n\"Then he'd better pay up, like anybody else,\" said Dolly as he left the room. His father was quite sure that Squercum would have his finger in the pie unless the money were paid quickly. When Dolly had taken an idea into his head, no power on earth would turn him.\nOn that same day Melmotte received visits from two of his fellow directors. At the time he was very busy. He had speeches to write. Members of his Committee were always trying to see him. Orders as to the dinner and the preparation of the house had to be given. And then his gigantic commercial affairs required much labour on his part.\nStill he saw each of these young men for a few minutes. \"My dear young friend, what can I do for you?\" he said to Sir Felix, not sitting down, so that Sir Felix also should remain standing.\n\"About that money, Mr. Melmotte?\"\n\"What money, my dear fellow? A good many money matters pass through my hands.\"\n\"The thousand pounds I gave you for shares. If you don't mind, as the shares seem to be a bother, I'll take the money back.\"\n\"It was only the other day you had 200,\" said Melmotte.\n\"Exactly; and you might as well let me have the 800.\"\n\"I've ordered the shares; gave the order to my broker the other day.\"\n\"Then I'd better take the shares,\" said Sir Felix. \"Could I get them, Mr. Melmotte?\"\n\"My dear fellow, I really think you hardly calculate the value of my time when you come to me about such an affair as this.\"\n\"I'd like to have the money or the shares,\" said Sir Felix, who was not especially averse to quarrelling with Mr. Melmotte now that he had resolved upon taking that gentleman's daughter to New York. Their quarrel would be so bitter when the departure should be discovered, that any present anger could hardly increase its bitterness. What Felix thought of now was simply his money.\n\"You're a spendthrift,\" said Melmotte, apparently relenting, \"and I'm afraid a gambler. I can give you 200 more on account.\"\nSir Felix could not resist the touch of ready money, and consented. As he pocketed the cheque he asked for the name of the brokers who were employed to buy the shares.\nBut here Melmotte demurred. \"No, my friend. You are only entitled to shares for 600 now. I will see that the thing is put right.\"\nSo Sir Felix departed with 200 only. Marie had said that she could get 200. Perhaps if he wrote to some of Miles's relations he could obtain payment of part of that gentleman's debt to him.\nSir Felix going down the stairs in Abchurch Lane met Paul Montague coming up. Carbury, on the spur of the moment, said, \"What's this I hear about a lady at Islington?\"\n\"Who has told you anything about a lady at Islington?\"\n\"A little bird. I'm told that I'm to congratulate you on your coming marriage.\"\n\"Then you've been told an infernal falsehood,\" said Montague, passing on. He paused and added, \"I don't know who can have told you, but if you hear it again, I'll trouble you to contradict it.\" As he was waiting in Melmotte's outer room, he thought that of course the rumour had come through Ruby Ruggles.\nMiles Grendall came out and said that the great man would see him; but was very busy. Paul assured him that he would be concise, and was shown in.\n\"I should not have troubled you,\" said Paul to Melmotte, \"only I understood that I was to see you before the Board met.\"\n\"Exactly; of course - only you see I am a little busy. If this d___d dinner were over I shouldn't mind. Let me see. Oh; I was proposing that you should go out to Peking?\"\n\"To Mexico.\"\n\"Yes, yes; to Mexico. I've so many things running in my head! Well; if you'll say when you're ready to start, we'll draw up some instructions. You'll see Fisker, of course. You and Fisker will manage it. The chief thing will be a cheque for the expenses; eh? We must get that passed at the next Board.\"\n\"Mr. Melmotte, I have made up my mind that it would not be fit that I should go.\"\n\"Oh, indeed!\"\n\"No; even if I saw my way to do any good in America, my duties here would not be compatible with the trip.\"\n\"I don't see that at all. What duties have you got here? If you do stay, I hope you'll be unanimous; that's all; or perhaps you intend to get out. If that's it, I'll look to your money.\"\n\"That, Mr. Melmotte, is what I should prefer.\"\n\"Very well, very well. I'll arrange it. Sorry to lose you, that's all. Miles, isn't Mr. Goldsheiner waiting to see me?\"\n\"You're a little too quick, Mr. Melmotte,\" said Paul. \"I cannot tell you as a fact that I shall withdraw from the Board till I receive the advice of a friend with whom I am consulting. I do not yet know what my duty may be.\"\n\"I'll tell you, sir, what cannot be your duty. You cannot make known any of the affairs of the Company which you have learned in that Board-room. You cannot divulge the circumstances of the Company to any gentleman who is a stranger to the Company.\"\n\"Thank you, Mr. Melmotte. On matters such as that I think that I can see my own way. I have been in fault in coming in to the Board without understanding my duties.\"\n\"Very much in fault, I should say,\" replied Melmotte, whose arrogance was overcoming him.\n\"But in reference to what I may or may not say to any friend, I do not want advice from you.\"\n\"Very well; very well. I can't ask you to stay, because Goldsheiner is waiting to see me, about more important matters.\" Montague had said what he had to say, and departed.\nOn the following day, before the meeting of the Board of Directors, old Mr. Longestaffe called in Abchurch Lane. He was received very civilly by Miles Grendall. Mr. Melmotte quite expected him, and would walk with him over to the offices of the railway, and introduce him to the Board.\nMr. Longestaffe, with some shyness, said he desired to have a few moments' conversation with the chairman before the Board met. Fearing his son and Squercum, he had made up his mind to suggest that the little matter about Pickering Park should be settled.\nMiles assured him that the opportunity should be given him, but that at the present moment the chief secretary of the Russian Legation was with Mr. Melmotte. The chief secretary must have been very tedious with his business, for Mr. Longestaffe was not summoned to walk off to the Board until five minutes after the Board should have met. He thought that he could explain his views in the street; but on the stairs they were joined by Mr. Cohenlupe, and in three minutes they were in the Board-room.\nMr. Longestaffe was presented, and took the chair opposite Miles Grendall. Montague was not there, but had sent a letter to the secretary explaining that for reasons known to the chairman he was absent.\n\"All right,\" said Melmotte. \"I know all about it. Mr. Montague's retirement may be an advantage. He could not be made to understand that unanimity in such an enterprise is essential. I am confident that our new director will not sin in the same direction.\" Mr. Melmotte bowed and smiled very sweetly on Mr. Longestaffe.\nMr. Longestaffe was astonished to find how soon the business was done, and how very little he had been called on to do. Miles Grendall had read something out of a book which he had been unable to follow. Then the chairman had read some figures. Mr. Cohenlupe had declared that their prosperity was unprecedented; and the Board was over. When Mr. Longestaffe told Miles that he still wished to speak to Mr. Melmotte, Miles explained to him that the chairman had been obliged to run off to a meeting about the interior of Africa, which was being held at the Cannon Street Hotel.",
        "paragraph_chars": [
            [
                0,
                492
            ],
            [
                492,
                965
            ],
            [
                965,
                1343
            ],
            [
                1343,
                2058
            ],
            [
                2058,
                2887
            ],
            [
                2887,
                3367
            ],
            [
                3367,
                3515
            ],
            [
                3515,
                3581
            ],
            [
                3581,
                3638
            ],
            [
                3638,
                3702
            ],
            [
                3702,
                3719
            ],
            [
                3719,
                3897
            ],
            [
                3897,
                3967
            ],
            [
                3967,
                4096
            ],
            [
                4096,
                4158
            ],
            [
                4158,
                4451
            ],
            [
                4451,
                4490
            ],
            [
                4490,
                4755
            ],
            [
                4755,
                5092
            ],
            [
                5092,
                5282
            ],
            [
                5282,
                5316
            ],
            [
                5316,
                5395
            ],
            [
                5395,
                5520
            ],
            [
                5520,
                5576
            ],
            [
                5576,
                5630
            ],
            [
                5630,
                5700
            ],
            [
                5700,
                5785
            ],
            [
                5785,
                5910
            ],
            [
                5910,
                6292
            ],
            [
                6292,
                6417
            ],
            [
                6417,
                6585
            ],
            [
                6585,
                6715
            ],
            [
                6715,
                6905
            ],
            [
                6905,
                7073
            ],
            [
                7073,
                7128
            ],
            [
                7128,
                7208
            ],
            [
                7208,
                7514
            ],
            [
                7514,
                7661
            ],
            [
                7661,
                7782
            ],
            [
                7782,
                7953
            ],
            [
                7953,
                7966
            ],
            [
                7966,
                8269
            ],
            [
                8269,
                8351
            ],
            [
                8351,
                8365
            ],
            [
                8365,
                8473
            ],
            [
                8473,
                8660
            ],
            [
                8660,
                8707
            ],
            [
                8707,
                8827
            ],
            [
                8827,
                9052
            ],
            [
                9052,
                9302
            ],
            [
                9302,
                9468
            ],
            [
                9468,
                9558
            ],
            [
                9558,
                9652
            ],
            [
                9652,
                9825
            ],
            [
                9825,
                10111
            ],
            [
                10111,
                10367
            ],
            [
                10367,
                10867
            ],
            [
                10867,
                11070
            ],
            [
                11070,
                11390
            ],
            [
                11390,
                11966
            ]
        ],
        "segment_chars": [
            [
                0,
                117
            ],
            [
                117,
                237
            ],
            [
                237,
                352
            ],
            [
                352,
                492
            ],
            [
                492,
                599
            ],
            [
                599,
                652
            ],
            [
                652,
                819
            ],
            [
                819,
                893
            ],
            [
                893,
                965
            ],
            [
                965,
                1147
            ],
            [
                1147,
                1234
            ],
            [
                1234,
                1343
            ],
            [
                1343,
                1420
            ],
            [
                1420,
                1532
            ],
            [
                1532,
                1751
            ],
            [
                1751,
                1777
            ],
            [
                1777,
                1936
            ],
            [
                1936,
                2058
            ],
            [
                2058,
                2183
            ],
            [
                2183,
                2266
            ],
            [
                2266,
                2348
            ],
            [
                2348,
                2566
            ],
            [
                2566,
                2748
            ],
            [
                2748,
                2887
            ],
            [
                2887,
                2915
            ],
            [
                2915,
                2986
            ],
            [
                2986,
                3143
            ],
            [
                3143,
                3172
            ],
            [
                3172,
                3367
            ],
            [
                3367,
                3428
            ],
            [
                3428,
                3515
            ],
            [
                3515,
                3553
            ],
            [
                3553,
                3581
            ],
            [
                3581,
                3638
            ],
            [
                3638,
                3679
            ],
            [
                3679,
                3702
            ],
            [
                3702,
                3719
            ],
            [
                3719,
                3798
            ],
            [
                3798,
                3862
            ],
            [
                3862,
                3897
            ],
            [
                3897,
                3967
            ],
            [
                3967,
                4020
            ],
            [
                4020,
                4096
            ],
            [
                4096,
                4158
            ],
            [
                4158,
                4217
            ],
            [
                4217,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4356
            ],
            [
                4356,
                4451
            ],
            [
                4451,
                4490
            ],
            [
                4490,
                4568
            ],
            [
                4568,
                4677
            ],
            [
                4677,
                4755
            ],
            [
                4755,
                4831
            ],
            [
                4831,
                4861
            ],
            [
                4861,
                4887
            ],
            [
                4887,
                4943
            ],
            [
                4943,
                5017
            ],
            [
                5017,
                5092
            ],
            [
                5092,
                5148
            ],
            [
                5148,
                5195
            ],
            [
                5195,
                5282
            ],
            [
                5282,
                5316
            ],
            [
                5316,
                5345
            ],
            [
                5345,
                5395
            ],
            [
                5395,
                5439
            ],
            [
                5439,
                5520
            ],
            [
                5520,
                5576
            ],
            [
                5576,
                5630
            ],
            [
                5630,
                5700
            ],
            [
                5700,
                5751
            ],
            [
                5751,
                5785
            ],
            [
                5785,
                5910
            ],
            [
                5910,
                6109
            ],
            [
                6109,
                6244
            ],
            [
                6244,
                6292
            ],
            [
                6292,
                6380
            ],
            [
                6380,
                6417
            ],
            [
                6417,
                6485
            ],
            [
                6485,
                6585
            ],
            [
                6585,
                6613
            ],
            [
                6613,
                6629
            ],
            [
                6629,
                6674
            ],
            [
                6674,
                6715
            ],
            [
                6715,
                6752
            ],
            [
                6752,
                6791
            ],
            [
                6791,
                6905
            ],
            [
                6905,
                6983
            ],
            [
                6983,
                7073
            ],
            [
                7073,
                7128
            ],
            [
                7128,
                7144
            ],
            [
                7144,
                7208
            ],
            [
                7208,
                7282
            ],
            [
                7282,
                7402
            ],
            [
                7402,
                7514
            ],
            [
                7514,
                7600
            ],
            [
                7600,
                7661
            ],
            [
                7661,
                7782
            ],
            [
                7782,
                7837
            ],
            [
                7837,
                7886
            ],
            [
                7886,
                7898
            ],
            [
                7898,
                7953
            ],
            [
                7953,
                7966
            ],
            [
                7966,
                7988
            ],
            [
                7988,
                8028
            ],
            [
                8028,
                8109
            ],
            [
                8109,
                8139
            ],
            [
                8139,
                8170
            ],
            [
                8170,
                8225
            ],
            [
                8225,
                8269
            ],
            [
                8269,
                8351
            ],
            [
                8351,
                8365
            ],
            [
                8365,
                8473
            ],
            [
                8473,
                8499
            ],
            [
                8499,
                8530
            ],
            [
                8530,
                8620
            ],
            [
                8620,
                8660
            ],
            [
                8660,
                8707
            ],
            [
                8707,
                8730
            ],
            [
                8730,
                8747
            ],
            [
                8747,
                8778
            ],
            [
                8778,
                8827
            ],
            [
                8827,
                8881
            ],
            [
                8881,
                9012
            ],
            [
                9012,
                9052
            ],
            [
                9052,
                9099
            ],
            [
                9099,
                9198
            ],
            [
                9198,
                9302
            ],
            [
                9302,
                9328
            ],
            [
                9328,
                9387
            ],
            [
                9387,
                9468
            ],
            [
                9468,
                9558
            ],
            [
                9558,
                9652
            ],
            [
                9652,
                9675
            ],
            [
                9675,
                9773
            ],
            [
                9773,
                9825
            ],
            [
                9825,
                9938
            ],
            [
                9938,
                9986
            ],
            [
                9986,
                10111
            ],
            [
                10111,
                10239
            ],
            [
                10239,
                10367
            ],
            [
                10367,
                10525
            ],
            [
                10525,
                10706
            ],
            [
                10706,
                10867
            ],
            [
                10867,
                10942
            ],
            [
                10942,
                11070
            ],
            [
                11070,
                11098
            ],
            [
                11098,
                11120
            ],
            [
                11120,
                11167
            ],
            [
                11167,
                11253
            ],
            [
                11253,
                11327
            ],
            [
                11327,
                11390
            ],
            [
                11390,
                11510
            ],
            [
                11510,
                11594
            ],
            [
                11594,
                11635
            ],
            [
                11635,
                11727
            ],
            [
                11727,
                11966
            ]
        ],
        "overlap_chars": [
            [
                3,
                25
            ],
            [
                26,
                117
            ],
            [
                117,
                207
            ],
            [
                208,
                214
            ],
            [
                215,
                237
            ],
            [
                237,
                243
            ],
            [
                244,
                313
            ],
            [
                314,
                322
            ],
            [
                339,
                352
            ],
            [
                359,
                360
            ],
            [
                384,
                412
            ],
            [
                413,
                442
            ],
            [
                448,
                450
            ],
            [
                460,
                491
            ],
            [
                492,
                567
            ],
            [
                568,
                576
            ],
            [
                577,
                599
            ],
            [
                599,
                652
            ],
            [
                652,
                692
            ],
            [
                693,
                730
            ],
            [
                739,
                744
            ],
            [
                763,
                776
            ],
            [
                782,
                819
            ],
            [
                819,
                824
            ],
            [
                832,
                835
            ],
            [
                836,
                893
            ],
            [
                893,
                896
            ],
            [
                897,
                965
            ],
            [
                965,
                1094
            ],
            [
                1095,
                1102
            ],
            [
                1103,
                1147
            ],
            [
                1147,
                1234
            ],
            [
                1234,
                1237
            ],
            [
                1238,
                1246
            ],
            [
                1247,
                1250
            ],
            [
                1251,
                1267
            ],
            [
                1272,
                1287
            ],
            [
                1293,
                1297
            ],
            [
                1298,
                1341
            ],
            [
                1341,
                1342
            ],
            [
                1343,
                1420
            ],
            [
                1420,
                1532
            ],
            [
                1534,
                1544
            ],
            [
                1545,
                1573
            ],
            [
                1574,
                1675
            ],
            [
                1676,
                1751
            ],
            [
                1751,
                1753
            ],
            [
                1760,
                1764
            ],
            [
                1775,
                1777
            ],
            [
                1777,
                1793
            ],
            [
                1794,
                1936
            ],
            [
                1936,
                2058
            ],
            [
                2058,
                2183
            ],
            [
                2183,
                2201
            ],
            [
                2202,
                2206
            ],
            [
                2207,
                2266
            ],
            [
                2266,
                2281
            ],
            [
                2286,
                2348
            ],
            [
                2348,
                2457
            ],
            [
                2458,
                2566
            ],
            [
                2566,
                2598
            ],
            [
                2599,
                2703
            ],
            [
                2709,
                2746
            ],
            [
                2746,
                2748
            ],
            [
                2748,
                2805
            ],
            [
                2808,
                2885
            ],
            [
                2885,
                2886
            ],
            [
                2887,
                2915
            ],
            [
                2915,
                2926
            ],
            [
                2927,
                2930
            ],
            [
                2931,
                2948
            ],
            [
                2948,
                2986
            ],
            [
                2986,
                3143
            ],
            [
                3149,
                3152
            ],
            [
                3170,
                3172
            ],
            [
                3172,
                3248
            ],
            [
                3249,
                3252
            ],
            [
                3253,
                3280
            ],
            [
                3281,
                3315
            ],
            [
                3316,
                3366
            ],
            [
                3367,
                3370
            ],
            [
                3377,
                3395
            ],
            [
                3396,
                3428
            ],
            [
                3428,
                3450
            ],
            [
                3451,
                3487
            ],
            [
                3488,
                3515
            ],
            [
                3515,
                3553
            ],
            [
                3553,
                3581
            ],
            [
                3581,
                3585
            ],
            [
                3585,
                3586
            ],
            [
                3595,
                3596
            ],
            [
                3597,
                3638
            ],
            [
                3638,
                3679
            ],
            [
                3679,
                3702
            ],
            [
                3702,
                3719
            ],
            [
                3719,
                3761
            ],
            [
                3761,
                3766
            ],
            [
                3767,
                3796
            ],
            [
                3796,
                3798
            ],
            [
                3798,
                3862
            ],
            [
                3862,
                3894
            ],
            [
                3894,
                3897
            ],
            [
                3897,
                3967
            ],
            [
                3972,
                4020
            ],
            [
                4020,
                4096
            ],
            [
                4096,
                4158
            ],
            [
                4158,
                4217
            ],
            [
                4224,
                4273
            ],
            [
                4273,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4356
            ],
            [
                4356,
                4405
            ],
            [
                4414,
                4450
            ],
            [
                4451,
                4487
            ],
            [
                4490,
                4568
            ],
            [
                4572,
                4578
            ],
            [
                4579,
                4677
            ],
            [
                4677,
                4738
            ],
            [
                4739,
                4755
            ],
            [
                4755,
                4789
            ],
            [
                4790,
                4796
            ],
            [
                4797,
                4831
            ],
            [
                4831,
                4861
            ],
            [
                4861,
                4867
            ],
            [
                4868,
                4876
            ],
            [
                4877,
                4879
            ],
            [
                4885,
                4887
            ],
            [
                4887,
                4943
            ],
            [
                4943,
                4999
            ],
            [
                5004,
                5006
            ],
            [
                5007,
                5015
            ],
            [
                5015,
                5017
            ],
            [
                5017,
                5025
            ],
            [
                5030,
                5057
            ],
            [
                5067,
                5091
            ],
            [
                5092,
                5128
            ],
            [
                5129,
                5148
            ],
            [
                5148,
                5195
            ],
            [
                5195,
                5282
            ],
            [
                5282,
                5316
            ],
            [
                5316,
                5345
            ],
            [
                5345,
                5395
            ],
            [
                5395,
                5439
            ],
            [
                5439,
                5457
            ],
            [
                5458,
                5520
            ],
            [
                5520,
                5574
            ],
            [
                5574,
                5576
            ],
            [
                5576,
                5585
            ],
            [
                5586,
                5630
            ],
            [
                5630,
                5655
            ],
            [
                5661,
                5700
            ],
            [
                5700,
                5749
            ],
            [
                5749,
                5751
            ],
            [
                5751,
                5785
            ],
            [
                5785,
                5910
            ],
            [
                5910,
                5981
            ],
            [
                5993,
                6107
            ],
            [
                6107,
                6109
            ],
            [
                6109,
                6134
            ],
            [
                6142,
                6244
            ],
            [
                6244,
                6290
            ],
            [
                6290,
                6292
            ],
            [
                6292,
                6380
            ],
            [
                6380,
                6381
            ],
            [
                6386,
                6417
            ],
            [
                6417,
                6483
            ],
            [
                6483,
                6485
            ],
            [
                6485,
                6584
            ],
            [
                6585,
                6613
            ],
            [
                6613,
                6627
            ],
            [
                6629,
                6668
            ],
            [
                6669,
                6674
            ],
            [
                6674,
                6714
            ],
            [
                6715,
                6752
            ],
            [
                6752,
                6791
            ],
            [
                6791,
                6804
            ],
            [
                6805,
                6829
            ],
            [
                6830,
                6866
            ],
            [
                6867,
                6905
            ],
            [
                6905,
                6983
            ],
            [
                6983,
                7018
            ],
            [
                7025,
                7072
            ],
            [
                7073,
                7128
            ],
            [
                7128,
                7144
            ],
            [
                7144,
                7208
            ],
            [
                7208,
                7268
            ],
            [
                7270,
                7282
            ],
            [
                7282,
                7291
            ],
            [
                7292,
                7402
            ],
            [
                7402,
                7444
            ],
            [
                7444,
                7448
            ],
            [
                7462,
                7514
            ],
            [
                7514,
                7528
            ],
            [
                7534,
                7537
            ],
            [
                7547,
                7575
            ],
            [
                7579,
                7584
            ],
            [
                7598,
                7599
            ],
            [
                7605,
                7612
            ],
            [
                7617,
                7661
            ],
            [
                7661,
                7704
            ],
            [
                7716,
                7723
            ],
            [
                7724,
                7782
            ],
            [
                7782,
                7791
            ],
            [
                7792,
                7801
            ],
            [
                7804,
                7837
            ],
            [
                7837,
                7846
            ],
            [
                7849,
                7886
            ],
            [
                7886,
                7898
            ],
            [
                7898,
                7901
            ],
            [
                7902,
                7946
            ],
            [
                7950,
                7953
            ],
            [
                7953,
                7966
            ],
            [
                7966,
                7976
            ],
            [
                7977,
                7988
            ],
            [
                7988,
                8028
            ],
            [
                8028,
                8033
            ],
            [
                8034,
                8089
            ],
            [
                8095,
                8109
            ],
            [
                8109,
                8139
            ],
            [
                8139,
                8170
            ],
            [
                8170,
                8225
            ],
            [
                8225,
                8269
            ],
            [
                8269,
                8270
            ],
            [
                8272,
                8283
            ],
            [
                8284,
                8351
            ],
            [
                8351,
                8365
            ],
            [
                8365,
                8369
            ],
            [
                8370,
                8374
            ],
            [
                8378,
                8379
            ],
            [
                8384,
                8416
            ],
            [
                8418,
                8465
            ],
            [
                8470,
                8473
            ],
            [
                8473,
                8499
            ],
            [
                8499,
                8530
            ],
            [
                8530,
                8585
            ],
            [
                8586,
                8610
            ],
            [
                8615,
                8620
            ],
            [
                8620,
                8657
            ],
            [
                8660,
                8707
            ],
            [
                8707,
                8718
            ],
            [
                8719,
                8730
            ],
            [
                8730,
                8747
            ],
            [
                8747,
                8765
            ],
            [
                8766,
                8778
            ],
            [
                8778,
                8827
            ],
            [
                8827,
                8880
            ],
            [
                8882,
                9012
            ],
            [
                9012,
                9013
            ],
            [
                9021,
                9052
            ],
            [
                9052,
                9077
            ],
            [
                9085,
                9099
            ],
            [
                9103,
                9109
            ],
            [
                9110,
                9120
            ],
            [
                9121,
                9198
            ],
            [
                9202,
                9208
            ],
            [
                9209,
                9249
            ],
            [
                9250,
                9299
            ],
            [
                9302,
                9328
            ],
            [
                9328,
                9387
            ],
            [
                9387,
                9455
            ],
            [
                9459,
                9465
            ],
            [
                9465,
                9468
            ],
            [
                9468,
                9537
            ],
            [
                9538,
                9558
            ],
            [
                9558,
                9619
            ],
            [
                9620,
                9652
            ],
            [
                9652,
                9663
            ],
            [
                9664,
                9675
            ],
            [
                9675,
                9707
            ],
            [
                9708,
                9747
            ],
            [
                9748,
                9762
            ],
            [
                9763,
                9770
            ],
            [
                9770,
                9773
            ],
            [
                9773,
                9825
            ],
            [
                9825,
                9846
            ],
            [
                9847,
                9938
            ],
            [
                9938,
                9984
            ],
            [
                9984,
                9986
            ],
            [
                9986,
                10110
            ],
            [
                10111,
                10146
            ],
            [
                10163,
                10184
            ],
            [
                10186,
                10239
            ],
            [
                10239,
                10254
            ],
            [
                10259,
                10366
            ],
            [
                10367,
                10525
            ],
            [
                10525,
                10544
            ],
            [
                10545,
                10554
            ],
            [
                10560,
                10590
            ],
            [
                10590,
                10619
            ],
            [
                10620,
                10653
            ],
            [
                10660,
                10678
            ],
            [
                10679,
                10706
            ],
            [
                10706,
                10866
            ],
            [
                10867,
                10886
            ],
            [
                10887,
                10925
            ],
            [
                10926,
                10942
            ],
            [
                10942,
                11032
            ],
            [
                11042,
                11054
            ],
            [
                11055,
                11057
            ],
            [
                11058,
                11061
            ],
            [
                11062,
                11068
            ],
            [
                11068,
                11069
            ],
            [
                11070,
                11098
            ],
            [
                11098,
                11120
            ],
            [
                11122,
                11145
            ],
            [
                11146,
                11167
            ],
            [
                11167,
                11238
            ],
            [
                11239,
                11253
            ],
            [
                11253,
                11272
            ],
            [
                11277,
                11289
            ],
            [
                11290,
                11327
            ],
            [
                11329,
                11390
            ],
            [
                11390,
                11510
            ],
            [
                11510,
                11594
            ],
            [
                11594,
                11635
            ],
            [
                11635,
                11702
            ],
            [
                11703,
                11727
            ],
            [
                11727,
                11747
            ],
            [
                11753,
                11758
            ],
            [
                11759,
                11887
            ],
            [
                11894,
                11927
            ],
            [
                11928,
                11966
            ]
        ],
        "row_chars": [
            [
                0,
                117
            ],
            [
                117,
                237
            ],
            [
                237,
                352
            ],
            [
                352,
                492
            ],
            [
                492,
                599
            ],
            [
                599,
                652
            ],
            [
                652,
                819
            ],
            [
                819,
                819
            ],
            [
                819,
                819
            ],
            [
                819,
                893
            ],
            [
                893,
                893
            ],
            [
                893,
                965
            ],
            [
                965,
                1147
            ],
            [
                1147,
                1234
            ],
            [
                1234,
                1343
            ],
            [
                1343,
                1420
            ],
            [
                1420,
                1420
            ],
            [
                1420,
                1420
            ],
            [
                1420,
                1420
            ],
            [
                1420,
                1420
            ],
            [
                1420,
                1532
            ],
            [
                1532,
                1751
            ],
            [
                1751,
                1777
            ],
            [
                1777,
                1936
            ],
            [
                1936,
                2058
            ],
            [
                2058,
                2183
            ],
            [
                2183,
                2266
            ],
            [
                2266,
                2348
            ],
            [
                2348,
                2348
            ],
            [
                2348,
                2566
            ],
            [
                2566,
                2748
            ],
            [
                2748,
                2887
            ],
            [
                2887,
                2887
            ],
            [
                2887,
                2887
            ],
            [
                2887,
                2915
            ],
            [
                2915,
                2986
            ],
            [
                2986,
                2986
            ],
            [
                2986,
                3143
            ],
            [
                3143,
                3172
            ],
            [
                3172,
                3367
            ],
            [
                3367,
                3428
            ],
            [
                3428,
                3515
            ],
            [
                3515,
                3553
            ],
            [
                3553,
                3581
            ],
            [
                3581,
                3638
            ],
            [
                3638,
                3679
            ],
            [
                3679,
                3702
            ],
            [
                3702,
                3719
            ],
            [
                3719,
                3798
            ],
            [
                3798,
                3862
            ],
            [
                3862,
                3897
            ],
            [
                3897,
                3967
            ],
            [
                3967,
                3967
            ],
            [
                3967,
                4020
            ],
            [
                4020,
                4096
            ],
            [
                4096,
                4158
            ],
            [
                4158,
                4217
            ],
            [
                4217,
                4217
            ],
            [
                4217,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4356
            ],
            [
                4356,
                4451
            ],
            [
                4451,
                4451
            ],
            [
                4451,
                4490
            ],
            [
                4490,
                4490
            ],
            [
                4490,
                4568
            ],
            [
                4568,
                4677
            ],
            [
                4677,
                4755
            ],
            [
                4755,
                4831
            ],
            [
                4831,
                4861
            ],
            [
                4861,
                4887
            ],
            [
                4887,
                4943
            ],
            [
                4943,
                5017
            ],
            [
                5017,
                5092
            ],
            [
                5092,
                5148
            ],
            [
                5148,
                5195
            ],
            [
                5195,
                5282
            ],
            [
                5282,
                5316
            ],
            [
                5316,
                5345
            ],
            [
                5345,
                5395
            ],
            [
                5395,
                5439
            ],
            [
                5439,
                5520
            ],
            [
                5520,
                5576
            ],
            [
                5576,
                5630
            ],
            [
                5630,
                5700
            ],
            [
                5700,
                5751
            ],
            [
                5751,
                5785
            ],
            [
                5785,
                5910
            ],
            [
                5910,
                6109
            ],
            [
                6109,
                6244
            ],
            [
                6244,
                6292
            ],
            [
                6292,
                6380
            ],
            [
                6380,
                6417
            ],
            [
                6417,
                6485
            ],
            [
                6485,
                6585
            ],
            [
                6585,
                6613
            ],
            [
                6613,
                6674
            ],
            [
                6674,
                6715
            ],
            [
                6715,
                6752
            ],
            [
                6752,
                6791
            ],
            [
                6791,
                6905
            ],
            [
                6905,
                6983
            ],
            [
                6983,
                7073
            ],
            [
                7073,
                7073
            ],
            [
                7073,
                7128
            ],
            [
                7128,
                7144
            ],
            [
                7144,
                7144
            ],
            [
                7144,
                7208
            ],
            [
                7208,
                7282
            ],
            [
                7282,
                7402
            ],
            [
                7402,
                7514
            ],
            [
                7514,
                7600
            ],
            [
                7600,
                7661
            ],
            [
                7661,
                7782
            ],
            [
                7782,
                7837
            ],
            [
                7837,
                7886
            ],
            [
                7886,
                7886
            ],
            [
                7886,
                7898
            ],
            [
                7898,
                7953
            ],
            [
                7953,
                7966
            ],
            [
                7966,
                7988
            ],
            [
                7988,
                8028
            ],
            [
                8028,
                8109
            ],
            [
                8109,
                8109
            ],
            [
                8109,
                8139
            ],
            [
                8139,
                8170
            ],
            [
                8170,
                8225
            ],
            [
                8225,
                8269
            ],
            [
                8269,
                8269
            ],
            [
                8269,
                8351
            ],
            [
                8351,
                8365
            ],
            [
                8365,
                8365
            ],
            [
                8365,
                8365
            ],
            [
                8365,
                8473
            ],
            [
                8473,
                8499
            ],
            [
                8499,
                8530
            ],
            [
                8530,
                8530
            ],
            [
                8530,
                8620
            ],
            [
                8620,
                8660
            ],
            [
                8660,
                8660
            ],
            [
                8660,
                8707
            ],
            [
                8707,
                8730
            ],
            [
                8730,
                8747
            ],
            [
                8747,
                8778
            ],
            [
                8778,
                8827
            ],
            [
                8827,
                8881
            ],
            [
                8881,
                8881
            ],
            [
                8881,
                8881
            ],
            [
                8881,
                9012
            ],
            [
                9012,
                9052
            ],
            [
                9052,
                9099
            ],
            [
                9099,
                9198
            ],
            [
                9198,
                9302
            ],
            [
                9302,
                9302
            ],
            [
                9302,
                9328
            ],
            [
                9328,
                9387
            ],
            [
                9387,
                9468
            ],
            [
                9468,
                9558
            ],
            [
                9558,
                9652
            ],
            [
                9652,
                9675
            ],
            [
                9675,
                9773
            ],
            [
                9773,
                9825
            ],
            [
                9825,
                9938
            ],
            [
                9938,
                9986
            ],
            [
                9986,
                10111
            ],
            [
                10111,
                10239
            ],
            [
                10239,
                10367
            ],
            [
                10367,
                10525
            ],
            [
                10525,
                10706
            ],
            [
                10706,
                10867
            ],
            [
                10867,
                10942
            ],
            [
                10942,
                11070
            ],
            [
                11070,
                11098
            ],
            [
                11098,
                11120
            ],
            [
                11120,
                11120
            ],
            [
                11120,
                11167
            ],
            [
                11167,
                11253
            ],
            [
                11253,
                11327
            ],
            [
                11327,
                11390
            ],
            [
                11390,
                11510
            ],
            [
                11510,
                11594
            ],
            [
                11594,
                11635
            ],
            [
                11635,
                11727
            ],
            [
                11727,
                11966
            ]
        ]
    }
}