{
    "original": {
        "text": "Ruby had run away from her lover in great dudgeon after the dance at the Music Hall, and had declared that she never wanted to see him again. But when reflection came with the morning her misery was stronger than her wrath. What would life be to her now without her lover? When she escaped from her grandfather's house she certainly had not intended to become nurse and assistant maid-of-all-work at a London lodging-house. The daily toil she could endure, and the hard life, as long as she was supported by the prospect of some coming delight. A dance with Felix at the Music Hall, though it were three days distant from her, would so occupy her mind that she could wash and dress all the children without complaint. Mrs. Pipkin was forced to own to herself that Ruby did earn her bread. But when she had parted with her lover almost on an understanding that they were never to meet again, things were very different with her. And perhaps she had been wrong. A gentleman like Sir Felix did not of course like to be told about marriage. If she gave him another chance, perhaps he would speak. At any rate she could not live without another dance. And so she wrote him a letter.\nRuby was glib enough with her pen, though what she wrote will hardly bear repeating. She underscored all her loves to him. She underscored the expression of her regret if she had vexed him. She did not want to hurry a gentleman. But she did want to have another dance at the Music Hall. Would he be there next Saturday? Sir Felix sent her a very short reply to say that he would be at the Music Hall on the Tuesday. As at this time he proposed to leave London on the Wednesday on his way to New York, he was proposing to devote his very last night to the companionship of Ruby Ruggles.\nMrs. Pipkin had never interfered with her niece's letters. It is certainly a part of the new dispensation that young women shall send and receive letters without inspection. But since Roger Carbury's visit Mrs. Pipkin had watched the postman, and had also watched her niece. For nearly a week Ruby said not a word of going out at night. She took the children for an airing in a broken perambulator, nearly as far as Holloway, with exemplary care, and washed up the cups and saucers as though her mind was intent upon them. But Mrs. Pipkin's mind was intent on obeying Mr. Carbury's behests. She had already hinted something as to which Ruby had made no answer. It was her purpose to tell her and to swear to her most solemnly,--should she find her preparing herself to leave the house after six in the evening,--that she should be kept out the whole night, having a purpose equally clear in her own mind that she would break her oath should she be unsuccessful in her effort to keep Ruby at home. But on the Tuesday, when Ruby went up to her room to deck herself, a bright idea as to a better precaution struck Mrs. Pipkin's mind. Ruby had been careless,--had left her lover's scrap of a note in an old pocket when she went out with the children, and Mrs. Pipkin knew all about it. It was nine o'clock when Ruby went up-stairs,--and then Mrs. Pipkin locked both the front door and the area gate. Mrs. Hurtle had come home on the previous day. \"You won't be wanting to go out to-night;--will you, Mrs. Hurtle?\" said Mrs. Pipkin, knocking at her lodger's door. Mrs. Hurtle declared her purpose of remaining at home all the evening. \"If you should hear words between me and my niece, don't you mind, ma'am.\"\n\"I hope there's nothing wrong, Mrs. Pipkin?\"\n\"She'll be wanting to go out, and I won't have it. It isn't right; is it, ma'am? She's a good girl; but they've got such a way nowadays of doing just as they pleases, that one doesn't know what's going to come next.\" Mrs. Pipkin must have feared downright rebellion when she thus took her lodger into her confidence.\nRuby came down in her silk frock, as she had done before, and made her usual little speech. \"I'm just going to step out, aunt, for a little time to-night. I've got the key, and I'll let myself in quite quiet.\"\n\"Indeed, Ruby, you won't,\" said Mrs. Pipkin.\n\"Won't what, aunt?\"\n\"Won't let yourself in, if you go out. If you go out to-night you'll stay out. That's all about it. If you go out to-night you won't come back here any more. I won't have it, and it isn't right that I should. You're going after that young man that they tell me is the greatest scamp in all England.\"\n\"They tell you lies then, Aunt Pipkin.\"\n\"Very well. No girl is going out any more at nights out of my house; so that's all about it. If you had told me you was going before, you needn't have gone up and bedizened yourself. For now it's all to take off again.\"\nRuby could hardly believe it. She had expected some opposition,--what she would have called a few words; but she had never imagined that her aunt would threaten to keep her in the streets all night. It seemed to her that she had bought the privilege of amusing herself by hard work. Nor did she believe now that her aunt would be as hard as her threat. \"I've a right to go if I like,\" she said.\n\"That's as you think. You haven't a right to come back again, any way.\"\n\"Yes, I have. I've worked for you a deal harder than the girl down-stairs, and I don't want no wages. I've a right to go out, and a right to come back;--and go I shall.\"\n\"You'll be no better than you should be, if you do.\"\n\"Am I to work my very nails off, and push that perambulator about all day till my legs won't carry me,--and then I ain't to go out, not once in a week?\"\n\"Not unless I know more about it, Ruby. I won't have you go and throw yourself into the gutter;--not while you're with me.\"\n\"Who's throwing themselves into the gutter? I've thrown myself into no gutter. I know what I'm about.\"\n\"There's two of us that way, Ruby;--for I know what I'm about.\"\n\"I shall just go then.\" And Ruby walked off towards the door.\n\"You won't get out that way, any way, for the door's locked;--and the area gate. You'd better be said, Ruby, and just take your things off.\"\nPoor Ruby for the moment was struck dumb with mortification. Mrs. Pipkin had given her credit for more outrageous perseverance than she possessed, and had feared that she would rattle at the front door, or attempt to climb over the area gate. She was a little afraid of Ruby, not feeling herself justified in holding absolute dominion over her as over a servant. And though she was now determined in her conduct,--being fully resolved to surrender neither of the keys which she held in her pocket,--still she feared that she might so far collapse as to fall away into tears, should Ruby be violent. But Ruby was crushed. Her lover would be there to meet her, and the appointment would be broken by her! \"Aunt Pipkin,\" she said, \"let me go just this once.\"\n\"No, Ruby;--it ain't proper.\"\n\"You don't know what you're a' doing of, aunt; you don't. You'll ruin me,--you will. Dear Aunt Pipkin, do, do! I'll never ask again, if you don't like.\"\nMrs. Pipkin had not expected this, and was almost willing to yield. But Mr. Carbury had spoken so very plainly! \"It ain't the thing, Ruby; and I won't do it.\"\n\"And I'm to be--a prisoner! What have I done to be--a prisoner? I don't believe as you've any right to lock me up.\"\n\"I've a right to lock my own doors.\"\n\"Then I shall go away to-morrow.\"\n\"I can't help that, my dear. The door will be open to-morrow, if you choose to go out.\"\n\"Then why not open it to-night? Where's the difference?\" But Mrs. Pipkin was stern, and Ruby, in a flood of tears, took herself up to her garret.\nMrs. Pipkin knocked at Mrs. Hurtle's door again. \"She's gone to bed,\" she said.\n\"I'm glad to hear it. There wasn't any noise about it;--was there?\"\n\"Not as I expected, Mrs. Hurtle, certainly. But she was put out a bit. Poor girl! I've been a girl too, and used to like a bit of outing as well as any one,--and a dance too; only it was always when mother knew. She ain't got a mother, poor dear! and as good as no father. And she's got it into her head that she's that pretty that a great gentleman will marry her.\"\n\"She is pretty!\"\n\"But what's beauty, Mrs. Hurtle? It's no more nor skin deep, as the scriptures tell us. And what'd a grand gentleman see in Ruby to marry her? She says she'll leave to-morrow.\"\n\"And where will she go?\"\n\"Just nowhere. After this gentleman,--and you know what that means! You're going to be married yourself, Mrs. Hurtle.\"\n\"We won't mind about that now, Mrs. Pipkin.\"\n\"And this 'll be your second, and you know how these things are managed. No gentleman 'll marry her because she runs after him. Girls as knows what they're about should let the gentlemen run after them. That's my way of looking at it.\"\n\"Don't you think they should be equal in that respect?\"\n\"Anyways the girls shouldn't let on as they are running after the gentlemen. A gentleman goes here and he goes there, and he speaks up free, of course. In my time, girls usen't to do that. But then, maybe, I'm old-fashioned,\" added Mrs. Pipkin, thinking of the new dispensation.\n\"I suppose girls do speak for themselves more than they did formerly.\"\n\"A deal more, Mrs. Hurtle; quite different. You hear them talk of spooning with this fellow, and spooning with that fellow,--and that before their very fathers and mothers! When I was young we used to do it, I suppose,--only not like that.\"\n\"You did it on the sly.\"\n\"I think we got married quicker than they do, any way. When the gentlemen had to take more trouble they thought more about it. But if you wouldn't mind speaking to Ruby to-morrow, Mrs. Hurtle, she'd listen to you when she wouldn't mind a word I said to her. I don't want her to go away from this, out into the street, till she knows where she's to go to, decent. As for going to her young man,--that's just walking the streets.\"\nMrs. Hurtle promised that she would speak to Ruby, though when making the promise she could not but think of her unfitness for the task. She knew nothing of the country. She had not a single friend in it, but Paul Montague;--and she had run after him with as little discretion as Ruby Ruggles was showing in running after her lover. Who was she that she should take upon herself to give advice to any female?\nShe had not sent her letter to Paul, but she still kept it in her pocket-book. At some moments she thought that she would send it; and at others she told herself that she would never surrender this last hope till every stone had been turned. It might still be possible to shame him into a marriage. She had returned from Lowestoft on the Monday, and had made some trivial excuse to Mrs. Pipkin in her mildest voice. The place had been windy, and too cold for her;--and she had not liked the hotel. Mrs. Pipkin was very glad to see her back again.",
        "paragraph_chars": [
            [
                0,
                1178
            ],
            [
                1178,
                1764
            ],
            [
                1764,
                3469
            ],
            [
                3469,
                3514
            ],
            [
                3514,
                3831
            ],
            [
                3831,
                4041
            ],
            [
                4041,
                4086
            ],
            [
                4086,
                4106
            ],
            [
                4106,
                4406
            ],
            [
                4406,
                4446
            ],
            [
                4446,
                4666
            ],
            [
                4666,
                5061
            ],
            [
                5061,
                5133
            ],
            [
                5133,
                5303
            ],
            [
                5303,
                5356
            ],
            [
                5356,
                5509
            ],
            [
                5509,
                5633
            ],
            [
                5633,
                5736
            ],
            [
                5736,
                5800
            ],
            [
                5800,
                5862
            ],
            [
                5862,
                6003
            ],
            [
                6003,
                6759
            ],
            [
                6759,
                6789
            ],
            [
                6789,
                6942
            ],
            [
                6942,
                7101
            ],
            [
                7101,
                7217
            ],
            [
                7217,
                7254
            ],
            [
                7254,
                7288
            ],
            [
                7288,
                7376
            ],
            [
                7376,
                7522
            ],
            [
                7522,
                7602
            ],
            [
                7602,
                7670
            ],
            [
                7670,
                8037
            ],
            [
                8037,
                8054
            ],
            [
                8054,
                8231
            ],
            [
                8231,
                8256
            ],
            [
                8256,
                8375
            ],
            [
                8375,
                8420
            ],
            [
                8420,
                8656
            ],
            [
                8656,
                8712
            ],
            [
                8712,
                8991
            ],
            [
                8991,
                9062
            ],
            [
                9062,
                9303
            ],
            [
                9303,
                9328
            ],
            [
                9328,
                9757
            ],
            [
                9757,
                10166
            ],
            [
                10166,
                10712
            ]
        ],
        "segment_chars": [
            [
                0,
                142
            ],
            [
                142,
                224
            ],
            [
                224,
                273
            ],
            [
                273,
                424
            ],
            [
                424,
                545
            ],
            [
                545,
                718
            ],
            [
                718,
                789
            ],
            [
                789,
                928
            ],
            [
                928,
                960
            ],
            [
                960,
                1037
            ],
            [
                1037,
                1093
            ],
            [
                1093,
                1147
            ],
            [
                1147,
                1178
            ],
            [
                1178,
                1263
            ],
            [
                1263,
                1301
            ],
            [
                1301,
                1368
            ],
            [
                1368,
                1407
            ],
            [
                1407,
                1465
            ],
            [
                1465,
                1498
            ],
            [
                1498,
                1594
            ],
            [
                1594,
                1764
            ],
            [
                1764,
                1823
            ],
            [
                1823,
                1938
            ],
            [
                1938,
                2039
            ],
            [
                2039,
                2101
            ],
            [
                2101,
                2287
            ],
            [
                2287,
                2355
            ],
            [
                2355,
                2425
            ],
            [
                2425,
                2761
            ],
            [
                2761,
                2895
            ],
            [
                2895,
                3046
            ],
            [
                3046,
                3160
            ],
            [
                3160,
                3207
            ],
            [
                3207,
                3274
            ],
            [
                3274,
                3323
            ],
            [
                3323,
                3394
            ],
            [
                3394,
                3469
            ],
            [
                3469,
                3514
            ],
            [
                3514,
                3565
            ],
            [
                3565,
                3595
            ],
            [
                3595,
                3731
            ],
            [
                3731,
                3831
            ],
            [
                3831,
                3923
            ],
            [
                3923,
                3986
            ],
            [
                3986,
                4041
            ],
            [
                4041,
                4086
            ],
            [
                4086,
                4106
            ],
            [
                4106,
                4145
            ],
            [
                4145,
                4185
            ],
            [
                4185,
                4206
            ],
            [
                4206,
                4264
            ],
            [
                4264,
                4315
            ],
            [
                4315,
                4406
            ],
            [
                4406,
                4446
            ],
            [
                4446,
                4458
            ],
            [
                4458,
                4539
            ],
            [
                4539,
                4629
            ],
            [
                4629,
                4666
            ],
            [
                4666,
                4696
            ],
            [
                4696,
                4865
            ],
            [
                4865,
                4949
            ],
            [
                4949,
                5019
            ],
            [
                5019,
                5061
            ],
            [
                5061,
                5083
            ],
            [
                5083,
                5133
            ],
            [
                5133,
                5147
            ],
            [
                5147,
                5235
            ],
            [
                5235,
                5303
            ],
            [
                5303,
                5356
            ],
            [
                5356,
                5509
            ],
            [
                5509,
                5549
            ],
            [
                5549,
                5633
            ],
            [
                5633,
                5677
            ],
            [
                5677,
                5712
            ],
            [
                5712,
                5736
            ],
            [
                5736,
                5800
            ],
            [
                5800,
                5824
            ],
            [
                5824,
                5862
            ],
            [
                5862,
                5943
            ],
            [
                5943,
                6003
            ],
            [
                6003,
                6064
            ],
            [
                6064,
                6246
            ],
            [
                6246,
                6366
            ],
            [
                6366,
                6602
            ],
            [
                6602,
                6624
            ],
            [
                6624,
                6706
            ],
            [
                6706,
                6759
            ],
            [
                6759,
                6789
            ],
            [
                6789,
                6847
            ],
            [
                6847,
                6874
            ],
            [
                6874,
                6900
            ],
            [
                6900,
                6942
            ],
            [
                6942,
                7010
            ],
            [
                7010,
                7054
            ],
            [
                7054,
                7101
            ],
            [
                7101,
                7129
            ],
            [
                7129,
                7165
            ],
            [
                7165,
                7217
            ],
            [
                7217,
                7254
            ],
            [
                7254,
                7288
            ],
            [
                7288,
                7317
            ],
            [
                7317,
                7376
            ],
            [
                7376,
                7408
            ],
            [
                7408,
                7433
            ],
            [
                7433,
                7522
            ],
            [
                7522,
                7571
            ],
            [
                7571,
                7602
            ],
            [
                7602,
                7624
            ],
            [
                7624,
                7670
            ],
            [
                7670,
                7714
            ],
            [
                7714,
                7741
            ],
            [
                7741,
                7752
            ],
            [
                7752,
                7882
            ],
            [
                7882,
                7917
            ],
            [
                7917,
                7943
            ],
            [
                7943,
                8037
            ],
            [
                8037,
                8054
            ],
            [
                8054,
                8087
            ],
            [
                8087,
                8142
            ],
            [
                8142,
                8197
            ],
            [
                8197,
                8231
            ],
            [
                8231,
                8256
            ],
            [
                8256,
                8271
            ],
            [
                8271,
                8324
            ],
            [
                8324,
                8375
            ],
            [
                8375,
                8420
            ],
            [
                8420,
                8493
            ],
            [
                8493,
                8548
            ],
            [
                8548,
                8623
            ],
            [
                8623,
                8656
            ],
            [
                8656,
                8712
            ],
            [
                8712,
                8789
            ],
            [
                8789,
                8864
            ],
            [
                8864,
                8901
            ],
            [
                8901,
                8991
            ],
            [
                8991,
                9062
            ],
            [
                9062,
                9106
            ],
            [
                9106,
                9235
            ],
            [
                9235,
                9303
            ],
            [
                9303,
                9328
            ],
            [
                9328,
                9383
            ],
            [
                9383,
                9455
            ],
            [
                9455,
                9586
            ],
            [
                9586,
                9691
            ],
            [
                9691,
                9757
            ],
            [
                9757,
                9894
            ],
            [
                9894,
                9927
            ],
            [
                9927,
                10090
            ],
            [
                10090,
                10166
            ],
            [
                10166,
                10245
            ],
            [
                10245,
                10408
            ],
            [
                10408,
                10465
            ],
            [
                10465,
                10582
            ],
            [
                10582,
                10664
            ],
            [
                10664,
                10712
            ]
        ],
        "overlap_chars": [
            [
                0,
                142
            ],
            [
                142,
                145
            ],
            [
                172,
                183
            ],
            [
                195,
                198
            ],
            [
                222,
                224
            ],
            [
                224,
                273
            ],
            [
                273,
                322
            ],
            [
                333,
                359
            ],
            [
                380,
                424
            ],
            [
                424,
                455
            ],
            [
                474,
                543
            ],
            [
                545,
                581
            ],
            [
                543,
                544
            ],
            [
                789,
                917
            ],
            [
                926,
                928
            ],
            [
                928,
                960
            ],
            [
                960,
                994
            ],
            [
                1005,
                1037
            ],
            [
                1037,
                1093
            ],
            [
                1093,
                1147
            ],
            [
                1147,
                1178
            ],
            [
                1178,
                1263
            ],
            [
                1263,
                1299
            ],
            [
                1335,
                1345
            ],
            [
                1357,
                1360
            ],
            [
                1363,
                1368
            ],
            [
                1368,
                1407
            ],
            [
                1407,
                1465
            ],
            [
                1465,
                1497
            ],
            [
                1498,
                1580
            ],
            [
                1585,
                1594
            ],
            [
                1594,
                1596
            ],
            [
                1610,
                1612
            ],
            [
                1622,
                1764
            ],
            [
                1764,
                1823
            ],
            [
                1938,
                1969
            ],
            [
                1982,
                2039
            ],
            [
                2039,
                2101
            ],
            [
                2101,
                2136
            ],
            [
                2190,
                2221
            ],
            [
                2225,
                2245
            ],
            [
                2285,
                2286
            ],
            [
                2287,
                2302
            ],
            [
                2310,
                2345
            ],
            [
                2353,
                2355
            ],
            [
                2355,
                2358
            ],
            [
                2444,
                2451
            ],
            [
                2400,
                2404
            ],
            [
                2476,
                2490
            ],
            [
                2499,
                2502
            ],
            [
                2508,
                2521
            ],
            [
                2530,
                2548
            ],
            [
                2559,
                2574
            ],
            [
                2576,
                2619
            ],
            [
                2759,
                2761
            ],
            [
                2765,
                2827
            ],
            [
                2900,
                2917
            ],
            [
                2920,
                2956
            ],
            [
                2974,
                3045
            ],
            [
                3046,
                3080
            ],
            [
                3093,
                3096
            ],
            [
                3102,
                3160
            ],
            [
                3160,
                3206
            ],
            [
                3207,
                3238
            ],
            [
                3250,
                3274
            ],
            [
                3279,
                3290
            ],
            [
                3304,
                3307
            ],
            [
                3321,
                3323
            ],
            [
                3323,
                3347
            ],
            [
                3356,
                3380
            ],
            [
                3385,
                3393
            ],
            [
                3394,
                3469
            ],
            [
                3469,
                3514
            ],
            [
                3514,
                3547
            ],
            [
                3565,
                3595
            ],
            [
                3595,
                3709
            ],
            [
                3724,
                3730
            ],
            [
                3831,
                3864
            ],
            [
                3889,
                3907
            ],
            [
                3915,
                3923
            ],
            [
                3923,
                3975
            ],
            [
                3984,
                3986
            ],
            [
                3986,
                4026
            ],
            [
                4033,
                4041
            ],
            [
                4041,
                4085
            ],
            [
                4145,
                4158
            ],
            [
                4168,
                4185
            ],
            [
                4185,
                4195
            ],
            [
                4204,
                4206
            ],
            [
                4229,
                4264
            ],
            [
                4264,
                4279
            ],
            [
                4313,
                4315
            ],
            [
                4315,
                4406
            ],
            [
                4406,
                4416
            ],
            [
                4421,
                4446
            ],
            [
                4446,
                4458
            ],
            [
                4458,
                4524
            ],
            [
                4535,
                4539
            ],
            [
                4542,
                4545
            ],
            [
                4649,
                4653
            ],
            [
                4654,
                4666
            ],
            [
                4666,
                4696
            ],
            [
                4696,
                4728
            ],
            [
                4769,
                4865
            ],
            [
                4949,
                4968
            ],
            [
                4978,
                5018
            ],
            [
                5019,
                5061
            ],
            [
                5083,
                5121
            ],
            [
                5130,
                5133
            ],
            [
                5133,
                5147
            ],
            [
                5147,
                5158
            ],
            [
                5159,
                5166
            ],
            [
                5206,
                5207
            ],
            [
                5225,
                5235
            ],
            [
                5235,
                5257
            ],
            [
                5286,
                5303
            ],
            [
                5303,
                5356
            ],
            [
                5356,
                5392
            ],
            [
                5464,
                5496
            ],
            [
                5500,
                5509
            ],
            [
                5549,
                5603
            ],
            [
                5606,
                5633
            ],
            [
                5633,
                5677
            ],
            [
                5712,
                5736
            ],
            [
                5736,
                5737
            ],
            [
                5776,
                5800
            ],
            [
                5800,
                5824
            ],
            [
                5824,
                5862
            ],
            [
                5862,
                5890
            ],
            [
                5900,
                5922
            ],
            [
                5924,
                5943
            ],
            [
                5943,
                5955
            ],
            [
                5975,
                6000
            ],
            [
                5963,
                5969
            ],
            [
                6000,
                6003
            ],
            [
                6003,
                6043
            ],
            [
                6062,
                6064
            ],
            [
                6064,
                6079
            ],
            [
                6158,
                6179
            ],
            [
                6217,
                6244
            ],
            [
                6148,
                6149
            ],
            [
                6097,
                6100
            ],
            [
                6246,
                6277
            ],
            [
                6364,
                6366
            ],
            [
                6602,
                6624
            ],
            [
                6624,
                6665
            ],
            [
                6682,
                6687
            ],
            [
                6704,
                6705
            ],
            [
                6706,
                6759
            ],
            [
                6759,
                6769
            ],
            [
                6771,
                6789
            ],
            [
                6789,
                6816
            ],
            [
                6820,
                6825
            ],
            [
                6828,
                6834
            ],
            [
                6845,
                6847
            ],
            [
                6847,
                6862
            ],
            [
                6864,
                6874
            ],
            [
                6874,
                6900
            ],
            [
                6900,
                6920
            ],
            [
                6939,
                6942
            ],
            [
                6942,
                7010
            ],
            [
                7010,
                7053
            ],
            [
                7054,
                7101
            ],
            [
                7101,
                7115
            ],
            [
                7117,
                7129
            ],
            [
                7165,
                7217
            ],
            [
                7217,
                7254
            ],
            [
                7254,
                7275
            ],
            [
                7285,
                7288
            ],
            [
                7288,
                7317
            ],
            [
                7317,
                7338
            ],
            [
                7348,
                7369
            ],
            [
                7373,
                7376
            ],
            [
                7376,
                7397
            ],
            [
                7433,
                7522
            ],
            [
                7522,
                7571
            ],
            [
                7571,
                7602
            ],
            [
                7602,
                7622
            ],
            [
                7718,
                7741
            ],
            [
                7741,
                7752
            ],
            [
                7882,
                7917
            ],
            [
                7943,
                7978
            ],
            [
                8002,
                8034
            ],
            [
                8146,
                8197
            ],
            [
                8197,
                8218
            ],
            [
                8228,
                8231
            ],
            [
                8231,
                8256
            ],
            [
                8256,
                8271
            ],
            [
                8271,
                8291
            ],
            [
                8294,
                8324
            ],
            [
                8324,
                8375
            ],
            [
                8375,
                8420
            ],
            [
                8420,
                8421
            ],
            [
                8454,
                8493
            ],
            [
                8493,
                8505
            ],
            [
                8510,
                8548
            ],
            [
                8548,
                8553
            ],
            [
                8582,
                8623
            ],
            [
                8721,
                8789
            ],
            [
                8901,
                8955
            ],
            [
                8989,
                8990
            ],
            [
                9455,
                9496
            ],
            [
                9506,
                9540
            ],
            [
                9584,
                9586
            ],
            [
                9586,
                9608
            ],
            [
                9625,
                9681
            ],
            [
                9757,
                9814
            ],
            [
                9839,
                9852
            ],
            [
                9863,
                9894
            ],
            [
                9894,
                9927
            ],
            [
                9927,
                9960
            ],
            [
                9962,
                9980
            ],
            [
                9982,
                10049
            ],
            [
                10088,
                10090
            ],
            [
                10090,
                10101
            ],
            [
                10136,
                10150
            ],
            [
                10164,
                10166
            ],
            [
                10166,
                10206
            ],
            [
                10211,
                10245
            ],
            [
                10245,
                10332
            ],
            [
                10408,
                10465
            ],
            [
                10465,
                10582
            ],
            [
                10582,
                10620
            ],
            [
                10628,
                10629
            ],
            [
                10631,
                10664
            ],
            [
                10664,
                10712
            ]
        ],
        "row_chars": [
            [
                0,
                142
            ],
            [
                142,
                224
            ],
            [
                224,
                273
            ],
            [
                273,
                424
            ],
            [
                424,
                718
            ],
            [
                718,
                789
            ],
            [
                789,
                928
            ],
            [
                928,
                960
            ],
            [
                960,
                1037
            ],
            [
                1037,
                1093
            ],
            [
                1093,
                1147
            ],
            [
                1147,
                1178
            ],
            [
                1178,
                1263
            ],
            [
                1263,
                1368
            ],
            [
                1368,
                1407
            ],
            [
                1407,
                1465
            ],
            [
                1465,
                1498
            ],
            [
                1498,
                1594
            ],
            [
                1594,
                1764
            ],
            [
                1764,
                1823
            ],
            [
                1823,
                1938
            ],
            [
                1938,
                2039
            ],
            [
                2039,
                2101
            ],
            [
                2101,
                2287
            ],
            [
                2287,
                2355
            ],
            [
                2355,
                2761
            ],
            [
                2761,
                3046
            ],
            [
                3046,
                3160
            ],
            [
                3160,
                3207
            ],
            [
                3207,
                3274
            ],
            [
                3274,
                3323
            ],
            [
                3323,
                3394
            ],
            [
                3394,
                3469
            ],
            [
                3469,
                3514
            ],
            [
                3514,
                3595
            ],
            [
                3595,
                3731
            ],
            [
                3731,
                3831
            ],
            [
                3831,
                3923
            ],
            [
                3923,
                3986
            ],
            [
                3986,
                4041
            ],
            [
                4041,
                4086
            ],
            [
                4086,
                4106
            ],
            [
                4106,
                4145
            ],
            [
                4145,
                4185
            ],
            [
                4185,
                4206
            ],
            [
                4206,
                4264
            ],
            [
                4264,
                4315
            ],
            [
                4315,
                4406
            ],
            [
                4406,
                4446
            ],
            [
                4446,
                4458
            ],
            [
                4458,
                4539
            ],
            [
                4539,
                4666
            ],
            [
                4666,
                4696
            ],
            [
                4696,
                4865
            ],
            [
                4865,
                4949
            ],
            [
                4949,
                5019
            ],
            [
                5019,
                5061
            ],
            [
                5061,
                5083
            ],
            [
                5083,
                5133
            ],
            [
                5133,
                5147
            ],
            [
                5147,
                5235
            ],
            [
                5235,
                5303
            ],
            [
                5303,
                5356
            ],
            [
                5356,
                5509
            ],
            [
                5509,
                5549
            ],
            [
                5549,
                5633
            ],
            [
                5633,
                5677
            ],
            [
                5677,
                5712
            ],
            [
                5712,
                5736
            ],
            [
                5736,
                5800
            ],
            [
                5800,
                5824
            ],
            [
                5824,
                5862
            ],
            [
                5862,
                5943
            ],
            [
                5943,
                6003
            ],
            [
                6003,
                6064
            ],
            [
                6064,
                6366
            ],
            [
                6366,
                6602
            ],
            [
                6602,
                6624
            ],
            [
                6624,
                6706
            ],
            [
                6706,
                6759
            ],
            [
                6759,
                6789
            ],
            [
                6789,
                6847
            ],
            [
                6847,
                6874
            ],
            [
                6874,
                6900
            ],
            [
                6900,
                6942
            ],
            [
                6942,
                7010
            ],
            [
                7010,
                7054
            ],
            [
                7054,
                7101
            ],
            [
                7101,
                7129
            ],
            [
                7129,
                7165
            ],
            [
                7165,
                7217
            ],
            [
                7217,
                7254
            ],
            [
                7254,
                7288
            ],
            [
                7288,
                7317
            ],
            [
                7317,
                7376
            ],
            [
                7376,
                7408
            ],
            [
                7408,
                7433
            ],
            [
                7433,
                7522
            ],
            [
                7522,
                7571
            ],
            [
                7571,
                7602
            ],
            [
                7602,
                7624
            ],
            [
                7624,
                7670
            ],
            [
                7670,
                7714
            ],
            [
                7714,
                7741
            ],
            [
                7741,
                7752
            ],
            [
                7752,
                7882
            ],
            [
                7882,
                7917
            ],
            [
                7917,
                7943
            ],
            [
                7943,
                8037
            ],
            [
                8037,
                8054
            ],
            [
                8054,
                8087
            ],
            [
                8087,
                8142
            ],
            [
                8142,
                8197
            ],
            [
                8197,
                8231
            ],
            [
                8231,
                8256
            ],
            [
                8256,
                8271
            ],
            [
                8271,
                8324
            ],
            [
                8324,
                8375
            ],
            [
                8375,
                8420
            ],
            [
                8420,
                8493
            ],
            [
                8493,
                8548
            ],
            [
                8548,
                8623
            ],
            [
                8623,
                8656
            ],
            [
                8656,
                8712
            ],
            [
                8712,
                8789
            ],
            [
                8789,
                8864
            ],
            [
                8864,
                8901
            ],
            [
                8901,
                8991
            ],
            [
                8991,
                9062
            ],
            [
                9062,
                9106
            ],
            [
                9106,
                9235
            ],
            [
                9235,
                9303
            ],
            [
                9303,
                9328
            ],
            [
                9328,
                9383
            ],
            [
                9383,
                9455
            ],
            [
                9455,
                9586
            ],
            [
                9586,
                9691
            ],
            [
                9691,
                9757
            ],
            [
                9757,
                9894
            ],
            [
                9894,
                9927
            ],
            [
                9927,
                10090
            ],
            [
                10090,
                10166
            ],
            [
                10166,
                10245
            ],
            [
                10245,
                10465
            ],
            [
                10465,
                10582
            ],
            [
                10582,
                10664
            ],
            [
                10664,
                10712
            ]
        ]
    },
    "abridged": {
        "text": "Ruby had run away from her lover in great dudgeon after the dance at the Music Hall, and had declared that she never wanted to see him again. But in the morning she was miserable. What would life be to her now without her lover? When she escaped from her grandfather's house she had not intended to become maid-of-all-work at a London lodging-house. The daily toil she could endure, as long as she was supported by the prospect of some coming delight - like a dance with Felix at the Music Hall.\nBut when she had parted with her lover almost on an understanding that they were never to meet again, things were very different. And perhaps she had been wrong. A gentleman like Sir Felix did not like to be told about marriage. If she gave him another chance, perhaps he would speak. At any rate she could not live without another dance. And so she wrote him a letter.\nRuby was glib enough with her pen, though what she wrote will hardly bear repeating. She underscored all her loves to him, and her regret at vexing him. She did not want to hurry a gentleman. But she did want to have another dance at the Music Hall. Would he be there next Saturday?\nSir Felix sent her a very short reply to say that he would be at the Music Hall on Tuesday. As he planned to leave London on the Wednesday on his way to New York, he was proposing to devote his very last night to the companionship of Ruby Ruggles.\nMrs. Pipkin had never interfered with her niece's letters. But since Roger Carbury's visit she had watched the postman, and had also watched her niece. For nearly a week Ruby said not a word of going out at night. She took the children for an airing with exemplary care, and washed the cups and saucers diligently.\nBut Mrs. Pipkin was intent on obeying Mr. Carbury's requests. She decided to tell Ruby most solemnly, if she found her preparing to leave the house in the evening, that she should be kept out the whole night. On the Tuesday, when Ruby went up to her room to deck herself, she had been careless - she had left her lover's scrap of a note behind when she went out with the children, and Mrs. Pipkin knew all about it.\nIt was nine o'clock when Ruby went upstairs; and Mrs. Pipkin locked both the front door and the area gate. Mrs. Hurtle had come home on the previous day.\n\"You won't be wanting to go out tonight, will you, Mrs. Hurtle?\" Mrs. Pipkin asked her. Mrs. Hurtle declared her intention of remaining at home all evening.\n\"If you should hear words between me and my niece, don't you mind, ma'am.\"\n\"I hope there's nothing wrong, Mrs. Pipkin?\"\n\"She'll be wanting to go out, and it isn't right; is it, ma'am? She's a good girl; but they've got such a way nowadays of doing just as they pleases, that one doesn't know what's coming next.\"\nRuby came down in her silk frock, and made her usual speech. \"I'm just going to step out, aunt, for a little time tonight. I've got the key, and I'll let myself in quiet.\"\n\"Indeed, Ruby, you won't,\" said Mrs. Pipkin. \"If you go out tonight you'll stay out. That's all. You won't come back here any more. I won't have it. You're going after that young man that they tell me is the greatest scamp in all England.\"\n\"They tell lies then, Aunt Pipkin.\"\n\"Very well. No girl is going out any more at nights out of my house; so that's it. You'd better take your finery off again.\"\nRuby could hardly believe it. She had expected some opposition; but she had never imagined that her aunt would threaten to keep her in the streets all night. Nor did she believe her aunt would be as hard as her threat.\n\"I've a right to go if I like,\" she said.\n\"You haven't a right to come back again.\"\n\"Yes, I have. I've worked hard for you, for no wages. I've a right to go out - and go I shall.\"\n\"You'll be no better than you should be, if you do.\"\n\"Am I to work my very nails off, and then I ain't to go out, not once a week?\"\n\"I won't have you go and throw yourself into the gutter, Ruby - not while you're with me.\"\n\"Who's throwing themselves into the gutter? I know what I'm about.\"\n\"And I know what I'm about.\"\n\"I shall just go then.\" And Ruby walked off towards the door.\n\"You won't get out that way, for the door's locked; and the area gate. You'd better just take your things off, Ruby.\"\nPoor Ruby for the moment was struck dumb. Mrs. Pipkin had feared that she would try to climb over the area gate, for she was a little afraid of Ruby. But Ruby was crushed. Her lover would be there to meet her, and she would not turn up!\n\"Aunt Pipkin,\" she said, \"let me go just this once.\"\n\"No, Ruby; it ain't proper.\"\n\"You don't know what you're doing, aunt. You'll ruin me, you will. Dear Aunt Pipkin, do, do! I'll never ask again.\"\nMrs. Pipkin had not expected this, and was almost willing to yield. But Mr. Carbury had spoken so very plainly!\n\"It ain't the thing, Ruby; and I won't do it.\"\n\"And I'm to be - a prisoner! I don't believe as you've any right to lock me up.\"\n\"I've a right to lock my own doors.\"\n\"Then I shall go away tomorrow.\"\n\"I can't help that, my dear. The door will be open, if you choose to go.\"\n\"Then why not open it tonight?\" But Mrs. Pipkin was stern, and Ruby, in a flood of tears, took herself up to her garret.\nMrs. Pipkin knocked at Mrs. Hurtle's door again. \"She's gone to bed,\" she said.\n\"I'm glad to hear it.\"\n\"She was put out a bit. Poor girl! She ain't got a mother, poor dear! And she's got it into her head that a great gentleman will marry her. But what'd a grand gentleman see in Ruby to marry her? She says she'll leave tomorrow.\"\n\"And where will she go?\"\n\"Just nowhere. After this gentleman - and you know what that means! You're going to be married yourself, Mrs. Hurtle.\"\n\"We won't mind about that now, Mrs. Pipkin.\"\n\"But you know how these things are managed. No gentleman'll marry her because she runs after him. Girls should let the gentlemen run after them. Or anyways the girls shouldn't let on as they are running after the gentlemen. But then, maybe, I'm old-fashioned,\" added Mrs. Pipkin. \"But if you wouldn't mind speaking to Ruby tomorrow, Mrs. Hurtle, she'd listen to you. I don't want her to go out into the street, till she knows where she's to go to.\"\nMrs. Hurtle promised that she would speak to Ruby, though she could not help thinking of her unfitness for the task. She knew nothing of the country. She had not a single friend in it but Paul Montague; and she had run after him with as little discretion as Ruby Ruggles. Who was she to give advice?\nShe had not sent her letter to Paul, but still kept it in her pocket-book. At some moments she thought that she would send it; and at others she told herself that it might still be possible to shame him into a marriage. She had returned from Lowestoft on the Monday, and had made some trivial excuse to Mrs. Pipkin in her mildest voice. The place had been windy, and too cold; and she had not liked the hotel. Mrs. Pipkin was very glad to see her back again.",
        "paragraph_chars": [
            [
                0,
                496
            ],
            [
                496,
                866
            ],
            [
                866,
                1149
            ],
            [
                1149,
                1397
            ],
            [
                1397,
                1712
            ],
            [
                1712,
                2128
            ],
            [
                2128,
                2282
            ],
            [
                2282,
                2439
            ],
            [
                2439,
                2514
            ],
            [
                2514,
                2559
            ],
            [
                2559,
                2752
            ],
            [
                2752,
                2924
            ],
            [
                2924,
                3164
            ],
            [
                3164,
                3200
            ],
            [
                3200,
                3325
            ],
            [
                3325,
                3544
            ],
            [
                3544,
                3586
            ],
            [
                3586,
                3628
            ],
            [
                3628,
                3724
            ],
            [
                3724,
                3777
            ],
            [
                3777,
                3856
            ],
            [
                3856,
                3947
            ],
            [
                3947,
                4015
            ],
            [
                4015,
                4044
            ],
            [
                4044,
                4106
            ],
            [
                4106,
                4224
            ],
            [
                4224,
                4461
            ],
            [
                4461,
                4514
            ],
            [
                4514,
                4543
            ],
            [
                4543,
                4659
            ],
            [
                4659,
                4771
            ],
            [
                4771,
                4818
            ],
            [
                4818,
                4899
            ],
            [
                4899,
                4936
            ],
            [
                4936,
                4969
            ],
            [
                4969,
                5043
            ],
            [
                5043,
                5164
            ],
            [
                5164,
                5244
            ],
            [
                5244,
                5267
            ],
            [
                5267,
                5495
            ],
            [
                5495,
                5520
            ],
            [
                5520,
                5639
            ],
            [
                5639,
                5684
            ],
            [
                5684,
                6133
            ],
            [
                6133,
                6433
            ],
            [
                6433,
                6891
            ]
        ],
        "segment_chars": [
            [
                0,
                142
            ],
            [
                142,
                180
            ],
            [
                180,
                229
            ],
            [
                229,
                350
            ],
            [
                350,
                496
            ],
            [
                496,
                626
            ],
            [
                626,
                658
            ],
            [
                658,
                725
            ],
            [
                725,
                781
            ],
            [
                781,
                835
            ],
            [
                835,
                866
            ],
            [
                866,
                951
            ],
            [
                951,
                1019
            ],
            [
                1019,
                1058
            ],
            [
                1058,
                1116
            ],
            [
                1116,
                1149
            ],
            [
                1149,
                1241
            ],
            [
                1241,
                1397
            ],
            [
                1397,
                1456
            ],
            [
                1456,
                1549
            ],
            [
                1549,
                1611
            ],
            [
                1611,
                1712
            ],
            [
                1712,
                1774
            ],
            [
                1774,
                1921
            ],
            [
                1921,
                2128
            ],
            [
                2128,
                2235
            ],
            [
                2235,
                2282
            ],
            [
                2282,
                2347
            ],
            [
                2347,
                2370
            ],
            [
                2370,
                2439
            ],
            [
                2439,
                2514
            ],
            [
                2514,
                2559
            ],
            [
                2559,
                2623
            ],
            [
                2623,
                2752
            ],
            [
                2752,
                2813
            ],
            [
                2813,
                2875
            ],
            [
                2875,
                2924
            ],
            [
                2924,
                2969
            ],
            [
                2969,
                3009
            ],
            [
                3009,
                3021
            ],
            [
                3021,
                3056
            ],
            [
                3056,
                3073
            ],
            [
                3073,
                3164
            ],
            [
                3164,
                3200
            ],
            [
                3200,
                3212
            ],
            [
                3212,
                3283
            ],
            [
                3283,
                3325
            ],
            [
                3325,
                3355
            ],
            [
                3355,
                3483
            ],
            [
                3483,
                3544
            ],
            [
                3544,
                3586
            ],
            [
                3586,
                3628
            ],
            [
                3628,
                3642
            ],
            [
                3642,
                3682
            ],
            [
                3682,
                3724
            ],
            [
                3724,
                3777
            ],
            [
                3777,
                3856
            ],
            [
                3856,
                3947
            ],
            [
                3947,
                3991
            ],
            [
                3991,
                4015
            ],
            [
                4015,
                4044
            ],
            [
                4044,
                4068
            ],
            [
                4068,
                4106
            ],
            [
                4106,
                4177
            ],
            [
                4177,
                4224
            ],
            [
                4224,
                4266
            ],
            [
                4266,
                4374
            ],
            [
                4374,
                4396
            ],
            [
                4396,
                4461
            ],
            [
                4461,
                4514
            ],
            [
                4514,
                4543
            ],
            [
                4543,
                4584
            ],
            [
                4584,
                4610
            ],
            [
                4610,
                4636
            ],
            [
                4636,
                4659
            ],
            [
                4659,
                4727
            ],
            [
                4727,
                4771
            ],
            [
                4771,
                4818
            ],
            [
                4818,
                4847
            ],
            [
                4847,
                4899
            ],
            [
                4899,
                4936
            ],
            [
                4936,
                4969
            ],
            [
                4969,
                4998
            ],
            [
                4998,
                5043
            ],
            [
                5043,
                5075
            ],
            [
                5075,
                5164
            ],
            [
                5164,
                5213
            ],
            [
                5213,
                5244
            ],
            [
                5244,
                5267
            ],
            [
                5267,
                5291
            ],
            [
                5291,
                5302
            ],
            [
                5302,
                5337
            ],
            [
                5337,
                5407
            ],
            [
                5407,
                5462
            ],
            [
                5462,
                5495
            ],
            [
                5495,
                5520
            ],
            [
                5520,
                5535
            ],
            [
                5535,
                5588
            ],
            [
                5588,
                5639
            ],
            [
                5639,
                5684
            ],
            [
                5684,
                5728
            ],
            [
                5728,
                5782
            ],
            [
                5782,
                5829
            ],
            [
                5829,
                5908
            ],
            [
                5908,
                5964
            ],
            [
                5964,
                6051
            ],
            [
                6051,
                6133
            ],
            [
                6133,
                6250
            ],
            [
                6250,
                6283
            ],
            [
                6283,
                6405
            ],
            [
                6405,
                6433
            ],
            [
                6433,
                6508
            ],
            [
                6508,
                6653
            ],
            [
                6653,
                6770
            ],
            [
                6770,
                6843
            ],
            [
                6843,
                6891
            ]
        ],
        "overlap_chars": [
            [
                0,
                142
            ],
            [
                142,
                145
            ],
            [
                149,
                160
            ],
            [
                165,
                168
            ],
            [
                178,
                180
            ],
            [
                180,
                229
            ],
            [
                229,
                278
            ],
            [
                279,
                305
            ],
            [
                306,
                350
            ],
            [
                350,
                381
            ],
            [
                381,
                450
            ],
            [
                458,
                494
            ],
            [
                494,
                495
            ],
            [
                496,
                624
            ],
            [
                624,
                626
            ],
            [
                626,
                658
            ],
            [
                658,
                692
            ],
            [
                693,
                725
            ],
            [
                725,
                781
            ],
            [
                781,
                835
            ],
            [
                835,
                866
            ],
            [
                866,
                951
            ],
            [
                951,
                987
            ],
            [
                993,
                1003
            ],
            [
                1007,
                1010
            ],
            [
                1014,
                1019
            ],
            [
                1019,
                1058
            ],
            [
                1058,
                1116
            ],
            [
                1116,
                1148
            ],
            [
                1149,
                1231
            ],
            [
                1232,
                1241
            ],
            [
                1241,
                1243
            ],
            [
                1244,
                1246
            ],
            [
                1255,
                1397
            ],
            [
                1397,
                1456
            ],
            [
                1456,
                1487
            ],
            [
                1492,
                1549
            ],
            [
                1549,
                1611
            ],
            [
                1611,
                1646
            ],
            [
                1647,
                1678
            ],
            [
                1679,
                1699
            ],
            [
                1710,
                1711
            ],
            [
                1712,
                1727
            ],
            [
                1728,
                1763
            ],
            [
                1772,
                1774
            ],
            [
                1774,
                1777
            ],
            [
                1786,
                1793
            ],
            [
                1794,
                1798
            ],
            [
                1799,
                1813
            ],
            [
                1817,
                1820
            ],
            [
                1827,
                1840
            ],
            [
                1841,
                1859
            ],
            [
                1860,
                1875
            ],
            [
                1876,
                1919
            ],
            [
                1919,
                1921
            ],
            [
                1921,
                1983
            ],
            [
                1988,
                2005
            ],
            [
                2012,
                2048
            ],
            [
                2056,
                2127
            ],
            [
                2128,
                2162
            ],
            [
                2173,
                2176
            ],
            [
                2177,
                2235
            ],
            [
                2235,
                2281
            ],
            [
                2282,
                2313
            ],
            [
                2323,
                2347
            ],
            [
                2347,
                2358
            ],
            [
                2365,
                2368
            ],
            [
                2368,
                2370
            ],
            [
                2370,
                2394
            ],
            [
                2405,
                2429
            ],
            [
                2430,
                2438
            ],
            [
                2439,
                2514
            ],
            [
                2514,
                2559
            ],
            [
                2559,
                2592
            ],
            [
                2593,
                2623
            ],
            [
                2623,
                2737
            ],
            [
                2745,
                2751
            ],
            [
                2752,
                2785
            ],
            [
                2786,
                2804
            ],
            [
                2805,
                2813
            ],
            [
                2813,
                2865
            ],
            [
                2873,
                2875
            ],
            [
                2875,
                2915
            ],
            [
                2916,
                2924
            ],
            [
                2924,
                2968
            ],
            [
                2970,
                2983
            ],
            [
                2992,
                3009
            ],
            [
                3009,
                3019
            ],
            [
                3019,
                3021
            ],
            [
                3021,
                3056
            ],
            [
                3056,
                3071
            ],
            [
                3071,
                3073
            ],
            [
                3073,
                3164
            ],
            [
                3164,
                3174
            ],
            [
                3175,
                3200
            ],
            [
                3200,
                3212
            ],
            [
                3212,
                3278
            ],
            [
                3279,
                3283
            ],
            [
                3283,
                3286
            ],
            [
                3296,
                3300
            ],
            [
                3313,
                3325
            ],
            [
                3325,
                3355
            ],
            [
                3355,
                3387
            ],
            [
                3387,
                3483
            ],
            [
                3483,
                3502
            ],
            [
                3503,
                3543
            ],
            [
                3544,
                3586
            ],
            [
                3587,
                3625
            ],
            [
                3625,
                3628
            ],
            [
                3628,
                3642
            ],
            [
                3642,
                3653
            ],
            [
                3659,
                3666
            ],
            [
                3666,
                3667
            ],
            [
                3672,
                3682
            ],
            [
                3682,
                3704
            ],
            [
                3707,
                3724
            ],
            [
                3724,
                3777
            ],
            [
                3777,
                3813
            ],
            [
                3814,
                3846
            ],
            [
                3847,
                3856
            ],
            [
                3857,
                3911
            ],
            [
                3920,
                3947
            ],
            [
                3947,
                3991
            ],
            [
                3991,
                4015
            ],
            [
                4015,
                4016
            ],
            [
                4020,
                4044
            ],
            [
                4044,
                4068
            ],
            [
                4068,
                4106
            ],
            [
                4106,
                4134
            ],
            [
                4135,
                4157
            ],
            [
                4158,
                4177
            ],
            [
                4177,
                4189
            ],
            [
                4190,
                4215
            ],
            [
                4215,
                4221
            ],
            [
                4221,
                4224
            ],
            [
                4224,
                4264
            ],
            [
                4264,
                4266
            ],
            [
                4266,
                4281
            ],
            [
                4282,
                4303
            ],
            [
                4308,
                4335
            ],
            [
                4335,
                4336
            ],
            [
                4337,
                4340
            ],
            [
                4341,
                4372
            ],
            [
                4372,
                4374
            ],
            [
                4374,
                4396
            ],
            [
                4396,
                4437
            ],
            [
                4442,
                4447
            ],
            [
                4459,
                4460
            ],
            [
                4461,
                4514
            ],
            [
                4514,
                4524
            ],
            [
                4525,
                4543
            ],
            [
                4543,
                4570
            ],
            [
                4571,
                4576
            ],
            [
                4576,
                4582
            ],
            [
                4582,
                4584
            ],
            [
                4584,
                4599
            ],
            [
                4600,
                4610
            ],
            [
                4610,
                4636
            ],
            [
                4636,
                4656
            ],
            [
                4656,
                4659
            ],
            [
                4659,
                4727
            ],
            [
                4727,
                4770
            ],
            [
                4771,
                4818
            ],
            [
                4818,
                4832
            ],
            [
                4835,
                4847
            ],
            [
                4847,
                4899
            ],
            [
                4899,
                4936
            ],
            [
                4936,
                4957
            ],
            [
                4966,
                4969
            ],
            [
                4969,
                4998
            ],
            [
                4998,
                5019
            ],
            [
                5019,
                5040
            ],
            [
                5040,
                5043
            ],
            [
                5043,
                5064
            ],
            [
                5075,
                5164
            ],
            [
                5164,
                5213
            ],
            [
                5213,
                5244
            ],
            [
                5244,
                5264
            ],
            [
                5268,
                5291
            ],
            [
                5291,
                5302
            ],
            [
                5302,
                5337
            ],
            [
                5337,
                5372
            ],
            [
                5373,
                5405
            ],
            [
                5411,
                5462
            ],
            [
                5462,
                5483
            ],
            [
                5492,
                5495
            ],
            [
                5495,
                5520
            ],
            [
                5520,
                5535
            ],
            [
                5535,
                5555
            ],
            [
                5558,
                5588
            ],
            [
                5588,
                5639
            ],
            [
                5639,
                5684
            ],
            [
                5684,
                5685
            ],
            [
                5689,
                5728
            ],
            [
                5728,
                5740
            ],
            [
                5744,
                5782
            ],
            [
                5782,
                5787
            ],
            [
                5788,
                5829
            ],
            [
                5840,
                5908
            ],
            [
                5908,
                5962
            ],
            [
                5962,
                5963
            ],
            [
                5965,
                6006
            ],
            [
                6015,
                6049
            ],
            [
                6049,
                6051
            ],
            [
                6051,
                6073
            ],
            [
                6074,
                6130
            ],
            [
                6133,
                6190
            ],
            [
                6191,
                6204
            ],
            [
                6219,
                6250
            ],
            [
                6250,
                6283
            ],
            [
                6283,
                6316
            ],
            [
                6317,
                6335
            ],
            [
                6336,
                6403
            ],
            [
                6403,
                6405
            ],
            [
                6405,
                6416
            ],
            [
                6417,
                6431
            ],
            [
                6431,
                6433
            ],
            [
                6433,
                6473
            ],
            [
                6474,
                6508
            ],
            [
                6508,
                6595
            ],
            [
                6596,
                6653
            ],
            [
                6653,
                6770
            ],
            [
                6770,
                6808
            ],
            [
                6808,
                6809
            ],
            [
                6810,
                6843
            ],
            [
                6843,
                6891
            ]
        ],
        "row_chars": [
            [
                0,
                142
            ],
            [
                142,
                180
            ],
            [
                180,
                229
            ],
            [
                229,
                350
            ],
            [
                350,
                496
            ],
            [
                496,
                496
            ],
            [
                496,
                626
            ],
            [
                626,
                658
            ],
            [
                658,
                725
            ],
            [
                725,
                781
            ],
            [
                781,
                835
            ],
            [
                835,
                866
            ],
            [
                866,
                951
            ],
            [
                951,
                1019
            ],
            [
                1019,
                1058
            ],
            [
                1058,
                1116
            ],
            [
                1116,
                1149
            ],
            [
                1149,
                1241
            ],
            [
                1241,
                1397
            ],
            [
                1397,
                1456
            ],
            [
                1456,
                1456
            ],
            [
                1456,
                1549
            ],
            [
                1549,
                1611
            ],
            [
                1611,
                1712
            ],
            [
                1712,
                1774
            ],
            [
                1774,
                1921
            ],
            [
                1921,
                2128
            ],
            [
                2128,
                2235
            ],
            [
                2235,
                2282
            ],
            [
                2282,
                2347
            ],
            [
                2347,
                2370
            ],
            [
                2370,
                2439
            ],
            [
                2439,
                2514
            ],
            [
                2514,
                2559
            ],
            [
                2559,
                2623
            ],
            [
                2623,
                2752
            ],
            [
                2752,
                2752
            ],
            [
                2752,
                2813
            ],
            [
                2813,
                2875
            ],
            [
                2875,
                2924
            ],
            [
                2924,
                2969
            ],
            [
                2969,
                2969
            ],
            [
                2969,
                2969
            ],
            [
                2969,
                3009
            ],
            [
                3009,
                3021
            ],
            [
                3021,
                3056
            ],
            [
                3056,
                3073
            ],
            [
                3073,
                3164
            ],
            [
                3164,
                3200
            ],
            [
                3200,
                3212
            ],
            [
                3212,
                3283
            ],
            [
                3283,
                3325
            ],
            [
                3325,
                3355
            ],
            [
                3355,
                3483
            ],
            [
                3483,
                3483
            ],
            [
                3483,
                3544
            ],
            [
                3544,
                3586
            ],
            [
                3586,
                3586
            ],
            [
                3586,
                3628
            ],
            [
                3628,
                3642
            ],
            [
                3642,
                3682
            ],
            [
                3682,
                3724
            ],
            [
                3724,
                3777
            ],
            [
                3777,
                3856
            ],
            [
                3856,
                3856
            ],
            [
                3856,
                3947
            ],
            [
                3947,
                3991
            ],
            [
                3991,
                3991
            ],
            [
                3991,
                4015
            ],
            [
                4015,
                4044
            ],
            [
                4044,
                4068
            ],
            [
                4068,
                4106
            ],
            [
                4106,
                4177
            ],
            [
                4177,
                4224
            ],
            [
                4224,
                4266
            ],
            [
                4266,
                4374
            ],
            [
                4374,
                4374
            ],
            [
                4374,
                4396
            ],
            [
                4396,
                4461
            ],
            [
                4461,
                4514
            ],
            [
                4514,
                4543
            ],
            [
                4543,
                4584
            ],
            [
                4584,
                4610
            ],
            [
                4610,
                4636
            ],
            [
                4636,
                4659
            ],
            [
                4659,
                4727
            ],
            [
                4727,
                4771
            ],
            [
                4771,
                4818
            ],
            [
                4818,
                4847
            ],
            [
                4847,
                4847
            ],
            [
                4847,
                4899
            ],
            [
                4899,
                4936
            ],
            [
                4936,
                4969
            ],
            [
                4969,
                4998
            ],
            [
                4998,
                5043
            ],
            [
                5043,
                5075
            ],
            [
                5075,
                5075
            ],
            [
                5075,
                5164
            ],
            [
                5164,
                5213
            ],
            [
                5213,
                5244
            ],
            [
                5244,
                5267
            ],
            [
                5267,
                5267
            ],
            [
                5267,
                5267
            ],
            [
                5267,
                5291
            ],
            [
                5291,
                5302
            ],
            [
                5302,
                5302
            ],
            [
                5302,
                5337
            ],
            [
                5337,
                5337
            ],
            [
                5337,
                5407
            ],
            [
                5407,
                5407
            ],
            [
                5407,
                5407
            ],
            [
                5407,
                5407
            ],
            [
                5407,
                5462
            ],
            [
                5462,
                5495
            ],
            [
                5495,
                5520
            ],
            [
                5520,
                5535
            ],
            [
                5535,
                5588
            ],
            [
                5588,
                5639
            ],
            [
                5639,
                5684
            ],
            [
                5684,
                5728
            ],
            [
                5728,
                5782
            ],
            [
                5782,
                5829
            ],
            [
                5829,
                5829
            ],
            [
                5829,
                5829
            ],
            [
                5829,
                5908
            ],
            [
                5908,
                5908
            ],
            [
                5908,
                5908
            ],
            [
                5908,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                5964
            ],
            [
                5964,
                6051
            ],
            [
                6051,
                6133
            ],
            [
                6133,
                6133
            ],
            [
                6133,
                6250
            ],
            [
                6250,
                6283
            ],
            [
                6283,
                6405
            ],
            [
                6405,
                6433
            ],
            [
                6433,
                6508
            ],
            [
                6508,
                6653
            ],
            [
                6653,
                6770
            ],
            [
                6770,
                6843
            ],
            [
                6843,
                6891
            ]
        ]
    }
}