{
    "original": {
        "text": "Sir Felix, when he promised to meet Ruby at the Music Hall on the Tuesday, was under an engagement to start with Marie Melmotte for New York on the Thursday following, and to go down to Liverpool on the Wednesday. There was no reason, he thought, why he should not enjoy himself to the last, and he would say a parting word to poor little Ruby. The details of his journey were settled between him and Marie, with no inconsiderable assistance from Didon, in the garden of Grosvenor Square, on the previous Sunday,--where the lovers had again met during the hours of morning service. Sir Felix had been astonished at the completion of the preparations which had been made. \"Mind you go by the 5 P.M. train,\" Marie said. \"That will take you into Liverpool at 10.15. There's an hotel at the railway-station. Didon has got our tickets under the names of Madame and Mademoiselle Racine. We are to have one cabin between us. You must get yours to-morrow. She has found out that there is plenty of room.\"\n\"I'll be all right.\"\n\"Pray don't miss the train that afternoon. Somebody would be sure to suspect something if we were seen together in the same train. We leave at 7 A.M. I shan't go to bed all night, so as to be sure to be in time. Robert,--he's the man,--will start a little earlier in the cab with my heavy box. What do you think is in it?\"\n\"Clothes,\" suggested Felix.\n\"Yes, but what clothes?--my wedding dresses. Think of that! What a job to get them and nobody to know anything about it except Didon and Madame Craik at the shop in Mount Street! They haven't come yet, but I shall be there whether they come or not. And I shall have all my jewels. I'm not going to leave them behind. They'll go off in our cab. We can get the things out behind the house into the mews. Then Didon and I follow in another cab. Nobody ever is up before near nine, and I don't think we shall be interrupted.\"\n\"If the servants were to hear.\"\n\"I don't think they'd tell. But if I was to be brought back again, I should only tell papa that it was no good. He can't prevent me marrying.\"\n\"Won't your mother find out?\"\n\"She never looks after anything. I don't think she'd tell if she knew. Papa leads her such a life! Felix! I hope you won't be like that.\"--And she looked up into his face, and thought that it would be impossible that he should be.\n\"I'm all right,\" said Felix, feeling very uncomfortable at the time. This great effort of his life was drawing very near. There had been a pleasurable excitement in talking of running away with the great heiress of the day, but now that the deed had to be executed,--and executed after so novel and stupendous a fashion, he almost wished that he had not undertaken it. It must have been much nicer when men ran away with their heiresses only as far as Gretna Green. And even Goldsheiner with Lady Julia had nothing of a job in comparison with this which he was expected to perform. And then if they should be wrong about the girl's fortune! He almost repented. He did repent, but he had not the courage to recede. \"How about money though?\" he said hoarsely.\n\"You have got some?\"\n\"I have just the two hundred pounds which your father paid me, and not a shilling more. I don't see why he should keep my money, and not let me have it back.\"\n\"Look here,\" said Marie, and she put her hand into her pocket. \"I told you I thought I could get some. There is a cheque for two hundred and fifty pounds. I had money of my own enough for the tickets.\"\n\"And whose is this?\" said Felix, taking the bit of paper with much trepidation.\n\"It is papa's cheque. Mamma gets ever so many of them to carry on the house and pay for things. But she gets so muddled about it that she doesn't know what she pays and what she doesn't.\" Felix looked at the cheque and saw that it was payable to House or Bearer, and that it was signed by Augustus Melmotte. \"If you take it to the bank you'll get the money,\" said Marie. \"Or shall I send Didon, and give you the money on board the ship?\"\nFelix thought over the matter very anxiously. If he did go on the journey he would much prefer to have the money in his own pocket. He liked the feeling of having money in his pocket. Perhaps if Didon were entrusted with the cheque she also would like the feeling. But then might it not be possible that if he presented the cheque himself he might be arrested for stealing Melmotte's money? \"I think Didon had better get the money,\" he said, \"and bring it to me to-morrow, at four o'clock in the afternoon, to the club.\" If the money did not come he would not go down to Liverpool, nor would he be at the expense of his ticket for New York. \"You see,\" he said, \"I'm so much in the City that they might know me at the bank.\" To this arrangement Marie assented and took back the cheque. \"And then I'll come on board on Thursday morning,\" he said, \"without looking for you.\"\n\"Oh dear, yes;--without looking for us. And don't know us even till we are out at sea. Won't it be fun when we shall be walking about on the deck and not speaking to one another! And, Felix;--what do you think? Didon has found out that there is to be an American clergyman on board. I wonder whether he'd marry us.\"\n\"Of course he will.\"\n\"Won't that be jolly? I wish it was all done. Then, directly it's done, and when we get to New York, we'll telegraph and write to papa, and we'll be ever so penitent and good; won't we? Of course he'll make the best of it.\"\n\"But he's so savage; isn't he?\"\n\"When there's anything to get;--or just at the moment. But I don't think he minds afterwards. He's always for making the best of everything;--misfortunes and all. Things go wrong so often that if he was to go on thinking of them always they'd be too many for anybody. It'll be all right in a month's time. I wonder how Lord Nidderdale will look when he hears that we've gone off. I should so like to see him. He never can say that I've behaved bad to him. We were engaged, but it was he broke it. Do you know, Felix, that though we were engaged to be married, and everybody knew it, he never once kissed me!\" Felix at this moment almost wished that he had never done so. As to what the other man had done, he cared nothing at all.\nThen they parted with the understanding that they were not to see each other again till they met on board the boat. All arrangements were made. But Felix was determined that he would not stir in the matter unless Didon brought him the full sum of 250; and he almost thought, and indeed hoped, that she would not. Either she would be suspected at the bank and apprehended, or she would run off with the money on her own account when she got it;--or the cheque would have been missed and the payment stopped. Some accident would occur, and then he would be able to recede from his undertaking. He would do nothing till after Monday afternoon.\nShould he tell his mother that he was going? His mother had clearly recommended him to run away with the girl, and must therefore approve of the measure. His mother would understand how great would be the expense of such a trip, and might perhaps add something to his stock of money. He determined that he would tell his mother;--that is, if Didon should bring him full change for the cheque.\nHe walked into the Beargarden exactly at four o'clock on the Monday, and there he found Didon standing in the hall. His heart sank within him as he saw her. Now must he certainly go to New York. She made him a little curtsey, and without a word handed him an envelope, soft and fat with rich enclosures. He bade her wait a moment, and going into a little waiting-room counted the notes. The money was all there;--the full sum of 250. He must certainly go to New York. \"C'est tout en rgle?\" said Didon in a whisper as he returned to the hall. Sir Felix nodded his head, and Didon took her departure.\nYes; he must go now. He had Melmotte's money in his pocket, and was therefore bound to run away with Melmotte's daughter. It was a great trouble to him as he reflected that Melmotte had more of his money than he had of Melmotte's. And now how should he dispose of his time before he went? Gambling was too dangerous. Even he felt that. Where would he be were he to lose his ready money? He would dine that night at the club, and in the evening go up to his mother. On the Tuesday he would take his place for New York in the City, and would spend the evening with Ruby at the Music Hall. On the Wednesday, he would start for Liverpool,--according to his instructions. He felt annoyed that he had been so fully instructed. But should the affair turn out well nobody would know that. All the fellows would give him credit for the audacity with which he had carried off the heiress to America.\nAt ten o'clock he found his mother and Hetta in Welbeck Street--\"What; Felix?\" exclaimed Lady Carbury.\n\"You're surprised; are you not?\" Then he threw himself into a chair. \"Mother,\" he said, \"would you mind coming into the other room?\" Lady Carbury of course went with him. \"I've got something to tell you,\" he said.\n\"Good news?\" she asked, clasping her hands together. From his manner she thought that it was good news. Money had in some way come into his hands,--or at any rate a prospect of money.\n\"That's as may be,\" he said, and then he paused.\n\"Don't keep me in suspense, Felix.\"\n\"The long and the short of it is that I'm going to take Marie off.\"\n\"Oh, Felix.\"\n\"You said you thought it was the right thing to do;--and therefore I'm going to do it. The worst of it is that one wants such a lot of money for this kind of thing.\"\n\"But when?\"\n\"Immediately. I wouldn't tell you till I had arranged everything. I've had it in my mind for the last fortnight.\"\n\"And how is it to be? Oh, Felix, I hope it may succeed.\"\n\"It was your own idea, you know. We're going to;--where do you think?\"\n\"How can I think?--Boulogne.\"\n\"You say that just because Goldsheiner went there. That wouldn't have done at all for us. We're going to--New York.\"\n\"To New York! But when will you be married?\"\n\"There will be a clergyman on board. It's all fixed. I wouldn't go without telling you.\"\n\"Oh; I wish you hadn't told me.\"\n\"Come now;--that's kind. You don't mean to say it wasn't you that put me up to it. I've got to get my things ready.\"\n\"Of course, if you tell me that you are going on a journey, I will have your clothes got ready for you. When do you start?\"\n\"Wednesday afternoon.\"\n\"For New York! We must get some things ready-made. Oh, Felix, how will it be if he does not forgive her?\" He attempted to laugh. \"When I spoke of such a thing as possible he had not sworn then that he would never give her a shilling.\"\n\"They always say that.\"\n\"You are going to risk it?\"\n\"I am going to take your advice.\" This was dreadful to the poor mother. \"There is money settled on her.\"\n\"Settled on whom?\"\n\"On Marie;--money which he can't get back again.\"\n\"How much?\"\n\"She doesn't know;--but a great deal; enough for them all to live upon if things went amiss with them.\"\n\"But that's only a form, Felix. That money can't be her own, to give to her husband.\"\n\"Melmotte will find that it is, unless he comes to terms. That's the pull we've got over him. Marie knows what she's about. She's a great deal sharper than any one would take her to be. What can you do for me about money, mother?\"\n\"I have none, Felix.\"\n\"I thought you'd be sure to help me, as you wanted me so much to do it.\"\n\"That's not true, Felix. I didn't want you to do it. Oh, I am so sorry that that word ever passed my mouth! I have no money. There isn't 20 at the bank altogether.\"\n\"They would let you overdraw for 50 or 60.\"\n\"I will not do it. I will not starve myself and Hetta. You had ever so much money only lately. I will get some things for you, and pay for them as I can if you cannot pay for them after your marriage;--but I have not money to give you.\"\n\"That's a blue look out,\" said he, turning himself in his chair,--\"just when 60 or 70 might make a fellow for life! You could borrow it from your friend Broune.\"\n\"I will do no such thing, Felix. 50 or 60 would make very little difference in the expense of such a trip as this. I suppose you have some money?\"\n\"Some;--yes, some. But I'm so short that any little thing would help me.\" Before the evening was over she absolutely did give him a cheque for 30, although she had spoken the truth in saying that she had not so much at her banker's.\nAfter this he went back to his club, although he himself understood the danger. He could not bear the idea of going to bed quietly at home at half-past ten. He got into a cab, and was very soon up in the card-room. He found nobody there, and went to the smoking-room, where Dolly Longestaffe and Miles Grendall were sitting silently together, with pipes in their mouths. \"Here's Carbury,\" said Dolly, waking suddenly into life. \"Now we can have a game at three-handed loo.\"\n\"Thank ye; not for me,\" said Sir Felix. \"I hate three-handed loo.\"\n\"Dummy,\" suggested Dolly.\n\"I don't think I'll play to-night, old fellow. I hate three fellows sticking down together.\" Miles sat silent, smoking his pipe, conscious of the baronet's dislike to play with him. \"By-the-bye, Grendall,--look here.\" And Sir Felix in his most friendly tone whispered into his enemy's ear a petition that some of the I. O. U.'s might be converted into cash.\n\"'Pon my word, I must ask you to wait till next week,\" said Miles.\n\"It's always waiting till next week with you,\" said Sir Felix, getting up and standing with his back to the fire-place. There were other men in the room, and this was said so that every one should hear it. \"I wonder whether any fellow would buy these for five shillings in the pound?\" And he held up the scraps of paper in his hand. He had been drinking freely before he went up to Welbeck Street, and had taken a glass of brandy on re-entering the club.\n\"Don't let's have any of that kind of thing down here,\" said Dolly. \"If there is to be a row about cards, let it be in the card-room.\"\n\"Of course,\" said Miles. \"I won't say a word about the matter down here. It isn't the proper thing.\"\n\"Come up into the card-room, then,\" said Sir Felix, getting up from his chair. \"It seems to me that it makes no difference to you, what room you're in. Come up, now; and Dolly Longestaffe shall come and hear what you say.\" But Miles Grendall objected to this arrangement. He was not going up into the card-room that night, as no one was going to play. He would be there to-morrow, and then if Sir Felix Carbury had anything to say, he could say it.\n\"How I do hate a row!\" said Dolly. \"One has to have rows with one's own people, but there ought not to be rows at a club.\"\n\"He likes a row,--Carbury does,\" said Miles.\n\"I should like my money, if I could get it,\" said Sir Felix, walking out of the room.\nOn the next day he went into the City, and changed his mother's cheque. This was done after a little hesitation. The money was given to him, but a gentleman from behind the desks begged him to remind Lady Carbury that she was overdrawing her account. \"Dear, dear;\" said Sir Felix, as he pocketed the notes, \"I'm sure she was unaware of it.\" Then he paid for his passage from Liverpool to New York under the name of Walter Jones, and felt as he did so that the intrigue was becoming very deep. This was on Tuesday. He dined again at the club, alone, and in the evening went to the Music Hall. There he remained from ten till nearly twelve, very angry at the non-appearance of Ruby Ruggles. As he smoked and drank in solitude, he almost made up his mind that he had intended to tell her of his departure for New York. Of course he would have done no such thing. But now, should she ever complain on that head he would have his answer ready. He had devoted his last night in England to the purpose of telling her, and she had broken her appointment. Everything would now be her fault. Whatever might happen to her she could not blame him.\nHaving waited till he was sick of the Music Hall,--for a music hall without ladies' society must be somewhat dull,--he went back to his club. He was very cross, as brave as brandy could make him, and well inclined to expose Miles Grendall if he could find an opportunity. Up in the card-room he found all the accustomed men,--with the exception of Miles Grendall. Nidderdale, Grasslough, Dolly, Paul Montague, and one or two others were there. There was, at any rate, comfort in the idea of playing without having to encounter the dead weight of Miles Grendall. Ready money was on the table,--and there was none of the peculiar Beargarden paper flying about. Indeed the men at the Beargarden had become sick of paper, and there had been formed a half-expressed resolution that the play should be somewhat lower, but the payments punctual. The I. O. U.'s had been nearly all converted into money,--with the assistance of Herr Vossner,--excepting those of Miles Grendall. The resolution mentioned did not refer back to Grendall's former indebtedness, but was intended to include a clause that he must in future pay ready money. Nidderdale had communicated to him the determination of the committee. \"Bygones are bygones, old fellow; but you really must stump up, you know, after this.\" Miles had declared that he would \"stump up.\" But on this occasion Miles was absent.\nAt three o'clock in the morning, Sir Felix had lost over a hundred pounds in ready money. On the following night about one he had lost a further sum of two hundred pounds. The reader will remember that he should at that time have been in the hotel at Liverpool.\nBut Sir Felix, as he played on in the almost desperate hope of recovering the money which he so greatly needed, remembered how Fisker had played all night, and how he had gone off from the club to catch the early train for Liverpool, and how he had gone on to New York without delay.",
        "paragraph_chars": [
            [
                0,
                997
            ],
            [
                997,
                1018
            ],
            [
                1018,
                1341
            ],
            [
                1341,
                1369
            ],
            [
                1369,
                1891
            ],
            [
                1891,
                1923
            ],
            [
                1923,
                2066
            ],
            [
                2066,
                2096
            ],
            [
                2096,
                2327
            ],
            [
                2327,
                3085
            ],
            [
                3085,
                3106
            ],
            [
                3106,
                3265
            ],
            [
                3265,
                3467
            ],
            [
                3467,
                3547
            ],
            [
                3547,
                3985
            ],
            [
                3985,
                4857
            ],
            [
                4857,
                5173
            ],
            [
                5173,
                5194
            ],
            [
                5194,
                5418
            ],
            [
                5418,
                5450
            ],
            [
                5450,
                6181
            ],
            [
                6181,
                6822
            ],
            [
                6822,
                7215
            ],
            [
                7215,
                7814
            ],
            [
                7814,
                8704
            ],
            [
                8704,
                8807
            ],
            [
                8807,
                9021
            ],
            [
                9021,
                9205
            ],
            [
                9205,
                9254
            ],
            [
                9254,
                9290
            ],
            [
                9290,
                9358
            ],
            [
                9358,
                9371
            ],
            [
                9371,
                9537
            ],
            [
                9537,
                9549
            ],
            [
                9549,
                9663
            ],
            [
                9663,
                9720
            ],
            [
                9720,
                9791
            ],
            [
                9791,
                9821
            ],
            [
                9821,
                9938
            ],
            [
                9938,
                9983
            ],
            [
                9983,
                10072
            ],
            [
                10072,
                10105
            ],
            [
                10105,
                10222
            ],
            [
                10222,
                10346
            ],
            [
                10346,
                10369
            ],
            [
                10369,
                10604
            ],
            [
                10604,
                10628
            ],
            [
                10628,
                10656
            ],
            [
                10656,
                10761
            ],
            [
                10761,
                10780
            ],
            [
                10780,
                10830
            ],
            [
                10830,
                10842
            ],
            [
                10842,
                10946
            ],
            [
                10946,
                11032
            ],
            [
                11032,
                11263
            ],
            [
                11263,
                11285
            ],
            [
                11285,
                11358
            ],
            [
                11358,
                11523
            ],
            [
                11523,
                11567
            ],
            [
                11567,
                11804
            ],
            [
                11804,
                11966
            ],
            [
                11966,
                12113
            ],
            [
                12113,
                12346
            ],
            [
                12346,
                12820
            ],
            [
                12820,
                12887
            ],
            [
                12887,
                12913
            ],
            [
                12913,
                13271
            ],
            [
                13271,
                13338
            ],
            [
                13338,
                13793
            ],
            [
                13793,
                13928
            ],
            [
                13928,
                14029
            ],
            [
                14029,
                14478
            ],
            [
                14478,
                14601
            ],
            [
                14601,
                14646
            ],
            [
                14646,
                14732
            ],
            [
                14732,
                15868
            ],
            [
                15868,
                17236
            ],
            [
                17236,
                17498
            ],
            [
                17498,
                17781
            ]
        ],
        "segment_chars": [
            [
                0,
                214
            ],
            [
                214,
                345
            ],
            [
                345,
                582
            ],
            [
                582,
                671
            ],
            [
                671,
                718
            ],
            [
                718,
                763
            ],
            [
                763,
                804
            ],
            [
                804,
                881
            ],
            [
                881,
                918
            ],
            [
                918,
                948
            ],
            [
                948,
                997
            ],
            [
                997,
                1018
            ],
            [
                1018,
                1061
            ],
            [
                1061,
                1149
            ],
            [
                1149,
                1168
            ],
            [
                1168,
                1230
            ],
            [
                1230,
                1312
            ],
            [
                1312,
                1341
            ],
            [
                1341,
                1369
            ],
            [
                1369,
                1414
            ],
            [
                1414,
                1429
            ],
            [
                1429,
                1548
            ],
            [
                1548,
                1618
            ],
            [
                1618,
                1650
            ],
            [
                1650,
                1686
            ],
            [
                1686,
                1713
            ],
            [
                1713,
                1771
            ],
            [
                1771,
                1811
            ],
            [
                1811,
                1891
            ],
            [
                1891,
                1923
            ],
            [
                1923,
                1951
            ],
            [
                1951,
                2035
            ],
            [
                2035,
                2066
            ],
            [
                2066,
                2096
            ],
            [
                2096,
                2129
            ],
            [
                2129,
                2167
            ],
            [
                2167,
                2195
            ],
            [
                2195,
                2202
            ],
            [
                2202,
                2233
            ],
            [
                2233,
                2327
            ],
            [
                2327,
                2396
            ],
            [
                2396,
                2449
            ],
            [
                2449,
                2696
            ],
            [
                2696,
                2793
            ],
            [
                2793,
                2909
            ],
            [
                2909,
                2968
            ],
            [
                2968,
                2988
            ],
            [
                2988,
                3041
            ],
            [
                3041,
                3067
            ],
            [
                3067,
                3085
            ],
            [
                3085,
                3106
            ],
            [
                3106,
                3194
            ],
            [
                3194,
                3265
            ],
            [
                3265,
                3328
            ],
            [
                3328,
                3368
            ],
            [
                3368,
                3420
            ],
            [
                3420,
                3467
            ],
            [
                3467,
                3488
            ],
            [
                3488,
                3547
            ],
            [
                3547,
                3569
            ],
            [
                3569,
                3643
            ],
            [
                3643,
                3735
            ],
            [
                3735,
                3855
            ],
            [
                3855,
                3918
            ],
            [
                3918,
                3985
            ],
            [
                3985,
                4031
            ],
            [
                4031,
                4117
            ],
            [
                4117,
                4169
            ],
            [
                4169,
                4250
            ],
            [
                4250,
                4376
            ],
            [
                4376,
                4506
            ],
            [
                4506,
                4626
            ],
            [
                4626,
                4709
            ],
            [
                4709,
                4770
            ],
            [
                4770,
                4857
            ],
            [
                4857,
                4897
            ],
            [
                4897,
                4944
            ],
            [
                4944,
                5036
            ],
            [
                5036,
                5068
            ],
            [
                5068,
                5140
            ],
            [
                5140,
                5173
            ],
            [
                5173,
                5194
            ],
            [
                5194,
                5216
            ],
            [
                5216,
                5240
            ],
            [
                5240,
                5380
            ],
            [
                5380,
                5418
            ],
            [
                5418,
                5450
            ],
            [
                5450,
                5505
            ],
            [
                5505,
                5544
            ],
            [
                5544,
                5613
            ],
            [
                5613,
                5718
            ],
            [
                5718,
                5756
            ],
            [
                5756,
                5830
            ],
            [
                5830,
                5859
            ],
            [
                5859,
                5906
            ],
            [
                5906,
                5947
            ],
            [
                5947,
                6059
            ],
            [
                6059,
                6121
            ],
            [
                6121,
                6181
            ],
            [
                6181,
                6297
            ],
            [
                6297,
                6325
            ],
            [
                6325,
                6494
            ],
            [
                6494,
                6688
            ],
            [
                6688,
                6773
            ],
            [
                6773,
                6822
            ],
            [
                6822,
                6867
            ],
            [
                6867,
                6976
            ],
            [
                6976,
                7106
            ],
            [
                7106,
                7215
            ],
            [
                7215,
                7331
            ],
            [
                7331,
                7372
            ],
            [
                7372,
                7410
            ],
            [
                7410,
                7519
            ],
            [
                7519,
                7602
            ],
            [
                7602,
                7649
            ],
            [
                7649,
                7683
            ],
            [
                7683,
                7705
            ],
            [
                7705,
                7757
            ],
            [
                7757,
                7814
            ],
            [
                7814,
                7835
            ],
            [
                7835,
                7936
            ],
            [
                7936,
                8045
            ],
            [
                8045,
                8103
            ],
            [
                8103,
                8131
            ],
            [
                8131,
                8150
            ],
            [
                8150,
                8201
            ],
            [
                8201,
                8279
            ],
            [
                8279,
                8401
            ],
            [
                8401,
                8481
            ],
            [
                8481,
                8535
            ],
            [
                8535,
                8595
            ],
            [
                8595,
                8704
            ],
            [
                8704,
                8783
            ],
            [
                8783,
                8807
            ],
            [
                8807,
                8840
            ],
            [
                8840,
                8876
            ],
            [
                8876,
                8940
            ],
            [
                8940,
                8978
            ],
            [
                8978,
                9021
            ],
            [
                9021,
                9034
            ],
            [
                9034,
                9074
            ],
            [
                9074,
                9125
            ],
            [
                9125,
                9205
            ],
            [
                9205,
                9254
            ],
            [
                9254,
                9290
            ],
            [
                9290,
                9358
            ],
            [
                9358,
                9371
            ],
            [
                9371,
                9458
            ],
            [
                9458,
                9537
            ],
            [
                9537,
                9549
            ],
            [
                9549,
                9563
            ],
            [
                9563,
                9615
            ],
            [
                9615,
                9663
            ],
            [
                9663,
                9685
            ],
            [
                9685,
                9720
            ],
            [
                9720,
                9753
            ],
            [
                9753,
                9791
            ],
            [
                9791,
                9821
            ],
            [
                9821,
                9872
            ],
            [
                9872,
                9911
            ],
            [
                9911,
                9938
            ],
            [
                9938,
                9952
            ],
            [
                9952,
                9983
            ],
            [
                9983,
                10020
            ],
            [
                10020,
                10036
            ],
            [
                10036,
                10072
            ],
            [
                10072,
                10105
            ],
            [
                10105,
                10130
            ],
            [
                10130,
                10188
            ],
            [
                10188,
                10222
            ],
            [
                10222,
                10326
            ],
            [
                10326,
                10346
            ],
            [
                10346,
                10369
            ],
            [
                10369,
                10384
            ],
            [
                10384,
                10420
            ],
            [
                10420,
                10475
            ],
            [
                10475,
                10498
            ],
            [
                10498,
                10604
            ],
            [
                10604,
                10628
            ],
            [
                10628,
                10656
            ],
            [
                10656,
                10690
            ],
            [
                10690,
                10728
            ],
            [
                10728,
                10761
            ],
            [
                10761,
                10780
            ],
            [
                10780,
                10830
            ],
            [
                10830,
                10842
            ],
            [
                10842,
                10946
            ],
            [
                10946,
                10978
            ],
            [
                10978,
                11032
            ],
            [
                11032,
                11090
            ],
            [
                11090,
                11126
            ],
            [
                11126,
                11156
            ],
            [
                11156,
                11218
            ],
            [
                11218,
                11263
            ],
            [
                11263,
                11285
            ],
            [
                11285,
                11358
            ],
            [
                11358,
                11383
            ],
            [
                11383,
                11411
            ],
            [
                11411,
                11466
            ],
            [
                11466,
                11483
            ],
            [
                11483,
                11523
            ],
            [
                11523,
                11567
            ],
            [
                11567,
                11586
            ],
            [
                11586,
                11622
            ],
            [
                11622,
                11662
            ],
            [
                11662,
                11804
            ],
            [
                11804,
                11920
            ],
            [
                11920,
                11966
            ],
            [
                11966,
                11999
            ],
            [
                11999,
                12081
            ],
            [
                12081,
                12113
            ],
            [
                12113,
                12132
            ],
            [
                12132,
                12187
            ],
            [
                12187,
                12346
            ],
            [
                12346,
                12426
            ],
            [
                12426,
                12503
            ],
            [
                12503,
                12561
            ],
            [
                12561,
                12717
            ],
            [
                12717,
                12774
            ],
            [
                12774,
                12820
            ],
            [
                12820,
                12860
            ],
            [
                12860,
                12887
            ],
            [
                12887,
                12913
            ],
            [
                12913,
                12960
            ],
            [
                12960,
                13006
            ],
            [
                13006,
                13095
            ],
            [
                13095,
                13131
            ],
            [
                13131,
                13236
            ],
            [
                13236,
                13238
            ],
            [
                13238,
                13271
            ],
            [
                13271,
                13338
            ],
            [
                13338,
                13458
            ],
            [
                13458,
                13544
            ],
            [
                13544,
                13623
            ],
            [
                13623,
                13671
            ],
            [
                13671,
                13793
            ],
            [
                13793,
                13861
            ],
            [
                13861,
                13928
            ],
            [
                13928,
                13953
            ],
            [
                13953,
                14001
            ],
            [
                14001,
                14029
            ],
            [
                14029,
                14108
            ],
            [
                14108,
                14181
            ],
            [
                14181,
                14252
            ],
            [
                14252,
                14301
            ],
            [
                14301,
                14381
            ],
            [
                14381,
                14478
            ],
            [
                14478,
                14501
            ],
            [
                14501,
                14513
            ],
            [
                14513,
                14601
            ],
            [
                14601,
                14646
            ],
            [
                14646,
                14732
            ],
            [
                14732,
                14804
            ],
            [
                14804,
                14845
            ],
            [
                14845,
                14983
            ],
            [
                14983,
                15073
            ],
            [
                15073,
                15225
            ],
            [
                15225,
                15246
            ],
            [
                15246,
                15324
            ],
            [
                15324,
                15421
            ],
            [
                15421,
                15548
            ],
            [
                15548,
                15592
            ],
            [
                15592,
                15671
            ],
            [
                15671,
                15779
            ],
            [
                15779,
                15814
            ],
            [
                15814,
                15868
            ],
            [
                15868,
                16010
            ],
            [
                16010,
                16140
            ],
            [
                16140,
                16232
            ],
            [
                16232,
                16312
            ],
            [
                16312,
                16430
            ],
            [
                16430,
                16527
            ],
            [
                16527,
                16707
            ],
            [
                16707,
                16717
            ],
            [
                16717,
                16719
            ],
            [
                16719,
                16838
            ],
            [
                16838,
                16994
            ],
            [
                16994,
                17065
            ],
            [
                17065,
                17152
            ],
            [
                17152,
                17197
            ],
            [
                17197,
                17236
            ],
            [
                17236,
                17326
            ],
            [
                17326,
                17408
            ],
            [
                17408,
                17498
            ],
            [
                17498,
                17781
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                75,
                78
            ],
            [
                99,
                156
            ],
            [
                166,
                214
            ],
            [
                214,
                290
            ],
            [
                339,
                345
            ],
            [
                345,
                371
            ],
            [
                531,
                534
            ],
            [
                377,
                412
            ],
            [
                442,
                487
            ],
            [
                580,
                582
            ],
            [
                582,
                618
            ],
            [
                630,
                649
            ],
            [
                669,
                670
            ],
            [
                671,
                718
            ],
            [
                718,
                763
            ],
            [
                763,
                804
            ],
            [
                804,
                881
            ],
            [
                881,
                890
            ],
            [
                900,
                905
            ],
            [
                916,
                918
            ],
            [
                918,
                936
            ],
            [
                946,
                948
            ],
            [
                948,
                997
            ],
            [
                997,
                1018
            ],
            [
                1018,
                1034
            ],
            [
                1045,
                1049
            ],
            [
                1039,
                1044
            ],
            [
                1059,
                1061
            ],
            [
                1149,
                1168
            ],
            [
                1168,
                1230
            ],
            [
                1230,
                1236
            ],
            [
                1254,
                1312
            ],
            [
                1312,
                1341
            ],
            [
                1341,
                1369
            ],
            [
                1369,
                1370
            ],
            [
                1394,
                1414
            ],
            [
                1414,
                1429
            ],
            [
                1429,
                1505
            ],
            [
                1522,
                1548
            ],
            [
                1618,
                1650
            ],
            [
                1686,
                1696
            ],
            [
                1701,
                1711
            ],
            [
                1771,
                1811
            ],
            [
                1811,
                1817
            ],
            [
                1823,
                1825
            ],
            [
                1818,
                1822
            ],
            [
                1826,
                1835
            ],
            [
                1841,
                1891
            ],
            [
                2066,
                2096
            ],
            [
                2129,
                2167
            ],
            [
                2167,
                2195
            ],
            [
                2195,
                2200
            ],
            [
                2202,
                2233
            ],
            [
                2239,
                2249
            ],
            [
                2253,
                2327
            ],
            [
                2327,
                2382
            ],
            [
                2394,
                2396
            ],
            [
                2396,
                2449
            ],
            [
                2449,
                2499
            ],
            [
                2503,
                2524
            ],
            [
                2531,
                2538
            ],
            [
                2549,
                2582
            ],
            [
                2646,
                2696
            ],
            [
                2909,
                2968
            ],
            [
                2968,
                2986
            ],
            [
                3001,
                3032
            ],
            [
                2986,
                2987
            ],
            [
                3041,
                3067
            ],
            [
                3067,
                3084
            ],
            [
                3106,
                3113
            ],
            [
                3119,
                3167
            ],
            [
                3192,
                3194
            ],
            [
                3194,
                3233
            ],
            [
                3262,
                3265
            ],
            [
                3265,
                3288
            ],
            [
                3326,
                3328
            ],
            [
                3368,
                3420
            ],
            [
                3420,
                3467
            ],
            [
                3467,
                3468
            ],
            [
                3472,
                3488
            ],
            [
                3488,
                3506
            ],
            [
                3545,
                3547
            ],
            [
                3547,
                3569
            ],
            [
                3569,
                3603
            ],
            [
                3627,
                3641
            ],
            [
                3643,
                3666
            ],
            [
                3676,
                3735
            ],
            [
                3735,
                3740
            ],
            [
                3766,
                3774
            ],
            [
                3751,
                3761
            ],
            [
                3778,
                3813
            ],
            [
                3822,
                3855
            ],
            [
                3855,
                3918
            ],
            [
                3918,
                3985
            ],
            [
                3985,
                3998
            ],
            [
                3999,
                4003
            ],
            [
                4015,
                4031
            ],
            [
                4059,
                4117
            ],
            [
                4250,
                4253
            ],
            [
                4289,
                4323
            ],
            [
                4259,
                4264
            ],
            [
                4324,
                4326
            ],
            [
                4333,
                4375
            ],
            [
                4376,
                4446
            ],
            [
                4481,
                4506
            ],
            [
                4506,
                4565
            ],
            [
                4624,
                4626
            ],
            [
                4626,
                4706
            ],
            [
                4771,
                4818
            ],
            [
                4831,
                4857
            ],
            [
                4857,
                4870
            ],
            [
                4895,
                4897
            ],
            [
                4897,
                4914
            ],
            [
                4920,
                4944
            ],
            [
                4944,
                4967
            ],
            [
                4977,
                5036
            ],
            [
                5036,
                5047
            ],
            [
                5068,
                5083
            ],
            [
                5088,
                5140
            ],
            [
                5140,
                5170
            ],
            [
                5195,
                5216
            ],
            [
                5240,
                5245
            ],
            [
                5270,
                5333
            ],
            [
                5340,
                5342
            ],
            [
                5351,
                5368
            ],
            [
                5380,
                5418
            ],
            [
                5418,
                5437
            ],
            [
                5450,
                5451
            ],
            [
                5485,
                5489
            ],
            [
                5493,
                5505
            ],
            [
                5505,
                5544
            ],
            [
                5544,
                5589
            ],
            [
                5611,
                5613
            ],
            [
                5613,
                5642
            ],
            [
                5646,
                5648
            ],
            [
                5656,
                5678
            ],
            [
                5705,
                5708
            ],
            [
                5716,
                5718
            ],
            [
                5718,
                5747
            ],
            [
                5754,
                5756
            ],
            [
                5756,
                5830
            ],
            [
                5947,
                5994
            ],
            [
                6031,
                6059
            ],
            [
                6059,
                6120
            ],
            [
                6181,
                6280
            ],
            [
                6287,
                6297
            ],
            [
                6325,
                6372
            ],
            [
                6387,
                6415
            ],
            [
                6428,
                6446
            ],
            [
                6467,
                6472
            ],
            [
                6474,
                6494
            ],
            [
                6494,
                6513
            ],
            [
                6679,
                6686
            ],
            [
                6524,
                6535
            ],
            [
                6551,
                6588
            ],
            [
                6686,
                6688
            ],
            [
                6719,
                6743
            ],
            [
                6771,
                6773
            ],
            [
                6773,
                6822
            ],
            [
                6822,
                6867
            ],
            [
                6878,
                6881
            ],
            [
                6890,
                6941
            ],
            [
                6952,
                6959
            ],
            [
                6974,
                6976
            ],
            [
                6987,
                7003
            ],
            [
                7023,
                7026
            ],
            [
                7008,
                7013
            ],
            [
                7027,
                7068
            ],
            [
                7099,
                7106
            ],
            [
                7106,
                7149
            ],
            [
                7159,
                7169
            ],
            [
                7183,
                7186
            ],
            [
                7187,
                7191
            ],
            [
                7199,
                7215
            ],
            [
                7215,
                7244
            ],
            [
                7253,
                7287
            ],
            [
                7297,
                7331
            ],
            [
                7331,
                7345
            ],
            [
                7370,
                7372
            ],
            [
                7410,
                7444
            ],
            [
                7460,
                7470
            ],
            [
                7453,
                7454
            ],
            [
                7493,
                7496
            ],
            [
                7474,
                7482
            ],
            [
                7517,
                7519
            ],
            [
                7519,
                7562
            ],
            [
                7578,
                7602
            ],
            [
                7602,
                7625
            ],
            [
                7647,
                7649
            ],
            [
                7649,
                7682
            ],
            [
                7683,
                7684
            ],
            [
                7702,
                7705
            ],
            [
                7710,
                7715
            ],
            [
                7732,
                7743
            ],
            [
                7755,
                7757
            ],
            [
                7757,
                7773
            ],
            [
                7782,
                7787
            ],
            [
                7812,
                7814
            ],
            [
                7814,
                7829
            ],
            [
                7833,
                7835
            ],
            [
                8053,
                8103
            ],
            [
                8103,
                8129
            ],
            [
                8131,
                8150
            ],
            [
                8201,
                8260
            ],
            [
                8264,
                8279
            ],
            [
                8279,
                8302
            ],
            [
                8308,
                8330
            ],
            [
                8342,
                8401
            ],
            [
                8401,
                8448
            ],
            [
                8450,
                8481
            ],
            [
                8481,
                8535
            ],
            [
                8535,
                8570
            ],
            [
                8595,
                8704
            ],
            [
                8704,
                8766
            ],
            [
                8768,
                8783
            ],
            [
                8783,
                8807
            ],
            [
                8876,
                8940
            ],
            [
                8940,
                8952
            ],
            [
                8973,
                8978
            ],
            [
                8978,
                9021
            ],
            [
                9021,
                9034
            ],
            [
                9034,
                9073
            ],
            [
                9205,
                9222
            ],
            [
                9252,
                9253
            ],
            [
                9328,
                9358
            ],
            [
                9358,
                9368
            ],
            [
                9371,
                9380
            ],
            [
                9393,
                9421
            ],
            [
                9438,
                9458
            ],
            [
                9482,
                9537
            ],
            [
                9537,
                9538
            ],
            [
                9542,
                9549
            ],
            [
                9549,
                9563
            ],
            [
                9563,
                9615
            ],
            [
                9911,
                9925
            ],
            [
                9927,
                9938
            ],
            [
                9938,
                9952
            ],
            [
                9952,
                9983
            ],
            [
                9983,
                10020
            ],
            [
                10020,
                10036
            ],
            [
                10036,
                10072
            ],
            [
                10222,
                10223
            ],
            [
                10282,
                10326
            ],
            [
                10326,
                10346
            ],
            [
                10346,
                10369
            ],
            [
                10369,
                10384
            ],
            [
                10420,
                10472
            ],
            [
                10629,
                10656
            ],
            [
                10656,
                10690
            ],
            [
                10690,
                10728
            ],
            [
                10728,
                10754
            ],
            [
                10784,
                10790
            ],
            [
                10792,
                10830
            ],
            [
                10830,
                10842
            ],
            [
                10842,
                10860
            ],
            [
                10862,
                10878
            ],
            [
                10943,
                10946
            ],
            [
                10946,
                10950
            ],
            [
                10983,
                11006
            ],
            [
                10971,
                10976
            ],
            [
                11029,
                11032
            ],
            [
                11032,
                11062
            ],
            [
                11088,
                11090
            ],
            [
                11126,
                11156
            ],
            [
                11156,
                11187
            ],
            [
                11196,
                11201
            ],
            [
                11216,
                11218
            ],
            [
                11218,
                11263
            ],
            [
                11263,
                11285
            ],
            [
                11285,
                11358
            ],
            [
                11358,
                11383
            ],
            [
                11411,
                11428
            ],
            [
                11444,
                11448
            ],
            [
                11429,
                11433
            ],
            [
                11464,
                11466
            ],
            [
                11466,
                11481
            ],
            [
                11501,
                11509
            ],
            [
                11520,
                11523
            ],
            [
                11523,
                11551
            ],
            [
                11556,
                11567
            ],
            [
                11586,
                11622
            ],
            [
                11622,
                11662
            ],
            [
                11662,
                11677
            ],
            [
                11685,
                11710
            ],
            [
                11720,
                11733
            ],
            [
                11769,
                11779
            ],
            [
                11784,
                11804
            ],
            [
                11804,
                11838
            ],
            [
                11870,
                11920
            ],
            [
                11920,
                11966
            ],
            [
                11966,
                11999
            ],
            [
                11999,
                12044
            ],
            [
                12060,
                12081
            ],
            [
                12091,
                12113
            ],
            [
                12113,
                12119
            ],
            [
                12121,
                12124
            ],
            [
                12130,
                12132
            ],
            [
                12132,
                12186
            ],
            [
                12187,
                12218
            ],
            [
                12239,
                12258
            ],
            [
                12344,
                12345
            ],
            [
                12357,
                12382
            ],
            [
                12392,
                12394
            ],
            [
                12403,
                12426
            ],
            [
                12426,
                12503
            ],
            [
                12503,
                12505
            ],
            [
                12526,
                12561
            ],
            [
                12561,
                12687
            ],
            [
                12715,
                12716
            ],
            [
                12717,
                12774
            ],
            [
                12774,
                12820
            ],
            [
                12820,
                12860
            ],
            [
                12913,
                12937
            ],
            [
                12946,
                12960
            ],
            [
                12960,
                13005
            ],
            [
                13006,
                13015
            ],
            [
                13024,
                13076
            ],
            [
                13085,
                13094
            ],
            [
                13095,
                13116
            ],
            [
                13128,
                13131
            ],
            [
                13131,
                13203
            ],
            [
                13213,
                13238
            ],
            [
                13238,
                13271
            ],
            [
                13286,
                13338
            ],
            [
                13338,
                13415
            ],
            [
                13510,
                13517
            ],
            [
                13479,
                13490
            ],
            [
                13528,
                13539
            ],
            [
                13542,
                13544
            ],
            [
                13544,
                13623
            ],
            [
                13623,
                13657
            ],
            [
                13669,
                13671
            ],
            [
                13671,
                13743
            ],
            [
                13744,
                13767
            ],
            [
                13791,
                13793
            ],
            [
                13793,
                13810
            ],
            [
                13818,
                13861
            ],
            [
                13861,
                13928
            ],
            [
                14029,
                14034
            ],
            [
                14038,
                14079
            ],
            [
                14106,
                14108
            ],
            [
                14181,
                14204
            ],
            [
                14217,
                14251
            ],
            [
                14252,
                14261
            ],
            [
                14271,
                14279
            ],
            [
                14299,
                14301
            ],
            [
                14301,
                14380
            ],
            [
                14478,
                14501
            ],
            [
                14501,
                14512
            ],
            [
                14601,
                14602
            ],
            [
                14619,
                14626
            ],
            [
                14605,
                14616
            ],
            [
                14631,
                14646
            ],
            [
                14646,
                14669
            ],
            [
                14688,
                14732
            ],
            [
                14732,
                14804
            ],
            [
                14877,
                14888
            ],
            [
                14894,
                14904
            ],
            [
                14911,
                14982
            ],
            [
                14983,
                14994
            ],
            [
                14997,
                15037
            ],
            [
                15039,
                15073
            ],
            [
                15073,
                15159
            ],
            [
                15223,
                15225
            ],
            [
                15225,
                15246
            ],
            [
                15246,
                15324
            ],
            [
                15324,
                15421
            ],
            [
                15421,
                15459
            ],
            [
                15484,
                15488
            ],
            [
                15747,
                15777
            ],
            [
                15779,
                15814
            ],
            [
                15814,
                15842
            ],
            [
                15843,
                15868
            ],
            [
                15984,
                16008
            ],
            [
                16017,
                16067
            ],
            [
                16073,
                16112
            ],
            [
                16124,
                16140
            ],
            [
                16140,
                16176
            ],
            [
                16188,
                16191
            ],
            [
                16216,
                16221
            ],
            [
                16230,
                16232
            ],
            [
                16232,
                16312
            ],
            [
                16430,
                16458
            ],
            [
                16527,
                16578
            ],
            [
                16711,
                16719
            ],
            [
                16719,
                16721
            ],
            [
                16800,
                16801
            ],
            [
                16722,
                16763
            ],
            [
                16803,
                16838
            ],
            [
                17050,
                17063
            ],
            [
                17005,
                17008
            ],
            [
                16882,
                16884
            ],
            [
                16992,
                16993
            ],
            [
                17063,
                17064
            ],
            [
                17236,
                17326
            ],
            [
                17326,
                17408
            ],
            [
                17408,
                17498
            ],
            [
                17498,
                17590
            ],
            [
                17602,
                17668
            ],
            [
                17683,
                17735
            ],
            [
                17743,
                17781
            ]
        ],
        "row_chars": [
            [
                0,
                214
            ],
            [
                214,
                345
            ],
            [
                345,
                582
            ],
            [
                582,
                671
            ],
            [
                671,
                718
            ],
            [
                718,
                763
            ],
            [
                763,
                804
            ],
            [
                804,
                881
            ],
            [
                881,
                918
            ],
            [
                918,
                948
            ],
            [
                948,
                997
            ],
            [
                997,
                1018
            ],
            [
                1018,
                1061
            ],
            [
                1061,
                1149
            ],
            [
                1149,
                1168
            ],
            [
                1168,
                1230
            ],
            [
                1230,
                1312
            ],
            [
                1312,
                1341
            ],
            [
                1341,
                1369
            ],
            [
                1369,
                1414
            ],
            [
                1414,
                1429
            ],
            [
                1429,
                1548
            ],
            [
                1548,
                1618
            ],
            [
                1618,
                1650
            ],
            [
                1650,
                1686
            ],
            [
                1686,
                1811
            ],
            [
                1811,
                1891
            ],
            [
                1891,
                1923
            ],
            [
                1923,
                1951
            ],
            [
                1951,
                2035
            ],
            [
                2035,
                2066
            ],
            [
                2066,
                2096
            ],
            [
                2096,
                2129
            ],
            [
                2129,
                2167
            ],
            [
                2167,
                2195
            ],
            [
                2195,
                2233
            ],
            [
                2233,
                2327
            ],
            [
                2327,
                2396
            ],
            [
                2396,
                2449
            ],
            [
                2449,
                2696
            ],
            [
                2696,
                2793
            ],
            [
                2793,
                2909
            ],
            [
                2909,
                2968
            ],
            [
                2968,
                3041
            ],
            [
                3041,
                3067
            ],
            [
                3067,
                3085
            ],
            [
                3085,
                3106
            ],
            [
                3106,
                3194
            ],
            [
                3194,
                3265
            ],
            [
                3265,
                3328
            ],
            [
                3328,
                3368
            ],
            [
                3368,
                3420
            ],
            [
                3420,
                3467
            ],
            [
                3467,
                3488
            ],
            [
                3488,
                3547
            ],
            [
                3547,
                3569
            ],
            [
                3569,
                3735
            ],
            [
                3735,
                3855
            ],
            [
                3855,
                3918
            ],
            [
                3918,
                3985
            ],
            [
                3985,
                4031
            ],
            [
                4031,
                4117
            ],
            [
                4117,
                4169
            ],
            [
                4169,
                4250
            ],
            [
                4250,
                4376
            ],
            [
                4376,
                4506
            ],
            [
                4506,
                4626
            ],
            [
                4626,
                4709
            ],
            [
                4709,
                4770
            ],
            [
                4770,
                4857
            ],
            [
                4857,
                4897
            ],
            [
                4897,
                4944
            ],
            [
                4944,
                5036
            ],
            [
                5036,
                5140
            ],
            [
                5140,
                5173
            ],
            [
                5173,
                5194
            ],
            [
                5194,
                5216
            ],
            [
                5216,
                5240
            ],
            [
                5240,
                5380
            ],
            [
                5380,
                5418
            ],
            [
                5418,
                5450
            ],
            [
                5450,
                5505
            ],
            [
                5505,
                5544
            ],
            [
                5544,
                5613
            ],
            [
                5613,
                5718
            ],
            [
                5718,
                5756
            ],
            [
                5756,
                5830
            ],
            [
                5830,
                5859
            ],
            [
                5859,
                5906
            ],
            [
                5906,
                5947
            ],
            [
                5947,
                6059
            ],
            [
                6059,
                6121
            ],
            [
                6121,
                6181
            ],
            [
                6181,
                6297
            ],
            [
                6297,
                6325
            ],
            [
                6325,
                6494
            ],
            [
                6494,
                6688
            ],
            [
                6688,
                6773
            ],
            [
                6773,
                6822
            ],
            [
                6822,
                6867
            ],
            [
                6867,
                6976
            ],
            [
                6976,
                7106
            ],
            [
                7106,
                7215
            ],
            [
                7215,
                7331
            ],
            [
                7331,
                7372
            ],
            [
                7372,
                7410
            ],
            [
                7410,
                7519
            ],
            [
                7519,
                7602
            ],
            [
                7602,
                7649
            ],
            [
                7649,
                7683
            ],
            [
                7683,
                7705
            ],
            [
                7705,
                7757
            ],
            [
                7757,
                7814
            ],
            [
                7814,
                7835
            ],
            [
                7835,
                7936
            ],
            [
                7936,
                8045
            ],
            [
                8045,
                8103
            ],
            [
                8103,
                8150
            ],
            [
                8150,
                8201
            ],
            [
                8201,
                8279
            ],
            [
                8279,
                8401
            ],
            [
                8401,
                8481
            ],
            [
                8481,
                8535
            ],
            [
                8535,
                8704
            ],
            [
                8704,
                8783
            ],
            [
                8783,
                8807
            ],
            [
                8807,
                8840
            ],
            [
                8840,
                8876
            ],
            [
                8876,
                8940
            ],
            [
                8940,
                8978
            ],
            [
                8978,
                9021
            ],
            [
                9021,
                9034
            ],
            [
                9034,
                9074
            ],
            [
                9074,
                9125
            ],
            [
                9125,
                9205
            ],
            [
                9205,
                9254
            ],
            [
                9254,
                9290
            ],
            [
                9290,
                9358
            ],
            [
                9358,
                9371
            ],
            [
                9371,
                9458
            ],
            [
                9458,
                9537
            ],
            [
                9537,
                9549
            ],
            [
                9549,
                9563
            ],
            [
                9563,
                9615
            ],
            [
                9615,
                9663
            ],
            [
                9663,
                9685
            ],
            [
                9685,
                9720
            ],
            [
                9720,
                9753
            ],
            [
                9753,
                9791
            ],
            [
                9791,
                9821
            ],
            [
                9821,
                9872
            ],
            [
                9872,
                9911
            ],
            [
                9911,
                9938
            ],
            [
                9938,
                9952
            ],
            [
                9952,
                9983
            ],
            [
                9983,
                10020
            ],
            [
                10020,
                10036
            ],
            [
                10036,
                10072
            ],
            [
                10072,
                10105
            ],
            [
                10105,
                10130
            ],
            [
                10130,
                10188
            ],
            [
                10188,
                10222
            ],
            [
                10222,
                10326
            ],
            [
                10326,
                10346
            ],
            [
                10346,
                10369
            ],
            [
                10369,
                10384
            ],
            [
                10384,
                10420
            ],
            [
                10420,
                10475
            ],
            [
                10475,
                10498
            ],
            [
                10498,
                10604
            ],
            [
                10604,
                10628
            ],
            [
                10628,
                10656
            ],
            [
                10656,
                10690
            ],
            [
                10690,
                10728
            ],
            [
                10728,
                10830
            ],
            [
                10830,
                10842
            ],
            [
                10842,
                10946
            ],
            [
                10946,
                11032
            ],
            [
                11032,
                11090
            ],
            [
                11090,
                11126
            ],
            [
                11126,
                11156
            ],
            [
                11156,
                11218
            ],
            [
                11218,
                11263
            ],
            [
                11263,
                11285
            ],
            [
                11285,
                11358
            ],
            [
                11358,
                11383
            ],
            [
                11383,
                11411
            ],
            [
                11411,
                11466
            ],
            [
                11466,
                11523
            ],
            [
                11523,
                11567
            ],
            [
                11567,
                11586
            ],
            [
                11586,
                11622
            ],
            [
                11622,
                11662
            ],
            [
                11662,
                11804
            ],
            [
                11804,
                11920
            ],
            [
                11920,
                11966
            ],
            [
                11966,
                11999
            ],
            [
                11999,
                12081
            ],
            [
                12081,
                12113
            ],
            [
                12113,
                12132
            ],
            [
                12132,
                12187
            ],
            [
                12187,
                12346
            ],
            [
                12346,
                12426
            ],
            [
                12426,
                12503
            ],
            [
                12503,
                12561
            ],
            [
                12561,
                12717
            ],
            [
                12717,
                12774
            ],
            [
                12774,
                12820
            ],
            [
                12820,
                12860
            ],
            [
                12860,
                12887
            ],
            [
                12887,
                12913
            ],
            [
                12913,
                12960
            ],
            [
                12960,
                13006
            ],
            [
                13006,
                13095
            ],
            [
                13095,
                13131
            ],
            [
                13131,
                13238
            ],
            [
                13238,
                13271
            ],
            [
                13271,
                13338
            ],
            [
                13338,
                13544
            ],
            [
                13544,
                13623
            ],
            [
                13623,
                13671
            ],
            [
                13671,
                13793
            ],
            [
                13793,
                13861
            ],
            [
                13861,
                13928
            ],
            [
                13928,
                13953
            ],
            [
                13953,
                14001
            ],
            [
                14001,
                14029
            ],
            [
                14029,
                14108
            ],
            [
                14108,
                14181
            ],
            [
                14181,
                14252
            ],
            [
                14252,
                14301
            ],
            [
                14301,
                14381
            ],
            [
                14381,
                14478
            ],
            [
                14478,
                14501
            ],
            [
                14501,
                14513
            ],
            [
                14513,
                14601
            ],
            [
                14601,
                14646
            ],
            [
                14646,
                14732
            ],
            [
                14732,
                14804
            ],
            [
                14804,
                14845
            ],
            [
                14845,
                14983
            ],
            [
                14983,
                15073
            ],
            [
                15073,
                15225
            ],
            [
                15225,
                15246
            ],
            [
                15246,
                15324
            ],
            [
                15324,
                15421
            ],
            [
                15421,
                15814
            ],
            [
                15814,
                15868
            ],
            [
                15868,
                16140
            ],
            [
                16140,
                16232
            ],
            [
                16232,
                16312
            ],
            [
                16312,
                16430
            ],
            [
                16430,
                16719
            ],
            [
                16719,
                16838
            ],
            [
                16838,
                17065
            ],
            [
                17065,
                17152
            ],
            [
                17152,
                17197
            ],
            [
                17197,
                17236
            ],
            [
                17236,
                17326
            ],
            [
                17326,
                17408
            ],
            [
                17408,
                17498
            ],
            [
                17498,
                17781
            ]
        ]
    },
    "abridged": {
        "text": "Sir Felix was to start with Marie Melmotte for New York on the Thursday, and to go down to Liverpool on the Wednesday. There was no reason, he thought, why he should not enjoy himself to the last by seeing Ruby. The details of his journey had been settled between him and Marie, with help from Didon, in the garden of Grosvenor Square. Sir Felix had been astonished at the completeness of the preparations.\n\"Mind you go by the 5 p.m. train,\" Marie said. \"That will take you into Liverpool at 10.15. There's an hotel at the railway-station. Didon has got our tickets under the names of Madame and Mademoiselle Racine. We are to share a cabin. You must get yours tomorrow. She has found out that there is plenty of room.\"\n\"I'll be all right.\"\n\"Pray don't miss that train. We leave at 7 a.m. I shan't go to bed all night, so as to be sure to be in time. Robert will start a little earlier in the cab with my heavy box. What do you think is in it?\"\n\"Clothes,\" suggested Felix.\n\"My wedding dresses. Think of that! What a job to get them and nobody to know anything about it except Didon and the shop in Mount Street! And I shall have all my jewels. They'll go in our cab, then Didon and I follow in another cab. Nobody is ever up before nine, and I don't think we shall be interrupted.\"\n\"Won't your mother find out?\"\n\"I don't think she'd tell if she knew. Papa leads her such a life! Felix, I hope you won't be like that.\" She looked into his face, and thought that it would be impossible that he should be.\n\"I'm all right,\" said Felix, feeling very uncomfortable. This great effort of his life was drawing very near. There had been a pleasurable excitement in talking about running away with the heiress, but now that the deed had to be done, he almost wished that he had not undertaken it. And then if they should be wrong about the girl's fortune! He almost repented, but he had not the courage to withdraw.\n\"How about money though?\" he said hoarsely. \"I have only the two hundred pounds which your father paid me. I don't see why he should keep my money.\"\n\"Look here,\" said Marie. \"There is a cheque for two hundred and fifty pounds. I had money of my own enough for the tickets.\"\n\"Whose is this?\" said Felix, taking it.\n\"It is papa's cheque. Mamma gets ever so many of them to pay for things, but she gets so muddled that she doesn't know what she pays and what she doesn't.\" Felix saw that the cheque was payable to House or Bearer, and was signed by Augustus Melmotte. \"If you take it to the bank you'll get the money,\" said Marie. \"Or shall I send Didon, and give you the money on board the ship?\"\nFelix thought this over very anxiously. He would much prefer to have the money in his own pocket. But if he presented the cheque himself, might he be arrested for stealing Melmotte's money?\n\"I think Didon had better get the money,\" he said, \"and bring it to me tomorrow afternoon, to the club.\" If the money did not come he would not go down to Liverpool. \"You see,\" he said, \"I'm so much in the City that they might know me at the bank. And then I'll come on board on Thursday morning without looking for you.\"\n\"Oh dear, yes. And don't know us till we are out at sea. Won't it be fun when we are walking about on the deck and not speaking to one another! And, Felix; Didon has found that there is to be an American clergyman on board. I wonder whether he'd marry us. Won't that be jolly? Then, when we get to New York, we'll telegraph and write to papa, and be penitent and good. Of course he'll make the best of it.\"\n\"But he's so savage.\"\n\"Just for the moment. But I don't think he minds afterwards. He's always for making the best of everything. Things go wrong so often that he can't go on thinking of them for ever. It'll be all right in a month. I wonder how Lord Nidderdale will look when he hears that we've gone off. Do you know, Felix, that though we were engaged, he never once kissed me!\" Felix at this moment almost wished that he had never done so.\nThen they parted with the understanding that they were not to see each other again till they met on the boat. But Felix was determined that he would not stir unless Didon brought him the 250; and he almost hoped that she would not. Either she would be stopped at the bank, or she would run off with the money. Then he would be able to withdraw. He would do nothing till after Monday afternoon.\nShould he tell his mother that he was going? She had recommended him to run away with the girl, and must approve. She would understand the great expense of such a trip, and might perhaps give him some money. He determined that he would tell his mother, if Didon brought him the full amount for the cheque.\nHe walked into the Beargarden at four o'clock on the Monday, and found Didon standing in the hall. His heart sank. She made him a little curtsey, and handed him a fat envelope. He bade her wait a moment, and going into a side room counted the notes. The money was all there. Now he must certainly go to New York.\n\"It is all in order?\" whispered Didon when he returned. Sir Felix nodded, and she departed.\nYes; he must go. How should he dispose of his time before he went? Gambling was too dangerous: even he felt that. He would dine that night at the club, and in the evening go to his mother. On the Tuesday he would book his place for New York, and would spend the evening with Ruby at the Music Hall. On the Wednesday, he would start for Liverpool, according to his instructions. He felt annoyed that he had been so fully instructed. But should the affair turn out well, all the fellows would give him credit for the audacity with which he had carried off the heiress to America.\nAt ten o'clock he found his mother and Hetta in Welbeck Street.\n\"What; Felix?\" exclaimed Lady Carbury.\n\"Mother,\" he said, \"would you mind coming into the other room?\" Lady Carbury followed him. \"I've got something to tell you,\" he said.\n\"Good news?\" she asked, clasping her hands together.\n\"That's as may be. I'm going to take Marie off.\"\n\"Oh, Felix!\"\n\"You said it was the right thing to do - so I'm going to do it. But one wants such a lot of money for this kind of thing.\"\n\"When?\"\n\"Immediately. I wouldn't tell you till I had arranged everything. We're going to New York.\"\n\"To New York! But when will you be married?\"\n\"There will be a clergyman on board. It's all fixed. I wouldn't go without telling you.\"\n\"I will have your clothes got ready for you. When do you start?\"\n\"Wednesday afternoon.\"\n\"For New York! Oh, Felix, how will it be if he does not forgive her? You are going to risk it?\"\n\"I am going to take your advice.\" This was dreadful to the poor mother. \"There is money settled on Marie; money which he can't get back again.\"\n\"How much?\"\n\"She doesn't know; but a great deal.\"\n\"But the money can't be her own, Felix.\"\n\"Melmotte will find that it is. Marie knows what she's about. She's a great deal sharper than anyone would think. What can you do for me about money, mother?\"\n\"I have none, Felix.\"\n\"I thought you'd be sure to help me, as you wanted me so much to do it.\"\n\"That's not true, Felix. Oh, I am so sorry I ever said that! I have no money in the bank.\"\n\"They would let you overdraw 50 or 60.\"\n\"I will not starve myself and Hetta. You had ever so much money only lately. I will get some clothes for you, and pay for them if you cannot - but I have no money to give you.\"\n\"That's a blue look out,\" said he, \"just when 60 or 70 might make a fellow for life! You could borrow it from your friend Broune.\"\n\"I will do no such thing, Felix. 50 or 60 would make very little difference in such a trip as this. You have some money?\"\n\"Some; yes. But I'm so short that any little thing would help me.\"\nBefore the evening was over she gave him a cheque for 30. Then he went back to his club, even though he understood the danger. He could not bear the idea of going to bed quietly at home at half-past ten. He was very soon up in the card-room. He found nobody there, and went to the smoking-room, where Dolly Longestaffe and Miles Grendall were sitting silently together.\n\"Here's Carbury,\" said Dolly, waking suddenly into life. \"Now we can have a game at three-handed loo.\"\n\"Thank ye; not for me,\" said Sir Felix. \"I don't think I'll play tonight, old fellow. I hate three fellows sticking down together.\"\nMiles sat silently smoking his pipe, conscious of the baronet's dislike of playing with him.\n\"By-the-bye, Grendall.\" And Sir Felix in his most friendly tone whispered into his enemy's ear a request that some of the I.O.U.'s might be converted into cash.\n\"I must ask you to wait till next week,\" said Miles.\n\"It's always waiting till next week with you,\" said Sir Felix, getting up and speaking so that everyone in the room should hear. \"I wonder whether any fellow would buy these for five shillings in the pound?\" And he held up the scraps of paper. He had been drinking freely before he went up to Welbeck Street, and had just taken a glass of brandy.\n\"Don't let's have that kind of thing down here,\" said Dolly. \"If there is to be a row about cards, let it be in the card-room.\"\n\"Come into the card-room, then,\" said Sir Felix. \"Come up, now; and Dolly shall come and hear what you say.\"\nBut Miles objected. He was not going up into the card-room that night, as no one was going to play.\n\"How I do hate a row!\" said Dolly.\n\"Carbury likes a row,\" said Miles.\n\"I should like my money,\" said Sir Felix, walking out of the room.\nOn the next day he went into the City, and changed his mother's cheque. A gentleman behind the desk begged him to remind Lady Carbury that she was overdrawing her account.\n\"Dear, dear,\" said Sir Felix, as he pocketed the notes. \"I'm sure she was unaware of it.\" Then he paid for his passage from Liverpool to New York under the name of Walter Jones. This was on Tuesday. He dined again at the club, alone, and in the evening went to the Music Hall. There he remained from ten till nearly twelve, very angry at the non-appearance of Ruby Ruggles. As he smoked and drank in solitude, he decided that since she had broken her appointment everything would now be her fault. Whatever might happen to her, she could not blame him.\nHe went back to his club very cross, as brave as brandy could make him, and inclined to expose Miles Grendall if he had an opportunity. Up in the card-room he found all the usual men - except Miles. Nidderdale, Grasslough, Dolly, Paul Montague, and one or two others were there. Ready money was on the table; indeed the men at the Beargarden had become sick of I.O.U.'s, and they had been nearly all converted into money, excepting those of Miles Grendall. The committee had decided to take no more I.O.U.s.\nAt three o'clock in the morning, Sir Felix had lost over a hundred pounds in ready money. On the following night about one he had lost a further sum of two hundred pounds. The reader will remember that he should at that time have been in the hotel at Liverpool.\nBut Sir Felix, as he played on in the almost desperate hope of recovering the money which he needed, remembered how Fisker had played all night, and how he had left the club to catch the early train for Liverpool, and had gone on to New York without delay.",
        "paragraph_chars": [
            [
                0,
                407
            ],
            [
                407,
                720
            ],
            [
                720,
                741
            ],
            [
                741,
                945
            ],
            [
                945,
                973
            ],
            [
                973,
                1282
            ],
            [
                1282,
                1312
            ],
            [
                1312,
                1503
            ],
            [
                1503,
                1906
            ],
            [
                1906,
                2055
            ],
            [
                2055,
                2180
            ],
            [
                2180,
                2220
            ],
            [
                2220,
                2601
            ],
            [
                2601,
                2791
            ],
            [
                2791,
                3113
            ],
            [
                3113,
                3520
            ],
            [
                3520,
                3542
            ],
            [
                3542,
                3964
            ],
            [
                3964,
                4358
            ],
            [
                4358,
                4664
            ],
            [
                4664,
                4977
            ],
            [
                4977,
                5069
            ],
            [
                5069,
                5647
            ],
            [
                5647,
                5711
            ],
            [
                5711,
                5750
            ],
            [
                5750,
                5884
            ],
            [
                5884,
                5937
            ],
            [
                5937,
                5986
            ],
            [
                5986,
                5999
            ],
            [
                5999,
                6122
            ],
            [
                6122,
                6130
            ],
            [
                6130,
                6222
            ],
            [
                6222,
                6267
            ],
            [
                6267,
                6356
            ],
            [
                6356,
                6421
            ],
            [
                6421,
                6444
            ],
            [
                6444,
                6540
            ],
            [
                6540,
                6684
            ],
            [
                6684,
                6696
            ],
            [
                6696,
                6734
            ],
            [
                6734,
                6775
            ],
            [
                6775,
                6934
            ],
            [
                6934,
                6956
            ],
            [
                6956,
                7029
            ],
            [
                7029,
                7120
            ],
            [
                7120,
                7160
            ],
            [
                7160,
                7337
            ],
            [
                7337,
                7468
            ],
            [
                7468,
                7590
            ],
            [
                7590,
                7657
            ],
            [
                7657,
                8027
            ],
            [
                8027,
                8130
            ],
            [
                8130,
                8262
            ],
            [
                8262,
                8355
            ],
            [
                8355,
                8516
            ],
            [
                8516,
                8569
            ],
            [
                8569,
                8916
            ],
            [
                8916,
                9044
            ],
            [
                9044,
                9153
            ],
            [
                9153,
                9253
            ],
            [
                9253,
                9288
            ],
            [
                9288,
                9323
            ],
            [
                9323,
                9390
            ],
            [
                9390,
                9562
            ],
            [
                9562,
                10115
            ],
            [
                10115,
                10623
            ],
            [
                10623,
                10885
            ],
            [
                10885,
                11141
            ]
        ],
        "segment_chars": [
            [
                0,
                119
            ],
            [
                119,
                212
            ],
            [
                212,
                336
            ],
            [
                336,
                407
            ],
            [
                407,
                454
            ],
            [
                454,
                499
            ],
            [
                499,
                540
            ],
            [
                540,
                617
            ],
            [
                617,
                642
            ],
            [
                642,
                671
            ],
            [
                671,
                720
            ],
            [
                720,
                741
            ],
            [
                741,
                770
            ],
            [
                770,
                789
            ],
            [
                789,
                851
            ],
            [
                851,
                916
            ],
            [
                916,
                945
            ],
            [
                945,
                973
            ],
            [
                973,
                994
            ],
            [
                994,
                1009
            ],
            [
                1009,
                1112
            ],
            [
                1112,
                1144
            ],
            [
                1144,
                1207
            ],
            [
                1207,
                1282
            ],
            [
                1282,
                1312
            ],
            [
                1312,
                1351
            ],
            [
                1351,
                1379
            ],
            [
                1379,
                1418
            ],
            [
                1418,
                1503
            ],
            [
                1503,
                1560
            ],
            [
                1560,
                1613
            ],
            [
                1613,
                1787
            ],
            [
                1787,
                1846
            ],
            [
                1846,
                1906
            ],
            [
                1906,
                1932
            ],
            [
                1932,
                1950
            ],
            [
                1950,
                2013
            ],
            [
                2013,
                2055
            ],
            [
                2055,
                2080
            ],
            [
                2080,
                2133
            ],
            [
                2133,
                2180
            ],
            [
                2180,
                2197
            ],
            [
                2197,
                2220
            ],
            [
                2220,
                2242
            ],
            [
                2242,
                2376
            ],
            [
                2376,
                2471
            ],
            [
                2471,
                2534
            ],
            [
                2534,
                2601
            ],
            [
                2601,
                2641
            ],
            [
                2641,
                2699
            ],
            [
                2699,
                2791
            ],
            [
                2791,
                2896
            ],
            [
                2896,
                2957
            ],
            [
                2957,
                3039
            ],
            [
                3039,
                3113
            ],
            [
                3113,
                3128
            ],
            [
                3128,
                3170
            ],
            [
                3170,
                3257
            ],
            [
                3257,
                3337
            ],
            [
                3337,
                3369
            ],
            [
                3369,
                3390
            ],
            [
                3390,
                3482
            ],
            [
                3482,
                3520
            ],
            [
                3520,
                3542
            ],
            [
                3542,
                3564
            ],
            [
                3564,
                3603
            ],
            [
                3603,
                3650
            ],
            [
                3650,
                3722
            ],
            [
                3722,
                3753
            ],
            [
                3753,
                3827
            ],
            [
                3827,
                3902
            ],
            [
                3902,
                3964
            ],
            [
                3964,
                4074
            ],
            [
                4074,
                4196
            ],
            [
                4196,
                4274
            ],
            [
                4274,
                4309
            ],
            [
                4309,
                4358
            ],
            [
                4358,
                4403
            ],
            [
                4403,
                4472
            ],
            [
                4472,
                4566
            ],
            [
                4566,
                4664
            ],
            [
                4664,
                4763
            ],
            [
                4763,
                4779
            ],
            [
                4779,
                4841
            ],
            [
                4841,
                4914
            ],
            [
                4914,
                4939
            ],
            [
                4939,
                4977
            ],
            [
                4977,
                4999
            ],
            [
                4999,
                5033
            ],
            [
                5033,
                5069
            ],
            [
                5069,
                5086
            ],
            [
                5086,
                5136
            ],
            [
                5136,
                5183
            ],
            [
                5183,
                5258
            ],
            [
                5258,
                5368
            ],
            [
                5368,
                5447
            ],
            [
                5447,
                5501
            ],
            [
                5501,
                5647
            ],
            [
                5647,
                5711
            ],
            [
                5711,
                5726
            ],
            [
                5726,
                5750
            ],
            [
                5750,
                5814
            ],
            [
                5814,
                5841
            ],
            [
                5841,
                5884
            ],
            [
                5884,
                5897
            ],
            [
                5897,
                5937
            ],
            [
                5937,
                5956
            ],
            [
                5956,
                5986
            ],
            [
                5986,
                5999
            ],
            [
                5999,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6130
            ],
            [
                6130,
                6144
            ],
            [
                6144,
                6196
            ],
            [
                6196,
                6222
            ],
            [
                6222,
                6236
            ],
            [
                6236,
                6267
            ],
            [
                6267,
                6304
            ],
            [
                6304,
                6320
            ],
            [
                6320,
                6356
            ],
            [
                6356,
                6401
            ],
            [
                6401,
                6421
            ],
            [
                6421,
                6444
            ],
            [
                6444,
                6459
            ],
            [
                6459,
                6513
            ],
            [
                6513,
                6540
            ],
            [
                6540,
                6574
            ],
            [
                6574,
                6612
            ],
            [
                6612,
                6684
            ],
            [
                6684,
                6696
            ],
            [
                6696,
                6734
            ],
            [
                6734,
                6775
            ],
            [
                6775,
                6807
            ],
            [
                6807,
                6837
            ],
            [
                6837,
                6889
            ],
            [
                6889,
                6934
            ],
            [
                6934,
                6956
            ],
            [
                6956,
                7029
            ],
            [
                7029,
                7054
            ],
            [
                7054,
                7090
            ],
            [
                7090,
                7120
            ],
            [
                7120,
                7160
            ],
            [
                7160,
                7197
            ],
            [
                7197,
                7237
            ],
            [
                7237,
                7337
            ],
            [
                7337,
                7422
            ],
            [
                7422,
                7468
            ],
            [
                7468,
                7501
            ],
            [
                7501,
                7568
            ],
            [
                7568,
                7590
            ],
            [
                7590,
                7602
            ],
            [
                7602,
                7657
            ],
            [
                7657,
                7715
            ],
            [
                7715,
                7784
            ],
            [
                7784,
                7861
            ],
            [
                7861,
                7899
            ],
            [
                7899,
                8027
            ],
            [
                8027,
                8084
            ],
            [
                8084,
                8130
            ],
            [
                8130,
                8170
            ],
            [
                8170,
                8216
            ],
            [
                8216,
                8262
            ],
            [
                8262,
                8355
            ],
            [
                8355,
                8379
            ],
            [
                8379,
                8483
            ],
            [
                8483,
                8516
            ],
            [
                8516,
                8569
            ],
            [
                8569,
                8698
            ],
            [
                8698,
                8777
            ],
            [
                8777,
                8813
            ],
            [
                8813,
                8916
            ],
            [
                8916,
                8977
            ],
            [
                8977,
                9044
            ],
            [
                9044,
                9093
            ],
            [
                9093,
                9153
            ],
            [
                9153,
                9173
            ],
            [
                9173,
                9253
            ],
            [
                9253,
                9276
            ],
            [
                9276,
                9288
            ],
            [
                9288,
                9323
            ],
            [
                9323,
                9390
            ],
            [
                9390,
                9462
            ],
            [
                9462,
                9562
            ],
            [
                9562,
                9618
            ],
            [
                9618,
                9652
            ],
            [
                9652,
                9740
            ],
            [
                9740,
                9761
            ],
            [
                9761,
                9839
            ],
            [
                9839,
                9936
            ],
            [
                9936,
                10060
            ],
            [
                10060,
                10115
            ],
            [
                10115,
                10251
            ],
            [
                10251,
                10314
            ],
            [
                10314,
                10394
            ],
            [
                10394,
                10482
            ],
            [
                10482,
                10572
            ],
            [
                10572,
                10623
            ],
            [
                10623,
                10713
            ],
            [
                10713,
                10795
            ],
            [
                10795,
                10885
            ],
            [
                10885,
                11141
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                10,
                13
            ],
            [
                14,
                71
            ],
            [
                71,
                119
            ],
            [
                119,
                195
            ],
            [
                206,
                212
            ],
            [
                212,
                238
            ],
            [
                239,
                242
            ],
            [
                248,
                283
            ],
            [
                289,
                334
            ],
            [
                334,
                336
            ],
            [
                336,
                372
            ],
            [
                386,
                405
            ],
            [
                405,
                406
            ],
            [
                407,
                454
            ],
            [
                454,
                499
            ],
            [
                499,
                540
            ],
            [
                540,
                617
            ],
            [
                617,
                626
            ],
            [
                635,
                640
            ],
            [
                640,
                642
            ],
            [
                642,
                660
            ],
            [
                669,
                671
            ],
            [
                671,
                720
            ],
            [
                720,
                741
            ],
            [
                741,
                757
            ],
            [
                758,
                762
            ],
            [
                763,
                768
            ],
            [
                768,
                770
            ],
            [
                770,
                789
            ],
            [
                789,
                851
            ],
            [
                851,
                857
            ],
            [
                858,
                916
            ],
            [
                916,
                945
            ],
            [
                945,
                973
            ],
            [
                973,
                974
            ],
            [
                974,
                994
            ],
            [
                994,
                1009
            ],
            [
                1009,
                1085
            ],
            [
                1086,
                1112
            ],
            [
                1112,
                1144
            ],
            [
                1144,
                1154
            ],
            [
                1155,
                1165
            ],
            [
                1167,
                1207
            ],
            [
                1207,
                1213
            ],
            [
                1214,
                1216
            ],
            [
                1217,
                1221
            ],
            [
                1222,
                1231
            ],
            [
                1232,
                1282
            ],
            [
                1282,
                1312
            ],
            [
                1313,
                1351
            ],
            [
                1351,
                1379
            ],
            [
                1379,
                1384
            ],
            [
                1386,
                1417
            ],
            [
                1418,
                1428
            ],
            [
                1429,
                1503
            ],
            [
                1503,
                1558
            ],
            [
                1558,
                1560
            ],
            [
                1560,
                1613
            ],
            [
                1613,
                1663
            ],
            [
                1670,
                1691
            ],
            [
                1692,
                1699
            ],
            [
                1699,
                1732
            ],
            [
                1737,
                1787
            ],
            [
                1787,
                1846
            ],
            [
                1846,
                1864
            ],
            [
                1864,
                1895
            ],
            [
                1904,
                1905
            ],
            [
                1906,
                1932
            ],
            [
                1932,
                1949
            ],
            [
                1950,
                1957
            ],
            [
                1963,
                2011
            ],
            [
                2011,
                2013
            ],
            [
                2013,
                2052
            ],
            [
                2052,
                2055
            ],
            [
                2055,
                2078
            ],
            [
                2078,
                2080
            ],
            [
                2081,
                2133
            ],
            [
                2133,
                2180
            ],
            [
                2180,
                2181
            ],
            [
                2181,
                2197
            ],
            [
                2197,
                2215
            ],
            [
                2218,
                2220
            ],
            [
                2220,
                2242
            ],
            [
                2242,
                2276
            ],
            [
                2277,
                2291
            ],
            [
                2293,
                2316
            ],
            [
                2317,
                2376
            ],
            [
                2376,
                2381
            ],
            [
                2382,
                2390
            ],
            [
                2391,
                2401
            ],
            [
                2402,
                2437
            ],
            [
                2438,
                2471
            ],
            [
                2471,
                2534
            ],
            [
                2534,
                2601
            ],
            [
                2601,
                2614
            ],
            [
                2620,
                2624
            ],
            [
                2625,
                2641
            ],
            [
                2641,
                2699
            ],
            [
                2699,
                2702
            ],
            [
                2703,
                2737
            ],
            [
                2739,
                2744
            ],
            [
                2745,
                2747
            ],
            [
                2748,
                2790
            ],
            [
                2791,
                2861
            ],
            [
                2871,
                2896
            ],
            [
                2896,
                2955
            ],
            [
                2955,
                2957
            ],
            [
                2957,
                3037
            ],
            [
                3039,
                3086
            ],
            [
                3087,
                3113
            ],
            [
                3113,
                3126
            ],
            [
                3126,
                3128
            ],
            [
                3128,
                3145
            ],
            [
                3146,
                3170
            ],
            [
                3170,
                3193
            ],
            [
                3198,
                3257
            ],
            [
                3257,
                3268
            ],
            [
                3269,
                3284
            ],
            [
                3285,
                3337
            ],
            [
                3337,
                3367
            ],
            [
                3369,
                3390
            ],
            [
                3390,
                3395
            ],
            [
                3396,
                3459
            ],
            [
                3460,
                3462
            ],
            [
                3463,
                3480
            ],
            [
                3482,
                3520
            ],
            [
                3520,
                3539
            ],
            [
                3542,
                3543
            ],
            [
                3543,
                3547
            ],
            [
                3552,
                3564
            ],
            [
                3564,
                3603
            ],
            [
                3603,
                3648
            ],
            [
                3648,
                3650
            ],
            [
                3650,
                3679
            ],
            [
                3680,
                3682
            ],
            [
                3689,
                3711
            ],
            [
                3712,
                3715
            ],
            [
                3720,
                3722
            ],
            [
                3722,
                3751
            ],
            [
                3751,
                3753
            ],
            [
                3753,
                3827
            ],
            [
                3827,
                3874
            ],
            [
                3874,
                3902
            ],
            [
                3902,
                3963
            ],
            [
                3964,
                4063
            ],
            [
                4064,
                4074
            ],
            [
                4074,
                4121
            ],
            [
                4122,
                4150
            ],
            [
                4151,
                4169
            ],
            [
                4170,
                4175
            ],
            [
                4176,
                4196
            ],
            [
                4196,
                4215
            ],
            [
                4216,
                4223
            ],
            [
                4224,
                4235
            ],
            [
                4235,
                4272
            ],
            [
                4272,
                4274
            ],
            [
                4274,
                4298
            ],
            [
                4307,
                4309
            ],
            [
                4309,
                4358
            ],
            [
                4358,
                4403
            ],
            [
                4407,
                4410
            ],
            [
                4411,
                4462
            ],
            [
                4463,
                4470
            ],
            [
                4470,
                4472
            ],
            [
                4476,
                4492
            ],
            [
                4493,
                4496
            ],
            [
                4497,
                4502
            ],
            [
                4503,
                4544
            ],
            [
                4559,
                4566
            ],
            [
                4566,
                4609
            ],
            [
                4609,
                4619
            ],
            [
                4628,
                4631
            ],
            [
                4636,
                4640
            ],
            [
                4648,
                4664
            ],
            [
                4664,
                4693
            ],
            [
                4694,
                4728
            ],
            [
                4729,
                4763
            ],
            [
                4763,
                4777
            ],
            [
                4777,
                4779
            ],
            [
                4779,
                4813
            ],
            [
                4814,
                4824
            ],
            [
                4825,
                4826
            ],
            [
                4827,
                4830
            ],
            [
                4831,
                4839
            ],
            [
                4839,
                4841
            ],
            [
                4841,
                4884
            ],
            [
                4890,
                4914
            ],
            [
                4914,
                4937
            ],
            [
                4937,
                4939
            ],
            [
                4943,
                4976
            ],
            [
                4977,
                4978
            ],
            [
                4996,
                4999
            ],
            [
                5009,
                5014
            ],
            [
                5020,
                5031
            ],
            [
                5031,
                5033
            ],
            [
                5033,
                5049
            ],
            [
                5049,
                5054
            ],
            [
                5067,
                5069
            ],
            [
                5069,
                5084
            ],
            [
                5084,
                5086
            ],
            [
                5086,
                5136
            ],
            [
                5136,
                5162
            ],
            [
                5164,
                5183
            ],
            [
                5183,
                5242
            ],
            [
                5243,
                5258
            ],
            [
                5258,
                5281
            ],
            [
                5287,
                5309
            ],
            [
                5309,
                5368
            ],
            [
                5368,
                5415
            ],
            [
                5416,
                5447
            ],
            [
                5447,
                5501
            ],
            [
                5501,
                5536
            ],
            [
                5538,
                5647
            ],
            [
                5647,
                5709
            ],
            [
                5711,
                5726
            ],
            [
                5726,
                5750
            ],
            [
                5750,
                5814
            ],
            [
                5814,
                5826
            ],
            [
                5836,
                5841
            ],
            [
                5841,
                5884
            ],
            [
                5884,
                5897
            ],
            [
                5897,
                5936
            ],
            [
                5937,
                5954
            ],
            [
                5954,
                5955
            ],
            [
                5956,
                5986
            ],
            [
                5986,
                5996
            ],
            [
                5999,
                6008
            ],
            [
                6009,
                6037
            ],
            [
                6043,
                6063
            ],
            [
                6067,
                6122
            ],
            [
                6122,
                6123
            ],
            [
                6123,
                6130
            ],
            [
                6130,
                6144
            ],
            [
                6144,
                6196
            ],
            [
                6196,
                6210
            ],
            [
                6211,
                6222
            ],
            [
                6222,
                6236
            ],
            [
                6236,
                6267
            ],
            [
                6267,
                6304
            ],
            [
                6304,
                6320
            ],
            [
                6320,
                6356
            ],
            [
                6356,
                6357
            ],
            [
                6357,
                6401
            ],
            [
                6401,
                6421
            ],
            [
                6421,
                6444
            ],
            [
                6444,
                6459
            ],
            [
                6459,
                6511
            ],
            [
                6513,
                6540
            ],
            [
                6540,
                6574
            ],
            [
                6574,
                6612
            ],
            [
                6612,
                6638
            ],
            [
                6639,
                6645
            ],
            [
                6646,
                6684
            ],
            [
                6684,
                6696
            ],
            [
                6696,
                6714
            ],
            [
                6715,
                6731
            ],
            [
                6731,
                6734
            ],
            [
                6734,
                6738
            ],
            [
                6743,
                6766
            ],
            [
                6767,
                6772
            ],
            [
                6772,
                6775
            ],
            [
                6775,
                6805
            ],
            [
                6805,
                6807
            ],
            [
                6807,
                6837
            ],
            [
                6837,
                6868
            ],
            [
                6876,
                6881
            ],
            [
                6887,
                6889
            ],
            [
                6889,
                6934
            ],
            [
                6934,
                6956
            ],
            [
                6956,
                7029
            ],
            [
                7029,
                7054
            ],
            [
                7054,
                7071
            ],
            [
                7074,
                7078
            ],
            [
                7084,
                7088
            ],
            [
                7088,
                7090
            ],
            [
                7090,
                7105
            ],
            [
                7109,
                7117
            ],
            [
                7117,
                7120
            ],
            [
                7120,
                7148
            ],
            [
                7149,
                7160
            ],
            [
                7161,
                7197
            ],
            [
                7197,
                7237
            ],
            [
                7237,
                7252
            ],
            [
                7261,
                7286
            ],
            [
                7287,
                7300
            ],
            [
                7303,
                7313
            ],
            [
                7317,
                7337
            ],
            [
                7337,
                7371
            ],
            [
                7372,
                7422
            ],
            [
                7422,
                7468
            ],
            [
                7468,
                7501
            ],
            [
                7501,
                7546
            ],
            [
                7547,
                7568
            ],
            [
                7568,
                7590
            ],
            [
                7590,
                7596
            ],
            [
                7597,
                7600
            ],
            [
                7600,
                7602
            ],
            [
                7602,
                7656
            ],
            [
                7657,
                7688
            ],
            [
                7694,
                7713
            ],
            [
                7713,
                7714
            ],
            [
                7720,
                7745
            ],
            [
                7758,
                7760
            ],
            [
                7761,
                7784
            ],
            [
                7784,
                7861
            ],
            [
                7861,
                7863
            ],
            [
                7864,
                7899
            ],
            [
                7899,
                8025
            ],
            [
                8025,
                8026
            ],
            [
                8027,
                8084
            ],
            [
                8084,
                8130
            ],
            [
                8130,
                8170
            ],
            [
                8170,
                8194
            ],
            [
                8202,
                8216
            ],
            [
                8216,
                8261
            ],
            [
                8262,
                8271
            ],
            [
                8281,
                8333
            ],
            [
                8345,
                8354
            ],
            [
                8355,
                8376
            ],
            [
                8376,
                8379
            ],
            [
                8379,
                8451
            ],
            [
                8460,
                8483
            ],
            [
                8483,
                8516
            ],
            [
                8517,
                8569
            ],
            [
                8569,
                8646
            ],
            [
                8656,
                8663
            ],
            [
                8673,
                8684
            ],
            [
                8685,
                8696
            ],
            [
                8696,
                8698
            ],
            [
                8698,
                8777
            ],
            [
                8777,
                8811
            ],
            [
                8811,
                8813
            ],
            [
                8813,
                8885
            ],
            [
                8891,
                8914
            ],
            [
                8914,
                8916
            ],
            [
                8916,
                8933
            ],
            [
                8934,
                8977
            ],
            [
                8977,
                9044
            ],
            [
                9044,
                9049
            ],
            [
                9050,
                9091
            ],
            [
                9091,
                9093
            ],
            [
                9094,
                9117
            ],
            [
                9118,
                9152
            ],
            [
                9153,
                9162
            ],
            [
                9163,
                9171
            ],
            [
                9171,
                9173
            ],
            [
                9173,
                9252
            ],
            [
                9253,
                9276
            ],
            [
                9276,
                9287
            ],
            [
                9288,
                9289
            ],
            [
                9289,
                9296
            ],
            [
                9297,
                9308
            ],
            [
                9308,
                9323
            ],
            [
                9323,
                9346
            ],
            [
                9346,
                9390
            ],
            [
                9390,
                9462
            ],
            [
                9462,
                9473
            ],
            [
                9474,
                9484
            ],
            [
                9490,
                9561
            ],
            [
                9562,
                9573
            ],
            [
                9576,
                9616
            ],
            [
                9618,
                9652
            ],
            [
                9652,
                9738
            ],
            [
                9738,
                9740
            ],
            [
                9740,
                9761
            ],
            [
                9761,
                9839
            ],
            [
                9839,
                9936
            ],
            [
                9936,
                9974
            ],
            [
                9983,
                9987
            ],
            [
                9994,
                10024
            ],
            [
                10025,
                10060
            ],
            [
                10060,
                10088
            ],
            [
                10090,
                10115
            ],
            [
                10115,
                10139
            ],
            [
                10140,
                10190
            ],
            [
                10191,
                10230
            ],
            [
                10235,
                10251
            ],
            [
                10251,
                10287
            ],
            [
                10294,
                10297
            ],
            [
                10307,
                10312
            ],
            [
                10312,
                10314
            ],
            [
                10314,
                10394
            ],
            [
                10394,
                10422
            ],
            [
                10424,
                10475
            ],
            [
                10476,
                10482
            ],
            [
                10482,
                10484
            ],
            [
                10484,
                10485
            ],
            [
                10495,
                10536
            ],
            [
                10537,
                10572
            ],
            [
                10572,
                10585
            ],
            [
                10586,
                10589
            ],
            [
                10598,
                10600
            ],
            [
                10615,
                10616
            ],
            [
                10617,
                10618
            ],
            [
                10623,
                10713
            ],
            [
                10713,
                10795
            ],
            [
                10795,
                10885
            ],
            [
                10885,
                10977
            ],
            [
                10978,
                11044
            ],
            [
                11050,
                11102
            ],
            [
                11103,
                11141
            ]
        ],
        "row_chars": [
            [
                0,
                119
            ],
            [
                119,
                212
            ],
            [
                212,
                336
            ],
            [
                336,
                407
            ],
            [
                407,
                454
            ],
            [
                454,
                499
            ],
            [
                499,
                540
            ],
            [
                540,
                617
            ],
            [
                617,
                642
            ],
            [
                642,
                671
            ],
            [
                671,
                720
            ],
            [
                720,
                741
            ],
            [
                741,
                770
            ],
            [
                770,
                770
            ],
            [
                770,
                789
            ],
            [
                789,
                851
            ],
            [
                851,
                916
            ],
            [
                916,
                945
            ],
            [
                945,
                973
            ],
            [
                973,
                994
            ],
            [
                994,
                1009
            ],
            [
                1009,
                1112
            ],
            [
                1112,
                1112
            ],
            [
                1112,
                1144
            ],
            [
                1144,
                1144
            ],
            [
                1144,
                1207
            ],
            [
                1207,
                1282
            ],
            [
                1282,
                1282
            ],
            [
                1282,
                1282
            ],
            [
                1282,
                1282
            ],
            [
                1282,
                1282
            ],
            [
                1282,
                1312
            ],
            [
                1312,
                1312
            ],
            [
                1312,
                1351
            ],
            [
                1351,
                1379
            ],
            [
                1379,
                1418
            ],
            [
                1418,
                1503
            ],
            [
                1503,
                1560
            ],
            [
                1560,
                1613
            ],
            [
                1613,
                1787
            ],
            [
                1787,
                1787
            ],
            [
                1787,
                1787
            ],
            [
                1787,
                1846
            ],
            [
                1846,
                1906
            ],
            [
                1906,
                1932
            ],
            [
                1932,
                1950
            ],
            [
                1950,
                1950
            ],
            [
                1950,
                2013
            ],
            [
                2013,
                2055
            ],
            [
                2055,
                2080
            ],
            [
                2080,
                2080
            ],
            [
                2080,
                2133
            ],
            [
                2133,
                2180
            ],
            [
                2180,
                2197
            ],
            [
                2197,
                2220
            ],
            [
                2220,
                2242
            ],
            [
                2242,
                2376
            ],
            [
                2376,
                2471
            ],
            [
                2471,
                2534
            ],
            [
                2534,
                2601
            ],
            [
                2601,
                2641
            ],
            [
                2641,
                2699
            ],
            [
                2699,
                2699
            ],
            [
                2699,
                2699
            ],
            [
                2699,
                2791
            ],
            [
                2791,
                2896
            ],
            [
                2896,
                2957
            ],
            [
                2957,
                3039
            ],
            [
                3039,
                3039
            ],
            [
                3039,
                3113
            ],
            [
                3113,
                3128
            ],
            [
                3128,
                3170
            ],
            [
                3170,
                3257
            ],
            [
                3257,
                3337
            ],
            [
                3337,
                3369
            ],
            [
                3369,
                3369
            ],
            [
                3369,
                3390
            ],
            [
                3390,
                3390
            ],
            [
                3390,
                3482
            ],
            [
                3482,
                3520
            ],
            [
                3520,
                3542
            ],
            [
                3542,
                3564
            ],
            [
                3564,
                3603
            ],
            [
                3603,
                3650
            ],
            [
                3650,
                3722
            ],
            [
                3722,
                3753
            ],
            [
                3753,
                3827
            ],
            [
                3827,
                3827
            ],
            [
                3827,
                3827
            ],
            [
                3827,
                3827
            ],
            [
                3827,
                3902
            ],
            [
                3902,
                3964
            ],
            [
                3964,
                3964
            ],
            [
                3964,
                4074
            ],
            [
                4074,
                4074
            ],
            [
                4074,
                4196
            ],
            [
                4196,
                4274
            ],
            [
                4274,
                4309
            ],
            [
                4309,
                4358
            ],
            [
                4358,
                4403
            ],
            [
                4403,
                4472
            ],
            [
                4472,
                4566
            ],
            [
                4566,
                4664
            ],
            [
                4664,
                4763
            ],
            [
                4763,
                4779
            ],
            [
                4779,
                4779
            ],
            [
                4779,
                4841
            ],
            [
                4841,
                4914
            ],
            [
                4914,
                4939
            ],
            [
                4939,
                4977
            ],
            [
                4977,
                4999
            ],
            [
                4999,
                5033
            ],
            [
                5033,
                5069
            ],
            [
                5069,
                5086
            ],
            [
                5086,
                5086
            ],
            [
                5086,
                5086
            ],
            [
                5086,
                5136
            ],
            [
                5136,
                5183
            ],
            [
                5183,
                5183
            ],
            [
                5183,
                5258
            ],
            [
                5258,
                5368
            ],
            [
                5368,
                5447
            ],
            [
                5447,
                5501
            ],
            [
                5501,
                5647
            ],
            [
                5647,
                5726
            ],
            [
                5726,
                5750
            ],
            [
                5750,
                5750
            ],
            [
                5750,
                5750
            ],
            [
                5750,
                5814
            ],
            [
                5814,
                5841
            ],
            [
                5841,
                5884
            ],
            [
                5884,
                5897
            ],
            [
                5897,
                5937
            ],
            [
                5937,
                5937
            ],
            [
                5937,
                5937
            ],
            [
                5937,
                5956
            ],
            [
                5956,
                5956
            ],
            [
                5956,
                5986
            ],
            [
                5986,
                5999
            ],
            [
                5999,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6130
            ],
            [
                6130,
                6144
            ],
            [
                6144,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6196
            ],
            [
                6196,
                6222
            ],
            [
                6222,
                6236
            ],
            [
                6236,
                6267
            ],
            [
                6267,
                6304
            ],
            [
                6304,
                6320
            ],
            [
                6320,
                6356
            ],
            [
                6356,
                6356
            ],
            [
                6356,
                6356
            ],
            [
                6356,
                6356
            ],
            [
                6356,
                6356
            ],
            [
                6356,
                6401
            ],
            [
                6401,
                6421
            ],
            [
                6421,
                6444
            ],
            [
                6444,
                6459
            ],
            [
                6459,
                6459
            ],
            [
                6459,
                6513
            ],
            [
                6513,
                6513
            ],
            [
                6513,
                6513
            ],
            [
                6513,
                6513
            ],
            [
                6513,
                6540
            ],
            [
                6540,
                6574
            ],
            [
                6574,
                6612
            ],
            [
                6612,
                6684
            ],
            [
                6684,
                6696
            ],
            [
                6696,
                6734
            ],
            [
                6734,
                6775
            ],
            [
                6775,
                6807
            ],
            [
                6807,
                6807
            ],
            [
                6807,
                6837
            ],
            [
                6837,
                6889
            ],
            [
                6889,
                6934
            ],
            [
                6934,
                6956
            ],
            [
                6956,
                7029
            ],
            [
                7029,
                7054
            ],
            [
                7054,
                7054
            ],
            [
                7054,
                7090
            ],
            [
                7090,
                7120
            ],
            [
                7120,
                7160
            ],
            [
                7160,
                7160
            ],
            [
                7160,
                7197
            ],
            [
                7197,
                7237
            ],
            [
                7237,
                7337
            ],
            [
                7337,
                7422
            ],
            [
                7422,
                7468
            ],
            [
                7468,
                7501
            ],
            [
                7501,
                7568
            ],
            [
                7568,
                7590
            ],
            [
                7590,
                7602
            ],
            [
                7602,
                7657
            ],
            [
                7657,
                7715
            ],
            [
                7715,
                7784
            ],
            [
                7784,
                7861
            ],
            [
                7861,
                7899
            ],
            [
                7899,
                8027
            ],
            [
                8027,
                8084
            ],
            [
                8084,
                8130
            ],
            [
                8130,
                8170
            ],
            [
                8170,
                8170
            ],
            [
                8170,
                8170
            ],
            [
                8170,
                8216
            ],
            [
                8216,
                8262
            ],
            [
                8262,
                8355
            ],
            [
                8355,
                8379
            ],
            [
                8379,
                8483
            ],
            [
                8483,
                8516
            ],
            [
                8516,
                8569
            ],
            [
                8569,
                8698
            ],
            [
                8698,
                8777
            ],
            [
                8777,
                8813
            ],
            [
                8813,
                8916
            ],
            [
                8916,
                8977
            ],
            [
                8977,
                9044
            ],
            [
                9044,
                9044
            ],
            [
                9044,
                9044
            ],
            [
                9044,
                9044
            ],
            [
                9044,
                9093
            ],
            [
                9093,
                9093
            ],
            [
                9093,
                9153
            ],
            [
                9153,
                9173
            ],
            [
                9173,
                9253
            ],
            [
                9253,
                9253
            ],
            [
                9253,
                9276
            ],
            [
                9276,
                9288
            ],
            [
                9288,
                9288
            ],
            [
                9288,
                9323
            ],
            [
                9323,
                9390
            ],
            [
                9390,
                9462
            ],
            [
                9462,
                9462
            ],
            [
                9462,
                9562
            ],
            [
                9562,
                9652
            ],
            [
                9652,
                9740
            ],
            [
                9740,
                9761
            ],
            [
                9761,
                9839
            ],
            [
                9839,
                9936
            ],
            [
                9936,
                10060
            ],
            [
                10060,
                10115
            ],
            [
                10115,
                10251
            ],
            [
                10251,
                10314
            ],
            [
                10314,
                10394
            ],
            [
                10394,
                10394
            ],
            [
                10394,
                10482
            ],
            [
                10482,
                10572
            ],
            [
                10572,
                10623
            ],
            [
                10623,
                10623
            ],
            [
                10623,
                10623
            ],
            [
                10623,
                10623
            ],
            [
                10623,
                10713
            ],
            [
                10713,
                10795
            ],
            [
                10795,
                10885
            ],
            [
                10885,
                11141
            ]
        ]
    }
}