{
    "original": {
        "text": "Paul Montague reached London on his return from Suffolk early on the Monday morning, and on the following day he wrote to Mrs. Hurtle. As he sat in his lodgings, thinking of his condition, he almost wished that he had taken Melmotte's offer and gone to Mexico. He might at any rate have endeavoured to promote the railway earnestly, and then have abandoned it if he found the whole thing false. In such case of course he would never have seen Hetta Carbury again; but, as things were, of what use to him was his love,--of what use to him or to her? The kind of life of which he dreamed, such a life in England as was that of Roger Carbury, or, as such life would be, if Roger had a wife whom he loved, seemed to be far beyond his reach. Nobody was like Roger Carbury! Would it not be well that he should go away, and, as he went, write to Hetta and bid her marry the best man that ever lived in the world?\nBut the journey to Mexico was no longer open to him. He had repudiated the proposition and had quarrelled with Melmotte. It was necessary that he should immediately take some further step in regard to Mrs. Hurtle. Twice lately he had gone to Islington determined that he would see that lady for the last time. Then he had taken her to Lowestoft, and had been equally firm in his resolution that he would there put an end to his present bonds. Now he had promised to go again to Islington;--and was aware that if he failed to keep his promise, she would come to him. In this way there would never be an end to it.\nHe would certainly go again, as he had promised,--if she should still require it; but he would first try what a letter would do,--a plain unvarnished tale. Might it still be possible that a plain tale sent by post should have sufficient efficacy? This was his plain tale as he now told it.\nTuesday, 2nd July, 1873.\nMY DEAR MRS. HURTLE,--\nI promised that I would go to you again in Islington, and so I will, if you still require it. But I think that such a meeting can be of no service to either of us. What is to be gained? I do not for a moment mean to justify my own conduct. It is not to be justified. When I met you on our journey hither from San Francisco, I was charmed with your genius, your beauty, and your character. They are now what I found them to be then. But circumstances have made our lives and temperaments so far different, that I am certain that, were we married, we should not make each other happy. Of course the fault was mine; but it is better to own that fault, and to take all the blame,--and the evil consequences, let them be what they may,--\nto be shot, for instance, like the gentleman in Oregon,--\nthan to be married with the consciousness that even at the very moment of the ceremony, such marriage will be a matter of sorrow and repentance. As soon as my mind was made up on this I wrote to you. I can not,--I dare not,--blame you for the step you have since taken. But I can only adhere to the resolution I then expressed.\nThe first day I saw you here in London you asked me whether I was attached to another woman. I could answer you only by the truth. But I should not of my own accord have spoken to you of altered affections. It was after I had resolved to break my engagement with you that I first knew this girl. It was not because I had come to love her that I broke it. I have no grounds whatever for hoping that my love will lead to any results.\nI have now told you as exactly as I can the condition of my mind. If it were possible for me in any way to compensate the injury I have done you,--or even to undergo retribution for it,--I would do so. But what compensation can be given, or what retribution can you exact? I think that our further meeting can avail nothing. But if, after this, you wish me to come again, I will come for the last time,--because I have promised.\nYour most sincere friend,\nPAUL MONTAGUE.\nMrs. Hurtle, as she read this, was torn in two ways. All that Paul had written was in accordance with the words written by herself on a scrap of paper which she still kept in her own pocket. Those words, fairly transcribed on a sheet of note-paper, would be the most generous and the fittest answer she could give. And she longed to be generous. She had all a woman's natural desire to sacrifice herself. But the sacrifice which would have been most to her taste would have been of another kind. Had she found him ruined and penniless she would have delighted to share with him all that she possessed. Had she found him a cripple, or blind, or miserably struck with some disease, she would have stayed by him and have nursed him and given him comfort. Even had he been disgraced she would have fled with him to some far country and have pardoned all his faults. No sacrifice would have been too much for her that would have been accompanied by a feeling that he appreciated all that she was doing for him, and that she was loved in return. But to sacrifice herself by going away and never more being heard of, was too much for her! What woman can endure such sacrifice as that? To give up not only her love, but her wrath also;--that was too much for her! The idea of being tame was terrible to her. Her life had not been very prosperous, but she was what she was because she had dared to protect herself by her own spirit. Now, at last, should she succumb and be trodden on like a worm? Should she be weaker even than an English girl? Should she allow him to have amused himself with her love, to have had \"a good time,\" and then to roam away like a bee, while she was so dreadfully scorched, so mutilated and punished! Had not her whole life been opposed to the theory of such passive endurance? She took out the scrap of paper and read it; and, in spite of all, she felt that there was a feminine softness in it that gratified her.\nBut no;--she could not send it. She could not even copy the words. And so she gave play to all her strongest feelings on the other side,--being in truth torn in two directions. Then she sat herself down to her desk, and with rapid words, and flashing thoughts, wrote as follows:--\nPAUL MONTAGUE,--\nI have suffered many injuries, but of all injuries this is the worst and most unpardonable,--and the most unmanly. Surely there never was such a coward, never so false a liar. The poor wretch that I destroyed was mad with liquor and was only acting after his kind. Even Caradoc Hurtle never premeditated such wrong as this. What;--you are to bind yourself to me by the most solemn obligation that can join a man and a woman together, and then tell me,--when they have affected my whole life,--that they are to go for nothing, because they do not suit your view of things? On thinking over it, you find that an American wife would not make you so comfortable as some English girl;--and therefore it is all to go for nothing! I have no brother, no man near me;--or you would not dare to do this. You can not but be a coward.\nYou talk of compensation! Do you mean money? You do not dare to say so, but you must mean it. It is an insult the more. But as to retribution; yes. You shall suffer retribution. I desire you to come to me,--according to your promise,--and you will find me with a horsewhip in my hand. I will whip you till I have not a breath in my body. And then I will see what you will dare to do;--whether you will drag me into a court of law for the assault.\nYes; come. You shall come. And now you know the welcome you shall find. I will buy the whip while this is reaching you, and you shall find that I know how to choose such a weapon. I call upon you to come. But should you be afraid and break your promise, I will come to you. I will make London too hot to hold you;--and if I do not find you I will go with my story to every friend you have.\nI have now told you as exactly as I can the condition of my mind.\nWINIFRID HURTLE.\nHaving written this she again read the short note, and again gave way to violent tears. But on that day she sent no letter. On the following morning she wrote a third, and sent that. This was the third letter:--\nYes. Come.\nW. H.\nThis letter duly reached Paul Montague at his lodgings. He started immediately for Islington. He had now no desire to delay the meeting. He had at any rate taught her that his gentleness towards her, his going to the play with her, and drinking tea with her at Mrs. Pipkin's, and his journey with her to the sea, were not to be taken as evidence that he was gradually being conquered. He had declared his purpose plainly enough at Lowestoft,--and plainly enough in his last letter. She had told him down at the hotel, that had she by chance have been armed at the moment, she would have shot him. She could arm herself now if she pleased;--but his real fear had not lain in that direction. The pang consisted in having to assure her that he was resolved to do her wrong. The worst of that was now over.\nThe door was opened for him by Ruby, who by no means greeted him with a happy countenance. It was the second morning after the night of her imprisonment; and nothing had occurred to alleviate her woe. At this very moment her lover should have been in Liverpool, but he was, in fact, abed in Welbeck Street. \"Yes, sir; she's at home,\" said Ruby, with a baby in her arms and a little child hanging on to her dress. \"Don't pull so, Sally. Please, sir, is Sir Felix still in London?\" Ruby had written to Sir Felix the very night of her imprisonment, but had not as yet received any reply. Paul, whose mind was altogether intent on his own troubles, declared that at present he knew nothing about Sir Felix, and was then shown into Mrs. Hurtle's room.\n[Illustration: The door was opened for him by Ruby.]\n\"So you have come,\" she said, without rising from her chair.\n\"Of course I came, when you desired it.\"\n\"I don't know why you should. My wishes do not seem to affect you much. Will you sit down there,\" she said, pointing to a seat at some distance from herself. \"So you think it would be best that you and I should never see each other again?\" She was very calm; but it seemed to him that the quietness was assumed, and that at any moment it might be converted into violence. He thought that there was that in her eye which seemed to foretell the spring of the wild-cat.\n\"I did think so certainly. What more can I say?\"\n\"Oh, nothing; clearly nothing.\" Her voice was very low. \"Why should a gentleman trouble himself to say any more,--than that he has changed his mind? Why make a fuss about such little things as a woman's life, or a woman's heart?\" Then she paused. \"And having come, in consequence of my unreasonable request, of course you are wise to hold your peace.\"\n\"I came because I promised.\"\n\"But you did not promise to speak;--did you?\"\n\"What would you have me say?\"\n\"Ah what! Am I to be so weak as to tell you now what I would have you say? Suppose you were to say, 'I am a gentleman, and a man of my word, and I repent me of my intended perfidy,' do you not think you might get your release that way? Might it not be possible that I should reply that as your heart was gone from me, your hand might go after it;--that I scorned to be the wife of a man who did not want me?\" As she asked this she gradually raised her voice, and half lifted herself in her seat, stretching herself towards him.\n\"You might indeed,\" he replied, not well knowing what to say.\n\"But I should not. I at least will be true. I should take you, Paul,--still take you; with a confidence that I should yet win you to me by my devotion. I have still some kindness of feeling towards you,--none to that woman who is I suppose younger than I, and gentler, and a maid.\" She still looked as though she expected a reply, but there was nothing to be said in answer to this. \"Now that you are going to leave me, Paul, is there any advice you can give me, as to what I shall do next? I have given up every friend in the world for you. I have no home. Mrs. Pipkin's room here is more my home than any other spot on the earth. I have all the world to choose from, but no reason whatever for a choice. I have my property. What shall I do with it, Paul? If I could die and be no more heard of, you should be welcome to it.\" There was no answer possible to all this. The questions were asked because there was no answer possible. \"You might at any rate advise me. Paul, you are in some degree responsible,--are you not,--for my loneliness?\"\n\"I am. But you know that I cannot answer your questions.\"\n\"You cannot wonder that I should be somewhat in doubt as to my future life. As far as I can see, I had better remain here. I do good at any rate to Mrs. Pipkin. She went into hysterics yesterday when I spoke of leaving her. That woman, Paul, would starve in our country, and I shall be desolate in this.\" Then she paused, and there was absolute silence for a minute. \"You thought my letter very short; did you not?\"\n\"It said, I suppose, all you had to say.\"\n\"No, indeed. I did have much more to say. That was the third letter I wrote. Now you shall see the other two. I wrote three, and had to choose which I would send you. I fancy that yours to me was easier written than either one of mine. You had no doubts, you know. I had many doubts. I could not send them all by post, together. But you may see them all now. There is one. You may read that first. While I was writing it, I was determined that that should go.\" Then she handed him the sheet of paper which contained the threat of the horsewhip.\n\"I am glad you did not send that,\" he said.\n\"I meant it.\"\n\"But you have changed your mind?\"\n\"Is there anything in it that seems to you to be unreasonable? Speak out and tell me.\"\n\"I am thinking of you, not of myself.\"\n\"Think of me, then. Is there anything said there which the usage to which I have been subjected does not justify?\"\n\"You ask me questions which I cannot answer. I do not think that under any provocation a woman should use a horsewhip.\"\n\"It is certainly more comfortable for gentlemen,--who amuse themselves,--that women should have that opinion. But, upon my word, I don't know what to say about that. As long as there are men to fight for women, it may be well to leave the fighting to the men. But when a woman has no one to help her, is she to bear everything without turning upon those who ill-use her? Shall a woman be flayed alive because it is unfeminine in her to fight for her own skin? What is the good of being--feminine, as you call it? Have you asked yourself that? That men may be attracted, I should say. But if a woman finds that men only take advantage of her assumed weakness, shall she not throw it off? If she be treated as prey, shall she not fight as a beast of prey? Oh, no;--it is so unfeminine! I also, Paul, had thought of that. The charm of womanly weakness presented itself to my mind in a soft moment,--and then I wrote this other letter. You may as well see them all.\" And so she handed him the scrap which had been written at Lowestoft, and he read that also.\nHe could hardly finish it, because of the tears which filled his eyes. But, having mastered its contents, he came across the room and threw himself on his knees at her feet, sobbing. \"I have not sent it, you know,\" she said. \"I only show it you that you may see how my mind has been at work.\"\n\"It hurts me more than the other,\" he replied.\n\"Nay, I would not hurt you,--not at this moment. Sometimes I feel that I could tear you limb from limb, so great is my disappointment, so ungovernable my rage! Why,--why should I be such a victim? Why should life be an utter blank to me, while you have everything before you? There, you have seen them all. Which will you have?\"\n\"I cannot now take that other as the expression of your mind.\"\n\"But it will be when you have left me;--and was when you were with me at the sea-side. And it was so I felt when I got your first letter in San Francisco. Why should you kneel there? You do not love me. A man should kneel to a woman for love, not for pardon.\" But though she spoke thus, she put her hand upon his forehead, and pushed back his hair, and looked into his face. \"I wonder whether that other woman loves you. I do not want an answer, Paul. I suppose you had better go.\" She took his hand and pressed it to her breast. \"Tell me one thing. When you spoke of--compensation, did you mean--money?\"\n\"No; indeed no.\"\n\"I hope not;--I hope not that. Well, there;--go. You shall be troubled no more with Winifrid Hurtle.\" She took the sheet of paper which contained the threat of the horsewhip and tore it into scraps.\n\"And am I to keep the other?\" he asked.\n\"No. For what purpose would you have it? To prove my weakness? That also shall be destroyed.\" But she took it and restored it to her pocket-book.\n\"Good-bye, my friend,\" he said.\n\"Nay! This parting will not bear a farewell. Go, and let there be no other word spoken.\" And so he went.\nAs soon as the front door was closed behind him she rang the bell and begged Ruby to ask Mrs. Pipkin to come to her. \"Mrs. Pipkin,\" she said, as soon as the woman had entered the room; \"everything is over between me and Mr. Montague.\" She was standing upright in the middle of the room, and as she spoke there was a smile on her face.\n\"Lord a' mercy,\" said Mrs. Pipkin, holding up both her hands.\n\"As I have told you that I was to be married to him, I think it right now to tell you that I'm not going to be married to him.\"\n\"And why not?--and he such a nice young man,--and quiet too.\"\n\"As to the why not, I don't know that I am prepared to speak about that. But it is so. I was engaged to him.\"\n\"I'm well sure of that, Mrs. Hurtle.\"\n\"And now I'm no longer engaged to him. That's all.\"\n\"Dearie me! and you going down to Lowestoft with him, and all.\" Mrs. Pipkin could not bear to think that she should hear no more of such an interesting story.\n\"We did go down to Lowestoft together, and we both came back,--not together. And there's an end of it.\"\n\"I'm sure it's not your fault, Mrs. Hurtle. When a marriage is to be, and doesn't come off, it never is the lady's fault.\"\n\"There's an end of it, Mrs. Pipkin. If you please, we won't say anything more about it.\"\n\"And are you going to leave, ma'am?\" said Mrs. Pipkin, prepared to have her apron up to her eyes at a moment's notice. Where should she get such another lodger as Mrs. Hurtle,--a lady who not only did not inquire about victuals, but who was always suggesting that the children should eat this pudding or finish that pie, and who had never questioned an item in a bill since she had been in the house!\n\"We'll say nothing about that yet, Mrs. Pipkin.\" Then Mrs. Pipkin gave utterance to so many assurances of sympathy and help that it almost seemed that she was prepared to guarantee to her lodger another lover in lieu of the one who was now dismissed.",
        "paragraph_chars": [
            [
                0,
                906
            ],
            [
                906,
                1519
            ],
            [
                1519,
                1809
            ],
            [
                1809,
                1834
            ],
            [
                1834,
                1857
            ],
            [
                1857,
                2590
            ],
            [
                2590,
                2648
            ],
            [
                2648,
                2976
            ],
            [
                2976,
                3408
            ],
            [
                3408,
                3837
            ],
            [
                3837,
                3863
            ],
            [
                3863,
                3878
            ],
            [
                3878,
                5813
            ],
            [
                5813,
                6094
            ],
            [
                6094,
                6111
            ],
            [
                6111,
                6934
            ],
            [
                6934,
                7381
            ],
            [
                7381,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7854
            ],
            [
                7854,
                8066
            ],
            [
                8066,
                8077
            ],
            [
                8077,
                8083
            ],
            [
                8083,
                8886
            ],
            [
                8886,
                9633
            ],
            [
                9633,
                9686
            ],
            [
                9686,
                9747
            ],
            [
                9747,
                9788
            ],
            [
                9788,
                10255
            ],
            [
                10255,
                10304
            ],
            [
                10304,
                10656
            ],
            [
                10656,
                10685
            ],
            [
                10685,
                10731
            ],
            [
                10731,
                10761
            ],
            [
                10761,
                11289
            ],
            [
                11289,
                11351
            ],
            [
                11351,
                12394
            ],
            [
                12394,
                12452
            ],
            [
                12452,
                12868
            ],
            [
                12868,
                12910
            ],
            [
                12910,
                13455
            ],
            [
                13455,
                13499
            ],
            [
                13499,
                13513
            ],
            [
                13513,
                13547
            ],
            [
                13547,
                13634
            ],
            [
                13634,
                13673
            ],
            [
                13673,
                13788
            ],
            [
                13788,
                13908
            ],
            [
                13908,
                14963
            ],
            [
                14963,
                15256
            ],
            [
                15256,
                15303
            ],
            [
                15303,
                15632
            ],
            [
                15632,
                15695
            ],
            [
                15695,
                16300
            ],
            [
                16300,
                16317
            ],
            [
                16317,
                16516
            ],
            [
                16516,
                16556
            ],
            [
                16556,
                16702
            ],
            [
                16702,
                16734
            ],
            [
                16734,
                16839
            ],
            [
                16839,
                17174
            ],
            [
                17174,
                17236
            ],
            [
                17236,
                17364
            ],
            [
                17364,
                17426
            ],
            [
                17426,
                17536
            ],
            [
                17536,
                17574
            ],
            [
                17574,
                17626
            ],
            [
                17626,
                17785
            ],
            [
                17785,
                17889
            ],
            [
                17889,
                18012
            ],
            [
                18012,
                18101
            ],
            [
                18101,
                18502
            ],
            [
                18502,
                18752
            ]
        ],
        "segment_chars": [
            [
                0,
                135
            ],
            [
                135,
                261
            ],
            [
                261,
                395
            ],
            [
                395,
                549
            ],
            [
                549,
                737
            ],
            [
                737,
                768
            ],
            [
                768,
                906
            ],
            [
                906,
                959
            ],
            [
                959,
                1027
            ],
            [
                1027,
                1120
            ],
            [
                1120,
                1216
            ],
            [
                1216,
                1349
            ],
            [
                1349,
                1472
            ],
            [
                1472,
                1519
            ],
            [
                1519,
                1675
            ],
            [
                1675,
                1766
            ],
            [
                1766,
                1809
            ],
            [
                1809,
                1834
            ],
            [
                1834,
                1857
            ],
            [
                1857,
                1951
            ],
            [
                1951,
                2021
            ],
            [
                2021,
                2043
            ],
            [
                2043,
                2097
            ],
            [
                2097,
                2124
            ],
            [
                2124,
                2246
            ],
            [
                2246,
                2289
            ],
            [
                2289,
                2440
            ],
            [
                2440,
                2590
            ],
            [
                2590,
                2648
            ],
            [
                2648,
                2793
            ],
            [
                2793,
                2848
            ],
            [
                2848,
                2918
            ],
            [
                2918,
                2976
            ],
            [
                2976,
                3069
            ],
            [
                3069,
                3107
            ],
            [
                3107,
                3183
            ],
            [
                3183,
                3272
            ],
            [
                3272,
                3331
            ],
            [
                3331,
                3408
            ],
            [
                3408,
                3474
            ],
            [
                3474,
                3610
            ],
            [
                3610,
                3681
            ],
            [
                3681,
                3733
            ],
            [
                3733,
                3837
            ],
            [
                3837,
                3863
            ],
            [
                3863,
                3878
            ],
            [
                3878,
                3931
            ],
            [
                3931,
                4069
            ],
            [
                4069,
                4193
            ],
            [
                4193,
                4224
            ],
            [
                4224,
                4283
            ],
            [
                4283,
                4374
            ],
            [
                4374,
                4480
            ],
            [
                4480,
                4630
            ],
            [
                4630,
                4740
            ],
            [
                4740,
                4918
            ],
            [
                4918,
                5010
            ],
            [
                5010,
                5056
            ],
            [
                5056,
                5134
            ],
            [
                5134,
                5178
            ],
            [
                5178,
                5302
            ],
            [
                5302,
                5366
            ],
            [
                5366,
                5414
            ],
            [
                5414,
                5599
            ],
            [
                5599,
                5676
            ],
            [
                5676,
                5813
            ],
            [
                5813,
                5845
            ],
            [
                5845,
                5880
            ],
            [
                5880,
                5990
            ],
            [
                5990,
                6094
            ],
            [
                6094,
                6111
            ],
            [
                6111,
                6226
            ],
            [
                6226,
                6287
            ],
            [
                6287,
                6376
            ],
            [
                6376,
                6435
            ],
            [
                6435,
                6683
            ],
            [
                6683,
                6835
            ],
            [
                6835,
                6905
            ],
            [
                6905,
                6934
            ],
            [
                6934,
                6960
            ],
            [
                6960,
                6979
            ],
            [
                6979,
                7028
            ],
            [
                7028,
                7054
            ],
            [
                7054,
                7082
            ],
            [
                7082,
                7112
            ],
            [
                7112,
                7219
            ],
            [
                7219,
                7272
            ],
            [
                7272,
                7381
            ],
            [
                7381,
                7392
            ],
            [
                7392,
                7408
            ],
            [
                7408,
                7453
            ],
            [
                7453,
                7561
            ],
            [
                7561,
                7586
            ],
            [
                7586,
                7655
            ],
            [
                7655,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7854
            ],
            [
                7854,
                7942
            ],
            [
                7942,
                7978
            ],
            [
                7978,
                8037
            ],
            [
                8037,
                8066
            ],
            [
                8066,
                8071
            ],
            [
                8071,
                8077
            ],
            [
                8077,
                8083
            ],
            [
                8083,
                8139
            ],
            [
                8139,
                8177
            ],
            [
                8177,
                8220
            ],
            [
                8220,
                8468
            ],
            [
                8468,
                8565
            ],
            [
                8565,
                8680
            ],
            [
                8680,
                8773
            ],
            [
                8773,
                8854
            ],
            [
                8854,
                8886
            ],
            [
                8886,
                8977
            ],
            [
                8977,
                9087
            ],
            [
                9087,
                9193
            ],
            [
                9193,
                9299
            ],
            [
                9299,
                9322
            ],
            [
                9322,
                9366
            ],
            [
                9366,
                9471
            ],
            [
                9471,
                9633
            ],
            [
                9633,
                9686
            ],
            [
                9686,
                9747
            ],
            [
                9747,
                9788
            ],
            [
                9788,
                9818
            ],
            [
                9818,
                9860
            ],
            [
                9860,
                9946
            ],
            [
                9946,
                10028
            ],
            [
                10028,
                10160
            ],
            [
                10160,
                10255
            ],
            [
                10255,
                10282
            ],
            [
                10282,
                10304
            ],
            [
                10304,
                10336
            ],
            [
                10336,
                10360
            ],
            [
                10360,
                10453
            ],
            [
                10453,
                10534
            ],
            [
                10534,
                10551
            ],
            [
                10551,
                10656
            ],
            [
                10656,
                10685
            ],
            [
                10685,
                10731
            ],
            [
                10731,
                10761
            ],
            [
                10761,
                10771
            ],
            [
                10771,
                10836
            ],
            [
                10836,
                10997
            ],
            [
                10997,
                11170
            ],
            [
                11170,
                11289
            ],
            [
                11289,
                11351
            ],
            [
                11351,
                11370
            ],
            [
                11370,
                11395
            ],
            [
                11395,
                11503
            ],
            [
                11503,
                11633
            ],
            [
                11633,
                11734
            ],
            [
                11734,
                11842
            ],
            [
                11842,
                11893
            ],
            [
                11893,
                11909
            ],
            [
                11909,
                11983
            ],
            [
                11983,
                12057
            ],
            [
                12057,
                12077
            ],
            [
                12077,
                12108
            ],
            [
                12108,
                12178
            ],
            [
                12178,
                12220
            ],
            [
                12220,
                12283
            ],
            [
                12283,
                12317
            ],
            [
                12317,
                12394
            ],
            [
                12394,
                12401
            ],
            [
                12401,
                12452
            ],
            [
                12452,
                12528
            ],
            [
                12528,
                12575
            ],
            [
                12575,
                12613
            ],
            [
                12613,
                12676
            ],
            [
                12676,
                12757
            ],
            [
                12757,
                12819
            ],
            [
                12819,
                12868
            ],
            [
                12868,
                12910
            ],
            [
                12910,
                12923
            ],
            [
                12923,
                12952
            ],
            [
                12952,
                12987
            ],
            [
                12987,
                13020
            ],
            [
                13020,
                13077
            ],
            [
                13077,
                13146
            ],
            [
                13146,
                13175
            ],
            [
                13175,
                13194
            ],
            [
                13194,
                13239
            ],
            [
                13239,
                13269
            ],
            [
                13269,
                13283
            ],
            [
                13283,
                13308
            ],
            [
                13308,
                13371
            ],
            [
                13371,
                13455
            ],
            [
                13455,
                13499
            ],
            [
                13499,
                13513
            ],
            [
                13513,
                13547
            ],
            [
                13547,
                13610
            ],
            [
                13610,
                13634
            ],
            [
                13634,
                13673
            ],
            [
                13673,
                13693
            ],
            [
                13693,
                13788
            ],
            [
                13788,
                13833
            ],
            [
                13833,
                13908
            ],
            [
                13908,
                14018
            ],
            [
                14018,
                14074
            ],
            [
                14074,
                14168
            ],
            [
                14168,
                14279
            ],
            [
                14279,
                14368
            ],
            [
                14368,
                14421
            ],
            [
                14421,
                14451
            ],
            [
                14451,
                14492
            ],
            [
                14492,
                14595
            ],
            [
                14595,
                14662
            ],
            [
                14662,
                14692
            ],
            [
                14692,
                14727
            ],
            [
                14727,
                14840
            ],
            [
                14840,
                14871
            ],
            [
                14871,
                14963
            ],
            [
                14963,
                15034
            ],
            [
                15034,
                15146
            ],
            [
                15146,
                15188
            ],
            [
                15188,
                15256
            ],
            [
                15256,
                15303
            ],
            [
                15303,
                15352
            ],
            [
                15352,
                15463
            ],
            [
                15463,
                15500
            ],
            [
                15500,
                15579
            ],
            [
                15579,
                15610
            ],
            [
                15610,
                15632
            ],
            [
                15632,
                15695
            ],
            [
                15695,
                15782
            ],
            [
                15782,
                15850
            ],
            [
                15850,
                15878
            ],
            [
                15878,
                15898
            ],
            [
                15898,
                15955
            ],
            [
                15955,
                16070
            ],
            [
                16070,
                16116
            ],
            [
                16116,
                16147
            ],
            [
                16147,
                16177
            ],
            [
                16177,
                16225
            ],
            [
                16225,
                16245
            ],
            [
                16245,
                16300
            ],
            [
                16300,
                16317
            ],
            [
                16317,
                16348
            ],
            [
                16348,
                16366
            ],
            [
                16366,
                16419
            ],
            [
                16419,
                16516
            ],
            [
                16516,
                16546
            ],
            [
                16546,
                16556
            ],
            [
                16556,
                16561
            ],
            [
                16561,
                16597
            ],
            [
                16597,
                16619
            ],
            [
                16619,
                16650
            ],
            [
                16650,
                16702
            ],
            [
                16702,
                16734
            ],
            [
                16734,
                16740
            ],
            [
                16740,
                16779
            ],
            [
                16779,
                16823
            ],
            [
                16823,
                16839
            ],
            [
                16839,
                16956
            ],
            [
                16956,
                17074
            ],
            [
                17074,
                17174
            ],
            [
                17174,
                17236
            ],
            [
                17236,
                17364
            ],
            [
                17364,
                17426
            ],
            [
                17426,
                17499
            ],
            [
                17499,
                17513
            ],
            [
                17513,
                17536
            ],
            [
                17536,
                17574
            ],
            [
                17574,
                17613
            ],
            [
                17613,
                17626
            ],
            [
                17626,
                17638
            ],
            [
                17638,
                17690
            ],
            [
                17690,
                17785
            ],
            [
                17785,
                17862
            ],
            [
                17862,
                17889
            ],
            [
                17889,
                17933
            ],
            [
                17933,
                18012
            ],
            [
                18012,
                18048
            ],
            [
                18048,
                18101
            ],
            [
                18101,
                18138
            ],
            [
                18138,
                18220
            ],
            [
                18220,
                18502
            ],
            [
                18502,
                18551
            ],
            [
                18551,
                18752
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                43,
                88
            ],
            [
                92,
                135
            ],
            [
                189,
                261
            ],
            [
                395,
                397
            ],
            [
                403,
                407
            ],
            [
                418,
                496
            ],
            [
                504,
                516
            ],
            [
                547,
                549
            ],
            [
                549,
                585
            ],
            [
                702,
                737
            ],
            [
                794,
                816
            ],
            [
                830,
                862
            ],
            [
                753,
                766
            ],
            [
                863,
                891
            ],
            [
                906,
                959
            ],
            [
                959,
                961
            ],
            [
                997,
                1027
            ],
            [
                1252,
                1255
            ],
            [
                1104,
                1118
            ],
            [
                1250,
                1251
            ],
            [
                1353,
                1393
            ],
            [
                1118,
                1119
            ],
            [
                1049,
                1051
            ],
            [
                1410,
                1471
            ],
            [
                1519,
                1527
            ],
            [
                1538,
                1540
            ],
            [
                1599,
                1604
            ],
            [
                1614,
                1619
            ],
            [
                1605,
                1613
            ],
            [
                1620,
                1646
            ],
            [
                1649,
                1675
            ],
            [
                1766,
                1809
            ],
            [
                1834,
                1854
            ],
            [
                1857,
                1880
            ],
            [
                1884,
                1951
            ],
            [
                1951,
                1995
            ],
            [
                2004,
                2021
            ],
            [
                2021,
                2043
            ],
            [
                2043,
                2051
            ],
            [
                2065,
                2097
            ],
            [
                2097,
                2124
            ],
            [
                2124,
                2153
            ],
            [
                2161,
                2246
            ],
            [
                2289,
                2346
            ],
            [
                2351,
                2440
            ],
            [
                2440,
                2532
            ],
            [
                2534,
                2537
            ],
            [
                2542,
                2559
            ],
            [
                2590,
                2644
            ],
            [
                2648,
                2666
            ],
            [
                2690,
                2694
            ],
            [
                2736,
                2793
            ],
            [
                2848,
                2849
            ],
            [
                2879,
                2904
            ],
            [
                2911,
                2918
            ],
            [
                2918,
                2942
            ],
            [
                2947,
                2957
            ],
            [
                2974,
                2976
            ],
            [
                2976,
                3069
            ],
            [
                3069,
                3107
            ],
            [
                3183,
                3272
            ],
            [
                3272,
                3331
            ],
            [
                3331,
                3408
            ],
            [
                3408,
                3474
            ],
            [
                3474,
                3553
            ],
            [
                3555,
                3557
            ],
            [
                3563,
                3565
            ],
            [
                3574,
                3585
            ],
            [
                3592,
                3593
            ],
            [
                3595,
                3610
            ],
            [
                3681,
                3733
            ],
            [
                3733,
                3739
            ],
            [
                3753,
                3809
            ],
            [
                3812,
                3837
            ],
            [
                3837,
                3863
            ],
            [
                3863,
                3878
            ],
            [
                3878,
                3917
            ],
            [
                3929,
                3931
            ],
            [
                3931,
                4056
            ],
            [
                4061,
                4069
            ],
            [
                4069,
                4080
            ],
            [
                4127,
                4193
            ],
            [
                4193,
                4224
            ],
            [
                4224,
                4283
            ],
            [
                4374,
                4377
            ],
            [
                4392,
                4398
            ],
            [
                4507,
                4521
            ],
            [
                4556,
                4595
            ],
            [
                4611,
                4630
            ],
            [
                4740,
                4785
            ],
            [
                4861,
                4868
            ],
            [
                4840,
                4851
            ],
            [
                4884,
                4887
            ],
            [
                4901,
                4917
            ],
            [
                4918,
                4956
            ],
            [
                4988,
                5000
            ],
            [
                5010,
                5056
            ],
            [
                5056,
                5093
            ],
            [
                5100,
                5104
            ],
            [
                5132,
                5134
            ],
            [
                5134,
                5178
            ],
            [
                5250,
                5257
            ],
            [
                5275,
                5302
            ],
            [
                5302,
                5365
            ],
            [
                5676,
                5720
            ],
            [
                5778,
                5792
            ],
            [
                5798,
                5812
            ],
            [
                5813,
                5819
            ],
            [
                5822,
                5845
            ],
            [
                5880,
                5890
            ],
            [
                5999,
                6002
            ],
            [
                6011,
                6015
            ],
            [
                6027,
                6032
            ],
            [
                6074,
                6079
            ],
            [
                6080,
                6091
            ],
            [
                6094,
                6107
            ],
            [
                6111,
                6188
            ],
            [
                6217,
                6226
            ],
            [
                6226,
                6287
            ],
            [
                6376,
                6380
            ],
            [
                6381,
                6435
            ],
            [
                6435,
                6440
            ],
            [
                6442,
                6491
            ],
            [
                6503,
                6561
            ],
            [
                6564,
                6601
            ],
            [
                6604,
                6683
            ],
            [
                6835,
                6869
            ],
            [
                6871,
                6904
            ],
            [
                6934,
                6960
            ],
            [
                6960,
                6979
            ],
            [
                7028,
                7043
            ],
            [
                7052,
                7054
            ],
            [
                7054,
                7082
            ],
            [
                7082,
                7112
            ],
            [
                7112,
                7138
            ],
            [
                7141,
                7166
            ],
            [
                7169,
                7219
            ],
            [
                7219,
                7272
            ],
            [
                7272,
                7291
            ],
            [
                7319,
                7326
            ],
            [
                7297,
                7313
            ],
            [
                7336,
                7381
            ],
            [
                7381,
                7392
            ],
            [
                7412,
                7453
            ],
            [
                7586,
                7655
            ],
            [
                7655,
                7694
            ],
            [
                7696,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7842
            ],
            [
                7846,
                7854
            ],
            [
                7854,
                7942
            ],
            [
                7942,
                7978
            ],
            [
                7978,
                8037
            ],
            [
                8037,
                8063
            ],
            [
                8066,
                8071
            ],
            [
                8071,
                8077
            ],
            [
                8077,
                8083
            ],
            [
                8083,
                8094
            ],
            [
                8100,
                8139
            ],
            [
                8139,
                8175
            ],
            [
                8188,
                8220
            ],
            [
                8468,
                8503
            ],
            [
                8523,
                8524
            ],
            [
                8526,
                8529
            ],
            [
                8680,
                8701
            ],
            [
                8706,
                8721
            ],
            [
                8723,
                8726
            ],
            [
                8569,
                8572
            ],
            [
                8702,
                8705
            ],
            [
                8573,
                8577
            ],
            [
                8812,
                8854
            ],
            [
                8854,
                8875
            ],
            [
                8880,
                8886
            ],
            [
                8886,
                8926
            ],
            [
                8975,
                8977
            ],
            [
                8977,
                9087
            ],
            [
                9087,
                9116
            ],
            [
                9155,
                9158
            ],
            [
                9134,
                9136
            ],
            [
                9174,
                9192
            ],
            [
                9193,
                9299
            ],
            [
                9322,
                9366
            ],
            [
                9366,
                9395
            ],
            [
                9430,
                9443
            ],
            [
                9451,
                9471
            ],
            [
                9471,
                9475
            ],
            [
                9531,
                9544
            ],
            [
                9556,
                9596
            ],
            [
                9602,
                9633
            ],
            [
                9686,
                9747
            ],
            [
                9747,
                9788
            ],
            [
                9788,
                9818
            ],
            [
                9818,
                9860
            ],
            [
                9869,
                9877
            ],
            [
                9944,
                9946
            ],
            [
                9947,
                10028
            ],
            [
                10028,
                10086
            ],
            [
                10126,
                10131
            ],
            [
                10109,
                10122
            ],
            [
                10150,
                10160
            ],
            [
                10160,
                10175
            ],
            [
                10194,
                10201
            ],
            [
                10208,
                10255
            ],
            [
                10255,
                10270
            ],
            [
                10280,
                10282
            ],
            [
                10282,
                10304
            ],
            [
                10304,
                10308
            ],
            [
                10318,
                10336
            ],
            [
                10336,
                10360
            ],
            [
                10360,
                10415
            ],
            [
                10418,
                10453
            ],
            [
                10453,
                10533
            ],
            [
                10731,
                10761
            ],
            [
                10761,
                10764
            ],
            [
                10769,
                10771
            ],
            [
                10836,
                10914
            ],
            [
                10918,
                10997
            ],
            [
                10997,
                11041
            ],
            [
                11109,
                11170
            ],
            [
                11170,
                11255
            ],
            [
                11287,
                11289
            ],
            [
                11289,
                11306
            ],
            [
                11351,
                11355
            ],
            [
                11370,
                11395
            ],
            [
                11395,
                11403
            ],
            [
                11421,
                11426
            ],
            [
                11404,
                11418
            ],
            [
                11435,
                11480
            ],
            [
                11487,
                11503
            ],
            [
                11503,
                11529
            ],
            [
                11541,
                11552
            ],
            [
                11555,
                11598
            ],
            [
                11607,
                11618
            ],
            [
                11599,
                11605
            ],
            [
                11630,
                11633
            ],
            [
                11686,
                11734
            ],
            [
                11734,
                11842
            ],
            [
                11842,
                11893
            ],
            [
                11893,
                11907
            ],
            [
                11923,
                11927
            ],
            [
                11981,
                11983
            ],
            [
                11983,
                12057
            ],
            [
                12057,
                12077
            ],
            [
                12077,
                12108
            ],
            [
                12284,
                12317
            ],
            [
                12323,
                12358
            ],
            [
                12360,
                12372
            ],
            [
                12374,
                12394
            ],
            [
                12394,
                12401
            ],
            [
                12401,
                12452
            ],
            [
                12528,
                12575
            ],
            [
                12575,
                12613
            ],
            [
                12613,
                12674
            ],
            [
                12762,
                12772
            ],
            [
                12805,
                12819
            ],
            [
                12819,
                12868
            ],
            [
                12868,
                12910
            ],
            [
                12910,
                12923
            ],
            [
                12923,
                12924
            ],
            [
                12934,
                12952
            ],
            [
                12952,
                12987
            ],
            [
                12987,
                13020
            ],
            [
                13269,
                13283
            ],
            [
                13283,
                13306
            ],
            [
                13371,
                13455
            ],
            [
                13455,
                13499
            ],
            [
                13499,
                13513
            ],
            [
                13513,
                13547
            ],
            [
                13547,
                13608
            ],
            [
                13634,
                13670
            ],
            [
                13833,
                13908
            ],
            [
                14023,
                14074
            ],
            [
                14172,
                14279
            ],
            [
                14279,
                14333
            ],
            [
                14341,
                14368
            ],
            [
                14595,
                14601
            ],
            [
                14605,
                14662
            ],
            [
                14662,
                14669
            ],
            [
                14671,
                14692
            ],
            [
                14727,
                14756
            ],
            [
                14777,
                14802
            ],
            [
                14804,
                14838
            ],
            [
                14878,
                14938
            ],
            [
                14961,
                14963
            ],
            [
                14963,
                14988
            ],
            [
                14990,
                15034
            ],
            [
                15069,
                15145
            ],
            [
                15146,
                15187
            ],
            [
                15256,
                15288
            ],
            [
                15303,
                15329
            ],
            [
                15332,
                15352
            ],
            [
                15352,
                15436
            ],
            [
                15454,
                15463
            ],
            [
                15469,
                15500
            ],
            [
                15500,
                15579
            ],
            [
                15579,
                15610
            ],
            [
                15610,
                15632
            ],
            [
                15632,
                15695
            ],
            [
                15695,
                15710
            ],
            [
                15711,
                15732
            ],
            [
                15735,
                15782
            ],
            [
                15782,
                15850
            ],
            [
                15850,
                15878
            ],
            [
                15878,
                15896
            ],
            [
                15982,
                16070
            ],
            [
                16070,
                16116
            ],
            [
                16116,
                16147
            ],
            [
                16147,
                16177
            ],
            [
                16177,
                16225
            ],
            [
                16225,
                16245
            ],
            [
                16245,
                16262
            ],
            [
                16276,
                16290
            ],
            [
                16292,
                16300
            ],
            [
                16300,
                16317
            ],
            [
                16317,
                16328
            ],
            [
                16346,
                16348
            ],
            [
                16348,
                16353
            ],
            [
                16362,
                16366
            ],
            [
                16366,
                16419
            ],
            [
                16419,
                16516
            ],
            [
                16516,
                16517
            ],
            [
                16521,
                16546
            ],
            [
                16546,
                16556
            ],
            [
                16556,
                16561
            ],
            [
                16595,
                16597
            ],
            [
                16597,
                16619
            ],
            [
                16619,
                16650
            ],
            [
                16650,
                16702
            ],
            [
                16702,
                16734
            ],
            [
                16769,
                16777
            ],
            [
                16777,
                16779
            ],
            [
                16779,
                16823
            ],
            [
                16827,
                16839
            ],
            [
                16839,
                16955
            ],
            [
                16956,
                17074
            ],
            [
                17074,
                17174
            ],
            [
                17174,
                17236
            ],
            [
                17236,
                17364
            ],
            [
                17364,
                17365
            ],
            [
                17369,
                17377
            ],
            [
                17379,
                17408
            ],
            [
                17410,
                17426
            ],
            [
                17426,
                17499
            ],
            [
                17499,
                17502
            ],
            [
                17583,
                17613
            ],
            [
                17613,
                17626
            ],
            [
                17626,
                17638
            ],
            [
                17638,
                17690
            ],
            [
                17690,
                17785
            ],
            [
                17785,
                17830
            ],
            [
                17836,
                17845
            ],
            [
                17848,
                17862
            ],
            [
                17862,
                17889
            ],
            [
                17889,
                17933
            ],
            [
                17933,
                17948
            ],
            [
                17963,
                18012
            ],
            [
                18012,
                18013
            ],
            [
                18048,
                18061
            ],
            [
                18033,
                18046
            ],
            [
                18061,
                18101
            ],
            [
                18101,
                18102
            ],
            [
                18106,
                18138
            ],
            [
                18138,
                18155
            ],
            [
                18218,
                18220
            ],
            [
                18220,
                18276
            ],
            [
                18426,
                18502
            ],
            [
                18502,
                18550
            ],
            [
                18551,
                18572
            ],
            [
                18586,
                18656
            ],
            [
                18673,
                18682
            ],
            [
                18686,
                18710
            ],
            [
                18711,
                18713
            ],
            [
                18719,
                18752
            ]
        ],
        "row_chars": [
            [
                0,
                135
            ],
            [
                135,
                261
            ],
            [
                261,
                395
            ],
            [
                395,
                549
            ],
            [
                549,
                737
            ],
            [
                737,
                906
            ],
            [
                906,
                959
            ],
            [
                959,
                1027
            ],
            [
                1027,
                1472
            ],
            [
                1472,
                1519
            ],
            [
                1519,
                1675
            ],
            [
                1675,
                1766
            ],
            [
                1766,
                1809
            ],
            [
                1809,
                1834
            ],
            [
                1834,
                1857
            ],
            [
                1857,
                1951
            ],
            [
                1951,
                2021
            ],
            [
                2021,
                2043
            ],
            [
                2043,
                2097
            ],
            [
                2097,
                2124
            ],
            [
                2124,
                2246
            ],
            [
                2246,
                2289
            ],
            [
                2289,
                2440
            ],
            [
                2440,
                2590
            ],
            [
                2590,
                2648
            ],
            [
                2648,
                2793
            ],
            [
                2793,
                2848
            ],
            [
                2848,
                2918
            ],
            [
                2918,
                2976
            ],
            [
                2976,
                3069
            ],
            [
                3069,
                3107
            ],
            [
                3107,
                3183
            ],
            [
                3183,
                3272
            ],
            [
                3272,
                3331
            ],
            [
                3331,
                3408
            ],
            [
                3408,
                3474
            ],
            [
                3474,
                3610
            ],
            [
                3610,
                3681
            ],
            [
                3681,
                3733
            ],
            [
                3733,
                3837
            ],
            [
                3837,
                3863
            ],
            [
                3863,
                3878
            ],
            [
                3878,
                3931
            ],
            [
                3931,
                4069
            ],
            [
                4069,
                4193
            ],
            [
                4193,
                4224
            ],
            [
                4224,
                4283
            ],
            [
                4283,
                4374
            ],
            [
                4374,
                4630
            ],
            [
                4630,
                4740
            ],
            [
                4740,
                4918
            ],
            [
                4918,
                5010
            ],
            [
                5010,
                5056
            ],
            [
                5056,
                5134
            ],
            [
                5134,
                5178
            ],
            [
                5178,
                5302
            ],
            [
                5302,
                5366
            ],
            [
                5366,
                5414
            ],
            [
                5414,
                5599
            ],
            [
                5599,
                5676
            ],
            [
                5676,
                5813
            ],
            [
                5813,
                5845
            ],
            [
                5845,
                5880
            ],
            [
                5880,
                6094
            ],
            [
                6094,
                6111
            ],
            [
                6111,
                6226
            ],
            [
                6226,
                6287
            ],
            [
                6287,
                6376
            ],
            [
                6376,
                6435
            ],
            [
                6435,
                6683
            ],
            [
                6683,
                6835
            ],
            [
                6835,
                6905
            ],
            [
                6905,
                6934
            ],
            [
                6934,
                6960
            ],
            [
                6960,
                6979
            ],
            [
                6979,
                7028
            ],
            [
                7028,
                7054
            ],
            [
                7054,
                7082
            ],
            [
                7082,
                7112
            ],
            [
                7112,
                7219
            ],
            [
                7219,
                7272
            ],
            [
                7272,
                7381
            ],
            [
                7381,
                7392
            ],
            [
                7392,
                7408
            ],
            [
                7408,
                7453
            ],
            [
                7453,
                7561
            ],
            [
                7561,
                7586
            ],
            [
                7586,
                7655
            ],
            [
                7655,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7854
            ],
            [
                7854,
                7942
            ],
            [
                7942,
                7978
            ],
            [
                7978,
                8037
            ],
            [
                8037,
                8066
            ],
            [
                8066,
                8071
            ],
            [
                8071,
                8077
            ],
            [
                8077,
                8083
            ],
            [
                8083,
                8139
            ],
            [
                8139,
                8220
            ],
            [
                8220,
                8468
            ],
            [
                8468,
                8854
            ],
            [
                8854,
                8886
            ],
            [
                8886,
                8977
            ],
            [
                8977,
                9087
            ],
            [
                9087,
                9193
            ],
            [
                9193,
                9299
            ],
            [
                9299,
                9322
            ],
            [
                9322,
                9366
            ],
            [
                9366,
                9471
            ],
            [
                9471,
                9633
            ],
            [
                9633,
                9686
            ],
            [
                9686,
                9747
            ],
            [
                9747,
                9788
            ],
            [
                9788,
                9818
            ],
            [
                9818,
                9860
            ],
            [
                9860,
                9946
            ],
            [
                9946,
                10028
            ],
            [
                10028,
                10160
            ],
            [
                10160,
                10255
            ],
            [
                10255,
                10282
            ],
            [
                10282,
                10304
            ],
            [
                10304,
                10336
            ],
            [
                10336,
                10360
            ],
            [
                10360,
                10453
            ],
            [
                10453,
                10534
            ],
            [
                10534,
                10551
            ],
            [
                10551,
                10656
            ],
            [
                10656,
                10685
            ],
            [
                10685,
                10731
            ],
            [
                10731,
                10761
            ],
            [
                10761,
                10771
            ],
            [
                10771,
                10836
            ],
            [
                10836,
                10997
            ],
            [
                10997,
                11170
            ],
            [
                11170,
                11289
            ],
            [
                11289,
                11351
            ],
            [
                11351,
                11395
            ],
            [
                11395,
                11503
            ],
            [
                11503,
                11633
            ],
            [
                11633,
                11734
            ],
            [
                11734,
                11842
            ],
            [
                11842,
                11893
            ],
            [
                11893,
                11983
            ],
            [
                11983,
                12057
            ],
            [
                12057,
                12077
            ],
            [
                12077,
                12108
            ],
            [
                12108,
                12178
            ],
            [
                12178,
                12220
            ],
            [
                12220,
                12283
            ],
            [
                12283,
                12317
            ],
            [
                12317,
                12394
            ],
            [
                12394,
                12401
            ],
            [
                12401,
                12452
            ],
            [
                12452,
                12528
            ],
            [
                12528,
                12575
            ],
            [
                12575,
                12613
            ],
            [
                12613,
                12676
            ],
            [
                12676,
                12757
            ],
            [
                12757,
                12819
            ],
            [
                12819,
                12868
            ],
            [
                12868,
                12910
            ],
            [
                12910,
                12923
            ],
            [
                12923,
                12952
            ],
            [
                12952,
                12987
            ],
            [
                12987,
                13020
            ],
            [
                13020,
                13077
            ],
            [
                13077,
                13146
            ],
            [
                13146,
                13175
            ],
            [
                13175,
                13194
            ],
            [
                13194,
                13239
            ],
            [
                13239,
                13269
            ],
            [
                13269,
                13283
            ],
            [
                13283,
                13308
            ],
            [
                13308,
                13371
            ],
            [
                13371,
                13455
            ],
            [
                13455,
                13499
            ],
            [
                13499,
                13513
            ],
            [
                13513,
                13547
            ],
            [
                13547,
                13610
            ],
            [
                13610,
                13634
            ],
            [
                13634,
                13673
            ],
            [
                13673,
                13693
            ],
            [
                13693,
                13788
            ],
            [
                13788,
                13833
            ],
            [
                13833,
                13908
            ],
            [
                13908,
                14018
            ],
            [
                14018,
                14074
            ],
            [
                14074,
                14168
            ],
            [
                14168,
                14279
            ],
            [
                14279,
                14368
            ],
            [
                14368,
                14421
            ],
            [
                14421,
                14451
            ],
            [
                14451,
                14492
            ],
            [
                14492,
                14595
            ],
            [
                14595,
                14662
            ],
            [
                14662,
                14692
            ],
            [
                14692,
                14727
            ],
            [
                14727,
                14840
            ],
            [
                14840,
                14871
            ],
            [
                14871,
                14963
            ],
            [
                14963,
                15034
            ],
            [
                15034,
                15146
            ],
            [
                15146,
                15188
            ],
            [
                15188,
                15256
            ],
            [
                15256,
                15303
            ],
            [
                15303,
                15352
            ],
            [
                15352,
                15463
            ],
            [
                15463,
                15500
            ],
            [
                15500,
                15579
            ],
            [
                15579,
                15610
            ],
            [
                15610,
                15632
            ],
            [
                15632,
                15695
            ],
            [
                15695,
                15782
            ],
            [
                15782,
                15850
            ],
            [
                15850,
                15878
            ],
            [
                15878,
                15898
            ],
            [
                15898,
                15955
            ],
            [
                15955,
                16070
            ],
            [
                16070,
                16116
            ],
            [
                16116,
                16147
            ],
            [
                16147,
                16177
            ],
            [
                16177,
                16225
            ],
            [
                16225,
                16245
            ],
            [
                16245,
                16300
            ],
            [
                16300,
                16317
            ],
            [
                16317,
                16348
            ],
            [
                16348,
                16366
            ],
            [
                16366,
                16419
            ],
            [
                16419,
                16516
            ],
            [
                16516,
                16546
            ],
            [
                16546,
                16556
            ],
            [
                16556,
                16561
            ],
            [
                16561,
                16597
            ],
            [
                16597,
                16619
            ],
            [
                16619,
                16650
            ],
            [
                16650,
                16702
            ],
            [
                16702,
                16734
            ],
            [
                16734,
                16740
            ],
            [
                16740,
                16779
            ],
            [
                16779,
                16823
            ],
            [
                16823,
                16839
            ],
            [
                16839,
                16956
            ],
            [
                16956,
                17074
            ],
            [
                17074,
                17174
            ],
            [
                17174,
                17236
            ],
            [
                17236,
                17364
            ],
            [
                17364,
                17426
            ],
            [
                17426,
                17499
            ],
            [
                17499,
                17613
            ],
            [
                17613,
                17626
            ],
            [
                17626,
                17638
            ],
            [
                17638,
                17690
            ],
            [
                17690,
                17785
            ],
            [
                17785,
                17862
            ],
            [
                17862,
                17889
            ],
            [
                17889,
                17933
            ],
            [
                17933,
                18012
            ],
            [
                18012,
                18101
            ],
            [
                18101,
                18138
            ],
            [
                18138,
                18220
            ],
            [
                18220,
                18502
            ],
            [
                18502,
                18551
            ],
            [
                18551,
                18752
            ]
        ]
    },
    "abridged": {
        "text": "Paul Montague reached London from Suffolk early on the Monday morning, and the following day he wrote to Mrs. Hurtle. He almost wished that he had taken Melmotte's offer and gone to Mexico. In that case he would never have seen Hetta Carbury again; but, as things were, of what use was his love? The kind of life of which he dreamed seemed to be far beyond his reach. Perhaps he should go away, and write to Hetta and bid her marry Roger Carbury - the best man that ever lived.\nBut the journey to Mexico was no longer open to him. He had quarrelled with Melmotte. And as to Mrs. Hurtle, he had promised to go again to Islington. He knew that if he failed to keep his promise, she would come to him.\nSo he would go there; but first he would try what a letter would do - a plain unvarnished tale. This was his plain tale as he now told it.\nMy Dear Mrs. Hurtle,\nI promised that I would come to you again in Islington, and so I will, if you still require it. But I think that such a meeting can be of no use to either of us. What is to be gained? I do not mean to justify my own conduct. It is not to be justified. When I met you on our journey from San Francisco, I was charmed with your genius, your beauty, and your character. But circumstances have made our lives and temperaments so different, that I am certain that, were we married, we should not make each other happy. Of course the fault was mine; but it is better to own that fault, and to take all the blame, and any evil consequences\n(-to be shot, for instance, like the gentleman in Oregon-)\nthan to be married knowing that such marriage will be a matter of sorrow and repentance. I cannot blame you for the step you have taken. But I can only adhere to my resolution.\nThe first day I saw you here in London you asked me whether I was attached to another woman. I could answer you only by the truth. But it was after I had resolved to break my engagement with you that I first knew this girl. It was not because I had come to love her that I broke it. I have no grounds whatever for hoping that my love will lead to any results.\nI have now told you as exactly as I can the condition of my mind. If it were possible for me in any way to compensate the injury I have done you, or to suffer retribution, I would do so. I think that our further meeting can avail nothing. But if you wish me to come again, I will come for the last time - because I have promised.\nYour most sincere friend,\nPaul Montague.\nMrs. Hurtle, as she read this, was torn. All that Paul had written was in accordance with the words written by herself on a scrap of paper which she still kept in her pocket. Those words would be the most generous and the fittest answer she could give. And she longed to be generous. She had all a woman's natural desire to sacrifice herself. Had he been ruined, or blind, or crippled, she would have stayed by him and have given him comfort. No sacrifice would have been too much for her if she was appreciated and loved in return.\nBut to sacrifice herself by going away was too much. What woman can endure such sacrifice as that? To give up not only her love, but her anger also! The idea of being tame was terrible to her. She had always protected herself by her own spirit. Now, at last, should she succumb and be trodden on like a worm?\nShe took out the scrap of paper and read it; the softness in it gratified her. But no, she could not send it. And so she sat down, and wrote rapidly as follows:\nPaul Montague,-\nI have suffered many injuries, but of all injuries this is the worst and most unmanly. Surely there never was such a coward, never so false a liar. Even poor Caradoc Hurtle never premeditated such wrong as this. What; you are to bind yourself to me by the most solemn promises that can join a man and a woman together, and then tell me - when they have affected my whole life - that they are to go for nothing, because they do not suit your view of things? I have no brother, no man near me; or you would not dare to do this.\nYou talk of compensation! Do you mean money? It is an insult. But as to retribution; yes. You shall suffer retribution. I desire you to come to me - according to your promise - and you will find me with a horsewhip in my hand. I will whip you till I have not a breath in my body. And then I will see whether you will dare to drag me into a court of law for the assault.\nYes; come. Now you know the welcome you shall find. But should you be afraid and break your promise, I will come to you. I will make London too hot to hold you; and if I do not find you I will go with my story to every friend you have.\nI have now told you as exactly as I can the condition of my mind.\nWinifred Hurtle.\nHaving written this she again read the short note, and again gave way to violent tears. But on that day she sent no letter. On the following morning she wrote a third, and sent that. This was the third letter:\nYes. Come.\nW. H.\nThis letter reached Paul Montague at his lodgings. He started immediately for Islington, having no desire to delay the meeting. He had declared his purpose plainly, and she could arm herself if she pleased; but he had now told her that he was resolved to do her wrong. The worst of that was over.\nThe door was opened for him by Ruby, who looked unhappy. It was the second morning after the night of her imprisonment; and nothing had occurred to alleviate her woe. At this very moment her lover was in bed in Welbeck Street.\n\"Yes, sir; she's at home,\" said Ruby, with a baby in her arms and a little child hanging on to her dress. \"Please, sir, is Sir Felix still in London?\" Ruby had written to Sir Felix, but had not received any reply. Paul declared that he knew nothing about Sir Felix, and was shown into Mrs. Hurtle's room.\n\"So you have come,\" she said, without rising from her chair.\n\"Of course I came, when you desired it.\"\n\"I don't know why you should. My wishes do not seem to affect you much. Sit down. So you think it would be best that you and I should never see each other again?\" She was very calm; but it seemed to him that the quietness might at any moment change to violence. He thought that her eye seemed to foretell the spring of the wild-cat.\n\"I did think so. What more can I say?\"\n\"Oh, clearly nothing.\" Her voice was very low. \"Why should a gentleman trouble himself to say any more than that he has changed his mind? Why make a fuss about such little things as a woman's life, or a woman's heart?\"\n\"What would you have me say?\"\n\"Ah! Suppose you were to say, 'I am a gentleman, and a man of my word, and I repent of my intended perfidy,' do you not think you might get your release that way? Might it not be possible that I should reply that I scorned to be the wife of a man who did not want me?\" As she asked this she gradually raised her voice, and half lifted herself in her seat.\n\"You might indeed.\"\n\"But I at least will be true. I should still take you, Paul; with a confidence that I should yet win you by my devotion. I have still some kindness towards you - none to that woman who is I suppose younger and gentler than I.\" There was nothing to be said in answer to this. \"Now that you are going to leave me, Paul, is there any advice you can give me, as to what I shall do next? I have given up every friend in the world for you. I have no home but this room. I have all the world to choose from, but no reason whatever for a choice. I have my property. What shall I do with it, Paul? You might at any rate advise me. You are in some degree responsible, are you not, for my loneliness?\"\n\"I am. But you know that I cannot answer your questions.\"\n\"As far as I can see, I had better remain here. I do good at any rate to Mrs. Pipkin. She went into hysterics yesterday when I spoke of leaving her.\" She paused for a minute. \"You thought my letter very short; did you not?\"\n\"It said, I suppose, all you had to say.\"\n\"No, indeed. I had much more to say. That was the third letter I wrote. Now you shall see the other two. There is one. You may read that first.\" Then she handed him the sheet of paper which contained the threat of the horsewhip.\n\"I am glad you did not send that,\" he said.\n\"I meant it.\"\n\"But you have changed your mind?\"\n\"Is there anything in it that seems to you to be unreasonable?\"\n\"I am thinking of you, not of myself. I do not think that under any provocation a woman should use a horsewhip.\"\n\"Upon my word, I don't know what to say about that. When a woman has no one to help her, is she to bear everything without turning upon those who ill-use her? Shall a woman be flayed alive because it is unfeminine to fight for her own skin? If she is treated as prey, shall she not fight as a beast of prey? Oh, no; it is so unfeminine! Paul, the charm of womanly weakness entered my mind in a soft moment, and then I wrote this other letter.\" She handed him the scrap which had been written at Lowestoft.\nHe could hardly finish it because of the tears which filled his eyes. Then he came across the room and threw himself on his knees at her feet, sobbing.\n\"I have not sent it, you know,\" she said.\n\"It hurts me more than the other.\"\n\"Nay, I would not hurt you - not at this moment. Sometimes I feel that I could tear you limb from limb, so great is my disappointment and my rage! Why should I be such a victim? Why should life be an utter blank to me, while you have everything before you? There, you have seen them all. Which will you have?\"\n\"I cannot now take that other as the expression of your mind.\"\n\"But it will be my feeling when you have left me - and was when you were with me at the sea-side. And it was so I felt when I got your first letter in San Francisco. Why should you kneel there? You do not love me.\" She put her hand upon his forehead, and pushed back his hair, and looked into his face. \"I wonder whether that other woman loves you. I do not want an answer, Paul. I suppose you had better go.\" She took his hand and pressed it to her breast. \"Tell me one thing. When you spoke of compensation, did you mean - money?\"\n\"No; indeed no.\"\n\"I hope not. Well, go. You shall be troubled no more with Winifrid Hurtle.\" She took the sheet of paper which contained the threat of the horsewhip and tore it into scraps.\n\"Am I to keep the other?\" he asked.\n\"No. Why? To prove my weakness? That also shall be destroyed.\" But she took it and restored it to her pocket-book.\n\"Good-bye, my friend,\" he said.\n\"No farewells. Go, and let there be no other word spoken.\" So he went.\nAs soon as the front door was closed behind him she rang the bell and begged Ruby to ask Mrs. Pipkin to come to her.\n\"Mrs. Pipkin,\" she said, as soon as the woman had entered the room; \"everything is over between me and Mr. Montague.\" She was standing upright in the middle of the room, and as she spoke there was a smile on her face.\n\"Lord a' mercy,\" said Mrs. Pipkin, holding up both her hands.\n\"As I have told you that I was to be married to him, I think it right now to tell you that I'm not going to be married to him.\"\n\"Why not? and he such a nice young man, and quiet too.\"\n\"As to the why not, I don't know that I am prepared to speak about that. But I'm no longer engaged to him. That's all.\"\n\"Dearie me! and you going down to Lowestoft with him, and all.\" Mrs. Pipkin could not bear to think that she should hear no more of such an interesting story.\n\"We did go down to Lowestoft together, and we came back - not together. And there's an end of it.\"\n\"I'm sure it's not your fault, Mrs. Hurtle. When a marriage doesn't come off, it never is the lady's fault.\"\n\"If you please, Mrs. Pipkin, we won't say anything more about it.\"\n\"Are you going to leave, ma'am?\" said Mrs. Pipkin, alarmed. Where should she get such another lodger as Mrs. Hurtle, who had never questioned an item in a bill since she had been in the house!\n\"We'll say nothing about that yet, Mrs. Pipkin.\"\nThen Mrs. Pipkin gave her so many assurances of sympathy and help that it almost seemed that she would guarantee her lodger another lover, in place of the one who was now dismissed.",
        "paragraph_chars": [
            [
                0,
                478
            ],
            [
                478,
                699
            ],
            [
                699,
                838
            ],
            [
                838,
                859
            ],
            [
                859,
                1492
            ],
            [
                1492,
                1551
            ],
            [
                1551,
                1728
            ],
            [
                1728,
                2088
            ],
            [
                2088,
                2418
            ],
            [
                2418,
                2444
            ],
            [
                2444,
                2459
            ],
            [
                2459,
                2992
            ],
            [
                2992,
                3301
            ],
            [
                3301,
                3462
            ],
            [
                3462,
                3478
            ],
            [
                3478,
                4004
            ],
            [
                4004,
                4374
            ],
            [
                4374,
                4610
            ],
            [
                4610,
                4676
            ],
            [
                4676,
                4693
            ],
            [
                4693,
                4903
            ],
            [
                4903,
                4914
            ],
            [
                4914,
                4920
            ],
            [
                4920,
                5217
            ],
            [
                5217,
                5444
            ],
            [
                5444,
                5749
            ],
            [
                5749,
                5810
            ],
            [
                5810,
                5851
            ],
            [
                5851,
                6184
            ],
            [
                6184,
                6223
            ],
            [
                6223,
                6442
            ],
            [
                6442,
                6472
            ],
            [
                6472,
                6828
            ],
            [
                6828,
                6848
            ],
            [
                6848,
                7539
            ],
            [
                7539,
                7597
            ],
            [
                7597,
                7821
            ],
            [
                7821,
                7863
            ],
            [
                7863,
                8092
            ],
            [
                8092,
                8136
            ],
            [
                8136,
                8150
            ],
            [
                8150,
                8184
            ],
            [
                8184,
                8248
            ],
            [
                8248,
                8361
            ],
            [
                8361,
                8867
            ],
            [
                8867,
                9019
            ],
            [
                9019,
                9061
            ],
            [
                9061,
                9096
            ],
            [
                9096,
                9406
            ],
            [
                9406,
                9469
            ],
            [
                9469,
                10002
            ],
            [
                10002,
                10019
            ],
            [
                10019,
                10192
            ],
            [
                10192,
                10228
            ],
            [
                10228,
                10343
            ],
            [
                10343,
                10375
            ],
            [
                10375,
                10446
            ],
            [
                10446,
                10563
            ],
            [
                10563,
                10781
            ],
            [
                10781,
                10843
            ],
            [
                10843,
                10971
            ],
            [
                10971,
                11027
            ],
            [
                11027,
                11147
            ],
            [
                11147,
                11306
            ],
            [
                11306,
                11405
            ],
            [
                11405,
                11514
            ],
            [
                11514,
                11581
            ],
            [
                11581,
                11774
            ],
            [
                11774,
                11823
            ],
            [
                11823,
                12004
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                190
            ],
            [
                190,
                296
            ],
            [
                296,
                368
            ],
            [
                368,
                478
            ],
            [
                478,
                531
            ],
            [
                531,
                564
            ],
            [
                564,
                629
            ],
            [
                629,
                699
            ],
            [
                699,
                795
            ],
            [
                795,
                838
            ],
            [
                838,
                859
            ],
            [
                859,
                955
            ],
            [
                955,
                1021
            ],
            [
                1021,
                1043
            ],
            [
                1043,
                1084
            ],
            [
                1084,
                1111
            ],
            [
                1111,
                1226
            ],
            [
                1226,
                1373
            ],
            [
                1373,
                1492
            ],
            [
                1492,
                1551
            ],
            [
                1551,
                1640
            ],
            [
                1640,
                1688
            ],
            [
                1688,
                1728
            ],
            [
                1728,
                1821
            ],
            [
                1821,
                1859
            ],
            [
                1859,
                1952
            ],
            [
                1952,
                2011
            ],
            [
                2011,
                2088
            ],
            [
                2088,
                2154
            ],
            [
                2154,
                2275
            ],
            [
                2275,
                2327
            ],
            [
                2327,
                2418
            ],
            [
                2418,
                2444
            ],
            [
                2444,
                2459
            ],
            [
                2459,
                2500
            ],
            [
                2500,
                2634
            ],
            [
                2634,
                2712
            ],
            [
                2712,
                2743
            ],
            [
                2743,
                2802
            ],
            [
                2802,
                2902
            ],
            [
                2902,
                2992
            ],
            [
                2992,
                3045
            ],
            [
                3045,
                3091
            ],
            [
                3091,
                3141
            ],
            [
                3141,
                3185
            ],
            [
                3185,
                3237
            ],
            [
                3237,
                3301
            ],
            [
                3301,
                3380
            ],
            [
                3380,
                3411
            ],
            [
                3411,
                3462
            ],
            [
                3462,
                3478
            ],
            [
                3478,
                3565
            ],
            [
                3565,
                3626
            ],
            [
                3626,
                3690
            ],
            [
                3690,
                3935
            ],
            [
                3935,
                4004
            ],
            [
                4004,
                4030
            ],
            [
                4030,
                4049
            ],
            [
                4049,
                4066
            ],
            [
                4066,
                4094
            ],
            [
                4094,
                4124
            ],
            [
                4124,
                4231
            ],
            [
                4231,
                4284
            ],
            [
                4284,
                4374
            ],
            [
                4374,
                4385
            ],
            [
                4385,
                4426
            ],
            [
                4426,
                4495
            ],
            [
                4495,
                4610
            ],
            [
                4610,
                4676
            ],
            [
                4676,
                4693
            ],
            [
                4693,
                4781
            ],
            [
                4781,
                4817
            ],
            [
                4817,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4908
            ],
            [
                4908,
                4914
            ],
            [
                4914,
                4920
            ],
            [
                4920,
                4971
            ],
            [
                4971,
                5048
            ],
            [
                5048,
                5189
            ],
            [
                5189,
                5217
            ],
            [
                5217,
                5274
            ],
            [
                5274,
                5384
            ],
            [
                5384,
                5444
            ],
            [
                5444,
                5550
            ],
            [
                5550,
                5595
            ],
            [
                5595,
                5658
            ],
            [
                5658,
                5749
            ],
            [
                5749,
                5810
            ],
            [
                5810,
                5851
            ],
            [
                5851,
                5881
            ],
            [
                5881,
                5923
            ],
            [
                5923,
                5933
            ],
            [
                5933,
                6014
            ],
            [
                6014,
                6113
            ],
            [
                6113,
                6184
            ],
            [
                6184,
                6201
            ],
            [
                6201,
                6223
            ],
            [
                6223,
                6246
            ],
            [
                6246,
                6270
            ],
            [
                6270,
                6361
            ],
            [
                6361,
                6442
            ],
            [
                6442,
                6472
            ],
            [
                6472,
                6477
            ],
            [
                6477,
                6635
            ],
            [
                6635,
                6741
            ],
            [
                6741,
                6828
            ],
            [
                6828,
                6848
            ],
            [
                6848,
                6878
            ],
            [
                6878,
                6969
            ],
            [
                6969,
                7075
            ],
            [
                7075,
                7123
            ],
            [
                7123,
                7231
            ],
            [
                7231,
                7282
            ],
            [
                7282,
                7312
            ],
            [
                7312,
                7386
            ],
            [
                7386,
                7406
            ],
            [
                7406,
                7437
            ],
            [
                7437,
                7470
            ],
            [
                7470,
                7539
            ],
            [
                7539,
                7546
            ],
            [
                7546,
                7597
            ],
            [
                7597,
                7645
            ],
            [
                7645,
                7683
            ],
            [
                7683,
                7747
            ],
            [
                7747,
                7772
            ],
            [
                7772,
                7821
            ],
            [
                7821,
                7863
            ],
            [
                7863,
                7876
            ],
            [
                7876,
                7900
            ],
            [
                7900,
                7935
            ],
            [
                7935,
                7968
            ],
            [
                7968,
                7982
            ],
            [
                7982,
                8008
            ],
            [
                8008,
                8092
            ],
            [
                8092,
                8136
            ],
            [
                8136,
                8150
            ],
            [
                8150,
                8184
            ],
            [
                8184,
                8248
            ],
            [
                8248,
                8286
            ],
            [
                8286,
                8361
            ],
            [
                8361,
                8413
            ],
            [
                8413,
                8520
            ],
            [
                8520,
                8602
            ],
            [
                8602,
                8669
            ],
            [
                8669,
                8698
            ],
            [
                8698,
                8805
            ],
            [
                8805,
                8867
            ],
            [
                8867,
                8937
            ],
            [
                8937,
                9019
            ],
            [
                9019,
                9061
            ],
            [
                9061,
                9096
            ],
            [
                9096,
                9145
            ],
            [
                9145,
                9243
            ],
            [
                9243,
                9274
            ],
            [
                9274,
                9353
            ],
            [
                9353,
                9384
            ],
            [
                9384,
                9406
            ],
            [
                9406,
                9469
            ],
            [
                9469,
                9567
            ],
            [
                9567,
                9635
            ],
            [
                9635,
                9663
            ],
            [
                9663,
                9684
            ],
            [
                9684,
                9772
            ],
            [
                9772,
                9818
            ],
            [
                9818,
                9849
            ],
            [
                9849,
                9879
            ],
            [
                9879,
                9927
            ],
            [
                9927,
                9947
            ],
            [
                9947,
                10002
            ],
            [
                10002,
                10019
            ],
            [
                10019,
                10032
            ],
            [
                10032,
                10042
            ],
            [
                10042,
                10095
            ],
            [
                10095,
                10192
            ],
            [
                10192,
                10218
            ],
            [
                10218,
                10228
            ],
            [
                10228,
                10233
            ],
            [
                10233,
                10238
            ],
            [
                10238,
                10260
            ],
            [
                10260,
                10291
            ],
            [
                10291,
                10343
            ],
            [
                10343,
                10375
            ],
            [
                10375,
                10390
            ],
            [
                10390,
                10434
            ],
            [
                10434,
                10446
            ],
            [
                10446,
                10563
            ],
            [
                10563,
                10681
            ],
            [
                10681,
                10781
            ],
            [
                10781,
                10843
            ],
            [
                10843,
                10971
            ],
            [
                10971,
                10981
            ],
            [
                10981,
                11027
            ],
            [
                11027,
                11100
            ],
            [
                11100,
                11134
            ],
            [
                11134,
                11147
            ],
            [
                11147,
                11159
            ],
            [
                11159,
                11211
            ],
            [
                11211,
                11306
            ],
            [
                11306,
                11378
            ],
            [
                11378,
                11405
            ],
            [
                11405,
                11449
            ],
            [
                11449,
                11514
            ],
            [
                11514,
                11581
            ],
            [
                11581,
                11614
            ],
            [
                11614,
                11641
            ],
            [
                11641,
                11774
            ],
            [
                11774,
                11823
            ],
            [
                11823,
                12004
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                29,
                74
            ],
            [
                75,
                118
            ],
            [
                118,
                190
            ],
            [
                190,
                192
            ],
            [
                198,
                202
            ],
            [
                203,
                281
            ],
            [
                282,
                294
            ],
            [
                294,
                296
            ],
            [
                296,
                332
            ],
            [
                333,
                368
            ],
            [
                376,
                398
            ],
            [
                399,
                431
            ],
            [
                432,
                445
            ],
            [
                448,
                476
            ],
            [
                478,
                531
            ],
            [
                531,
                533
            ],
            [
                534,
                564
            ],
            [
                564,
                567
            ],
            [
                571,
                585
            ],
            [
                585,
                586
            ],
            [
                587,
                627
            ],
            [
                627,
                628
            ],
            [
                629,
                631
            ],
            [
                637,
                698
            ],
            [
                702,
                710
            ],
            [
                711,
                713
            ],
            [
                719,
                724
            ],
            [
                725,
                730
            ],
            [
                731,
                739
            ],
            [
                740,
                766
            ],
            [
                769,
                795
            ],
            [
                795,
                838
            ],
            [
                838,
                858
            ],
            [
                859,
                882
            ],
            [
                888,
                955
            ],
            [
                955,
                999
            ],
            [
                1004,
                1021
            ],
            [
                1021,
                1043
            ],
            [
                1043,
                1051
            ],
            [
                1052,
                1084
            ],
            [
                1084,
                1111
            ],
            [
                1111,
                1140
            ],
            [
                1141,
                1226
            ],
            [
                1226,
                1283
            ],
            [
                1284,
                1373
            ],
            [
                1373,
                1465
            ],
            [
                1466,
                1469
            ],
            [
                1474,
                1491
            ],
            [
                1494,
                1548
            ],
            [
                1551,
                1569
            ],
            [
                1578,
                1582
            ],
            [
                1583,
                1640
            ],
            [
                1640,
                1641
            ],
            [
                1655,
                1680
            ],
            [
                1681,
                1688
            ],
            [
                1688,
                1712
            ],
            [
                1716,
                1726
            ],
            [
                1726,
                1728
            ],
            [
                1728,
                1821
            ],
            [
                1821,
                1859
            ],
            [
                1863,
                1952
            ],
            [
                1952,
                2011
            ],
            [
                2011,
                2088
            ],
            [
                2088,
                2154
            ],
            [
                2154,
                2233
            ],
            [
                2234,
                2236
            ],
            [
                2237,
                2239
            ],
            [
                2247,
                2258
            ],
            [
                2258,
                2259
            ],
            [
                2260,
                2275
            ],
            [
                2275,
                2327
            ],
            [
                2327,
                2333
            ],
            [
                2334,
                2390
            ],
            [
                2393,
                2418
            ],
            [
                2418,
                2444
            ],
            [
                2444,
                2459
            ],
            [
                2459,
                2498
            ],
            [
                2498,
                2500
            ],
            [
                2500,
                2625
            ],
            [
                2626,
                2634
            ],
            [
                2634,
                2645
            ],
            [
                2646,
                2712
            ],
            [
                2712,
                2743
            ],
            [
                2743,
                2802
            ],
            [
                2802,
                2805
            ],
            [
                2814,
                2820
            ],
            [
                2820,
                2834
            ],
            [
                2843,
                2882
            ],
            [
                2883,
                2902
            ],
            [
                2902,
                2947
            ],
            [
                2951,
                2958
            ],
            [
                2959,
                2970
            ],
            [
                2971,
                2974
            ],
            [
                2975,
                2991
            ],
            [
                2992,
                3030
            ],
            [
                3031,
                3043
            ],
            [
                3045,
                3091
            ],
            [
                3091,
                3128
            ],
            [
                3135,
                3139
            ],
            [
                3139,
                3141
            ],
            [
                3141,
                3185
            ],
            [
                3185,
                3192
            ],
            [
                3210,
                3237
            ],
            [
                3237,
                3300
            ],
            [
                3301,
                3345
            ],
            [
                3350,
                3364
            ],
            [
                3365,
                3379
            ],
            [
                3380,
                3386
            ],
            [
                3388,
                3411
            ],
            [
                3411,
                3421
            ],
            [
                3422,
                3425
            ],
            [
                3426,
                3430
            ],
            [
                3430,
                3435
            ],
            [
                3436,
                3441
            ],
            [
                3450,
                3461
            ],
            [
                3462,
                3475
            ],
            [
                3478,
                3555
            ],
            [
                3556,
                3565
            ],
            [
                3565,
                3626
            ],
            [
                3626,
                3630
            ],
            [
                3636,
                3690
            ],
            [
                3690,
                3695
            ],
            [
                3696,
                3745
            ],
            [
                3755,
                3813
            ],
            [
                3816,
                3853
            ],
            [
                3856,
                3935
            ],
            [
                3935,
                3969
            ],
            [
                3970,
                4003
            ],
            [
                4004,
                4030
            ],
            [
                4030,
                4049
            ],
            [
                4049,
                4064
            ],
            [
                4064,
                4066
            ],
            [
                4066,
                4094
            ],
            [
                4094,
                4124
            ],
            [
                4124,
                4150
            ],
            [
                4153,
                4178
            ],
            [
                4181,
                4231
            ],
            [
                4231,
                4284
            ],
            [
                4284,
                4303
            ],
            [
                4304,
                4311
            ],
            [
                4312,
                4328
            ],
            [
                4329,
                4374
            ],
            [
                4374,
                4385
            ],
            [
                4385,
                4426
            ],
            [
                4426,
                4495
            ],
            [
                4495,
                4534
            ],
            [
                4535,
                4610
            ],
            [
                4610,
                4676
            ],
            [
                4676,
                4681
            ],
            [
                4685,
                4693
            ],
            [
                4693,
                4781
            ],
            [
                4781,
                4817
            ],
            [
                4817,
                4876
            ],
            [
                4876,
                4902
            ],
            [
                4903,
                4908
            ],
            [
                4908,
                4914
            ],
            [
                4914,
                4920
            ],
            [
                4920,
                4931
            ],
            [
                4932,
                4971
            ],
            [
                4971,
                5007
            ],
            [
                5016,
                5048
            ],
            [
                5048,
                5083
            ],
            [
                5083,
                5084
            ],
            [
                5085,
                5088
            ],
            [
                5089,
                5110
            ],
            [
                5111,
                5126
            ],
            [
                5127,
                5130
            ],
            [
                5134,
                5137
            ],
            [
                5138,
                5141
            ],
            [
                5142,
                5146
            ],
            [
                5147,
                5189
            ],
            [
                5189,
                5210
            ],
            [
                5211,
                5217
            ],
            [
                5217,
                5257
            ],
            [
                5272,
                5274
            ],
            [
                5274,
                5384
            ],
            [
                5384,
                5413
            ],
            [
                5414,
                5417
            ],
            [
                5418,
                5420
            ],
            [
                5425,
                5443
            ],
            [
                5444,
                5550
            ],
            [
                5551,
                5595
            ],
            [
                5595,
                5624
            ],
            [
                5624,
                5637
            ],
            [
                5638,
                5658
            ],
            [
                5658,
                5662
            ],
            [
                5663,
                5676
            ],
            [
                5677,
                5717
            ],
            [
                5718,
                5749
            ],
            [
                5749,
                5810
            ],
            [
                5810,
                5851
            ],
            [
                5851,
                5881
            ],
            [
                5881,
                5923
            ],
            [
                5923,
                5931
            ],
            [
                5931,
                5933
            ],
            [
                5933,
                6014
            ],
            [
                6014,
                6072
            ],
            [
                6073,
                6078
            ],
            [
                6079,
                6092
            ],
            [
                6103,
                6113
            ],
            [
                6113,
                6128
            ],
            [
                6129,
                6136
            ],
            [
                6137,
                6184
            ],
            [
                6184,
                6199
            ],
            [
                6199,
                6201
            ],
            [
                6201,
                6223
            ],
            [
                6223,
                6227
            ],
            [
                6228,
                6246
            ],
            [
                6246,
                6270
            ],
            [
                6270,
                6325
            ],
            [
                6326,
                6361
            ],
            [
                6361,
                6441
            ],
            [
                6442,
                6472
            ],
            [
                6472,
                6475
            ],
            [
                6475,
                6477
            ],
            [
                6477,
                6555
            ],
            [
                6556,
                6635
            ],
            [
                6635,
                6679
            ],
            [
                6680,
                6741
            ],
            [
                6741,
                6826
            ],
            [
                6826,
                6828
            ],
            [
                6828,
                6845
            ],
            [
                6848,
                6852
            ],
            [
                6853,
                6878
            ],
            [
                6878,
                6886
            ],
            [
                6887,
                6892
            ],
            [
                6893,
                6907
            ],
            [
                6907,
                6952
            ],
            [
                6953,
                6969
            ],
            [
                6969,
                6995
            ],
            [
                6996,
                7007
            ],
            [
                7010,
                7053
            ],
            [
                7054,
                7065
            ],
            [
                7066,
                7072
            ],
            [
                7072,
                7075
            ],
            [
                7075,
                7123
            ],
            [
                7123,
                7231
            ],
            [
                7231,
                7282
            ],
            [
                7282,
                7296
            ],
            [
                7306,
                7310
            ],
            [
                7310,
                7312
            ],
            [
                7312,
                7386
            ],
            [
                7386,
                7406
            ],
            [
                7406,
                7437
            ],
            [
                7437,
                7470
            ],
            [
                7470,
                7505
            ],
            [
                7506,
                7518
            ],
            [
                7519,
                7539
            ],
            [
                7539,
                7546
            ],
            [
                7546,
                7597
            ],
            [
                7598,
                7645
            ],
            [
                7645,
                7683
            ],
            [
                7683,
                7744
            ],
            [
                7747,
                7757
            ],
            [
                7758,
                7772
            ],
            [
                7772,
                7821
            ],
            [
                7821,
                7863
            ],
            [
                7863,
                7876
            ],
            [
                7876,
                7877
            ],
            [
                7882,
                7900
            ],
            [
                7900,
                7935
            ],
            [
                7935,
                7968
            ],
            [
                7968,
                7982
            ],
            [
                7982,
                8005
            ],
            [
                8008,
                8092
            ],
            [
                8092,
                8136
            ],
            [
                8136,
                8150
            ],
            [
                8150,
                8184
            ],
            [
                8184,
                8245
            ],
            [
                8248,
                8284
            ],
            [
                8286,
                8361
            ],
            [
                8362,
                8413
            ],
            [
                8413,
                8520
            ],
            [
                8520,
                8574
            ],
            [
                8575,
                8602
            ],
            [
                8602,
                8608
            ],
            [
                8612,
                8669
            ],
            [
                8669,
                8676
            ],
            [
                8677,
                8698
            ],
            [
                8704,
                8733
            ],
            [
                8742,
                8767
            ],
            [
                8768,
                8802
            ],
            [
                8805,
                8865
            ],
            [
                8865,
                8867
            ],
            [
                8867,
                8892
            ],
            [
                8893,
                8937
            ],
            [
                8942,
                9018
            ],
            [
                9019,
                9060
            ],
            [
                9061,
                9093
            ],
            [
                9096,
                9122
            ],
            [
                9125,
                9145
            ],
            [
                9145,
                9229
            ],
            [
                9234,
                9243
            ],
            [
                9243,
                9274
            ],
            [
                9274,
                9353
            ],
            [
                9353,
                9384
            ],
            [
                9384,
                9406
            ],
            [
                9406,
                9469
            ],
            [
                9469,
                9484
            ],
            [
                9496,
                9517
            ],
            [
                9520,
                9567
            ],
            [
                9567,
                9635
            ],
            [
                9635,
                9663
            ],
            [
                9663,
                9681
            ],
            [
                9684,
                9772
            ],
            [
                9772,
                9818
            ],
            [
                9818,
                9849
            ],
            [
                9849,
                9879
            ],
            [
                9879,
                9927
            ],
            [
                9927,
                9947
            ],
            [
                9947,
                9964
            ],
            [
                9977,
                9991
            ],
            [
                9994,
                10002
            ],
            [
                10002,
                10019
            ],
            [
                10019,
                10030
            ],
            [
                10030,
                10032
            ],
            [
                10032,
                10037
            ],
            [
                10038,
                10042
            ],
            [
                10042,
                10095
            ],
            [
                10095,
                10192
            ],
            [
                10192,
                10193
            ],
            [
                10193,
                10218
            ],
            [
                10218,
                10228
            ],
            [
                10228,
                10233
            ],
            [
                10236,
                10238
            ],
            [
                10238,
                10260
            ],
            [
                10260,
                10291
            ],
            [
                10291,
                10343
            ],
            [
                10343,
                10375
            ],
            [
                10379,
                10387
            ],
            [
                10388,
                10390
            ],
            [
                10390,
                10434
            ],
            [
                10434,
                10446
            ],
            [
                10446,
                10562
            ],
            [
                10563,
                10681
            ],
            [
                10681,
                10781
            ],
            [
                10781,
                10843
            ],
            [
                10843,
                10971
            ],
            [
                10971,
                10972
            ],
            [
                10972,
                10980
            ],
            [
                10981,
                11010
            ],
            [
                11011,
                11027
            ],
            [
                11027,
                11100
            ],
            [
                11100,
                11103
            ],
            [
                11104,
                11134
            ],
            [
                11134,
                11147
            ],
            [
                11147,
                11159
            ],
            [
                11159,
                11211
            ],
            [
                11211,
                11306
            ],
            [
                11306,
                11351
            ],
            [
                11352,
                11361
            ],
            [
                11364,
                11378
            ],
            [
                11378,
                11405
            ],
            [
                11405,
                11449
            ],
            [
                11449,
                11464
            ],
            [
                11465,
                11514
            ],
            [
                11514,
                11515
            ],
            [
                11515,
                11528
            ],
            [
                11528,
                11541
            ],
            [
                11541,
                11581
            ],
            [
                11581,
                11582
            ],
            [
                11582,
                11614
            ],
            [
                11614,
                11631
            ],
            [
                11639,
                11641
            ],
            [
                11641,
                11697
            ],
            [
                11698,
                11774
            ],
            [
                11774,
                11822
            ],
            [
                11823,
                11844
            ],
            [
                11849,
                11919
            ],
            [
                11926,
                11935
            ],
            [
                11936,
                11960
            ],
            [
                11962,
                11964
            ],
            [
                11971,
                12004
            ]
        ],
        "row_chars": [
            [
                0,
                118
            ],
            [
                118,
                190
            ],
            [
                190,
                190
            ],
            [
                190,
                296
            ],
            [
                296,
                368
            ],
            [
                368,
                478
            ],
            [
                478,
                531
            ],
            [
                531,
                564
            ],
            [
                564,
                699
            ],
            [
                699,
                699
            ],
            [
                699,
                795
            ],
            [
                795,
                795
            ],
            [
                795,
                838
            ],
            [
                838,
                838
            ],
            [
                838,
                859
            ],
            [
                859,
                955
            ],
            [
                955,
                1021
            ],
            [
                1021,
                1043
            ],
            [
                1043,
                1084
            ],
            [
                1084,
                1111
            ],
            [
                1111,
                1226
            ],
            [
                1226,
                1226
            ],
            [
                1226,
                1373
            ],
            [
                1373,
                1492
            ],
            [
                1492,
                1551
            ],
            [
                1551,
                1640
            ],
            [
                1640,
                1640
            ],
            [
                1640,
                1688
            ],
            [
                1688,
                1728
            ],
            [
                1728,
                1821
            ],
            [
                1821,
                1859
            ],
            [
                1859,
                1859
            ],
            [
                1859,
                1952
            ],
            [
                1952,
                2011
            ],
            [
                2011,
                2088
            ],
            [
                2088,
                2154
            ],
            [
                2154,
                2275
            ],
            [
                2275,
                2275
            ],
            [
                2275,
                2327
            ],
            [
                2327,
                2418
            ],
            [
                2418,
                2444
            ],
            [
                2444,
                2459
            ],
            [
                2459,
                2500
            ],
            [
                2500,
                2634
            ],
            [
                2634,
                2712
            ],
            [
                2712,
                2743
            ],
            [
                2743,
                2802
            ],
            [
                2802,
                2802
            ],
            [
                2802,
                2902
            ],
            [
                2902,
                2902
            ],
            [
                2902,
                2992
            ],
            [
                2992,
                3045
            ],
            [
                3045,
                3091
            ],
            [
                3091,
                3141
            ],
            [
                3141,
                3185
            ],
            [
                3185,
                3237
            ],
            [
                3237,
                3301
            ],
            [
                3301,
                3301
            ],
            [
                3301,
                3301
            ],
            [
                3301,
                3301
            ],
            [
                3301,
                3380
            ],
            [
                3380,
                3411
            ],
            [
                3411,
                3411
            ],
            [
                3411,
                3462
            ],
            [
                3462,
                3478
            ],
            [
                3478,
                3565
            ],
            [
                3565,
                3626
            ],
            [
                3626,
                3626
            ],
            [
                3626,
                3690
            ],
            [
                3690,
                3935
            ],
            [
                3935,
                3935
            ],
            [
                3935,
                4004
            ],
            [
                4004,
                4004
            ],
            [
                4004,
                4030
            ],
            [
                4030,
                4049
            ],
            [
                4049,
                4049
            ],
            [
                4049,
                4066
            ],
            [
                4066,
                4094
            ],
            [
                4094,
                4124
            ],
            [
                4124,
                4231
            ],
            [
                4231,
                4284
            ],
            [
                4284,
                4374
            ],
            [
                4374,
                4385
            ],
            [
                4385,
                4385
            ],
            [
                4385,
                4426
            ],
            [
                4426,
                4426
            ],
            [
                4426,
                4426
            ],
            [
                4426,
                4495
            ],
            [
                4495,
                4610
            ],
            [
                4610,
                4676
            ],
            [
                4676,
                4693
            ],
            [
                4693,
                4781
            ],
            [
                4781,
                4817
            ],
            [
                4817,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4908
            ],
            [
                4908,
                4914
            ],
            [
                4914,
                4920
            ],
            [
                4920,
                4971
            ],
            [
                4971,
                5048
            ],
            [
                5048,
                5048
            ],
            [
                5048,
                5189
            ],
            [
                5189,
                5217
            ],
            [
                5217,
                5274
            ],
            [
                5274,
                5384
            ],
            [
                5384,
                5444
            ],
            [
                5444,
                5550
            ],
            [
                5550,
                5550
            ],
            [
                5550,
                5595
            ],
            [
                5595,
                5658
            ],
            [
                5658,
                5749
            ],
            [
                5749,
                5749
            ],
            [
                5749,
                5810
            ],
            [
                5810,
                5851
            ],
            [
                5851,
                5881
            ],
            [
                5881,
                5923
            ],
            [
                5923,
                5933
            ],
            [
                5933,
                6014
            ],
            [
                6014,
                6113
            ],
            [
                6113,
                6184
            ],
            [
                6184,
                6201
            ],
            [
                6201,
                6223
            ],
            [
                6223,
                6246
            ],
            [
                6246,
                6270
            ],
            [
                6270,
                6361
            ],
            [
                6361,
                6442
            ],
            [
                6442,
                6442
            ],
            [
                6442,
                6442
            ],
            [
                6442,
                6442
            ],
            [
                6442,
                6442
            ],
            [
                6442,
                6472
            ],
            [
                6472,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6635
            ],
            [
                6635,
                6741
            ],
            [
                6741,
                6828
            ],
            [
                6828,
                6848
            ],
            [
                6848,
                6878
            ],
            [
                6878,
                6969
            ],
            [
                6969,
                7075
            ],
            [
                7075,
                7123
            ],
            [
                7123,
                7231
            ],
            [
                7231,
                7282
            ],
            [
                7282,
                7312
            ],
            [
                7312,
                7386
            ],
            [
                7386,
                7406
            ],
            [
                7406,
                7437
            ],
            [
                7437,
                7437
            ],
            [
                7437,
                7437
            ],
            [
                7437,
                7437
            ],
            [
                7437,
                7470
            ],
            [
                7470,
                7539
            ],
            [
                7539,
                7546
            ],
            [
                7546,
                7597
            ],
            [
                7597,
                7597
            ],
            [
                7597,
                7645
            ],
            [
                7645,
                7683
            ],
            [
                7683,
                7747
            ],
            [
                7747,
                7747
            ],
            [
                7747,
                7772
            ],
            [
                7772,
                7821
            ],
            [
                7821,
                7863
            ],
            [
                7863,
                7876
            ],
            [
                7876,
                7900
            ],
            [
                7900,
                7935
            ],
            [
                7935,
                7968
            ],
            [
                7968,
                7968
            ],
            [
                7968,
                7968
            ],
            [
                7968,
                7968
            ],
            [
                7968,
                7968
            ],
            [
                7968,
                7968
            ],
            [
                7968,
                7968
            ],
            [
                7968,
                7982
            ],
            [
                7982,
                8008
            ],
            [
                8008,
                8008
            ],
            [
                8008,
                8092
            ],
            [
                8092,
                8136
            ],
            [
                8136,
                8150
            ],
            [
                8150,
                8184
            ],
            [
                8184,
                8248
            ],
            [
                8248,
                8248
            ],
            [
                8248,
                8286
            ],
            [
                8286,
                8286
            ],
            [
                8286,
                8286
            ],
            [
                8286,
                8286
            ],
            [
                8286,
                8361
            ],
            [
                8361,
                8361
            ],
            [
                8361,
                8413
            ],
            [
                8413,
                8413
            ],
            [
                8413,
                8520
            ],
            [
                8520,
                8602
            ],
            [
                8602,
                8602
            ],
            [
                8602,
                8602
            ],
            [
                8602,
                8602
            ],
            [
                8602,
                8602
            ],
            [
                8602,
                8669
            ],
            [
                8669,
                8698
            ],
            [
                8698,
                8698
            ],
            [
                8698,
                8805
            ],
            [
                8805,
                8805
            ],
            [
                8805,
                8867
            ],
            [
                8867,
                8937
            ],
            [
                8937,
                9019
            ],
            [
                9019,
                9061
            ],
            [
                9061,
                9061
            ],
            [
                9061,
                9096
            ],
            [
                9096,
                9145
            ],
            [
                9145,
                9243
            ],
            [
                9243,
                9274
            ],
            [
                9274,
                9353
            ],
            [
                9353,
                9384
            ],
            [
                9384,
                9406
            ],
            [
                9406,
                9469
            ],
            [
                9469,
                9567
            ],
            [
                9567,
                9635
            ],
            [
                9635,
                9663
            ],
            [
                9663,
                9684
            ],
            [
                9684,
                9684
            ],
            [
                9684,
                9772
            ],
            [
                9772,
                9818
            ],
            [
                9818,
                9849
            ],
            [
                9849,
                9879
            ],
            [
                9879,
                9927
            ],
            [
                9927,
                9947
            ],
            [
                9947,
                10002
            ],
            [
                10002,
                10019
            ],
            [
                10019,
                10032
            ],
            [
                10032,
                10042
            ],
            [
                10042,
                10095
            ],
            [
                10095,
                10192
            ],
            [
                10192,
                10218
            ],
            [
                10218,
                10228
            ],
            [
                10228,
                10233
            ],
            [
                10233,
                10238
            ],
            [
                10238,
                10260
            ],
            [
                10260,
                10291
            ],
            [
                10291,
                10343
            ],
            [
                10343,
                10375
            ],
            [
                10375,
                10375
            ],
            [
                10375,
                10390
            ],
            [
                10390,
                10434
            ],
            [
                10434,
                10446
            ],
            [
                10446,
                10563
            ],
            [
                10563,
                10681
            ],
            [
                10681,
                10781
            ],
            [
                10781,
                10843
            ],
            [
                10843,
                10971
            ],
            [
                10971,
                11027
            ],
            [
                11027,
                11100
            ],
            [
                11100,
                11134
            ],
            [
                11134,
                11147
            ],
            [
                11147,
                11159
            ],
            [
                11159,
                11211
            ],
            [
                11211,
                11306
            ],
            [
                11306,
                11378
            ],
            [
                11378,
                11405
            ],
            [
                11405,
                11449
            ],
            [
                11449,
                11514
            ],
            [
                11514,
                11581
            ],
            [
                11581,
                11614
            ],
            [
                11614,
                11641
            ],
            [
                11641,
                11774
            ],
            [
                11774,
                11823
            ],
            [
                11823,
                12004
            ]
        ]
    }
}