{
    "original": {
        "text": "Melmotte had got back his daughter, and was half inclined to let the matter rest there. He would probably have done so had he not known that all his own household were aware that she had gone off to meet Sir Felix Carbury, and had he not also received the condolence of certain friends in the city. It seemed that about two o'clock in the day the matter was known to everybody. Of course Lord Nidderdale would hear of it, and if so all the trouble that he had taken in that direction would have been taken in vain. Stupid fool of a girl to throw away her chance,--nay, to throw away the certainty of a brilliant career, in that way! But his anger against Sir Felix was infinitely more bitter than his anger against his daughter. The man had pledged himself to abstain from any step of this kind,--had given a written pledge,--had renounced under his own signature his intention of marrying Marie! Melmotte had of course learned all the details of the cheque for 250,--how the money had been paid at the bank to Didon, and how Didon had given it to Sir Felix. Marie herself acknowledged that Sir Felix had received the money. If possible he would prosecute the baronet for stealing his money.\nHad Melmotte been altogether a prudent man he would probably have been satisfied with getting back his daughter and would have allowed the money to go without further trouble. At this especial point in his career ready money was very valuable to him, but his concerns were of such magnitude that 250 could make but little difference. But there had grown upon the man during the last few months an arrogance, a self-confidence inspired in him by the worship of other men, which clouded his intellect, and robbed him of much of that power of calculation which undoubtedly he naturally possessed. He remembered perfectly his various little transactions with Sir Felix. Indeed it was one of his gifts to remember with accuracy all money transactions, whether great or small, and to keep an account book in his head, which was always totted up and balanced with accuracy. He knew exactly how he stood, even with the crossing-sweeper to whom he had given a penny last Tuesday, as with the Longestaffes, father and son, to whom he had not as yet made any payment on behalf of the purchase of Pickering. But Sir Felix's money had been consigned into his hands for the purchase of shares,--and that consignment did not justify Sir Felix in taking another sum of money from his daughter. In such a matter he thought that an English magistrate, and an English jury, would all be on his side,--especially as he was Augustus Melmotte, the man about to be chosen for Westminster, the man about to entertain the Emperor of China!\nThe next day was Friday,--the day of the Railway Board. Early in the morning he sent a note to Lord Nidderdale.\nMY DEAR NIDDERDALE,--\nPray come to the Board to-day;--or at any rate come to me in the city. I specially want to speak to you.\nYours,\nA. M.\nThis he wrote, having made up his mind that it would be wise to make a clear breast of it with his hoped-for son-in-law. If there was still a chance of keeping the young lord to his guns that chance would be best supported by perfect openness on his part. The young lord would of course know what Marie had done. But the young lord had for some weeks past been aware that there had been a difficulty in regard to Sir Felix Carbury, and had not on that account relaxed his suit. It might be possible to persuade the young lord that as the young lady had now tried to elope and tried in vain, his own chance might on the whole be rather improved than injured.\nMr. Melmotte on that morning had many visitors, among whom one of the earliest and most unfortunate was Mr. Longestaffe. At that time there had been arranged at the offices in Abchurch Lane a mode of double ingress and egress,--a front stairs and a back stairs approach and exit, as is always necessary with very great men,--in reference to which arrangement the honour and dignity attached to each is exactly contrary to that which generally prevails in the world; the front stairs being intended for everybody, and being both slow and uncertain, whereas the back stairs are quick and sure, and are used only for those who are favoured. Miles Grendall had the command of the stairs, and found that he had plenty to do in keeping people in their right courses. Mr. Longestaffe reached Abchurch Lane before one,--having altogether failed in getting a moment's private conversation with the big man on that other Friday, when he had come later. He fell at once into Miles's hands, and was ushered through the front stairs passage and into the front stairs waiting-room, with much external courtesy. Miles Grendall was very voluble. Did Mr. Longestaffe want to see Mr. Melmotte? Oh;--Mr. Longestaffe wanted to see Mr. Melmotte as soon as possible! Of course Mr. Longestaffe should see Mr. Melmotte. He, Miles, knew that Mr. Melmotte was particularly desirous of seeing Mr. Longestaffe. Mr. Melmotte had mentioned Mr. Longestaffe's name twice during the last three days. Would Mr. Longestaffe sit down for a few minutes? Had Mr. Longestaffe seen the \"Morning Breakfast Table\"? Mr. Melmotte undoubtedly was very much engaged. At this moment a deputation from the Canadian Government was with him;--and Sir Gregory Gribe was in the office waiting for a few words. But Miles thought that the Canadian Government would not be long,--and as for Sir Gregory, perhaps his business might be postponed. Miles would do his very best to get an interview for Mr. Longestaffe,--more especially as Mr. Melmotte was so very desirous himself of seeing his friend. It was astonishing that such a one as Miles Grendall should have learned his business so well and should have made himself so handy! We will leave Mr. Longestaffe with the \"Morning Breakfast Table\" in his hands, in the front waiting-room, merely notifying the fact that there he remained for something over two hours.\nIn the mean time both Mr. Broune and Lord Nidderdale came to the office, and both were received without delay. Mr. Broune was the first. Miles knew who he was, and made no attempt to seat him in the same room with Mr. Longestaffe. \"I'll just send him a note,\" said Mr. Broune, and he scrawled a few words at the office counter. \"I'm commissioned to pay you some money on behalf of Miss Melmotte.\" Those were the words, and they at once procured him admission to the sanctum. The Canadian Deputation must have taken its leave, and Sir Gregory could hardly have as yet arrived. Lord Nidderdale, who had presented himself almost at the same moment with the Editor, was shown into a little private room,--which was, indeed, Miles Grendall's own retreat. \"What's up with the Governor?\" asked the young lord.\n\"Anything particular do you mean?\" said Miles. \"There are always so many things up here.\"\n\"He has sent for me.\"\n\"Yes,--you'll go in directly. There's that fellow who does the 'Breakfast Table' in with him. I don't know what he's come about. You know what he has sent for you for?\"\nLord Nidderdale answered this question by another. \"I suppose all this about Miss Melmotte is true?\"\n\"She did go off yesterday morning,\" said Miles, in a whisper.\n\"But Carbury wasn't with her.\"\n\"Well, no;--I suppose not. He seems to have mulled it. He's such a d---- brute, he'd be sure to go wrong whatever he had in hand.\"\n\"You don't like him, of course, Miles. For that matter I've no reason to love him. He couldn't have gone. He staggered out of the club yesterday morning at four o'clock as drunk as Cloe. He'd lost a pot of money, and had been kicking up a row about you for the last hour.\"\n\"Brute!\" exclaimed Miles, with honest indignation.\n\"I dare say. But though he was able to make a row, I'm sure he couldn't get himself down to Liverpool. And I saw all his things lying about the club hall late last night;--no end of portmanteaux and bags; just what a fellow would take to New York. By George! Fancy taking a girl to New York! It was plucky.\"\n\"It was all her doing,\" said Miles, who was of course intimate with Mr. Melmotte's whole establishment, and had had means therefore of hearing the true story.\n\"What a fiasco!\" said the young lord, \"I wonder what the old boy means to say to me about it.\" Then there was heard the clear tingle of a little silver bell, and Miles told Lord Nidderdale that his time had come.\nMr. Broune had of late been very serviceable to Mr. Melmotte, and Melmotte was correspondingly gracious. On seeing the Editor he immediately began to make a speech of thanks in respect of the support given by the \"Breakfast Table\" to his candidature. But Mr. Broune cut him short. \"I never talk about the 'Breakfast Table,'\" said he. \"We endeavour to get along as right as we can, and the less said the soonest mended.\" Melmotte bowed. \"I have come now about quite another matter, and perhaps, the less said the sooner mended about that also. Sir Felix Carbury on a late occasion received a sum of money in trust from your daughter. Circumstances have prevented its use in the intended manner, and, therefore, as Sir Felix's friend, I have called to return the money to you.\" Mr. Broune did not like calling himself the friend of Sir Felix, but he did even that for the lady who had been good enough to him not to marry him.\n\"Oh, indeed,\" said Mr. Melmotte, with a scowl on his face, which he would have repressed if he could.\n\"No doubt you understand all about it.\"\n\"Yes;--I understand. D---- scoundrel!\"\n\"We won't discuss that, Mr. Melmotte. I've drawn a cheque myself, payable to your order,--to make the matter all straight. The sum was 250, I think.\" And Mr. Broune put a cheque for that amount down upon the table.\n\"I dare say it's all right,\" said Mr. Melmotte. \"But, remember, I don't think that this absolves him. He has been a scoundrel.\"\n\"At any rate he has paid back the money, which chance put into his hands, to the only person entitled to receive it on the young lady's behalf. Good morning.\" Mr. Melmotte did put out his hand in token of amity. Then Mr. Broune departed and Melmotte tinkled his bell. As Nidderdale was shown in he crumpled up the cheque, and put it into his pocket. He was at once clever enough to perceive that any idea which he might have had of prosecuting Sir Felix must be abandoned. \"Well, my Lord, and how are you?\" said he with his pleasantest smile. Nidderdale declared himself to be as fresh as paint. \"You don't look down in the mouth, my Lord.\"\nThen Lord Nidderdale,--who no doubt felt that it behoved him to show a good face before his late intended father-in-law,--sang the refrain of an old song, which it is trusted my readers may remember.\n\"Cheer up, Sam; Don't let your spirits go down. There's many a girl that I know well, Is waiting for you in the town.\"\n\"Ha, ha, ha,\" laughed Melmotte, \"very good. I've no doubt there is,--many a one. But you won't let this stupid nonsense stand in your way with Marie.\"\n\"Upon my word, sir, I don't know about that. Miss Melmotte has given the most convincing proof of her partiality for another gentleman, and of her indifference to me.\"\n\"A foolish baggage! A silly little romantic baggage! She's been reading novels till she has learned to think she couldn't settle down quietly till she had run off with somebody.\"\n\"She doesn't seem to have succeeded on this occasion, Mr. Melmotte.\"\n\"No;--of course we had her back again from Liverpool.\"\n\"But they say that she got further than the gentleman.\"\n\"He is a dishonest, drunken scoundrel. My girl knows very well what he is now. She'll never try that game again. Of course, my Lord, I'm very sorry. You know that I've been on the square with you always. She's my only child, and sooner or later she must have all that I possess. What she will have at once will make any man wealthy,--that is, if she marries with my sanction; and in a year or two I expect that I shall be able to double what I give her now, without touching my capital. Of course you understand that I desire to see her occupying high rank. I think that, in this country, that is a noble object of ambition. Had she married that sweep I should have broken my heart. Now, my Lord, I want you to say that this shall make no difference to you. I am very honest with you. I do not try to hide anything. The thing of course has been a misfortune. Girls will be romantic. But you may be sure that this little accident will assist rather than impede your views. After this she will not be very fond of Sir Felix Carbury.\"\n\"I dare say not. Though, by Jove, girls will forgive anything.\"\n\"She won't forgive him. By George, she shan't. She shall hear the whole story. You'll come and see her just the same as ever!\"\n\"I don't know about that, Mr. Melmotte.\"\n\"Why not? You're not so weak as to surrender all your settled projects for such a piece of folly as that! He didn't even see her all the time.\"\n\"That wasn't her fault.\"\n\"The money will all be there, Lord Nidderdale.\"\n\"The money's all right, I've no doubt. And there isn't a man in all London would be better pleased to settle down with a good income than I would. But, by Jove, it's a rather strong order when a girl has just run away with another man. Everybody knows it.\"\n\"In three months' time everybody will have forgotten it.\"\n\"To tell you the truth, sir, I think Miss Melmotte has got a will of her own stronger than you give her credit for. She has never given me the slightest encouragement. Ever so long ago, about Christmas, she did once say that she would do as you bade her. But she is very much changed since then. The thing was off.\"\n\"She had nothing to do with that.\"\n\"No;--but she has taken advantage of it, and I have no right to complain.\"\n\"You just come to the house, and ask her again to-morrow. Or come on Sunday morning. Don't let us be done out of all our settled arrangements by the folly of an idle girl. Will you come on Sunday morning about noon?\" Lord Nidderdale thought of his position for a few moments and then said that perhaps he would come on Sunday morning. After that Melmotte proposed that they two should go and \"get a bit of lunch\" at a certain Conservative club in the City. There would be time before the meeting of the Railway Board. Nidderdale had no objection to the lunch, but expressed a strong opinion that the Board was \"rot.\" \"That's all very well for you, young man,\" said the chairman, \"but I must go there in order that you may be able to enjoy a splendid fortune.\" Then he touched the young man on the shoulder and drew him back as he was passing out by the front stairs. \"Come this way, Nidderdale;--come this way. I must get out without being seen. There are people waiting for me there who think that a man can attend to business from morning to night without ever having a bit in his mouth.\" And so they escaped by the back stairs.\nAt the club, the City Conservative world,--which always lunches well,--welcomed Mr. Melmotte very warmly. The election was coming on, and there was much to be said. He played the part of the big City man to perfection, standing about the room with his hat on, and talking loudly to a dozen men at once. And he was glad to show the club that Lord Nidderdale had come there with him. The club of course knew that Lord Nidderdale was the accepted suitor of the rich man's daughter,--accepted, that is, by the rich man himself,--and the club knew also that the rich man's daughter had tried,--but had failed,--to run away with Sir Felix Carbury. There is nothing like wiping out a misfortune and having done with it. The presence of Lord Nidderdale was almost an assurance to the club that the misfortune had been wiped out, and, as it were, abolished. A little before three Mr. Melmotte returned to Abchurch Lane, intending to regain his room by the back way; while Lord Nidderdale went westward, considering within his own mind whether it was expedient that he should continue to show himself as a suitor for Miss Melmotte's hand. He had an idea that a few years ago a man could not have done such a thing--that he would be held to show a poor spirit should he attempt it; but that now it did not much matter what a man did,--if only he were successful. \"After all it's only an affair of money,\" he said to himself.\nMr. Longestaffe in the meantime had progressed from weariness to impatience, from impatience to ill-humour, and from ill-humour to indignation. More than once he saw Miles Grendall, but Miles Grendall was always ready with an answer. That Canadian Deputation was determined to settle the whole business this morning, and would not take itself away. And Sir Gregory Gribe had been obstinate, beyond the ordinary obstinacy of a bank director. The rate of discount at the bank could not be settled for to-morrow without communication with Mr. Melmotte, and that was a matter on which the details were always most oppressive. At first Mr. Longestaffe was somewhat stunned by the Deputation and Sir Gregory Gribe; but as he waxed wroth the potency of those institutions dwindled away, and as, at last, he waxed hungry, they became as nothing to him. Was he not Mr. Longestaffe of Caversham, a Deputy-Lieutenant of his County, and accustomed to lunch punctually at two o'clock? When he had been in that waiting-room for two hours, it occurred to him that he only wanted his own, and that he would not remain there to be starved for any Mr. Melmotte in Europe. It occurred to him also that that thorn in his side, Squercum, would certainly get a finger into the pie to his infinite annoyance. Then he walked forth, and attempted to see Grendall for the fourth time. But Miles Grendall also liked his lunch, and was therefore declared by one of the junior clerks to be engaged at that moment on most important business with Mr. Melmotte. \"Then say that I can't wait any longer,\" said Mr. Longestaffe, stamping out of the room with angry feet.\nAt the very door he met Mr. Melmotte. \"Ah, Mr. Longestaffe,\" said the great financier, seizing him by the hand, \"you are the very man I am desirous of seeing.\"\n\"I have been waiting two hours up in your place,\" said the Squire of Caversham.\n\"Tut, tut, tut;--and they never told me!\"\n\"I spoke to Mr. Grendall half a dozen times.\"\n\"Yes,--yes. And he did put a slip with your name on it on my desk. I do remember. My dear sir, I have so many things on my brain, that I hardly know how to get along with them. You are coming to the Board? It's just the time now.\"\n\"No;\"--said Mr. Longestaffe. \"I can stay no longer in the City.\" It was cruel that a man so hungry should be asked to go to a Board by a chairman who had just lunched at his club.\n\"I was carried away to the Bank of England and could not help myself,\" said Melmotte. \"And when they get me there I can never get away again.\"\n\"My son is very anxious to have the payments made about Pickering,\" said Mr. Longestaffe, absolutely holding Melmotte by the collar of his coat.\n\"Payments for Pickering!\" said Melmotte, assuming an air of unimportant doubt,--of doubt as though the thing were of no real moment. \"Haven't they been made?\"\n\"Certainly not,\" said Mr. Longestaffe, \"unless made this morning.\"\n\"There was something about it, but I cannot just remember what. My second cashier, Mr. Smith, manages all my private affairs, and they go clean out of my head. I'm afraid he's in Grosvenor Square at this moment. Let me see;--Pickering! Wasn't there some question of a mortgage? I'm sure there was something about a mortgage.\"\n\"There was a mortgage, of course;--but that only made three payments necessary instead of two.\"\n\"But there was some unavoidable delay about the papers;--something occasioned by the mortgagee. I know there was. But you shan't be inconvenienced, Mr. Longestaffe.\"\n\"It's my son, Mr. Melmotte. He's got a lawyer of his own.\"\n\"I never knew a young man that wasn't in a hurry for his money,\" said Melmotte laughing. \"Oh, yes;--there were three payments to be made; one to you, one to your son, and one to the mortgagee. I will speak to Mr. Smith myself to-morrow--and you may tell your son that he really need not trouble his lawyer. He will only be losing his money, for lawyers are expensive. What; you won't come to the Board? I am sorry for that.\" Mr. Longestaffe, having after a fashion said what he had to say, declined to go to the Board. A painful rumour had reached him the day before, which had been communicated to him in a very quiet way by a very old friend,--by a member of a private firm of bankers whom he was accustomed to regard as the wisest and most eminent man of his acquaintance,--that Pickering had been already mortgaged to its full value by its new owner. \"Mind, I know nothing,\" said the banker. \"The report has reached me, and if it be true, it shows that Mr. Melmotte must be much pressed for money. It does not concern you at all if you have got your price. But it seems to be rather a quick transaction. I suppose you have, or he wouldn't have the title-deeds.\" Mr. Longestaffe thanked his friend, and acknowledged that there had been something remiss on his part. Therefore, as he went westward, he was low in spirits. But nevertheless he had been reassured by Melmotte's manner.\nSir Felix Carbury of course did not attend the Board; nor did Paul Montague, for reasons with which the reader has been made acquainted. Lord Nidderdale had declined, having had enough of the City for that day, and Mr. Longestaffe had been banished by hunger. The chairman was therefore supported only by Lord Alfred and Mr. Cohenlupe. But they were such excellent colleagues that the work was got through as well as though those absentees had all attended. When the Board was over Mr. Melmotte and Mr. Cohenlupe retired together.\n\"I must get that money for Longestaffe,\" said Melmotte to his friend.\n\"What, eighty thousand pounds! You can't do it this week,--nor yet before this day week.\"\n\"It isn't eighty thousand pounds. I've renewed the mortgage, and that makes it only fifty. If I can manage the half of that which goes to the son, I can put the father off.\"\n\"You must raise what you can on the whole property.\"\n\"I've done that already,\" said Melmotte hoarsely.\n\"And where's the money gone?\"\n\"Brehgert has had 40,000. I was obliged to keep it up with them. You can manage 25,000 for me by Monday?\" Mr. Cohenlupe said that he would try, but intimated his opinion that there would be considerable difficulty in the operation.",
        "paragraph_chars": [
            [
                0,
                1192
            ],
            [
                1192,
                2707
            ],
            [
                2707,
                2819
            ],
            [
                2819,
                2841
            ],
            [
                2841,
                2946
            ],
            [
                2946,
                2953
            ],
            [
                2953,
                2959
            ],
            [
                2959,
                3617
            ],
            [
                3617,
                5979
            ],
            [
                5979,
                6782
            ],
            [
                6782,
                6872
            ],
            [
                6872,
                6894
            ],
            [
                6894,
                7063
            ],
            [
                7063,
                7164
            ],
            [
                7164,
                7226
            ],
            [
                7226,
                7257
            ],
            [
                7257,
                7388
            ],
            [
                7388,
                7661
            ],
            [
                7661,
                7712
            ],
            [
                7712,
                8020
            ],
            [
                8020,
                8179
            ],
            [
                8179,
                8392
            ],
            [
                8392,
                9317
            ],
            [
                9317,
                9419
            ],
            [
                9419,
                9459
            ],
            [
                9459,
                9498
            ],
            [
                9498,
                9713
            ],
            [
                9713,
                9841
            ],
            [
                9841,
                10482
            ],
            [
                10482,
                10682
            ],
            [
                10682,
                10801
            ],
            [
                10801,
                10952
            ],
            [
                10952,
                11120
            ],
            [
                11120,
                11299
            ],
            [
                11299,
                11368
            ],
            [
                11368,
                11423
            ],
            [
                11423,
                11479
            ],
            [
                11479,
                12511
            ],
            [
                12511,
                12575
            ],
            [
                12575,
                12702
            ],
            [
                12702,
                12743
            ],
            [
                12743,
                12887
            ],
            [
                12887,
                12912
            ],
            [
                12912,
                12960
            ],
            [
                12960,
                13217
            ],
            [
                13217,
                13275
            ],
            [
                13275,
                13591
            ],
            [
                13591,
                13626
            ],
            [
                13626,
                13701
            ],
            [
                13701,
                14832
            ],
            [
                14832,
                16246
            ],
            [
                16246,
                17881
            ],
            [
                17881,
                18041
            ],
            [
                18041,
                18121
            ],
            [
                18121,
                18163
            ],
            [
                18163,
                18209
            ],
            [
                18209,
                18440
            ],
            [
                18440,
                18620
            ],
            [
                18620,
                18763
            ],
            [
                18763,
                18908
            ],
            [
                18908,
                19067
            ],
            [
                19067,
                19134
            ],
            [
                19134,
                19460
            ],
            [
                19460,
                19556
            ],
            [
                19556,
                19722
            ],
            [
                19722,
                19781
            ],
            [
                19781,
                21166
            ],
            [
                21166,
                21697
            ],
            [
                21697,
                21767
            ],
            [
                21767,
                21857
            ],
            [
                21857,
                22031
            ],
            [
                22031,
                22084
            ],
            [
                22084,
                22134
            ],
            [
                22134,
                22164
            ],
            [
                22164,
                22395
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                299
            ],
            [
                299,
                378
            ],
            [
                378,
                515
            ],
            [
                515,
                633
            ],
            [
                633,
                729
            ],
            [
                729,
                897
            ],
            [
                897,
                1059
            ],
            [
                1059,
                1125
            ],
            [
                1125,
                1192
            ],
            [
                1192,
                1368
            ],
            [
                1368,
                1526
            ],
            [
                1526,
                1786
            ],
            [
                1786,
                1858
            ],
            [
                1858,
                2059
            ],
            [
                2059,
                2288
            ],
            [
                2288,
                2470
            ],
            [
                2470,
                2707
            ],
            [
                2707,
                2763
            ],
            [
                2763,
                2819
            ],
            [
                2819,
                2841
            ],
            [
                2841,
                2912
            ],
            [
                2912,
                2946
            ],
            [
                2946,
                2953
            ],
            [
                2953,
                2959
            ],
            [
                2959,
                3080
            ],
            [
                3080,
                3215
            ],
            [
                3215,
                3272
            ],
            [
                3272,
                3437
            ],
            [
                3437,
                3617
            ],
            [
                3617,
                3738
            ],
            [
                3738,
                4255
            ],
            [
                4255,
                4378
            ],
            [
                4378,
                4560
            ],
            [
                4560,
                4714
            ],
            [
                4714,
                4747
            ],
            [
                4747,
                4793
            ],
            [
                4793,
                4862
            ],
            [
                4862,
                4913
            ],
            [
                4913,
                5000
            ],
            [
                5000,
                5084
            ],
            [
                5084,
                5134
            ],
            [
                5134,
                5190
            ],
            [
                5190,
                5238
            ],
            [
                5238,
                5375
            ],
            [
                5375,
                5507
            ],
            [
                5507,
                5661
            ],
            [
                5661,
                5794
            ],
            [
                5794,
                5979
            ],
            [
                5979,
                6090
            ],
            [
                6090,
                6116
            ],
            [
                6116,
                6210
            ],
            [
                6210,
                6307
            ],
            [
                6307,
                6376
            ],
            [
                6376,
                6454
            ],
            [
                6454,
                6555
            ],
            [
                6555,
                6729
            ],
            [
                6729,
                6760
            ],
            [
                6760,
                6782
            ],
            [
                6782,
                6817
            ],
            [
                6817,
                6829
            ],
            [
                6829,
                6872
            ],
            [
                6872,
                6894
            ],
            [
                6894,
                6924
            ],
            [
                6924,
                6988
            ],
            [
                6988,
                7023
            ],
            [
                7023,
                7063
            ],
            [
                7063,
                7114
            ],
            [
                7114,
                7164
            ],
            [
                7164,
                7226
            ],
            [
                7226,
                7257
            ],
            [
                7257,
                7284
            ],
            [
                7284,
                7312
            ],
            [
                7312,
                7388
            ],
            [
                7388,
                7427
            ],
            [
                7427,
                7471
            ],
            [
                7471,
                7494
            ],
            [
                7494,
                7575
            ],
            [
                7575,
                7661
            ],
            [
                7661,
                7670
            ],
            [
                7670,
                7712
            ],
            [
                7712,
                7725
            ],
            [
                7725,
                7815
            ],
            [
                7815,
                7960
            ],
            [
                7960,
                7971
            ],
            [
                7971,
                8004
            ],
            [
                8004,
                8020
            ],
            [
                8020,
                8179
            ],
            [
                8179,
                8196
            ],
            [
                8196,
                8274
            ],
            [
                8274,
                8392
            ],
            [
                8392,
                8497
            ],
            [
                8497,
                8643
            ],
            [
                8643,
                8673
            ],
            [
                8673,
                8726
            ],
            [
                8726,
                8812
            ],
            [
                8812,
                8828
            ],
            [
                8828,
                8935
            ],
            [
                8935,
                9025
            ],
            [
                9025,
                9168
            ],
            [
                9168,
                9317
            ],
            [
                9317,
                9419
            ],
            [
                9419,
                9459
            ],
            [
                9459,
                9480
            ],
            [
                9480,
                9498
            ],
            [
                9498,
                9536
            ],
            [
                9536,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9713
            ],
            [
                9713,
                9761
            ],
            [
                9761,
                9815
            ],
            [
                9815,
                9841
            ],
            [
                9841,
                9985
            ],
            [
                9985,
                10000
            ],
            [
                10000,
                10053
            ],
            [
                10053,
                10109
            ],
            [
                10109,
                10191
            ],
            [
                10191,
                10314
            ],
            [
                10314,
                10348
            ],
            [
                10348,
                10384
            ],
            [
                10384,
                10437
            ],
            [
                10437,
                10482
            ],
            [
                10482,
                10682
            ],
            [
                10682,
                10730
            ],
            [
                10730,
                10801
            ],
            [
                10801,
                10845
            ],
            [
                10845,
                10882
            ],
            [
                10882,
                10952
            ],
            [
                10952,
                10997
            ],
            [
                10997,
                11120
            ],
            [
                11120,
                11140
            ],
            [
                11140,
                11173
            ],
            [
                11173,
                11299
            ],
            [
                11299,
                11368
            ],
            [
                11368,
                11423
            ],
            [
                11423,
                11479
            ],
            [
                11479,
                11518
            ],
            [
                11518,
                11558
            ],
            [
                11558,
                11592
            ],
            [
                11592,
                11628
            ],
            [
                11628,
                11683
            ],
            [
                11683,
                11758
            ],
            [
                11758,
                11966
            ],
            [
                11966,
                12037
            ],
            [
                12037,
                12104
            ],
            [
                12104,
                12162
            ],
            [
                12162,
                12237
            ],
            [
                12237,
                12264
            ],
            [
                12264,
                12295
            ],
            [
                12295,
                12338
            ],
            [
                12338,
                12362
            ],
            [
                12362,
                12451
            ],
            [
                12451,
                12511
            ],
            [
                12511,
                12528
            ],
            [
                12528,
                12575
            ],
            [
                12575,
                12599
            ],
            [
                12599,
                12622
            ],
            [
                12622,
                12654
            ],
            [
                12654,
                12702
            ],
            [
                12702,
                12743
            ],
            [
                12743,
                12753
            ],
            [
                12753,
                12849
            ],
            [
                12849,
                12887
            ],
            [
                12887,
                12912
            ],
            [
                12912,
                12960
            ],
            [
                12960,
                12999
            ],
            [
                12999,
                13107
            ],
            [
                13107,
                13196
            ],
            [
                13196,
                13217
            ],
            [
                13217,
                13275
            ],
            [
                13275,
                13391
            ],
            [
                13391,
                13443
            ],
            [
                13443,
                13530
            ],
            [
                13530,
                13571
            ],
            [
                13571,
                13591
            ],
            [
                13591,
                13626
            ],
            [
                13626,
                13701
            ],
            [
                13701,
                13759
            ],
            [
                13759,
                13786
            ],
            [
                13786,
                13873
            ],
            [
                13873,
                13918
            ],
            [
                13918,
                14036
            ],
            [
                14036,
                14158
            ],
            [
                14158,
                14219
            ],
            [
                14219,
                14318
            ],
            [
                14318,
                14461
            ],
            [
                14461,
                14568
            ],
            [
                14568,
                14612
            ],
            [
                14612,
                14647
            ],
            [
                14647,
                14792
            ],
            [
                14792,
                14832
            ],
            [
                14832,
                14938
            ],
            [
                14938,
                14997
            ],
            [
                14997,
                15135
            ],
            [
                15135,
                15214
            ],
            [
                15214,
                15474
            ],
            [
                15474,
                15545
            ],
            [
                15545,
                15681
            ],
            [
                15681,
                15961
            ],
            [
                15961,
                16184
            ],
            [
                16184,
                16246
            ],
            [
                16246,
                16390
            ],
            [
                16390,
                16480
            ],
            [
                16480,
                16595
            ],
            [
                16595,
                16687
            ],
            [
                16687,
                16868
            ],
            [
                16868,
                17091
            ],
            [
                17091,
                17218
            ],
            [
                17218,
                17400
            ],
            [
                17400,
                17532
            ],
            [
                17532,
                17605
            ],
            [
                17605,
                17776
            ],
            [
                17776,
                17881
            ],
            [
                17881,
                17919
            ],
            [
                17919,
                18041
            ],
            [
                18041,
                18121
            ],
            [
                18121,
                18163
            ],
            [
                18163,
                18209
            ],
            [
                18209,
                18221
            ],
            [
                18221,
                18276
            ],
            [
                18276,
                18291
            ],
            [
                18291,
                18386
            ],
            [
                18386,
                18415
            ],
            [
                18415,
                18440
            ],
            [
                18440,
                18469
            ],
            [
                18469,
                18505
            ],
            [
                18505,
                18620
            ],
            [
                18620,
                18706
            ],
            [
                18706,
                18763
            ],
            [
                18763,
                18908
            ],
            [
                18908,
                18934
            ],
            [
                18934,
                19041
            ],
            [
                19041,
                19067
            ],
            [
                19067,
                19134
            ],
            [
                19134,
                19198
            ],
            [
                19198,
                19294
            ],
            [
                19294,
                19346
            ],
            [
                19346,
                19370
            ],
            [
                19370,
                19412
            ],
            [
                19412,
                19460
            ],
            [
                19460,
                19556
            ],
            [
                19556,
                19652
            ],
            [
                19652,
                19670
            ],
            [
                19670,
                19722
            ],
            [
                19722,
                19750
            ],
            [
                19750,
                19781
            ],
            [
                19781,
                19870
            ],
            [
                19870,
                19974
            ],
            [
                19974,
                20088
            ],
            [
                20088,
                20149
            ],
            [
                20149,
                20184
            ],
            [
                20184,
                20206
            ],
            [
                20206,
                20300
            ],
            [
                20300,
                20636
            ],
            [
                20636,
                20677
            ],
            [
                20677,
                20783
            ],
            [
                20783,
                20842
            ],
            [
                20842,
                20889
            ],
            [
                20889,
                20947
            ],
            [
                20947,
                21050
            ],
            [
                21050,
                21105
            ],
            [
                21105,
                21166
            ],
            [
                21166,
                21303
            ],
            [
                21303,
                21426
            ],
            [
                21426,
                21502
            ],
            [
                21502,
                21624
            ],
            [
                21624,
                21697
            ],
            [
                21697,
                21767
            ],
            [
                21767,
                21798
            ],
            [
                21798,
                21857
            ],
            [
                21857,
                21891
            ],
            [
                21891,
                21948
            ],
            [
                21948,
                22031
            ],
            [
                22031,
                22084
            ],
            [
                22084,
                22134
            ],
            [
                22134,
                22164
            ],
            [
                22164,
                22190
            ],
            [
                22190,
                22229
            ],
            [
                22229,
                22270
            ],
            [
                22270,
                22395
            ]
        ],
        "overlap_chars": [
            [
                0,
                88
            ],
            [
                88,
                122
            ],
            [
                126,
                129
            ],
            [
                130,
                135
            ],
            [
                174,
                221
            ],
            [
                297,
                299
            ],
            [
                378,
                425
            ],
            [
                432,
                489
            ],
            [
                506,
                515
            ],
            [
                515,
                561
            ],
            [
                620,
                632
            ],
            [
                633,
                729
            ],
            [
                729,
                736
            ],
            [
                797,
                823
            ],
            [
                757,
                759
            ],
            [
                890,
                897
            ],
            [
                897,
                965
            ],
            [
                1057,
                1059
            ],
            [
                1059,
                1064
            ],
            [
                1073,
                1125
            ],
            [
                1125,
                1171
            ],
            [
                1190,
                1192
            ],
            [
                1192,
                1209
            ],
            [
                1223,
                1230
            ],
            [
                1235,
                1237
            ],
            [
                1308,
                1368
            ],
            [
                1368,
                1375
            ],
            [
                1385,
                1390
            ],
            [
                1405,
                1442
            ],
            [
                1447,
                1502
            ],
            [
                1507,
                1526
            ],
            [
                1526,
                1529
            ],
            [
                1559,
                1585
            ],
            [
                1530,
                1545
            ],
            [
                1627,
                1633
            ],
            [
                1586,
                1626
            ],
            [
                1634,
                1690
            ],
            [
                1784,
                1785
            ],
            [
                1786,
                1858
            ],
            [
                1858,
                1900
            ],
            [
                1915,
                1937
            ],
            [
                2057,
                2059
            ],
            [
                2288,
                2318
            ],
            [
                2344,
                2371
            ],
            [
                2373,
                2376
            ],
            [
                2394,
                2429
            ],
            [
                2445,
                2470
            ],
            [
                2487,
                2524
            ],
            [
                2547,
                2552
            ],
            [
                2557,
                2571
            ],
            [
                2574,
                2707
            ],
            [
                2707,
                2731
            ],
            [
                2784,
                2817
            ],
            [
                2864,
                2866
            ],
            [
                2846,
                2853
            ],
            [
                2744,
                2762
            ],
            [
                2964,
                2966
            ],
            [
                2998,
                3029
            ],
            [
                3036,
                3080
            ],
            [
                3215,
                3272
            ],
            [
                3272,
                3275
            ],
            [
                3291,
                3294
            ],
            [
                3326,
                3336
            ],
            [
                3346,
                3390
            ],
            [
                3395,
                3402
            ],
            [
                3427,
                3437
            ],
            [
                3437,
                3469
            ],
            [
                3485,
                3489
            ],
            [
                3550,
                3557
            ],
            [
                3565,
                3570
            ],
            [
                3512,
                3515
            ],
            [
                3584,
                3586
            ],
            [
                3594,
                3602
            ],
            [
                3587,
                3593
            ],
            [
                3603,
                3617
            ],
            [
                3617,
                3664
            ],
            [
                3721,
                3738
            ],
            [
                3782,
                3806
            ],
            [
                3757,
                3760
            ],
            [
                3845,
                3877
            ],
            [
                4081,
                4129
            ],
            [
                4165,
                4188
            ],
            [
                4222,
                4240
            ],
            [
                4245,
                4255
            ],
            [
                4255,
                4304
            ],
            [
                4536,
                4540
            ],
            [
                4378,
                4415
            ],
            [
                4426,
                4427
            ],
            [
                4316,
                4318
            ],
            [
                4473,
                4475
            ],
            [
                4376,
                4377
            ],
            [
                4604,
                4611
            ],
            [
                4612,
                4657
            ],
            [
                4671,
                4694
            ],
            [
                4704,
                4714
            ],
            [
                4800,
                4813
            ],
            [
                4824,
                4860
            ],
            [
                5084,
                5134
            ],
            [
                5190,
                5202
            ],
            [
                5215,
                5238
            ],
            [
                5238,
                5308
            ],
            [
                5375,
                5397
            ],
            [
                5422,
                5439
            ],
            [
                5505,
                5507
            ],
            [
                5507,
                5575
            ],
            [
                5599,
                5600
            ],
            [
                5794,
                5823
            ],
            [
                5873,
                5906
            ],
            [
                5926,
                5930
            ],
            [
                5937,
                5948
            ],
            [
                5931,
                5936
            ],
            [
                5949,
                5952
            ],
            [
                5963,
                5979
            ],
            [
                5979,
                5985
            ],
            [
                5996,
                6055
            ],
            [
                6061,
                6090
            ],
            [
                6090,
                6115
            ],
            [
                6307,
                6331
            ],
            [
                6336,
                6373
            ],
            [
                6391,
                6396
            ],
            [
                6407,
                6454
            ],
            [
                6454,
                6503
            ],
            [
                6553,
                6554
            ],
            [
                6555,
                6579
            ],
            [
                6598,
                6623
            ],
            [
                6639,
                6677
            ],
            [
                6727,
                6728
            ],
            [
                6782,
                6783
            ],
            [
                6901,
                6922
            ],
            [
                6817,
                6828
            ],
            [
                7114,
                7163
            ],
            [
                7068,
                7078
            ],
            [
                7112,
                7113
            ],
            [
                7164,
                7226
            ],
            [
                7226,
                7254
            ],
            [
                7494,
                7556
            ],
            [
                7560,
                7565
            ],
            [
                7573,
                7575
            ],
            [
                7575,
                7640
            ],
            [
                7658,
                7661
            ],
            [
                7661,
                7670
            ],
            [
                7670,
                7712
            ],
            [
                7712,
                7725
            ],
            [
                7725,
                7728
            ],
            [
                7763,
                7815
            ],
            [
                7815,
                7881
            ],
            [
                7958,
                7960
            ],
            [
                7960,
                7971
            ],
            [
                8180,
                8196
            ],
            [
                8196,
                8215
            ],
            [
                8217,
                8273
            ],
            [
                8274,
                8392
            ],
            [
                8444,
                8452
            ],
            [
                8403,
                8406
            ],
            [
                8415,
                8424
            ],
            [
                8487,
                8495
            ],
            [
                8437,
                8443
            ],
            [
                8396,
                8402
            ],
            [
                8452,
                8453
            ],
            [
                8497,
                8499
            ],
            [
                8577,
                8604
            ],
            [
                8616,
                8621
            ],
            [
                8623,
                8643
            ],
            [
                8643,
                8661
            ],
            [
                8666,
                8671
            ],
            [
                8671,
                8672
            ],
            [
                8673,
                8696
            ],
            [
                8708,
                8713
            ],
            [
                8717,
                8726
            ],
            [
                8828,
                8840
            ],
            [
                8845,
                8871
            ],
            [
                8933,
                8935
            ],
            [
                8935,
                8952
            ],
            [
                8972,
                9023
            ],
            [
                9084,
                9089
            ],
            [
                9102,
                9148
            ],
            [
                9159,
                9168
            ],
            [
                9168,
                9291
            ],
            [
                9299,
                9317
            ],
            [
                9317,
                9362
            ],
            [
                9417,
                9418
            ],
            [
                9480,
                9481
            ],
            [
                9486,
                9498
            ],
            [
                9498,
                9536
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9691
            ],
            [
                9697,
                9712
            ],
            [
                9985,
                9999
            ],
            [
                10053,
                10109
            ],
            [
                10109,
                10138
            ],
            [
                10167,
                10170
            ],
            [
                10151,
                10161
            ],
            [
                10174,
                10189
            ],
            [
                10161,
                10162
            ],
            [
                10237,
                10245
            ],
            [
                10270,
                10294
            ],
            [
                10189,
                10190
            ],
            [
                10314,
                10348
            ],
            [
                10348,
                10383
            ],
            [
                10384,
                10435
            ],
            [
                10470,
                10471
            ],
            [
                10543,
                10601
            ],
            [
                10609,
                10635
            ],
            [
                10682,
                10697
            ],
            [
                10698,
                10729
            ],
            [
                10730,
                10767
            ],
            [
                10768,
                10801
            ],
            [
                10801,
                10802
            ],
            [
                10806,
                10845
            ],
            [
                10882,
                10952
            ],
            [
                10952,
                10997
            ],
            [
                10997,
                11020
            ],
            [
                11030,
                11120
            ],
            [
                11140,
                11173
            ],
            [
                11173,
                11232
            ],
            [
                11271,
                11274
            ],
            [
                11275,
                11299
            ],
            [
                11299,
                11368
            ],
            [
                11368,
                11372
            ],
            [
                11374,
                11423
            ],
            [
                11423,
                11479
            ],
            [
                11479,
                11518
            ],
            [
                11518,
                11531
            ],
            [
                11553,
                11558
            ],
            [
                11592,
                11628
            ],
            [
                11628,
                11651
            ],
            [
                11659,
                11683
            ],
            [
                11683,
                11758
            ],
            [
                11859,
                11966
            ],
            [
                11966,
                12037
            ],
            [
                12162,
                12177
            ],
            [
                12199,
                12237
            ],
            [
                12264,
                12295
            ],
            [
                12315,
                12338
            ],
            [
                12338,
                12362
            ],
            [
                12451,
                12511
            ],
            [
                12511,
                12528
            ],
            [
                12528,
                12575
            ],
            [
                12575,
                12599
            ],
            [
                12622,
                12654
            ],
            [
                12654,
                12702
            ],
            [
                12702,
                12743
            ],
            [
                12912,
                12960
            ],
            [
                12960,
                12999
            ],
            [
                13107,
                13196
            ],
            [
                13196,
                13217
            ],
            [
                13217,
                13233
            ],
            [
                13240,
                13275
            ],
            [
                13275,
                13391
            ],
            [
                13391,
                13441
            ],
            [
                13701,
                13747
            ],
            [
                13759,
                13761
            ],
            [
                13767,
                13784
            ],
            [
                13918,
                13941
            ],
            [
                13958,
                14036
            ],
            [
                14036,
                14074
            ],
            [
                14079,
                14092
            ],
            [
                14107,
                14112
            ],
            [
                14114,
                14118
            ],
            [
                14127,
                14144
            ],
            [
                14178,
                14219
            ],
            [
                14219,
                14317
            ],
            [
                14318,
                14422
            ],
            [
                14434,
                14458
            ],
            [
                14569,
                14595
            ],
            [
                14647,
                14770
            ],
            [
                14789,
                14792
            ],
            [
                14792,
                14795
            ],
            [
                14799,
                14832
            ],
            [
                14832,
                14844
            ],
            [
                14912,
                14924
            ],
            [
                14930,
                14936
            ],
            [
                14936,
                14938
            ],
            [
                14997,
                15050
            ],
            [
                15096,
                15135
            ],
            [
                15139,
                15214
            ],
            [
                15214,
                15242
            ],
            [
                15397,
                15418
            ],
            [
                15438,
                15472
            ],
            [
                15357,
                15360
            ],
            [
                15243,
                15258
            ],
            [
                15298,
                15300
            ],
            [
                15549,
                15557
            ],
            [
                15259,
                15262
            ],
            [
                15588,
                15600
            ],
            [
                15613,
                15651
            ],
            [
                15472,
                15473
            ],
            [
                15681,
                15837
            ],
            [
                15858,
                15865
            ],
            [
                15888,
                15909
            ],
            [
                15926,
                15960
            ],
            [
                16184,
                16246
            ],
            [
                16246,
                16390
            ],
            [
                16418,
                16426
            ],
            [
                16480,
                16484
            ],
            [
                16530,
                16533
            ],
            [
                16485,
                16504
            ],
            [
                16567,
                16595
            ],
            [
                17104,
                17105
            ],
            [
                17113,
                17117
            ],
            [
                17091,
                17094
            ],
            [
                17171,
                17216
            ],
            [
                17167,
                17170
            ],
            [
                17328,
                17340
            ],
            [
                17357,
                17375
            ],
            [
                17380,
                17400
            ],
            [
                17537,
                17539
            ],
            [
                17558,
                17605
            ],
            [
                17605,
                17706
            ],
            [
                17730,
                17775
            ],
            [
                17776,
                17851
            ],
            [
                17879,
                17881
            ],
            [
                17881,
                17887
            ],
            [
                17893,
                17919
            ],
            [
                17919,
                18016
            ],
            [
                18038,
                18041
            ],
            [
                18041,
                18071
            ],
            [
                18088,
                18121
            ],
            [
                18121,
                18130
            ],
            [
                18135,
                18136
            ],
            [
                18138,
                18163
            ],
            [
                18163,
                18209
            ],
            [
                18209,
                18214
            ],
            [
                18216,
                18221
            ],
            [
                18276,
                18291
            ],
            [
                18291,
                18386
            ],
            [
                18386,
                18413
            ],
            [
                18440,
                18443
            ],
            [
                18447,
                18469
            ],
            [
                18469,
                18502
            ],
            [
                18764,
                18828
            ],
            [
                18908,
                18934
            ],
            [
                18934,
                18967
            ],
            [
                18980,
                18985
            ],
            [
                19039,
                19041
            ],
            [
                19041,
                19067
            ],
            [
                19067,
                19134
            ],
            [
                19134,
                19198
            ],
            [
                19198,
                19294
            ],
            [
                19359,
                19370
            ],
            [
                19370,
                19410
            ],
            [
                19460,
                19461
            ],
            [
                19483,
                19492
            ],
            [
                19461,
                19481
            ],
            [
                19492,
                19493
            ],
            [
                19499,
                19503
            ],
            [
                19509,
                19556
            ],
            [
                19556,
                19611
            ],
            [
                19613,
                19652
            ],
            [
                19652,
                19670
            ],
            [
                19670,
                19722
            ],
            [
                19722,
                19750
            ],
            [
                19750,
                19781
            ],
            [
                19781,
                19859
            ],
            [
                19860,
                19870
            ],
            [
                19870,
                19879
            ],
            [
                19881,
                19974
            ],
            [
                19974,
                19999
            ],
            [
                20009,
                20010
            ],
            [
                20018,
                20021
            ],
            [
                20030,
                20088
            ],
            [
                20155,
                20182
            ],
            [
                20206,
                20221
            ],
            [
                20271,
                20279
            ],
            [
                20298,
                20300
            ],
            [
                20300,
                20348
            ],
            [
                20364,
                20376
            ],
            [
                20404,
                20425
            ],
            [
                20430,
                20467
            ],
            [
                20558,
                20636
            ],
            [
                20636,
                20637
            ],
            [
                20709,
                20711
            ],
            [
                20718,
                20722
            ],
            [
                20657,
                20675
            ],
            [
                20641,
                20642
            ],
            [
                20677,
                20678
            ],
            [
                20724,
                20783
            ],
            [
                20783,
                20842
            ],
            [
                20889,
                20946
            ],
            [
                21005,
                21010
            ],
            [
                21059,
                21063
            ],
            [
                20949,
                20950
            ],
            [
                20958,
                20962
            ],
            [
                21080,
                21105
            ],
            [
                21105,
                21166
            ],
            [
                21166,
                21241
            ],
            [
                21301,
                21303
            ],
            [
                21303,
                21322
            ],
            [
                21340,
                21426
            ],
            [
                21426,
                21502
            ],
            [
                21502,
                21505
            ],
            [
                21547,
                21582
            ],
            [
                21590,
                21622
            ],
            [
                21648,
                21697
            ],
            [
                21697,
                21767
            ],
            [
                21767,
                21796
            ],
            [
                21857,
                21882
            ],
            [
                21889,
                21891
            ],
            [
                21891,
                21948
            ],
            [
                21948,
                21963
            ],
            [
                21968,
                21975
            ],
            [
                21995,
                22002
            ],
            [
                22002,
                22031
            ],
            [
                22031,
                22084
            ],
            [
                22084,
                22134
            ],
            [
                22134,
                22164
            ],
            [
                22164,
                22190
            ],
            [
                22229,
                22270
            ],
            [
                22270,
                22311
            ],
            [
                22334,
                22338
            ],
            [
                22345,
                22353
            ],
            [
                22394,
                22395
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                299
            ],
            [
                299,
                378
            ],
            [
                378,
                515
            ],
            [
                515,
                633
            ],
            [
                633,
                729
            ],
            [
                729,
                897
            ],
            [
                897,
                1059
            ],
            [
                1059,
                1125
            ],
            [
                1125,
                1192
            ],
            [
                1192,
                1368
            ],
            [
                1368,
                1526
            ],
            [
                1526,
                1786
            ],
            [
                1786,
                1858
            ],
            [
                1858,
                2059
            ],
            [
                2059,
                2288
            ],
            [
                2288,
                2470
            ],
            [
                2470,
                2707
            ],
            [
                2707,
                2959
            ],
            [
                2959,
                3080
            ],
            [
                3080,
                3215
            ],
            [
                3215,
                3272
            ],
            [
                3272,
                3437
            ],
            [
                3437,
                3617
            ],
            [
                3617,
                3738
            ],
            [
                3738,
                4255
            ],
            [
                4255,
                4560
            ],
            [
                4560,
                4714
            ],
            [
                4714,
                4747
            ],
            [
                4747,
                4793
            ],
            [
                4793,
                4862
            ],
            [
                4862,
                4913
            ],
            [
                4913,
                5000
            ],
            [
                5000,
                5084
            ],
            [
                5084,
                5134
            ],
            [
                5134,
                5190
            ],
            [
                5190,
                5238
            ],
            [
                5238,
                5507
            ],
            [
                5507,
                5661
            ],
            [
                5661,
                5794
            ],
            [
                5794,
                5979
            ],
            [
                5979,
                6090
            ],
            [
                6090,
                6116
            ],
            [
                6116,
                6210
            ],
            [
                6210,
                6307
            ],
            [
                6307,
                6454
            ],
            [
                6454,
                6555
            ],
            [
                6555,
                6729
            ],
            [
                6729,
                6760
            ],
            [
                6760,
                6782
            ],
            [
                6782,
                6924
            ],
            [
                6924,
                6988
            ],
            [
                6988,
                7023
            ],
            [
                7023,
                7063
            ],
            [
                7063,
                7164
            ],
            [
                7164,
                7226
            ],
            [
                7226,
                7257
            ],
            [
                7257,
                7284
            ],
            [
                7284,
                7312
            ],
            [
                7312,
                7388
            ],
            [
                7388,
                7427
            ],
            [
                7427,
                7471
            ],
            [
                7471,
                7494
            ],
            [
                7494,
                7575
            ],
            [
                7575,
                7661
            ],
            [
                7661,
                7670
            ],
            [
                7670,
                7712
            ],
            [
                7712,
                7725
            ],
            [
                7725,
                7815
            ],
            [
                7815,
                7960
            ],
            [
                7960,
                7971
            ],
            [
                7971,
                8004
            ],
            [
                8004,
                8020
            ],
            [
                8020,
                8179
            ],
            [
                8179,
                8196
            ],
            [
                8196,
                8274
            ],
            [
                8274,
                8392
            ],
            [
                8392,
                8643
            ],
            [
                8643,
                8673
            ],
            [
                8673,
                8726
            ],
            [
                8726,
                8812
            ],
            [
                8812,
                8828
            ],
            [
                8828,
                8935
            ],
            [
                8935,
                9168
            ],
            [
                9168,
                9317
            ],
            [
                9317,
                9419
            ],
            [
                9419,
                9459
            ],
            [
                9459,
                9480
            ],
            [
                9480,
                9498
            ],
            [
                9498,
                9536
            ],
            [
                9536,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9713
            ],
            [
                9713,
                9761
            ],
            [
                9761,
                9815
            ],
            [
                9815,
                9841
            ],
            [
                9841,
                9985
            ],
            [
                9985,
                10000
            ],
            [
                10000,
                10109
            ],
            [
                10109,
                10314
            ],
            [
                10314,
                10348
            ],
            [
                10348,
                10384
            ],
            [
                10384,
                10682
            ],
            [
                10682,
                10730
            ],
            [
                10730,
                10801
            ],
            [
                10801,
                10845
            ],
            [
                10845,
                10882
            ],
            [
                10882,
                10952
            ],
            [
                10952,
                10997
            ],
            [
                10997,
                11120
            ],
            [
                11120,
                11140
            ],
            [
                11140,
                11173
            ],
            [
                11173,
                11299
            ],
            [
                11299,
                11368
            ],
            [
                11368,
                11423
            ],
            [
                11423,
                11479
            ],
            [
                11479,
                11518
            ],
            [
                11518,
                11558
            ],
            [
                11558,
                11592
            ],
            [
                11592,
                11628
            ],
            [
                11628,
                11683
            ],
            [
                11683,
                11758
            ],
            [
                11758,
                11966
            ],
            [
                11966,
                12037
            ],
            [
                12037,
                12104
            ],
            [
                12104,
                12162
            ],
            [
                12162,
                12237
            ],
            [
                12237,
                12264
            ],
            [
                12264,
                12295
            ],
            [
                12295,
                12338
            ],
            [
                12338,
                12362
            ],
            [
                12362,
                12451
            ],
            [
                12451,
                12511
            ],
            [
                12511,
                12528
            ],
            [
                12528,
                12575
            ],
            [
                12575,
                12599
            ],
            [
                12599,
                12622
            ],
            [
                12622,
                12654
            ],
            [
                12654,
                12702
            ],
            [
                12702,
                12743
            ],
            [
                12743,
                12753
            ],
            [
                12753,
                12849
            ],
            [
                12849,
                12887
            ],
            [
                12887,
                12912
            ],
            [
                12912,
                12960
            ],
            [
                12960,
                12999
            ],
            [
                12999,
                13107
            ],
            [
                13107,
                13196
            ],
            [
                13196,
                13217
            ],
            [
                13217,
                13275
            ],
            [
                13275,
                13391
            ],
            [
                13391,
                13443
            ],
            [
                13443,
                13530
            ],
            [
                13530,
                13571
            ],
            [
                13571,
                13591
            ],
            [
                13591,
                13626
            ],
            [
                13626,
                13701
            ],
            [
                13701,
                13786
            ],
            [
                13786,
                13873
            ],
            [
                13873,
                13918
            ],
            [
                13918,
                14036
            ],
            [
                14036,
                14219
            ],
            [
                14219,
                14318
            ],
            [
                14318,
                14461
            ],
            [
                14461,
                14568
            ],
            [
                14568,
                14792
            ],
            [
                14792,
                14832
            ],
            [
                14832,
                14938
            ],
            [
                14938,
                14997
            ],
            [
                14997,
                15135
            ],
            [
                15135,
                15214
            ],
            [
                15214,
                15681
            ],
            [
                15681,
                15961
            ],
            [
                15961,
                16184
            ],
            [
                16184,
                16246
            ],
            [
                16246,
                16390
            ],
            [
                16390,
                16595
            ],
            [
                16595,
                16687
            ],
            [
                16687,
                16868
            ],
            [
                16868,
                17091
            ],
            [
                17091,
                17400
            ],
            [
                17400,
                17532
            ],
            [
                17532,
                17605
            ],
            [
                17605,
                17776
            ],
            [
                17776,
                17881
            ],
            [
                17881,
                17919
            ],
            [
                17919,
                18041
            ],
            [
                18041,
                18121
            ],
            [
                18121,
                18163
            ],
            [
                18163,
                18209
            ],
            [
                18209,
                18221
            ],
            [
                18221,
                18276
            ],
            [
                18276,
                18291
            ],
            [
                18291,
                18386
            ],
            [
                18386,
                18415
            ],
            [
                18415,
                18440
            ],
            [
                18440,
                18469
            ],
            [
                18469,
                18505
            ],
            [
                18505,
                18620
            ],
            [
                18620,
                18706
            ],
            [
                18706,
                18763
            ],
            [
                18763,
                18908
            ],
            [
                18908,
                18934
            ],
            [
                18934,
                19041
            ],
            [
                19041,
                19067
            ],
            [
                19067,
                19134
            ],
            [
                19134,
                19198
            ],
            [
                19198,
                19294
            ],
            [
                19294,
                19346
            ],
            [
                19346,
                19370
            ],
            [
                19370,
                19412
            ],
            [
                19412,
                19460
            ],
            [
                19460,
                19556
            ],
            [
                19556,
                19652
            ],
            [
                19652,
                19670
            ],
            [
                19670,
                19722
            ],
            [
                19722,
                19750
            ],
            [
                19750,
                19781
            ],
            [
                19781,
                19870
            ],
            [
                19870,
                19974
            ],
            [
                19974,
                20088
            ],
            [
                20088,
                20149
            ],
            [
                20149,
                20184
            ],
            [
                20184,
                20206
            ],
            [
                20206,
                20300
            ],
            [
                20300,
                20636
            ],
            [
                20636,
                20783
            ],
            [
                20783,
                20842
            ],
            [
                20842,
                20889
            ],
            [
                20889,
                20947
            ],
            [
                20947,
                21105
            ],
            [
                21105,
                21166
            ],
            [
                21166,
                21303
            ],
            [
                21303,
                21426
            ],
            [
                21426,
                21502
            ],
            [
                21502,
                21697
            ],
            [
                21697,
                21767
            ],
            [
                21767,
                21798
            ],
            [
                21798,
                21857
            ],
            [
                21857,
                21891
            ],
            [
                21891,
                21948
            ],
            [
                21948,
                22031
            ],
            [
                22031,
                22084
            ],
            [
                22084,
                22134
            ],
            [
                22134,
                22164
            ],
            [
                22164,
                22190
            ],
            [
                22190,
                22229
            ],
            [
                22229,
                22270
            ],
            [
                22270,
                22395
            ]
        ]
    },
    "abridged": {
        "text": "Melmotte had got back his daughter, and was half inclined to let the matter rest there. He would probably have done so had it not become widely known that she had gone off to meet Sir Felix Carbury. Of course Lord Nidderdale would hear of it, and all the trouble that he had taken in that direction would be in vain. Stupid fool of a girl to throw away her chance in that way!\nBut his anger against Sir Felix was infinitely more bitter than his anger against his daughter. The man had given a written pledge not to marry Marie! Melmotte had of course learned all the details of the cheque for 250. Marie acknowledged that Sir Felix had received the money. If possible he would prosecute the baronet for theft.\nHad Melmotte been prudent he would have allowed the money to go without further trouble. Although at this point ready money was very valuable to him, his concerns were of such magnitude that 250 could make little difference. But during the last few months there had grown in him an arrogance, a self-confidence inspired by the worship of other men, which clouded his intellect.\nHe remembered perfectly his various little transactions with Sir Felix. Indeed it was one of his gifts to remember accurately all money transactions. But Sir Felix's money had been handed to him for the purchase of shares, and did not justify Sir Felix in taking money from his daughter. He thought that an English magistrate would be on his side - especially as he was Augustus Melmotte, the man about to be chosen for Westminster, the man about to entertain the Emperor of China!\nThe next day was Friday, and he sent a note to Lord Nidderdale asking him to come to the Railway Board. He thought that it would be wise to make a clean breast of it with his hoped-for son-in-law. The young lord would of course know what Marie had done. But Nidderdale had already known that there was a difficulty in regard to Sir Felix Carbury, yet had not given up his suit. It might be possible to persuade him that his own chances might now be improved rather than injured.\nMr. Melmotte on that morning had many visitors, amongst them Mr. Longestaffe. His offices in Abchurch Lane had a front stairs and a back stairs; the front stairs being intended for everybody, whereas the back stairs were only for those who were favoured. Miles Grendall had the command of the stairs, and when Mr. Longestaffe reached Abchurch Lane, he fell at once into Miles's hands.\nMiles ushered him through the front stairs passage and into the waiting-room, with much courtesy. Of course Mr. Longestaffe should see Mr. Melmotte as soon as possible. Would Mr. Longestaffe sit down for a few minutes? Mr. Melmotte was very much engaged. At this moment a deputation from the Canadian Government was with him; but Miles thought that they would not be long. Miles would do his very best to get an interview for Mr. Longestaffe.\nWe will leave Mr. Longestaffe in the front waiting-room, merely noting that he remained there for over two hours.\nIn the meantime both Mr. Broune and Lord Nidderdale came to the office, and were received without delay. Mr. Broune was the first.\n\"I'm commissioned to pay some money on behalf of Miss Melmotte,\" said Mr. Broune - words which at once procured him admission to the sanctum. The Canadian Deputation must have taken its leave.\nLord Nidderdale, who had arrived almost at the same moment, was shown into a little private room.\n\"You'll go in directly,\" said Miles.\n\"I suppose all this about Miss Melmotte is true?\" asked Nidderdale.\n\"She did go off yesterday morning,\" said Miles, in a whisper.\n\"But Carbury wasn't with her. He staggered out of the club yesterday morning at four o'clock, drunk. He'd lost a pot of money, and had been kicking up a row about you.\"\n\"Brute!\" exclaimed Miles, with honest indignation.\n\"I dare say. But I'm sure he couldn't get himself down to Liverpool. And I saw all his things lying about the club hall late last night. By George! What a fiasco!\" said the young lord. \"I wonder what the old boy means to say to me about it.\"\nThen there was heard the clear tingle of a little silver bell, and Miles told Lord Nidderdale that his time had come.\nMelmotte had been very gracious to Mr. Broune, on account of the support given by the Breakfast Table to his candidature. But Mr. Broune cut short his speech of thanks.\n\"I never talk about the Breakfast Table,\" said he. \"I have come about quite another matter. Sir Felix Carbury lately received a sum of money in trust from your daughter, and as Sir Felix's friend, I have called to return it to you.\" Mr. Broune did not like calling himself the friend of Sir Felix, but he did even that for the lady who had been good enough not to marry him.\n\"Oh, indeed,\" said Mr. Melmotte, with a scowl. \"D___ scoundrel!\"\n\"We won't discuss that, Mr. Melmotte. The sum was 250, I think.\" And Mr. Broune put a cheque for that amount upon the table. \"Good morning.\"\nThey shook hands; then Mr. Broune departed and Melmotte tinkled his bell. As Nidderdale was shown in he put the cheque into his pocket, abandoning any idea of prosecuting Sir Felix.\n\"Well, my Lord, and how are you?\" said he with his pleasantest smile.\nNidderdale declared himself to be as fresh as paint, and - to show a good face before his late intended father-in-law - sang the refrain of an old song:\n\"Cheer up, Sam;\nDon't let your spirits go down.\nThere's many a girl that I know well,\nIs waiting for you in the town.\"\n\"Ha, ha,\" laughed Melmotte, \"very good. But you won't let this stupid nonsense stand in your way with Marie.\"\n\"Upon my word, sir, I don't know about that. Miss Melmotte has given convincing proof of her partiality for another gentleman, and of her indifference to me.\"\n\"A silly little romantic baggage! She's been reading novels till she has learned to think she had to run off with somebody.\"\n\"She doesn't seem to have succeeded on this occasion, Mr. Melmotte.\"\n\"No; of course we had her back again from Liverpool.\"\n\"But they say that she got further than the gentleman.\"\n\"He is a dishonest, drunken scoundrel. My girl knows that now. Of course, my Lord, I'm very sorry. You know that I've been square with you always. She's my only child, and sooner or later she must have all that I possess. In a year or two I expect that I shall be able to double what I give her now, without touching my capital. Of course you understand that I desire to see her occupying high rank. Now, my Lord, I hope this shall make no difference to you. I do not try to hide anything. This has been a misfortune. Girls will be romantic. But after this she will not be very fond of Sir Felix Carbury.\"\n\"I dare say not. Though, by Jove, girls will forgive anything.\"\n\"She won't forgive him. She shall hear the whole story. You'll come and see her just the same as ever!\"\n\"I don't know about that, Mr. Melmotte.\"\n\"The money will all be there, Lord Nidderdale.\"\n\"The money's all right, I've no doubt. But, by Jove, it's a rather strong order when a girl has just run away with another man. Everybody knows it.\"\n\"In three months everybody will have forgotten it.\"\n\"To tell you the truth, sir, I think Miss Melmotte has got a will of her own stronger than you give her credit for. She has never given me the slightest encouragement.\"\n\"You just come to the house, and ask her again tomorrow, or on Sunday morning.\"\nLord Nidderdale thought for a few moments and then said that perhaps he would come on Sunday morning. After that Melmotte proposed that they should go and have lunch at a Conservative club, before the meeting of the Railway Board. Nidderdale had no objection to the lunch, but expressed a strong opinion that the Board was \"rot.\"\n\"That's all very well for you, young man,\" said the chairman, \"but I must go there in order that you may enjoy a splendid fortune. Come this way, Nidderdale; there are people waiting for me there who think that a man can attend to business from morning to night without ever having to eat.\" And they escaped by the back stairs.\nAt the club, Mr. Melmotte was warmly welcomed. He played the part of the big City man to perfection, talking loudly to a dozen men at once. He was glad to show the club that Lord Nidderdale had come there with him. The club of course knew that Melmotte's daughter had tried to run away with Sir Felix Carbury; and Lord Nidderdale's presence was an assurance that the misfortune had been wiped out.\nA little before three Mr. Melmotte returned to Abchurch Lane, intending to regain his room by the back way; while Lord Nidderdale went westward, considering whether he should continue to be a suitor for Miss Melmotte's hand.\n\"After all it's only an affair of money,\" he said to himself.\nMr. Longestaffe in the meantime had progressed from weariness to impatience, from impatience to ill-humour, and from ill-humour to indignation. Miles Grendall informed him that the Canadian Deputation would not take itself away. Mr. Longstaffe was accustomed to lunch punctually at two o'clock; and he would not be starved for any Melmotte in Europe. He attempted to see Grendall for the fourth time. But Miles Grendall also liked his lunch, and was therefore declared by one of the junior clerks to be on most important business with Mr. Melmotte.\n\"Then say that I can't wait any longer,\" said Mr. Longestaffe, stamping out angrily.\nAt the door he met Mr. Melmotte. \"Ah, Mr. Longestaffe,\" said the great financier, seizing him by the hand, \"you are the very man I wanted to see.\"\n\"I have been waiting two hours,\" said the Squire of Caversham.\n\"Tut, tut; and they never told me!\"\n\"I spoke to Mr. Grendall half a dozen times.\"\n\"Yes, yes. I do remember. My dear sir, I have so many things on my brain, that I hardly know how to get along with them. You are coming to the Board now?\"\n\"No,\" said Mr. Longestaffe. \"I can stay no longer in the City. My son is very anxious to have the payments made about Pickering.\"\n\"Payments for Pickering!\" said Melmotte, assuming an air of absent-minded doubt. \"Haven't they been made?\"\n\"Certainly not,\" said Mr. Longestaffe, \"unless made this morning.\"\n\"There was something about it, but I cannot just remember what. My second cashier, Mr. Smith, manages all my private affairs, and they go clean out of my head. Pickering! Wasn't there some question of a mortgage?\"\n\"Of course there was a mortgage; that made three payments necessary instead of two.\"\n\"But there was some unavoidable delay about the papers; something occasioned by the mortgagee. I know there was. But you shan't be inconvenienced, Mr. Longestaffe.\"\n\"It's my son, Mr. Melmotte. He's got a lawyer of his own.\"\n\"I never knew a young man that wasn't in a hurry for his money,\" said Melmotte, laughing. \"Oh, yes; there were three payments to be made; one to you, one to your son, and one to the mortgagee. I will speak to Mr. Smith tomorrow - and tell your son that he really need not trouble his lawyer. You won't come to the Board?\"\nMr. Longestaffe declined. A painful rumour had reached him the day before, quietly communicated by a very old friend, a member of a private firm of bankers - that Pickering had been already mortgaged to its full value by its new owner. \"If true,\" said the banker, \"It shows that Mr. Melmotte must be much pressed for money. It does not concern you at all if you have got your price. I suppose you have, or he wouldn't have the title-deeds.\"\nTherefore, as Mr. Longstaffe left, he was low in spirits. But nevertheless he had been reassured by Melmotte's manner.\nSir Felix Carbury of course did not attend the Board; nor did Paul Montague. Lord Nidderdale had had enough of the City for that day, and Mr. Longestaffe had been banished by hunger. The chairman was therefore supported only by Lord Alfred and Mr. Cohenlupe. But the work was got through as well as if those absentees had all attended, and then Mr. Melmotte and Mr. Cohenlupe retired together.\n\"I must get that money for Longestaffe,\" said Melmotte to his friend.\n\"What, eighty thousand pounds!\"\n\"It isn't eighty thousand. I've renewed the mortgage, and that makes it only fifty. If I can manage half of the son's money, I can put the father off.\"\n\"You must raise what you can on the whole property.\"\n\"I've done that already,\" said Melmotte hoarsely.\n\"And where's the money gone?\"\n\"Brehgert has had 40,000. You can manage 25,000 for me by Monday?\" Mr. Cohenlupe said that he would try, but that it would be very difficult.",
        "paragraph_chars": [
            [
                0,
                377
            ],
            [
                377,
                710
            ],
            [
                710,
                1088
            ],
            [
                1088,
                1570
            ],
            [
                1570,
                2049
            ],
            [
                2049,
                2434
            ],
            [
                2434,
                2877
            ],
            [
                2877,
                2991
            ],
            [
                2991,
                3122
            ],
            [
                3122,
                3315
            ],
            [
                3315,
                3413
            ],
            [
                3413,
                3450
            ],
            [
                3450,
                3518
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3749
            ],
            [
                3749,
                3800
            ],
            [
                3800,
                4042
            ],
            [
                4042,
                4160
            ],
            [
                4160,
                4329
            ],
            [
                4329,
                4704
            ],
            [
                4704,
                4769
            ],
            [
                4769,
                4910
            ],
            [
                4910,
                5092
            ],
            [
                5092,
                5162
            ],
            [
                5162,
                5315
            ],
            [
                5315,
                5331
            ],
            [
                5331,
                5363
            ],
            [
                5363,
                5401
            ],
            [
                5401,
                5434
            ],
            [
                5434,
                5544
            ],
            [
                5544,
                5703
            ],
            [
                5703,
                5828
            ],
            [
                5828,
                5897
            ],
            [
                5897,
                5951
            ],
            [
                5951,
                6007
            ],
            [
                6007,
                6613
            ],
            [
                6613,
                6677
            ],
            [
                6677,
                6781
            ],
            [
                6781,
                6822
            ],
            [
                6822,
                6870
            ],
            [
                6870,
                7019
            ],
            [
                7019,
                7071
            ],
            [
                7071,
                7240
            ],
            [
                7240,
                7320
            ],
            [
                7320,
                7650
            ],
            [
                7650,
                7978
            ],
            [
                7978,
                8376
            ],
            [
                8376,
                8601
            ],
            [
                8601,
                8663
            ],
            [
                8663,
                9212
            ],
            [
                9212,
                9297
            ],
            [
                9297,
                9444
            ],
            [
                9444,
                9507
            ],
            [
                9507,
                9543
            ],
            [
                9543,
                9589
            ],
            [
                9589,
                9744
            ],
            [
                9744,
                9874
            ],
            [
                9874,
                9981
            ],
            [
                9981,
                10048
            ],
            [
                10048,
                10262
            ],
            [
                10262,
                10347
            ],
            [
                10347,
                10512
            ],
            [
                10512,
                10571
            ],
            [
                10571,
                10893
            ],
            [
                10893,
                11334
            ],
            [
                11334,
                11453
            ],
            [
                11453,
                11847
            ],
            [
                11847,
                11917
            ],
            [
                11917,
                11949
            ],
            [
                11949,
                12101
            ],
            [
                12101,
                12154
            ],
            [
                12154,
                12204
            ],
            [
                12204,
                12234
            ],
            [
                12234,
                12375
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                199
            ],
            [
                199,
                317
            ],
            [
                317,
                377
            ],
            [
                377,
                473
            ],
            [
                473,
                528
            ],
            [
                528,
                598
            ],
            [
                598,
                656
            ],
            [
                656,
                710
            ],
            [
                710,
                799
            ],
            [
                799,
                935
            ],
            [
                935,
                1088
            ],
            [
                1088,
                1160
            ],
            [
                1160,
                1238
            ],
            [
                1238,
                1376
            ],
            [
                1376,
                1570
            ],
            [
                1570,
                1674
            ],
            [
                1674,
                1767
            ],
            [
                1767,
                1824
            ],
            [
                1824,
                1948
            ],
            [
                1948,
                2049
            ],
            [
                2049,
                2127
            ],
            [
                2127,
                2304
            ],
            [
                2304,
                2434
            ],
            [
                2434,
                2532
            ],
            [
                2532,
                2603
            ],
            [
                2603,
                2653
            ],
            [
                2653,
                2689
            ],
            [
                2689,
                2807
            ],
            [
                2807,
                2877
            ],
            [
                2877,
                2991
            ],
            [
                2991,
                3096
            ],
            [
                3096,
                3122
            ],
            [
                3122,
                3264
            ],
            [
                3264,
                3315
            ],
            [
                3315,
                3413
            ],
            [
                3413,
                3450
            ],
            [
                3450,
                3500
            ],
            [
                3500,
                3518
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3610
            ],
            [
                3610,
                3681
            ],
            [
                3681,
                3749
            ],
            [
                3749,
                3758
            ],
            [
                3758,
                3800
            ],
            [
                3800,
                3813
            ],
            [
                3813,
                3869
            ],
            [
                3869,
                3937
            ],
            [
                3937,
                3948
            ],
            [
                3948,
                3964
            ],
            [
                3964,
                3985
            ],
            [
                3985,
                4042
            ],
            [
                4042,
                4160
            ],
            [
                4160,
                4282
            ],
            [
                4282,
                4329
            ],
            [
                4329,
                4380
            ],
            [
                4380,
                4421
            ],
            [
                4421,
                4562
            ],
            [
                4562,
                4704
            ],
            [
                4704,
                4751
            ],
            [
                4751,
                4769
            ],
            [
                4769,
                4807
            ],
            [
                4807,
                4834
            ],
            [
                4834,
                4894
            ],
            [
                4894,
                4910
            ],
            [
                4910,
                4984
            ],
            [
                4984,
                5092
            ],
            [
                5092,
                5126
            ],
            [
                5126,
                5162
            ],
            [
                5162,
                5315
            ],
            [
                5315,
                5331
            ],
            [
                5331,
                5363
            ],
            [
                5363,
                5401
            ],
            [
                5401,
                5434
            ],
            [
                5434,
                5474
            ],
            [
                5474,
                5544
            ],
            [
                5544,
                5589
            ],
            [
                5589,
                5703
            ],
            [
                5703,
                5737
            ],
            [
                5737,
                5828
            ],
            [
                5828,
                5897
            ],
            [
                5897,
                5951
            ],
            [
                5951,
                6007
            ],
            [
                6007,
                6046
            ],
            [
                6046,
                6070
            ],
            [
                6070,
                6106
            ],
            [
                6106,
                6154
            ],
            [
                6154,
                6229
            ],
            [
                6229,
                6336
            ],
            [
                6336,
                6407
            ],
            [
                6407,
                6466
            ],
            [
                6466,
                6497
            ],
            [
                6497,
                6525
            ],
            [
                6525,
                6549
            ],
            [
                6549,
                6613
            ],
            [
                6613,
                6630
            ],
            [
                6630,
                6677
            ],
            [
                6677,
                6701
            ],
            [
                6701,
                6733
            ],
            [
                6733,
                6781
            ],
            [
                6781,
                6822
            ],
            [
                6822,
                6870
            ],
            [
                6870,
                6909
            ],
            [
                6909,
                6998
            ],
            [
                6998,
                7019
            ],
            [
                7019,
                7071
            ],
            [
                7071,
                7187
            ],
            [
                7187,
                7240
            ],
            [
                7240,
                7320
            ],
            [
                7320,
                7422
            ],
            [
                7422,
                7551
            ],
            [
                7551,
                7650
            ],
            [
                7650,
                7781
            ],
            [
                7781,
                7941
            ],
            [
                7941,
                7978
            ],
            [
                7978,
                8025
            ],
            [
                8025,
                8118
            ],
            [
                8118,
                8193
            ],
            [
                8193,
                8376
            ],
            [
                8376,
                8601
            ],
            [
                8601,
                8663
            ],
            [
                8663,
                8807
            ],
            [
                8807,
                8892
            ],
            [
                8892,
                9014
            ],
            [
                9014,
                9064
            ],
            [
                9064,
                9212
            ],
            [
                9212,
                9297
            ],
            [
                9297,
                9330
            ],
            [
                9330,
                9444
            ],
            [
                9444,
                9507
            ],
            [
                9507,
                9543
            ],
            [
                9543,
                9589
            ],
            [
                9589,
                9600
            ],
            [
                9600,
                9615
            ],
            [
                9615,
                9710
            ],
            [
                9710,
                9744
            ],
            [
                9744,
                9772
            ],
            [
                9772,
                9807
            ],
            [
                9807,
                9874
            ],
            [
                9874,
                9900
            ],
            [
                9900,
                9955
            ],
            [
                9955,
                9981
            ],
            [
                9981,
                10048
            ],
            [
                10048,
                10112
            ],
            [
                10112,
                10208
            ],
            [
                10208,
                10219
            ],
            [
                10219,
                10262
            ],
            [
                10262,
                10347
            ],
            [
                10347,
                10442
            ],
            [
                10442,
                10460
            ],
            [
                10460,
                10512
            ],
            [
                10512,
                10540
            ],
            [
                10540,
                10571
            ],
            [
                10571,
                10661
            ],
            [
                10661,
                10764
            ],
            [
                10764,
                10863
            ],
            [
                10863,
                10893
            ],
            [
                10893,
                10919
            ],
            [
                10919,
                11129
            ],
            [
                11129,
                11217
            ],
            [
                11217,
                11276
            ],
            [
                11276,
                11334
            ],
            [
                11334,
                11392
            ],
            [
                11392,
                11453
            ],
            [
                11453,
                11530
            ],
            [
                11530,
                11636
            ],
            [
                11636,
                11712
            ],
            [
                11712,
                11847
            ],
            [
                11847,
                11917
            ],
            [
                11917,
                11949
            ],
            [
                11949,
                11976
            ],
            [
                11976,
                12033
            ],
            [
                12033,
                12101
            ],
            [
                12101,
                12154
            ],
            [
                12154,
                12204
            ],
            [
                12204,
                12234
            ],
            [
                12234,
                12260
            ],
            [
                12260,
                12301
            ],
            [
                12301,
                12375
            ]
        ],
        "overlap_chars": [
            [
                0,
                88
            ],
            [
                88,
                122
            ],
            [
                126,
                129
            ],
            [
                144,
                149
            ],
            [
                150,
                197
            ],
            [
                197,
                199
            ],
            [
                199,
                246
            ],
            [
                247,
                304
            ],
            [
                308,
                317
            ],
            [
                317,
                363
            ],
            [
                364,
                376
            ],
            [
                377,
                473
            ],
            [
                473,
                480
            ],
            [
                481,
                507
            ],
            [
                512,
                514
            ],
            [
                521,
                528
            ],
            [
                528,
                596
            ],
            [
                596,
                598
            ],
            [
                598,
                603
            ],
            [
                604,
                656
            ],
            [
                656,
                702
            ],
            [
                708,
                710
            ],
            [
                710,
                727
            ],
            [
                728,
                735
            ],
            [
                736,
                738
            ],
            [
                739,
                799
            ],
            [
                808,
                815
            ],
            [
                816,
                821
            ],
            [
                822,
                859
            ],
            [
                860,
                915
            ],
            [
                916,
                935
            ],
            [
                935,
                938
            ],
            [
                939,
                965
            ],
            [
                966,
                981
            ],
            [
                982,
                988
            ],
            [
                989,
                1029
            ],
            [
                1030,
                1086
            ],
            [
                1086,
                1087
            ],
            [
                1088,
                1160
            ],
            [
                1160,
                1202
            ],
            [
                1214,
                1236
            ],
            [
                1236,
                1238
            ],
            [
                1238,
                1268
            ],
            [
                1283,
                1310
            ],
            [
                1311,
                1314
            ],
            [
                1315,
                1350
            ],
            [
                1351,
                1376
            ],
            [
                1376,
                1413
            ],
            [
                1414,
                1419
            ],
            [
                1420,
                1434
            ],
            [
                1437,
                1570
            ],
            [
                1570,
                1594
            ],
            [
                1599,
                1632
            ],
            [
                1644,
                1646
            ],
            [
                1647,
                1654
            ],
            [
                1655,
                1673
            ],
            [
                1674,
                1676
            ],
            [
                1685,
                1716
            ],
            [
                1723,
                1767
            ],
            [
                1767,
                1824
            ],
            [
                1824,
                1827
            ],
            [
                1839,
                1842
            ],
            [
                1857,
                1867
            ],
            [
                1872,
                1916
            ],
            [
                1921,
                1928
            ],
            [
                1938,
                1948
            ],
            [
                1948,
                1980
            ],
            [
                1985,
                1989
            ],
            [
                1990,
                1997
            ],
            [
                2006,
                2011
            ],
            [
                2012,
                2015
            ],
            [
                2016,
                2018
            ],
            [
                2019,
                2027
            ],
            [
                2028,
                2034
            ],
            [
                2035,
                2049
            ],
            [
                2049,
                2096
            ],
            [
                2110,
                2127
            ],
            [
                2131,
                2155
            ],
            [
                2156,
                2159
            ],
            [
                2160,
                2192
            ],
            [
                2192,
                2240
            ],
            [
                2241,
                2264
            ],
            [
                2270,
                2288
            ],
            [
                2294,
                2304
            ],
            [
                2304,
                2353
            ],
            [
                2354,
                2358
            ],
            [
                2359,
                2396
            ],
            [
                2396,
                2397
            ],
            [
                2398,
                2400
            ],
            [
                2424,
                2426
            ],
            [
                2432,
                2433
            ],
            [
                2440,
                2447
            ],
            [
                2452,
                2497
            ],
            [
                2498,
                2521
            ],
            [
                2522,
                2532
            ],
            [
                2544,
                2557
            ],
            [
                2565,
                2601
            ],
            [
                2603,
                2653
            ],
            [
                2653,
                2665
            ],
            [
                2666,
                2689
            ],
            [
                2689,
                2759
            ],
            [
                2760,
                2782
            ],
            [
                2788,
                2805
            ],
            [
                2805,
                2807
            ],
            [
                2807,
                2875
            ],
            [
                2875,
                2876
            ],
            [
                2877,
                2906
            ],
            [
                2907,
                2940
            ],
            [
                2948,
                2952
            ],
            [
                2953,
                2964
            ],
            [
                2965,
                2970
            ],
            [
                2971,
                2974
            ],
            [
                2975,
                2991
            ],
            [
                2991,
                2997
            ],
            [
                3007,
                3066
            ],
            [
                3067,
                3096
            ],
            [
                3096,
                3121
            ],
            [
                3122,
                3146
            ],
            [
                3147,
                3184
            ],
            [
                3205,
                3210
            ],
            [
                3217,
                3264
            ],
            [
                3264,
                3313
            ],
            [
                3313,
                3314
            ],
            [
                3315,
                3339
            ],
            [
                3348,
                3373
            ],
            [
                3373,
                3411
            ],
            [
                3411,
                3412
            ],
            [
                3413,
                3414
            ],
            [
                3414,
                3435
            ],
            [
                3438,
                3449
            ],
            [
                3450,
                3499
            ],
            [
                3506,
                3516
            ],
            [
                3516,
                3517
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3608
            ],
            [
                3610,
                3672
            ],
            [
                3674,
                3679
            ],
            [
                3679,
                3681
            ],
            [
                3681,
                3746
            ],
            [
                3746,
                3749
            ],
            [
                3749,
                3758
            ],
            [
                3758,
                3800
            ],
            [
                3800,
                3813
            ],
            [
                3813,
                3816
            ],
            [
                3817,
                3869
            ],
            [
                3869,
                3935
            ],
            [
                3935,
                3937
            ],
            [
                3937,
                3948
            ],
            [
                3948,
                3964
            ],
            [
                3964,
                3983
            ],
            [
                3985,
                4041
            ],
            [
                4042,
                4160
            ],
            [
                4160,
                4168
            ],
            [
                4169,
                4172
            ],
            [
                4173,
                4182
            ],
            [
                4183,
                4191
            ],
            [
                4192,
                4198
            ],
            [
                4199,
                4205
            ],
            [
                4205,
                4206
            ],
            [
                4207,
                4209
            ],
            [
                4218,
                4245
            ],
            [
                4256,
                4261
            ],
            [
                4262,
                4282
            ],
            [
                4282,
                4300
            ],
            [
                4301,
                4306
            ],
            [
                4327,
                4328
            ],
            [
                4329,
                4352
            ],
            [
                4363,
                4368
            ],
            [
                4371,
                4380
            ],
            [
                4380,
                4392
            ],
            [
                4393,
                4419
            ],
            [
                4419,
                4421
            ],
            [
                4421,
                4438
            ],
            [
                4446,
                4497
            ],
            [
                4497,
                4502
            ],
            [
                4503,
                4549
            ],
            [
                4553,
                4562
            ],
            [
                4562,
                4685
            ],
            [
                4686,
                4704
            ],
            [
                4704,
                4749
            ],
            [
                4749,
                4750
            ],
            [
                4752,
                4753
            ],
            [
                4757,
                4769
            ],
            [
                4769,
                4807
            ],
            [
                4807,
                4834
            ],
            [
                4834,
                4877
            ],
            [
                4878,
                4893
            ],
            [
                4895,
                4909
            ],
            [
                4928,
                4984
            ],
            [
                4984,
                5013
            ],
            [
                5014,
                5017
            ],
            [
                5018,
                5028
            ],
            [
                5029,
                5044
            ],
            [
                5044,
                5045
            ],
            [
                5057,
                5065
            ],
            [
                5066,
                5090
            ],
            [
                5090,
                5091
            ],
            [
                5092,
                5126
            ],
            [
                5126,
                5161
            ],
            [
                5162,
                5213
            ],
            [
                5213,
                5214
            ],
            [
                5221,
                5279
            ],
            [
                5287,
                5313
            ],
            [
                5315,
                5330
            ],
            [
                5331,
                5362
            ],
            [
                5363,
                5400
            ],
            [
                5401,
                5434
            ],
            [
                5434,
                5435
            ],
            [
                5435,
                5474
            ],
            [
                5474,
                5544
            ],
            [
                5544,
                5589
            ],
            [
                5589,
                5612
            ],
            [
                5613,
                5703
            ],
            [
                5704,
                5737
            ],
            [
                5737,
                5796
            ],
            [
                5797,
                5800
            ],
            [
                5804,
                5828
            ],
            [
                5828,
                5897
            ],
            [
                5897,
                5901
            ],
            [
                5902,
                5951
            ],
            [
                5951,
                6007
            ],
            [
                6007,
                6046
            ],
            [
                6046,
                6059
            ],
            [
                6065,
                6070
            ],
            [
                6070,
                6106
            ],
            [
                6106,
                6129
            ],
            [
                6130,
                6154
            ],
            [
                6154,
                6229
            ],
            [
                6229,
                6336
            ],
            [
                6336,
                6407
            ],
            [
                6407,
                6422
            ],
            [
                6428,
                6466
            ],
            [
                6466,
                6497
            ],
            [
                6502,
                6525
            ],
            [
                6525,
                6549
            ],
            [
                6553,
                6613
            ],
            [
                6613,
                6630
            ],
            [
                6630,
                6677
            ],
            [
                6677,
                6701
            ],
            [
                6701,
                6733
            ],
            [
                6733,
                6781
            ],
            [
                6781,
                6822
            ],
            [
                6822,
                6870
            ],
            [
                6870,
                6909
            ],
            [
                6909,
                6998
            ],
            [
                6998,
                7019
            ],
            [
                7019,
                7035
            ],
            [
                7036,
                7071
            ],
            [
                7071,
                7187
            ],
            [
                7187,
                7237
            ],
            [
                7240,
                7286
            ],
            [
                7297,
                7299
            ],
            [
                7300,
                7317
            ],
            [
                7320,
                7343
            ],
            [
                7344,
                7422
            ],
            [
                7422,
                7460
            ],
            [
                7461,
                7474
            ],
            [
                7480,
                7485
            ],
            [
                7486,
                7490
            ],
            [
                7491,
                7508
            ],
            [
                7510,
                7551
            ],
            [
                7551,
                7649
            ],
            [
                7650,
                7754
            ],
            [
                7755,
                7779
            ],
            [
                7781,
                7807
            ],
            [
                7808,
                7931
            ],
            [
                7938,
                7941
            ],
            [
                7941,
                7944
            ],
            [
                7945,
                7978
            ],
            [
                7978,
                7990
            ],
            [
                7991,
                8003
            ],
            [
                8008,
                8014
            ],
            [
                8023,
                8025
            ],
            [
                8025,
                8078
            ],
            [
                8079,
                8118
            ],
            [
                8118,
                8193
            ],
            [
                8193,
                8221
            ],
            [
                8230,
                8251
            ],
            [
                8252,
                8286
            ],
            [
                8288,
                8291
            ],
            [
                8292,
                8307
            ],
            [
                8307,
                8309
            ],
            [
                8310,
                8318
            ],
            [
                8319,
                8322
            ],
            [
                8323,
                8335
            ],
            [
                8336,
                8374
            ],
            [
                8374,
                8375
            ],
            [
                8376,
                8532
            ],
            [
                8533,
                8540
            ],
            [
                8541,
                8562
            ],
            [
                8566,
                8600
            ],
            [
                8601,
                8663
            ],
            [
                8663,
                8807
            ],
            [
                8813,
                8821
            ],
            [
                8835,
                8839
            ],
            [
                8840,
                8843
            ],
            [
                8844,
                8863
            ],
            [
                8864,
                8892
            ],
            [
                8894,
                8895
            ],
            [
                8902,
                8906
            ],
            [
                8907,
                8910
            ],
            [
                8911,
                8956
            ],
            [
                8958,
                8961
            ],
            [
                8962,
                8974
            ],
            [
                8975,
                8993
            ],
            [
                8994,
                9014
            ],
            [
                9014,
                9016
            ],
            [
                9017,
                9064
            ],
            [
                9064,
                9165
            ],
            [
                9166,
                9211
            ],
            [
                9212,
                9287
            ],
            [
                9295,
                9297
            ],
            [
                9297,
                9303
            ],
            [
                9304,
                9330
            ],
            [
                9330,
                9427
            ],
            [
                9441,
                9444
            ],
            [
                9444,
                9474
            ],
            [
                9474,
                9507
            ],
            [
                9507,
                9516
            ],
            [
                9516,
                9517
            ],
            [
                9518,
                9543
            ],
            [
                9543,
                9589
            ],
            [
                9589,
                9594
            ],
            [
                9595,
                9600
            ],
            [
                9600,
                9615
            ],
            [
                9615,
                9710
            ],
            [
                9710,
                9737
            ],
            [
                9744,
                9747
            ],
            [
                9750,
                9772
            ],
            [
                9772,
                9805
            ],
            [
                9807,
                9871
            ],
            [
                9874,
                9900
            ],
            [
                9900,
                9933
            ],
            [
                9948,
                9953
            ],
            [
                9953,
                9955
            ],
            [
                9955,
                9981
            ],
            [
                9981,
                10048
            ],
            [
                10048,
                10112
            ],
            [
                10112,
                10208
            ],
            [
                10208,
                10219
            ],
            [
                10219,
                10259
            ],
            [
                10262,
                10263
            ],
            [
                10263,
                10272
            ],
            [
                10273,
                10293
            ],
            [
                10293,
                10294
            ],
            [
                10295,
                10299
            ],
            [
                10300,
                10347
            ],
            [
                10347,
                10402
            ],
            [
                10403,
                10442
            ],
            [
                10442,
                10460
            ],
            [
                10460,
                10512
            ],
            [
                10512,
                10540
            ],
            [
                10540,
                10571
            ],
            [
                10571,
                10649
            ],
            [
                10651,
                10661
            ],
            [
                10661,
                10670
            ],
            [
                10671,
                10764
            ],
            [
                10764,
                10789
            ],
            [
                10799,
                10800
            ],
            [
                10801,
                10804
            ],
            [
                10805,
                10863
            ],
            [
                10863,
                10890
            ],
            [
                10893,
                10908
            ],
            [
                10909,
                10917
            ],
            [
                10917,
                10919
            ],
            [
                10919,
                10967
            ],
            [
                10976,
                10988
            ],
            [
                10989,
                11010
            ],
            [
                11011,
                11048
            ],
            [
                11051,
                11129
            ],
            [
                11129,
                11130
            ],
            [
                11130,
                11132
            ],
            [
                11133,
                11137
            ],
            [
                11137,
                11155
            ],
            [
                11155,
                11156
            ],
            [
                11157,
                11158
            ],
            [
                11158,
                11217
            ],
            [
                11217,
                11276
            ],
            [
                11276,
                11333
            ],
            [
                11334,
                11339
            ],
            [
                11343,
                11347
            ],
            [
                11350,
                11351
            ],
            [
                11358,
                11362
            ],
            [
                11367,
                11392
            ],
            [
                11392,
                11453
            ],
            [
                11453,
                11528
            ],
            [
                11528,
                11530
            ],
            [
                11530,
                11549
            ],
            [
                11550,
                11636
            ],
            [
                11636,
                11712
            ],
            [
                11712,
                11715
            ],
            [
                11716,
                11751
            ],
            [
                11755,
                11787
            ],
            [
                11798,
                11847
            ],
            [
                11847,
                11917
            ],
            [
                11917,
                11946
            ],
            [
                11949,
                11974
            ],
            [
                11974,
                11976
            ],
            [
                11976,
                12033
            ],
            [
                12033,
                12048
            ],
            [
                12049,
                12056
            ],
            [
                12057,
                12064
            ],
            [
                12072,
                12101
            ],
            [
                12101,
                12154
            ],
            [
                12154,
                12204
            ],
            [
                12204,
                12234
            ],
            [
                12234,
                12260
            ],
            [
                12260,
                12301
            ],
            [
                12301,
                12342
            ],
            [
                12343,
                12347
            ],
            [
                12351,
                12359
            ],
            [
                12374,
                12375
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                199
            ],
            [
                199,
                199
            ],
            [
                199,
                317
            ],
            [
                317,
                377
            ],
            [
                377,
                473
            ],
            [
                473,
                528
            ],
            [
                528,
                598
            ],
            [
                598,
                656
            ],
            [
                656,
                710
            ],
            [
                710,
                799
            ],
            [
                799,
                935
            ],
            [
                935,
                1088
            ],
            [
                1088,
                1160
            ],
            [
                1160,
                1238
            ],
            [
                1238,
                1238
            ],
            [
                1238,
                1376
            ],
            [
                1376,
                1570
            ],
            [
                1570,
                1674
            ],
            [
                1674,
                1767
            ],
            [
                1767,
                1767
            ],
            [
                1767,
                1824
            ],
            [
                1824,
                1948
            ],
            [
                1948,
                2049
            ],
            [
                2049,
                2127
            ],
            [
                2127,
                2304
            ],
            [
                2304,
                2434
            ],
            [
                2434,
                2532
            ],
            [
                2532,
                2532
            ],
            [
                2532,
                2532
            ],
            [
                2532,
                2603
            ],
            [
                2603,
                2603
            ],
            [
                2603,
                2603
            ],
            [
                2603,
                2603
            ],
            [
                2603,
                2653
            ],
            [
                2653,
                2653
            ],
            [
                2653,
                2689
            ],
            [
                2689,
                2807
            ],
            [
                2807,
                2877
            ],
            [
                2877,
                2877
            ],
            [
                2877,
                2991
            ],
            [
                2991,
                3096
            ],
            [
                3096,
                3122
            ],
            [
                3122,
                3122
            ],
            [
                3122,
                3122
            ],
            [
                3122,
                3264
            ],
            [
                3264,
                3315
            ],
            [
                3315,
                3413
            ],
            [
                3413,
                3413
            ],
            [
                3413,
                3413
            ],
            [
                3413,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3518
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3681
            ],
            [
                3681,
                3749
            ],
            [
                3749,
                3758
            ],
            [
                3758,
                3800
            ],
            [
                3800,
                3813
            ],
            [
                3813,
                3869
            ],
            [
                3869,
                3937
            ],
            [
                3937,
                3948
            ],
            [
                3948,
                3948
            ],
            [
                3948,
                3948
            ],
            [
                3948,
                3948
            ],
            [
                3948,
                3964
            ],
            [
                3964,
                4042
            ],
            [
                4042,
                4160
            ],
            [
                4160,
                4282
            ],
            [
                4282,
                4329
            ],
            [
                4329,
                4380
            ],
            [
                4380,
                4380
            ],
            [
                4380,
                4380
            ],
            [
                4380,
                4421
            ],
            [
                4421,
                4562
            ],
            [
                4562,
                4704
            ],
            [
                4704,
                4751
            ],
            [
                4751,
                4751
            ],
            [
                4751,
                4751
            ],
            [
                4751,
                4769
            ],
            [
                4769,
                4807
            ],
            [
                4807,
                4807
            ],
            [
                4807,
                4834
            ],
            [
                4834,
                4894
            ],
            [
                4894,
                4894
            ],
            [
                4894,
                4894
            ],
            [
                4894,
                4894
            ],
            [
                4894,
                4894
            ],
            [
                4894,
                4910
            ],
            [
                4910,
                4984
            ],
            [
                4984,
                5092
            ],
            [
                5092,
                5126
            ],
            [
                5126,
                5162
            ],
            [
                5162,
                5315
            ],
            [
                5315,
                5363
            ],
            [
                5363,
                5434
            ],
            [
                5434,
                5474
            ],
            [
                5474,
                5474
            ],
            [
                5474,
                5544
            ],
            [
                5544,
                5589
            ],
            [
                5589,
                5703
            ],
            [
                5703,
                5703
            ],
            [
                5703,
                5737
            ],
            [
                5737,
                5828
            ],
            [
                5828,
                5897
            ],
            [
                5897,
                5951
            ],
            [
                5951,
                6007
            ],
            [
                6007,
                6046
            ],
            [
                6046,
                6070
            ],
            [
                6070,
                6070
            ],
            [
                6070,
                6106
            ],
            [
                6106,
                6154
            ],
            [
                6154,
                6229
            ],
            [
                6229,
                6336
            ],
            [
                6336,
                6407
            ],
            [
                6407,
                6407
            ],
            [
                6407,
                6407
            ],
            [
                6407,
                6466
            ],
            [
                6466,
                6466
            ],
            [
                6466,
                6497
            ],
            [
                6497,
                6525
            ],
            [
                6525,
                6549
            ],
            [
                6549,
                6549
            ],
            [
                6549,
                6613
            ],
            [
                6613,
                6630
            ],
            [
                6630,
                6677
            ],
            [
                6677,
                6701
            ],
            [
                6701,
                6701
            ],
            [
                6701,
                6733
            ],
            [
                6733,
                6781
            ],
            [
                6781,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6870
            ],
            [
                6870,
                6909
            ],
            [
                6909,
                6909
            ],
            [
                6909,
                6998
            ],
            [
                6998,
                7019
            ],
            [
                7019,
                7071
            ],
            [
                7071,
                7187
            ],
            [
                7187,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7320
            ],
            [
                7320,
                7320
            ],
            [
                7320,
                7320
            ],
            [
                7320,
                7422
            ],
            [
                7422,
                7551
            ],
            [
                7551,
                7650
            ],
            [
                7650,
                7781
            ],
            [
                7781,
                7781
            ],
            [
                7781,
                7941
            ],
            [
                7941,
                7978
            ],
            [
                7978,
                8025
            ],
            [
                8025,
                8025
            ],
            [
                8025,
                8118
            ],
            [
                8118,
                8193
            ],
            [
                8193,
                8376
            ],
            [
                8376,
                8601
            ],
            [
                8601,
                8601
            ],
            [
                8601,
                8663
            ],
            [
                8663,
                8807
            ],
            [
                8807,
                8892
            ],
            [
                8892,
                8892
            ],
            [
                8892,
                8892
            ],
            [
                8892,
                8892
            ],
            [
                8892,
                9014
            ],
            [
                9014,
                9014
            ],
            [
                9014,
                9064
            ],
            [
                9064,
                9212
            ],
            [
                9212,
                9297
            ],
            [
                9297,
                9330
            ],
            [
                9330,
                9444
            ],
            [
                9444,
                9507
            ],
            [
                9507,
                9543
            ],
            [
                9543,
                9589
            ],
            [
                9589,
                9600
            ],
            [
                9600,
                9600
            ],
            [
                9600,
                9615
            ],
            [
                9615,
                9710
            ],
            [
                9710,
                9744
            ],
            [
                9744,
                9744
            ],
            [
                9744,
                9772
            ],
            [
                9772,
                9807
            ],
            [
                9807,
                9807
            ],
            [
                9807,
                9807
            ],
            [
                9807,
                9807
            ],
            [
                9807,
                9874
            ],
            [
                9874,
                9900
            ],
            [
                9900,
                9955
            ],
            [
                9955,
                9981
            ],
            [
                9981,
                10048
            ],
            [
                10048,
                10112
            ],
            [
                10112,
                10208
            ],
            [
                10208,
                10208
            ],
            [
                10208,
                10219
            ],
            [
                10219,
                10262
            ],
            [
                10262,
                10262
            ],
            [
                10262,
                10347
            ],
            [
                10347,
                10442
            ],
            [
                10442,
                10460
            ],
            [
                10460,
                10512
            ],
            [
                10512,
                10540
            ],
            [
                10540,
                10571
            ],
            [
                10571,
                10661
            ],
            [
                10661,
                10764
            ],
            [
                10764,
                10863
            ],
            [
                10863,
                10863
            ],
            [
                10863,
                10893
            ],
            [
                10893,
                10893
            ],
            [
                10893,
                10919
            ],
            [
                10919,
                11129
            ],
            [
                11129,
                11217
            ],
            [
                11217,
                11276
            ],
            [
                11276,
                11276
            ],
            [
                11276,
                11334
            ],
            [
                11334,
                11392
            ],
            [
                11392,
                11453
            ],
            [
                11453,
                11530
            ],
            [
                11530,
                11636
            ],
            [
                11636,
                11712
            ],
            [
                11712,
                11847
            ],
            [
                11847,
                11917
            ],
            [
                11917,
                11949
            ],
            [
                11949,
                11949
            ],
            [
                11949,
                11976
            ],
            [
                11976,
                12033
            ],
            [
                12033,
                12101
            ],
            [
                12101,
                12154
            ],
            [
                12154,
                12204
            ],
            [
                12204,
                12234
            ],
            [
                12234,
                12260
            ],
            [
                12260,
                12260
            ],
            [
                12260,
                12301
            ],
            [
                12301,
                12375
            ]
        ]
    }
}