{
    "original": {
        "text": "The Conservative party at this particular period was putting its shoulder to the wheel,--not to push the coach up any hill, but to prevent its being hurried along at a pace which was not only dangerous, but manifestly destructive. The Conservative party now and then does put its shoulder to the wheel, ostensibly with the great national object above named; but also actuated by a natural desire to keep its own head well above water and be generally doing something, so that other parties may not suppose that it is moribund. There are, no doubt, members of it who really think that when some object has been achieved,--when, for instance, a good old Tory has been squeezed into Parliament for the borough of Porcorum, which for the last three parliaments has been represented by a Liberal,--the coach has been really stopped. To them, in their delightful faith, there comes at these triumphant moments a conviction that after all the people as a people have not been really in earnest in their efforts to take something from the greatness of the great, and to add something to the lowliness of the lowly. The handle of the windlass has been broken, the wheel is turning fast the reverse way, and the rope of Radical progress is running back. Who knows what may not be regained if the Conservative party will only put its shoulder to the wheel and take care that the handle of the windlass be not mended! Sticinthemud, which has ever been a doubtful little borough, has just been carried by a majority of fifteen! A long pull, a strong pull, and a pull altogether,--and the old day will come back again. Venerable patriarchs think of Lord Liverpool and other heroes, and dream dreams of Conservative bishops, Conservative lord-lieutenants, and of a Conservative ministry that shall remain in for a generation.\nSuch a time was now present. Porcorum and Sticinthemud had done their duty valiantly,--with much management. But Westminster! If this special seat for Westminster could be carried, the country then could hardly any longer have a doubt on the matter. If only Mr. Melmotte could be got in for Westminster, it would be manifest that the people were sound at heart, and that all the great changes which had been effected during the last forty years,--from the first reform in Parliament down to the Ballot,--had been managed by the cunning and treachery of a few ambitious men. Not, however, that the Ballot was just now regarded by the party as an unmitigated evil, though it was the last triumph of Radical wickedness. The Ballot was on the whole popular with the party. A short time since, no doubt it was regarded by the party as being one and the same as national ruin and national disgrace. But it had answered well at Porcorum, and with due manipulation had been found to be favourable at Sticinthemud. The Ballot might perhaps help the long pull and the strong pull,--and, in spite of the ruin and disgrace, was thought by some just now to be a highly Conservative measure. It was considered that the Ballot might assist Melmotte at Westminster very materially.\nAny one reading the Conservative papers of the time, and hearing the Conservative speeches in the borough,--any one at least who lived so remote as not to have learned what these things really mean,--would have thought that England's welfare depended on Melmotte's return. In the enthusiasm of the moment, the attacks made on his character were answered by eulogy as loud as the censure was bitter. The chief crime laid to his charge was connected with the ruin of some great continental assurance company, as to which it was said that he had so managed it as to leave it utterly stranded, with an enormous fortune of his own. It was declared that every shilling which he had brought to England with him had consisted of plunder stolen from the shareholders in the company. Now the \"Evening Pulpit,\" in its endeavour to make the facts of this transaction known, had placed what it called the domicile of this company in Paris, whereas it was ascertained that its official head-quarters had in truth been placed at Vienna. Was not such a blunder as this sufficient to show that no merchant of higher honour than Mr. Melmotte had ever adorned the Exchanges of modern capitals? And then two different newspapers of the time, both of them antagonistic to Melmotte, failed to be in accord on a material point. One declared that Mr. Melmotte was not in truth possessed of any wealth. The other said that he had derived his wealth from those unfortunate shareholders. Could anything betray so bad a cause as contradictions such as these? Could anything be so false, so weak, so malignant, so useless, so wicked, so self-condemned,--in fact, so \"Liberal\" as a course of action such as this? The belief naturally to be deduced from such statements, nay, the unavoidable conviction on the minds--of, at any rate, the Conservative newspapers--was that Mr. Melmotte had accumulated an immense fortune, and that he had never robbed any shareholder of a shilling.\nThe friends of Melmotte had moreover a basis of hope, and were enabled to sound premonitory notes of triumph, arising from causes quite external to their party. The \"Breakfast Table\" supported Melmotte, but the \"Breakfast Table\" was not a Conservative organ. This support was given, not to the great man's political opinions, as to which a well-known writer in that paper suggested that the great man had probably not as yet given very much attention to the party questions which divided the country,--but to his commercial position. It was generally acknowledged that few men living,--perhaps no man alive,--had so acute an insight into the great commercial questions of the age as Mr. Augustus Melmotte. In whatever part of the world he might have acquired his commercial experience,--for it had been said repeatedly that Melmotte was not an Englishman,--he now made London his home and Great Britain his country, and it would be for the welfare of the country that such a man should sit in the British Parliament. Such were the arguments used by the \"Breakfast Table\" in supporting Mr. Melmotte. This was, of course, an assistance;--and not the less so because it was asserted in other papers that the country would be absolutely disgraced by his presence in Parliament. The hotter the opposition the keener will be the support. Honest good men, men who really loved their country, fine gentlemen, who had received unsullied names from great ancestors, shed their money right and left, and grew hot in personally energetic struggles to have this man returned to Parliament as the head of the great Conservative mercantile interests of Great Britain!\nThere was one man who thoroughly believed that the thing at the present moment most essentially necessary to England's glory was the return of Mr. Melmotte for Westminster. This man was undoubtedly a very ignorant man. He knew nothing of any one political question which had vexed England for the last half century,--nothing whatever of the political history which had made England what it was at the beginning of that half century. Of such names as Hampden, Somers, and Pitt he had hardly ever heard. He had probably never read a book in his life. He knew nothing of the working of parliament, nothing of nationality,--had no preference whatever for one form of government over another, never having given his mind a moment's trouble on the subject. He had not even reflected how a despotic monarch or a federal republic might affect himself, and possibly did not comprehend the meaning of those terms. But yet he was fully confident that England did demand and ought to demand that Mr. Melmotte should be returned for Westminster. This man was Mr. Melmotte himself.\nIn this conjunction of his affairs Mr. Melmotte certainly lost his head. He had audacity almost sufficient for the very dangerous game which he was playing; but, as crisis heaped itself upon crisis, he became deficient in prudence. He did not hesitate to speak of himself as the man who ought to represent Westminster, and of those who opposed him as little malignant beings who had mean interests of their own to serve. He went about in his open carriage, with Lord Alfred at his left hand, with a look on his face which seemed to imply that Westminster was not good enough for him. He even hinted to certain political friends that at the next general election he should try the City. Six months since he had been a humble man to a Lord,--but now he scolded Earls and snubbed Dukes, and yet did it in a manner which showed how proud he was of connecting himself with their social pre-eminence, and how ignorant of the manner in which such pre-eminence affects English gentlemen generally. The more arrogant he became the more vulgar he was, till even Lord Alfred would almost be tempted to rush away to impecuniosity and freedom. Perhaps there were some with whom this conduct had a salutary effect. No doubt arrogance will produce submission; and there are men who take other men at the price those other men put upon themselves. Such persons could not refrain from thinking Melmotte to be mighty because he swaggered; and gave their hinder parts to be kicked merely because he put up his toe. We all know men of this calibre,--and how they seem to grow in number. But the net result of his personal demeanour was injurious; and it was debated among some of the warmest of his supporters whether a hint should not be given him. \"Couldn't Lord Alfred say a word to him?\" said the Honourable Beauchamp Beauclerk, who, himself in Parliament, a leading man in his party, thoroughly well acquainted with the borough, wealthy and connected by blood with half the great Conservative families in the kingdom, had been moving heaven and earth on behalf of the great financial king, and working like a slave for his success.\n\"Alfred's more than half afraid of him,\" said Lionel Lupton, a young aristocrat, also in Parliament, who had been inoculated with the idea that the interests of the party demanded Melmotte in Parliament, but who would have given up his Scotch shooting rather than have undergone Melmotte's company for a day.\n\"Something really must be done, Mr. Beauclerk,\" said Mr. Jones, who was the leading member of a very wealthy firm of builders in the borough, who had become a Conservative politician, who had thoughts of the House for himself, but who never forgot his own position. \"He is making a great many personal enemies.\"\n\"He's the finest old turkey cock out,\" said Lionel Lupton.\nThen it was decided that Mr. Beauclerk should speak a word to Lord Alfred. The rich man and the poor man were cousins, and had always been intimate. \"Alfred,\" said the chosen mentor at the club one afternoon, \"I wonder whether you couldn't say something to Melmotte about his manner.\" Lord Alfred turned sharp round and looked into his companion's face. \"They tell me he is giving offence. Of course he doesn't mean it. Couldn't he draw it a little milder?\"\nLord Alfred made his reply almost in a whisper. \"If you ask me, I don't think he could. If you got him down and trampled on him, you might make him mild. I don't think there's any other way.\"\n\"You couldn't speak to him, then?\"\n\"Not unless I did it with a horsewhip.\"\nThis, coming from Lord Alfred, who was absolutely dependent on the man, was very strong. Lord Alfred had been much afflicted that morning. He had spent some hours with his friend, either going about the borough in the open carriage, or standing just behind him at meetings, or sitting close to him in committee-rooms,--and had been nauseated with Melmotte. When spoken to about his friend he could not restrain himself. Lord Alfred had been born and bred a gentleman, and found the position in which he was now earning his bread to be almost insupportable. It had gone against the grain with him at first, when he was called Alfred; but now that he was told \"just to open the door,\" and \"just to give that message,\" he almost meditated revenge. Lord Nidderdale, who was quick at observation, had seen something of this in Grosvenor Square, and declared that Lord Alfred had invested part of his recent savings in a cutting whip. Mr. Beauclerk, when he had got his answer, whistled and withdrew. But he was true to his party. Melmotte was not the first vulgar man whom the Conservatives had taken by the hand, and patted on the back, and told that he was a god.\nThe Emperor of China was now in England, and was to be entertained one night at the India Office. The Secretary of State for the second great Asiatic Empire was to entertain the ruler of the first. This was on Saturday the 6th of July, and Melmotte's dinner was to take place on the following Monday. Very great interest was made by the London world generally to obtain admission to the India Office,--the making of such interest consisting in the most abject begging for tickets of admission, addressed to the Secretary of State, to all the under secretaries, to assistant secretaries, secretaries of departments, chief clerks, and to head-messengers and their wives. If a petitioner could not be admitted as a guest into the splendour of the reception rooms, might not he,--or she,--be allowed to stand in some passage whence the Emperor's back might perhaps be seen,--so that, if possible, the petitioner's name might be printed in the list of guests which would be published on the next morning? Now Mr. Melmotte with his family was, of course, supplied with tickets. He, who was to spend a fortune in giving the Emperor a dinner, was of course entitled to be present at other places to which the Emperor would be brought to be shown. Melmotte had already seen the Emperor at a breakfast in Windsor Park, and at a ball in royal halls. But hitherto he had not been presented to the Emperor. Presentations have to be restricted,--if only on the score of time; and it had been thought that as Mr. Melmotte would of course have some communication with the hardworked Emperor at his own house, that would suffice. But he had felt himself to be ill-used and was offended. He spoke with bitterness to some of his supporters of the Royal Family generally, because he had not been brought to the front rank either at the breakfast or at the ball,--and now, at the India Office, was determined to have his due. But he was not on the list of those whom the Secretary of State intended on this occasion to present to the Brother of the Sun.\nHe had dined freely. At this period of his career he had taken to dining freely,--which was in itself imprudent, as he had need at all hours of his best intelligence. Let it not be understood that he was tipsy. He was a man whom wine did not often affect after that fashion. But it made him, who was arrogant before, tower in his arrogance till he was almost sure to totter. It was probably at some moment after dinner that Lord Alfred decided upon buying the cutting whip of which he had spoken. Melmotte went with his wife and daughter to the India Office, and soon left them far in the background with a request,--we may say an order,--to Lord Alfred to take care of them. It may be observed here that Marie Melmotte was almost as great a curiosity as the Emperor himself, and was much noticed as the girl who had attempted to run away to New York, but had gone without her lover. Melmotte entertained some foolish idea that as the India Office was in Westminster, he had a peculiar right to demand an introduction on this occasion because of his candidature. He did succeed in getting hold of an unfortunate under secretary of state, a studious and invaluable young peer, known as Earl De Griffin. He was a shy man, of enormous wealth, of mediocre intellect, and no great physical ability, who never amused himself; but worked hard night and day, and read everything that anybody could write, and more than any other person could read, about India. Had Mr. Melmotte wanted to know the exact dietary of the peasants in Orissa, or the revenue of the Punjaub, or the amount of crime in Bombay, Lord De Griffin would have informed him without a pause. But in this matter of managing the Emperor, the under secretary had nothing to do, and would have been the last man to be engaged in such a service. He was, however, second in command at the India Office, and of his official rank Melmotte was unfortunately made aware. \"My Lord,\" said he, by no means hiding his demand in a whisper, \"I am desirous of being presented to his Imperial Majesty.\" Lord De Griffin looked at him in despair, not knowing the great man,--being one of the few men in that room who did not know him.\n\"This is Mr. Melmotte,\" said Lord Alfred, who had deserted the ladies and still stuck to his master. \"Lord De Griffin, let me introduce you to Mr. Melmotte.\"\n\"Oh--oh--oh,\" said Lord De Griffin, just putting out his hand. \"I am delighted;--ah, yes,\" and pretending to see somebody, he made a weak and quite ineffectual attempt to escape.\nMelmotte stood directly in his way, and with unabashed audacity repeated his demand. \"I am desirous of being presented to his Imperial Majesty. Will you do me the honour of making my request known to Mr. Wilson?\" Mr. Wilson was the Secretary of State, who was as busy as a Secretary of State is sure to be on such an occasion.\n\"I hardly know,\" said Lord De Griffin. \"I'm afraid it's all arranged. I don't know anything about it myself.\"\n\"You can introduce me to Mr. Wilson.\"\n\"He's up there, Mr. Melmotte; and I couldn't get at him. Really you must excuse me. I'm very sorry. If I see him I'll tell him.\" And the poor under secretary again endeavoured to escape.\nMr. Melmotte put up his hand and stopped him. \"I'm not going to stand this kind of thing,\" he said. The old Marquis of Auld Reekie was close at hand, the father of Lord Nidderdale, and therefore the proposed father-in-law of Melmotte's daughter, and he poked his thumb heavily into Lord Alfred's ribs. \"It is generally understood, I believe,\" continued Melmotte, \"that the Emperor is to do me the honour of dining at my poor house on Monday. He don't dine there unless I'm made acquainted with him before he comes. I mean what I say. I ain't going to entertain even an Emperor unless I'm good enough to be presented to him. Perhaps you'd better let Mr. Wilson know, as a good many people intend to come.\"\n\"Here's a row,\" said the old Marquis. \"I wish he'd be as good as his word.\"\n\"He has taken a little wine,\" whispered Lord Alfred. \"Melmotte,\" he said, still whispering; \"upon my word it isn't the thing. They're only Indian chaps and Eastern swells who are presented here,--not a fellow among 'em all who hasn't been in India or China, or isn't a Secretary of State, or something of that kind.\"\n\"Then they should have done it at Windsor, or at the ball,\" said Melmotte, pulling down his waistcoat. \"By George, Alfred! I'm in earnest, and somebody had better look to it. If I'm not presented to his Imperial Majesty to-night, by G----, there shall be no dinner in Grosvenor Square on Monday. I'm master enough of my own house, I suppose, to be able to manage that.\"\nHere was a row, as the Marquis had said! Lord De Griffin was frightened, and Lord Alfred felt that something ought to be done. \"There's no knowing how far the pig-headed brute may go in his obstinacy,\" Lord Alfred said to Mr. Lupton, who was there. It no doubt might have been wise to have allowed the merchant prince to return home with the resolution that his dinner should be abandoned. He would have repented probably before the next morning; and had he continued obdurate it would not have been difficult to explain to Celestial Majesty that something preferable had been found for that particular evening even to a banquet at the house of British commerce. The Government would probably have gained the seat for Westminster, as Melmotte would at once have become very unpopular with the great body of his supporters. But Lord De Griffin was not the man to see this. He did make his way up to Mr. Wilson, and explained to the Amphytrion of the night the demand which was made on his hospitality. A thoroughly well-established and experienced political Minister of State always feels that if he can make a friend or appease an enemy without paying a heavy price he will be doing a good stroke of business. \"Bring him up,\" said Mr. Wilson. \"He's going to do something out in the East, isn't he?\" \"Nothing in India,\" said Lord De Griffin. \"The submarine telegraph is quite impossible.\" Mr. Wilson, instructing some satellite to find out in what way he might properly connect Mr. Melmotte with China, sent Lord De Griffin away with his commission.\n\"My dear Alfred, just allow me to manage these things myself,\" Mr. Melmotte was saying when the under secretary returned. \"I know my own position and how to keep it. There shall be no dinner. I'll be d---- if any of the lot shall dine in Grosvenor Square on Monday.\" Lord Alfred was so astounded that he was thinking of making his way to the Prime Minister, a man whom he abhorred and didn't know, and of acquainting him with the terrible calamity which was threatened. But the arrival of the under secretary saved him the trouble.\n\"If you will come with me,\" whispered Lord De Griffin, \"it shall be managed. It isn't just the thing, but as you wish it, it shall be done.\"\n\"I do wish it,\" said Melmotte aloud. He was one of those men whom success never mollified, whose enjoyment of a point gained always demanded some hoarse note of triumph from his own trumpet.\n\"If you will be so kind as to follow me,\" said Lord De Griffin. And so the thing was done. Melmotte, as he was taken up to the imperial footstool, was resolved upon making a little speech, forgetful at the moment of interpreters,--of the double interpreters whom the Majesty of China required; but the awful, quiescent solemnity of the celestial one quelled even him, and he shuffled by without saying a word even of his own banquet.\nBut he had gained his point, and, as he was taken home to poor Mr. Longestaffe's house in Bruton Street, was intolerable. Lord Alfred tried to escape after putting Madame Melmotte and her daughter into the carriage, but Melmotte insisted on his presence. \"You might as well come, Alfred;--there are two or three things I must settle before I go to bed.\"\n\"I'm about knocked up,\" said the unfortunate man.\n\"Knocked up, nonsense! Think what I've been through. I've been all day at the hardest work a man can do.\" Had he as usual got in first, leaving his man-of-all-work to follow, the man-of-all-work would have escaped. Melmotte, fearing such defection, put his hand on Lord Alfred's shoulder, and the poor fellow was beaten. As they were taken home a continual sound of cock-crowing was audible, but as the words were not distinguished they required no painful attention; but when the soda water and brandy and cigars made their appearance in Mr. Longestaffe's own back room, then the trumpet was sounded with a full blast. \"I mean to let the fellows know what's what,\" said Melmotte, walking about the room. Lord Alfred had thrown himself into an arm-chair, and was consoling himself as best he might with tobacco. \"Give and take is a very good motto. If I scratch their back, I mean them to scratch mine. They won't find many people to spend ten thousand pounds in entertaining a guest of the country's as a private enterprise. I don't know of any other man of business who could do it, or would do it. It's not much any of them can do for me. Thank God, I don't want 'em. But if consideration is to be shown to anybody, I intend to be considered. The Prince treated me very scurvily, Alfred, and I shall take an opportunity of telling him so on Monday. I suppose a man may be allowed to speak to his own guests.\"\n\"You might turn the election against you if you said anything the Prince didn't like.\"\n\"D---- the election, sir. I stand before the electors of Westminster as a man of business, not as a courtier,--as a man who understands commercial enterprise, not as one of the Prince's toadies. Some of you fellows in England don't realise the matter yet; but I can tell you that I think myself quite as great a man as any Prince.\" Lord Alfred looked at him, with strong reminiscences of the old ducal home, and shuddered. \"I'll teach them a lesson before long. Didn't I teach 'em a lesson to-night,--eh? They tell me that Lord De Griffin has sixty thousand a-year to spend. What's sixty thousand a year? Didn't I make him go on my business? And didn't I make 'em do as I chose? You want to tell me this and that, but I can tell you that I know more of men and women than some of you fellows do, who think you know a great deal.\"\nThis went on through the whole of a long cigar; and afterwards, as Lord Alfred slowly paced his way back to his lodgings in Mount Street, he thought deeply whether there might not be means of escaping from his present servitude. \"Beast! Brute! Pig!\" he said to himself over and over again as he slowly went to Mount Street.",
        "paragraph_chars": [
            [
                0,
                1811
            ],
            [
                1811,
                3077
            ],
            [
                3077,
                5027
            ],
            [
                5027,
                6680
            ],
            [
                6680,
                7748
            ],
            [
                7748,
                9865
            ],
            [
                9865,
                10174
            ],
            [
                10174,
                10486
            ],
            [
                10486,
                10545
            ],
            [
                10545,
                11003
            ],
            [
                11003,
                11195
            ],
            [
                11195,
                11230
            ],
            [
                11230,
                11270
            ],
            [
                11270,
                12431
            ],
            [
                12431,
                14464
            ],
            [
                14464,
                16639
            ],
            [
                16639,
                16797
            ],
            [
                16797,
                16976
            ],
            [
                16976,
                17303
            ],
            [
                17303,
                17413
            ],
            [
                17413,
                17451
            ],
            [
                17451,
                17638
            ],
            [
                17638,
                18343
            ],
            [
                18343,
                18419
            ],
            [
                18419,
                18736
            ],
            [
                18736,
                19106
            ],
            [
                19106,
                20655
            ],
            [
                20655,
                21187
            ],
            [
                21187,
                21328
            ],
            [
                21328,
                21519
            ],
            [
                21519,
                21953
            ],
            [
                21953,
                22307
            ],
            [
                22307,
                22357
            ],
            [
                22357,
                23769
            ],
            [
                23769,
                23856
            ],
            [
                23856,
                24686
            ],
            [
                24686,
                25009
            ]
        ],
        "segment_chars": [
            [
                0,
                231
            ],
            [
                231,
                527
            ],
            [
                527,
                828
            ],
            [
                828,
                1107
            ],
            [
                1107,
                1244
            ],
            [
                1244,
                1406
            ],
            [
                1406,
                1515
            ],
            [
                1515,
                1605
            ],
            [
                1605,
                1811
            ],
            [
                1811,
                1840
            ],
            [
                1840,
                1920
            ],
            [
                1920,
                1937
            ],
            [
                1937,
                2061
            ],
            [
                2061,
                2385
            ],
            [
                2385,
                2528
            ],
            [
                2528,
                2580
            ],
            [
                2580,
                2704
            ],
            [
                2704,
                2817
            ],
            [
                2817,
                2989
            ],
            [
                2989,
                3077
            ],
            [
                3077,
                3350
            ],
            [
                3350,
                3476
            ],
            [
                3476,
                3704
            ],
            [
                3704,
                3851
            ],
            [
                3851,
                4099
            ],
            [
                4099,
                4252
            ],
            [
                4252,
                4382
            ],
            [
                4382,
                4455
            ],
            [
                4455,
                4538
            ],
            [
                4538,
                4608
            ],
            [
                4608,
                4760
            ],
            [
                4760,
                5027
            ],
            [
                5027,
                5188
            ],
            [
                5188,
                5286
            ],
            [
                5286,
                5561
            ],
            [
                5561,
                5733
            ],
            [
                5733,
                6044
            ],
            [
                6044,
                6126
            ],
            [
                6126,
                6301
            ],
            [
                6301,
                6359
            ],
            [
                6359,
                6680
            ],
            [
                6680,
                6853
            ],
            [
                6853,
                6899
            ],
            [
                6899,
                7113
            ],
            [
                7113,
                7182
            ],
            [
                7182,
                7229
            ],
            [
                7229,
                7431
            ],
            [
                7431,
                7584
            ],
            [
                7584,
                7713
            ],
            [
                7713,
                7748
            ],
            [
                7748,
                7821
            ],
            [
                7821,
                7980
            ],
            [
                7980,
                8169
            ],
            [
                8169,
                8332
            ],
            [
                8332,
                8434
            ],
            [
                8434,
                8738
            ],
            [
                8738,
                8879
            ],
            [
                8879,
                8949
            ],
            [
                8949,
                9080
            ],
            [
                9080,
                9244
            ],
            [
                9244,
                9315
            ],
            [
                9315,
                9478
            ],
            [
                9478,
                9520
            ],
            [
                9520,
                9865
            ],
            [
                9865,
                10174
            ],
            [
                10174,
                10440
            ],
            [
                10440,
                10486
            ],
            [
                10486,
                10545
            ],
            [
                10545,
                10620
            ],
            [
                10620,
                10694
            ],
            [
                10694,
                10830
            ],
            [
                10830,
                10899
            ],
            [
                10899,
                10935
            ],
            [
                10935,
                10965
            ],
            [
                10965,
                11003
            ],
            [
                11003,
                11051
            ],
            [
                11051,
                11091
            ],
            [
                11091,
                11157
            ],
            [
                11157,
                11195
            ],
            [
                11195,
                11230
            ],
            [
                11230,
                11270
            ],
            [
                11270,
                11359
            ],
            [
                11359,
                11409
            ],
            [
                11409,
                11627
            ],
            [
                11627,
                11690
            ],
            [
                11690,
                11827
            ],
            [
                11827,
                12015
            ],
            [
                12015,
                12199
            ],
            [
                12199,
                12265
            ],
            [
                12265,
                12295
            ],
            [
                12295,
                12431
            ],
            [
                12431,
                12529
            ],
            [
                12529,
                12629
            ],
            [
                12629,
                12732
            ],
            [
                12732,
                13100
            ],
            [
                13100,
                13431
            ],
            [
                13431,
                13503
            ],
            [
                13503,
                13670
            ],
            [
                13670,
                13770
            ],
            [
                13770,
                13825
            ],
            [
                13825,
                14044
            ],
            [
                14044,
                14101
            ],
            [
                14101,
                14336
            ],
            [
                14336,
                14464
            ],
            [
                14464,
                14485
            ],
            [
                14485,
                14631
            ],
            [
                14631,
                14675
            ],
            [
                14675,
                14739
            ],
            [
                14739,
                14839
            ],
            [
                14839,
                14961
            ],
            [
                14961,
                15140
            ],
            [
                15140,
                15348
            ],
            [
                15348,
                15527
            ],
            [
                15527,
                15666
            ],
            [
                15666,
                15917
            ],
            [
                15917,
                16116
            ],
            [
                16116,
                16265
            ],
            [
                16265,
                16385
            ],
            [
                16385,
                16509
            ],
            [
                16509,
                16639
            ],
            [
                16639,
                16740
            ],
            [
                16740,
                16797
            ],
            [
                16797,
                16860
            ],
            [
                16860,
                16976
            ],
            [
                16976,
                17061
            ],
            [
                17061,
                17120
            ],
            [
                17120,
                17189
            ],
            [
                17189,
                17303
            ],
            [
                17303,
                17342
            ],
            [
                17342,
                17373
            ],
            [
                17373,
                17413
            ],
            [
                17413,
                17451
            ],
            [
                17451,
                17508
            ],
            [
                17508,
                17535
            ],
            [
                17535,
                17551
            ],
            [
                17551,
                17580
            ],
            [
                17580,
                17638
            ],
            [
                17638,
                17684
            ],
            [
                17684,
                17738
            ],
            [
                17738,
                17940
            ],
            [
                17940,
                18080
            ],
            [
                18080,
                18153
            ],
            [
                18153,
                18172
            ],
            [
                18172,
                18262
            ],
            [
                18262,
                18343
            ],
            [
                18343,
                18381
            ],
            [
                18381,
                18419
            ],
            [
                18419,
                18472
            ],
            [
                18472,
                18545
            ],
            [
                18545,
                18736
            ],
            [
                18736,
                18839
            ],
            [
                18839,
                18859
            ],
            [
                18859,
                18911
            ],
            [
                18911,
                19032
            ],
            [
                19032,
                19106
            ],
            [
                19106,
                19147
            ],
            [
                19147,
                19233
            ],
            [
                19233,
                19355
            ],
            [
                19355,
                19496
            ],
            [
                19496,
                19769
            ],
            [
                19769,
                19929
            ],
            [
                19929,
                19978
            ],
            [
                19978,
                20107
            ],
            [
                20107,
                20316
            ],
            [
                20316,
                20349
            ],
            [
                20349,
                20405
            ],
            [
                20405,
                20447
            ],
            [
                20447,
                20494
            ],
            [
                20494,
                20655
            ],
            [
                20655,
                20777
            ],
            [
                20777,
                20821
            ],
            [
                20821,
                20847
            ],
            [
                20847,
                20922
            ],
            [
                20922,
                21125
            ],
            [
                21125,
                21187
            ],
            [
                21187,
                21264
            ],
            [
                21264,
                21328
            ],
            [
                21328,
                21365
            ],
            [
                21365,
                21519
            ],
            [
                21519,
                21583
            ],
            [
                21583,
                21610
            ],
            [
                21610,
                21953
            ],
            [
                21953,
                22075
            ],
            [
                22075,
                22208
            ],
            [
                22208,
                22307
            ],
            [
                22307,
                22357
            ],
            [
                22357,
                22380
            ],
            [
                22380,
                22410
            ],
            [
                22410,
                22463
            ],
            [
                22463,
                22572
            ],
            [
                22572,
                22678
            ],
            [
                22678,
                22977
            ],
            [
                22977,
                23062
            ],
            [
                23062,
                23169
            ],
            [
                23169,
                23206
            ],
            [
                23206,
                23260
            ],
            [
                23260,
                23383
            ],
            [
                23383,
                23458
            ],
            [
                23458,
                23499
            ],
            [
                23499,
                23528
            ],
            [
                23528,
                23603
            ],
            [
                23603,
                23709
            ],
            [
                23709,
                23769
            ],
            [
                23769,
                23856
            ],
            [
                23856,
                23882
            ],
            [
                23882,
                24051
            ],
            [
                24051,
                24188
            ],
            [
                24188,
                24279
            ],
            [
                24279,
                24318
            ],
            [
                24318,
                24361
            ],
            [
                24361,
                24431
            ],
            [
                24431,
                24461
            ],
            [
                24461,
                24498
            ],
            [
                24498,
                24535
            ],
            [
                24535,
                24686
            ],
            [
                24686,
                24915
            ],
            [
                24915,
                24923
            ],
            [
                24923,
                24930
            ],
            [
                24930,
                24936
            ],
            [
                24936,
                25009
            ]
        ],
        "overlap_chars": [
            [
                0,
                87
            ],
            [
                254,
                271
            ],
            [
                466,
                527
            ],
            [
                1515,
                1553
            ],
            [
                1567,
                1578
            ],
            [
                1149,
                1150
            ],
            [
                1107,
                1110
            ],
            [
                1210,
                1217
            ],
            [
                1192,
                1193
            ],
            [
                1583,
                1605
            ],
            [
                1605,
                1677
            ],
            [
                1685,
                1708
            ],
            [
                1723,
                1744
            ],
            [
                1748,
                1811
            ],
            [
                1937,
                1944
            ],
            [
                1953,
                1982
            ],
            [
                2069,
                2081
            ],
            [
                2113,
                2123
            ],
            [
                2136,
                2144
            ],
            [
                1996,
                2003
            ],
            [
                2157,
                2203
            ],
            [
                2235,
                2255
            ],
            [
                2258,
                2305
            ],
            [
                2306,
                2312
            ],
            [
                2315,
                2385
            ],
            [
                2385,
                2388
            ],
            [
                2399,
                2418
            ],
            [
                2428,
                2528
            ],
            [
                2528,
                2578
            ],
            [
                2740,
                2745
            ],
            [
                2609,
                2611
            ],
            [
                3023,
                3059
            ],
            [
                3075,
                3077
            ],
            [
                3077,
                3128
            ],
            [
                3277,
                3341
            ],
            [
                3348,
                3350
            ],
            [
                3353,
                3356
            ],
            [
                3464,
                3467
            ],
            [
                3441,
                3463
            ],
            [
                3368,
                3370
            ],
            [
                3468,
                3476
            ],
            [
                3476,
                3583
            ],
            [
                3590,
                3607
            ],
            [
                3613,
                3619
            ],
            [
                3649,
                3704
            ],
            [
                3851,
                3858
            ],
            [
                3868,
                3874
            ],
            [
                3877,
                3879
            ],
            [
                3915,
                3919
            ],
            [
                3937,
                3942
            ],
            [
                4031,
                4035
            ],
            [
                3902,
                3905
            ],
            [
                3986,
                3993
            ],
            [
                3994,
                4011
            ],
            [
                4067,
                4069
            ],
            [
                4091,
                4099
            ],
            [
                4103,
                4106
            ],
            [
                4125,
                4129
            ],
            [
                4114,
                4121
            ],
            [
                4144,
                4153
            ],
            [
                4188,
                4200
            ],
            [
                4099,
                4102
            ],
            [
                4112,
                4113
            ],
            [
                4157,
                4168
            ],
            [
                4176,
                4182
            ],
            [
                4250,
                4251
            ],
            [
                4252,
                4285
            ],
            [
                4297,
                4303
            ],
            [
                4312,
                4347
            ],
            [
                4380,
                4382
            ],
            [
                4382,
                4399
            ],
            [
                4421,
                4429
            ],
            [
                4453,
                4455
            ],
            [
                4455,
                4536
            ],
            [
                4536,
                4538
            ],
            [
                4608,
                4647
            ],
            [
                4674,
                4680
            ],
            [
                4689,
                4690
            ],
            [
                4702,
                4726
            ],
            [
                4754,
                4758
            ],
            [
                4758,
                4760
            ],
            [
                4760,
                4763
            ],
            [
                4795,
                4799
            ],
            [
                4815,
                4816
            ],
            [
                4880,
                4907
            ],
            [
                4820,
                4821
            ],
            [
                4909,
                4934
            ],
            [
                4947,
                5027
            ],
            [
                5256,
                5278
            ],
            [
                5393,
                5398
            ],
            [
                5228,
                5229
            ],
            [
                5188,
                5191
            ],
            [
                5203,
                5208
            ],
            [
                5210,
                5228
            ],
            [
                5536,
                5559
            ],
            [
                5559,
                5561
            ],
            [
                5596,
                5603
            ],
            [
                5636,
                5733
            ],
            [
                5786,
                5789
            ],
            [
                5811,
                5812
            ],
            [
                5947,
                5966
            ],
            [
                5934,
                5941
            ],
            [
                5990,
                6044
            ],
            [
                6054,
                6057
            ],
            [
                6076,
                6079
            ],
            [
                6091,
                6096
            ],
            [
                6114,
                6115
            ],
            [
                6680,
                6736
            ],
            [
                6759,
                6763
            ],
            [
                6776,
                6785
            ],
            [
                6789,
                6853
            ],
            [
                6853,
                6899
            ],
            [
                6899,
                6921
            ],
            [
                7014,
                7030
            ],
            [
                6945,
                6995
            ],
            [
                7091,
                7093
            ],
            [
                7077,
                7080
            ],
            [
                7404,
                7406
            ],
            [
                6926,
                6935
            ],
            [
                7031,
                7038
            ],
            [
                7137,
                7138
            ],
            [
                7245,
                7273
            ],
            [
                7429,
                7431
            ],
            [
                7588,
                7627
            ],
            [
                7643,
                7713
            ],
            [
                7713,
                7748
            ],
            [
                7751,
                7755
            ],
            [
                7783,
                7821
            ],
            [
                7821,
                7827
            ],
            [
                7855,
                7949
            ],
            [
                7970,
                7980
            ],
            [
                7980,
                7982
            ],
            [
                8071,
                8122
            ],
            [
                8065,
                8070
            ],
            [
                8172,
                8203
            ],
            [
                8240,
                8246
            ],
            [
                8330,
                8332
            ],
            [
                8496,
                8621
            ],
            [
                8629,
                8641
            ],
            [
                8736,
                8738
            ],
            [
                8738,
                8788
            ],
            [
                8877,
                8878
            ],
            [
                9319,
                9322
            ],
            [
                9327,
                9333
            ],
            [
                9360,
                9363
            ],
            [
                9476,
                9478
            ],
            [
                9478,
                9520
            ],
            [
                9520,
                9588
            ],
            [
                9751,
                9821
            ],
            [
                9863,
                9865
            ],
            [
                9865,
                9964
            ],
            [
                10172,
                10174
            ],
            [
                10174,
                10241
            ],
            [
                10268,
                10314
            ],
            [
                10438,
                10440
            ],
            [
                10440,
                10486
            ],
            [
                10486,
                10545
            ],
            [
                10550,
                10619
            ],
            [
                10694,
                10708
            ],
            [
                10727,
                10830
            ],
            [
                10830,
                10848
            ],
            [
                10855,
                10899
            ],
            [
                10899,
                10935
            ],
            [
                10965,
                11003
            ],
            [
                11003,
                11051
            ],
            [
                11051,
                11089
            ],
            [
                11195,
                11230
            ],
            [
                11230,
                11270
            ],
            [
                11359,
                11409
            ],
            [
                11409,
                11437
            ],
            [
                11617,
                11625
            ],
            [
                11448,
                11449
            ],
            [
                11457,
                11502
            ],
            [
                11506,
                11542
            ],
            [
                11580,
                11581
            ],
            [
                11589,
                11616
            ],
            [
                11564,
                11567
            ],
            [
                11625,
                11627
            ],
            [
                11770,
                11772
            ],
            [
                11742,
                11747
            ],
            [
                11789,
                11792
            ],
            [
                11752,
                11760
            ],
            [
                11799,
                11827
            ],
            [
                11876,
                11887
            ],
            [
                11923,
                11927
            ],
            [
                11934,
                11936
            ],
            [
                11928,
                11933
            ],
            [
                11937,
                11962
            ],
            [
                11966,
                11988
            ],
            [
                11996,
                12015
            ],
            [
                12199,
                12212
            ],
            [
                12242,
                12264
            ],
            [
                12431,
                12497
            ],
            [
                12508,
                12527
            ],
            [
                12638,
                12732
            ],
            [
                12764,
                12780
            ],
            [
                12752,
                12755
            ],
            [
                12732,
                12736
            ],
            [
                12791,
                12831
            ],
            [
                12891,
                12910
            ],
            [
                12935,
                12937
            ],
            [
                12969,
                12991
            ],
            [
                12995,
                13016
            ],
            [
                13044,
                13063
            ],
            [
                13067,
                13099
            ],
            [
                13431,
                13503
            ],
            [
                13679,
                13770
            ],
            [
                13770,
                13773
            ],
            [
                13783,
                13825
            ],
            [
                14048,
                14082
            ],
            [
                14083,
                14101
            ],
            [
                14101,
                14125
            ],
            [
                14152,
                14171
            ],
            [
                14181,
                14232
            ],
            [
                14274,
                14336
            ],
            [
                14336,
                14371
            ],
            [
                14437,
                14464
            ],
            [
                14485,
                14544
            ],
            [
                14546,
                14555
            ],
            [
                14566,
                14582
            ],
            [
                14608,
                14631
            ],
            [
                14693,
                14711
            ],
            [
                14668,
                14673
            ],
            [
                14739,
                14754
            ],
            [
                14781,
                14839
            ],
            [
                14970,
                15001
            ],
            [
                15023,
                15026
            ],
            [
                15106,
                15120
            ],
            [
                15049,
                15052
            ],
            [
                15005,
                15022
            ],
            [
                15064,
                15068
            ],
            [
                15369,
                15440
            ],
            [
                15450,
                15481
            ],
            [
                15499,
                15527
            ],
            [
                15527,
                15666
            ],
            [
                15666,
                15683
            ],
            [
                15758,
                15761
            ],
            [
                15788,
                15818
            ],
            [
                16268,
                16271
            ],
            [
                16282,
                16319
            ],
            [
                15915,
                15916
            ],
            [
                16385,
                16400
            ],
            [
                16447,
                16451
            ],
            [
                16473,
                16509
            ],
            [
                16509,
                16576
            ],
            [
                16637,
                16639
            ],
            [
                16639,
                16679
            ],
            [
                16738,
                16739
            ],
            [
                16797,
                16798
            ],
            [
                16806,
                16831
            ],
            [
                16858,
                16860
            ],
            [
                16860,
                16876
            ],
            [
                16878,
                16891
            ],
            [
                16920,
                16938
            ],
            [
                16945,
                16976
            ],
            [
                16976,
                16990
            ],
            [
                17000,
                17015
            ],
            [
                17040,
                17060
            ],
            [
                17342,
                17371
            ],
            [
                17320,
                17341
            ],
            [
                17373,
                17410
            ],
            [
                17535,
                17549
            ],
            [
                17684,
                17728
            ],
            [
                17732,
                17736
            ],
            [
                17736,
                17738
            ],
            [
                17738,
                17787
            ],
            [
                17802,
                17817
            ],
            [
                17871,
                17873
            ],
            [
                17792,
                17798
            ],
            [
                17884,
                17906
            ],
            [
                17915,
                17940
            ],
            [
                17940,
                18024
            ],
            [
                18052,
                18057
            ],
            [
                18063,
                18080
            ],
            [
                18080,
                18153
            ],
            [
                18153,
                18172
            ],
            [
                18172,
                18260
            ],
            [
                18343,
                18380
            ],
            [
                18419,
                18472
            ],
            [
                18472,
                18545
            ],
            [
                18545,
                18612
            ],
            [
                18733,
                18736
            ],
            [
                18736,
                18777
            ],
            [
                18793,
                18809
            ],
            [
                18837,
                18839
            ],
            [
                18839,
                18859
            ],
            [
                18859,
                18911
            ],
            [
                18911,
                18955
            ],
            [
                18964,
                18970
            ],
            [
                18974,
                19030
            ],
            [
                19147,
                19233
            ],
            [
                19355,
                19357
            ],
            [
                19367,
                19403
            ],
            [
                19424,
                19494
            ],
            [
                19551,
                19552
            ],
            [
                19496,
                19504
            ],
            [
                19519,
                19527
            ],
            [
                19505,
                19518
            ],
            [
                19528,
                19551
            ],
            [
                19767,
                19769
            ],
            [
                19929,
                19948
            ],
            [
                20030,
                20036
            ],
            [
                20048,
                20050
            ],
            [
                20004,
                20029
            ],
            [
                19957,
                19960
            ],
            [
                19976,
                19977
            ],
            [
                20316,
                20349
            ],
            [
                20349,
                20404
            ],
            [
                20613,
                20628
            ],
            [
                20767,
                20775
            ],
            [
                20533,
                20535
            ],
            [
                20587,
                20595
            ],
            [
                21051,
                21056
            ],
            [
                21215,
                21224
            ],
            [
                20504,
                20505
            ],
            [
                21187,
                21212
            ],
            [
                20606,
                20607
            ],
            [
                21243,
                21264
            ],
            [
                21264,
                21328
            ],
            [
                21328,
                21365
            ],
            [
                21365,
                21388
            ],
            [
                21389,
                21401
            ],
            [
                21453,
                21519
            ],
            [
                21583,
                21610
            ],
            [
                21610,
                21706
            ],
            [
                21811,
                21827
            ],
            [
                21838,
                21927
            ],
            [
                21951,
                21953
            ],
            [
                21953,
                21985
            ],
            [
                22062,
                22075
            ],
            [
                22075,
                22190
            ],
            [
                22208,
                22209
            ],
            [
                22227,
                22231
            ],
            [
                22231,
                22240
            ],
            [
                22242,
                22307
            ],
            [
                22307,
                22357
            ],
            [
                22357,
                22358
            ],
            [
                22572,
                22580
            ],
            [
                22606,
                22678
            ],
            [
                22896,
                22899
            ],
            [
                22907,
                22913
            ],
            [
                22918,
                22927
            ],
            [
                22958,
                22964
            ],
            [
                22853,
                22863
            ],
            [
                22702,
                22703
            ],
            [
                22747,
                22748
            ],
            [
                22950,
                22957
            ],
            [
                22914,
                22917
            ],
            [
                22938,
                22945
            ],
            [
                22975,
                22976
            ],
            [
                22977,
                23022
            ],
            [
                23023,
                23027
            ],
            [
                23060,
                23062
            ],
            [
                23260,
                23355
            ],
            [
                23381,
                23383
            ],
            [
                23383,
                23440
            ],
            [
                23456,
                23458
            ],
            [
                23528,
                23531
            ],
            [
                23576,
                23590
            ],
            [
                23601,
                23603
            ],
            [
                23603,
                23709
            ],
            [
                23709,
                23728
            ],
            [
                23743,
                23769
            ],
            [
                23769,
                23853
            ],
            [
                23856,
                23858
            ],
            [
                23863,
                23882
            ],
            [
                23882,
                23953
            ],
            [
                24022,
                24051
            ],
            [
                24116,
                24185
            ],
            [
                24280,
                24318
            ],
            [
                24318,
                24345
            ],
            [
                24354,
                24355
            ],
            [
                24357,
                24361
            ],
            [
                24502,
                24533
            ],
            [
                24686,
                24721
            ],
            [
                24727,
                24771
            ],
            [
                24786,
                24806
            ],
            [
                24822,
                24868
            ],
            [
                24869,
                24895
            ],
            [
                24904,
                24914
            ],
            [
                24915,
                24923
            ],
            [
                24923,
                24930
            ],
            [
                24930,
                24936
            ],
            [
                24936,
                24980
            ],
            [
                24993,
                25009
            ]
        ],
        "row_chars": [
            [
                0,
                527
            ],
            [
                527,
                828
            ],
            [
                828,
                1107
            ],
            [
                1107,
                1605
            ],
            [
                1605,
                1811
            ],
            [
                1811,
                1840
            ],
            [
                1840,
                1920
            ],
            [
                1920,
                1937
            ],
            [
                1937,
                2385
            ],
            [
                2385,
                2528
            ],
            [
                2528,
                3077
            ],
            [
                3077,
                3350
            ],
            [
                3350,
                3476
            ],
            [
                3476,
                3704
            ],
            [
                3704,
                3851
            ],
            [
                3851,
                4099
            ],
            [
                4099,
                4252
            ],
            [
                4252,
                4382
            ],
            [
                4382,
                4455
            ],
            [
                4455,
                4538
            ],
            [
                4538,
                4760
            ],
            [
                4760,
                5027
            ],
            [
                5027,
                5188
            ],
            [
                5188,
                5561
            ],
            [
                5561,
                5733
            ],
            [
                5733,
                6044
            ],
            [
                6044,
                6126
            ],
            [
                6126,
                6301
            ],
            [
                6301,
                6359
            ],
            [
                6359,
                6680
            ],
            [
                6680,
                6853
            ],
            [
                6853,
                6899
            ],
            [
                6899,
                7431
            ],
            [
                7431,
                7584
            ],
            [
                7584,
                7713
            ],
            [
                7713,
                7748
            ],
            [
                7748,
                7821
            ],
            [
                7821,
                7980
            ],
            [
                7980,
                8332
            ],
            [
                8332,
                8434
            ],
            [
                8434,
                8738
            ],
            [
                8738,
                8879
            ],
            [
                8879,
                8949
            ],
            [
                8949,
                9080
            ],
            [
                9080,
                9244
            ],
            [
                9244,
                9315
            ],
            [
                9315,
                9478
            ],
            [
                9478,
                9520
            ],
            [
                9520,
                9865
            ],
            [
                9865,
                10174
            ],
            [
                10174,
                10440
            ],
            [
                10440,
                10486
            ],
            [
                10486,
                10545
            ],
            [
                10545,
                10620
            ],
            [
                10620,
                10694
            ],
            [
                10694,
                10830
            ],
            [
                10830,
                10899
            ],
            [
                10899,
                10935
            ],
            [
                10935,
                10965
            ],
            [
                10965,
                11003
            ],
            [
                11003,
                11051
            ],
            [
                11051,
                11091
            ],
            [
                11091,
                11157
            ],
            [
                11157,
                11195
            ],
            [
                11195,
                11230
            ],
            [
                11230,
                11270
            ],
            [
                11270,
                11359
            ],
            [
                11359,
                11409
            ],
            [
                11409,
                11627
            ],
            [
                11627,
                11690
            ],
            [
                11690,
                11827
            ],
            [
                11827,
                12015
            ],
            [
                12015,
                12199
            ],
            [
                12199,
                12265
            ],
            [
                12265,
                12295
            ],
            [
                12295,
                12431
            ],
            [
                12431,
                12732
            ],
            [
                12732,
                13100
            ],
            [
                13100,
                13431
            ],
            [
                13431,
                13503
            ],
            [
                13503,
                13670
            ],
            [
                13670,
                13770
            ],
            [
                13770,
                13825
            ],
            [
                13825,
                14044
            ],
            [
                14044,
                14101
            ],
            [
                14101,
                14336
            ],
            [
                14336,
                14464
            ],
            [
                14464,
                14485
            ],
            [
                14485,
                14631
            ],
            [
                14631,
                14839
            ],
            [
                14839,
                14961
            ],
            [
                14961,
                15527
            ],
            [
                15527,
                15666
            ],
            [
                15666,
                16385
            ],
            [
                16385,
                16509
            ],
            [
                16509,
                16639
            ],
            [
                16639,
                16740
            ],
            [
                16740,
                16797
            ],
            [
                16797,
                16860
            ],
            [
                16860,
                16976
            ],
            [
                16976,
                17061
            ],
            [
                17061,
                17120
            ],
            [
                17120,
                17189
            ],
            [
                17189,
                17303
            ],
            [
                17303,
                17373
            ],
            [
                17373,
                17413
            ],
            [
                17413,
                17451
            ],
            [
                17451,
                17508
            ],
            [
                17508,
                17535
            ],
            [
                17535,
                17551
            ],
            [
                17551,
                17580
            ],
            [
                17580,
                17638
            ],
            [
                17638,
                17684
            ],
            [
                17684,
                17738
            ],
            [
                17738,
                17940
            ],
            [
                17940,
                18080
            ],
            [
                18080,
                18153
            ],
            [
                18153,
                18172
            ],
            [
                18172,
                18262
            ],
            [
                18262,
                18343
            ],
            [
                18343,
                18381
            ],
            [
                18381,
                18419
            ],
            [
                18419,
                18472
            ],
            [
                18472,
                18545
            ],
            [
                18545,
                18736
            ],
            [
                18736,
                18839
            ],
            [
                18839,
                18859
            ],
            [
                18859,
                18911
            ],
            [
                18911,
                19032
            ],
            [
                19032,
                19106
            ],
            [
                19106,
                19147
            ],
            [
                19147,
                19233
            ],
            [
                19233,
                19355
            ],
            [
                19355,
                19769
            ],
            [
                19769,
                19929
            ],
            [
                19929,
                20107
            ],
            [
                20107,
                20316
            ],
            [
                20316,
                20349
            ],
            [
                20349,
                20405
            ],
            [
                20405,
                20447
            ],
            [
                20447,
                20494
            ],
            [
                20494,
                21264
            ],
            [
                21264,
                21328
            ],
            [
                21328,
                21365
            ],
            [
                21365,
                21519
            ],
            [
                21519,
                21583
            ],
            [
                21583,
                21610
            ],
            [
                21610,
                21953
            ],
            [
                21953,
                22075
            ],
            [
                22075,
                22307
            ],
            [
                22307,
                22357
            ],
            [
                22357,
                22380
            ],
            [
                22380,
                22410
            ],
            [
                22410,
                22463
            ],
            [
                22463,
                22572
            ],
            [
                22572,
                22678
            ],
            [
                22678,
                22977
            ],
            [
                22977,
                23062
            ],
            [
                23062,
                23169
            ],
            [
                23169,
                23206
            ],
            [
                23206,
                23260
            ],
            [
                23260,
                23383
            ],
            [
                23383,
                23458
            ],
            [
                23458,
                23499
            ],
            [
                23499,
                23528
            ],
            [
                23528,
                23603
            ],
            [
                23603,
                23709
            ],
            [
                23709,
                23769
            ],
            [
                23769,
                23856
            ],
            [
                23856,
                23882
            ],
            [
                23882,
                24051
            ],
            [
                24051,
                24188
            ],
            [
                24188,
                24279
            ],
            [
                24279,
                24318
            ],
            [
                24318,
                24361
            ],
            [
                24361,
                24431
            ],
            [
                24431,
                24461
            ],
            [
                24461,
                24498
            ],
            [
                24498,
                24535
            ],
            [
                24535,
                24686
            ],
            [
                24686,
                24915
            ],
            [
                24915,
                24923
            ],
            [
                24923,
                24930
            ],
            [
                24930,
                24936
            ],
            [
                24936,
                25009
            ]
        ]
    },
    "abridged": {
        "text": "The Conservative party at this particular period was putting its shoulder to the wheel, as it now and then does, so that other parties may not suppose that it is moribund. A long pull, a strong pull, and a pull together - and the old days, before the Radical reforms, will come back again. Venerable patriarchs think of Lord Liverpool and other heroes, and dream of Conservative bishops and lord-lieutenants, and a Conservative ministry that shall remain in for a generation.\nIf this seat for Westminster could be won by Mr. Melmotte, it would show that the country was sound at heart, and that all the great changes of the last forty years - from the first reform in Parliament down to the Secret Ballot - had been managed by the cunning and treachery of a few ambitious men. Not that the Ballot was regarded by the party as an unmitigated evil, though it was the last triumph of Radical wickedness. The Ballot was on the whole popular with the party, and it might assist Melmotte at Westminster.\nAnyone reading the Conservative papers of the time would have thought that England's welfare depended on Melmotte's election. The praise was as loud as the censure of him had been bitter. The chief crime laid to his charge was connected with the ruin of some great continental assurance company, which it was said he had left utterly stranded, with an enormous fortune of his own. Now the Evening Pulpit, in reporting this, had said that the company's headquarters were in Paris, whereas in fact they were in Vienna. Did not this blunder show that Mr. Melmotte was a merchant of high honour?\nAnd then two different newspapers, both antagonistic to Melmotte, failed to agree about his wealth. One declared that in truth he had none. The other said that he had derived his wealth from those unfortunate shareholders on the Continent. Could anything be so false, so weak, so wicked - in fact, so \"Liberal\" as this contradiction? The natural deduction from this, said the Conservative newspapers, was that Mr. Melmotte had an immense fortune, and that he had never robbed any shareholder of a shilling.\nAlthough it was not a Conservative paper, the Breakfast Table supported Melmotte because of his commercial position and understanding. Few men had so acute an insight into the great commercial questions of the age as Mr. Augustus Melmotte. No matter what his origin, it would be for the country's good that such a man should sit in the British Parliament. This was the opinion of the Breakfast Table.\nThere was one man who thoroughly believed that the thing most necessary for England's glory was the return of Mr. Melmotte for Westminster. This man was undoubtedly a very ignorant man. He knew nothing of any of the political questions which had vexed England for the last half century, or of the country's political history, or of the working of Parliament. Yet he was fully confident that England ought to demand that Mr. Melmotte should be returned for Westminster. This man was Mr. Melmotte himself.\nAt this point Mr. Melmotte certainly lost his head. He had enough boldness for the very dangerous game which he was playing; but, as crisis heaped itself upon crisis, he lacked prudence. He spoke of those who opposed him as little malignant beings, and went about in his open carriage with a disdainful air. He scolded Earls and snubbed Dukes, and yet did it in a manner which showed how proud he was of connecting himself with their pre-eminence. The more arrogant he became the more vulgar he was.\nThe result was damaging. \"Couldn't Lord Alfred say a word to him?\" said the Honourable Beauchamp Beauclerk, who, himself in Parliament, had been moving heaven and earth on behalf of the great financial king.\n\"Alfred's more than half afraid of him,\" said Lionel Lupton, a young aristocrat, also in Parliament.\n\"Something really must be done, Mr. Beauclerk,\" said Mr. Jones, who led a very wealthy firm of builders in the borough. \"He is making a great many personal enemies.\"\n\"He's the finest old turkey cock out,\" said Lionel Lupton.\nIt was decided that Mr. Beauclerk should speak a word to Lord Alfred.\n\"Alfred,\" said he at the club one afternoon, \"I wonder whether you couldn't say something to Melmotte about his manner.\" Lord Alfred turned sharply round and looked into his companion's face. \"They tell me he is giving offence. Couldn't he draw it a little milder?\"\nLord Alfred made his reply almost in a whisper. \"If you ask me, I don't think he could.\"\n\"You couldn't speak to him, then?\"\n\"Not unless I did it with a horsewhip.\"\nLord Alfred had been much afflicted that morning. He had spent some hours with Melmotte, going about the borough in the open carriage, and standing just behind him at meetings - and had been nauseated with him. He found his position to be almost insupportable. When he was told to \"just open the door,\" and \"just give that message,\" he meditated revenge. Mr. Beauclerk whistled and withdrew.\nThe Emperor of China was now in England, and was to be entertained at the India Office on Saturday the 6th of July, and Melmotte's dinner was to take place on the following Monday. The London world was very keen to obtain admission to the India Office, begging for tickets allocated to the under secretaries, assistant secretaries, chief clerks, and head-messengers and their wives.\nNow Mr. Melmotte with his family was, of course, supplied with tickets. He had already seen the Emperor at a breakfast in Windsor Park, and at a ball in royal halls. But he had not been presented to the Emperor. He had felt himself to be ill-used, and was offended. He spoke with bitterness of the Royal Family, because he had not been brought to the front rank - and now, at the India Office, was determined to have his due. But he was not on the list of those who would be presented to the Brother of the Sun.\nAt this period of his career he had taken to dining freely, which was imprudent, as he needed his best intelligence. Wine did not often make him tipsy; but it made him tower in his arrogance till he was almost sure to totter. He went with his wife and daughter and Lord Alfred to the event at the India Office, with some foolish idea that as the India Office was in Westminster, he had a right to demand an introduction because of his candidature. He did succeed in getting hold of an unfortunate under secretary of state, a studious and invaluable young peer, known as Earl De Griffin. He was a shy man, who worked hard night and day, and was second in command at the India Office.\n\"My Lord,\" said Melmotte loudly, \"I desire to be presented to his Imperial Majesty.\" Lord De Griffin looked at him in despair, not knowing the great man.\n\"This is Mr. Melmotte,\" said Lord Alfred.\n\"Oh,\" said Lord De Griffin. \"I am delighted; ah, yes,\" and he made a weak and ineffectual attempt to escape.\nMelmotte stood in his way, and repeated his demand.\n\"I'm afraid it's all arranged.\" said Lord De Griffin. \"I don't know anything about it myself. I'm very sorry.\"\n\"I'm not going to stand this kind of thing,\" said Melmotte. The old Marquis of Auld Reekie was close at hand, Lord Nidderdale's father; and he poked his thumb into Lord Alfred's ribs. \"It is generally understood, I believe,\" continued Melmotte, \"that the Emperor is to dine at my house on Monday. He don't dine there unless I'm made acquainted with him before he comes. I mean what I say. I ain't going to entertain even an Emperor unless I'm good enough to be presented to him.\"\n\"Here's a row,\" said the old Marquis.\n\"He has taken a little wine,\" whispered Lord Alfred. \"Melmotte,\" he said, still whispering; \"upon my word it isn't the thing. They're only Indian chaps and Eastern swells who are presented here.\"\n\"Then they should have done it at Windsor,\" said Melmotte. \"By George, Alfred! I'm in earnest, and somebody had better look to it. If I'm not presented to his Imperial Majesty tonight, by G__, there shall be no dinner in Grosvenor Square on Monday.\"\nLord De Griffin was frightened, and Lord Alfred felt that something ought to be done. It might have been wise to have allowed Melmotte to return home with the resolution that his dinner should be abandoned; he would probably have repented before the next morning. But Lord De Griffin went to the Secretary of State, Mr. Wilson, and explained the issue.\n\"Bring him up,\" said Mr. Wilson. \"He's going to do something out in the East, isn't he?\"\nLord de Griffin returned to Melmotte, and whispered, \"If you will come with me, it shall be managed. It isn't just the thing, but as you wish it, it shall be done.\"\n\"I do wish it,\" said Melmotte aloud. He was one of those men for whom success always demanded some hoarse note of triumph from his own trumpet.\nAnd so the thing was done. Melmotte, as he was taken up to the imperial footstool, was resolved upon making a little speech; but the awful, silent solemnity of the celestial one quelled even him, and he shuffled by without saying a word.\nBut he had gained his point, and afterwards became intolerable. Lord Alfred tried to escape after putting Madame Melmotte and her daughter into the carriage, but Melmotte insisted: \"Come with me, Alfred; there are two or three things I must settle before I go to bed.\"\n\"I'm about knocked up,\" said the unfortunate man.\n\"Nonsense!\" Melmotte put his hand on Lord Alfred's shoulder, and the poor fellow was beaten. Walking about Mr. Longstaffe's back room with a brandy and a cigar, Melmotte again sounded his own trumpet.\n\"I mean to let the fellows know what's what,\" he said. \"They won't find many people to spend ten thousand pounds in entertaining a guest of the country. I don't know of any other man of business who could do it. But I intend to be respected. The Prince treated me very scurvily, Alfred, and I shall take an opportunity of telling him so on Monday. I suppose a man may speak to his own guests.\"\n\"You might turn the election against you if you said anything the Prince didn't like,\" said Lord Alfred.\n\"D___ the election, sir. I stand before the electors of Westminster as a man of business, not as one of the Prince's toadies. I can tell you that I think myself quite as great a man as any Prince. I'll teach them a lesson before long. Didn't I teach 'em a lesson tonight, eh? Didn't I make 'em do as I chose?\"\nThis went on through the whole of a cigar; and afterwards, as Lord Alfred slowly walked back to his lodgings, he thought deeply whether there might not be a means of escaping from his servitude.\n\"Beast! Brute! Pig!\" he said to himself over and over again as he returned to Mount Street.",
        "paragraph_chars": [
            [
                0,
                476
            ],
            [
                476,
                998
            ],
            [
                998,
                1590
            ],
            [
                1590,
                2097
            ],
            [
                2097,
                2498
            ],
            [
                2498,
                3002
            ],
            [
                3002,
                3502
            ],
            [
                3502,
                3710
            ],
            [
                3710,
                3811
            ],
            [
                3811,
                3977
            ],
            [
                3977,
                4036
            ],
            [
                4036,
                4106
            ],
            [
                4106,
                4372
            ],
            [
                4372,
                4461
            ],
            [
                4461,
                4496
            ],
            [
                4496,
                4536
            ],
            [
                4536,
                4928
            ],
            [
                4928,
                5311
            ],
            [
                5311,
                5823
            ],
            [
                5823,
                6506
            ],
            [
                6506,
                6660
            ],
            [
                6660,
                6702
            ],
            [
                6702,
                6811
            ],
            [
                6811,
                6863
            ],
            [
                6863,
                6974
            ],
            [
                6974,
                7454
            ],
            [
                7454,
                7492
            ],
            [
                7492,
                7688
            ],
            [
                7688,
                7938
            ],
            [
                7938,
                8291
            ],
            [
                8291,
                8380
            ],
            [
                8380,
                8545
            ],
            [
                8545,
                8689
            ],
            [
                8689,
                8927
            ],
            [
                8927,
                9196
            ],
            [
                9196,
                9246
            ],
            [
                9246,
                9447
            ],
            [
                9447,
                9841
            ],
            [
                9841,
                9946
            ],
            [
                9946,
                10256
            ],
            [
                10256,
                10451
            ],
            [
                10451,
                10542
            ]
        ],
        "segment_chars": [
            [
                0,
                172
            ],
            [
                172,
                290
            ],
            [
                290,
                476
            ],
            [
                476,
                777
            ],
            [
                777,
                901
            ],
            [
                901,
                998
            ],
            [
                998,
                1124
            ],
            [
                1124,
                1186
            ],
            [
                1186,
                1379
            ],
            [
                1379,
                1515
            ],
            [
                1515,
                1590
            ],
            [
                1590,
                1690
            ],
            [
                1690,
                1730
            ],
            [
                1730,
                1830
            ],
            [
                1830,
                1924
            ],
            [
                1924,
                2097
            ],
            [
                2097,
                2232
            ],
            [
                2232,
                2337
            ],
            [
                2337,
                2453
            ],
            [
                2453,
                2498
            ],
            [
                2498,
                2638
            ],
            [
                2638,
                2684
            ],
            [
                2684,
                2857
            ],
            [
                2857,
                2967
            ],
            [
                2967,
                3002
            ],
            [
                3002,
                3054
            ],
            [
                3054,
                3189
            ],
            [
                3189,
                3310
            ],
            [
                3310,
                3450
            ],
            [
                3450,
                3502
            ],
            [
                3502,
                3527
            ],
            [
                3527,
                3569
            ],
            [
                3569,
                3710
            ],
            [
                3710,
                3811
            ],
            [
                3811,
                3931
            ],
            [
                3931,
                3977
            ],
            [
                3977,
                4036
            ],
            [
                4036,
                4106
            ],
            [
                4106,
                4227
            ],
            [
                4227,
                4298
            ],
            [
                4298,
                4334
            ],
            [
                4334,
                4372
            ],
            [
                4372,
                4420
            ],
            [
                4420,
                4461
            ],
            [
                4461,
                4496
            ],
            [
                4496,
                4536
            ],
            [
                4536,
                4586
            ],
            [
                4586,
                4747
            ],
            [
                4747,
                4797
            ],
            [
                4797,
                4891
            ],
            [
                4891,
                4928
            ],
            [
                4928,
                5109
            ],
            [
                5109,
                5311
            ],
            [
                5311,
                5383
            ],
            [
                5383,
                5477
            ],
            [
                5477,
                5523
            ],
            [
                5523,
                5577
            ],
            [
                5577,
                5737
            ],
            [
                5737,
                5823
            ],
            [
                5823,
                5940
            ],
            [
                5940,
                6049
            ],
            [
                6049,
                6271
            ],
            [
                6271,
                6410
            ],
            [
                6410,
                6506
            ],
            [
                6506,
                6591
            ],
            [
                6591,
                6660
            ],
            [
                6660,
                6702
            ],
            [
                6702,
                6730
            ],
            [
                6730,
                6811
            ],
            [
                6811,
                6863
            ],
            [
                6863,
                6895
            ],
            [
                6895,
                6917
            ],
            [
                6917,
                6957
            ],
            [
                6957,
                6974
            ],
            [
                6974,
                7034
            ],
            [
                7034,
                7158
            ],
            [
                7158,
                7271
            ],
            [
                7271,
                7344
            ],
            [
                7344,
                7363
            ],
            [
                7363,
                7454
            ],
            [
                7454,
                7492
            ],
            [
                7492,
                7545
            ],
            [
                7545,
                7618
            ],
            [
                7618,
                7688
            ],
            [
                7688,
                7747
            ],
            [
                7747,
                7767
            ],
            [
                7767,
                7819
            ],
            [
                7819,
                7938
            ],
            [
                7938,
                8024
            ],
            [
                8024,
                8202
            ],
            [
                8202,
                8291
            ],
            [
                8291,
                8324
            ],
            [
                8324,
                8380
            ],
            [
                8380,
                8481
            ],
            [
                8481,
                8545
            ],
            [
                8545,
                8582
            ],
            [
                8582,
                8689
            ],
            [
                8689,
                8716
            ],
            [
                8716,
                8927
            ],
            [
                8927,
                8991
            ],
            [
                8991,
                9196
            ],
            [
                9196,
                9246
            ],
            [
                9246,
                9258
            ],
            [
                9258,
                9339
            ],
            [
                9339,
                9447
            ],
            [
                9447,
                9502
            ],
            [
                9502,
                9600
            ],
            [
                9600,
                9659
            ],
            [
                9659,
                9689
            ],
            [
                9689,
                9795
            ],
            [
                9795,
                9841
            ],
            [
                9841,
                9946
            ],
            [
                9946,
                9971
            ],
            [
                9971,
                10072
            ],
            [
                10072,
                10143
            ],
            [
                10143,
                10181
            ],
            [
                10181,
                10222
            ],
            [
                10222,
                10256
            ],
            [
                10256,
                10451
            ],
            [
                10451,
                10459
            ],
            [
                10459,
                10466
            ],
            [
                10466,
                10472
            ],
            [
                10472,
                10542
            ]
        ],
        "overlap_chars": [
            [
                0,
                87
            ],
            [
                94,
                111
            ],
            [
                111,
                172
            ],
            [
                172,
                210
            ],
            [
                222,
                233
            ],
            [
                238,
                239
            ],
            [
                247,
                250
            ],
            [
                251,
                258
            ],
            [
                266,
                267
            ],
            [
                268,
                290
            ],
            [
                290,
                362
            ],
            [
                363,
                386
            ],
            [
                391,
                412
            ],
            [
                413,
                476
            ],
            [
                476,
                483
            ],
            [
                484,
                513
            ],
            [
                521,
                533
            ],
            [
                533,
                543
            ],
            [
                549,
                557
            ],
            [
                558,
                565
            ],
            [
                570,
                616
            ],
            [
                620,
                640
            ],
            [
                643,
                690
            ],
            [
                698,
                704
            ],
            [
                707,
                777
            ],
            [
                777,
                780
            ],
            [
                781,
                800
            ],
            [
                801,
                901
            ],
            [
                901,
                951
            ],
            [
                951,
                956
            ],
            [
                957,
                959
            ],
            [
                960,
                996
            ],
            [
                996,
                998
            ],
            [
                998,
                1048
            ],
            [
                1049,
                1113
            ],
            [
                1122,
                1124
            ],
            [
                1124,
                1127
            ],
            [
                1135,
                1138
            ],
            [
                1139,
                1161
            ],
            [
                1162,
                1164
            ],
            [
                1178,
                1186
            ],
            [
                1186,
                1293
            ],
            [
                1294,
                1311
            ],
            [
                1312,
                1318
            ],
            [
                1324,
                1379
            ],
            [
                1379,
                1386
            ],
            [
                1395,
                1401
            ],
            [
                1403,
                1405
            ],
            [
                1416,
                1420
            ],
            [
                1420,
                1425
            ],
            [
                1431,
                1435
            ],
            [
                1436,
                1439
            ],
            [
                1440,
                1447
            ],
            [
                1468,
                1485
            ],
            [
                1486,
                1488
            ],
            [
                1507,
                1515
            ],
            [
                1519,
                1522
            ],
            [
                1523,
                1527
            ],
            [
                1528,
                1535
            ],
            [
                1536,
                1545
            ],
            [
                1546,
                1558
            ],
            [
                1559,
                1562
            ],
            [
                1563,
                1564
            ],
            [
                1565,
                1576
            ],
            [
                1582,
                1588
            ],
            [
                1588,
                1589
            ],
            [
                1590,
                1623
            ],
            [
                1623,
                1629
            ],
            [
                1630,
                1665
            ],
            [
                1688,
                1690
            ],
            [
                1690,
                1707
            ],
            [
                1708,
                1716
            ],
            [
                1728,
                1730
            ],
            [
                1730,
                1811
            ],
            [
                1828,
                1830
            ],
            [
                1830,
                1869
            ],
            [
                1870,
                1876
            ],
            [
                1877,
                1878
            ],
            [
                1879,
                1903
            ],
            [
                1904,
                1908
            ],
            [
                1922,
                1924
            ],
            [
                1924,
                1927
            ],
            [
                1946,
                1950
            ],
            [
                1955,
                1956
            ],
            [
                1962,
                1989
            ],
            [
                1989,
                1990
            ],
            [
                1991,
                2016
            ],
            [
                2017,
                2097
            ],
            [
                2109,
                2131
            ],
            [
                2132,
                2137
            ],
            [
                2137,
                2138
            ],
            [
                2139,
                2142
            ],
            [
                2153,
                2158
            ],
            [
                2159,
                2177
            ],
            [
                2189,
                2212
            ],
            [
                2230,
                2232
            ],
            [
                2232,
                2239
            ],
            [
                2240,
                2337
            ],
            [
                2352,
                2355
            ],
            [
                2362,
                2363
            ],
            [
                2364,
                2383
            ],
            [
                2384,
                2391
            ],
            [
                2399,
                2453
            ],
            [
                2462,
                2465
            ],
            [
                2477,
                2480
            ],
            [
                2491,
                2496
            ],
            [
                2496,
                2497
            ],
            [
                2498,
                2554
            ],
            [
                2555,
                2559
            ],
            [
                2560,
                2569
            ],
            [
                2574,
                2638
            ],
            [
                2638,
                2684
            ],
            [
                2684,
                2706
            ],
            [
                2707,
                2723
            ],
            [
                2734,
                2784
            ],
            [
                2788,
                2790
            ],
            [
                2791,
                2794
            ],
            [
                2802,
                2804
            ],
            [
                2805,
                2814
            ],
            [
                2815,
                2822
            ],
            [
                2822,
                2823
            ],
            [
                2827,
                2855
            ],
            [
                2855,
                2857
            ],
            [
                2857,
                2896
            ],
            [
                2897,
                2967
            ],
            [
                2967,
                3002
            ],
            [
                3005,
                3009
            ],
            [
                3016,
                3054
            ],
            [
                3054,
                3060
            ],
            [
                3077,
                3171
            ],
            [
                3179,
                3189
            ],
            [
                3189,
                3191
            ],
            [
                3198,
                3249
            ],
            [
                3249,
                3254
            ],
            [
                3255,
                3286
            ],
            [
                3287,
                3293
            ],
            [
                3308,
                3310
            ],
            [
                3310,
                3435
            ],
            [
                3436,
                3448
            ],
            [
                3448,
                3450
            ],
            [
                3450,
                3500
            ],
            [
                3500,
                3501
            ],
            [
                3502,
                3505
            ],
            [
                3506,
                3512
            ],
            [
                3513,
                3516
            ],
            [
                3525,
                3527
            ],
            [
                3527,
                3569
            ],
            [
                3569,
                3637
            ],
            [
                3638,
                3708
            ],
            [
                3708,
                3710
            ],
            [
                3710,
                3809
            ],
            [
                3809,
                3811
            ],
            [
                3811,
                3878
            ],
            [
                3883,
                3929
            ],
            [
                3929,
                3931
            ],
            [
                3931,
                3977
            ],
            [
                3977,
                4036
            ],
            [
                4036,
                4105
            ],
            [
                4106,
                4120
            ],
            [
                4124,
                4227
            ],
            [
                4227,
                4245
            ],
            [
                4254,
                4298
            ],
            [
                4298,
                4334
            ],
            [
                4334,
                4372
            ],
            [
                4372,
                4420
            ],
            [
                4420,
                4458
            ],
            [
                4461,
                4496
            ],
            [
                4496,
                4536
            ],
            [
                4536,
                4586
            ],
            [
                4586,
                4614
            ],
            [
                4615,
                4623
            ],
            [
                4623,
                4624
            ],
            [
                4625,
                4670
            ],
            [
                4675,
                4711
            ],
            [
                4712,
                4713
            ],
            [
                4714,
                4741
            ],
            [
                4742,
                4745
            ],
            [
                4745,
                4747
            ],
            [
                4747,
                4749
            ],
            [
                4750,
                4755
            ],
            [
                4756,
                4759
            ],
            [
                4760,
                4768
            ],
            [
                4769,
                4797
            ],
            [
                4797,
                4808
            ],
            [
                4809,
                4813
            ],
            [
                4814,
                4816
            ],
            [
                4817,
                4822
            ],
            [
                4823,
                4848
            ],
            [
                4849,
                4871
            ],
            [
                4872,
                4891
            ],
            [
                4891,
                4904
            ],
            [
                4905,
                4927
            ],
            [
                4928,
                4994
            ],
            [
                4995,
                5014
            ],
            [
                5015,
                5109
            ],
            [
                5109,
                5125
            ],
            [
                5126,
                5129
            ],
            [
                5130,
                5134
            ],
            [
                5140,
                5180
            ],
            [
                5181,
                5200
            ],
            [
                5211,
                5213
            ],
            [
                5214,
                5236
            ],
            [
                5237,
                5258
            ],
            [
                5258,
                5277
            ],
            [
                5278,
                5310
            ],
            [
                5311,
                5383
            ],
            [
                5386,
                5477
            ],
            [
                5477,
                5480
            ],
            [
                5481,
                5523
            ],
            [
                5523,
                5557
            ],
            [
                5559,
                5577
            ],
            [
                5577,
                5601
            ],
            [
                5602,
                5621
            ],
            [
                5621,
                5672
            ],
            [
                5675,
                5737
            ],
            [
                5737,
                5772
            ],
            [
                5796,
                5823
            ],
            [
                5823,
                5882
            ],
            [
                5883,
                5892
            ],
            [
                5893,
                5909
            ],
            [
                5917,
                5940
            ],
            [
                5940,
                5958
            ],
            [
                5968,
                5973
            ],
            [
                5975,
                5990
            ],
            [
                5991,
                6049
            ],
            [
                6052,
                6083
            ],
            [
                6084,
                6087
            ],
            [
                6088,
                6102
            ],
            [
                6103,
                6106
            ],
            [
                6116,
                6133
            ],
            [
                6134,
                6138
            ],
            [
                6139,
                6210
            ],
            [
                6211,
                6242
            ],
            [
                6243,
                6271
            ],
            [
                6271,
                6410
            ],
            [
                6410,
                6427
            ],
            [
                6428,
                6431
            ],
            [
                6432,
                6462
            ],
            [
                6463,
                6466
            ],
            [
                6467,
                6504
            ],
            [
                6504,
                6505
            ],
            [
                6506,
                6521
            ],
            [
                6537,
                6541
            ],
            [
                6555,
                6591
            ],
            [
                6591,
                6658
            ],
            [
                6658,
                6660
            ],
            [
                6660,
                6700
            ],
            [
                6700,
                6701
            ],
            [
                6702,
                6703
            ],
            [
                6703,
                6728
            ],
            [
                6728,
                6730
            ],
            [
                6730,
                6746
            ],
            [
                6747,
                6760
            ],
            [
                6761,
                6779
            ],
            [
                6780,
                6811
            ],
            [
                6811,
                6825
            ],
            [
                6826,
                6841
            ],
            [
                6842,
                6862
            ],
            [
                6863,
                6892
            ],
            [
                6895,
                6916
            ],
            [
                6918,
                6955
            ],
            [
                6957,
                6971
            ],
            [
                6974,
                7018
            ],
            [
                7019,
                7023
            ],
            [
                7032,
                7034
            ],
            [
                7034,
                7083
            ],
            [
                7084,
                7099
            ],
            [
                7099,
                7101
            ],
            [
                7102,
                7108
            ],
            [
                7110,
                7132
            ],
            [
                7133,
                7158
            ],
            [
                7158,
                7242
            ],
            [
                7248,
                7253
            ],
            [
                7254,
                7271
            ],
            [
                7271,
                7344
            ],
            [
                7344,
                7363
            ],
            [
                7363,
                7451
            ],
            [
                7454,
                7491
            ],
            [
                7492,
                7545
            ],
            [
                7545,
                7618
            ],
            [
                7618,
                7685
            ],
            [
                7685,
                7688
            ],
            [
                7688,
                7729
            ],
            [
                7729,
                7745
            ],
            [
                7745,
                7747
            ],
            [
                7747,
                7767
            ],
            [
                7767,
                7819
            ],
            [
                7819,
                7863
            ],
            [
                7871,
                7877
            ],
            [
                7879,
                7935
            ],
            [
                7938,
                8024
            ],
            [
                8024,
                8026
            ],
            [
                8027,
                8063
            ],
            [
                8073,
                8143
            ],
            [
                8143,
                8144
            ],
            [
                8145,
                8153
            ],
            [
                8154,
                8162
            ],
            [
                8163,
                8176
            ],
            [
                8177,
                8200
            ],
            [
                8200,
                8202
            ],
            [
                8202,
                8221
            ],
            [
                8227,
                8233
            ],
            [
                8244,
                8246
            ],
            [
                8254,
                8279
            ],
            [
                8280,
                8283
            ],
            [
                8289,
                8290
            ],
            [
                8291,
                8324
            ],
            [
                8324,
                8379
            ],
            [
                8380,
                8395
            ],
            [
                8396,
                8404
            ],
            [
                8405,
                8407
            ],
            [
                8408,
                8416
            ],
            [
                8416,
                8421
            ],
            [
                8422,
                8431
            ],
            [
                8431,
                8432
            ],
            [
                8433,
                8458
            ],
            [
                8458,
                8459
            ],
            [
                8460,
                8481
            ],
            [
                8481,
                8545
            ],
            [
                8545,
                8582
            ],
            [
                8582,
                8605
            ],
            [
                8610,
                8622
            ],
            [
                8623,
                8689
            ],
            [
                8689,
                8716
            ],
            [
                8716,
                8812
            ],
            [
                8812,
                8828
            ],
            [
                8836,
                8925
            ],
            [
                8925,
                8927
            ],
            [
                8927,
                8959
            ],
            [
                8978,
                8991
            ],
            [
                8991,
                9106
            ],
            [
                9108,
                9109
            ],
            [
                9109,
                9113
            ],
            [
                9121,
                9130
            ],
            [
                9131,
                9196
            ],
            [
                9196,
                9246
            ],
            [
                9246,
                9247
            ],
            [
                9258,
                9266
            ],
            [
                9267,
                9339
            ],
            [
                9353,
                9356
            ],
            [
                9363,
                9369
            ],
            [
                9370,
                9379
            ],
            [
                9380,
                9386
            ],
            [
                9387,
                9397
            ],
            [
                9398,
                9399
            ],
            [
                9405,
                9406
            ],
            [
                9422,
                9429
            ],
            [
                9434,
                9437
            ],
            [
                9438,
                9445
            ],
            [
                9445,
                9446
            ],
            [
                9447,
                9492
            ],
            [
                9496,
                9500
            ],
            [
                9500,
                9502
            ],
            [
                9503,
                9598
            ],
            [
                9598,
                9600
            ],
            [
                9600,
                9657
            ],
            [
                9657,
                9659
            ],
            [
                9659,
                9662
            ],
            [
                9663,
                9677
            ],
            [
                9687,
                9689
            ],
            [
                9689,
                9795
            ],
            [
                9795,
                9814
            ],
            [
                9815,
                9841
            ],
            [
                9841,
                9925
            ],
            [
                9946,
                9948
            ],
            [
                9952,
                9971
            ],
            [
                9971,
                10042
            ],
            [
                10043,
                10072
            ],
            [
                10072,
                10141
            ],
            [
                10143,
                10181
            ],
            [
                10181,
                10208
            ],
            [
                10216,
                10217
            ],
            [
                10218,
                10222
            ],
            [
                10222,
                10253
            ],
            [
                10256,
                10291
            ],
            [
                10292,
                10336
            ],
            [
                10344,
                10364
            ],
            [
                10364,
                10410
            ],
            [
                10413,
                10439
            ],
            [
                10440,
                10450
            ],
            [
                10451,
                10459
            ],
            [
                10459,
                10466
            ],
            [
                10466,
                10472
            ],
            [
                10472,
                10516
            ],
            [
                10526,
                10542
            ]
        ],
        "row_chars": [
            [
                0,
                172
            ],
            [
                172,
                172
            ],
            [
                172,
                172
            ],
            [
                172,
                290
            ],
            [
                290,
                476
            ],
            [
                476,
                476
            ],
            [
                476,
                476
            ],
            [
                476,
                476
            ],
            [
                476,
                777
            ],
            [
                777,
                901
            ],
            [
                901,
                998
            ],
            [
                998,
                1124
            ],
            [
                1124,
                1186
            ],
            [
                1186,
                1379
            ],
            [
                1379,
                1379
            ],
            [
                1379,
                1515
            ],
            [
                1515,
                1590
            ],
            [
                1590,
                1690
            ],
            [
                1690,
                1730
            ],
            [
                1730,
                1830
            ],
            [
                1830,
                1924
            ],
            [
                1924,
                2097
            ],
            [
                2097,
                2097
            ],
            [
                2097,
                2232
            ],
            [
                2232,
                2337
            ],
            [
                2337,
                2453
            ],
            [
                2453,
                2498
            ],
            [
                2498,
                2498
            ],
            [
                2498,
                2498
            ],
            [
                2498,
                2498
            ],
            [
                2498,
                2638
            ],
            [
                2638,
                2684
            ],
            [
                2684,
                2857
            ],
            [
                2857,
                2857
            ],
            [
                2857,
                2967
            ],
            [
                2967,
                3002
            ],
            [
                3002,
                3054
            ],
            [
                3054,
                3189
            ],
            [
                3189,
                3310
            ],
            [
                3310,
                3310
            ],
            [
                3310,
                3450
            ],
            [
                3450,
                3502
            ],
            [
                3502,
                3502
            ],
            [
                3502,
                3502
            ],
            [
                3502,
                3502
            ],
            [
                3502,
                3502
            ],
            [
                3502,
                3527
            ],
            [
                3527,
                3569
            ],
            [
                3569,
                3710
            ],
            [
                3710,
                3811
            ],
            [
                3811,
                3931
            ],
            [
                3931,
                3977
            ],
            [
                3977,
                4036
            ],
            [
                4036,
                4106
            ],
            [
                4106,
                4106
            ],
            [
                4106,
                4227
            ],
            [
                4227,
                4298
            ],
            [
                4298,
                4334
            ],
            [
                4334,
                4334
            ],
            [
                4334,
                4372
            ],
            [
                4372,
                4420
            ],
            [
                4420,
                4461
            ],
            [
                4461,
                4461
            ],
            [
                4461,
                4461
            ],
            [
                4461,
                4496
            ],
            [
                4496,
                4536
            ],
            [
                4536,
                4536
            ],
            [
                4536,
                4586
            ],
            [
                4586,
                4747
            ],
            [
                4747,
                4747
            ],
            [
                4747,
                4797
            ],
            [
                4797,
                4891
            ],
            [
                4891,
                4891
            ],
            [
                4891,
                4928
            ],
            [
                4928,
                4928
            ],
            [
                4928,
                4928
            ],
            [
                4928,
                5109
            ],
            [
                5109,
                5311
            ],
            [
                5311,
                5311
            ],
            [
                5311,
                5383
            ],
            [
                5383,
                5383
            ],
            [
                5383,
                5477
            ],
            [
                5477,
                5523
            ],
            [
                5523,
                5523
            ],
            [
                5523,
                5577
            ],
            [
                5577,
                5737
            ],
            [
                5737,
                5823
            ],
            [
                5823,
                5823
            ],
            [
                5823,
                5940
            ],
            [
                5940,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6271
            ],
            [
                6271,
                6410
            ],
            [
                6410,
                6506
            ],
            [
                6506,
                6591
            ],
            [
                6591,
                6660
            ],
            [
                6660,
                6702
            ],
            [
                6702,
                6702
            ],
            [
                6702,
                6730
            ],
            [
                6730,
                6811
            ],
            [
                6811,
                6863
            ],
            [
                6863,
                6863
            ],
            [
                6863,
                6863
            ],
            [
                6863,
                6863
            ],
            [
                6863,
                6917
            ],
            [
                6917,
                6957
            ],
            [
                6957,
                6957
            ],
            [
                6957,
                6957
            ],
            [
                6957,
                6957
            ],
            [
                6957,
                6974
            ],
            [
                6974,
                6974
            ],
            [
                6974,
                6974
            ],
            [
                6974,
                6974
            ],
            [
                6974,
                7034
            ],
            [
                7034,
                7158
            ],
            [
                7158,
                7271
            ],
            [
                7271,
                7344
            ],
            [
                7344,
                7363
            ],
            [
                7363,
                7454
            ],
            [
                7454,
                7454
            ],
            [
                7454,
                7492
            ],
            [
                7492,
                7492
            ],
            [
                7492,
                7545
            ],
            [
                7545,
                7618
            ],
            [
                7618,
                7688
            ],
            [
                7688,
                7747
            ],
            [
                7747,
                7767
            ],
            [
                7767,
                7819
            ],
            [
                7819,
                7938
            ],
            [
                7938,
                7938
            ],
            [
                7938,
                7938
            ],
            [
                7938,
                8024
            ],
            [
                8024,
                8024
            ],
            [
                8024,
                8202
            ],
            [
                8202,
                8202
            ],
            [
                8202,
                8291
            ],
            [
                8291,
                8291
            ],
            [
                8291,
                8324
            ],
            [
                8324,
                8380
            ],
            [
                8380,
                8380
            ],
            [
                8380,
                8380
            ],
            [
                8380,
                8481
            ],
            [
                8481,
                8545
            ],
            [
                8545,
                8582
            ],
            [
                8582,
                8689
            ],
            [
                8689,
                8689
            ],
            [
                8689,
                8716
            ],
            [
                8716,
                8927
            ],
            [
                8927,
                8991
            ],
            [
                8991,
                9196
            ],
            [
                9196,
                9246
            ],
            [
                9246,
                9258
            ],
            [
                9258,
                9258
            ],
            [
                9258,
                9258
            ],
            [
                9258,
                9258
            ],
            [
                9258,
                9339
            ],
            [
                9339,
                9447
            ],
            [
                9447,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9600
            ],
            [
                9600,
                9659
            ],
            [
                9659,
                9659
            ],
            [
                9659,
                9659
            ],
            [
                9659,
                9689
            ],
            [
                9689,
                9795
            ],
            [
                9795,
                9841
            ],
            [
                9841,
                9946
            ],
            [
                9946,
                9971
            ],
            [
                9971,
                10072
            ],
            [
                10072,
                10143
            ],
            [
                10143,
                10143
            ],
            [
                10143,
                10181
            ],
            [
                10181,
                10222
            ],
            [
                10222,
                10222
            ],
            [
                10222,
                10222
            ],
            [
                10222,
                10222
            ],
            [
                10222,
                10256
            ],
            [
                10256,
                10256
            ],
            [
                10256,
                10451
            ],
            [
                10451,
                10459
            ],
            [
                10459,
                10466
            ],
            [
                10466,
                10472
            ],
            [
                10472,
                10542
            ]
        ]
    }
}