{
    "original": {
        "text": "It was considered to be a great thing to catch the Roman Catholic vote in Westminster. For many years it has been considered a great thing both in the House and out of the House to \"catch\" Roman Catholic votes. There are two modes of catching these votes. This or that individual Roman Catholic may be promoted to place, so that he personally may be made secure; or the right hand of fellowship may be extended to the people of the Pope generally, so that the people of the Pope may be taught to think that a general step is being made towards the reconversion of the nation. The first measure is the easier, but the effect is but slight and soon passes away. The promoted one, though as far as his prayers go he may remain as good a Catholic as ever, soon ceases to be one of the party to be conciliated, and is apt after a while to be regarded by them as an enemy. But the other mode, if a step be well taken, may be very efficacious. It has now and then occurred that every Roman Catholic in Ireland and England has been brought to believe that the nation is coming round to them;--and in this or that borough the same conviction has been made to grow. To catch the Protestant,--that is the peculiarly Protestant,--vote and the Roman Catholic vote at the same instant is a feat difficult of accomplishment; but it has been attempted before, and was attempted now by Mr. Melmotte and his friends. It was perhaps thought by his friends that the Protestants would not notice the 100 given for the altar to St. Fabricius; but Mr. Alf was wide awake, and took care that Mr. Melmotte's religious opinions should be a matter of interest to the world at large. During all that period of newspaper excitement there was perhaps no article that created so much general interest as that which appeared in the \"Evening Pulpit,\" with a special question asked at the head of it, \"For Priest or Parson?\" In this article, which was more than usually delightful as being pungent from the beginning to the end and as being unalloyed with any dry didactic wisdom, Mr. Alf's man, who did that business, declared that it was really important that the nation at large and especially the electors of Westminster should know what was the nature of Mr. Melmotte's faith. That he was a man of a highly religious temperament was most certain by his munificent charities on behalf of religion. Two noble donations, which by chance had been made just at this crisis, were doubtless no more than the regular continuation of his ordinary flow of Christian benevolence. The \"Evening Pulpit\" by no means insinuated that the gifts were intended to have any reference to the approaching election. Far be it from the \"Evening Pulpit\" to imagine that so great a man as Mr. Melmotte looked for any return in this world from his charitable generosity. But still, as Protestants naturally desired to be represented in Parliament by a Protestant member, and as Roman Catholics as naturally desired to be represented by a Roman Catholic, perhaps Mr. Melmotte would not object to declare his creed.\nThis was biting, and of course did mischief; but Mr. Melmotte and his manager were not foolish enough to allow it to actuate them in any way. He had thrown his bread upon the waters, assisting St. Fabricius with one hand and the Protestant curates with the other, and must leave the results to take care of themselves. If the Protestants chose to believe that he was hyper-protestant, and the Catholics that he was tending towards papacy, so much the better for him. Any enthusiastic religionists wishing to enjoy such conviction's would not allow themselves to be enlightened by the manifestly interested malignity of Mr. Alf's newspaper.\nIt may be doubted whether the donation to the Curates' Aid Society did have much effect. It may perhaps have induced a resolution in some few to go to the poll whose minds were active in regard to religion and torpid as to politics. But the donation to St. Fabricius certainly had results. It was taken up and made much of by the Roman Catholic party generally, till a report got itself spread abroad and almost believed that Mr. Melmotte was going to join the Church of Rome. These manoeuvres require most delicate handling, or evil may follow instead of good. On the second afternoon after the question had been asked in the \"Evening Pulpit,\" an answer to it appeared, \"For Priest and not for Parson.\" Therein various assertions made by Roman Catholic organs and repeated in Roman Catholic speeches were brought together, so as to show that Mr. Melmotte really had at last made up his mind on this important question. All the world knew now, said Mr. Alf's writer, that with that keen sense of honesty which was the Great Financier's peculiar characteristic,--the Great Financier was the name which Mr. Alf had specially invented for Mr. Melmotte,--he had doubted, till the truth was absolutely borne in upon him, whether he could serve the nation best as a Liberal or as a Conservative. He had solved that doubt with wisdom. And now this other doubt had passed through the crucible, and by the aid of fire a golden certainty had been produced. The world of Westminster at last knew that Mr. Melmotte was a Roman Catholic. Now nothing was clearer than this,--that though catching the Catholic vote would greatly help a candidate, no real Roman Catholic could hope to be returned. This last article vexed Mr. Melmotte, and he proposed to his friends to send a letter to the \"Breakfast Table\" asserting that he adhered to the Protestant faith of his ancestors. But, as it was suspected by many, and was now being whispered to the world at large, that Melmotte had been born a Jew, this assurance would perhaps have been too strong. \"Do nothing of the kind,\" said Mr. Beauchamp Beauclerk. \"If any one asks you a question at any meeting, say that you are a Protestant. But it isn't likely, as we have none but our own people. Don't go writing letters.\"\nBut unfortunately the gift of an altar to St. Fabricius was such a godsend that sundry priests about the country were determined to cling to the good man who had bestowed his money so well. I think that many of them did believe that this was a great sign of a beauteous stirring of people's minds in favour of Rome. The fervent Romanists have always this point in their favour, that they are ready to believe. And they have a desire for the conversion of men which is honest in an exactly inverse ratio to the dishonesty of the means which they employ to produce it. Father Barham was ready to sacrifice anything personal to himself in the good cause,--his time, his health, his money when he had any, and his life. Much as he liked the comfort of Carbury Hall, he would never for a moment condescend to ensure its continued enjoyment by reticence as to his religion. Roger Carbury was hard of heart. He could see that. But the dropping of water might hollow the stone. If the dropping should be put an end to by outward circumstances before the stone had been impressed that would not be his fault. He at any rate would do his duty. In that fixed resolution Father Barham was admirable. But he had no scruple whatsoever as to the nature of the arguments he would use,--or as to the facts which he would proclaim. With the mingled ignorance of his life and the positiveness of his faith he had at once made up his mind that Melmotte was a great man, and that he might be made a great instrument on behalf of the Pope. He believed in the enormous proportions of the man's wealth,--believed that he was powerful in all quarters of the globe,--and believed, because he was so told by \"The Surplice,\" that the man was at heart a Catholic. That a man should be at heart a Catholic, and live in the world professing the Protestant religion, was not to Father Barham either improbable or distressing. Kings who had done so were to him objects of veneration. By such subterfuges and falsehood of life had they been best able to keep alive the spark of heavenly fire. There was a mystery and religious intrigue in this which recommended itself to the young priest's mind. But it was clear to him that this was a peculiar time,--in which it behoved an earnest man to be doing something. He had for some weeks been preparing himself for a trip to London in order that he might spend a week in retreat with kindred souls who from time to time betook themselves to the cells of St. Fabricius. And so, just at this season of the Westminster election, Father Barham made a journey to London.\nHe had conceived the great idea of having a word or two with Mr. Melmotte himself. He thought that he might be convinced by a word or two as to the man's faith. And he thought, also, that it might be a happiness to him hereafter to have had intercourse with a man who was perhaps destined to be the means of restoring the true faith to his country. On Saturday night,--that Saturday night on which Mr. Melmotte had so successfully exercised his greatness at the India Office,--he took up his quarters in the cloisters of St. Fabricius; he spent a goodly festive Sunday among the various Romanist church services of the metropolis; and on the Monday morning he sallied forth in quest of Mr. Melmotte. Having obtained that address from some circular, he went first to Abchurch Lane. But on this day, and on the next, which would be the day of the election, Mr. Melmotte was not expected in the City, and the priest was referred to his present private residence in Bruton Street. There he was told that the great man might probably be found in Grosvenor Square, and at the house in the square Father Barham was at last successful. Mr. Melmotte was there superintending the arrangements for the entertainment of the Emperor.\nThe servants, or more probably the workmen, must have been at fault in giving the priest admittance. But in truth the house was in great confusion. The wreaths of flowers and green boughs were being suspended, last daubs of heavy gilding were being given to the wooden capitals of mock pilasters, incense was being burned to kill the smell of the paint, tables were being fixed and chairs were being moved; and an enormous set of open presses were being nailed together for the accommodation of hats and cloaks. The hall was chaos, and poor Father Barham, who had heard a good deal of the Westminster election, but not a word of the intended entertainment of the Emperor, was at a loss to conceive for what purpose these operations were carried on. But through the chaos he made his way, and did soon find himself in the presence of Mr. Melmotte in the banqueting hall.\nMr. Melmotte was attended both by Lord Alfred and his son. He was standing in front of the chair which had been arranged for the Emperor, with his hat on one side of his head, and he was very angry indeed. He had been given to understand when the dinner was first planned, that he was to sit opposite to his august guest;--by which he had conceived that he was to have a seat immediately in face of the Emperor of Emperors, of the Brother of the Sun, of the Celestial One himself. It was now explained to him that this could not be done. In face of the Emperor there must be a wide space, so that his Majesty might be able to look down the hall; and the royal princesses who sat next to the Emperor, and the royal princes who sat next to the princesses, must also be so indulged. And in this way Mr. Melmotte's own seat became really quite obscure. Lord Alfred was having a very bad time of it. \"It's that fellow from 'The Herald' office did it, not me,\" he said, almost in a passion. \"I don't know how people ought to sit. But that's the reason.\"\n\"I'm d---- if I'm going to be treated in this way in my own house,\" were the first words which the priest heard. And as Father Barham walked up the room and came close to the scene of action, unperceived by either of the Grendalls, Mr. Melmotte was trying, but trying in vain, to move his own seat nearer to Imperial Majesty. A bar had been put up of such a nature that Melmotte, sitting in the seat prepared for him, would absolutely be barred out from the centre of his own hall. \"Who the d---- are you?\" he asked, when the priest appeared close before his eyes on the inner or more imperial side of the bar. It was not the habit of Father Barham's life to appear in sleek apparel. He was ever clothed in the very rustiest brown black that age can produce. In Beccles where he was known it signified little, but in the halls of the great one in Grosvenor Square, perhaps the stranger's welcome was cut to the measure of his outer man. A comely priest in glossy black might have been received with better grace.\nFather Barham stood humbly with his hat off. He was a man of infinite pluck; but outward humility--at any rate at the commencement of an enterprise,--was the rule of his life. \"I am the Rev. Mr. Barham,\" said the visitor. \"I am the priest of Beccles in Suffolk. I believe I am speaking to Mr. Melmotte.\"\n[Illustration: Father Barham.]\n\"That's my name, sir. And what may you want? I don't know whether you are aware that you have found your way into my private dining-room without any introduction. Where the mischief are the fellows, Alfred, who ought to have seen about this? I wish you'd look to it, Miles. Can anybody who pleases walk into my hall?\"\n\"I came on a mission which I hope may be pleaded as my excuse,\" said the priest. Although he was bold, he found it difficult to explain his mission. Had not Lord Alfred been there he could have done it better, in spite of the very repulsive manner of the great man himself.\n\"Is it business?\" asked Lord Alfred.\n\"Certainly it is business,\" said Father Barham with a smile.\n\"Then you had better call at the office in Abchurch Lane,--in the City,\" said his lordship.\n\"My business is not of that nature. I am a poor servant of the Cross, who is anxious to know from the lips of Mr. Melmotte himself that his heart is inclined to the true Faith.\"\n\"Some lunatic,\" said Melmotte. \"See that there ain't any knives about, Alfred.\"\n\"No otherwise mad, sir, than they have ever been accounted mad who are enthusiastic in their desire for the souls of others.\"\n\"Just get a policeman, Alfred. Or send somebody; you'd better not go away.\"\n\"You will hardly need a policeman, Mr. Melmotte,\" continued the priest. \"If I might speak to you alone for a few minutes--\"\n\"Certainly not;--certainly not. I am very busy, and if you will not go away you'll have to be taken away. I wonder whether anybody knows him.\"\n\"Mr. Carbury, of Carbury Hall, is my friend.\"\n\"Carbury! D---- the Carburys! Did any of the Carburys send you here? A set of beggars! Why don't you do something, Alfred, to get rid of him?\"\n\"You'd better go,\" said Lord Alfred. \"Don't make a rumpus, there's a good fellow;--but just go.\"\n\"There shall be no rumpus,\" said the priest, waxing wrathful. \"I asked for you at the door, and was told to come in by your own servants. Have I been uncivil that you should treat me in this fashion?\"\n\"You're in the way,\" said Lord Alfred.\n\"It's a piece of gross impertinence,\" said Melmotte. \"Go away.\"\n\"Will you not tell me before I go whether I shall pray for you as one whose steps in the right path should be made sure and firm; or as one still in error and in darkness?\"\n\"What the mischief does he mean?\" asked Melmotte.\n\"He wants to know whether you're a papist,\" said Lord Alfred.\n\"What the deuce is it to him?\" almost screamed Melmotte;--whereupon Father Barham bowed and took his leave.\n\"That's a remarkable thing,\" said Melmotte,--\"very remarkable.\" Even this poor priest's mad visit added to his inflation. \"I suppose he was in earnest.\"\n\"Mad as a hatter,\" said Lord Alfred.\n\"But why did he come to me in his madness--to me especially? That's what I want to know. I'll tell you what it is. There isn't a man in all England at this moment thought of so much as--your humble servant. I wonder whether the 'Morning Pulpit' people sent him here now to find out really what is my religion.\"\n\"Mad as a hatter,\" said Lord Alfred again;--\"just that and no more.\"\n\"My dear fellow, I don't think you've the gift of seeing very far. The truth is they don't know what to make of me;--and I don't intend that they shall. I'm playing my game, and there isn't one of 'em understands it except myself. It's no good my sitting here, you know. I shan't be able to move. How am I to get at you if I want anything?\"\n\"What can you want? There'll be lots of servants about.\"\n\"I'll have this bar down, at any rate.\" And he did succeed in having removed the bar which had been specially put up to prevent his intrusion on his own guests in his own house. \"I look upon that fellow's coming here as a very singular sign of the times,\" he went on to say. \"They'll want before long to know where I have my clothes made, and who measures me for my boots!\" Perhaps the most remarkable circumstance in the career of this remarkable man was the fact that he came almost to believe in himself.\nFather Barham went away certainly disgusted; and yet not altogether disheartened. The man had not declared that he was not a Roman Catholic. He had shown himself to be a brute. He had blasphemed and cursed. He had been outrageously uncivil to a man whom he must have known to be a minister of God. He had manifested himself to this priest, who had been born an English gentleman, as being no gentleman. But, not the less might he be a good Catholic,--or good enough at any rate to be influential on the right side. To his eyes Melmotte, with all his insolent vulgarity, was infinitely a more hopeful man than Roger Carbury. \"He insulted me,\" said Father Barham to a brother religionist that evening within the cloisters of St. Fabricius.\n\"Did he intend to insult you?\"\n\"Certainly he did. But what of that? It is not by the hands of polished men, nor even of the courteous, that this work has to be done. He was preparing for some great festival, and his mind was intent upon that.\"\n\"He entertains the Emperor of China this very day,\" said the brother priest, who, as a resident in London, heard from time to time what was being done.\n\"The Emperor of China! Ah, that accounts for it. I do think that he is on our side, even though he gave me but little encouragement for saying so. Will they vote for him, here at Westminster?\"\n\"Our people will. They think that he is rich and can help them.\"\n\"There is no doubt of his wealth, I suppose,\" said Father Barham.\n\"Some people do doubt;--but others say he is the richest man in the world.\"\n\"He looked like it,--and spoke like it,\" said Father Barham. \"Think what such a man might do, if he be really the wealthiest man in the world! And if he had been against us would he not have said so? Though he was uncivil, I am glad that I saw him.\" Father Barham, with a simplicity that was singularly mingled with his religious cunning, made himself believe before he returned to Beccles that Mr. Melmotte was certainly a Roman Catholic.",
        "paragraph_chars": [
            [
                0,
                3058
            ],
            [
                3058,
                3698
            ],
            [
                3698,
                5949
            ],
            [
                5949,
                8526
            ],
            [
                8526,
                9747
            ],
            [
                9747,
                10617
            ],
            [
                10617,
                11665
            ],
            [
                11665,
                12678
            ],
            [
                12678,
                12982
            ],
            [
                12982,
                13013
            ],
            [
                13013,
                13331
            ],
            [
                13331,
                13605
            ],
            [
                13605,
                13642
            ],
            [
                13642,
                13703
            ],
            [
                13703,
                13795
            ],
            [
                13795,
                13973
            ],
            [
                13973,
                14053
            ],
            [
                14053,
                14179
            ],
            [
                14179,
                14255
            ],
            [
                14255,
                14379
            ],
            [
                14379,
                14522
            ],
            [
                14522,
                14568
            ],
            [
                14568,
                14711
            ],
            [
                14711,
                14808
            ],
            [
                14808,
                15009
            ],
            [
                15009,
                15048
            ],
            [
                15048,
                15112
            ],
            [
                15112,
                15285
            ],
            [
                15285,
                15335
            ],
            [
                15335,
                15397
            ],
            [
                15397,
                15505
            ],
            [
                15505,
                15658
            ],
            [
                15658,
                15695
            ],
            [
                15695,
                16006
            ],
            [
                16006,
                16075
            ],
            [
                16075,
                16416
            ],
            [
                16416,
                16473
            ],
            [
                16473,
                16981
            ],
            [
                16981,
                17719
            ],
            [
                17719,
                17750
            ],
            [
                17750,
                17963
            ],
            [
                17963,
                18115
            ],
            [
                18115,
                18308
            ],
            [
                18308,
                18373
            ],
            [
                18373,
                18439
            ],
            [
                18439,
                18515
            ],
            [
                18515,
                18954
            ]
        ],
        "segment_chars": [
            [
                0,
                87
            ],
            [
                87,
                211
            ],
            [
                211,
                256
            ],
            [
                256,
                576
            ],
            [
                576,
                660
            ],
            [
                660,
                867
            ],
            [
                867,
                937
            ],
            [
                937,
                1156
            ],
            [
                1156,
                1399
            ],
            [
                1399,
                1656
            ],
            [
                1656,
                1891
            ],
            [
                1891,
                2248
            ],
            [
                2248,
                2368
            ],
            [
                2368,
                2540
            ],
            [
                2540,
                2664
            ],
            [
                2664,
                2815
            ],
            [
                2815,
                3058
            ],
            [
                3058,
                3200
            ],
            [
                3200,
                3377
            ],
            [
                3377,
                3525
            ],
            [
                3525,
                3698
            ],
            [
                3698,
                3787
            ],
            [
                3787,
                3931
            ],
            [
                3931,
                3988
            ],
            [
                3988,
                4175
            ],
            [
                4175,
                4260
            ],
            [
                4260,
                4402
            ],
            [
                4402,
                4618
            ],
            [
                4618,
                4988
            ],
            [
                4988,
                5026
            ],
            [
                5026,
                5145
            ],
            [
                5145,
                5223
            ],
            [
                5223,
                5380
            ],
            [
                5380,
                5559
            ],
            [
                5559,
                5730
            ],
            [
                5730,
                5786
            ],
            [
                5786,
                5865
            ],
            [
                5865,
                5922
            ],
            [
                5922,
                5949
            ],
            [
                5949,
                6139
            ],
            [
                6139,
                6265
            ],
            [
                6265,
                6359
            ],
            [
                6359,
                6516
            ],
            [
                6516,
                6665
            ],
            [
                6665,
                6817
            ],
            [
                6817,
                6850
            ],
            [
                6850,
                6869
            ],
            [
                6869,
                6919
            ],
            [
                6919,
                7049
            ],
            [
                7049,
                7083
            ],
            [
                7083,
                7137
            ],
            [
                7137,
                7263
            ],
            [
                7263,
                7467
            ],
            [
                7467,
                7684
            ],
            [
                7684,
                7843
            ],
            [
                7843,
                7900
            ],
            [
                7900,
                8008
            ],
            [
                8008,
                8112
            ],
            [
                8112,
                8226
            ],
            [
                8226,
                8429
            ],
            [
                8429,
                8526
            ],
            [
                8526,
                8609
            ],
            [
                8609,
                8687
            ],
            [
                8687,
                8875
            ],
            [
                8875,
                9226
            ],
            [
                9226,
                9307
            ],
            [
                9307,
                9503
            ],
            [
                9503,
                9654
            ],
            [
                9654,
                9747
            ],
            [
                9747,
                9848
            ],
            [
                9848,
                9895
            ],
            [
                9895,
                10259
            ],
            [
                10259,
                10496
            ],
            [
                10496,
                10617
            ],
            [
                10617,
                10676
            ],
            [
                10676,
                10823
            ],
            [
                10823,
                11098
            ],
            [
                11098,
                11155
            ],
            [
                11155,
                11397
            ],
            [
                11397,
                11466
            ],
            [
                11466,
                11512
            ],
            [
                11512,
                11602
            ],
            [
                11602,
                11641
            ],
            [
                11641,
                11665
            ],
            [
                11665,
                11778
            ],
            [
                11778,
                11991
            ],
            [
                11991,
                12147
            ],
            [
                12147,
                12172
            ],
            [
                12172,
                12276
            ],
            [
                12276,
                12349
            ],
            [
                12349,
                12424
            ],
            [
                12424,
                12602
            ],
            [
                12602,
                12678
            ],
            [
                12678,
                12723
            ],
            [
                12723,
                12854
            ],
            [
                12854,
                12900
            ],
            [
                12900,
                12940
            ],
            [
                12940,
                12982
            ],
            [
                12982,
                13013
            ],
            [
                13013,
                13035
            ],
            [
                13035,
                13058
            ],
            [
                13058,
                13176
            ],
            [
                13176,
                13255
            ],
            [
                13255,
                13287
            ],
            [
                13287,
                13331
            ],
            [
                13331,
                13412
            ],
            [
                13412,
                13480
            ],
            [
                13480,
                13605
            ],
            [
                13605,
                13623
            ],
            [
                13623,
                13642
            ],
            [
                13642,
                13703
            ],
            [
                13703,
                13795
            ],
            [
                13795,
                13831
            ],
            [
                13831,
                13973
            ],
            [
                13973,
                14004
            ],
            [
                14004,
                14053
            ],
            [
                14053,
                14179
            ],
            [
                14179,
                14210
            ],
            [
                14210,
                14255
            ],
            [
                14255,
                14327
            ],
            [
                14327,
                14379
            ],
            [
                14379,
                14411
            ],
            [
                14411,
                14485
            ],
            [
                14485,
                14522
            ],
            [
                14522,
                14568
            ],
            [
                14568,
                14578
            ],
            [
                14578,
                14598
            ],
            [
                14598,
                14637
            ],
            [
                14637,
                14655
            ],
            [
                14655,
                14711
            ],
            [
                14711,
                14748
            ],
            [
                14748,
                14808
            ],
            [
                14808,
                14870
            ],
            [
                14870,
                14946
            ],
            [
                14946,
                15009
            ],
            [
                15009,
                15048
            ],
            [
                15048,
                15101
            ],
            [
                15101,
                15112
            ],
            [
                15112,
                15285
            ],
            [
                15285,
                15319
            ],
            [
                15319,
                15335
            ],
            [
                15335,
                15397
            ],
            [
                15397,
                15428
            ],
            [
                15428,
                15505
            ],
            [
                15505,
                15569
            ],
            [
                15569,
                15627
            ],
            [
                15627,
                15658
            ],
            [
                15658,
                15695
            ],
            [
                15695,
                15756
            ],
            [
                15756,
                15784
            ],
            [
                15784,
                15810
            ],
            [
                15810,
                15902
            ],
            [
                15902,
                16006
            ],
            [
                16006,
                16075
            ],
            [
                16075,
                16142
            ],
            [
                16142,
                16228
            ],
            [
                16228,
                16306
            ],
            [
                16306,
                16346
            ],
            [
                16346,
                16372
            ],
            [
                16372,
                16416
            ],
            [
                16416,
                16436
            ],
            [
                16436,
                16473
            ],
            [
                16473,
                16513
            ],
            [
                16513,
                16651
            ],
            [
                16651,
                16748
            ],
            [
                16748,
                16847
            ],
            [
                16847,
                16981
            ],
            [
                16981,
                17063
            ],
            [
                17063,
                17122
            ],
            [
                17122,
                17158
            ],
            [
                17158,
                17188
            ],
            [
                17188,
                17279
            ],
            [
                17279,
                17384
            ],
            [
                17384,
                17496
            ],
            [
                17496,
                17605
            ],
            [
                17605,
                17719
            ],
            [
                17719,
                17750
            ],
            [
                17750,
                17769
            ],
            [
                17769,
                17787
            ],
            [
                17787,
                17885
            ],
            [
                17885,
                17963
            ],
            [
                17963,
                18115
            ],
            [
                18115,
                18138
            ],
            [
                18138,
                18164
            ],
            [
                18164,
                18262
            ],
            [
                18262,
                18308
            ],
            [
                18308,
                18326
            ],
            [
                18326,
                18373
            ],
            [
                18373,
                18439
            ],
            [
                18439,
                18515
            ],
            [
                18515,
                18576
            ],
            [
                18576,
                18658
            ],
            [
                18658,
                18715
            ],
            [
                18715,
                18765
            ],
            [
                18765,
                18954
            ]
        ],
        "overlap_chars": [
            [
                0,
                87
            ],
            [
                1156,
                1179
            ],
            [
                1223,
                1262
            ],
            [
                1187,
                1189
            ],
            [
                1281,
                1290
            ],
            [
                1308,
                1316
            ],
            [
                1348,
                1398
            ],
            [
                1399,
                1421
            ],
            [
                1437,
                1532
            ],
            [
                1553,
                1611
            ],
            [
                1654,
                1656
            ],
            [
                1721,
                1731
            ],
            [
                1848,
                1850
            ],
            [
                1667,
                1671
            ],
            [
                1737,
                1752
            ],
            [
                1761,
                1799
            ],
            [
                1809,
                1815
            ],
            [
                1865,
                1866
            ],
            [
                1851,
                1854
            ],
            [
                1867,
                1890
            ],
            [
                1891,
                1898
            ],
            [
                1956,
                1963
            ],
            [
                1899,
                1906
            ],
            [
                2045,
                2056
            ],
            [
                2085,
                2138
            ],
            [
                2191,
                2202
            ],
            [
                2212,
                2248
            ],
            [
                2248,
                2261
            ],
            [
                2271,
                2287
            ],
            [
                2262,
                2265
            ],
            [
                2300,
                2316
            ],
            [
                2387,
                2388
            ],
            [
                2320,
                2323
            ],
            [
                2368,
                2371
            ],
            [
                2378,
                2387
            ],
            [
                2445,
                2454
            ],
            [
                2266,
                2270
            ],
            [
                2472,
                2479
            ],
            [
                2509,
                2540
            ],
            [
                2679,
                2682
            ],
            [
                2692,
                2698
            ],
            [
                2703,
                2791
            ],
            [
                2803,
                2815
            ],
            [
                2815,
                2850
            ],
            [
                2859,
                2918
            ],
            [
                2922,
                2937
            ],
            [
                2977,
                2981
            ],
            [
                2988,
                3058
            ],
            [
                3058,
                3073
            ],
            [
                3101,
                3174
            ],
            [
                3183,
                3187
            ],
            [
                3198,
                3200
            ],
            [
                3377,
                3524
            ],
            [
                3698,
                3764
            ],
            [
                3774,
                3787
            ],
            [
                3787,
                3816
            ],
            [
                3836,
                3839
            ],
            [
                3840,
                3857
            ],
            [
                3929,
                3931
            ],
            [
                3931,
                3988
            ],
            [
                3988,
                3994
            ],
            [
                4008,
                4098
            ],
            [
                4119,
                4174
            ],
            [
                4175,
                4180
            ],
            [
                4188,
                4199
            ],
            [
                4205,
                4260
            ],
            [
                4260,
                4273
            ],
            [
                4284,
                4324
            ],
            [
                4334,
                4340
            ],
            [
                4367,
                4368
            ],
            [
                4343,
                4367
            ],
            [
                4369,
                4402
            ],
            [
                4402,
                4409
            ],
            [
                4410,
                4451
            ],
            [
                4499,
                4521
            ],
            [
                4528,
                4564
            ],
            [
                4573,
                4618
            ],
            [
                4618,
                4636
            ],
            [
                4640,
                4758
            ],
            [
                4849,
                4863
            ],
            [
                4914,
                4988
            ],
            [
                4988,
                5026
            ],
            [
                5026,
                5087
            ],
            [
                5107,
                5145
            ],
            [
                5158,
                5222
            ],
            [
                5223,
                5226
            ],
            [
                5235,
                5238
            ],
            [
                5259,
                5263
            ],
            [
                5330,
                5369
            ],
            [
                5378,
                5380
            ],
            [
                5380,
                5384
            ],
            [
                5390,
                5448
            ],
            [
                5452,
                5472
            ],
            [
                5484,
                5489
            ],
            [
                5491,
                5508
            ],
            [
                5517,
                5559
            ],
            [
                5559,
                5591
            ],
            [
                5644,
                5729
            ],
            [
                5730,
                5786
            ],
            [
                5786,
                5789
            ],
            [
                5798,
                5806
            ],
            [
                5832,
                5837
            ],
            [
                5843,
                5865
            ],
            [
                5865,
                5868
            ],
            [
                5922,
                5949
            ],
            [
                5967,
                6028
            ],
            [
                6036,
                6043
            ],
            [
                6050,
                6139
            ],
            [
                6516,
                6561
            ],
            [
                6582,
                6599
            ],
            [
                6571,
                6573
            ],
            [
                6602,
                6623
            ],
            [
                6651,
                6654
            ],
            [
                6624,
                6649
            ],
            [
                6663,
                6664
            ],
            [
                7083,
                7085
            ],
            [
                7097,
                7137
            ],
            [
                7137,
                7203
            ],
            [
                7232,
                7237
            ],
            [
                7204,
                7216
            ],
            [
                7261,
                7263
            ],
            [
                7263,
                7267
            ],
            [
                7272,
                7289
            ],
            [
                7302,
                7305
            ],
            [
                7330,
                7467
            ],
            [
                7467,
                7485
            ],
            [
                7514,
                7519
            ],
            [
                7486,
                7494
            ],
            [
                7520,
                7526
            ],
            [
                7526,
                7527
            ],
            [
                7590,
                7602
            ],
            [
                7538,
                7545
            ],
            [
                7659,
                7684
            ],
            [
                7684,
                7688
            ],
            [
                7695,
                7701
            ],
            [
                7748,
                7755
            ],
            [
                7759,
                7782
            ],
            [
                7784,
                7842
            ],
            [
                8226,
                8241
            ],
            [
                8367,
                8371
            ],
            [
                8248,
                8262
            ],
            [
                8271,
                8300
            ],
            [
                8372,
                8374
            ],
            [
                8315,
                8338
            ],
            [
                8401,
                8429
            ],
            [
                8429,
                8435
            ],
            [
                8524,
                8525
            ],
            [
                8526,
                8574
            ],
            [
                8582,
                8607
            ],
            [
                8609,
                8611
            ],
            [
                8667,
                8669
            ],
            [
                8784,
                8874
            ],
            [
                8875,
                8892
            ],
            [
                8895,
                8899
            ],
            [
                8909,
                9000
            ],
            [
                9006,
                9070
            ],
            [
                9101,
                9104
            ],
            [
                9088,
                9094
            ],
            [
                9105,
                9112
            ],
            [
                9122,
                9137
            ],
            [
                9155,
                9185
            ],
            [
                9212,
                9225
            ],
            [
                9275,
                9307
            ],
            [
                9307,
                9327
            ],
            [
                9331,
                9442
            ],
            [
                9485,
                9487
            ],
            [
                9501,
                9503
            ],
            [
                9503,
                9511
            ],
            [
                9558,
                9563
            ],
            [
                9654,
                9666
            ],
            [
                9677,
                9747
            ],
            [
                9861,
                9895
            ],
            [
                9899,
                9945
            ],
            [
                9955,
                10032
            ],
            [
                10042,
                10135
            ],
            [
                10147,
                10152
            ],
            [
                10257,
                10259
            ],
            [
                10259,
                10271
            ],
            [
                10272,
                10372
            ],
            [
                10406,
                10444
            ],
            [
                10462,
                10496
            ],
            [
                10496,
                10538
            ],
            [
                10553,
                10617
            ],
            [
                10617,
                10633
            ],
            [
                10651,
                10676
            ],
            [
                10676,
                10754
            ],
            [
                10793,
                10823
            ],
            [
                10823,
                10854
            ],
            [
                11039,
                11040
            ],
            [
                10855,
                10917
            ],
            [
                10921,
                10924
            ],
            [
                10932,
                10937
            ],
            [
                10943,
                10951
            ],
            [
                10993,
                11007
            ],
            [
                11013,
                11039
            ],
            [
                11096,
                11098
            ],
            [
                11098,
                11155
            ],
            [
                11155,
                11157
            ],
            [
                11163,
                11225
            ],
            [
                11243,
                11270
            ],
            [
                11304,
                11307
            ],
            [
                11271,
                11287
            ],
            [
                11317,
                11320
            ],
            [
                11331,
                11346
            ],
            [
                11395,
                11397
            ],
            [
                11401,
                11465
            ],
            [
                11466,
                11512
            ],
            [
                11512,
                11534
            ],
            [
                11536,
                11546
            ],
            [
                11548,
                11602
            ],
            [
                11602,
                11639
            ],
            [
                11665,
                11671
            ],
            [
                11676,
                11702
            ],
            [
                11706,
                11778
            ],
            [
                11778,
                11805
            ],
            [
                11895,
                11921
            ],
            [
                11933,
                11972
            ],
            [
                11809,
                11812
            ],
            [
                11973,
                11991
            ],
            [
                11991,
                12012
            ],
            [
                12030,
                12034
            ],
            [
                12078,
                12081
            ],
            [
                12114,
                12146
            ],
            [
                12147,
                12157
            ],
            [
                12162,
                12172
            ],
            [
                12172,
                12174
            ],
            [
                12264,
                12270
            ],
            [
                12191,
                12197
            ],
            [
                12180,
                12181
            ],
            [
                12279,
                12282
            ],
            [
                12361,
                12371
            ],
            [
                12220,
                12223
            ],
            [
                12376,
                12380
            ],
            [
                12390,
                12401
            ],
            [
                12422,
                12424
            ],
            [
                12602,
                12678
            ],
            [
                12678,
                12723
            ],
            [
                12767,
                12775
            ],
            [
                12777,
                12795
            ],
            [
                12809,
                12825
            ],
            [
                12828,
                12853
            ],
            [
                12854,
                12863
            ],
            [
                12869,
                12881
            ],
            [
                12882,
                12886
            ],
            [
                12900,
                12901
            ],
            [
                12906,
                12940
            ],
            [
                12940,
                12982
            ],
            [
                13013,
                13035
            ],
            [
                13035,
                13058
            ],
            [
                13220,
                13223
            ],
            [
                13210,
                13218
            ],
            [
                13253,
                13255
            ],
            [
                13287,
                13331
            ],
            [
                13331,
                13412
            ],
            [
                13412,
                13479
            ],
            [
                13605,
                13623
            ],
            [
                13623,
                13642
            ],
            [
                13642,
                13652
            ],
            [
                13667,
                13703
            ],
            [
                13703,
                13759
            ],
            [
                13773,
                13795
            ],
            [
                13795,
                13831
            ],
            [
                13831,
                13973
            ],
            [
                13973,
                14004
            ],
            [
                14004,
                14053
            ],
            [
                14053,
                14054
            ],
            [
                14067,
                14076
            ],
            [
                14124,
                14136
            ],
            [
                14153,
                14179
            ],
            [
                14179,
                14208
            ],
            [
                14255,
                14327
            ],
            [
                14327,
                14375
            ],
            [
                14379,
                14380
            ],
            [
                14396,
                14411
            ],
            [
                14411,
                14425
            ],
            [
                14483,
                14485
            ],
            [
                14485,
                14522
            ],
            [
                14522,
                14568
            ],
            [
                14568,
                14578
            ],
            [
                14578,
                14579
            ],
            [
                14584,
                14598
            ],
            [
                14598,
                14601
            ],
            [
                14622,
                14637
            ],
            [
                14637,
                14655
            ],
            [
                14655,
                14711
            ],
            [
                14711,
                14748
            ],
            [
                14748,
                14792
            ],
            [
                14798,
                14808
            ],
            [
                14808,
                14852
            ],
            [
                14868,
                14870
            ],
            [
                14870,
                14931
            ],
            [
                14936,
                14946
            ],
            [
                14946,
                15009
            ],
            [
                15009,
                15048
            ],
            [
                15048,
                15053
            ],
            [
                15065,
                15101
            ],
            [
                15101,
                15112
            ],
            [
                15112,
                15133
            ],
            [
                15146,
                15193
            ],
            [
                15194,
                15211
            ],
            [
                15240,
                15270
            ],
            [
                15274,
                15285
            ],
            [
                15285,
                15319
            ],
            [
                15319,
                15335
            ],
            [
                15335,
                15397
            ],
            [
                15397,
                15428
            ],
            [
                15428,
                15452
            ],
            [
                15455,
                15505
            ],
            [
                15505,
                15506
            ],
            [
                15531,
                15547
            ],
            [
                15658,
                15695
            ],
            [
                15695,
                15736
            ],
            [
                15754,
                15756
            ],
            [
                15784,
                15810
            ],
            [
                15810,
                15879
            ],
            [
                15900,
                15902
            ],
            [
                15902,
                15922
            ],
            [
                15924,
                15938
            ],
            [
                15940,
                15960
            ],
            [
                15965,
                15976
            ],
            [
                15992,
                15994
            ],
            [
                15995,
                16006
            ],
            [
                16006,
                16048
            ],
            [
                16050,
                16075
            ],
            [
                16075,
                16091
            ],
            [
                16142,
                16190
            ],
            [
                16192,
                16228
            ],
            [
                16497,
                16498
            ],
            [
                16479,
                16497
            ],
            [
                16513,
                16519
            ],
            [
                16532,
                16534
            ],
            [
                16550,
                16572
            ],
            [
                16583,
                16650
            ],
            [
                16651,
                16652
            ],
            [
                16664,
                16689
            ],
            [
                16693,
                16694
            ],
            [
                16709,
                16739
            ],
            [
                16746,
                16748
            ],
            [
                16748,
                16749
            ],
            [
                16762,
                16773
            ],
            [
                16749,
                16761
            ],
            [
                16774,
                16805
            ],
            [
                16812,
                16815
            ],
            [
                16839,
                16844
            ],
            [
                16806,
                16810
            ],
            [
                16844,
                16847
            ],
            [
                16847,
                16890
            ],
            [
                16910,
                16920
            ],
            [
                16895,
                16901
            ],
            [
                16925,
                16945
            ],
            [
                16951,
                16957
            ],
            [
                16946,
                16950
            ],
            [
                16958,
                16981
            ],
            [
                16981,
                17004
            ],
            [
                17015,
                17037
            ],
            [
                17049,
                17063
            ],
            [
                17226,
                17229
            ],
            [
                17161,
                17186
            ],
            [
                17191,
                17225
            ],
            [
                17262,
                17279
            ],
            [
                17279,
                17281
            ],
            [
                17370,
                17384
            ],
            [
                17384,
                17388
            ],
            [
                17393,
                17401
            ],
            [
                17429,
                17430
            ],
            [
                17408,
                17410
            ],
            [
                17402,
                17407
            ],
            [
                17411,
                17429
            ],
            [
                17432,
                17476
            ],
            [
                17494,
                17496
            ],
            [
                17496,
                17516
            ],
            [
                17551,
                17554
            ],
            [
                17566,
                17567
            ],
            [
                17568,
                17580
            ],
            [
                17585,
                17604
            ],
            [
                17605,
                17654
            ],
            [
                17667,
                17679
            ],
            [
                17704,
                17718
            ],
            [
                17787,
                17885
            ],
            [
                17885,
                17930
            ],
            [
                17940,
                17950
            ],
            [
                17956,
                17963
            ],
            [
                17963,
                17998
            ],
            [
                18012,
                18038
            ],
            [
                18113,
                18115
            ],
            [
                18115,
                18138
            ],
            [
                18138,
                18164
            ],
            [
                18164,
                18198
            ],
            [
                18204,
                18221
            ],
            [
                18226,
                18262
            ],
            [
                18262,
                18308
            ],
            [
                18308,
                18326
            ],
            [
                18326,
                18373
            ],
            [
                18373,
                18439
            ],
            [
                18439,
                18451
            ],
            [
                18455,
                18461
            ],
            [
                18463,
                18515
            ],
            [
                18515,
                18533
            ],
            [
                18536,
                18576
            ],
            [
                18576,
                18607
            ],
            [
                18656,
                18658
            ],
            [
                18715,
                18765
            ],
            [
                18765,
                18784
            ],
            [
                18807,
                18815
            ],
            [
                18787,
                18797
            ],
            [
                18852,
                18954
            ]
        ],
        "row_chars": [
            [
                0,
                87
            ],
            [
                87,
                211
            ],
            [
                211,
                256
            ],
            [
                256,
                576
            ],
            [
                576,
                660
            ],
            [
                660,
                867
            ],
            [
                867,
                937
            ],
            [
                937,
                1156
            ],
            [
                1156,
                1399
            ],
            [
                1399,
                1656
            ],
            [
                1656,
                1891
            ],
            [
                1891,
                2248
            ],
            [
                2248,
                2540
            ],
            [
                2540,
                2664
            ],
            [
                2664,
                2815
            ],
            [
                2815,
                3058
            ],
            [
                3058,
                3200
            ],
            [
                3200,
                3377
            ],
            [
                3377,
                3525
            ],
            [
                3525,
                3698
            ],
            [
                3698,
                3787
            ],
            [
                3787,
                3931
            ],
            [
                3931,
                3988
            ],
            [
                3988,
                4175
            ],
            [
                4175,
                4260
            ],
            [
                4260,
                4402
            ],
            [
                4402,
                4618
            ],
            [
                4618,
                4988
            ],
            [
                4988,
                5026
            ],
            [
                5026,
                5145
            ],
            [
                5145,
                5223
            ],
            [
                5223,
                5380
            ],
            [
                5380,
                5559
            ],
            [
                5559,
                5730
            ],
            [
                5730,
                5786
            ],
            [
                5786,
                5865
            ],
            [
                5865,
                5949
            ],
            [
                5949,
                6139
            ],
            [
                6139,
                6265
            ],
            [
                6265,
                6359
            ],
            [
                6359,
                6516
            ],
            [
                6516,
                6665
            ],
            [
                6665,
                6817
            ],
            [
                6817,
                6850
            ],
            [
                6850,
                6869
            ],
            [
                6869,
                6919
            ],
            [
                6919,
                7049
            ],
            [
                7049,
                7083
            ],
            [
                7083,
                7137
            ],
            [
                7137,
                7263
            ],
            [
                7263,
                7467
            ],
            [
                7467,
                7684
            ],
            [
                7684,
                7843
            ],
            [
                7843,
                7900
            ],
            [
                7900,
                8008
            ],
            [
                8008,
                8112
            ],
            [
                8112,
                8226
            ],
            [
                8226,
                8429
            ],
            [
                8429,
                8526
            ],
            [
                8526,
                8875
            ],
            [
                8875,
                9226
            ],
            [
                9226,
                9307
            ],
            [
                9307,
                9503
            ],
            [
                9503,
                9747
            ],
            [
                9747,
                9848
            ],
            [
                9848,
                9895
            ],
            [
                9895,
                10259
            ],
            [
                10259,
                10496
            ],
            [
                10496,
                10617
            ],
            [
                10617,
                10676
            ],
            [
                10676,
                10823
            ],
            [
                10823,
                11098
            ],
            [
                11098,
                11155
            ],
            [
                11155,
                11397
            ],
            [
                11397,
                11466
            ],
            [
                11466,
                11512
            ],
            [
                11512,
                11602
            ],
            [
                11602,
                11641
            ],
            [
                11641,
                11665
            ],
            [
                11665,
                11778
            ],
            [
                11778,
                11991
            ],
            [
                11991,
                12147
            ],
            [
                12147,
                12172
            ],
            [
                12172,
                12424
            ],
            [
                12424,
                12602
            ],
            [
                12602,
                12678
            ],
            [
                12678,
                12723
            ],
            [
                12723,
                12854
            ],
            [
                12854,
                12940
            ],
            [
                12940,
                12982
            ],
            [
                12982,
                13013
            ],
            [
                13013,
                13035
            ],
            [
                13035,
                13058
            ],
            [
                13058,
                13255
            ],
            [
                13255,
                13287
            ],
            [
                13287,
                13331
            ],
            [
                13331,
                13412
            ],
            [
                13412,
                13480
            ],
            [
                13480,
                13605
            ],
            [
                13605,
                13623
            ],
            [
                13623,
                13642
            ],
            [
                13642,
                13703
            ],
            [
                13703,
                13795
            ],
            [
                13795,
                13831
            ],
            [
                13831,
                13973
            ],
            [
                13973,
                14004
            ],
            [
                14004,
                14053
            ],
            [
                14053,
                14179
            ],
            [
                14179,
                14210
            ],
            [
                14210,
                14255
            ],
            [
                14255,
                14327
            ],
            [
                14327,
                14379
            ],
            [
                14379,
                14411
            ],
            [
                14411,
                14485
            ],
            [
                14485,
                14522
            ],
            [
                14522,
                14568
            ],
            [
                14568,
                14578
            ],
            [
                14578,
                14598
            ],
            [
                14598,
                14637
            ],
            [
                14637,
                14655
            ],
            [
                14655,
                14711
            ],
            [
                14711,
                14748
            ],
            [
                14748,
                14808
            ],
            [
                14808,
                14870
            ],
            [
                14870,
                14946
            ],
            [
                14946,
                15009
            ],
            [
                15009,
                15048
            ],
            [
                15048,
                15101
            ],
            [
                15101,
                15112
            ],
            [
                15112,
                15285
            ],
            [
                15285,
                15319
            ],
            [
                15319,
                15335
            ],
            [
                15335,
                15397
            ],
            [
                15397,
                15428
            ],
            [
                15428,
                15505
            ],
            [
                15505,
                15569
            ],
            [
                15569,
                15627
            ],
            [
                15627,
                15658
            ],
            [
                15658,
                15695
            ],
            [
                15695,
                15756
            ],
            [
                15756,
                15784
            ],
            [
                15784,
                15810
            ],
            [
                15810,
                15902
            ],
            [
                15902,
                16006
            ],
            [
                16006,
                16075
            ],
            [
                16075,
                16228
            ],
            [
                16228,
                16306
            ],
            [
                16306,
                16346
            ],
            [
                16346,
                16372
            ],
            [
                16372,
                16416
            ],
            [
                16416,
                16436
            ],
            [
                16436,
                16473
            ],
            [
                16473,
                16513
            ],
            [
                16513,
                16651
            ],
            [
                16651,
                16748
            ],
            [
                16748,
                16847
            ],
            [
                16847,
                16981
            ],
            [
                16981,
                17063
            ],
            [
                17063,
                17122
            ],
            [
                17122,
                17158
            ],
            [
                17158,
                17279
            ],
            [
                17279,
                17384
            ],
            [
                17384,
                17496
            ],
            [
                17496,
                17605
            ],
            [
                17605,
                17719
            ],
            [
                17719,
                17750
            ],
            [
                17750,
                17769
            ],
            [
                17769,
                17787
            ],
            [
                17787,
                17885
            ],
            [
                17885,
                17963
            ],
            [
                17963,
                18115
            ],
            [
                18115,
                18138
            ],
            [
                18138,
                18164
            ],
            [
                18164,
                18262
            ],
            [
                18262,
                18308
            ],
            [
                18308,
                18326
            ],
            [
                18326,
                18373
            ],
            [
                18373,
                18439
            ],
            [
                18439,
                18515
            ],
            [
                18515,
                18576
            ],
            [
                18576,
                18658
            ],
            [
                18658,
                18715
            ],
            [
                18715,
                18765
            ],
            [
                18765,
                18954
            ]
        ]
    },
    "abridged": {
        "text": "It was considered to be a great thing to catch the Roman Catholic vote in Westminster. To catch the Protestant and the Roman Catholic vote at the same time is difficult; but it was attempted now by Mr. Melmotte and his friends.\nIt was perhaps thought that the Protestants would not notice the 100 given for the altar to St. Fabricius; but Mr. Alf took care that Mr. Melmotte's religious opinions should be reported. No article at that time created so much interest as that which appeared in the Evening Pulpit, under the heading \"For Priest or Parson?\"\nIn this delightfully pungent article, Mr. Alf's writer declared that it was really important that the nation should know the nature of Mr. Melmotte's faith. That he was a highly religious man was most certain, from his two recent donations - doubtless part of a regular flow of Christian benevolence. The Evening Pulpit did not imagine that so great a man as Mr. Melmotte looked for any return in this world from his generosity. But still, as Protestants naturally wish to be represented in Parliament by a Protestant member, and Roman Catholics by a Catholic, perhaps Mr. Melmotte would not object to declare his creed.\nThis was biting; but Mr. Melmotte and his manager were not foolish enough to allow it to influence them. If the Protestants chose to believe that he was hyper-protestant, and the Catholics that he was tending towards papacy, so much the better for him.\nIt may be doubted whether the donation to the Curates' Aid Society had much effect. It may perhaps have induced a few religiously-minded men to go to the poll. But the donation to St. Fabricius certainly had results. It was made much of by the Roman Catholic party generally, till a report got itself spread abroad that Mr. Melmotte was going to join the Church of Rome.\nThese manuvres require delicate handling, or evil may follow instead of good. On the second day after the question had been asked in the Evening Pulpit, an answer to it appeared: \"For Priest and not for Parson.\" Therein, various assertions made by Roman Catholic journals were brought together, to show that Mr. Melmotte really had made up his mind on this important question. All the world knew, said Mr. Alf's writer, that with that keen sense of honesty which was the Great Financier's peculiar characteristic, he had doubted whether he could serve the nation best as a Liberal or as a Conservative. He had solved that doubt with wisdom. And now this other doubt had passed through the crucible, and a golden certainty had been produced. Westminster at last knew that Mr. Melmotte was a Roman Catholic.\nNow it was clear that no real Roman Catholic could hope to be elected. This article vexed Mr. Melmotte, and he proposed to his friends that they send a letter to the Breakfast Table asserting that he kept to the Protestant faith of his ancestors. But, as it was suspected by many that Melmotte had been born a Jew, this assurance would perhaps have been too strong.\n\"Do nothing of the kind,\" said Mr. Beauchamp Beauclerk. \"If anyone asks you, say you are a Protestant. But don't go writing letters.\"\nUnfortunately the gift of an altar to St. Fabricius was such a godsend that priests around the country were determined to cling to the good man who had bestowed his money so well. Father Barham was ready to sacrifice anything in the good cause of returning the country to the Catholic faith - his time, his health, and his money when he had any.\nIn his resolution Father Barham was admirable. But he had no scruple whatsoever as to the nature of the arguments and facts he would use. With mingled ignorance and faith he had at once made up his mind that Melmotte was a great man, and that he might be made a great instrument on behalf of the Pope. He believed in the man's enormous wealth and power, and believed that he was at heart a Catholic. That he should profess the Protestant religion was not to Father Barham either improbable or distressing.\nHe had for some time been preparing for a trip to London in order to spend a week in retreat at the cells of St. Fabricius. And so he now travelled there. He had conceived the great idea of having a word with Mr. Melmotte himself; he wished to meet a man who was perhaps destined to be the means of restoring the true faith to his country.\nOn Saturday night - that night on which Mr. Melmotte had so successfully exercised his greatness at the India Office - Father Barham took up his quarters in the cloisters of St. Fabricius; he spent the Sunday at various church services; and on the Monday morning he sought Mr. Melmotte.\nHe went first to Abchurch Lane. But on this day, and the next, which would be the day of the election, Mr. Melmotte was not expected in the City, and the priest was told that he might be in Grosvenor Square. There he found Mr. Melmotte superintending the arrangements for the entertainment of the Emperor.\nThe house was in great confusion. Wreaths of flowers and green boughs were being hung up, last daubs of heavy gilding were being given to the wooden capitals of mock pillars, incense was being burned to kill the smell of the paint, tables were being fixed and chairs moved. The hall was in chaos, and poor Father Barham, who had heard a good deal of the Westminster election, but not a word about the Emperor, was at a loss to conceive why these operations were carried on. But through the chaos he made his way, and found himself in the presence of Mr. Melmotte in the banqueting hall.\nMr. Melmotte was with Lord Alfred and his son. He was standing in front of the chair which had been arranged for the Emperor, and he was very angry indeed. He had been given to understand, when the dinner was first planned, that he was to sit opposite his guest - which he thought meant immediately in front of the Emperor of Emperors. It was now explained to him that this could not be done. In front of the Emperor there must be a wide space, so that his Majesty could look down the hall; and the same for the royal princesses and princes who sat by him. In this way Mr. Melmotte's own seat became really quite obscure.\nLord Alfred was having a very bad time of it. \"It's that fellow from The Herald office did it, not me,\" he said, almost in a passion. \"I don't know how people ought to sit.\"\n\"I'm d___ if I'm going to be treated this way in my own house,\" were the first words which the priest heard. And as Father Barham walked towards him, Mr. Melmotte was trying, in vain, to move his own seat nearer to the Imperial Majesty. A bar had been put up that kept him from the centre of his own hall.\n\"Who the d___ are you?\" he demanded of the priest, who was clothed in his usual very rusty brown black. A comely priest in glossy black might have been received with better grace.\nFather Barham stood humbly with his hat off. Outward humility - at any rate at the start of an enterprise - was the rule of his life.\n\"I am the Reverend Mr. Barham,\" he said, \"the priest of Beccles in Suffolk. I believe I am speaking to Mr. Melmotte.\"\n\"That's my name, sir. And what may you want? Who let him in, Alfred? Can anybody who pleases walk into my hall?\"\n\"I came on a mission which I hope may be pleaded as my excuse,\" said the priest. Although he was bold, he found it difficult to explain his mission.\n\"Is it business?\" asked Lord Alfred.\n\"Certainly,\" said Father Barham with a smile.\n\"Then you had better call at the office in Abchurch Lane,\" said his lordship.\n\"My business is not of that nature. I am a poor servant of the Cross, who is anxious to know from the lips of Mr. Melmotte himself that his heart is inclined to the true Faith.\"\n\"Some lunatic,\" said Melmotte. \"See that there ain't any knives about, Alfred.\"\n\"Not mad, sir, only enthusiastic for the souls of others.\"\n\"Just get a policeman, Alfred.\"\n\"You will hardly need a policeman, Mr. Melmotte,\" continued the priest. \"If I might speak to you alone for a few minutes-\"\n\"Certainly not. I am very busy. I wonder whether anybody knows him.\"\n\"Mr. Carbury, of Carbury Hall, is my friend.\"\n\"Carbury! D__ the Carburys! Did they send you here? A set of beggars! Why don't you do something, Alfred, to get rid of him?\"\n\"You'd better go,\" said Lord Alfred. \"Don't make a rumpus, there's a good fellow; just go.\"\n\"There shall be no rumpus,\" said the priest, growing angry. \"I asked for you at the door, and was told to come in by your servants. Have I been uncivil that you should treat me in this fashion?\"\n\"You're in the way,\" said Lord Alfred.\n\"It's gross impertinence,\" said Melmotte. \"Go away.\"\n\"Will you not tell me whether I shall pray for you as one whose steps are in the right path; or as one still in error and darkness?\"\n\"What the mischief does he mean?\" asked Melmotte.\n\"He wants to know whether you're a papist,\" said Lord Alfred.\n\"What the deuce is it to him?\" almost screamed Melmotte - whereupon Father Barham bowed and took his leave.\n\"Remarkable,\" said Melmotte.\n\"Mad as a hatter,\" said Lord Alfred.\n\"But why did he come to me in his madness? I'll tell you what it is. There isn't a man in all England at this moment thought of so much as I am. I wonder whether the Morning Pulpit people sent him here to find out my real religion.\"\n\"Mad as a hatter,\" said Lord Alfred again; \"just that and no more.\"\n\"My dear fellow, the truth is they don't know what to make of me; and I don't intend that they shall. Now, can we have this bar down?\"\nAnd he succeeded in removing the bar which had been put up to prevent his intrusion on his own guests in his own house.\n\"That fellow's coming here is a sign of the times,\" he went on. \"Before long they'll want to know where I have my clothes and boots made!\" Perhaps the most remarkable circumstance in Melmotte's remarkable career was the fact that he almost came to believe in himself.\nFather Barham went away disgusted; and yet not disheartened. The man had blasphemed and cursed, and had been outrageously uncivil to a minister of God. He was no gentleman. But, none the less, he might be a good Catholic - or good enough at any rate to be influential. To his eyes Melmotte was a much more hopeful prospect than Roger Carbury.\n\"He insulted me,\" said Father Barham to a brother priest that evening at St. Fabricius. \"But it is not by the hands of polished men, nor even of the courteous, that this work has to be done. He was preparing for some great festival, and was intent on that.\"\n\"He entertains the Emperor of China today,\" said the brother priest.\n\"The Emperor of China! Ah, that accounts for it. I do think that he is on our side, though he gave me little encouragement for saying so. Will they vote for him, here at Westminster?\"\n\"Our people will. They think that he is rich and can help them.\"\n\"There is no doubt of his wealth, I suppose,\" said Father Barham.\n\"Some people doubt; but others say he is the richest man in the world.\"\n\"He looked like it - and spoke like it,\" said Father Barham. \"Think what such a man might do! Though he was uncivil, I am glad that I saw him.\" Father Barham, with singular simplicity, made himself believe before he returned to Beccles that Mr. Melmotte was certainly a Roman Catholic.",
        "paragraph_chars": [
            [
                0,
                228
            ],
            [
                228,
                553
            ],
            [
                553,
                1174
            ],
            [
                1174,
                1427
            ],
            [
                1427,
                1798
            ],
            [
                1798,
                2604
            ],
            [
                2604,
                2970
            ],
            [
                2970,
                3104
            ],
            [
                3104,
                3450
            ],
            [
                3450,
                3956
            ],
            [
                3956,
                4296
            ],
            [
                4296,
                4583
            ],
            [
                4583,
                4889
            ],
            [
                4889,
                5476
            ],
            [
                5476,
                6098
            ],
            [
                6098,
                6272
            ],
            [
                6272,
                6578
            ],
            [
                6578,
                6758
            ],
            [
                6758,
                6892
            ],
            [
                6892,
                7010
            ],
            [
                7010,
                7123
            ],
            [
                7123,
                7272
            ],
            [
                7272,
                7309
            ],
            [
                7309,
                7355
            ],
            [
                7355,
                7433
            ],
            [
                7433,
                7611
            ],
            [
                7611,
                7691
            ],
            [
                7691,
                7750
            ],
            [
                7750,
                7782
            ],
            [
                7782,
                7905
            ],
            [
                7905,
                7974
            ],
            [
                7974,
                8020
            ],
            [
                8020,
                8146
            ],
            [
                8146,
                8238
            ],
            [
                8238,
                8433
            ],
            [
                8433,
                8472
            ],
            [
                8472,
                8525
            ],
            [
                8525,
                8658
            ],
            [
                8658,
                8708
            ],
            [
                8708,
                8770
            ],
            [
                8770,
                8878
            ],
            [
                8878,
                8907
            ],
            [
                8907,
                8944
            ],
            [
                8944,
                9177
            ],
            [
                9177,
                9245
            ],
            [
                9245,
                9380
            ],
            [
                9380,
                9500
            ],
            [
                9500,
                9768
            ],
            [
                9768,
                10111
            ],
            [
                10111,
                10369
            ],
            [
                10369,
                10438
            ],
            [
                10438,
                10622
            ],
            [
                10622,
                10687
            ],
            [
                10687,
                10753
            ],
            [
                10753,
                10825
            ],
            [
                10825,
                11110
            ]
        ],
        "segment_chars": [
            [
                0,
                87
            ],
            [
                87,
                228
            ],
            [
                228,
                416
            ],
            [
                416,
                553
            ],
            [
                553,
                710
            ],
            [
                710,
                854
            ],
            [
                854,
                982
            ],
            [
                982,
                1174
            ],
            [
                1174,
                1279
            ],
            [
                1279,
                1427
            ],
            [
                1427,
                1511
            ],
            [
                1511,
                1587
            ],
            [
                1587,
                1644
            ],
            [
                1644,
                1798
            ],
            [
                1798,
                1876
            ],
            [
                1876,
                2010
            ],
            [
                2010,
                2175
            ],
            [
                2175,
                2401
            ],
            [
                2401,
                2439
            ],
            [
                2439,
                2539
            ],
            [
                2539,
                2604
            ],
            [
                2604,
                2675
            ],
            [
                2675,
                2851
            ],
            [
                2851,
                2970
            ],
            [
                2970,
                3026
            ],
            [
                3026,
                3073
            ],
            [
                3073,
                3104
            ],
            [
                3104,
                3284
            ],
            [
                3284,
                3450
            ],
            [
                3450,
                3497
            ],
            [
                3497,
                3588
            ],
            [
                3588,
                3752
            ],
            [
                3752,
                3850
            ],
            [
                3850,
                3956
            ],
            [
                3956,
                4080
            ],
            [
                4080,
                4111
            ],
            [
                4111,
                4296
            ],
            [
                4296,
                4583
            ],
            [
                4583,
                4615
            ],
            [
                4615,
                4791
            ],
            [
                4791,
                4889
            ],
            [
                4889,
                4923
            ],
            [
                4923,
                5163
            ],
            [
                5163,
                5363
            ],
            [
                5363,
                5476
            ],
            [
                5476,
                5523
            ],
            [
                5523,
                5632
            ],
            [
                5632,
                5812
            ],
            [
                5812,
                5869
            ],
            [
                5869,
                6033
            ],
            [
                6033,
                6098
            ],
            [
                6098,
                6144
            ],
            [
                6144,
                6232
            ],
            [
                6232,
                6272
            ],
            [
                6272,
                6381
            ],
            [
                6381,
                6509
            ],
            [
                6509,
                6578
            ],
            [
                6578,
                6602
            ],
            [
                6602,
                6682
            ],
            [
                6682,
                6758
            ],
            [
                6758,
                6803
            ],
            [
                6803,
                6892
            ],
            [
                6892,
                6968
            ],
            [
                6968,
                7010
            ],
            [
                7010,
                7032
            ],
            [
                7032,
                7055
            ],
            [
                7055,
                7079
            ],
            [
                7079,
                7123
            ],
            [
                7123,
                7204
            ],
            [
                7204,
                7272
            ],
            [
                7272,
                7290
            ],
            [
                7290,
                7309
            ],
            [
                7309,
                7355
            ],
            [
                7355,
                7433
            ],
            [
                7433,
                7469
            ],
            [
                7469,
                7611
            ],
            [
                7611,
                7642
            ],
            [
                7642,
                7691
            ],
            [
                7691,
                7750
            ],
            [
                7750,
                7782
            ],
            [
                7782,
                7854
            ],
            [
                7854,
                7905
            ],
            [
                7905,
                7921
            ],
            [
                7921,
                7937
            ],
            [
                7937,
                7974
            ],
            [
                7974,
                8020
            ],
            [
                8020,
                8030
            ],
            [
                8030,
                8048
            ],
            [
                8048,
                8072
            ],
            [
                8072,
                8090
            ],
            [
                8090,
                8146
            ],
            [
                8146,
                8183
            ],
            [
                8183,
                8238
            ],
            [
                8238,
                8298
            ],
            [
                8298,
                8370
            ],
            [
                8370,
                8433
            ],
            [
                8433,
                8472
            ],
            [
                8472,
                8514
            ],
            [
                8514,
                8525
            ],
            [
                8525,
                8658
            ],
            [
                8658,
                8692
            ],
            [
                8692,
                8708
            ],
            [
                8708,
                8770
            ],
            [
                8770,
                8801
            ],
            [
                8801,
                8878
            ],
            [
                8878,
                8907
            ],
            [
                8907,
                8944
            ],
            [
                8944,
                8987
            ],
            [
                8987,
                9013
            ],
            [
                9013,
                9089
            ],
            [
                9089,
                9177
            ],
            [
                9177,
                9245
            ],
            [
                9245,
                9347
            ],
            [
                9347,
                9380
            ],
            [
                9380,
                9500
            ],
            [
                9500,
                9564
            ],
            [
                9564,
                9639
            ],
            [
                9639,
                9768
            ],
            [
                9768,
                9829
            ],
            [
                9829,
                9920
            ],
            [
                9920,
                9941
            ],
            [
                9941,
                10037
            ],
            [
                10037,
                10111
            ],
            [
                10111,
                10199
            ],
            [
                10199,
                10302
            ],
            [
                10302,
                10369
            ],
            [
                10369,
                10438
            ],
            [
                10438,
                10461
            ],
            [
                10461,
                10487
            ],
            [
                10487,
                10576
            ],
            [
                10576,
                10622
            ],
            [
                10622,
                10640
            ],
            [
                10640,
                10687
            ],
            [
                10687,
                10753
            ],
            [
                10753,
                10825
            ],
            [
                10825,
                10886
            ],
            [
                10886,
                10919
            ],
            [
                10919,
                10969
            ],
            [
                10969,
                11110
            ]
        ],
        "overlap_chars": [
            [
                0,
                87
            ],
            [
                87,
                110
            ],
            [
                111,
                150
            ],
            [
                156,
                158
            ],
            [
                159,
                168
            ],
            [
                168,
                176
            ],
            [
                177,
                227
            ],
            [
                228,
                250
            ],
            [
                251,
                346
            ],
            [
                347,
                405
            ],
            [
                414,
                416
            ],
            [
                416,
                426
            ],
            [
                427,
                429
            ],
            [
                430,
                434
            ],
            [
                440,
                455
            ],
            [
                456,
                494
            ],
            [
                503,
                509
            ],
            [
                509,
                510
            ],
            [
                517,
                520
            ],
            [
                529,
                552
            ],
            [
                553,
                560
            ],
            [
                574,
                581
            ],
            [
                582,
                589
            ],
            [
                589,
                600
            ],
            [
                608,
                661
            ],
            [
                662,
                673
            ],
            [
                674,
                710
            ],
            [
                710,
                723
            ],
            [
                724,
                740
            ],
            [
                741,
                744
            ],
            [
                745,
                761
            ],
            [
                761,
                762
            ],
            [
                768,
                771
            ],
            [
                772,
                775
            ],
            [
                783,
                792
            ],
            [
                795,
                804
            ],
            [
                810,
                814
            ],
            [
                815,
                822
            ],
            [
                823,
                854
            ],
            [
                854,
                857
            ],
            [
                866,
                872
            ],
            [
                881,
                969
            ],
            [
                970,
                982
            ],
            [
                982,
                1017
            ],
            [
                1023,
                1082
            ],
            [
                1083,
                1098
            ],
            [
                1099,
                1103
            ],
            [
                1104,
                1174
            ],
            [
                1174,
                1189
            ],
            [
                1189,
                1262
            ],
            [
                1273,
                1277
            ],
            [
                1277,
                1279
            ],
            [
                1279,
                1426
            ],
            [
                1427,
                1493
            ],
            [
                1498,
                1511
            ],
            [
                1511,
                1540
            ],
            [
                1541,
                1544
            ],
            [
                1568,
                1585
            ],
            [
                1585,
                1587
            ],
            [
                1587,
                1644
            ],
            [
                1644,
                1650
            ],
            [
                1651,
                1741
            ],
            [
                1742,
                1797
            ],
            [
                1798,
                1803
            ],
            [
                1809,
                1820
            ],
            [
                1821,
                1876
            ],
            [
                1876,
                1889
            ],
            [
                1894,
                1934
            ],
            [
                1943,
                1949
            ],
            [
                1949,
                1950
            ],
            [
                1951,
                1975
            ],
            [
                1977,
                2010
            ],
            [
                2010,
                2017
            ],
            [
                2019,
                2060
            ],
            [
                2070,
                2092
            ],
            [
                2093,
                2129
            ],
            [
                2130,
                2175
            ],
            [
                2175,
                2193
            ],
            [
                2193,
                2311
            ],
            [
                2312,
                2326
            ],
            [
                2327,
                2401
            ],
            [
                2401,
                2439
            ],
            [
                2439,
                2500
            ],
            [
                2501,
                2539
            ],
            [
                2539,
                2603
            ],
            [
                2604,
                2607
            ],
            [
                2611,
                2614
            ],
            [
                2621,
                2625
            ],
            [
                2626,
                2665
            ],
            [
                2673,
                2675
            ],
            [
                2675,
                2679
            ],
            [
                2680,
                2738
            ],
            [
                2749,
                2769
            ],
            [
                2780,
                2785
            ],
            [
                2786,
                2803
            ],
            [
                2809,
                2851
            ],
            [
                2851,
                2883
            ],
            [
                2884,
                2969
            ],
            [
                2970,
                3026
            ],
            [
                3026,
                3029
            ],
            [
                3037,
                3045
            ],
            [
                3045,
                3050
            ],
            [
                3051,
                3073
            ],
            [
                3073,
                3076
            ],
            [
                3077,
                3104
            ],
            [
                3118,
                3179
            ],
            [
                3180,
                3187
            ],
            [
                3195,
                3284
            ],
            [
                3284,
                3329
            ],
            [
                3330,
                3347
            ],
            [
                3373,
                3375
            ],
            [
                3397,
                3418
            ],
            [
                3419,
                3422
            ],
            [
                3423,
                3448
            ],
            [
                3448,
                3449
            ],
            [
                3450,
                3452
            ],
            [
                3457,
                3497
            ],
            [
                3497,
                3563
            ],
            [
                3568,
                3573
            ],
            [
                3574,
                3586
            ],
            [
                3586,
                3588
            ],
            [
                3588,
                3592
            ],
            [
                3593,
                3610
            ],
            [
                3611,
                3614
            ],
            [
                3615,
                3752
            ],
            [
                3752,
                3770
            ],
            [
                3771,
                3776
            ],
            [
                3777,
                3785
            ],
            [
                3786,
                3792
            ],
            [
                3802,
                3803
            ],
            [
                3804,
                3816
            ],
            [
                3817,
                3824
            ],
            [
                3825,
                3850
            ],
            [
                3850,
                3854
            ],
            [
                3858,
                3864
            ],
            [
                3865,
                3872
            ],
            [
                3873,
                3896
            ],
            [
                3897,
                3955
            ],
            [
                3956,
                3971
            ],
            [
                3972,
                3976
            ],
            [
                3977,
                3991
            ],
            [
                3992,
                4021
            ],
            [
                4022,
                4024
            ],
            [
                4025,
                4048
            ],
            [
                4052,
                4080
            ],
            [
                4080,
                4086
            ],
            [
                4109,
                4110
            ],
            [
                4111,
                4159
            ],
            [
                4160,
                4185
            ],
            [
                4187,
                4189
            ],
            [
                4197,
                4199
            ],
            [
                4205,
                4295
            ],
            [
                4296,
                4313
            ],
            [
                4316,
                4320
            ],
            [
                4321,
                4412
            ],
            [
                4429,
                4493
            ],
            [
                4494,
                4497
            ],
            [
                4498,
                4504
            ],
            [
                4508,
                4515
            ],
            [
                4516,
                4531
            ],
            [
                4531,
                4561
            ],
            [
                4569,
                4582
            ],
            [
                4583,
                4615
            ],
            [
                4615,
                4635
            ],
            [
                4636,
                4747
            ],
            [
                4770,
                4772
            ],
            [
                4789,
                4791
            ],
            [
                4791,
                4799
            ],
            [
                4800,
                4805
            ],
            [
                4806,
                4818
            ],
            [
                4819,
                4889
            ],
            [
                4889,
                4923
            ],
            [
                4923,
                4969
            ],
            [
                4977,
                5054
            ],
            [
                5062,
                5155
            ],
            [
                5156,
                5161
            ],
            [
                5161,
                5163
            ],
            [
                5163,
                5175
            ],
            [
                5179,
                5279
            ],
            [
                5286,
                5324
            ],
            [
                5329,
                5363
            ],
            [
                5363,
                5405
            ],
            [
                5412,
                5476
            ],
            [
                5476,
                5492
            ],
            [
                5498,
                5523
            ],
            [
                5523,
                5601
            ],
            [
                5602,
                5632
            ],
            [
                5632,
                5663
            ],
            [
                5663,
                5664
            ],
            [
                5665,
                5727
            ],
            [
                5728,
                5731
            ],
            [
                5732,
                5737
            ],
            [
                5740,
                5748
            ],
            [
                5763,
                5777
            ],
            [
                5784,
                5810
            ],
            [
                5810,
                5812
            ],
            [
                5812,
                5869
            ],
            [
                5869,
                5871
            ],
            [
                5878,
                5940
            ],
            [
                5947,
                5974
            ],
            [
                5984,
                5987
            ],
            [
                5988,
                6004
            ],
            [
                6005,
                6008
            ],
            [
                6009,
                6024
            ],
            [
                6031,
                6033
            ],
            [
                6033,
                6097
            ],
            [
                6098,
                6144
            ],
            [
                6144,
                6166
            ],
            [
                6167,
                6177
            ],
            [
                6178,
                6232
            ],
            [
                6232,
                6269
            ],
            [
                6272,
                6278
            ],
            [
                6282,
                6308
            ],
            [
                6309,
                6381
            ],
            [
                6381,
                6408
            ],
            [
                6420,
                6446
            ],
            [
                6447,
                6486
            ],
            [
                6487,
                6490
            ],
            [
                6491,
                6509
            ],
            [
                6509,
                6530
            ],
            [
                6531,
                6535
            ],
            [
                6541,
                6544
            ],
            [
                6545,
                6577
            ],
            [
                6578,
                6588
            ],
            [
                6592,
                6602
            ],
            [
                6602,
                6604
            ],
            [
                6614,
                6620
            ],
            [
                6621,
                6627
            ],
            [
                6627,
                6628
            ],
            [
                6633,
                6636
            ],
            [
                6637,
                6647
            ],
            [
                6648,
                6651
            ],
            [
                6658,
                6662
            ],
            [
                6669,
                6680
            ],
            [
                6680,
                6682
            ],
            [
                6682,
                6758
            ],
            [
                6758,
                6803
            ],
            [
                6811,
                6819
            ],
            [
                6822,
                6840
            ],
            [
                6847,
                6863
            ],
            [
                6866,
                6891
            ],
            [
                6892,
                6901
            ],
            [
                6911,
                6923
            ],
            [
                6927,
                6931
            ],
            [
                6933,
                6934
            ],
            [
                6934,
                6968
            ],
            [
                6968,
                7010
            ],
            [
                7010,
                7032
            ],
            [
                7032,
                7055
            ],
            [
                7055,
                7058
            ],
            [
                7069,
                7077
            ],
            [
                7077,
                7079
            ],
            [
                7079,
                7123
            ],
            [
                7123,
                7204
            ],
            [
                7204,
                7271
            ],
            [
                7272,
                7290
            ],
            [
                7290,
                7309
            ],
            [
                7309,
                7319
            ],
            [
                7319,
                7355
            ],
            [
                7355,
                7411
            ],
            [
                7411,
                7433
            ],
            [
                7433,
                7469
            ],
            [
                7469,
                7611
            ],
            [
                7611,
                7642
            ],
            [
                7642,
                7691
            ],
            [
                7691,
                7692
            ],
            [
                7696,
                7705
            ],
            [
                7711,
                7723
            ],
            [
                7724,
                7750
            ],
            [
                7750,
                7779
            ],
            [
                7782,
                7854
            ],
            [
                7854,
                7902
            ],
            [
                7905,
                7906
            ],
            [
                7906,
                7921
            ],
            [
                7921,
                7935
            ],
            [
                7935,
                7937
            ],
            [
                7937,
                7974
            ],
            [
                7974,
                8020
            ],
            [
                8020,
                8030
            ],
            [
                8030,
                8031
            ],
            [
                8034,
                8048
            ],
            [
                8048,
                8051
            ],
            [
                8057,
                8072
            ],
            [
                8072,
                8090
            ],
            [
                8090,
                8146
            ],
            [
                8146,
                8183
            ],
            [
                8183,
                8227
            ],
            [
                8228,
                8238
            ],
            [
                8238,
                8282
            ],
            [
                8296,
                8298
            ],
            [
                8298,
                8359
            ],
            [
                8360,
                8370
            ],
            [
                8370,
                8433
            ],
            [
                8433,
                8472
            ],
            [
                8472,
                8477
            ],
            [
                8478,
                8514
            ],
            [
                8514,
                8525
            ],
            [
                8525,
                8546
            ],
            [
                8547,
                8594
            ],
            [
                8599,
                8616
            ],
            [
                8616,
                8646
            ],
            [
                8647,
                8658
            ],
            [
                8658,
                8692
            ],
            [
                8692,
                8708
            ],
            [
                8708,
                8770
            ],
            [
                8770,
                8801
            ],
            [
                8801,
                8825
            ],
            [
                8828,
                8878
            ],
            [
                8878,
                8879
            ],
            [
                8889,
                8905
            ],
            [
                8907,
                8944
            ],
            [
                8944,
                8985
            ],
            [
                8985,
                8987
            ],
            [
                8987,
                9013
            ],
            [
                9013,
                9082
            ],
            [
                9087,
                9089
            ],
            [
                9089,
                9109
            ],
            [
                9110,
                9124
            ],
            [
                9125,
                9145
            ],
            [
                9146,
                9157
            ],
            [
                9158,
                9160
            ],
            [
                9166,
                9177
            ],
            [
                9177,
                9219
            ],
            [
                9220,
                9245
            ],
            [
                9245,
                9261
            ],
            [
                9262,
                9310
            ],
            [
                9311,
                9347
            ],
            [
                9350,
                9351
            ],
            [
                9359,
                9377
            ],
            [
                9380,
                9386
            ],
            [
                9397,
                9399
            ],
            [
                9409,
                9431
            ],
            [
                9432,
                9499
            ],
            [
                9500,
                9501
            ],
            [
                9501,
                9526
            ],
            [
                9530,
                9531
            ],
            [
                9532,
                9562
            ],
            [
                9562,
                9564
            ],
            [
                9564,
                9565
            ],
            [
                9565,
                9576
            ],
            [
                9577,
                9589
            ],
            [
                9590,
                9621
            ],
            [
                9622,
                9625
            ],
            [
                9626,
                9631
            ],
            [
                9632,
                9636
            ],
            [
                9636,
                9639
            ],
            [
                9639,
                9682
            ],
            [
                9694,
                9704
            ],
            [
                9705,
                9711
            ],
            [
                9712,
                9732
            ],
            [
                9733,
                9739
            ],
            [
                9740,
                9744
            ],
            [
                9745,
                9768
            ],
            [
                9768,
                9791
            ],
            [
                9792,
                9814
            ],
            [
                9815,
                9829
            ],
            [
                9833,
                9836
            ],
            [
                9837,
                9862
            ],
            [
                9868,
                9902
            ],
            [
                9903,
                9920
            ],
            [
                9920,
                9922
            ],
            [
                9927,
                9941
            ],
            [
                9941,
                9945
            ],
            [
                9951,
                9959
            ],
            [
                9959,
                9960
            ],
            [
                9961,
                9963
            ],
            [
                9964,
                9969
            ],
            [
                9970,
                9988
            ],
            [
                9991,
                10035
            ],
            [
                10035,
                10037
            ],
            [
                10037,
                10057
            ],
            [
                10058,
                10061
            ],
            [
                10062,
                10063
            ],
            [
                10069,
                10081
            ],
            [
                10091,
                10110
            ],
            [
                10111,
                10160
            ],
            [
                10168,
                10180
            ],
            [
                10184,
                10198
            ],
            [
                10204,
                10302
            ],
            [
                10302,
                10347
            ],
            [
                10348,
                10358
            ],
            [
                10362,
                10369
            ],
            [
                10369,
                10404
            ],
            [
                10410,
                10436
            ],
            [
                10436,
                10438
            ],
            [
                10438,
                10461
            ],
            [
                10461,
                10487
            ],
            [
                10487,
                10521
            ],
            [
                10522,
                10539
            ],
            [
                10540,
                10576
            ],
            [
                10576,
                10622
            ],
            [
                10622,
                10640
            ],
            [
                10640,
                10687
            ],
            [
                10687,
                10753
            ],
            [
                10753,
                10765
            ],
            [
                10766,
                10772
            ],
            [
                10773,
                10825
            ],
            [
                10825,
                10843
            ],
            [
                10846,
                10886
            ],
            [
                10886,
                10917
            ],
            [
                10917,
                10919
            ],
            [
                10919,
                10969
            ],
            [
                10969,
                10988
            ],
            [
                10989,
                10997
            ],
            [
                10998,
                11008
            ],
            [
                11008,
                11110
            ]
        ],
        "row_chars": [
            [
                0,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                87
            ],
            [
                87,
                228
            ],
            [
                228,
                416
            ],
            [
                416,
                553
            ],
            [
                553,
                710
            ],
            [
                710,
                854
            ],
            [
                854,
                854
            ],
            [
                854,
                982
            ],
            [
                982,
                1174
            ],
            [
                1174,
                1279
            ],
            [
                1279,
                1279
            ],
            [
                1279,
                1427
            ],
            [
                1427,
                1427
            ],
            [
                1427,
                1511
            ],
            [
                1511,
                1587
            ],
            [
                1587,
                1644
            ],
            [
                1644,
                1798
            ],
            [
                1798,
                1876
            ],
            [
                1876,
                2010
            ],
            [
                2010,
                2175
            ],
            [
                2175,
                2401
            ],
            [
                2401,
                2439
            ],
            [
                2439,
                2539
            ],
            [
                2539,
                2604
            ],
            [
                2604,
                2675
            ],
            [
                2675,
                2851
            ],
            [
                2851,
                2970
            ],
            [
                2970,
                3026
            ],
            [
                3026,
                3073
            ],
            [
                3073,
                3104
            ],
            [
                3104,
                3284
            ],
            [
                3284,
                3284
            ],
            [
                3284,
                3284
            ],
            [
                3284,
                3284
            ],
            [
                3284,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3450
            ],
            [
                3450,
                3497
            ],
            [
                3497,
                3588
            ],
            [
                3588,
                3752
            ],
            [
                3752,
                3850
            ],
            [
                3850,
                3956
            ],
            [
                3956,
                3956
            ],
            [
                3956,
                3956
            ],
            [
                3956,
                3956
            ],
            [
                3956,
                3956
            ],
            [
                3956,
                4080
            ],
            [
                4080,
                4111
            ],
            [
                4111,
                4296
            ],
            [
                4296,
                4583
            ],
            [
                4583,
                4615
            ],
            [
                4615,
                4791
            ],
            [
                4791,
                4889
            ],
            [
                4889,
                4889
            ],
            [
                4889,
                4923
            ],
            [
                4923,
                5163
            ],
            [
                5163,
                5363
            ],
            [
                5363,
                5476
            ],
            [
                5476,
                5523
            ],
            [
                5523,
                5632
            ],
            [
                5632,
                5812
            ],
            [
                5812,
                5869
            ],
            [
                5869,
                6033
            ],
            [
                6033,
                6098
            ],
            [
                6098,
                6144
            ],
            [
                6144,
                6232
            ],
            [
                6232,
                6272
            ],
            [
                6272,
                6272
            ],
            [
                6272,
                6381
            ],
            [
                6381,
                6509
            ],
            [
                6509,
                6578
            ],
            [
                6578,
                6602
            ],
            [
                6602,
                6682
            ],
            [
                6682,
                6682
            ],
            [
                6682,
                6758
            ],
            [
                6758,
                6803
            ],
            [
                6803,
                6892
            ],
            [
                6892,
                6968
            ],
            [
                6968,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7032
            ],
            [
                7032,
                7055
            ],
            [
                7055,
                7079
            ],
            [
                7079,
                7079
            ],
            [
                7079,
                7123
            ],
            [
                7123,
                7204
            ],
            [
                7204,
                7272
            ],
            [
                7272,
                7272
            ],
            [
                7272,
                7290
            ],
            [
                7290,
                7309
            ],
            [
                7309,
                7355
            ],
            [
                7355,
                7433
            ],
            [
                7433,
                7469
            ],
            [
                7469,
                7611
            ],
            [
                7611,
                7642
            ],
            [
                7642,
                7691
            ],
            [
                7691,
                7750
            ],
            [
                7750,
                7782
            ],
            [
                7782,
                7782
            ],
            [
                7782,
                7854
            ],
            [
                7854,
                7905
            ],
            [
                7905,
                7921
            ],
            [
                7921,
                7937
            ],
            [
                7937,
                7974
            ],
            [
                7974,
                8020
            ],
            [
                8020,
                8030
            ],
            [
                8030,
                8048
            ],
            [
                8048,
                8072
            ],
            [
                8072,
                8090
            ],
            [
                8090,
                8146
            ],
            [
                8146,
                8183
            ],
            [
                8183,
                8238
            ],
            [
                8238,
                8298
            ],
            [
                8298,
                8370
            ],
            [
                8370,
                8433
            ],
            [
                8433,
                8472
            ],
            [
                8472,
                8514
            ],
            [
                8514,
                8525
            ],
            [
                8525,
                8658
            ],
            [
                8658,
                8692
            ],
            [
                8692,
                8708
            ],
            [
                8708,
                8770
            ],
            [
                8770,
                8801
            ],
            [
                8801,
                8878
            ],
            [
                8878,
                8907
            ],
            [
                8907,
                8907
            ],
            [
                8907,
                8907
            ],
            [
                8907,
                8944
            ],
            [
                8944,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                9013
            ],
            [
                9013,
                9089
            ],
            [
                9089,
                9177
            ],
            [
                9177,
                9245
            ],
            [
                9245,
                9347
            ],
            [
                9347,
                9347
            ],
            [
                9347,
                9347
            ],
            [
                9347,
                9347
            ],
            [
                9347,
                9347
            ],
            [
                9347,
                9347
            ],
            [
                9347,
                9347
            ],
            [
                9347,
                9380
            ],
            [
                9380,
                9500
            ],
            [
                9500,
                9564
            ],
            [
                9564,
                9639
            ],
            [
                9639,
                9768
            ],
            [
                9768,
                9829
            ],
            [
                9829,
                9829
            ],
            [
                9829,
                9829
            ],
            [
                9829,
                9920
            ],
            [
                9920,
                9941
            ],
            [
                9941,
                10037
            ],
            [
                10037,
                10111
            ],
            [
                10111,
                10199
            ],
            [
                10199,
                10199
            ],
            [
                10199,
                10199
            ],
            [
                10199,
                10199
            ],
            [
                10199,
                10302
            ],
            [
                10302,
                10369
            ],
            [
                10369,
                10438
            ],
            [
                10438,
                10461
            ],
            [
                10461,
                10487
            ],
            [
                10487,
                10576
            ],
            [
                10576,
                10622
            ],
            [
                10622,
                10640
            ],
            [
                10640,
                10687
            ],
            [
                10687,
                10753
            ],
            [
                10753,
                10825
            ],
            [
                10825,
                10886
            ],
            [
                10886,
                10919
            ],
            [
                10919,
                10919
            ],
            [
                10919,
                10969
            ],
            [
                10969,
                11110
            ]
        ]
    }
}