{
    "original": {
        "text": "It does sometimes occur in life that an unambitious man, who is in no degree given to enterprises, who would fain be safe, is driven by the cruelty of circumstances into a position in which he must choose a side, and in which, though he has no certain guide as to which side he should choose, he is aware that he will be disgraced if he should take the wrong side. This was felt as a hardship by many who were quite suddenly forced to make up their mind whether they would go to Melmotte's dinner, or join themselves to the faction of those who had determined to stay away although they had accepted invitations. Some there were not without a suspicion that the story against Melmotte had been got up simply as an electioneering trick,--so that Mr. Alf might carry the borough on the next day. As a dodge for an election this might be very well, but any who might be deterred by such a manoeuvre from meeting the Emperor and supporting the Prince would surely be marked men. And none of the wives, when they were consulted, seemed to care a straw whether Melmotte was a swindler or not. Would the Emperor and the Princes and Princesses be there? This was the only question which concerned them. They did not care whether Melmotte was arrested at the dinner or after the dinner, so long as they, with others, could show their diamonds in the presence of eastern and western royalty. But yet,--what a fiasco would it be, if at this very instant of time the host should be apprehended for common forgery! The great thing was to ascertain whether others were going. If a hundred or more out of the two hundred were to be absent how dreadful would be the position of those who were present! And how would the thing go if at the last moment the Emperor should be kept away? The Prime Minister had decided that the Emperor and the Prince should remain altogether in ignorance of the charges which were preferred against the man; but of that these doubters were unaware. There was but little time for a man to go about town and pick up the truth from those who were really informed; and questions were asked in an uncomfortable and restless manner. \"Is your Grace going?\" said Lionel Lupton to the Duchess of Stevenage,--having left the House and gone into the park between six and seven to pick up some hints among those who were known to have been invited. The Duchess was Lord Alfred's sister, and of course she was going. \"I usually keep engagements when I make them, Mr. Lupton,\" said the Duchess. She had been assured by Lord Alfred not a quarter of an hour before that everything was as straight as a die. Lord Alfred had not then even heard of the rumour. But ultimately both Lionel Lupton and Beauchamp Beauclerk attended the dinner. They had received special tickets as supporters of Mr. Melmotte at the election,--out of the scanty number allotted to that gentleman himself,--and they thought themselves bound in honour to be there. But they, with their leader, and one other influential member of the party, were all who at last came as the political friends of the candidate for Westminster. The existing ministers were bound to attend to the Emperor and the Prince. But members of the Opposition, by their presence, would support the man and the politician, and both as a man and as a politician they were ashamed of him.\nWhen Melmotte arrived at his own door with his wife and daughter he had heard nothing of the matter. That a man so vexed with affairs of money, so laden with cares, encompassed by such dangers, should be free from suspicion and fear it is impossible to imagine. That such burdens should be borne at all is a wonder to those whose shoulders have never been broadened for such work;--as is the strength of the blacksmith's arm to men who have never wielded a hammer. Surely his whole life must have been a life of terrors! But of any special peril to which he was at that moment subject, or of any embarrassment which might affect the work of the evening, he knew nothing. He placed his wife in the drawing-room and himself in the hall, and arranged his immediate satellites around him,--among whom were included the two Grendalls, young Nidderdale, and Mr. Cohenlupe,--with a feeling of gratified glory. Nidderdale down at the House had heard the rumour, but had determined that he would not as yet fly from his colours. Cohenlupe had also come up from the House, where no one had spoken to him. Though grievously frightened during the last fortnight, he had not dared to be on the wing as yet. And, indeed, to what clime could such a bird as he fly in safety? He had not only heard,--but also knew very much, and was not prepared to enjoy the feast. Since they had been in the hall Miles had spoken dreadful words to his father. \"You've heard about it; haven't you?\" whispered Miles. Lord Alfred, remembering his sister's question, became almost pale, but declared that he had heard nothing. \"They're saying all manner of things in the City;--forgery and heaven knows what. The Lord Mayor is not coming.\" Lord Alfred made no reply. It was the philosophy of his life that misfortunes when they came should be allowed to settle themselves. But he was unhappy.\nThe grand arrivals were fairly punctual, and the very grand people all came. The unfortunate Emperor,--we must consider a man to be unfortunate who is compelled to go through such work as this,--with impassible and awful dignity, was marshalled into the room on the ground floor, whence he and other royalties were to be marshalled back into the banqueting hall. Melmotte, bowing to the ground, walked backwards before him, and was probably taken by the Emperor for some Court Master of the Ceremonies especially selected to walk backwards on this occasion. The Princes had all shaken hands with their host, and the Princesses had bowed graciously. Nothing of the rumour had as yet been whispered in royal palaces. Besides royalty the company allowed to enter the room downstairs was very select. The Prime Minister, one archbishop, two duchesses, and an ex-governor of India with whose features the Emperor was supposed to be peculiarly familiar, were alone there. The remainder of the company, under the superintendence of Lord Alfred, were received in the drawing-room above. Everything was going on well, and they who had come and had thought of not coming were proud of their wisdom.\nBut when the company was seated at dinner the deficiencies were visible enough, and were unfortunate. Who does not know the effect made by the absence of one or two from a table intended for ten or twelve,--how grievous are the empty places, how destructive of the outward harmony and grace which the hostess has endeavoured to preserve are these interstices, how the lady in her wrath declares to herself that those guilty ones shall never have another opportunity of filling a seat at her table? Some twenty, most of whom had been asked to bring their wives, had slunk from their engagements, and the empty spaces were sufficient to declare a united purpose. A week since it had been understood that admission for the evening could not be had for love or money, and that a seat at the dinner-table was as a seat at some banquet of the gods! Now it looked as though the room were but half-filled. There were six absences from the City. Another six of Mr. Melmotte's own political party were away. The archbishops and the bishop were there, because bishops never hear worldly tidings till after other people;--but that very Master of the Buckhounds for whom so much pressure had been made did not come. Two or three peers were absent, and so also was that editor who had been chosen to fill Mr. Alf's place. One poet, two painters, and a philosopher had received timely notice at their clubs, and had gone home. The three independent members of the House of Commons for once agreed in their policy, and would not lend the encouragement of their presence to a man suspected of forgery. Nearly forty places were vacant when the business of the dinner commenced.\nMelmotte had insisted that Lord Alfred should sit next to himself at the big table, and having had the objectionable bar removed, and his own chair shoved one step nearer to the centre, had carried his. point. With the anxiety natural to such an occasion, he glanced repeatedly round the hall, and of course became aware that many were absent. \"How is it that there are so many places empty?\" he said to his faithful Achates.\n\"Don't know,\" said Achates, shaking his head, steadfastly refusing to look round upon the hall.\nMelmotte waited awhile, then looked round again, and asked the question in another shape: \"Hasn't there been some mistake about the numbers? There's room for ever so many more.\"\n\"Don't know,\" said Lord Alfred, who was unhappy in his mind, and repenting himself that he had ever seen Mr. Melmotte.\n\"What the deuce do you mean?\" whispered Melmotte. \"You've been at it from the beginning and ought to know. When I wanted to ask Brehgert, you swore that you couldn't squeeze a place.\"\n\"Can't say anything about it,\" said Lord Alfred, with his eyes fixed upon his plate.\n\"I'll be d---- if I don't find out,\" said Melmotte. \"There's either some horrible blunder, or else there's been imposition. I don't see quite clearly. Where's Sir Gregory Gribe?\"\n\"Hasn't come, I suppose.\"\n\"And where's the Lord Mayor?\" Melmotte, in spite of royalty, was now sitting with his face turned round upon the hall. \"I know all their places, and I know where they were put. Have you seen the Lord Mayor?\"\n\"No; I haven't seen him at all.\"\n\"But he was to come. What's the meaning of it, Alfred?\"\n\"Don't know anything about it.\" He shook his head but would not, for even a moment, look round upon the room.\n\"And where's Mr. Killegrew,--and Sir David Boss?\" Mr. Killegrew and Sir David were gentlemen of high standing, and destined for important offices in the Conservative party. \"There are ever so many people not here. Why, there's not above half of them down the room. What's up, Alfred? I must know.\"\n\"I tell you I know nothing. I could not make them come.\" Lord Alfred's answers were made not only with a surly voice, but also with a surly heart. He was keenly alive to the failure, and alive also to the feeling that the failure would partly be attached to himself. At the present moment he was anxious to avoid observation, and it seemed to him that Melmotte, by the frequency and impetuosity of his questions, was drawing special attention to him. \"If you go on making a row,\" he said, \"I shall go away.\" Melmotte looked at him with all his eyes. \"Just sit quiet and let the thing go on. You'll know all about it soon enough.\" This was hardly the way to give Mr. Melmotte peace of mind. For a few minutes he did sit quiet. Then he got up and moved down the hall behind the guests.\nIn the meantime, Imperial Majesty and Royalties of various denominations ate their dinner, without probably observing those Banquo's seats. As the Emperor talked Manchoo only, and as there was no one present who could even interpret Manchoo into English,--the imperial interpreter condescending only to interpret Manchoo into ordinary Chinese which had to be reinterpreted,--it was not within his Imperial Majesty's power to have much conversation with his neighbours. And as his neighbours on each side of him were all cousins and husbands, and brothers and wives, who saw each constantly under, let us presume, more comfortable circumstances, they had not very much to say to each other. Like most of us, they had their duties to do, and, like most of us, probably found their duties irksome. The brothers and sisters and cousins were used to it; but that awful Emperor, solid, solemn, and silent, must, if the spirit of an Eastern Emperor be at all like that of a Western man, have had a weary time of it. He sat there for more than two hours, awful, solid, solemn, and silent, not eating very much,--for this was not his manner of eating; nor drinking very much,--for this was not his manner of drinking; but wondering, no doubt, within his own awful bosom, at the changes which were coming when an Emperor of China was forced, by outward circumstances, to sit and hear this buzz of voices and this clatter of knives and forks. \"And this,\" he must have said to himself, \"is what they call royalty in the West!\" If a prince of our own was forced, for the good of the country, to go among some far distant outlandish people, and there to be poked in the ribs, and slapped on the back all round, the change to him could hardly be so great.\n\"Where's Sir Gregory?\" said Melmotte, in a hoarse whisper, bending over the chair of a City friend. It was old Todd, the senior partner of Todd, Brehgert, and Goldsheiner. Mr. Todd was a very wealthy man, and had a considerable following in the City.\n\"Ain't he here?\" said Todd,--knowing very well who had come from the City and who had declined.\n\"No;--and the Lord Mayor's not come;--nor Postlethwaite, nor Bunter. What's the meaning of it?\"\nTodd looked first at one neighbour and then at another before he answered. \"I'm here, that's all I can say, Mr. Melmotte; and I've had a very good dinner. They who haven't come, have lost a very good dinner.\"\nThere was a weight upon Melmotte's mind of which he could not rid himself. He knew from the old man's manner, and he knew also from Lord Alfred's manner, that there was something which each of them could tell him if he would. But he was unable to make the men open their mouths. And yet it might be so important to him that he should know! \"It's very odd,\" he said, \"that gentlemen should promise to come and then stay away. There were hundreds anxious to be present whom I should have been glad to welcome, if I had known that there would be room. I think it is very odd.\"\n\"It is odd,\" said Mr. Todd, turning his attention to the plate before him.\nMelmotte had lately seen much of Beauchamp Beauclerk, in reference to the coming election. Passing back up the table, he found the gentleman with a vacant seat on one side of him. There were many vacant seats in this part of the room, as the places for the Conservative gentlemen had been set apart together. There Mr. Melmotte seated himself for a minute, thinking that he might get the truth from his new ally. Prudence should have kept him silent. Let the cause of these desertions have been what it might, it ought to have been clear to him that he could apply no remedy to it now. But he was bewildered and dismayed, and his mind within him was changing at every moment. He was now striving to trust to his arrogance and declaring that nothing should cow him. And then again he was so cowed that he was ready to creep to any one for assistance. Personally, Mr. Beauclerk had disliked the man greatly. Among the vulgar, loud upstarts whom he had known, Melmotte was the vulgarest, the loudest, and the most arrogant. But he had taken the business of Melmotte's election in hand, and considered himself bound to stand by Melmotte till that was over; and he was now the guest of the man in his own house, and was therefore constrained to courtesy. His wife was sitting by him, and he at once introduced her to Mr. Melmotte. \"You have a wonderful assemblage here, Mr. Melmotte,\" said the lady, looking up at the royal table.\n\"Yes, ma'am, yes. His Majesty the Emperor has been pleased to intimate that he has been much gratified.\"--Had the Emperor in truth said so, no one who looked at him could have believed his imperial word.--\"Can you tell me, Mr. Beauclerk, why those other gentlemen are not here? It looks very odd; does it not?\"\n\"Ah; you mean Killegrew.\"\n\"Yes; Mr. Killegrew and Sir David Boss, and the whole lot. I made a particular point of their coming. I said I wouldn't have the dinner at all unless they were to be asked. They were going to make it a Government thing; but I said no. I insisted on the leaders of our own party; and now they're not here. I know the cards were sent;--and, by George, I have their answers, saying they'd come.\"\n\"I suppose some of them are engaged,\" said Mr. Beauclerk.\n\"Engaged! What business has a man to accept one engagement and then take another? And, if so, why shouldn't he write and make his excuses? No, Mr. Beauclerk, that won't go down.\"\n\"I'm here, at any rate,\" said Beauclerk, making the very answer that had occurred to Mr. Todd.\n\"Oh, yes, you're here. You're all right. But what is it, Mr. Beauclerk? There's something up, and you must have heard.\" And so it was clear to Mr. Beauclerk that the man knew nothing about it himself. If there was anything wrong, Melmotte was not aware that the wrong had been discovered. \"Is it anything about the election to-morrow?\"\n\"One never can tell what is actuating people,\" said Mr. Beauclerk.\n\"If you know anything about the matter I think you ought to tell me.\"\n\"I know nothing except that the ballot will be taken to-morrow. You and I have got nothing more to do in the matter except to wait the result.\"\n\"Well; I suppose it's all right,\" said Melmotte, rising and going back to his seat. But he knew that things were not all right. Had his political friends only been absent, he might have attributed their absence to some political cause which would not have touched him deeply. But the treachery of the Lord Mayor and of Sir Gregory Gribe was a blow. For another hour after he had returned to his place, the Emperor sat solemn in his chair; and then, at some signal given by some one, he was withdrawn. The ladies had already left the room about half an hour. According to the programme arranged for the evening, the royal guests were to return to the smaller room for a cup of coffee, and were then to be paraded upstairs before the multitude who would by that time have arrived, and to remain there long enough to justify the invited ones in saying that they had spent the evening with the Emperor and the Princes and the Princesses. The plan was carried out perfectly. At half-past ten the Emperor was made to walk upstairs, and for half an hour sat awful and composed in an arm-chair that had been prepared for him. How one would wish to see the inside of the mind of the Emperor as it worked on that occasion!\nMelmotte, when his guests ascended his stairs, went back into the banqueting-room and through to the hall, and wandered about till he found Miles Grendall. \"Miles,\" he said, \"tell me what the row is.\"\n\"How row?\" asked Miles.\n\"There's something wrong, and you know all about it. Why didn't the people come?\" Miles, looking guilty, did not even attempt to deny his knowledge. \"Come; what is it? We might as well know all about it at once.\" Miles looked down on the ground, and grunted something. \"Is it about the election?\"\n\"No, it's not that,\" said Miles.\n\"Then what is it?\"\n\"They got hold of something to-day in the City--about Pickering.\"\n\"They did, did they? And what were they saying about Pickering? Come; you might as well out with it. You don't suppose that I care what lies they tell.\"\n\"They say there's been something--forged. Title-deeds, I think they say.\"\n\"Title-deeds! that I have forged title-deeds. Well; that's beginning well. And his lordship has stayed away from my house after accepting my invitation because he has heard that story! All right, Miles; that will do.\" And the Great Financier went upstairs into his own drawing-room.",
        "paragraph_chars": [
            [
                0,
                3328
            ],
            [
                3328,
                5186
            ],
            [
                5186,
                6375
            ],
            [
                6375,
                8035
            ],
            [
                8035,
                8461
            ],
            [
                8461,
                8557
            ],
            [
                8557,
                8735
            ],
            [
                8735,
                8854
            ],
            [
                8854,
                9038
            ],
            [
                9038,
                9123
            ],
            [
                9123,
                9302
            ],
            [
                9302,
                9328
            ],
            [
                9328,
                9536
            ],
            [
                9536,
                9569
            ],
            [
                9569,
                9625
            ],
            [
                9625,
                9735
            ],
            [
                9735,
                10033
            ],
            [
                10033,
                10817
            ],
            [
                10817,
                12558
            ],
            [
                12558,
                12809
            ],
            [
                12809,
                12905
            ],
            [
                12905,
                13001
            ],
            [
                13001,
                13210
            ],
            [
                13210,
                13784
            ],
            [
                13784,
                13859
            ],
            [
                13859,
                15285
            ],
            [
                15285,
                15596
            ],
            [
                15596,
                15622
            ],
            [
                15622,
                16015
            ],
            [
                16015,
                16073
            ],
            [
                16073,
                16252
            ],
            [
                16252,
                16347
            ],
            [
                16347,
                16683
            ],
            [
                16683,
                16750
            ],
            [
                16750,
                16820
            ],
            [
                16820,
                16964
            ],
            [
                16964,
                18177
            ],
            [
                18177,
                18378
            ],
            [
                18378,
                18402
            ],
            [
                18402,
                18699
            ],
            [
                18699,
                18732
            ],
            [
                18732,
                18751
            ],
            [
                18751,
                18817
            ],
            [
                18817,
                18970
            ],
            [
                18970,
                19044
            ],
            [
                19044,
                19326
            ]
        ],
        "segment_chars": [
            [
                0,
                365
            ],
            [
                365,
                613
            ],
            [
                613,
                794
            ],
            [
                794,
                975
            ],
            [
                975,
                1087
            ],
            [
                1087,
                1146
            ],
            [
                1146,
                1195
            ],
            [
                1195,
                1382
            ],
            [
                1382,
                1502
            ],
            [
                1502,
                1562
            ],
            [
                1562,
                1686
            ],
            [
                1686,
                1768
            ],
            [
                1768,
                1963
            ],
            [
                1963,
                2141
            ],
            [
                2141,
                2164
            ],
            [
                2164,
                2351
            ],
            [
                2351,
                2418
            ],
            [
                2418,
                2495
            ],
            [
                2495,
                2605
            ],
            [
                2605,
                2656
            ],
            [
                2656,
                2735
            ],
            [
                2735,
                2936
            ],
            [
                2936,
                3097
            ],
            [
                3097,
                3172
            ],
            [
                3172,
                3328
            ],
            [
                3328,
                3429
            ],
            [
                3429,
                3590
            ],
            [
                3590,
                3793
            ],
            [
                3793,
                3849
            ],
            [
                3849,
                3999
            ],
            [
                3999,
                4231
            ],
            [
                4231,
                4348
            ],
            [
                4348,
                4423
            ],
            [
                4423,
                4522
            ],
            [
                4522,
                4588
            ],
            [
                4588,
                4678
            ],
            [
                4678,
                4757
            ],
            [
                4757,
                4795
            ],
            [
                4795,
                4812
            ],
            [
                4812,
                4920
            ],
            [
                4920,
                5002
            ],
            [
                5002,
                5033
            ],
            [
                5033,
                5060
            ],
            [
                5060,
                5166
            ],
            [
                5166,
                5186
            ],
            [
                5186,
                5263
            ],
            [
                5263,
                5549
            ],
            [
                5549,
                5744
            ],
            [
                5744,
                5835
            ],
            [
                5835,
                5901
            ],
            [
                5901,
                5983
            ],
            [
                5983,
                6152
            ],
            [
                6152,
                6265
            ],
            [
                6265,
                6375
            ],
            [
                6375,
                6477
            ],
            [
                6477,
                6873
            ],
            [
                6873,
                7036
            ],
            [
                7036,
                7218
            ],
            [
                7218,
                7273
            ],
            [
                7273,
                7312
            ],
            [
                7312,
                7373
            ],
            [
                7373,
                7578
            ],
            [
                7578,
                7683
            ],
            [
                7683,
                7787
            ],
            [
                7787,
                7960
            ],
            [
                7960,
                8035
            ],
            [
                8035,
                8238
            ],
            [
                8238,
                8245
            ],
            [
                8245,
                8379
            ],
            [
                8379,
                8428
            ],
            [
                8428,
                8461
            ],
            [
                8461,
                8557
            ],
            [
                8557,
                8698
            ],
            [
                8698,
                8735
            ],
            [
                8735,
                8854
            ],
            [
                8854,
                8884
            ],
            [
                8884,
                8904
            ],
            [
                8904,
                8961
            ],
            [
                8961,
                9038
            ],
            [
                9038,
                9123
            ],
            [
                9123,
                9175
            ],
            [
                9175,
                9247
            ],
            [
                9247,
                9274
            ],
            [
                9274,
                9302
            ],
            [
                9302,
                9328
            ],
            [
                9328,
                9358
            ],
            [
                9358,
                9447
            ],
            [
                9447,
                9505
            ],
            [
                9505,
                9536
            ],
            [
                9536,
                9569
            ],
            [
                9569,
                9590
            ],
            [
                9590,
                9625
            ],
            [
                9625,
                9657
            ],
            [
                9657,
                9735
            ],
            [
                9735,
                9785
            ],
            [
                9785,
                9908
            ],
            [
                9908,
                9949
            ],
            [
                9949,
                10000
            ],
            [
                10000,
                10019
            ],
            [
                10019,
                10033
            ],
            [
                10033,
                10061
            ],
            [
                10061,
                10090
            ],
            [
                10090,
                10180
            ],
            [
                10180,
                10300
            ],
            [
                10300,
                10484
            ],
            [
                10484,
                10541
            ],
            [
                10541,
                10583
            ],
            [
                10583,
                10624
            ],
            [
                10624,
                10663
            ],
            [
                10663,
                10723
            ],
            [
                10723,
                10759
            ],
            [
                10759,
                10817
            ],
            [
                10817,
                10957
            ],
            [
                10957,
                11286
            ],
            [
                11286,
                11507
            ],
            [
                11507,
                11612
            ],
            [
                11612,
                11826
            ],
            [
                11826,
                12249
            ],
            [
                12249,
                12332
            ],
            [
                12332,
                12558
            ],
            [
                12558,
                12581
            ],
            [
                12581,
                12658
            ],
            [
                12658,
                12730
            ],
            [
                12730,
                12809
            ],
            [
                12809,
                12826
            ],
            [
                12826,
                12905
            ],
            [
                12905,
                12974
            ],
            [
                12974,
                13001
            ],
            [
                13001,
                13076
            ],
            [
                13076,
                13156
            ],
            [
                13156,
                13210
            ],
            [
                13210,
                13285
            ],
            [
                13285,
                13436
            ],
            [
                13436,
                13489
            ],
            [
                13489,
                13550
            ],
            [
                13550,
                13635
            ],
            [
                13635,
                13759
            ],
            [
                13759,
                13784
            ],
            [
                13784,
                13859
            ],
            [
                13859,
                13950
            ],
            [
                13950,
                14039
            ],
            [
                14039,
                14168
            ],
            [
                14168,
                14272
            ],
            [
                14272,
                14310
            ],
            [
                14310,
                14445
            ],
            [
                14445,
                14535
            ],
            [
                14535,
                14624
            ],
            [
                14624,
                14709
            ],
            [
                14709,
                14765
            ],
            [
                14765,
                14880
            ],
            [
                14880,
                15109
            ],
            [
                15109,
                15185
            ],
            [
                15185,
                15285
            ],
            [
                15285,
                15303
            ],
            [
                15303,
                15389
            ],
            [
                15389,
                15563
            ],
            [
                15563,
                15596
            ],
            [
                15596,
                15622
            ],
            [
                15622,
                15681
            ],
            [
                15681,
                15724
            ],
            [
                15724,
                15795
            ],
            [
                15795,
                15857
            ],
            [
                15857,
                15927
            ],
            [
                15927,
                16015
            ],
            [
                16015,
                16073
            ],
            [
                16073,
                16083
            ],
            [
                16083,
                16155
            ],
            [
                16155,
                16212
            ],
            [
                16212,
                16252
            ],
            [
                16252,
                16347
            ],
            [
                16347,
                16370
            ],
            [
                16370,
                16388
            ],
            [
                16388,
                16419
            ],
            [
                16419,
                16467
            ],
            [
                16467,
                16548
            ],
            [
                16548,
                16636
            ],
            [
                16636,
                16683
            ],
            [
                16683,
                16750
            ],
            [
                16750,
                16820
            ],
            [
                16820,
                16884
            ],
            [
                16884,
                16964
            ],
            [
                16964,
                17048
            ],
            [
                17048,
                17092
            ],
            [
                17092,
                17240
            ],
            [
                17240,
                17313
            ],
            [
                17313,
                17465
            ],
            [
                17465,
                17522
            ],
            [
                17522,
                17898
            ],
            [
                17898,
                17934
            ],
            [
                17934,
                18082
            ],
            [
                18082,
                18177
            ],
            [
                18177,
                18333
            ],
            [
                18333,
                18378
            ],
            [
                18378,
                18389
            ],
            [
                18389,
                18402
            ],
            [
                18402,
                18455
            ],
            [
                18455,
                18484
            ],
            [
                18484,
                18551
            ],
            [
                18551,
                18570
            ],
            [
                18570,
                18615
            ],
            [
                18615,
                18671
            ],
            [
                18671,
                18699
            ],
            [
                18699,
                18732
            ],
            [
                18732,
                18751
            ],
            [
                18751,
                18817
            ],
            [
                18817,
                18838
            ],
            [
                18838,
                18881
            ],
            [
                18881,
                18918
            ],
            [
                18918,
                18970
            ],
            [
                18970,
                19012
            ],
            [
                19012,
                19044
            ],
            [
                19044,
                19058
            ],
            [
                19058,
                19090
            ],
            [
                19090,
                19119
            ],
            [
                19119,
                19229
            ],
            [
                19229,
                19262
            ],
            [
                19262,
                19326
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                8,
                17
            ],
            [
                32,
                55
            ],
            [
                123,
                132
            ],
            [
                165,
                211
            ],
            [
                213,
                216
            ],
            [
                227,
                236
            ],
            [
                3,
                7
            ],
            [
                264,
                274
            ],
            [
                83,
                85
            ],
            [
                285,
                343
            ],
            [
                349,
                358
            ],
            [
                363,
                365
            ],
            [
                365,
                378
            ],
            [
                393,
                409
            ],
            [
                416,
                500
            ],
            [
                563,
                572
            ],
            [
                611,
                612
            ],
            [
                613,
                617
            ],
            [
                653,
                735
            ],
            [
                737,
                758
            ],
            [
                765,
                794
            ],
            [
                794,
                831
            ],
            [
                844,
                857
            ],
            [
                867,
                875
            ],
            [
                896,
                900
            ],
            [
                925,
                935
            ],
            [
                940,
                946
            ],
            [
                909,
                912
            ],
            [
                947,
                975
            ],
            [
                975,
                996
            ],
            [
                1039,
                1087
            ],
            [
                1087,
                1146
            ],
            [
                1146,
                1195
            ],
            [
                1195,
                1256
            ],
            [
                1276,
                1293
            ],
            [
                1308,
                1352
            ],
            [
                1373,
                1381
            ],
            [
                1386,
                1389
            ],
            [
                1392,
                1421
            ],
            [
                1451,
                1502
            ],
            [
                1502,
                1524
            ],
            [
                1535,
                1562
            ],
            [
                1562,
                1564
            ],
            [
                1624,
                1686
            ],
            [
                1686,
                1689
            ],
            [
                1713,
                1768
            ],
            [
                1768,
                1844
            ],
            [
                1856,
                1883
            ],
            [
                1905,
                1912
            ],
            [
                1920,
                1962
            ],
            [
                2141,
                2164
            ],
            [
                2164,
                2211
            ],
            [
                2213,
                2219
            ],
            [
                2239,
                2301
            ],
            [
                2349,
                2351
            ],
            [
                2351,
                2418
            ],
            [
                2495,
                2605
            ],
            [
                2605,
                2656
            ],
            [
                2671,
                2735
            ],
            [
                2735,
                2815
            ],
            [
                2879,
                2906
            ],
            [
                2916,
                2922
            ],
            [
                2907,
                2912
            ],
            [
                2923,
                2936
            ],
            [
                2936,
                2978
            ],
            [
                2991,
                3024
            ],
            [
                3033,
                3096
            ],
            [
                3328,
                3429
            ],
            [
                3429,
                3491
            ],
            [
                3552,
                3555
            ],
            [
                3513,
                3541
            ],
            [
                3556,
                3590
            ],
            [
                3590,
                3642
            ],
            [
                3791,
                3793
            ],
            [
                3793,
                3849
            ],
            [
                3849,
                3873
            ],
            [
                3890,
                3904
            ],
            [
                3980,
                3999
            ],
            [
                3999,
                4079
            ],
            [
                4090,
                4111
            ],
            [
                4139,
                4193
            ],
            [
                4196,
                4230
            ],
            [
                4231,
                4241
            ],
            [
                4260,
                4280
            ],
            [
                4247,
                4253
            ],
            [
                4280,
                4329
            ],
            [
                4346,
                4348
            ],
            [
                4348,
                4423
            ],
            [
                4423,
                4451
            ],
            [
                4477,
                4522
            ],
            [
                4522,
                4588
            ],
            [
                4588,
                4590
            ],
            [
                4621,
                4677
            ],
            [
                4698,
                4715
            ],
            [
                4742,
                4756
            ],
            [
                4757,
                4795
            ],
            [
                4812,
                4823
            ],
            [
                4874,
                4920
            ],
            [
                4920,
                4969
            ],
            [
                4971,
                5002
            ],
            [
                5002,
                5032
            ],
            [
                5033,
                5060
            ],
            [
                5166,
                5186
            ],
            [
                5186,
                5209
            ],
            [
                5217,
                5263
            ],
            [
                5263,
                5266
            ],
            [
                5279,
                5287
            ],
            [
                5381,
                5392
            ],
            [
                5397,
                5465
            ],
            [
                5507,
                5549
            ],
            [
                5549,
                5672
            ],
            [
                5677,
                5687
            ],
            [
                5742,
                5744
            ],
            [
                5744,
                5781
            ],
            [
                5792,
                5835
            ],
            [
                5835,
                5860
            ],
            [
                5868,
                5900
            ],
            [
                5901,
                5954
            ],
            [
                5966,
                5981
            ],
            [
                5983,
                6061
            ],
            [
                6150,
                6152
            ],
            [
                6152,
                6180
            ],
            [
                6224,
                6265
            ],
            [
                6265,
                6285
            ],
            [
                6289,
                6311
            ],
            [
                6312,
                6316
            ],
            [
                6347,
                6375
            ],
            [
                6375,
                6420
            ],
            [
                6434,
                6438
            ],
            [
                6439,
                6446
            ],
            [
                6475,
                6477
            ],
            [
                7036,
                7042
            ],
            [
                7137,
                7138
            ],
            [
                7077,
                7086
            ],
            [
                7103,
                7137
            ],
            [
                7218,
                7273
            ],
            [
                7273,
                7310
            ],
            [
                7312,
                7373
            ],
            [
                7373,
                7415
            ],
            [
                7485,
                7488
            ],
            [
                7578,
                7616
            ],
            [
                7932,
                7933
            ],
            [
                7687,
                7724
            ],
            [
                7766,
                7767
            ],
            [
                7791,
                7840
            ],
            [
                7958,
                7960
            ],
            [
                7960,
                8000
            ],
            [
                8017,
                8035
            ],
            [
                8035,
                8092
            ],
            [
                8101,
                8118
            ],
            [
                8123,
                8189
            ],
            [
                8199,
                8219
            ],
            [
                8236,
                8238
            ],
            [
                8291,
                8378
            ],
            [
                8379,
                8428
            ],
            [
                8428,
                8430
            ],
            [
                8459,
                8461
            ],
            [
                8461,
                8479
            ],
            [
                8487,
                8557
            ],
            [
                8557,
                8565
            ],
            [
                8586,
                8604
            ],
            [
                8647,
                8651
            ],
            [
                8655,
                8698
            ],
            [
                8698,
                8735
            ],
            [
                8735,
                8765
            ],
            [
                8765,
                8766
            ],
            [
                8818,
                8829
            ],
            [
                8835,
                8854
            ],
            [
                8854,
                8884
            ],
            [
                8884,
                8904
            ],
            [
                8904,
                8908
            ],
            [
                8946,
                8959
            ],
            [
                9038,
                9123
            ],
            [
                9123,
                9133
            ],
            [
                9138,
                9175
            ],
            [
                9328,
                9329
            ],
            [
                9333,
                9358
            ],
            [
                9368,
                9388
            ],
            [
                9389,
                9447
            ],
            [
                9505,
                9536
            ],
            [
                9536,
                9539
            ],
            [
                9541,
                9550
            ],
            [
                9566,
                9569
            ],
            [
                9569,
                9590
            ],
            [
                9590,
                9625
            ],
            [
                9625,
                9656
            ],
            [
                9735,
                9762
            ],
            [
                9764,
                9782
            ],
            [
                10000,
                10019
            ],
            [
                10019,
                10033
            ],
            [
                10061,
                10090
            ],
            [
                10090,
                10116
            ],
            [
                10138,
                10143
            ],
            [
                10178,
                10180
            ],
            [
                10180,
                10186
            ],
            [
                10251,
                10298
            ],
            [
                10214,
                10219
            ],
            [
                10322,
                10324
            ],
            [
                10380,
                10397
            ],
            [
                10431,
                10434
            ],
            [
                10435,
                10457
            ],
            [
                10466,
                10484
            ],
            [
                10484,
                10538
            ],
            [
                10584,
                10598
            ],
            [
                10622,
                10624
            ],
            [
                10624,
                10662
            ],
            [
                10663,
                10723
            ],
            [
                10723,
                10759
            ],
            [
                10759,
                10817
            ],
            [
                10817,
                10833
            ],
            [
                10868,
                10875
            ],
            [
                10855,
                10864
            ],
            [
                10890,
                10915
            ],
            [
                10925,
                10940
            ],
            [
                10941,
                10957
            ],
            [
                10957,
                10971
            ],
            [
                10987,
                10991
            ],
            [
                10979,
                10986
            ],
            [
                10991,
                11070
            ],
            [
                11073,
                11159
            ],
            [
                11210,
                11230
            ],
            [
                11199,
                11202
            ],
            [
                11242,
                11286
            ],
            [
                11286,
                11289
            ],
            [
                11293,
                11307
            ],
            [
                11467,
                11507
            ],
            [
                11524,
                11528
            ],
            [
                11575,
                11589
            ],
            [
                11596,
                11610
            ],
            [
                11664,
                11665
            ],
            [
                11553,
                11556
            ],
            [
                11670,
                11674
            ],
            [
                11697,
                11704
            ],
            [
                11709,
                11715
            ],
            [
                11681,
                11688
            ],
            [
                11717,
                11721
            ],
            [
                11797,
                11826
            ],
            [
                11826,
                11863
            ],
            [
                11898,
                11908
            ],
            [
                11960,
                11982
            ],
            [
                12024,
                12039
            ],
            [
                12079,
                12147
            ],
            [
                12175,
                12214
            ],
            [
                12220,
                12249
            ],
            [
                12249,
                12331
            ],
            [
                12558,
                12578
            ],
            [
                12578,
                12581
            ],
            [
                12581,
                12616
            ],
            [
                12643,
                12656
            ],
            [
                12665,
                12674
            ],
            [
                12694,
                12729
            ],
            [
                12809,
                12826
            ],
            [
                12826,
                12836
            ],
            [
                12846,
                12855
            ],
            [
                12903,
                12905
            ],
            [
                12905,
                12908
            ],
            [
                12911,
                12941
            ],
            [
                12943,
                12974
            ],
            [
                12974,
                13001
            ],
            [
                13001,
                13012
            ],
            [
                13019,
                13021
            ],
            [
                13056,
                13076
            ],
            [
                13076,
                13154
            ],
            [
                13210,
                13249
            ],
            [
                13283,
                13285
            ],
            [
                13285,
                13297
            ],
            [
                13302,
                13305
            ],
            [
                13309,
                13323
            ],
            [
                13342,
                13355
            ],
            [
                13362,
                13388
            ],
            [
                13408,
                13425
            ],
            [
                13429,
                13436
            ],
            [
                13436,
                13439
            ],
            [
                13470,
                13488
            ],
            [
                13550,
                13635
            ],
            [
                13635,
                13676
            ],
            [
                13757,
                13759
            ],
            [
                13759,
                13784
            ],
            [
                13784,
                13836
            ],
            [
                13841,
                13846
            ],
            [
                13857,
                13859
            ],
            [
                13958,
                13976
            ],
            [
                13859,
                13867
            ],
            [
                13980,
                13985
            ],
            [
                13892,
                13911
            ],
            [
                14000,
                14018
            ],
            [
                13926,
                13928
            ],
            [
                14034,
                14039
            ],
            [
                14039,
                14093
            ],
            [
                14174,
                14261
            ],
            [
                14266,
                14270
            ],
            [
                14097,
                14100
            ],
            [
                14270,
                14272
            ],
            [
                14272,
                14310
            ],
            [
                14314,
                14343
            ],
            [
                14367,
                14368
            ],
            [
                14409,
                14445
            ],
            [
                14445,
                14479
            ],
            [
                14481,
                14484
            ],
            [
                14639,
                14641
            ],
            [
                14595,
                14622
            ],
            [
                14479,
                14480
            ],
            [
                14535,
                14541
            ],
            [
                14649,
                14654
            ],
            [
                14533,
                14534
            ],
            [
                14709,
                14734
            ],
            [
                14739,
                14763
            ],
            [
                14781,
                14782
            ],
            [
                14783,
                14787
            ],
            [
                14857,
                14860
            ],
            [
                14775,
                14781
            ],
            [
                14788,
                14790
            ],
            [
                14878,
                14880
            ],
            [
                14880,
                15030
            ],
            [
                15044,
                15047
            ],
            [
                15031,
                15036
            ],
            [
                15064,
                15073
            ],
            [
                15084,
                15109
            ],
            [
                15109,
                15144
            ],
            [
                15153,
                15184
            ],
            [
                15185,
                15252
            ],
            [
                15283,
                15285
            ],
            [
                15285,
                15303
            ],
            [
                15303,
                15330
            ],
            [
                15356,
                15387
            ],
            [
                15491,
                15563
            ],
            [
                15563,
                15596
            ],
            [
                15596,
                15622
            ],
            [
                15622,
                15623
            ],
            [
                15642,
                15681
            ],
            [
                15927,
                15954
            ],
            [
                15956,
                16015
            ],
            [
                16015,
                16073
            ],
            [
                16073,
                16083
            ],
            [
                16083,
                16155
            ],
            [
                16419,
                16439
            ],
            [
                16392,
                16418
            ],
            [
                16445,
                16464
            ],
            [
                16751,
                16777
            ],
            [
                16789,
                16820
            ],
            [
                16820,
                16872
            ],
            [
                16882,
                16884
            ],
            [
                16884,
                16921
            ],
            [
                16936,
                16942
            ],
            [
                16951,
                16964
            ],
            [
                16964,
                17048
            ],
            [
                17048,
                17091
            ],
            [
                17366,
                17401
            ],
            [
                17313,
                17329
            ],
            [
                17401,
                17427
            ],
            [
                17445,
                17465
            ],
            [
                17465,
                17501
            ],
            [
                17520,
                17522
            ],
            [
                17522,
                17897
            ],
            [
                17898,
                17934
            ],
            [
                17934,
                18049
            ],
            [
                18080,
                18082
            ],
            [
                18082,
                18107
            ],
            [
                18112,
                18118
            ],
            [
                18126,
                18130
            ],
            [
                18175,
                18177
            ],
            [
                18177,
                18185
            ],
            [
                18224,
                18228
            ],
            [
                18263,
                18287
            ],
            [
                18311,
                18332
            ],
            [
                18333,
                18350
            ],
            [
                18402,
                18455
            ],
            [
                18455,
                18481
            ],
            [
                18558,
                18570
            ],
            [
                18672,
                18699
            ],
            [
                18699,
                18732
            ],
            [
                18732,
                18751
            ],
            [
                18751,
                18778
            ],
            [
                18786,
                18797
            ],
            [
                18781,
                18782
            ],
            [
                18799,
                18817
            ],
            [
                18838,
                18881
            ],
            [
                18881,
                18886
            ],
            [
                18905,
                18918
            ],
            [
                18918,
                18970
            ],
            [
                18970,
                19002
            ],
            [
                19010,
                19012
            ],
            [
                19012,
                19032
            ],
            [
                19041,
                19044
            ],
            [
                19077,
                19088
            ],
            [
                19229,
                19262
            ],
            [
                19262,
                19326
            ]
        ],
        "row_chars": [
            [
                0,
                365
            ],
            [
                365,
                613
            ],
            [
                613,
                794
            ],
            [
                794,
                975
            ],
            [
                975,
                1087
            ],
            [
                1087,
                1146
            ],
            [
                1146,
                1195
            ],
            [
                1195,
                1382
            ],
            [
                1382,
                1502
            ],
            [
                1502,
                1562
            ],
            [
                1562,
                1686
            ],
            [
                1686,
                1768
            ],
            [
                1768,
                1963
            ],
            [
                1963,
                2141
            ],
            [
                2141,
                2164
            ],
            [
                2164,
                2351
            ],
            [
                2351,
                2418
            ],
            [
                2418,
                2495
            ],
            [
                2495,
                2605
            ],
            [
                2605,
                2656
            ],
            [
                2656,
                2735
            ],
            [
                2735,
                2936
            ],
            [
                2936,
                3097
            ],
            [
                3097,
                3172
            ],
            [
                3172,
                3328
            ],
            [
                3328,
                3429
            ],
            [
                3429,
                3590
            ],
            [
                3590,
                3793
            ],
            [
                3793,
                3849
            ],
            [
                3849,
                3999
            ],
            [
                3999,
                4231
            ],
            [
                4231,
                4348
            ],
            [
                4348,
                4423
            ],
            [
                4423,
                4522
            ],
            [
                4522,
                4588
            ],
            [
                4588,
                4678
            ],
            [
                4678,
                4757
            ],
            [
                4757,
                4795
            ],
            [
                4795,
                4812
            ],
            [
                4812,
                4920
            ],
            [
                4920,
                5002
            ],
            [
                5002,
                5033
            ],
            [
                5033,
                5060
            ],
            [
                5060,
                5166
            ],
            [
                5166,
                5186
            ],
            [
                5186,
                5263
            ],
            [
                5263,
                5549
            ],
            [
                5549,
                5744
            ],
            [
                5744,
                5835
            ],
            [
                5835,
                5901
            ],
            [
                5901,
                6152
            ],
            [
                6152,
                6265
            ],
            [
                6265,
                6375
            ],
            [
                6375,
                6477
            ],
            [
                6477,
                6873
            ],
            [
                6873,
                7036
            ],
            [
                7036,
                7218
            ],
            [
                7218,
                7273
            ],
            [
                7273,
                7373
            ],
            [
                7373,
                7960
            ],
            [
                7960,
                8035
            ],
            [
                8035,
                8238
            ],
            [
                8238,
                8245
            ],
            [
                8245,
                8379
            ],
            [
                8379,
                8428
            ],
            [
                8428,
                8461
            ],
            [
                8461,
                8557
            ],
            [
                8557,
                8698
            ],
            [
                8698,
                8735
            ],
            [
                8735,
                8854
            ],
            [
                8854,
                8884
            ],
            [
                8884,
                8904
            ],
            [
                8904,
                8961
            ],
            [
                8961,
                9038
            ],
            [
                9038,
                9123
            ],
            [
                9123,
                9175
            ],
            [
                9175,
                9247
            ],
            [
                9247,
                9274
            ],
            [
                9274,
                9302
            ],
            [
                9302,
                9328
            ],
            [
                9328,
                9358
            ],
            [
                9358,
                9447
            ],
            [
                9447,
                9505
            ],
            [
                9505,
                9536
            ],
            [
                9536,
                9569
            ],
            [
                9569,
                9590
            ],
            [
                9590,
                9625
            ],
            [
                9625,
                9657
            ],
            [
                9657,
                9735
            ],
            [
                9735,
                9785
            ],
            [
                9785,
                9908
            ],
            [
                9908,
                9949
            ],
            [
                9949,
                10000
            ],
            [
                10000,
                10019
            ],
            [
                10019,
                10033
            ],
            [
                10033,
                10061
            ],
            [
                10061,
                10090
            ],
            [
                10090,
                10180
            ],
            [
                10180,
                10484
            ],
            [
                10484,
                10541
            ],
            [
                10541,
                10583
            ],
            [
                10583,
                10624
            ],
            [
                10624,
                10663
            ],
            [
                10663,
                10723
            ],
            [
                10723,
                10759
            ],
            [
                10759,
                10817
            ],
            [
                10817,
                10957
            ],
            [
                10957,
                11286
            ],
            [
                11286,
                11507
            ],
            [
                11507,
                11826
            ],
            [
                11826,
                12249
            ],
            [
                12249,
                12332
            ],
            [
                12332,
                12558
            ],
            [
                12558,
                12581
            ],
            [
                12581,
                12730
            ],
            [
                12730,
                12809
            ],
            [
                12809,
                12826
            ],
            [
                12826,
                12905
            ],
            [
                12905,
                12974
            ],
            [
                12974,
                13001
            ],
            [
                13001,
                13076
            ],
            [
                13076,
                13156
            ],
            [
                13156,
                13210
            ],
            [
                13210,
                13285
            ],
            [
                13285,
                13436
            ],
            [
                13436,
                13489
            ],
            [
                13489,
                13550
            ],
            [
                13550,
                13635
            ],
            [
                13635,
                13759
            ],
            [
                13759,
                13784
            ],
            [
                13784,
                13859
            ],
            [
                13859,
                14039
            ],
            [
                14039,
                14272
            ],
            [
                14272,
                14310
            ],
            [
                14310,
                14445
            ],
            [
                14445,
                14709
            ],
            [
                14709,
                14880
            ],
            [
                14880,
                15109
            ],
            [
                15109,
                15185
            ],
            [
                15185,
                15285
            ],
            [
                15285,
                15303
            ],
            [
                15303,
                15389
            ],
            [
                15389,
                15563
            ],
            [
                15563,
                15596
            ],
            [
                15596,
                15622
            ],
            [
                15622,
                15681
            ],
            [
                15681,
                15724
            ],
            [
                15724,
                15795
            ],
            [
                15795,
                15857
            ],
            [
                15857,
                15927
            ],
            [
                15927,
                16015
            ],
            [
                16015,
                16073
            ],
            [
                16073,
                16083
            ],
            [
                16083,
                16155
            ],
            [
                16155,
                16212
            ],
            [
                16212,
                16252
            ],
            [
                16252,
                16347
            ],
            [
                16347,
                16370
            ],
            [
                16370,
                16388
            ],
            [
                16388,
                16467
            ],
            [
                16467,
                16548
            ],
            [
                16548,
                16636
            ],
            [
                16636,
                16683
            ],
            [
                16683,
                16750
            ],
            [
                16750,
                16820
            ],
            [
                16820,
                16884
            ],
            [
                16884,
                16964
            ],
            [
                16964,
                17048
            ],
            [
                17048,
                17092
            ],
            [
                17092,
                17240
            ],
            [
                17240,
                17313
            ],
            [
                17313,
                17465
            ],
            [
                17465,
                17522
            ],
            [
                17522,
                17898
            ],
            [
                17898,
                17934
            ],
            [
                17934,
                18082
            ],
            [
                18082,
                18177
            ],
            [
                18177,
                18333
            ],
            [
                18333,
                18455
            ],
            [
                18455,
                18484
            ],
            [
                18484,
                18551
            ],
            [
                18551,
                18570
            ],
            [
                18570,
                18615
            ],
            [
                18615,
                18671
            ],
            [
                18671,
                18699
            ],
            [
                18699,
                18732
            ],
            [
                18732,
                18751
            ],
            [
                18751,
                18817
            ],
            [
                18817,
                18838
            ],
            [
                18838,
                18881
            ],
            [
                18881,
                18918
            ],
            [
                18918,
                18970
            ],
            [
                18970,
                19012
            ],
            [
                19012,
                19044
            ],
            [
                19044,
                19058
            ],
            [
                19058,
                19090
            ],
            [
                19090,
                19119
            ],
            [
                19119,
                19229
            ],
            [
                19229,
                19262
            ],
            [
                19262,
                19326
            ]
        ]
    },
    "abridged": {
        "text": "It sometimes happens that an unambitious man is driven into a position in which he must choose a side; and though he does not know which side to choose, he is aware that he will be disgraced if he should make the wrong choice. This was felt by many who were suddenly forced to make up their mind whether they would go to Melmotte's dinner, or stay away.\nSome suspected that the story against Melmotte had been got up simply as an electioneering trick, so that Mr. Alf might win the borough on the next day. As a dodge for an election this might work, but any who were therefore deterred from supporting their Prince at the dinner would surely be marked men. And none of the wives cared a straw whether Melmotte was a swindler or not. Would the Emperor and the Princes and Princesses be there? This was the only question which concerned them. They did not care whether Melmotte was arrested at the dinner, so long as they could show their diamonds in the presence of royalty.\nYet what a fiasco would it be, if the host should be apprehended for common forgery! The great thing was to find out whether others were going. If half stayed away, how dreadful would be the position of those who were present! And what if at the last moment the Emperor should be kept away? The Prime Minister had decided that the Emperor and the Prince should remain in ignorance of the charges against Melmotte; but of that these doubters were unaware.\n\"Is your Grace going?\" said Lionel Lupton to the Duchess of Stevenage, having gone into the park between six and seven to pick up some hints. The Duchess was Lord Alfred's sister, and of course she was going. She had been assured by Lord Alfred not a quarter of an hour before that everything was as straight as a die. Lord Alfred had not then even heard of the rumour. Ultimately both Lionel Lupton and Beauchamp Beauclerk attended the dinner. They had received special tickets as supporters of Mr. Melmotte at the election, and they thought themselves honour-bound to be there. But they, with their leader, and one other member of the party, were all who came as the political friends of the candidate for Westminster.\nWhen Melmotte arrived at his own door with his wife and daughter he had heard nothing of the matter. That a man so vexed with affairs of money, so laden with cares and dangers, should be free from fear it is impossible to imagine. That such burdens should be borne at all is a wonder. Surely his whole life must have been a life of terrors! But of any special peril at that moment, he knew nothing. He placed his wife in the drawing-room and himself in the hall, and arranged his satellites around him - including the two Grendalls, young Nidderdale, and Mr. Cohenlupe - with a feeling of gratified glory.\nNidderdale had heard the rumour at the Houses of Parliament, but had determined that he would not as yet fly. Cohenlupe had also come up from the House, where no one had spoken to him. Though grievously frightened, he had not dared to be on the wing as yet. And, indeed, to what clime could such a bird as he fly in safety? He knew very much, and was not prepared to enjoy the feast.\nIn the hall Miles whispered to his father.\n\"You've heard about it; haven't you?\" Lord Alfred turned pale, but declared that he had heard nothing. \"They're saying all manner of things in the City; forgery and heaven knows what. The Lord Mayor is not coming.\"\nLord Alfred made no reply. But he was unhappy.\nThe grand arrivals were punctual, and the very grand people all came. The Emperor, with impassive and awful dignity, was marshalled into the room on the ground floor, before being marshalled back into the banqueting hall. Melmotte, bowing to the ground, walked backwards before him, and was probably taken by the Emperor for some Court Master of Ceremonies. The Princes had all shaken hands with Melmotte, and the Princesses had bowed graciously. Nothing of the rumour had been whispered in royal palaces.\nBesides royalty the company allowed to enter the room was very select: the Prime Minister, one archbishop, two duchesses, and an ex-governor of India. The remainder of the company were received in the drawing-room above. Everything was going well, and they who had decided to come were proud of their wisdom.\nBut when the company was seated at dinner the absences were unfortunately visible. A week ago, admission could not be had for love or money. Now it looked as though the room were but half-filled. There were six absences from the City; another six of Mr. Melmotte's own political party were away. The archbishops and the bishop were there, but two or three peers were absent, and so were a poet, two painters, and a philosopher, as well as three independent members of the House of Commons. Nearly forty places were vacant when the dinner commenced.\nMelmotte had insisted that Lord Alfred should sit next to him at the big table, having had the objectionable bar removed, and his own chair shoved nearer to the centre. He glanced repeatedly round the hall, and of course became aware that many were absent.\n\"How is it that there are so many places empty?\" he asked.\n\"Don't know,\" said Lord Alfred, shaking his head, steadfastly refusing to look round upon the hall.\nMelmotte looked round again. \"Has there been some mistake about the numbers? There's room for ever so many more.\"\n\"Don't know,\" said Lord Alfred unhappily, wishing that he had never seen Mr. Melmotte.\n\"What the deuce do you mean?\" whispered Melmotte. \"You ought to know.\"\n\"Can't say anything about it,\" said Lord Alfred, with his eyes fixed upon his plate.\n\"I'll be d___ if I don't find out,\" said Melmotte. \"Where's the Lord Mayor?\" In spite of royalty, he was now sitting with his face turned round upon the hall. \"Have you seen the Lord Mayor?\"\n\"No, I haven't.\"\n\"But he was to come. What's the meaning of it, Alfred?\"\n\"Don't know anything about it.\"\n\"And where's Mr. Killegrew, and Sir David Boss? What's up, Alfred? I must know.\"\n\"I could not make them come.\" Lord Alfred's answers were surly. He was sure the failure would partly be attached to himself, and he felt that Melmotte, by his frequent questions, was drawing attention to him. \"If you go on making a row,\" he said, \"I shall go away. Just sit quiet. You'll know all about it soon enough.\"\nThis was hardly the way to give Mr. Melmotte peace of mind. For a few minutes he did sit quiet. Then he got up and moved down the hall behind the guests.\nIn the meantime, various Royalties ate their dinner, without observing those empty Banquo's seats. As the Emperor spoke only Manchoo, and as there was no one present who could even interpret Manchoo into English - the imperial interpreter condescending only to interpret Manchoo into ordinary Chinese - his Imperial Majesty could not have much conversation with his neighbours. And his neighbours had not very much to say to each other. They probably found these duties irksome; and that solemn, silent Emperor must have had a weary time of it. He sat there for more than two hours, not eating nor drinking very much; but wondering at the changes which were coming when an Emperor of China was forced to sit and hear this buzz of voices and clatter of knives and forks. \"And this,\" he must have said to himself, \"is what they call royalty in the West!\"\n\"Where's Sir Gregory Gribe?\" said Melmotte, in a hoarse whisper, to a City friend - old Todd, of Todd, Brehgert, and Goldsheiner.\n\"Ain't he here?\" said Todd, knowing very well that he wasn't.\n\"No - and the Lord Mayor's not come; nor Postlethwaite, nor Bunter. What's the meaning of it?\"\nTodd looked at his neighbours before he answered. \"I'm here, that's all I can say, Mr. Melmotte; and I've had a very good dinner.\"\nThere was a weight upon Melmotte's mind. He knew from old Todd's manner, and Lord Alfred's, that there was something they could tell him if they would. But they would not open their mouths.\n\"It's very odd,\" he said, \"that gentlemen should promise to come and then stay away. There were hundreds anxious to be present. I think it is very odd.\"\n\"It is odd,\" said Mr. Todd, turning his attention to his plate.\nPassing back up the table, Melmotte found Beauchamp Beauclerk with a vacant seat next to him. There were many vacant seats in this part of the room, and Mr. Melmotte seated himself for a minute, thinking that he might get the truth from his ally in the election. Prudence should have kept him silent. Whatever the cause of these desertions, he could apply no remedy to it now. But he was bewildered and dismayed; and though he declared that nothing should cow him, yet he was cowed.\nPersonally, Mr. Beauclerk disliked the man greatly, thinking him a loud and vulgar upstart. But he had taken the business of Melmotte's election in hand, and considered himself bound to stand by Melmotte till that was over; and he was now the man's guest, and was constrained to courtesy. His wife was sitting by him, and he introduced her to Mr. Melmotte.\n\"You have a wonderful assemblage here, Mr. Melmotte,\" said the lady.\n\"Yes, ma'am, yes. His Majesty the Emperor has said that he has been much gratified. - Can you tell me, Mr. Beauclerk, why those other gentlemen are not here? It looks very odd; does it not?\"\n\"Ah; you mean Killegrew.\"\n\"And Sir David Boss, and the whole lot. I insisted on their being invited, and I know the cards were sent; and, by George, I have their answers, saying they'd come.\"\n\"I suppose some of them are engaged,\" said Mr. Beauclerk.\n\"Engaged! What business has a man to accept one engagement and then take another? There's something up. What is it, Mr. Beauclerk? You must have heard. If you know anything about it I think you ought to tell me.\"\n\"I know nothing except that the ballot will be taken tomorrow. You and I have got nothing more to do except await the result.\"\n\"Well; I suppose it's all right,\" said Melmotte, rising and going back to his seat. But he knew that things were not all right.\nThe Emperor sat solemn in his chair for another hour; and then, at some signal, he was withdrawn. The ladies had already left the room. According to the programme arranged for the evening, the royal guests were to return to the smaller room for a cup of coffee, and were then to be paraded upstairs before the multitude who would by that time have arrived, and to remain there long enough to justify the invited ones in saying that they had spent the evening with the Emperor and the Princes and the Princesses.\nThe plan was carried out perfectly. At half-past ten the Emperor was made to walk upstairs, and for half an hour sat awful and composed in an arm-chair. How one would wish to see inside his mind!\nMelmotte went through to the hall, and found Miles Grendall.\n\"Miles,\" he said, \"there's something wrong, and you know all about it. Why didn't the people come? What is it? Is it about the election?\"\n\"No, it's not that,\" said Miles.\n\"Then what is it?\"\n\"They got hold of something today in the City - about Pickering.\"\n\"And what were they saying about Pickering? Come; out with it. You don't suppose that I care what lies they tell.\"\n\"They say there's been something - forged. Title-deeds, I think.\"\n\"Forged title-deeds! All right, Miles; that will do.\" And the Great Financier went upstairs into his own drawing-room.",
        "paragraph_chars": [
            [
                0,
                354
            ],
            [
                354,
                975
            ],
            [
                975,
                1430
            ],
            [
                1430,
                2151
            ],
            [
                2151,
                2757
            ],
            [
                2757,
                3141
            ],
            [
                3141,
                3184
            ],
            [
                3184,
                3399
            ],
            [
                3399,
                3446
            ],
            [
                3446,
                3952
            ],
            [
                3952,
                4261
            ],
            [
                4261,
                4810
            ],
            [
                4810,
                5067
            ],
            [
                5067,
                5126
            ],
            [
                5126,
                5226
            ],
            [
                5226,
                5340
            ],
            [
                5340,
                5427
            ],
            [
                5427,
                5498
            ],
            [
                5498,
                5583
            ],
            [
                5583,
                5774
            ],
            [
                5774,
                5791
            ],
            [
                5791,
                5847
            ],
            [
                5847,
                5879
            ],
            [
                5879,
                5960
            ],
            [
                5960,
                6280
            ],
            [
                6280,
                6434
            ],
            [
                6434,
                7287
            ],
            [
                7287,
                7417
            ],
            [
                7417,
                7479
            ],
            [
                7479,
                7574
            ],
            [
                7574,
                7705
            ],
            [
                7705,
                7895
            ],
            [
                7895,
                8048
            ],
            [
                8048,
                8112
            ],
            [
                8112,
                8595
            ],
            [
                8595,
                8952
            ],
            [
                8952,
                9021
            ],
            [
                9021,
                9212
            ],
            [
                9212,
                9238
            ],
            [
                9238,
                9404
            ],
            [
                9404,
                9462
            ],
            [
                9462,
                9675
            ],
            [
                9675,
                9802
            ],
            [
                9802,
                9930
            ],
            [
                9930,
                10442
            ],
            [
                10442,
                10638
            ],
            [
                10638,
                10699
            ],
            [
                10699,
                10837
            ],
            [
                10837,
                10870
            ],
            [
                10870,
                10889
            ],
            [
                10889,
                10955
            ],
            [
                10955,
                11070
            ],
            [
                11070,
                11136
            ],
            [
                11136,
                11254
            ]
        ],
        "segment_chars": [
            [
                0,
                227
            ],
            [
                227,
                354
            ],
            [
                354,
                507
            ],
            [
                507,
                658
            ],
            [
                658,
                734
            ],
            [
                734,
                793
            ],
            [
                793,
                842
            ],
            [
                842,
                975
            ],
            [
                975,
                1060
            ],
            [
                1060,
                1119
            ],
            [
                1119,
                1202
            ],
            [
                1202,
                1266
            ],
            [
                1266,
                1430
            ],
            [
                1430,
                1453
            ],
            [
                1453,
                1572
            ],
            [
                1572,
                1639
            ],
            [
                1639,
                1749
            ],
            [
                1749,
                1800
            ],
            [
                1800,
                1875
            ],
            [
                1875,
                2010
            ],
            [
                2010,
                2151
            ],
            [
                2151,
                2252
            ],
            [
                2252,
                2382
            ],
            [
                2382,
                2436
            ],
            [
                2436,
                2492
            ],
            [
                2492,
                2550
            ],
            [
                2550,
                2757
            ],
            [
                2757,
                2867
            ],
            [
                2867,
                2942
            ],
            [
                2942,
                3015
            ],
            [
                3015,
                3081
            ],
            [
                3081,
                3141
            ],
            [
                3141,
                3184
            ],
            [
                3184,
                3222
            ],
            [
                3222,
                3287
            ],
            [
                3287,
                3368
            ],
            [
                3368,
                3399
            ],
            [
                3399,
                3426
            ],
            [
                3426,
                3446
            ],
            [
                3446,
                3516
            ],
            [
                3516,
                3668
            ],
            [
                3668,
                3804
            ],
            [
                3804,
                3893
            ],
            [
                3893,
                3952
            ],
            [
                3952,
                4103
            ],
            [
                4103,
                4173
            ],
            [
                4173,
                4261
            ],
            [
                4261,
                4344
            ],
            [
                4344,
                4402
            ],
            [
                4402,
                4457
            ],
            [
                4457,
                4557
            ],
            [
                4557,
                4751
            ],
            [
                4751,
                4810
            ],
            [
                4810,
                4979
            ],
            [
                4979,
                5067
            ],
            [
                5067,
                5116
            ],
            [
                5116,
                5126
            ],
            [
                5126,
                5226
            ],
            [
                5226,
                5255
            ],
            [
                5255,
                5303
            ],
            [
                5303,
                5340
            ],
            [
                5340,
                5427
            ],
            [
                5427,
                5457
            ],
            [
                5457,
                5477
            ],
            [
                5477,
                5498
            ],
            [
                5498,
                5583
            ],
            [
                5583,
                5634
            ],
            [
                5634,
                5660
            ],
            [
                5660,
                5742
            ],
            [
                5742,
                5774
            ],
            [
                5774,
                5791
            ],
            [
                5791,
                5812
            ],
            [
                5812,
                5847
            ],
            [
                5847,
                5879
            ],
            [
                5879,
                5927
            ],
            [
                5927,
                5946
            ],
            [
                5946,
                5960
            ],
            [
                5960,
                5990
            ],
            [
                5990,
                6024
            ],
            [
                6024,
                6169
            ],
            [
                6169,
                6225
            ],
            [
                6225,
                6241
            ],
            [
                6241,
                6280
            ],
            [
                6280,
                6340
            ],
            [
                6340,
                6376
            ],
            [
                6376,
                6434
            ],
            [
                6434,
                6533
            ],
            [
                6533,
                6812
            ],
            [
                6812,
                6871
            ],
            [
                6871,
                6979
            ],
            [
                6979,
                7204
            ],
            [
                7204,
                7287
            ],
            [
                7287,
                7316
            ],
            [
                7316,
                7417
            ],
            [
                7417,
                7434
            ],
            [
                7434,
                7479
            ],
            [
                7479,
                7547
            ],
            [
                7547,
                7574
            ],
            [
                7574,
                7624
            ],
            [
                7624,
                7705
            ],
            [
                7705,
                7746
            ],
            [
                7746,
                7857
            ],
            [
                7857,
                7895
            ],
            [
                7895,
                7980
            ],
            [
                7980,
                8023
            ],
            [
                8023,
                8048
            ],
            [
                8048,
                8112
            ],
            [
                8112,
                8206
            ],
            [
                8206,
                8375
            ],
            [
                8375,
                8413
            ],
            [
                8413,
                8489
            ],
            [
                8489,
                8595
            ],
            [
                8595,
                8687
            ],
            [
                8687,
                8884
            ],
            [
                8884,
                8952
            ],
            [
                8952,
                9021
            ],
            [
                9021,
                9039
            ],
            [
                9039,
                9105
            ],
            [
                9105,
                9179
            ],
            [
                9179,
                9212
            ],
            [
                9212,
                9238
            ],
            [
                9238,
                9278
            ],
            [
                9278,
                9404
            ],
            [
                9404,
                9462
            ],
            [
                9462,
                9472
            ],
            [
                9472,
                9544
            ],
            [
                9544,
                9566
            ],
            [
                9566,
                9593
            ],
            [
                9593,
                9614
            ],
            [
                9614,
                9675
            ],
            [
                9675,
                9738
            ],
            [
                9738,
                9802
            ],
            [
                9802,
                9886
            ],
            [
                9886,
                9930
            ],
            [
                9930,
                10028
            ],
            [
                10028,
                10066
            ],
            [
                10066,
                10442
            ],
            [
                10442,
                10478
            ],
            [
                10478,
                10595
            ],
            [
                10595,
                10638
            ],
            [
                10638,
                10699
            ],
            [
                10699,
                10770
            ],
            [
                10770,
                10798
            ],
            [
                10798,
                10810
            ],
            [
                10810,
                10837
            ],
            [
                10837,
                10870
            ],
            [
                10870,
                10889
            ],
            [
                10889,
                10955
            ],
            [
                10955,
                10999
            ],
            [
                10999,
                11018
            ],
            [
                11018,
                11070
            ],
            [
                11070,
                11113
            ],
            [
                11113,
                11136
            ],
            [
                11136,
                11157
            ],
            [
                11157,
                11190
            ],
            [
                11190,
                11254
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                3,
                12
            ],
            [
                21,
                44
            ],
            [
                45,
                54
            ],
            [
                55,
                101
            ],
            [
                103,
                106
            ],
            [
                107,
                116
            ],
            [
                117,
                121
            ],
            [
                131,
                141
            ],
            [
                142,
                144
            ],
            [
                145,
                203
            ],
            [
                209,
                218
            ],
            [
                225,
                227
            ],
            [
                227,
                240
            ],
            [
                241,
                257
            ],
            [
                258,
                342
            ],
            [
                343,
                352
            ],
            [
                352,
                353
            ],
            [
                354,
                358
            ],
            [
                369,
                451
            ],
            [
                452,
                473
            ],
            [
                478,
                507
            ],
            [
                507,
                544
            ],
            [
                549,
                562
            ],
            [
                578,
                586
            ],
            [
                587,
                591
            ],
            [
                592,
                602
            ],
            [
                609,
                615
            ],
            [
                619,
                622
            ],
            [
                630,
                658
            ],
            [
                658,
                679
            ],
            [
                686,
                734
            ],
            [
                734,
                793
            ],
            [
                793,
                842
            ],
            [
                842,
                903
            ],
            [
                903,
                920
            ],
            [
                921,
                965
            ],
            [
                966,
                974
            ],
            [
                975,
                978
            ],
            [
                979,
                1008
            ],
            [
                1009,
                1060
            ],
            [
                1060,
                1082
            ],
            [
                1092,
                1119
            ],
            [
                1119,
                1121
            ],
            [
                1140,
                1202
            ],
            [
                1202,
                1205
            ],
            [
                1211,
                1266
            ],
            [
                1266,
                1342
            ],
            [
                1343,
                1370
            ],
            [
                1371,
                1378
            ],
            [
                1387,
                1429
            ],
            [
                1430,
                1453
            ],
            [
                1453,
                1500
            ],
            [
                1501,
                1507
            ],
            [
                1508,
                1570
            ],
            [
                1570,
                1572
            ],
            [
                1572,
                1639
            ],
            [
                1639,
                1749
            ],
            [
                1749,
                1800
            ],
            [
                1811,
                1875
            ],
            [
                1875,
                1955
            ],
            [
                1956,
                1983
            ],
            [
                1984,
                1990
            ],
            [
                1991,
                1996
            ],
            [
                1997,
                2010
            ],
            [
                2010,
                2052
            ],
            [
                2053,
                2086
            ],
            [
                2087,
                2150
            ],
            [
                2151,
                2252
            ],
            [
                2252,
                2314
            ],
            [
                2315,
                2318
            ],
            [
                2319,
                2347
            ],
            [
                2348,
                2382
            ],
            [
                2382,
                2434
            ],
            [
                2434,
                2436
            ],
            [
                2436,
                2492
            ],
            [
                2492,
                2516
            ],
            [
                2517,
                2531
            ],
            [
                2531,
                2550
            ],
            [
                2550,
                2630
            ],
            [
                2631,
                2652
            ],
            [
                2665,
                2719
            ],
            [
                2722,
                2756
            ],
            [
                2757,
                2767
            ],
            [
                2768,
                2788
            ],
            [
                2789,
                2795
            ],
            [
                2816,
                2865
            ],
            [
                2865,
                2867
            ],
            [
                2867,
                2942
            ],
            [
                2942,
                2970
            ],
            [
                2970,
                3015
            ],
            [
                3015,
                3081
            ],
            [
                3081,
                3083
            ],
            [
                3084,
                3140
            ],
            [
                3141,
                3158
            ],
            [
                3169,
                3183
            ],
            [
                3184,
                3222
            ],
            [
                3222,
                3233
            ],
            [
                3241,
                3287
            ],
            [
                3287,
                3336
            ],
            [
                3337,
                3368
            ],
            [
                3368,
                3398
            ],
            [
                3399,
                3426
            ],
            [
                3426,
                3446
            ],
            [
                3446,
                3469
            ],
            [
                3470,
                3516
            ],
            [
                3516,
                3519
            ],
            [
                3520,
                3528
            ],
            [
                3529,
                3540
            ],
            [
                3544,
                3612
            ],
            [
                3626,
                3668
            ],
            [
                3668,
                3791
            ],
            [
                3792,
                3802
            ],
            [
                3802,
                3804
            ],
            [
                3804,
                3841
            ],
            [
                3850,
                3893
            ],
            [
                3893,
                3918
            ],
            [
                3919,
                3951
            ],
            [
                3952,
                4005
            ],
            [
                4006,
                4021
            ],
            [
                4023,
                4101
            ],
            [
                4101,
                4103
            ],
            [
                4103,
                4131
            ],
            [
                4132,
                4173
            ],
            [
                4173,
                4193
            ],
            [
                4194,
                4216
            ],
            [
                4228,
                4232
            ],
            [
                4233,
                4261
            ],
            [
                4261,
                4306
            ],
            [
                4316,
                4320
            ],
            [
                4335,
                4342
            ],
            [
                4342,
                4344
            ],
            [
                4344,
                4350
            ],
            [
                4354,
                4355
            ],
            [
                4356,
                4365
            ],
            [
                4366,
                4400
            ],
            [
                4402,
                4457
            ],
            [
                4457,
                4494
            ],
            [
                4496,
                4557
            ],
            [
                4557,
                4599
            ],
            [
                4600,
                4603
            ],
            [
                4604,
                4642
            ],
            [
                4648,
                4649
            ],
            [
                4650,
                4687
            ],
            [
                4687,
                4688
            ],
            [
                4700,
                4749
            ],
            [
                4749,
                4751
            ],
            [
                4751,
                4791
            ],
            [
                4792,
                4810
            ],
            [
                4810,
                4867
            ],
            [
                4872,
                4889
            ],
            [
                4890,
                4956
            ],
            [
                4957,
                4977
            ],
            [
                4977,
                4979
            ],
            [
                4979,
                5066
            ],
            [
                5067,
                5116
            ],
            [
                5116,
                5118
            ],
            [
                5124,
                5126
            ],
            [
                5126,
                5144
            ],
            [
                5156,
                5226
            ],
            [
                5226,
                5234
            ],
            [
                5235,
                5253
            ],
            [
                5255,
                5259
            ],
            [
                5260,
                5303
            ],
            [
                5303,
                5340
            ],
            [
                5340,
                5370
            ],
            [
                5380,
                5381
            ],
            [
                5390,
                5401
            ],
            [
                5408,
                5427
            ],
            [
                5427,
                5457
            ],
            [
                5457,
                5477
            ],
            [
                5477,
                5481
            ],
            [
                5482,
                5495
            ],
            [
                5498,
                5583
            ],
            [
                5583,
                5593
            ],
            [
                5597,
                5634
            ],
            [
                5634,
                5635
            ],
            [
                5635,
                5660
            ],
            [
                5660,
                5680
            ],
            [
                5684,
                5742
            ],
            [
                5743,
                5774
            ],
            [
                5774,
                5777
            ],
            [
                5779,
                5788
            ],
            [
                5788,
                5791
            ],
            [
                5791,
                5812
            ],
            [
                5812,
                5847
            ],
            [
                5847,
                5878
            ],
            [
                5879,
                5906
            ],
            [
                5907,
                5925
            ],
            [
                5927,
                5946
            ],
            [
                5946,
                5960
            ],
            [
                5961,
                5990
            ],
            [
                5990,
                6016
            ],
            [
                6017,
                6022
            ],
            [
                6022,
                6024
            ],
            [
                6024,
                6030
            ],
            [
                6036,
                6083
            ],
            [
                6083,
                6088
            ],
            [
                6089,
                6091
            ],
            [
                6097,
                6114
            ],
            [
                6115,
                6118
            ],
            [
                6128,
                6150
            ],
            [
                6151,
                6169
            ],
            [
                6169,
                6223
            ],
            [
                6225,
                6239
            ],
            [
                6239,
                6241
            ],
            [
                6241,
                6279
            ],
            [
                6280,
                6340
            ],
            [
                6340,
                6376
            ],
            [
                6376,
                6434
            ],
            [
                6434,
                6450
            ],
            [
                6451,
                6458
            ],
            [
                6459,
                6468
            ],
            [
                6469,
                6494
            ],
            [
                6495,
                6510
            ],
            [
                6517,
                6533
            ],
            [
                6533,
                6547
            ],
            [
                6554,
                6558
            ],
            [
                6559,
                6566
            ],
            [
                6566,
                6645
            ],
            [
                6648,
                6734
            ],
            [
                6737,
                6757
            ],
            [
                6764,
                6767
            ],
            [
                6768,
                6812
            ],
            [
                6812,
                6815
            ],
            [
                6816,
                6830
            ],
            [
                6831,
                6871
            ],
            [
                6871,
                6875
            ],
            [
                6876,
                6890
            ],
            [
                6897,
                6911
            ],
            [
                6911,
                6912
            ],
            [
                6913,
                6916
            ],
            [
                6917,
                6921
            ],
            [
                6922,
                6929
            ],
            [
                6930,
                6936
            ],
            [
                6937,
                6944
            ],
            [
                6945,
                6949
            ],
            [
                6950,
                6979
            ],
            [
                6979,
                7016
            ],
            [
                7017,
                7027
            ],
            [
                7028,
                7050
            ],
            [
                7050,
                7065
            ],
            [
                7066,
                7134
            ],
            [
                7135,
                7174
            ],
            [
                7175,
                7204
            ],
            [
                7204,
                7286
            ],
            [
                7287,
                7307
            ],
            [
                7313,
                7316
            ],
            [
                7316,
                7351
            ],
            [
                7355,
                7368
            ],
            [
                7371,
                7380
            ],
            [
                7381,
                7416
            ],
            [
                7417,
                7434
            ],
            [
                7434,
                7444
            ],
            [
                7453,
                7462
            ],
            [
                7477,
                7479
            ],
            [
                7479,
                7482
            ],
            [
                7485,
                7515
            ],
            [
                7516,
                7547
            ],
            [
                7547,
                7574
            ],
            [
                7574,
                7585
            ],
            [
                7586,
                7588
            ],
            [
                7604,
                7624
            ],
            [
                7624,
                7702
            ],
            [
                7705,
                7744
            ],
            [
                7744,
                7746
            ],
            [
                7746,
                7758
            ],
            [
                7759,
                7762
            ],
            [
                7767,
                7781
            ],
            [
                7782,
                7795
            ],
            [
                7795,
                7821
            ],
            [
                7827,
                7844
            ],
            [
                7850,
                7857
            ],
            [
                7857,
                7860
            ],
            [
                7876,
                7894
            ],
            [
                7895,
                7980
            ],
            [
                7980,
                8021
            ],
            [
                8021,
                8023
            ],
            [
                8023,
                8048
            ],
            [
                8048,
                8100
            ],
            [
                8105,
                8110
            ],
            [
                8110,
                8112
            ],
            [
                8120,
                8138
            ],
            [
                8139,
                8147
            ],
            [
                8148,
                8153
            ],
            [
                8154,
                8173
            ],
            [
                8174,
                8192
            ],
            [
                8198,
                8200
            ],
            [
                8201,
                8206
            ],
            [
                8206,
                8260
            ],
            [
                8265,
                8352
            ],
            [
                8353,
                8357
            ],
            [
                8361,
                8364
            ],
            [
                8373,
                8375
            ],
            [
                8375,
                8413
            ],
            [
                8422,
                8451
            ],
            [
                8451,
                8452
            ],
            [
                8453,
                8489
            ],
            [
                8489,
                8523
            ],
            [
                8525,
                8528
            ],
            [
                8536,
                8538
            ],
            [
                8548,
                8575
            ],
            [
                8575,
                8576
            ],
            [
                8581,
                8587
            ],
            [
                8588,
                8593
            ],
            [
                8593,
                8594
            ],
            [
                8595,
                8620
            ],
            [
                8621,
                8645
            ],
            [
                8645,
                8646
            ],
            [
                8662,
                8666
            ],
            [
                8667,
                8670
            ],
            [
                8671,
                8677
            ],
            [
                8678,
                8680
            ],
            [
                8685,
                8687
            ],
            [
                8687,
                8837
            ],
            [
                8838,
                8841
            ],
            [
                8844,
                8849
            ],
            [
                8849,
                8858
            ],
            [
                8859,
                8884
            ],
            [
                8884,
                8919
            ],
            [
                8920,
                8951
            ],
            [
                8952,
                9019
            ],
            [
                9019,
                9021
            ],
            [
                9021,
                9039
            ],
            [
                9039,
                9066
            ],
            [
                9072,
                9103
            ],
            [
                9107,
                9179
            ],
            [
                9179,
                9212
            ],
            [
                9212,
                9238
            ],
            [
                9238,
                9239
            ],
            [
                9239,
                9278
            ],
            [
                9317,
                9344
            ],
            [
                9345,
                9404
            ],
            [
                9404,
                9462
            ],
            [
                9462,
                9472
            ],
            [
                9472,
                9544
            ],
            [
                9544,
                9564
            ],
            [
                9566,
                9592
            ],
            [
                9593,
                9612
            ],
            [
                9614,
                9640
            ],
            [
                9644,
                9675
            ],
            [
                9675,
                9727
            ],
            [
                9736,
                9738
            ],
            [
                9738,
                9775
            ],
            [
                9776,
                9782
            ],
            [
                9789,
                9802
            ],
            [
                9802,
                9886
            ],
            [
                9886,
                9929
            ],
            [
                9930,
                9965
            ],
            [
                9966,
                9982
            ],
            [
                9982,
                10008
            ],
            [
                10008,
                10028
            ],
            [
                10028,
                10064
            ],
            [
                10064,
                10066
            ],
            [
                10066,
                10441
            ],
            [
                10442,
                10478
            ],
            [
                10478,
                10593
            ],
            [
                10593,
                10595
            ],
            [
                10595,
                10620
            ],
            [
                10621,
                10627
            ],
            [
                10632,
                10636
            ],
            [
                10636,
                10638
            ],
            [
                10638,
                10646
            ],
            [
                10647,
                10651
            ],
            [
                10652,
                10676
            ],
            [
                10677,
                10698
            ],
            [
                10699,
                10716
            ],
            [
                10717,
                10770
            ],
            [
                10770,
                10796
            ],
            [
                10798,
                10810
            ],
            [
                10810,
                10837
            ],
            [
                10837,
                10870
            ],
            [
                10870,
                10889
            ],
            [
                10889,
                10916
            ],
            [
                10923,
                10934
            ],
            [
                10935,
                10936
            ],
            [
                10937,
                10955
            ],
            [
                10956,
                10999
            ],
            [
                10999,
                11004
            ],
            [
                11005,
                11018
            ],
            [
                11018,
                11070
            ],
            [
                11070,
                11102
            ],
            [
                11111,
                11113
            ],
            [
                11113,
                11133
            ],
            [
                11133,
                11136
            ],
            [
                11144,
                11155
            ],
            [
                11157,
                11190
            ],
            [
                11190,
                11254
            ]
        ],
        "row_chars": [
            [
                0,
                227
            ],
            [
                227,
                354
            ],
            [
                354,
                507
            ],
            [
                507,
                658
            ],
            [
                658,
                734
            ],
            [
                734,
                793
            ],
            [
                793,
                842
            ],
            [
                842,
                975
            ],
            [
                975,
                1060
            ],
            [
                1060,
                1119
            ],
            [
                1119,
                1202
            ],
            [
                1202,
                1266
            ],
            [
                1266,
                1430
            ],
            [
                1430,
                1430
            ],
            [
                1430,
                1453
            ],
            [
                1453,
                1572
            ],
            [
                1572,
                1639
            ],
            [
                1639,
                1639
            ],
            [
                1639,
                1749
            ],
            [
                1749,
                1800
            ],
            [
                1800,
                1875
            ],
            [
                1875,
                2010
            ],
            [
                2010,
                2151
            ],
            [
                2151,
                2151
            ],
            [
                2151,
                2151
            ],
            [
                2151,
                2252
            ],
            [
                2252,
                2382
            ],
            [
                2382,
                2436
            ],
            [
                2436,
                2492
            ],
            [
                2492,
                2550
            ],
            [
                2550,
                2757
            ],
            [
                2757,
                2867
            ],
            [
                2867,
                2942
            ],
            [
                2942,
                3015
            ],
            [
                3015,
                3081
            ],
            [
                3081,
                3141
            ],
            [
                3141,
                3184
            ],
            [
                3184,
                3222
            ],
            [
                3222,
                3222
            ],
            [
                3222,
                3287
            ],
            [
                3287,
                3368
            ],
            [
                3368,
                3399
            ],
            [
                3399,
                3426
            ],
            [
                3426,
                3426
            ],
            [
                3426,
                3446
            ],
            [
                3446,
                3516
            ],
            [
                3516,
                3668
            ],
            [
                3668,
                3804
            ],
            [
                3804,
                3893
            ],
            [
                3893,
                3952
            ],
            [
                3952,
                4103
            ],
            [
                4103,
                4173
            ],
            [
                4173,
                4261
            ],
            [
                4261,
                4344
            ],
            [
                4344,
                4344
            ],
            [
                4344,
                4344
            ],
            [
                4344,
                4402
            ],
            [
                4402,
                4457
            ],
            [
                4457,
                4557
            ],
            [
                4557,
                4751
            ],
            [
                4751,
                4810
            ],
            [
                4810,
                4979
            ],
            [
                4979,
                4979
            ],
            [
                4979,
                5067
            ],
            [
                5067,
                5116
            ],
            [
                5116,
                5126
            ],
            [
                5126,
                5226
            ],
            [
                5226,
                5303
            ],
            [
                5303,
                5340
            ],
            [
                5340,
                5427
            ],
            [
                5427,
                5457
            ],
            [
                5457,
                5477
            ],
            [
                5477,
                5498
            ],
            [
                5498,
                5498
            ],
            [
                5498,
                5583
            ],
            [
                5583,
                5634
            ],
            [
                5634,
                5634
            ],
            [
                5634,
                5634
            ],
            [
                5634,
                5634
            ],
            [
                5634,
                5634
            ],
            [
                5634,
                5660
            ],
            [
                5660,
                5742
            ],
            [
                5742,
                5742
            ],
            [
                5742,
                5774
            ],
            [
                5774,
                5791
            ],
            [
                5791,
                5812
            ],
            [
                5812,
                5847
            ],
            [
                5847,
                5879
            ],
            [
                5879,
                5879
            ],
            [
                5879,
                5927
            ],
            [
                5927,
                5927
            ],
            [
                5927,
                5927
            ],
            [
                5927,
                5927
            ],
            [
                5927,
                5946
            ],
            [
                5946,
                5960
            ],
            [
                5960,
                5960
            ],
            [
                5960,
                5990
            ],
            [
                5990,
                6024
            ],
            [
                6024,
                6169
            ],
            [
                6169,
                6225
            ],
            [
                6225,
                6225
            ],
            [
                6225,
                6241
            ],
            [
                6241,
                6280
            ],
            [
                6280,
                6340
            ],
            [
                6340,
                6376
            ],
            [
                6376,
                6434
            ],
            [
                6434,
                6533
            ],
            [
                6533,
                6812
            ],
            [
                6812,
                6871
            ],
            [
                6871,
                6979
            ],
            [
                6979,
                7204
            ],
            [
                7204,
                7287
            ],
            [
                7287,
                7287
            ],
            [
                7287,
                7316
            ],
            [
                7316,
                7417
            ],
            [
                7417,
                7417
            ],
            [
                7417,
                7434
            ],
            [
                7434,
                7479
            ],
            [
                7479,
                7547
            ],
            [
                7547,
                7574
            ],
            [
                7574,
                7624
            ],
            [
                7624,
                7705
            ],
            [
                7705,
                7705
            ],
            [
                7705,
                7746
            ],
            [
                7746,
                7857
            ],
            [
                7857,
                7895
            ],
            [
                7895,
                7895
            ],
            [
                7895,
                7980
            ],
            [
                7980,
                8023
            ],
            [
                8023,
                8048
            ],
            [
                8048,
                8112
            ],
            [
                8112,
                8206
            ],
            [
                8206,
                8375
            ],
            [
                8375,
                8413
            ],
            [
                8413,
                8489
            ],
            [
                8489,
                8595
            ],
            [
                8595,
                8687
            ],
            [
                8687,
                8884
            ],
            [
                8884,
                8952
            ],
            [
                8952,
                9021
            ],
            [
                9021,
                9039
            ],
            [
                9039,
                9105
            ],
            [
                9105,
                9179
            ],
            [
                9179,
                9212
            ],
            [
                9212,
                9238
            ],
            [
                9238,
                9278
            ],
            [
                9278,
                9278
            ],
            [
                9278,
                9278
            ],
            [
                9278,
                9278
            ],
            [
                9278,
                9278
            ],
            [
                9278,
                9404
            ],
            [
                9404,
                9462
            ],
            [
                9462,
                9472
            ],
            [
                9472,
                9544
            ],
            [
                9544,
                9544
            ],
            [
                9544,
                9544
            ],
            [
                9544,
                9544
            ],
            [
                9544,
                9544
            ],
            [
                9544,
                9544
            ],
            [
                9544,
                9614
            ],
            [
                9614,
                9614
            ],
            [
                9614,
                9614
            ],
            [
                9614,
                9614
            ],
            [
                9614,
                9614
            ],
            [
                9614,
                9675
            ],
            [
                9675,
                9738
            ],
            [
                9738,
                9802
            ],
            [
                9802,
                9886
            ],
            [
                9886,
                9930
            ],
            [
                9930,
                9930
            ],
            [
                9930,
                9930
            ],
            [
                9930,
                10028
            ],
            [
                10028,
                10066
            ],
            [
                10066,
                10442
            ],
            [
                10442,
                10478
            ],
            [
                10478,
                10595
            ],
            [
                10595,
                10638
            ],
            [
                10638,
                10699
            ],
            [
                10699,
                10770
            ],
            [
                10770,
                10798
            ],
            [
                10798,
                10798
            ],
            [
                10798,
                10810
            ],
            [
                10810,
                10810
            ],
            [
                10810,
                10810
            ],
            [
                10810,
                10837
            ],
            [
                10837,
                10870
            ],
            [
                10870,
                10889
            ],
            [
                10889,
                10955
            ],
            [
                10955,
                10955
            ],
            [
                10955,
                10999
            ],
            [
                10999,
                11018
            ],
            [
                11018,
                11070
            ],
            [
                11070,
                11113
            ],
            [
                11113,
                11136
            ],
            [
                11136,
                11136
            ],
            [
                11136,
                11157
            ],
            [
                11157,
                11157
            ],
            [
                11157,
                11157
            ],
            [
                11157,
                11190
            ],
            [
                11190,
                11254
            ]
        ]
    }
}