{
    "original": {
        "text": "A few days before that period in our story which we have now reached, Miss Longestaffe was seated in Lady Monogram's back drawing-room, discussing the terms on which the two tickets for Madame Melmotte's grand reception had been transferred to Lady Monogram,--the place on the cards for the names of the friends whom Madame Melmotte had the honour of inviting to meet the Emperor and the Princes, having been left blank; and the terms also on which Miss Longestaffe had been asked to spend two or three days with her dear friend Lady Monogram. Each lady was disposed to get as much and to give as little as possible,--in which desire the ladies carried out the ordinary practice of all parties to a bargain. It had of course been settled that Lady Monogram was to have the two tickets,--for herself and her husband,--such tickets at that moment standing very high in the market. In payment for these valuable considerations, Lady Monogram was to undertake to chaperon Miss Longestaffe at the entertainment, to take Miss Longestaffe as a visitor for three days, and to have one party at her own house during the time, so that it might be seen that Miss Longestaffe had other friends in London besides the Melmotte's on whom to depend for her London gaieties. At this moment Miss Longestaffe felt herself justified in treating the matter as though she were hardly receiving a fair equivalent. The Melmotte tickets were certainly ruling very high. They had just culminated. They fell a little soon afterwards, and at ten P.M. on the night of the entertainment were hardly worth anything. At the moment which we have now in hand, there was a rush for them. Lady Monogram had already secured the tickets. They were in her desk. But, as will sometimes be the case in a bargain, the seller was complaining that as she had parted with her goods too cheap, some make-weight should be added to the stipulated price.\n\"As for that, my dear,\" said Miss Longestaffe, who, since the rise in Melmotte stock generally, had endeavoured to resume something of her old manners, \"I don't see what you mean at all. You meet Lady Julia Goldsheiner everywhere, and her father-in-law is Mr. Brehgert's junior partner.\"\n\"Lady Julia is Lady Julia, my dear, and young Mr. Goldsheiner has, in some sort of way, got himself in. He hunts, and Damask says that he is one of the best shots at Hurlingham. I never met old Mr. Goldsheiner anywhere.\"\n\"I have.\"\n\"Oh, yes, I dare say. Mr. Melmotte, of course, entertains all the City people. I don't think Sir Damask would like me to ask Mr. Brehgert to dine here.\" Lady Monogram managed everything herself with reference to her own parties; invited all her own guests, and never troubled Sir Damask,--who, again, on his side, had his own set of friends; but she was very clever in the use which she made of her husband. There were some aspirants who really were taught to think that Sir Damask was very particular as to the guests whom he welcomed to his own house.\n\"May I speak to Sir Damask about it?\" asked Miss Longestaffe, who was very urgent on the occasion.\n\"Well, my dear, I really don't think you ought to do that. There are little things which a man and his wife must manage together without interference.\"\n\"Nobody can ever say that I interfered in any family. But really, Julia, when you tell me that Sir Damask cannot receive Mr. Brehgert, it does sound odd. As for City people, you know as well as I do, that that kind of thing is all over now. City people are just as good as West-end people.\"\n\"A great deal better, I dare say. I'm not arguing about that. I don't make the lines; but there they are; and one gets to know in a sort of way what they are. I don't pretend to be a bit better than my neighbours. I like to see people come here whom other people who come here will like to meet. I'm big enough to hold my own, and so is Sir Damask. But we ain't big enough to introduce new-comers. I don't suppose there's anybody in London understands it better than you do, Georgiana, and therefore it's absurd my pretending to teach you. I go pretty well everywhere, as you are aware; and I shouldn't know Mr. Brehgert if I were to see him.\"\n\"You'll meet him at the Melmottes', and, in spite of all you said once, you're glad enough to go there.\"\n\"Quite true, my dear. I don't think that you are just the person to throw that in my teeth; but never mind that. There's the butcher round the corner in Bond Street, or the man who comes to do my hair. I don't at all think of asking them to my house. But if they were suddenly to turn out wonderful men, and go everywhere, no doubt I should be glad to have them here. That's the way we live, and you are as well used to it as I am. Mr. Brehgert at present to me is like the butcher round the corner.\" Lady Monogram had the tickets safe under lock and key, or I think she would hardly have said this.\n\"He is not a bit like a butcher,\" said Miss Longestaffe, blazing up in real wrath.\n\"I did not say that he was.\"\n\"Yes, you did; and it was the unkindest thing you could possibly say. It was meant to be unkind. It was monstrous. How would you like it if I said that Sir Damask was like a hair-dresser?\"\n\"You can say so if you please. Sir Damask drives four in hand, rides as though he meant to break his neck every winter, is one of the best shots going, and is supposed to understand a yacht as well as any other gentleman out. And I'm rather afraid that before he was married he used to box with all the prize-fighters, and to be a little too free behind the scenes. If that makes a man like a hair-dresser, well, there he is.\"\n\"How proud you are of his vices.\"\n\"He's very good-natured, my dear, and as he does not interfere with me, I don't interfere with him. I hope you'll do as well. I dare say Mr. Brehgert is good-natured.\"\n\"He's an excellent man of business, and is making a very large fortune.\"\n\"And has five or six grown-up children, who, no doubt, will be a comfort.\"\n\"If I don't mind them, why need you? You have none at all, and you find it lonely enough.\"\n\"Not at all lonely. I have everything that I desire. How hard you are trying to be ill-natured, Georgiana.\"\n\"Why did you say that he was a--butcher?\"\n\"I said nothing of the kind. I didn't even say that he was like a butcher. What I did say was this,--that I don't feel inclined to risk my own reputation on the appearance of new people at my table. Of course, I go in for what you call fashion. Some people can dare to ask anybody they meet in the streets. I can't. I've my own line, and I mean to follow it. It's hard work, I can tell you; and it would be harder still if I wasn't particular. If you like Mr. Brehgert to come here on Tuesday evening, when the rooms will be full, you can ask him; but as for having him to dinner, I--won't--do--it.\" So the matter was at last settled. Miss Longestaffe did ask Mr. Brehgert for the Tuesday evening, and the two ladies were again friends.\nPerhaps Lady Monogram, when she illustrated her position by an allusion to a butcher and a hair-dresser, had been unaware that Mr. Brehgert had some resemblance to the form which men in that trade are supposed to bear. Let us at least hope that she was so. He was a fat, greasy man, good-looking in a certain degree, about fifty, with hair dyed black, and beard and moustache dyed a dark purple colour. The charm of his face consisted in a pair of very bright black eyes, which were, however, set too near together in his face for the general delight of Christians. He was stout;--fat all over rather than corpulent,--and had that look of command in his face which has become common to master-butchers, probably by long intercourse with sheep and oxen. But Mr. Brehgert was considered to be a very good man of business, and was now regarded as being, in a commercial point of view, the leading member of the great financial firm of which he was the second partner. Mr. Todd's day was nearly done. He walked about constantly between Lombard Street, the Exchange, and the Bank, and talked much to merchants; he had an opinion too of his own on particular cases; but the business had almost got beyond him, and Mr. Brehgert was now supposed to be the moving spirit of the firm. He was a widower, living in a luxurious villa at Fulham with a family, not indeed grown up, as Lady Monogram had ill-naturedly said, but which would be grown up before long, varying from an eldest son of eighteen, who had just been placed at a desk in the office, to the youngest girl of twelve, who was at school at Brighton. He was a man who always asked for what he wanted; and having made up his mind that he wanted a second wife, had asked Miss Georgiana Longestaffe to fill that situation. He had met her at the Melmottes', had entertained her, with Madame Melmotte and Marie, at Beaudesert, as he called his villa, had then proposed in the square, and two days after had received an assenting answer in Bruton Street.\nPoor Miss Longestaffe! Although she had acknowledged the fact to Lady Monogram in her desire to pave the way for the reception of herself into society as a married woman, she had not as yet found courage to tell her family. The man was absolutely a Jew;--not a Jew that had been, as to whom there might possibly be a doubt whether he or his father or his grandfather had been the last Jew of the family; but a Jew that was. So was Goldsheiner a Jew, whom Lady Julia Start had married,--or at any rate had been one a very short time before he ran away with that lady. She counted up ever so many instances on her fingers of \"decent people\" who had married Jews or Jewesses. Lord Frederic Framlinghame had married a girl of the Berrenhoffers; and Mr. Hart had married a Miss Chute. She did not know much of Miss Chute, but was certain that she was a Christian. Lord Frederic's wife and Lady Julia Goldsheiner were seen everywhere. Though she hardly knew how to explain the matter even to herself, she was sure that there was at present a general heaving-up of society on this matter, and a change in progress which would soon make it a matter of indifference whether anybody was Jew or Christian. For herself she regarded the matter not at all, except as far as it might be regarded by the world in which she wished to live. She was herself above all personal prejudices of that kind. Jew, Turk, or infidel was nothing to her. She had seen enough of the world to be aware that her happiness did not lie in that direction, and could not depend in the least on the religion of her husband. Of course she would go to church herself. She always went to church. It was the proper thing to do. As to her husband, though she did not suppose that she could ever get him to church,--nor perhaps would it be desirable,--she thought that she might induce him to go nowhere, so that she might be able to pass him off as a Christian. She knew that such was the Christianity of young Goldsheiner, of which the Starts were now boasting.\nHad she been alone in the world she thought that she could have looked forward to her destiny with complacency; but she was afraid of her father and mother. Lady Pomona was distressingly old-fashioned, and had so often spoken with horror even of the approach of a Jew,--and had been so loud in denouncing the iniquity of Christians who allowed such people into their houses! Unfortunately, too, Georgiana in her earlier days had re-echoed all her mother's sentiments. And then her father,--if he had ever earned for himself the right to be called a Conservative politician by holding a real opinion of his own,--it had been on that matter of admitting the Jews into parliament. When that had been done he was certain that the glory of England was sunk for ever. And since that time, whenever creditors were more than ordinarily importunate, when Slow and Bideawhile could do nothing for him, he would refer to that fatal measure as though it was the cause of every embarrassment which had harassed him. How could she tell parents such as these that she was engaged to marry a man who at the present moment went to synagogue on a Saturday and carried out every other filthy abomination common to the despised people?\nThat Mr. Brehgert was a fat, greasy man of fifty, conspicuous for hair-dye, was in itself distressing:--but this minor distress was swallowed up in the greater. Miss Longestaffe was a girl possessing considerable discrimination, and was able to weigh her own possessions in just scales. She had begun life with very high aspirations, believing in her own beauty, in her mother's fashion, and her father's fortune. She had now been ten years at the work, and was aware that she had always flown a little too high for her mark at the time. At nineteen and twenty and twenty-one she had thought that all the world was before her. With her commanding figure, regular long features, and bright complexion, she had regarded herself as one of the beauties of the day, and had considered herself entitled to demand wealth and a coronet. At twenty-two, twenty-three, and twenty-four any young peer, or peer's eldest son, with a house in town and in the country, might have sufficed. Twenty-five and six had been the years for baronets and squires; and even a leading fashionable lawyer or two had been marked by her as sufficient since that time. But now she was aware that hitherto she had always fixed her price a little too high. On three things she was still determined,--that she would not be poor, that she would not be banished from London, and that she would not be an old maid. \"Mamma,\" she had often said, \"there's one thing certain. I shall never do to be poor.\" Lady Pomona had expressed full concurrence with her child. \"And, mamma, to do as Sophia is doing would kill me. Fancy having to live at Toodlam all one's life with George Whitstable!\" Lady Pomona had agreed to this also, though she thought that Toodlam Hall was a very nice home for her elder daughter. \"And, mamma, I should drive you and papa mad if I were to stay at home always. And what would become of me when Dolly was master of everything?\" Lady Pomona, looking forward as well as she was able to the time at which she should herself have departed, when her dower and dower-house would have reverted to Dolly, acknowledged that Georgiana should provide herself with a home of her own before that time.\nAnd how was this to be done? Lovers with all the glories and all the graces are supposed to be plentiful as blackberries by girls of nineteen, but have been proved to be rare hothouse fruits by girls of twenty-nine. Brehgert was rich, would live in London, and would be a husband. People did such odd things now and \"lived them down,\" that she could see no reason why she should not do this and live this down. Courage was the one thing necessary,--that and perseverance. She must teach herself to talk about Brehgert as Lady Monogram did of Sir Damask. She had plucked up so much courage as had enabled her to declare her fate to her old friend,--remembering as she did so how in days long past she and her friend Julia Triplex had scattered their scorn upon some poor girl who had married a man with a Jewish name,--whose grandfather had possibly been a Jew. \"Dear me,\" said Lady Monogram. \"Todd, Brehgert, and Goldsheiner! Mr. Todd is--one of us, I suppose.\"\n\"Yes,\" said Georgiana boldly, \"and Mr. Brehgert is a Jew. His name is Ezekiel Brehgert, and he is a Jew. You can say what you like about it.\"\n\"I don't say anything about it, my dear.\"\n\"And you can think anything you like. Things are changed since you and I were younger.\"\n\"Very much changed, it appears,\" said Lady Monogram. Sir Damask's religion had never been doubted, though except on the occasion of his marriage no acquaintance of his had probably ever seen him in church.\nBut to tell her father and mother required a higher spirit than she had shown even in her communication to Lady Monogram, and that spirit had not as yet come to her. On the morning before she left the Melmottes in Bruton Street, her lover had been with her. The Melmottes of course knew of the engagement and quite approved of it. Madame Melmotte rather aspired to credit for having had so happy an affair arranged under her auspices. It was some set-off against Marie's unfortunate escapade. Mr. Brehgert, therefore, had been allowed to come and go as he pleased, and on that morning he had pleased to come. They were sitting alone in some back room, and Brehgert was pressing for an early day. \"I don't think we need talk of that yet, Mr. Brehgert,\" she said.\n\"You might as well get over the difficulty and call me Ezekiel at once,\" he remarked. Georgiana frowned, and made no soft little attempt at the name as ladies in such circumstances are wont to do. \"Mrs. Brehgert\"--he alluded of course to the mother of his children--\"used to call me Ezzy.\"\n\"Perhaps I shall do so some day,\" said Miss Longestaffe, looking at her lover, and asking herself why she should not have been able to have the house and the money and the name of the wife without the troubles appertaining. She did not think it possible that she should ever call him Ezzy.\n\"And ven shall it be? I should say as early in August as possible.\"\n\"In August!\" she almost screamed. It was already July.\n\"Vy not, my dear? Ve would have our little holiday in Germany,--at Vienna. I have business there, and know many friends.\" Then he pressed her hard to fix some day in the next month. It would be expedient that they should be married from the Melmottes' house, and the Melmottes would leave town some time in August. There was truth in this. Unless married from the Melmottes' house, she must go down to Caversham for the occasion,--which would be intolerable. No;--she must separate herself altogether from father and mother, and become one with the Melmottes and the Brehgerts,--till she could live it down and make a position for herself. If the spending of money could do it, it should be done.\n\"I must at any rate ask mamma about it,\" said Georgiana. Mr. Brehgert, with the customary good-humour of his people, was satisfied with the answer, and went away promising that he would meet his love at the great Melmotte reception. Then she sat silent, thinking how she should declare the matter to her family. Would it not be better for her to say to them at once that there must be a division among them,--an absolute breaking off of all old ties, so that it should be tacitly acknowledged that she, Georgiana, had gone out from among the Longestaffes altogether, and had become one with the Melmottes, Brehgerts, and Goldsheiners?",
        "paragraph_chars": [
            [
                0,
                1906
            ],
            [
                1906,
                2194
            ],
            [
                2194,
                2415
            ],
            [
                2415,
                2425
            ],
            [
                2425,
                2979
            ],
            [
                2979,
                3078
            ],
            [
                3078,
                3230
            ],
            [
                3230,
                3521
            ],
            [
                3521,
                4165
            ],
            [
                4165,
                4270
            ],
            [
                4270,
                4870
            ],
            [
                4870,
                4953
            ],
            [
                4953,
                4982
            ],
            [
                4982,
                5171
            ],
            [
                5171,
                5598
            ],
            [
                5598,
                5632
            ],
            [
                5632,
                5800
            ],
            [
                5800,
                5873
            ],
            [
                5873,
                5948
            ],
            [
                5948,
                6039
            ],
            [
                6039,
                6147
            ],
            [
                6147,
                6189
            ],
            [
                6189,
                6926
            ],
            [
                6926,
                8926
            ],
            [
                8926,
                10946
            ],
            [
                10946,
                12162
            ],
            [
                12162,
                14336
            ],
            [
                14336,
                15298
            ],
            [
                15298,
                15440
            ],
            [
                15440,
                15482
            ],
            [
                15482,
                15570
            ],
            [
                15570,
                15776
            ],
            [
                15776,
                16538
            ],
            [
                16538,
                16828
            ],
            [
                16828,
                17118
            ],
            [
                17118,
                17186
            ],
            [
                17186,
                17241
            ],
            [
                17241,
                17938
            ],
            [
                17938,
                18572
            ]
        ],
        "segment_chars": [
            [
                0,
                544
            ],
            [
                544,
                708
            ],
            [
                708,
                879
            ],
            [
                879,
                1258
            ],
            [
                1258,
                1391
            ],
            [
                1391,
                1445
            ],
            [
                1445,
                1471
            ],
            [
                1471,
                1585
            ],
            [
                1585,
                1653
            ],
            [
                1653,
                1700
            ],
            [
                1700,
                1723
            ],
            [
                1723,
                1906
            ],
            [
                1906,
                2093
            ],
            [
                2093,
                2194
            ],
            [
                2194,
                2298
            ],
            [
                2298,
                2372
            ],
            [
                2372,
                2415
            ],
            [
                2415,
                2425
            ],
            [
                2425,
                2447
            ],
            [
                2447,
                2504
            ],
            [
                2504,
                2578
            ],
            [
                2578,
                2833
            ],
            [
                2833,
                2979
            ],
            [
                2979,
                3017
            ],
            [
                3017,
                3078
            ],
            [
                3078,
                3137
            ],
            [
                3137,
                3230
            ],
            [
                3230,
                3284
            ],
            [
                3284,
                3384
            ],
            [
                3384,
                3471
            ],
            [
                3471,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3555,
                3583
            ],
            [
                3583,
                3680
            ],
            [
                3680,
                3735
            ],
            [
                3735,
                3817
            ],
            [
                3817,
                3870
            ],
            [
                3870,
                3919
            ],
            [
                3919,
                4061
            ],
            [
                4061,
                4165
            ],
            [
                4165,
                4270
            ],
            [
                4270,
                4292
            ],
            [
                4292,
                4383
            ],
            [
                4383,
                4472
            ],
            [
                4472,
                4521
            ],
            [
                4521,
                4638
            ],
            [
                4638,
                4702
            ],
            [
                4702,
                4771
            ],
            [
                4771,
                4870
            ],
            [
                4870,
                4953
            ],
            [
                4953,
                4982
            ],
            [
                4982,
                5052
            ],
            [
                5052,
                5079
            ],
            [
                5079,
                5097
            ],
            [
                5097,
                5171
            ],
            [
                5171,
                5202
            ],
            [
                5202,
                5397
            ],
            [
                5397,
                5537
            ],
            [
                5537,
                5598
            ],
            [
                5598,
                5632
            ],
            [
                5632,
                5732
            ],
            [
                5732,
                5758
            ],
            [
                5758,
                5800
            ],
            [
                5800,
                5873
            ],
            [
                5873,
                5948
            ],
            [
                5948,
                5985
            ],
            [
                5985,
                6039
            ],
            [
                6039,
                6059
            ],
            [
                6059,
                6092
            ],
            [
                6092,
                6147
            ],
            [
                6147,
                6189
            ],
            [
                6189,
                6218
            ],
            [
                6218,
                6264
            ],
            [
                6264,
                6388
            ],
            [
                6388,
                6434
            ],
            [
                6434,
                6496
            ],
            [
                6496,
                6505
            ],
            [
                6505,
                6548
            ],
            [
                6548,
                6633
            ],
            [
                6633,
                6789
            ],
            [
                6789,
                6824
            ],
            [
                6824,
                6926
            ],
            [
                6926,
                7145
            ],
            [
                7145,
                7183
            ],
            [
                7183,
                7329
            ],
            [
                7329,
                7492
            ],
            [
                7492,
                7679
            ],
            [
                7679,
                7891
            ],
            [
                7891,
                7923
            ],
            [
                7923,
                8201
            ],
            [
                8201,
                8528
            ],
            [
                8528,
                8697
            ],
            [
                8697,
                8926
            ],
            [
                8926,
                8949
            ],
            [
                8949,
                9150
            ],
            [
                9150,
                9350
            ],
            [
                9350,
                9493
            ],
            [
                9493,
                9599
            ],
            [
                9599,
                9706
            ],
            [
                9706,
                9785
            ],
            [
                9785,
                9855
            ],
            [
                9855,
                10121
            ],
            [
                10121,
                10249
            ],
            [
                10249,
                10309
            ],
            [
                10309,
                10351
            ],
            [
                10351,
                10512
            ],
            [
                10512,
                10554
            ],
            [
                10554,
                10581
            ],
            [
                10581,
                10612
            ],
            [
                10612,
                10845
            ],
            [
                10845,
                10946
            ],
            [
                10946,
                11103
            ],
            [
                11103,
                11321
            ],
            [
                11321,
                11414
            ],
            [
                11414,
                11624
            ],
            [
                11624,
                11708
            ],
            [
                11708,
                11949
            ],
            [
                11949,
                12162
            ],
            [
                12162,
                12323
            ],
            [
                12323,
                12449
            ],
            [
                12449,
                12576
            ],
            [
                12576,
                12700
            ],
            [
                12700,
                12789
            ],
            [
                12789,
                12991
            ],
            [
                12991,
                13136
            ],
            [
                13136,
                13300
            ],
            [
                13300,
                13386
            ],
            [
                13386,
                13540
            ],
            [
                13540,
                13597
            ],
            [
                13597,
                13627
            ],
            [
                13627,
                13686
            ],
            [
                13686,
                13739
            ],
            [
                13739,
                13811
            ],
            [
                13811,
                13930
            ],
            [
                13930,
                14009
            ],
            [
                14009,
                14075
            ],
            [
                14075,
                14336
            ],
            [
                14336,
                14365
            ],
            [
                14365,
                14552
            ],
            [
                14552,
                14617
            ],
            [
                14617,
                14747
            ],
            [
                14747,
                14808
            ],
            [
                14808,
                14890
            ],
            [
                14890,
                15197
            ],
            [
                15197,
                15228
            ],
            [
                15228,
                15262
            ],
            [
                15262,
                15298
            ],
            [
                15298,
                15356
            ],
            [
                15356,
                15403
            ],
            [
                15403,
                15440
            ],
            [
                15440,
                15482
            ],
            [
                15482,
                15520
            ],
            [
                15520,
                15570
            ],
            [
                15570,
                15623
            ],
            [
                15623,
                15776
            ],
            [
                15776,
                15942
            ],
            [
                15942,
                16034
            ],
            [
                16034,
                16107
            ],
            [
                16107,
                16211
            ],
            [
                16211,
                16269
            ],
            [
                16269,
                16385
            ],
            [
                16385,
                16472
            ],
            [
                16472,
                16538
            ],
            [
                16538,
                16624
            ],
            [
                16624,
                16735
            ],
            [
                16735,
                16828
            ],
            [
                16828,
                17052
            ],
            [
                17052,
                17118
            ],
            [
                17118,
                17140
            ],
            [
                17140,
                17186
            ],
            [
                17186,
                17199
            ],
            [
                17199,
                17220
            ],
            [
                17220,
                17241
            ],
            [
                17241,
                17259
            ],
            [
                17259,
                17316
            ],
            [
                17316,
                17363
            ],
            [
                17363,
                17423
            ],
            [
                17423,
                17556
            ],
            [
                17556,
                17581
            ],
            [
                17581,
                17700
            ],
            [
                17700,
                17881
            ],
            [
                17881,
                17938
            ],
            [
                17938,
                17995
            ],
            [
                17995,
                18171
            ],
            [
                18171,
                18250
            ],
            [
                18250,
                18572
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                260,
                263
            ],
            [
                68,
                185
            ],
            [
                273,
                276
            ],
            [
                204,
                228
            ],
            [
                241,
                243
            ],
            [
                287,
                290
            ],
            [
                249,
                252
            ],
            [
                419,
                544
            ],
            [
                544,
                553
            ],
            [
                567,
                615
            ],
            [
                706,
                708
            ],
            [
                864,
                866
            ],
            [
                787,
                790
            ],
            [
                769,
                784
            ],
            [
                923,
                942
            ],
            [
                956,
                1106
            ],
            [
                738,
                742
            ],
            [
                1111,
                1208
            ],
            [
                877,
                878
            ],
            [
                1273,
                1294
            ],
            [
                1346,
                1349
            ],
            [
                1355,
                1378
            ],
            [
                1389,
                1391
            ],
            [
                1391,
                1411
            ],
            [
                1450,
                1453
            ],
            [
                1505,
                1510
            ],
            [
                1626,
                1653
            ],
            [
                1653,
                1666
            ],
            [
                1671,
                1678
            ],
            [
                1667,
                1670
            ],
            [
                1710,
                1723
            ],
            [
                1723,
                1726
            ],
            [
                1772,
                1887
            ],
            [
                1899,
                1906
            ],
            [
                1906,
                1956
            ],
            [
                2002,
                2093
            ],
            [
                2093,
                2194
            ],
            [
                2194,
                2255
            ],
            [
                2301,
                2372
            ],
            [
                2504,
                2578
            ],
            [
                2705,
                2711
            ],
            [
                2739,
                2742
            ],
            [
                2634,
                2636
            ],
            [
                2619,
                2623
            ],
            [
                2765,
                2770
            ],
            [
                2583,
                2591
            ],
            [
                2775,
                2832
            ],
            [
                2979,
                3017
            ],
            [
                3017,
                3039
            ],
            [
                3076,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3284,
                3287
            ],
            [
                3296,
                3384
            ],
            [
                3471,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3555,
                3583
            ],
            [
                3870,
                3919
            ],
            [
                3919,
                4061
            ],
            [
                4061,
                4165
            ],
            [
                4165,
                4204
            ],
            [
                4237,
                4270
            ],
            [
                4270,
                4292
            ],
            [
                4383,
                4472
            ],
            [
                4525,
                4638
            ],
            [
                4702,
                4771
            ],
            [
                4771,
                4870
            ],
            [
                4870,
                4953
            ],
            [
                4953,
                4982
            ],
            [
                4982,
                5052
            ],
            [
                5079,
                5097
            ],
            [
                5097,
                5171
            ],
            [
                5171,
                5202
            ],
            [
                5202,
                5276
            ],
            [
                5289,
                5397
            ],
            [
                5397,
                5488
            ],
            [
                5535,
                5537
            ],
            [
                5537,
                5589
            ],
            [
                5593,
                5598
            ],
            [
                5598,
                5632
            ],
            [
                5632,
                5732
            ],
            [
                5732,
                5758
            ],
            [
                5758,
                5800
            ],
            [
                5800,
                5873
            ],
            [
                5873,
                5948
            ],
            [
                5948,
                5985
            ],
            [
                5985,
                6039
            ],
            [
                6039,
                6059
            ],
            [
                6059,
                6092
            ],
            [
                6092,
                6147
            ],
            [
                6147,
                6177
            ],
            [
                6186,
                6189
            ],
            [
                6189,
                6218
            ],
            [
                6264,
                6282
            ],
            [
                6290,
                6302
            ],
            [
                6317,
                6327
            ],
            [
                6332,
                6388
            ],
            [
                6633,
                6771
            ],
            [
                6773,
                6778
            ],
            [
                6780,
                6782
            ],
            [
                6784,
                6788
            ],
            [
                6789,
                6806
            ],
            [
                6815,
                6824
            ],
            [
                6824,
                6926
            ],
            [
                6926,
                6947
            ],
            [
                7053,
                7065
            ],
            [
                7075,
                7086
            ],
            [
                6998,
                7010
            ],
            [
                7143,
                7145
            ],
            [
                7183,
                7329
            ],
            [
                7329,
                7422
            ],
            [
                7427,
                7440
            ],
            [
                7490,
                7492
            ],
            [
                7492,
                7504
            ],
            [
                7541,
                7542
            ],
            [
                7544,
                7590
            ],
            [
                7602,
                7627
            ],
            [
                7677,
                7678
            ],
            [
                7679,
                7775
            ],
            [
                7808,
                7891
            ],
            [
                7893,
                7921
            ],
            [
                8128,
                8201
            ],
            [
                8201,
                8270
            ],
            [
                8375,
                8528
            ],
            [
                8528,
                8697
            ],
            [
                8697,
                8786
            ],
            [
                8812,
                8840
            ],
            [
                8854,
                8868
            ],
            [
                8875,
                8890
            ],
            [
                8924,
                8926
            ],
            [
                8926,
                8949
            ],
            [
                8949,
                8965
            ],
            [
                8991,
                9004
            ],
            [
                9053,
                9055
            ],
            [
                9008,
                9011
            ],
            [
                9095,
                9108
            ],
            [
                9112,
                9150
            ],
            [
                9150,
                9179
            ],
            [
                9217,
                9222
            ],
            [
                9345,
                9348
            ],
            [
                9243,
                9248
            ],
            [
                9315,
                9317
            ],
            [
                9348,
                9350
            ],
            [
                9357,
                9368
            ],
            [
                9353,
                9356
            ],
            [
                9369,
                9409
            ],
            [
                9427,
                9430
            ],
            [
                9497,
                9530
            ],
            [
                9546,
                9599
            ],
            [
                9599,
                9621
            ],
            [
                9626,
                9639
            ],
            [
                9652,
                9662
            ],
            [
                9665,
                9670
            ],
            [
                9785,
                9855
            ],
            [
                9921,
                9938
            ],
            [
                10024,
                10032
            ],
            [
                10021,
                10023
            ],
            [
                9984,
                9991
            ],
            [
                10039,
                10120
            ],
            [
                10121,
                10132
            ],
            [
                10167,
                10168
            ],
            [
                10249,
                10256
            ],
            [
                10265,
                10309
            ],
            [
                10309,
                10351
            ],
            [
                10512,
                10544
            ],
            [
                10552,
                10554
            ],
            [
                10581,
                10612
            ],
            [
                10612,
                10696
            ],
            [
                10734,
                10798
            ],
            [
                10816,
                10844
            ],
            [
                11058,
                11103
            ],
            [
                11103,
                11155
            ],
            [
                11159,
                11213
            ],
            [
                11321,
                11334
            ],
            [
                11339,
                11374
            ],
            [
                11389,
                11414
            ],
            [
                11414,
                11433
            ],
            [
                11570,
                11572
            ],
            [
                11470,
                11473
            ],
            [
                11545,
                11547
            ],
            [
                11602,
                11622
            ],
            [
                11433,
                11434
            ],
            [
                11648,
                11667
            ],
            [
                11681,
                11688
            ],
            [
                11672,
                11677
            ],
            [
                11689,
                11708
            ],
            [
                11949,
                11967
            ],
            [
                11968,
                11975
            ],
            [
                11990,
                12029
            ],
            [
                12052,
                12130
            ],
            [
                12141,
                12162
            ],
            [
                12162,
                12264
            ],
            [
                12266,
                12323
            ],
            [
                12323,
                12339
            ],
            [
                12453,
                12494
            ],
            [
                12574,
                12576
            ],
            [
                12700,
                12711
            ],
            [
                12738,
                12789
            ],
            [
                12789,
                12824
            ],
            [
                12830,
                12991
            ],
            [
                12991,
                12993
            ],
            [
                13006,
                13019
            ],
            [
                13036,
                13136
            ],
            [
                13136,
                13282
            ],
            [
                13298,
                13299
            ],
            [
                13300,
                13326
            ],
            [
                13336,
                13386
            ],
            [
                13386,
                13426
            ],
            [
                13429,
                13456
            ],
            [
                13462,
                13504
            ],
            [
                13510,
                13540
            ],
            [
                14340,
                14365
            ],
            [
                14365,
                14371
            ],
            [
                14412,
                14415
            ],
            [
                14431,
                14456
            ],
            [
                14460,
                14482
            ],
            [
                14506,
                14510
            ],
            [
                14511,
                14526
            ],
            [
                14530,
                14552
            ],
            [
                14552,
                14617
            ],
            [
                14617,
                14668
            ],
            [
                14676,
                14735
            ],
            [
                14741,
                14747
            ],
            [
                14747,
                14782
            ],
            [
                14785,
                14807
            ],
            [
                14890,
                14908
            ],
            [
                14917,
                14924
            ],
            [
                14944,
                14981
            ],
            [
                15051,
                15056
            ],
            [
                14981,
                14982
            ],
            [
                14996,
                15031
            ],
            [
                15065,
                15151
            ],
            [
                15195,
                15196
            ],
            [
                15197,
                15228
            ],
            [
                15228,
                15262
            ],
            [
                15262,
                15273
            ],
            [
                15275,
                15298
            ],
            [
                15298,
                15356
            ],
            [
                15356,
                15384
            ],
            [
                15401,
                15403
            ],
            [
                15403,
                15440
            ],
            [
                15440,
                15482
            ],
            [
                15482,
                15520
            ],
            [
                15520,
                15570
            ],
            [
                15570,
                15622
            ],
            [
                15776,
                15834
            ],
            [
                15896,
                15921
            ],
            [
                15925,
                15936
            ],
            [
                15940,
                15942
            ],
            [
                15942,
                16034
            ],
            [
                16034,
                16107
            ],
            [
                16269,
                16339
            ],
            [
                16383,
                16385
            ],
            [
                16385,
                16466
            ],
            [
                16467,
                16471
            ],
            [
                16472,
                16538
            ],
            [
                16538,
                16556
            ],
            [
                16585,
                16600
            ],
            [
                16608,
                16624
            ],
            [
                16624,
                16641
            ],
            [
                16733,
                16735
            ],
            [
                16735,
                16750
            ],
            [
                16752,
                16802
            ],
            [
                16804,
                16828
            ],
            [
                16828,
                16884
            ],
            [
                17070,
                17072
            ],
            [
                17082,
                17118
            ],
            [
                17118,
                17140
            ],
            [
                17140,
                17186
            ],
            [
                17186,
                17199
            ],
            [
                17199,
                17220
            ],
            [
                17220,
                17241
            ],
            [
                17241,
                17259
            ],
            [
                17259,
                17291
            ],
            [
                17305,
                17316
            ],
            [
                17316,
                17363
            ],
            [
                17363,
                17382
            ],
            [
                17388,
                17423
            ],
            [
                17423,
                17444
            ],
            [
                17462,
                17534
            ],
            [
                17545,
                17555
            ],
            [
                17556,
                17581
            ],
            [
                17581,
                17669
            ],
            [
                17672,
                17700
            ],
            [
                17700,
                17703
            ],
            [
                17705,
                17817
            ],
            [
                17825,
                17847
            ],
            [
                17879,
                17880
            ],
            [
                17938,
                17945
            ],
            [
                17958,
                17995
            ],
            [
                17995,
                18068
            ],
            [
                18084,
                18109
            ],
            [
                18124,
                18171
            ],
            [
                18171,
                18250
            ],
            [
                18250,
                18287
            ],
            [
                18296,
                18345
            ],
            [
                18431,
                18439
            ],
            [
                18452,
                18572
            ]
        ],
        "row_chars": [
            [
                0,
                544
            ],
            [
                544,
                708
            ],
            [
                708,
                1258
            ],
            [
                1258,
                1391
            ],
            [
                1391,
                1653
            ],
            [
                1653,
                1723
            ],
            [
                1723,
                1906
            ],
            [
                1906,
                2093
            ],
            [
                2093,
                2194
            ],
            [
                2194,
                2372
            ],
            [
                2372,
                2415
            ],
            [
                2415,
                2425
            ],
            [
                2425,
                2447
            ],
            [
                2447,
                2504
            ],
            [
                2504,
                2578
            ],
            [
                2578,
                2833
            ],
            [
                2833,
                2979
            ],
            [
                2979,
                3017
            ],
            [
                3017,
                3078
            ],
            [
                3078,
                3137
            ],
            [
                3137,
                3230
            ],
            [
                3230,
                3284
            ],
            [
                3284,
                3384
            ],
            [
                3384,
                3471
            ],
            [
                3471,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3555,
                3583
            ],
            [
                3583,
                3680
            ],
            [
                3680,
                3735
            ],
            [
                3735,
                3817
            ],
            [
                3817,
                3870
            ],
            [
                3870,
                3919
            ],
            [
                3919,
                4061
            ],
            [
                4061,
                4165
            ],
            [
                4165,
                4270
            ],
            [
                4270,
                4292
            ],
            [
                4292,
                4383
            ],
            [
                4383,
                4472
            ],
            [
                4472,
                4521
            ],
            [
                4521,
                4638
            ],
            [
                4638,
                4702
            ],
            [
                4702,
                4771
            ],
            [
                4771,
                4870
            ],
            [
                4870,
                4953
            ],
            [
                4953,
                4982
            ],
            [
                4982,
                5052
            ],
            [
                5052,
                5079
            ],
            [
                5079,
                5097
            ],
            [
                5097,
                5171
            ],
            [
                5171,
                5202
            ],
            [
                5202,
                5397
            ],
            [
                5397,
                5537
            ],
            [
                5537,
                5598
            ],
            [
                5598,
                5632
            ],
            [
                5632,
                5732
            ],
            [
                5732,
                5758
            ],
            [
                5758,
                5800
            ],
            [
                5800,
                5873
            ],
            [
                5873,
                5948
            ],
            [
                5948,
                5985
            ],
            [
                5985,
                6039
            ],
            [
                6039,
                6059
            ],
            [
                6059,
                6092
            ],
            [
                6092,
                6147
            ],
            [
                6147,
                6189
            ],
            [
                6189,
                6218
            ],
            [
                6218,
                6264
            ],
            [
                6264,
                6388
            ],
            [
                6388,
                6434
            ],
            [
                6434,
                6496
            ],
            [
                6496,
                6505
            ],
            [
                6505,
                6548
            ],
            [
                6548,
                6633
            ],
            [
                6633,
                6789
            ],
            [
                6789,
                6824
            ],
            [
                6824,
                6926
            ],
            [
                6926,
                7145
            ],
            [
                7145,
                7183
            ],
            [
                7183,
                7329
            ],
            [
                7329,
                7492
            ],
            [
                7492,
                7679
            ],
            [
                7679,
                7891
            ],
            [
                7891,
                8201
            ],
            [
                8201,
                8528
            ],
            [
                8528,
                8697
            ],
            [
                8697,
                8926
            ],
            [
                8926,
                8949
            ],
            [
                8949,
                9150
            ],
            [
                9150,
                9350
            ],
            [
                9350,
                9599
            ],
            [
                9599,
                9855
            ],
            [
                9855,
                10121
            ],
            [
                10121,
                10309
            ],
            [
                10309,
                10351
            ],
            [
                10351,
                10512
            ],
            [
                10512,
                10554
            ],
            [
                10554,
                10581
            ],
            [
                10581,
                10612
            ],
            [
                10612,
                10845
            ],
            [
                10845,
                10946
            ],
            [
                10946,
                11103
            ],
            [
                11103,
                11321
            ],
            [
                11321,
                11414
            ],
            [
                11414,
                11708
            ],
            [
                11708,
                11949
            ],
            [
                11949,
                12162
            ],
            [
                12162,
                12323
            ],
            [
                12323,
                12576
            ],
            [
                12576,
                12700
            ],
            [
                12700,
                12789
            ],
            [
                12789,
                12991
            ],
            [
                12991,
                13136
            ],
            [
                13136,
                13300
            ],
            [
                13300,
                13386
            ],
            [
                13386,
                13540
            ],
            [
                13540,
                13597
            ],
            [
                13597,
                13627
            ],
            [
                13627,
                13686
            ],
            [
                13686,
                13739
            ],
            [
                13739,
                13811
            ],
            [
                13811,
                13930
            ],
            [
                13930,
                14009
            ],
            [
                14009,
                14075
            ],
            [
                14075,
                14336
            ],
            [
                14336,
                14365
            ],
            [
                14365,
                14552
            ],
            [
                14552,
                14617
            ],
            [
                14617,
                14747
            ],
            [
                14747,
                14808
            ],
            [
                14808,
                14890
            ],
            [
                14890,
                15197
            ],
            [
                15197,
                15228
            ],
            [
                15228,
                15262
            ],
            [
                15262,
                15298
            ],
            [
                15298,
                15356
            ],
            [
                15356,
                15403
            ],
            [
                15403,
                15440
            ],
            [
                15440,
                15482
            ],
            [
                15482,
                15520
            ],
            [
                15520,
                15570
            ],
            [
                15570,
                15623
            ],
            [
                15623,
                15776
            ],
            [
                15776,
                15942
            ],
            [
                15942,
                16034
            ],
            [
                16034,
                16107
            ],
            [
                16107,
                16211
            ],
            [
                16211,
                16269
            ],
            [
                16269,
                16385
            ],
            [
                16385,
                16472
            ],
            [
                16472,
                16538
            ],
            [
                16538,
                16624
            ],
            [
                16624,
                16735
            ],
            [
                16735,
                16828
            ],
            [
                16828,
                17118
            ],
            [
                17118,
                17140
            ],
            [
                17140,
                17186
            ],
            [
                17186,
                17199
            ],
            [
                17199,
                17220
            ],
            [
                17220,
                17241
            ],
            [
                17241,
                17259
            ],
            [
                17259,
                17316
            ],
            [
                17316,
                17363
            ],
            [
                17363,
                17423
            ],
            [
                17423,
                17556
            ],
            [
                17556,
                17581
            ],
            [
                17581,
                17700
            ],
            [
                17700,
                17881
            ],
            [
                17881,
                17938
            ],
            [
                17938,
                17995
            ],
            [
                17995,
                18171
            ],
            [
                18171,
                18250
            ],
            [
                18250,
                18572
            ]
        ]
    },
    "abridged": {
        "text": "A few days before the dinner, Miss Longestaffe was seated in Lady Monogram's back drawing-room, discussing the terms on which the two tickets for the grand reception had been given to the Monograms; and the terms also on which Miss Longestaffe had been asked to spend two or three days with her dear friend Lady Monogram. Each lady wanted to get as much and to give as little as possible. In return for the two tickets, Lady Monogram was to chaperon Miss Longestaffe at the entertainment, to take Miss Longestaffe as a visitor for three days, and to have one party at her own house during that time, so that it might be seen that Miss Longestaffe had other friends in London besides the Melmottes.\nMiss Longestaffe felt that she was hardly receiving a fair price. The Melmotte tickets had reached their height, and there was a rush for them. Lady Monogram already had them in her desk. But the seller was complaining that as she had parted with her goods too cheap, some make-weight should be added to the price.\n\"As for that, my dear,\" said Miss Longestaffe, who had endeavoured to resume something of her old manners, \"I don't see what you mean at all. You meet Lady Julia Goldsheiner everywhere, and her father-in-law is Mr. Brehgert's junior partner.\"\n\"Lady Julia is Lady Julia, my dear, and young Mr. Goldsheiner hunts, and Damask says that he is one of the best shots at Hurlingham. I don't think Sir Damask would like me to ask Mr. Brehgert to dine here.\" Sir Damask had nothing to do with the matter; but Lady Monogram was very clever in the use which she made of her husband.\n\"May I speak to Sir Damask about it?\" asked Miss Longestaffe.\n\"Well, my dear, I really don't think you ought to do that.\"\n\"But Julia, when you tell me that Sir Damask cannot receive Mr. Brehgert, it does sound odd. City people are just as good as West-end people.\"\n\"A great deal better, I dare say. I'm not arguing about that. But we ain't big enough to introduce new-comers. I don't suppose there's anybody in London understands it better than you do, Georgiana, and therefore it's absurd my pretending to teach you. I go pretty well everywhere, as you are aware; and I shouldn't know Mr. Brehgert if I were to see him.\"\n\"You'll meet him at the Melmottes', and you're glad enough to go there.\"\n\"Quite true, my dear. And there's the butcher round the corner in Bond Street, or the man who comes to do my hair. If they were suddenly to turn out wonderful men, and go everywhere, no doubt I should be glad to have them here. Mr. Brehgert at present to me is like the butcher round the corner.\" Lady Monogram had the tickets safe under lock and key, or I think she would hardly have said this.\n\"He is not a bit like a butcher,\" said Miss Longestaffe, blazing up in real wrath.\n\"I did not say that he was.\"\n\"Yes, you did; and it was the unkindest thing you could possibly say. It was monstrous. How would you like it if I said that Sir Damask was like a hair-dresser?\"\n\"You can say so if you please. Sir Damask drives four in hand, rides as though he meant to break his neck, is one of the best shots going, and is supposed to understand a yacht as well as any other gentleman out. And I'm rather afraid that before he was married he used to box with all the prize-fighters. If that makes a man like a hair-dresser, well, there it is.\"\n\"How proud you are of his vices.\"\n\"He's very good-natured, my dear, and as he does not interfere with me, I don't interfere with him. I hope you'll do as well. I dare say Mr. Brehgert is good-natured.\"\n\"He's an excellent man of business, and is making a very large fortune.\"\n\"And has five or six grown-up children, who, no doubt, will be a comfort.\"\n\"If I don't mind them, why need you? You have none at all, and you find it lonely enough.\"\n\"Not at all lonely. I have everything that I desire. How hard you are trying to be ill-natured, Georgiana.\"\n\"Why did you say that he was a butcher?\"\n\"I said nothing of the kind. What I did say was that I don't care to risk my reputation on the appearance of new people at my table. If you like Mr. Brehgert to come here on Tuesday evening, when the rooms will be full, you can ask him; but as for having him to dinner, I won't do it.\"\nSo the matter was settled. Miss Longestaffe did ask Mr. Brehgert for the Tuesday evening, and the two ladies were again friends.\nPerhaps Lady Monogram was aware of Mr. Brehgert's resemblance to a butcher. He was a fat, greasy man, good-looking in a certain degree, about fifty, with hair dyed black, and beard and moustache dyed a dark purple colour. The charm of his face consisted in a pair of very bright black eyes, which were, however, set rather near together. He was stout, and had that look of command in his face which is common to master-butchers.\nBut Mr. Brehgert was considered to be a very good man of business, and was now regarded as being the leading member of the great financial firm of which he was the second partner. Old Mr. Todd's day was nearly done, and Mr. Brehgert was now supposed to be the moving spirit of the firm. He was a widower, living in a luxurious villa at Fulham with a family varying from an eldest son of eighteen, who had just been placed at a desk in the office, to the youngest girl of twelve, who was at school at Brighton. He was a man who always asked for what he wanted; and having made up his mind that he wanted a second wife, had asked Miss Georgiana Longestaffe to fill that situation. He had met her at the Melmottes', had entertained her, with Madame Melmotte and Marie, at his villa, had then proposed, and two days later had received an acceptance.\nPoor Miss Longestaffe! Although she had told Lady Monogram of her engagement, she had not yet found courage to tell her family. The man was absolutely a Jew; there was no doubt of it. Goldsheiner was also a Jew, whom Lady Julia Start had married; and Georgiana had counted up ever so many instances of \"decent people\" who had married Jews or Jewesses. Lord Frederic Framlingham had married a Berrenhoffer; and Lord Frederic's wife and Lady Julia Goldsheiner were seen everywhere. She was sure that progress in society would soon make it a matter of indifference whether anybody was Jew or Christian.\nFor herself, she was above all personal prejudices of that kind. Jew, Turk, or infidel was nothing to her. Of course she would go to church. It was the proper thing to do. As to her husband, though she did not suppose that she could ever get him to church, she thought that she might induce him to go nowhere, so that she could pass him off as a Christian.\nBut she was afraid of her father and mother. Lady Pomona was distressingly old-fashioned, and had often spoken with horror even of the approach of a Jew. Unfortunately, Georgiana in her earlier days had echoed her mother's sentiments. And then her father - on the admission of Jews into parliament, he was certain that England's glory was sunk for ever. How could she tell her parents that she was engaged to marry a man who went to synagogue on a Saturday and carried out every other filthy abomination of the despised people?\nThat Mr. Brehgert was a fat, greasy man of fifty, conspicuous for hair-dye, was in itself distressing: but this minor distress was swallowed up in the greater. Miss Longestaffe had begun life with very high aspirations. At nineteen she had thought that all the world was before her. With her commanding figure, regular features, and bright complexion, she had regarded herself as one of the beauties of the day, and had considered herself entitled to demand wealth and a coronet. At twenty-three, any young peer, or peer's eldest son, with a house in town and in the country, might have sufficed. Twenty-five and six had been the years for baronets and squires; and even a leading fashionable lawyer or two had been marked by her as sufficient.\nBut now she was aware that she had always fixed her price a little too high. On three things she was still determined: that she would not be poor, she would not be banished from London, and she would not be an old maid. Yet how was this to be done? Lovers are as plentiful as blackberries for girls of nineteen, but as rare as hothouse fruits for girls of twenty-nine. Brehgert was rich, would live in London, and would be a husband. People did such odd things now and \"lived them down\"; she could see no reason why she should not do this and live it down. Courage was the one thing necessary; that and perseverance.\nShe had plucked up enough courage to declare her fate to her old friend Julia Monogram, remembering as she did so how in days long past the two had scattered their scorn upon some poor girl who had married a man with a Jewish name.\n\"Dear me,\" said Lady Monogram. \"Todd, Brehgert, and Goldsheiner! Mr. Todd is - one of us, I suppose.\"\n\"Yes,\" said Georgiana boldly, \"and Mr. Brehgert is a Jew. His name is Ezekiel Brehgert. You can say what you like about it.\"\n\"I don't say anything about it, my dear.\"\n\"And you can think anything you like. Things are changed since you and I were younger.\"\n\"Very much changed, it appears,\" said Lady Monogram.\nBut to tell her father and mother required a higher spirit, and that spirit had not yet come to Georgiana. On the morning before she left the Melmottes in Bruton Street, her lover had been with her. The Melmottes of course knew of the engagement and quite approved of it. Mr. Brehgert, therefore, had been allowed to come and go as he pleased. On that morning they were sitting alone in some back room, and Brehgert was pressing for an early wedding day.\n\"I don't think we need talk of that yet, Mr. Brehgert,\" she said.\n\"You might as well call me Ezekiel,\" he remarked. Georgiana frowned. \"Mrs. Brehgert\" - he alluded of course to the mother of his children - \"used to call me Ezzy.\"\n\"Perhaps I shall do so some day,\" said Miss Longestaffe, thinking it impossible that she should ever call him Ezzy.\n\"And ven shall it be? I should say as early in August as possible.\"\n\"In August!\" she almost screamed. It was already July.\n\"Vy not, my dear? Ve would have our little holiday at Vienna. I have business there, and know many friends.\" Then he pressed her to fix some day in the next month. It would be expedient to be married from the Melmottes' house, and the Melmottes would leave town in August.\nThere was truth in this. Unless married from the Melmottes' house, she must go down to Caversham for the occasion - which would be intolerable. No; she must separate herself altogether from father and mother, and become one with the Melmottes and the Brehgerts - till she could live it down.\n\"I must ask mamma about it,\" said Georgiana. Mr. Brehgert, with the customary good-humour of his people, was satisfied, and went away promising to meet his love at the great Melmotte reception. Then she sat silent, thinking how she should declare the matter to her family. Would it not be better for her to say at once that there must be a division among them, and acknowledge that she had gone out from among the Longestaffes altogether, and had become one with the Melmottes, Brehgerts, and Goldsheiners?",
        "paragraph_chars": [
            [
                0,
                698
            ],
            [
                698,
                1013
            ],
            [
                1013,
                1256
            ],
            [
                1256,
                1585
            ],
            [
                1585,
                1647
            ],
            [
                1647,
                1707
            ],
            [
                1707,
                1850
            ],
            [
                1850,
                2207
            ],
            [
                2207,
                2280
            ],
            [
                2280,
                2676
            ],
            [
                2676,
                2759
            ],
            [
                2759,
                2788
            ],
            [
                2788,
                2950
            ],
            [
                2950,
                3317
            ],
            [
                3317,
                3351
            ],
            [
                3351,
                3519
            ],
            [
                3519,
                3592
            ],
            [
                3592,
                3667
            ],
            [
                3667,
                3758
            ],
            [
                3758,
                3866
            ],
            [
                3866,
                3907
            ],
            [
                3907,
                4193
            ],
            [
                4193,
                4322
            ],
            [
                4322,
                4751
            ],
            [
                4751,
                5597
            ],
            [
                5597,
                6197
            ],
            [
                6197,
                6554
            ],
            [
                6554,
                7082
            ],
            [
                7082,
                7827
            ],
            [
                7827,
                8444
            ],
            [
                8444,
                8676
            ],
            [
                8676,
                8778
            ],
            [
                8778,
                8903
            ],
            [
                8903,
                8945
            ],
            [
                8945,
                9033
            ],
            [
                9033,
                9086
            ],
            [
                9086,
                9541
            ],
            [
                9541,
                9607
            ],
            [
                9607,
                9771
            ],
            [
                9771,
                9887
            ],
            [
                9887,
                9955
            ],
            [
                9955,
                10010
            ],
            [
                10010,
                10283
            ],
            [
                10283,
                10575
            ],
            [
                10575,
                11081
            ]
        ],
        "segment_chars": [
            [
                0,
                322
            ],
            [
                322,
                389
            ],
            [
                389,
                698
            ],
            [
                698,
                764
            ],
            [
                764,
                842
            ],
            [
                842,
                886
            ],
            [
                886,
                1013
            ],
            [
                1013,
                1155
            ],
            [
                1155,
                1256
            ],
            [
                1256,
                1389
            ],
            [
                1389,
                1463
            ],
            [
                1463,
                1585
            ],
            [
                1585,
                1623
            ],
            [
                1623,
                1647
            ],
            [
                1647,
                1707
            ],
            [
                1707,
                1800
            ],
            [
                1800,
                1850
            ],
            [
                1850,
                1884
            ],
            [
                1884,
                1912
            ],
            [
                1912,
                1961
            ],
            [
                1961,
                2103
            ],
            [
                2103,
                2207
            ],
            [
                2207,
                2280
            ],
            [
                2280,
                2302
            ],
            [
                2302,
                2395
            ],
            [
                2395,
                2508
            ],
            [
                2508,
                2577
            ],
            [
                2577,
                2676
            ],
            [
                2676,
                2759
            ],
            [
                2759,
                2788
            ],
            [
                2788,
                2858
            ],
            [
                2858,
                2876
            ],
            [
                2876,
                2950
            ],
            [
                2950,
                2981
            ],
            [
                2981,
                3163
            ],
            [
                3163,
                3256
            ],
            [
                3256,
                3317
            ],
            [
                3317,
                3351
            ],
            [
                3351,
                3451
            ],
            [
                3451,
                3477
            ],
            [
                3477,
                3519
            ],
            [
                3519,
                3592
            ],
            [
                3592,
                3667
            ],
            [
                3667,
                3704
            ],
            [
                3704,
                3758
            ],
            [
                3758,
                3778
            ],
            [
                3778,
                3811
            ],
            [
                3811,
                3866
            ],
            [
                3866,
                3907
            ],
            [
                3907,
                3936
            ],
            [
                3936,
                4040
            ],
            [
                4040,
                4193
            ],
            [
                4193,
                4220
            ],
            [
                4220,
                4322
            ],
            [
                4322,
                4398
            ],
            [
                4398,
                4544
            ],
            [
                4544,
                4660
            ],
            [
                4660,
                4751
            ],
            [
                4751,
                4931
            ],
            [
                4931,
                5038
            ],
            [
                5038,
                5261
            ],
            [
                5261,
                5430
            ],
            [
                5430,
                5597
            ],
            [
                5597,
                5620
            ],
            [
                5620,
                5725
            ],
            [
                5725,
                5781
            ],
            [
                5781,
                5949
            ],
            [
                5949,
                6077
            ],
            [
                6077,
                6197
            ],
            [
                6197,
                6262
            ],
            [
                6262,
                6304
            ],
            [
                6304,
                6338
            ],
            [
                6338,
                6369
            ],
            [
                6369,
                6554
            ],
            [
                6554,
                6599
            ],
            [
                6599,
                6708
            ],
            [
                6708,
                6789
            ],
            [
                6789,
                6908
            ],
            [
                6908,
                7082
            ],
            [
                7082,
                7242
            ],
            [
                7242,
                7302
            ],
            [
                7302,
                7365
            ],
            [
                7365,
                7562
            ],
            [
                7562,
                7679
            ],
            [
                7679,
                7827
            ],
            [
                7827,
                7904
            ],
            [
                7904,
                8047
            ],
            [
                8047,
                8076
            ],
            [
                8076,
                8196
            ],
            [
                8196,
                8261
            ],
            [
                8261,
                8384
            ],
            [
                8384,
                8444
            ],
            [
                8444,
                8676
            ],
            [
                8676,
                8707
            ],
            [
                8707,
                8741
            ],
            [
                8741,
                8778
            ],
            [
                8778,
                8836
            ],
            [
                8836,
                8866
            ],
            [
                8866,
                8903
            ],
            [
                8903,
                8945
            ],
            [
                8945,
                8983
            ],
            [
                8983,
                9033
            ],
            [
                9033,
                9086
            ],
            [
                9086,
                9193
            ],
            [
                9193,
                9285
            ],
            [
                9285,
                9358
            ],
            [
                9358,
                9430
            ],
            [
                9430,
                9541
            ],
            [
                9541,
                9607
            ],
            [
                9607,
                9657
            ],
            [
                9657,
                9676
            ],
            [
                9676,
                9771
            ],
            [
                9771,
                9887
            ],
            [
                9887,
                9909
            ],
            [
                9909,
                9955
            ],
            [
                9955,
                9968
            ],
            [
                9968,
                9989
            ],
            [
                9989,
                10010
            ],
            [
                10010,
                10028
            ],
            [
                10028,
                10072
            ],
            [
                10072,
                10119
            ],
            [
                10119,
                10174
            ],
            [
                10174,
                10283
            ],
            [
                10283,
                10308
            ],
            [
                10308,
                10427
            ],
            [
                10427,
                10575
            ],
            [
                10575,
                10620
            ],
            [
                10620,
                10769
            ],
            [
                10769,
                10848
            ],
            [
                10848,
                11081
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                18,
                21
            ],
            [
                28,
                145
            ],
            [
                146,
                149
            ],
            [
                150,
                174
            ],
            [
                181,
                183
            ],
            [
                184,
                187
            ],
            [
                188,
                191
            ],
            [
                197,
                322
            ],
            [
                322,
                331
            ],
            [
                339,
                387
            ],
            [
                387,
                389
            ],
            [
                389,
                391
            ],
            [
                399,
                402
            ],
            [
                403,
                418
            ],
            [
                418,
                437
            ],
            [
                438,
                588
            ],
            [
                589,
                593
            ],
            [
                594,
                691
            ],
            [
                696,
                697
            ],
            [
                698,
                719
            ],
            [
                725,
                728
            ],
            [
                733,
                756
            ],
            [
                762,
                764
            ],
            [
                764,
                784
            ],
            [
                785,
                788
            ],
            [
                809,
                814
            ],
            [
                815,
                842
            ],
            [
                842,
                855
            ],
            [
                856,
                863
            ],
            [
                864,
                867
            ],
            [
                873,
                886
            ],
            [
                886,
                889
            ],
            [
                890,
                1005
            ],
            [
                1006,
                1013
            ],
            [
                1013,
                1063
            ],
            [
                1064,
                1155
            ],
            [
                1155,
                1256
            ],
            [
                1256,
                1317
            ],
            [
                1318,
                1389
            ],
            [
                1389,
                1463
            ],
            [
                1467,
                1473
            ],
            [
                1474,
                1477
            ],
            [
                1486,
                1488
            ],
            [
                1492,
                1496
            ],
            [
                1507,
                1512
            ],
            [
                1518,
                1526
            ],
            [
                1527,
                1584
            ],
            [
                1585,
                1623
            ],
            [
                1623,
                1645
            ],
            [
                1645,
                1647
            ],
            [
                1647,
                1704
            ],
            [
                1708,
                1711
            ],
            [
                1712,
                1800
            ],
            [
                1800,
                1850
            ],
            [
                1850,
                1884
            ],
            [
                1884,
                1912
            ],
            [
                1912,
                1961
            ],
            [
                1961,
                2103
            ],
            [
                2103,
                2207
            ],
            [
                2207,
                2246
            ],
            [
                2247,
                2280
            ],
            [
                2280,
                2302
            ],
            [
                2306,
                2395
            ],
            [
                2395,
                2508
            ],
            [
                2508,
                2577
            ],
            [
                2577,
                2676
            ],
            [
                2676,
                2759
            ],
            [
                2759,
                2788
            ],
            [
                2788,
                2858
            ],
            [
                2858,
                2876
            ],
            [
                2876,
                2950
            ],
            [
                2950,
                2981
            ],
            [
                2981,
                3055
            ],
            [
                3055,
                3163
            ],
            [
                3163,
                3254
            ],
            [
                3254,
                3256
            ],
            [
                3256,
                3308
            ],
            [
                3312,
                3317
            ],
            [
                3317,
                3351
            ],
            [
                3351,
                3451
            ],
            [
                3451,
                3477
            ],
            [
                3477,
                3519
            ],
            [
                3519,
                3592
            ],
            [
                3592,
                3667
            ],
            [
                3667,
                3704
            ],
            [
                3704,
                3758
            ],
            [
                3758,
                3778
            ],
            [
                3778,
                3811
            ],
            [
                3811,
                3866
            ],
            [
                3866,
                3896
            ],
            [
                3904,
                3907
            ],
            [
                3907,
                3936
            ],
            [
                3936,
                3954
            ],
            [
                3955,
                3967
            ],
            [
                3973,
                3983
            ],
            [
                3984,
                4040
            ],
            [
                4040,
                4178
            ],
            [
                4179,
                4184
            ],
            [
                4185,
                4187
            ],
            [
                4188,
                4192
            ],
            [
                4193,
                4210
            ],
            [
                4211,
                4220
            ],
            [
                4220,
                4322
            ],
            [
                4322,
                4343
            ],
            [
                4357,
                4369
            ],
            [
                4372,
                4383
            ],
            [
                4384,
                4396
            ],
            [
                4396,
                4398
            ],
            [
                4398,
                4544
            ],
            [
                4544,
                4637
            ],
            [
                4645,
                4658
            ],
            [
                4658,
                4660
            ],
            [
                4660,
                4672
            ],
            [
                4672,
                4673
            ],
            [
                4674,
                4720
            ],
            [
                4724,
                4749
            ],
            [
                4749,
                4750
            ],
            [
                4751,
                4847
            ],
            [
                4848,
                4931
            ],
            [
                4937,
                4965
            ],
            [
                4965,
                5038
            ],
            [
                5038,
                5107
            ],
            [
                5108,
                5261
            ],
            [
                5261,
                5430
            ],
            [
                5430,
                5519
            ],
            [
                5520,
                5548
            ],
            [
                5548,
                5562
            ],
            [
                5569,
                5584
            ],
            [
                5595,
                5597
            ],
            [
                5597,
                5620
            ],
            [
                5620,
                5636
            ],
            [
                5642,
                5655
            ],
            [
                5656,
                5658
            ],
            [
                5659,
                5662
            ],
            [
                5673,
                5686
            ],
            [
                5687,
                5725
            ],
            [
                5725,
                5754
            ],
            [
                5755,
                5760
            ],
            [
                5761,
                5764
            ],
            [
                5768,
                5773
            ],
            [
                5774,
                5776
            ],
            [
                5779,
                5781
            ],
            [
                5781,
                5792
            ],
            [
                5793,
                5796
            ],
            [
                5802,
                5842
            ],
            [
                5858,
                5861
            ],
            [
                5862,
                5895
            ],
            [
                5896,
                5949
            ],
            [
                5949,
                5971
            ],
            [
                5975,
                5988
            ],
            [
                5989,
                5999
            ],
            [
                6001,
                6006
            ],
            [
                6007,
                6077
            ],
            [
                6077,
                6094
            ],
            [
                6095,
                6103
            ],
            [
                6104,
                6106
            ],
            [
                6107,
                6114
            ],
            [
                6115,
                6196
            ],
            [
                6197,
                6208
            ],
            [
                6208,
                6209
            ],
            [
                6210,
                6217
            ],
            [
                6218,
                6262
            ],
            [
                6262,
                6304
            ],
            [
                6304,
                6336
            ],
            [
                6336,
                6338
            ],
            [
                6338,
                6369
            ],
            [
                6369,
                6453
            ],
            [
                6454,
                6518
            ],
            [
                6525,
                6553
            ],
            [
                6554,
                6599
            ],
            [
                6599,
                6651
            ],
            [
                6652,
                6706
            ],
            [
                6708,
                6721
            ],
            [
                6721,
                6756
            ],
            [
                6764,
                6789
            ],
            [
                6789,
                6808
            ],
            [
                6811,
                6813
            ],
            [
                6814,
                6817
            ],
            [
                6828,
                6830
            ],
            [
                6831,
                6851
            ],
            [
                6851,
                6852
            ],
            [
                6853,
                6872
            ],
            [
                6873,
                6880
            ],
            [
                6883,
                6888
            ],
            [
                6889,
                6908
            ],
            [
                6908,
                6926
            ],
            [
                6931,
                6938
            ],
            [
                6939,
                6978
            ],
            [
                6979,
                7057
            ],
            [
                7061,
                7082
            ],
            [
                7082,
                7184
            ],
            [
                7185,
                7242
            ],
            [
                7242,
                7258
            ],
            [
                7259,
                7300
            ],
            [
                7300,
                7302
            ],
            [
                7302,
                7313
            ],
            [
                7314,
                7365
            ],
            [
                7365,
                7400
            ],
            [
                7401,
                7562
            ],
            [
                7562,
                7564
            ],
            [
                7565,
                7578
            ],
            [
                7579,
                7679
            ],
            [
                7679,
                7825
            ],
            [
                7825,
                7826
            ],
            [
                7827,
                7853
            ],
            [
                7854,
                7904
            ],
            [
                7904,
                7944
            ],
            [
                7946,
                7973
            ],
            [
                7974,
                8016
            ],
            [
                8017,
                8047
            ],
            [
                8051,
                8076
            ],
            [
                8076,
                8082
            ],
            [
                8083,
                8086
            ],
            [
                8090,
                8115
            ],
            [
                8120,
                8142
            ],
            [
                8146,
                8150
            ],
            [
                8154,
                8169
            ],
            [
                8174,
                8196
            ],
            [
                8196,
                8261
            ],
            [
                8261,
                8312
            ],
            [
                8315,
                8374
            ],
            [
                8378,
                8384
            ],
            [
                8384,
                8419
            ],
            [
                8421,
                8443
            ],
            [
                8444,
                8462
            ],
            [
                8470,
                8477
            ],
            [
                8478,
                8515
            ],
            [
                8516,
                8521
            ],
            [
                8530,
                8531
            ],
            [
                8544,
                8579
            ],
            [
                8588,
                8674
            ],
            [
                8674,
                8675
            ],
            [
                8676,
                8707
            ],
            [
                8707,
                8741
            ],
            [
                8741,
                8752
            ],
            [
                8755,
                8778
            ],
            [
                8778,
                8836
            ],
            [
                8836,
                8864
            ],
            [
                8864,
                8866
            ],
            [
                8866,
                8903
            ],
            [
                8903,
                8945
            ],
            [
                8945,
                8983
            ],
            [
                8983,
                9033
            ],
            [
                9033,
                9085
            ],
            [
                9086,
                9144
            ],
            [
                9144,
                9169
            ],
            [
                9170,
                9181
            ],
            [
                9191,
                9193
            ],
            [
                9193,
                9285
            ],
            [
                9285,
                9358
            ],
            [
                9358,
                9428
            ],
            [
                9428,
                9430
            ],
            [
                9446,
                9527
            ],
            [
                9536,
                9540
            ],
            [
                9541,
                9607
            ],
            [
                9607,
                9625
            ],
            [
                9626,
                9641
            ],
            [
                9641,
                9657
            ],
            [
                9657,
                9674
            ],
            [
                9674,
                9676
            ],
            [
                9676,
                9691
            ],
            [
                9694,
                9744
            ],
            [
                9747,
                9771
            ],
            [
                9771,
                9827
            ],
            [
                9837,
                9839
            ],
            [
                9851,
                9887
            ],
            [
                9887,
                9909
            ],
            [
                9909,
                9955
            ],
            [
                9955,
                9968
            ],
            [
                9968,
                9989
            ],
            [
                9989,
                10010
            ],
            [
                10010,
                10028
            ],
            [
                10028,
                10060
            ],
            [
                10061,
                10072
            ],
            [
                10072,
                10119
            ],
            [
                10119,
                10138
            ],
            [
                10139,
                10174
            ],
            [
                10174,
                10195
            ],
            [
                10199,
                10271
            ],
            [
                10272,
                10282
            ],
            [
                10283,
                10308
            ],
            [
                10308,
                10396
            ],
            [
                10399,
                10427
            ],
            [
                10427,
                10430
            ],
            [
                10431,
                10543
            ],
            [
                10551,
                10573
            ],
            [
                10573,
                10574
            ],
            [
                10575,
                10582
            ],
            [
                10583,
                10620
            ],
            [
                10620,
                10693
            ],
            [
                10693,
                10718
            ],
            [
                10722,
                10769
            ],
            [
                10769,
                10848
            ],
            [
                10848,
                10885
            ],
            [
                10886,
                10935
            ],
            [
                10952,
                10960
            ],
            [
                10961,
                11081
            ]
        ],
        "row_chars": [
            [
                0,
                322
            ],
            [
                322,
                389
            ],
            [
                389,
                698
            ],
            [
                698,
                764
            ],
            [
                764,
                842
            ],
            [
                842,
                886
            ],
            [
                886,
                1013
            ],
            [
                1013,
                1155
            ],
            [
                1155,
                1256
            ],
            [
                1256,
                1389
            ],
            [
                1389,
                1389
            ],
            [
                1389,
                1389
            ],
            [
                1389,
                1389
            ],
            [
                1389,
                1389
            ],
            [
                1389,
                1463
            ],
            [
                1463,
                1585
            ],
            [
                1585,
                1585
            ],
            [
                1585,
                1623
            ],
            [
                1623,
                1647
            ],
            [
                1647,
                1707
            ],
            [
                1707,
                1707
            ],
            [
                1707,
                1707
            ],
            [
                1707,
                1800
            ],
            [
                1800,
                1800
            ],
            [
                1800,
                1850
            ],
            [
                1850,
                1884
            ],
            [
                1884,
                1912
            ],
            [
                1912,
                1912
            ],
            [
                1912,
                1912
            ],
            [
                1912,
                1912
            ],
            [
                1912,
                1912
            ],
            [
                1912,
                1961
            ],
            [
                1961,
                2103
            ],
            [
                2103,
                2207
            ],
            [
                2207,
                2280
            ],
            [
                2280,
                2302
            ],
            [
                2302,
                2302
            ],
            [
                2302,
                2395
            ],
            [
                2395,
                2395
            ],
            [
                2395,
                2508
            ],
            [
                2508,
                2508
            ],
            [
                2508,
                2577
            ],
            [
                2577,
                2676
            ],
            [
                2676,
                2759
            ],
            [
                2759,
                2788
            ],
            [
                2788,
                2858
            ],
            [
                2858,
                2858
            ],
            [
                2858,
                2876
            ],
            [
                2876,
                2950
            ],
            [
                2950,
                2981
            ],
            [
                2981,
                3163
            ],
            [
                3163,
                3256
            ],
            [
                3256,
                3317
            ],
            [
                3317,
                3351
            ],
            [
                3351,
                3451
            ],
            [
                3451,
                3477
            ],
            [
                3477,
                3519
            ],
            [
                3519,
                3592
            ],
            [
                3592,
                3667
            ],
            [
                3667,
                3704
            ],
            [
                3704,
                3758
            ],
            [
                3758,
                3778
            ],
            [
                3778,
                3811
            ],
            [
                3811,
                3866
            ],
            [
                3866,
                3907
            ],
            [
                3907,
                3936
            ],
            [
                3936,
                3936
            ],
            [
                3936,
                4040
            ],
            [
                4040,
                4040
            ],
            [
                4040,
                4040
            ],
            [
                4040,
                4040
            ],
            [
                4040,
                4040
            ],
            [
                4040,
                4040
            ],
            [
                4040,
                4193
            ],
            [
                4193,
                4220
            ],
            [
                4220,
                4322
            ],
            [
                4322,
                4398
            ],
            [
                4398,
                4398
            ],
            [
                4398,
                4544
            ],
            [
                4544,
                4660
            ],
            [
                4660,
                4751
            ],
            [
                4751,
                4931
            ],
            [
                4931,
                5038
            ],
            [
                5038,
                5261
            ],
            [
                5261,
                5430
            ],
            [
                5430,
                5597
            ],
            [
                5597,
                5620
            ],
            [
                5620,
                5725
            ],
            [
                5725,
                5781
            ],
            [
                5781,
                5949
            ],
            [
                5949,
                6077
            ],
            [
                6077,
                6197
            ],
            [
                6197,
                6262
            ],
            [
                6262,
                6304
            ],
            [
                6304,
                6304
            ],
            [
                6304,
                6338
            ],
            [
                6338,
                6338
            ],
            [
                6338,
                6369
            ],
            [
                6369,
                6554
            ],
            [
                6554,
                6554
            ],
            [
                6554,
                6599
            ],
            [
                6599,
                6708
            ],
            [
                6708,
                6789
            ],
            [
                6789,
                6908
            ],
            [
                6908,
                6908
            ],
            [
                6908,
                7082
            ],
            [
                7082,
                7242
            ],
            [
                7242,
                7302
            ],
            [
                7302,
                7302
            ],
            [
                7302,
                7365
            ],
            [
                7365,
                7562
            ],
            [
                7562,
                7679
            ],
            [
                7679,
                7827
            ],
            [
                7827,
                7904
            ],
            [
                7904,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8076
            ],
            [
                8076,
                8196
            ],
            [
                8196,
                8261
            ],
            [
                8261,
                8384
            ],
            [
                8384,
                8444
            ],
            [
                8444,
                8444
            ],
            [
                8444,
                8676
            ],
            [
                8676,
                8707
            ],
            [
                8707,
                8741
            ],
            [
                8741,
                8778
            ],
            [
                8778,
                8836
            ],
            [
                8836,
                8866
            ],
            [
                8866,
                8903
            ],
            [
                8903,
                8945
            ],
            [
                8945,
                8983
            ],
            [
                8983,
                9033
            ],
            [
                9033,
                9086
            ],
            [
                9086,
                9086
            ],
            [
                9086,
                9193
            ],
            [
                9193,
                9285
            ],
            [
                9285,
                9358
            ],
            [
                9358,
                9358
            ],
            [
                9358,
                9358
            ],
            [
                9358,
                9430
            ],
            [
                9430,
                9541
            ],
            [
                9541,
                9607
            ],
            [
                9607,
                9657
            ],
            [
                9657,
                9676
            ],
            [
                9676,
                9771
            ],
            [
                9771,
                9887
            ],
            [
                9887,
                9909
            ],
            [
                9909,
                9955
            ],
            [
                9955,
                9968
            ],
            [
                9968,
                9989
            ],
            [
                9989,
                10010
            ],
            [
                10010,
                10028
            ],
            [
                10028,
                10072
            ],
            [
                10072,
                10119
            ],
            [
                10119,
                10174
            ],
            [
                10174,
                10283
            ],
            [
                10283,
                10308
            ],
            [
                10308,
                10427
            ],
            [
                10427,
                10575
            ],
            [
                10575,
                10575
            ],
            [
                10575,
                10620
            ],
            [
                10620,
                10769
            ],
            [
                10769,
                10848
            ],
            [
                10848,
                11081
            ]
        ]
    }
}