{
    "original": {
        "text": "Lady Carbury's desire for a union between Roger and her daughter was greatly increased by her solicitude in respect to her son. Since Roger's offer had first been made, Felix had gone on from bad to worse, till his condition had become one of hopeless embarrassment. If her daughter could but be settled in the world, Lady Carbury said to herself, she could then devote herself to the interests of her son. She had no very clear idea of what that devotion would be. But she did know that she had paid so much money for him, and would have so much more extracted from her, that it might well come to pass that she would be unable to keep a home for her daughter. In all these troubles she constantly appealed to Roger Carbury for advice,--which, however, she never followed. He recommended her to give up her house in town, to find a home for her daughter elsewhere, and also for Felix if he would consent to follow her. Should he not so consent, then let the young man bear the brunt of his own misdoings. Doubtless, when he could no longer get bread in London he would find her out. Roger was always severe when he spoke of the baronet,--or seemed to Lady Carbury to be severe.\nBut, in truth, she did not ask for advice in order that she might follow it. She had plans in her head with which she knew that Roger would not sympathise. She still thought that Sir Felix might bloom and burst out into grandeur, wealth, and fashion, as the husband of a great heiress, and in spite of her son's vices, was proud of him in that anticipation. When he succeeded in obtaining from her money, as in the case of that 20,--when, with brazen-faced indifference to her remonstrances, he started off to his club at two in the morning, when with impudent drollery he almost boasted of the hopelessness of his debts, a sickness of heart would come upon her, and she would weep hysterically, and lie the whole night without sleeping. But could he marry Miss Melmotte, and thus conquer all his troubles by means of his own personal beauty,--then she would be proud of all that had passed. With such a condition of mind Roger Carbury could have no sympathy. To him it seemed that a gentleman was disgraced who owed money to a tradesman which he could not pay. And Lady Carbury's heart was high with other hopes,--in spite of her hysterics and her fears. The \"Criminal Queens\" might be a great literary success. She almost thought that it would be a success. Messrs. Leadham and Loiter, the publishers, were civil to her. Mr. Broune had promised. Mr. Booker had said that he would see what could be done. She had gathered from Mr. Alf's caustic and cautious words that the book would be noticed in the \"Evening Pulpit.\" No;--she would not take dear Roger's advice as to leaving London. But she would continue to ask Roger's advice. Men like to have their advice asked. And, if possible, she would arrange the marriage. What country retirement could be so suitable for a Lady Carbury when she wished to retire for awhile,--as Carbury Manor, the seat of her own daughter? And then her mind would fly away into regions of bliss. If only by the end of this season Henrietta could be engaged to her cousin, Felix be the husband of the richest bride in Europe, and she be the acknowledged author of the cleverest book of the year, what a Paradise of triumph might still be open to her after all her troubles! Then the sanguine nature of the woman would bear her up almost to exultation, and for an hour she would be happy, in spite of everything.\nA few days after the ball Roger Carbury was up in town, and was closeted with her in her back drawing-room. The declared cause of his coming was the condition of the baronet's affairs and the indispensable necessity,--so Roger thought,--of taking some steps by which at any rate the young man's present expenses might be brought to an end. It was horrible to him that a man who had not a shilling in the world or any prospect of a shilling, who had nothing and never thought of earning anything, should have hunters! He was very much in earnest about it, and quite prepared to speak his mind to the young man himself,--if he could get hold of him. \"Where is he now, Lady Carbury;--at this moment?\"\n\"I think he's out with the Baron.\" Being \"out with the Baron\" meant that the young man was hunting with the stag hounds some forty miles away from London.\n\"How does he manage it? Whose horses does he ride? Who pays for them?\"\n\"Don't be angry with me, Roger. What can I do to prevent it?\"\n\"I think you should refuse to have anything to do with him while he continues in such courses.\"\n\"My own son!\"\n\"Yes;--exactly. But what is to be the end of it? Is he to be allowed to ruin you, and Hetta? It can't go on long.\"\n\"You wouldn't have me throw him over.\"\n\"I think he is throwing you over. And then it is so thoroughly dishonest,--so ungentlemanlike! I don't understand how it goes on from day to day. I suppose you don't supply him with ready money.\"\n\"He has had a little.\"\nRoger frowned angrily. \"I can understand that you should provide him with bed and food, but not that you should pander to his vices by giving him money.\" This was very plain speaking, and Lady Carbury winced under it. \"The kind of life that he is leading requires a large income of itself. I understand the thing, and know that with all I have in the world I could not do it myself.\"\n\"You are so different.\"\n\"I am older of course,--very much older. But he is not so young that he should not begin to comprehend. Has he any money beyond what you give him?\"\nThen Lady Carbury revealed certain suspicions which she had begun to entertain during the last day or two. \"I think he has been playing.\"\n\"That is the way to lose money,--not to get it,\" said Roger.\n\"I suppose somebody wins,--sometimes.\"\n\"They who win are the sharpers. They who lose are the dupes. I would sooner that he were a fool than a knave.\"\n\"O Roger, you are so severe!\"\n\"You say he plays. How would he pay, were he to lose?\"\n\"I know nothing about it. I don't even know that he does play; but I have reason to think that during the last week he has had money at his command. Indeed I have seen it. He comes home at all manner of hours and sleeps late. Yesterday I went into his room about ten and did not wake him. There were notes and gold lying on his table;--ever so much.\"\n\"Why did you not take them?\"\n\"What; rob my own boy?\"\n\"When you tell me that you are absolutely in want of money to pay your own bills, and that he has not hesitated to take yours from you! Why does he not repay you what he has borrowed?\"\n\"Ah, indeed;--why not? He ought to if he has it. And there were papers there;--I. O. U.'s, signed by other men.\"\n\"You looked at them.\"\n\"I saw as much as that. It is not that I am curious, but one does feel about one's own son. I think he has bought another horse. A groom came here and said something about it to the servants.\"\n\"Oh dear;--oh dear!\"\n\"If you could only induce him to stop the gambling! Of course it is very bad whether he wins or loses,--though I am sure that Felix would do nothing unfair. Nobody ever said that of him. If he has won money, it would be a great comfort if he would let me have some of it,--for, to tell the truth, I hardly know how to turn. I am sure nobody can say that I spend it on myself.\"\nThen Roger again repeated his advice. There could be no use in attempting to keep up the present kind of life in Welbeck Street. Welbeck Street might be very well without a penniless spendthrift such as Sir Felix, but must be ruinous under the present conditions. If Lady Carbury felt, as no doubt she did feel, bound to afford a home to her ruined son in spite of all his wickedness and folly, that home should be found far away from London. If he chose to remain in London, let him do so on his own resources. The young man should make up his mind to do something for himself. A career might possibly be opened for him in India. \"If he be a man he would sooner break stones than live on you,\" said Roger. Yes, he would see his cousin to-morrow and speak to him;--that is if he could possibly find him. \"Young men who gamble all night, and hunt all day are not easily found.\" But he would come at twelve as Felix generally breakfasted at that hour. Then he gave an assurance to Lady Carbury which to her was not the least comfortable part of the interview. In the event of her son not giving her the money which she at once required he, Roger, would lend her a hundred pounds till her half year's income should be due. After that his voice changed altogether, as he asked a question on another subject, \"Can I see Henrietta to-morrow?\"\n\"Certainly;--why not? She is at home now, I think.\"\n\"I will wait till to-morrow,--when I call to see Felix. I should like her to know that I am coming. Paul Montague was in town the other day. He was here, I suppose?\"\n\"Yes;--he called.\"\n\"Was that all you saw of him?\"\n\"He was at the Melmottes' ball. Felix got a card for him;--and we were there. Has he gone down to Carbury?\"\n\"No;--not to Carbury. I think he had some business about his partners at Liverpool. There is another case of a young man without anything to do. Not that Paul is at all like Sir Felix.\" This he was induced to say by the spirit of honesty which was always strong within him.\n\"Don't be too hard upon poor Felix,\" said Lady Carbury. Roger, as he took his leave, thought that it would be impossible to be too hard upon Sir Felix Carbury.\nThe next morning Lady Carbury was in her son's bedroom before he was up, and with incredible weakness told him that his cousin Roger was coming to lecture him. \"What the Devil's the use of it?\" said Felix from beneath the bedclothes.\n\"If you speak to me in that way, Felix, I must leave the room.\"\n\"But what is the use of his coming to me? I know what he has got to say just as if it were said. It's all very well preaching sermons to good people, but nothing ever was got by preaching to people who ain't good.\"\n\"Why shouldn't you be good?\"\n\"I shall do very well, mother, if that fellow will leave me alone. I can play my hand better than he can play it for me. If you'll go now I'll get up.\" She had intended to ask him for some of the money which she believed he still possessed, but her courage failed her. If she asked for his money, and took it, she would in some fashion recognise and tacitly approve his gambling. It was not yet eleven, and it was early for him to leave his bed; but he had resolved that he would get out of the house before that horrible bore should be upon him with his sermon. To do this he must be energetic. He was actually eating his breakfast at half-past eleven, and had already contrived in his mind how he would turn the wrong way as soon as he got into the street,--towards Marylebone Road, by which route Roger would certainly not come. He left the house at ten minutes before twelve, cunningly turned away, dodging round by the first corner,--and just as he had turned it encountered his cousin. Roger, anxious in regard to his errand, with time at his command, had come before the hour appointed and had strolled about, thinking not of Felix but of Felix's sister. The baronet felt that he had been caught,--caught unfairly, but by no means abandoned all hope of escape. \"I was going to your mother's house on purpose to see you,\" said Roger.\n\"Were you indeed? I am so sorry. I have an engagement out here with a fellow which I must keep. I could meet you at any other time, you know.\"\n\"You can come back for ten minutes,\" said Roger, taking him by the arm.\n\"Well;--not conveniently at this moment.\"\n\"You must manage it. I am here at your mother's request, and can't afford to remain in town day after day looking for you. I go down to Carbury this afternoon. Your friend can wait. Come along.\" His firmness was too much for Felix, who lacked the courage to shake his cousin off violently, and to go his way. But as he returned he fortified himself with the remembrance of all the money in his pocket,--for he still had his winnings,--remembered too certain sweet words which had passed between him and Marie Melmotte since the ball, and resolved that he would not be \"sat upon\" by Roger Carbury. The time was coming,--he might almost say that the time had come,--in which he might defy Roger Carbury. Nevertheless, he dreaded the words which were now to be spoken to him with a craven fear.\n\"Your mother tells me,\" said Roger, \"that you still keep hunters.\"\n\"I don't know what she calls hunters. I have one that I didn't part with when the others went.\"\n\"You have only one horse?\"\n\"Well;--if you want to be exact, I have a hack as well as the horse I ride.\"\n\"And another up here in town?\"\n\"Who told you that? No; I haven't. At least there is one staying at some stables which has been sent for me to look at.\"\n\"Who pays for all these horses?\"\n\"At any rate I shall not ask you to pay for them.\"\n\"No;--you would be afraid to do that. But you have no scruple in asking your mother, though you should force her to come to me or to other friends for assistance. You have squandered every shilling of your own, and now you are ruining her.\"\n\"That isn't true. I have money of my own.\"\n\"Where did you get it?\"\n\"This is all very well, Roger; but I don't know that you have any right to ask me these questions. I have money. If I buy a horse I can pay for it. If I keep one or two I can pay for them. Of course I owe a lot of money, but other people owe me money too. I'm all right, and you needn't frighten yourself.\"\n\"Then why do you beg her last shilling from your mother, and when you have money not pay it back to her?\"\n\"She can have the twenty pounds, if you mean that.\"\n\"I mean that, and a good deal more than that. I suppose you have been gambling.\"\n\"I don't know that I am bound to answer your questions, and I won't do it. If you have nothing else to say, I'll go about my own business.\"\n\"I have something else to say, and I mean to say it.\" Felix had walked towards the door, but Roger was before him, and now leaned his back against it.\n\"I am not going to be kept here against my will,\" said Felix.\n\"You have to listen to me, so you may as well sit still. Do you wish to be looked upon as a blackguard by all the world?\"\n\"Oh,--go on.\"\n\"That is what it will be. You have spent every shilling of your own,--and because your mother is affectionate and weak, you are now spending all that she has, and are bringing her and your sister to beggary.\"\n\"I don't ask them to pay anything for me.\"\n\"Not when you borrow her money?\"\n\"There is the 20. Take it and give it her,\" said Felix, counting the notes out of the pocket-book. \"When I asked her for it, I did not think she would make such a row about such a trifle.\" Roger took up the notes and thrust them into his pocket. \"Now, have you done?\" said Felix.\n[Illustration: \"There's the 20.\"]\n\"Not quite. Do you purpose that your mother should keep you and clothe you for the rest of your life?\"\n\"I hope to be able to keep her before long, and to do it much better than it has ever been done before. The truth is, Roger, you know nothing about it. If you'll leave me to myself, you'll find that I shall do very well.\"\n\"I don't know any young man who ever did worse, or one who had less moral conception of what is right and wrong.\"\n\"Very well. That's your idea. I differ from you. People can't all think alike, you know. Now, if you please, I'll go.\"\nRoger felt that he hadn't half said what he had to say, but he hardly knew how to get it said. And of what use could it be to talk to a young man who was altogether callous and without feeling? The remedy for the evil ought to be found in the mother's conduct rather than the son's. She, were she not foolishly weak, would make up her mind to divide herself utterly from her son, at any rate for a while, and to leave him to suffer utter penury. That would bring him round. And then when the agony of want had tamed him, he would be content to take bread and meat from her hand and would be humble. At present he had money in his pocket, and would eat and drink of the best, and be free from inconvenience for the moment. While this prosperity remained it would be impossible to touch him. \"You will ruin your sister, and break your mother's heart,\" said Roger, firing a last harmless shot after the young reprobate.\nWhen Lady Carbury came into the room, which she did as soon as the front door was closed behind her son, she seemed to think that a great success had been achieved because the 20 had been recovered. \"I knew he would give it me back, if he had it,\" she said.\n\"Why did he not bring it to you of his own accord?\"\n\"I suppose he did not like to talk about it. Has he said that he got it by--playing?\"\n\"No,--he did not speak a word of truth while he was here. You may take it for granted that he did get it by gambling. How else should he have it? And you may take it for granted also that he will lose all that he has got. He talked in the wildest way,--saying that he would soon have a home for you and Hetta.\"\n\"Did he;--dear boy!\"\n\"Had he any meaning?\"\n\"Oh; yes. And it is quite on the cards that it should be so. You have heard of Miss Melmotte.\"\n\"I have heard of the great French swindler who has come over here, and who is buying his way into society.\"\n\"Everybody visits them now, Roger.\"\n\"More shame for everybody. Who knows anything about him,--except that he left Paris with the reputation of a specially prosperous rogue? But what of him?\"\n\"Some people think that Felix will marry his only child. Felix is handsome; isn't he? What young man is there nearly so handsome? They say she'll have half a million of money.\"\n\"That's his game;--is it?\"\n\"Don't you think he is right?\"\n\"No; I think he's wrong. But we shall hardly agree with each other about that. Can I see Henrietta for a few minutes?\"",
        "paragraph_chars": [
            [
                0,
                1179
            ],
            [
                1179,
                3521
            ],
            [
                3521,
                4219
            ],
            [
                4219,
                4374
            ],
            [
                4374,
                4445
            ],
            [
                4445,
                4507
            ],
            [
                4507,
                4603
            ],
            [
                4603,
                4617
            ],
            [
                4617,
                4732
            ],
            [
                4732,
                4771
            ],
            [
                4771,
                4967
            ],
            [
                4967,
                4990
            ],
            [
                4990,
                5374
            ],
            [
                5374,
                5398
            ],
            [
                5398,
                5546
            ],
            [
                5546,
                5684
            ],
            [
                5684,
                5745
            ],
            [
                5745,
                5784
            ],
            [
                5784,
                5895
            ],
            [
                5895,
                5925
            ],
            [
                5925,
                5980
            ],
            [
                5980,
                6331
            ],
            [
                6331,
                6360
            ],
            [
                6360,
                6384
            ],
            [
                6384,
                6569
            ],
            [
                6569,
                6682
            ],
            [
                6682,
                6704
            ],
            [
                6704,
                6897
            ],
            [
                6897,
                6918
            ],
            [
                6918,
                7295
            ],
            [
                7295,
                8632
            ],
            [
                8632,
                8684
            ],
            [
                8684,
                8850
            ],
            [
                8850,
                8869
            ],
            [
                8869,
                8900
            ],
            [
                8900,
                9008
            ],
            [
                9008,
                9282
            ],
            [
                9282,
                9442
            ],
            [
                9442,
                9676
            ],
            [
                9676,
                9740
            ],
            [
                9740,
                9955
            ],
            [
                9955,
                9984
            ],
            [
                9984,
                11324
            ],
            [
                11324,
                11467
            ],
            [
                11467,
                11539
            ],
            [
                11539,
                11581
            ],
            [
                11581,
                12373
            ],
            [
                12373,
                12440
            ],
            [
                12440,
                12536
            ],
            [
                12536,
                12563
            ],
            [
                12563,
                12640
            ],
            [
                12640,
                12671
            ],
            [
                12671,
                12792
            ],
            [
                12792,
                12825
            ],
            [
                12825,
                12876
            ],
            [
                12876,
                13117
            ],
            [
                13117,
                13160
            ],
            [
                13160,
                13184
            ],
            [
                13184,
                13491
            ],
            [
                13491,
                13597
            ],
            [
                13597,
                13649
            ],
            [
                13649,
                13730
            ],
            [
                13730,
                13870
            ],
            [
                13870,
                14021
            ],
            [
                14021,
                14083
            ],
            [
                14083,
                14205
            ],
            [
                14205,
                14219
            ],
            [
                14219,
                14428
            ],
            [
                14428,
                14471
            ],
            [
                14471,
                14504
            ],
            [
                14504,
                14784
            ],
            [
                14784,
                14818
            ],
            [
                14818,
                14921
            ],
            [
                14921,
                15143
            ],
            [
                15143,
                15257
            ],
            [
                15257,
                15376
            ],
            [
                15376,
                16293
            ],
            [
                16293,
                16551
            ],
            [
                16551,
                16603
            ],
            [
                16603,
                16689
            ],
            [
                16689,
                17000
            ],
            [
                17000,
                17021
            ],
            [
                17021,
                17043
            ],
            [
                17043,
                17138
            ],
            [
                17138,
                17246
            ],
            [
                17246,
                17282
            ],
            [
                17282,
                17437
            ],
            [
                17437,
                17614
            ],
            [
                17614,
                17641
            ],
            [
                17641,
                17672
            ],
            [
                17672,
                17790
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                267
            ],
            [
                267,
                407
            ],
            [
                407,
                466
            ],
            [
                466,
                662
            ],
            [
                662,
                774
            ],
            [
                774,
                920
            ],
            [
                920,
                1006
            ],
            [
                1006,
                1084
            ],
            [
                1084,
                1179
            ],
            [
                1179,
                1256
            ],
            [
                1256,
                1335
            ],
            [
                1335,
                1537
            ],
            [
                1537,
                1917
            ],
            [
                1917,
                2071
            ],
            [
                2071,
                2139
            ],
            [
                2139,
                2241
            ],
            [
                2241,
                2335
            ],
            [
                2335,
                2392
            ],
            [
                2392,
                2439
            ],
            [
                2439,
                2502
            ],
            [
                2502,
                2527
            ],
            [
                2527,
                2585
            ],
            [
                2585,
                2700
            ],
            [
                2700,
                2766
            ],
            [
                2766,
                2812
            ],
            [
                2812,
                2849
            ],
            [
                2849,
                2899
            ],
            [
                2899,
                3050
            ],
            [
                3050,
                3106
            ],
            [
                3106,
                3383
            ],
            [
                3383,
                3521
            ],
            [
                3521,
                3629
            ],
            [
                3629,
                3861
            ],
            [
                3861,
                4038
            ],
            [
                4038,
                4169
            ],
            [
                4169,
                4219
            ],
            [
                4219,
                4254
            ],
            [
                4254,
                4374
            ],
            [
                4374,
                4398
            ],
            [
                4398,
                4425
            ],
            [
                4425,
                4445
            ],
            [
                4445,
                4477
            ],
            [
                4477,
                4507
            ],
            [
                4507,
                4603
            ],
            [
                4603,
                4617
            ],
            [
                4617,
                4633
            ],
            [
                4633,
                4666
            ],
            [
                4666,
                4710
            ],
            [
                4710,
                4732
            ],
            [
                4732,
                4771
            ],
            [
                4771,
                4805
            ],
            [
                4805,
                4866
            ],
            [
                4866,
                4917
            ],
            [
                4917,
                4967
            ],
            [
                4967,
                4990
            ],
            [
                4990,
                5013
            ],
            [
                5013,
                5144
            ],
            [
                5144,
                5208
            ],
            [
                5208,
                5280
            ],
            [
                5280,
                5374
            ],
            [
                5374,
                5398
            ],
            [
                5398,
                5439
            ],
            [
                5439,
                5502
            ],
            [
                5502,
                5546
            ],
            [
                5546,
                5653
            ],
            [
                5653,
                5684
            ],
            [
                5684,
                5745
            ],
            [
                5745,
                5784
            ],
            [
                5784,
                5816
            ],
            [
                5816,
                5845
            ],
            [
                5845,
                5895
            ],
            [
                5895,
                5925
            ],
            [
                5925,
                5944
            ],
            [
                5944,
                5980
            ],
            [
                5980,
                6006
            ],
            [
                6006,
                6129
            ],
            [
                6129,
                6152
            ],
            [
                6152,
                6206
            ],
            [
                6206,
                6269
            ],
            [
                6269,
                6331
            ],
            [
                6331,
                6360
            ],
            [
                6360,
                6384
            ],
            [
                6384,
                6520
            ],
            [
                6520,
                6569
            ],
            [
                6569,
                6592
            ],
            [
                6592,
                6618
            ],
            [
                6618,
                6654
            ],
            [
                6654,
                6656
            ],
            [
                6656,
                6682
            ],
            [
                6682,
                6704
            ],
            [
                6704,
                6728
            ],
            [
                6728,
                6796
            ],
            [
                6796,
                6833
            ],
            [
                6833,
                6897
            ],
            [
                6897,
                6918
            ],
            [
                6918,
                6970
            ],
            [
                6970,
                7075
            ],
            [
                7075,
                7105
            ],
            [
                7105,
                7242
            ],
            [
                7242,
                7295
            ],
            [
                7295,
                7333
            ],
            [
                7333,
                7424
            ],
            [
                7424,
                7559
            ],
            [
                7559,
                7738
            ],
            [
                7738,
                7807
            ],
            [
                7807,
                7874
            ],
            [
                7874,
                7926
            ],
            [
                7926,
                8002
            ],
            [
                8002,
                8099
            ],
            [
                8099,
                8172
            ],
            [
                8172,
                8245
            ],
            [
                8245,
                8353
            ],
            [
                8353,
                8515
            ],
            [
                8515,
                8632
            ],
            [
                8632,
                8654
            ],
            [
                8654,
                8684
            ],
            [
                8684,
                8740
            ],
            [
                8740,
                8784
            ],
            [
                8784,
                8825
            ],
            [
                8825,
                8850
            ],
            [
                8850,
                8869
            ],
            [
                8869,
                8900
            ],
            [
                8900,
                8932
            ],
            [
                8932,
                8978
            ],
            [
                8978,
                9008
            ],
            [
                9008,
                9030
            ],
            [
                9030,
                9092
            ],
            [
                9092,
                9153
            ],
            [
                9153,
                9194
            ],
            [
                9194,
                9282
            ],
            [
                9282,
                9338
            ],
            [
                9338,
                9442
            ],
            [
                9442,
                9602
            ],
            [
                9602,
                9636
            ],
            [
                9636,
                9676
            ],
            [
                9676,
                9740
            ],
            [
                9740,
                9782
            ],
            [
                9782,
                9837
            ],
            [
                9837,
                9955
            ],
            [
                9955,
                9984
            ],
            [
                9984,
                10051
            ],
            [
                10051,
                10105
            ],
            [
                10105,
                10136
            ],
            [
                10136,
                10253
            ],
            [
                10253,
                10364
            ],
            [
                10364,
                10547
            ],
            [
                10547,
                10580
            ],
            [
                10580,
                10816
            ],
            [
                10816,
                10976
            ],
            [
                10976,
                11146
            ],
            [
                11146,
                11252
            ],
            [
                11252,
                11324
            ],
            [
                11324,
                11342
            ],
            [
                11342,
                11357
            ],
            [
                11357,
                11420
            ],
            [
                11420,
                11467
            ],
            [
                11467,
                11539
            ],
            [
                11539,
                11581
            ],
            [
                11581,
                11602
            ],
            [
                11602,
                11704
            ],
            [
                11704,
                11741
            ],
            [
                11741,
                11763
            ],
            [
                11763,
                11776
            ],
            [
                11776,
                11890
            ],
            [
                11890,
                12178
            ],
            [
                12178,
                12283
            ],
            [
                12283,
                12373
            ],
            [
                12373,
                12440
            ],
            [
                12440,
                12478
            ],
            [
                12478,
                12536
            ],
            [
                12536,
                12563
            ],
            [
                12563,
                12640
            ],
            [
                12640,
                12671
            ],
            [
                12671,
                12691
            ],
            [
                12691,
                12706
            ],
            [
                12706,
                12792
            ],
            [
                12792,
                12825
            ],
            [
                12825,
                12876
            ],
            [
                12876,
                12914
            ],
            [
                12914,
                13039
            ],
            [
                13039,
                13117
            ],
            [
                13117,
                13135
            ],
            [
                13135,
                13160
            ],
            [
                13160,
                13184
            ],
            [
                13184,
                13283
            ],
            [
                13283,
                13297
            ],
            [
                13297,
                13332
            ],
            [
                13332,
                13373
            ],
            [
                13373,
                13440
            ],
            [
                13440,
                13491
            ],
            [
                13491,
                13597
            ],
            [
                13597,
                13649
            ],
            [
                13649,
                13695
            ],
            [
                13695,
                13730
            ],
            [
                13730,
                13805
            ],
            [
                13805,
                13870
            ],
            [
                13870,
                13924
            ],
            [
                13924,
                14021
            ],
            [
                14021,
                14083
            ],
            [
                14083,
                14140
            ],
            [
                14140,
                14205
            ],
            [
                14205,
                14219
            ],
            [
                14219,
                14245
            ],
            [
                14245,
                14428
            ],
            [
                14428,
                14471
            ],
            [
                14471,
                14504
            ],
            [
                14504,
                14522
            ],
            [
                14522,
                14603
            ],
            [
                14603,
                14693
            ],
            [
                14693,
                14750
            ],
            [
                14750,
                14772
            ],
            [
                14772,
                14784
            ],
            [
                14784,
                14818
            ],
            [
                14818,
                14830
            ],
            [
                14830,
                14921
            ],
            [
                14921,
                15025
            ],
            [
                15025,
                15073
            ],
            [
                15073,
                15143
            ],
            [
                15143,
                15257
            ],
            [
                15257,
                15269
            ],
            [
                15269,
                15287
            ],
            [
                15287,
                15306
            ],
            [
                15306,
                15346
            ],
            [
                15346,
                15376
            ],
            [
                15376,
                15471
            ],
            [
                15471,
                15570
            ],
            [
                15570,
                15659
            ],
            [
                15659,
                15822
            ],
            [
                15822,
                15850
            ],
            [
                15850,
                15975
            ],
            [
                15975,
                16098
            ],
            [
                16098,
                16166
            ],
            [
                16166,
                16293
            ],
            [
                16293,
                16492
            ],
            [
                16492,
                16551
            ],
            [
                16551,
                16603
            ],
            [
                16603,
                16648
            ],
            [
                16648,
                16689
            ],
            [
                16689,
                16747
            ],
            [
                16747,
                16807
            ],
            [
                16807,
                16835
            ],
            [
                16835,
                16911
            ],
            [
                16911,
                17000
            ],
            [
                17000,
                17021
            ],
            [
                17021,
                17043
            ],
            [
                17043,
                17053
            ],
            [
                17053,
                17104
            ],
            [
                17104,
                17138
            ],
            [
                17138,
                17246
            ],
            [
                17246,
                17282
            ],
            [
                17282,
                17309
            ],
            [
                17309,
                17419
            ],
            [
                17419,
                17437
            ],
            [
                17437,
                17494
            ],
            [
                17494,
                17523
            ],
            [
                17523,
                17567
            ],
            [
                17567,
                17614
            ],
            [
                17614,
                17641
            ],
            [
                17641,
                17672
            ],
            [
                17672,
                17697
            ],
            [
                17697,
                17751
            ],
            [
                17751,
                17790
            ]
        ],
        "overlap_chars": [
            [
                0,
                93
            ],
            [
                119,
                128
            ],
            [
                267,
                288
            ],
            [
                293,
                330
            ],
            [
                346,
                357
            ],
            [
                363,
                380
            ],
            [
                398,
                405
            ],
            [
                385,
                394
            ],
            [
                405,
                407
            ],
            [
                407,
                466
            ],
            [
                466,
                473
            ],
            [
                483,
                538
            ],
            [
                596,
                598
            ],
            [
                539,
                551
            ],
            [
                570,
                576
            ],
            [
                609,
                612
            ],
            [
                580,
                585
            ],
            [
                619,
                661
            ],
            [
                662,
                664
            ],
            [
                669,
                735
            ],
            [
                738,
                774
            ],
            [
                774,
                822
            ],
            [
                866,
                869
            ],
            [
                826,
                854
            ],
            [
                879,
                884
            ],
            [
                855,
                864
            ],
            [
                918,
                920
            ],
            [
                930,
                933
            ],
            [
                944,
                954
            ],
            [
                969,
                1006
            ],
            [
                1017,
                1024
            ],
            [
                1031,
                1033
            ],
            [
                1061,
                1069
            ],
            [
                1075,
                1084
            ],
            [
                1157,
                1164
            ],
            [
                1084,
                1136
            ],
            [
                1177,
                1179
            ],
            [
                1179,
                1256
            ],
            [
                1256,
                1269
            ],
            [
                1282,
                1335
            ],
            [
                1335,
                1463
            ],
            [
                1535,
                1537
            ],
            [
                1537,
                1544
            ],
            [
                1577,
                1582
            ],
            [
                1568,
                1576
            ],
            [
                1612,
                1719
            ],
            [
                1721,
                1725
            ],
            [
                1749,
                1916
            ],
            [
                1917,
                1920
            ],
            [
                1927,
                1929
            ],
            [
                1921,
                1926
            ],
            [
                1930,
                1950
            ],
            [
                2023,
                2049
            ],
            [
                2069,
                2071
            ],
            [
                2071,
                2082
            ],
            [
                2101,
                2139
            ],
            [
                2223,
                2225
            ],
            [
                2156,
                2186
            ],
            [
                2196,
                2216
            ],
            [
                2239,
                2241
            ],
            [
                2241,
                2291
            ],
            [
                2335,
                2392
            ],
            [
                2502,
                2527
            ],
            [
                2527,
                2585
            ],
            [
                2585,
                2616
            ],
            [
                2629,
                2666
            ],
            [
                2675,
                2681
            ],
            [
                2691,
                2697
            ],
            [
                2700,
                2703
            ],
            [
                2705,
                2718
            ],
            [
                2758,
                2766
            ],
            [
                2766,
                2812
            ],
            [
                2812,
                2849
            ],
            [
                2849,
                2899
            ],
            [
                3059,
                3106
            ],
            [
                3106,
                3113
            ],
            [
                3140,
                3187
            ],
            [
                3206,
                3249
            ],
            [
                3263,
                3337
            ],
            [
                3344,
                3383
            ],
            [
                3459,
                3460
            ],
            [
                3465,
                3521
            ],
            [
                3521,
                3564
            ],
            [
                3568,
                3584
            ],
            [
                3594,
                3605
            ],
            [
                3610,
                3629
            ],
            [
                3648,
                3650
            ],
            [
                3666,
                3712
            ],
            [
                3727,
                3736
            ],
            [
                3739,
                3755
            ],
            [
                3758,
                3767
            ],
            [
                3773,
                3778
            ],
            [
                3850,
                3852
            ],
            [
                3800,
                3815
            ],
            [
                3824,
                3832
            ],
            [
                3859,
                3861
            ],
            [
                3861,
                3890
            ],
            [
                3891,
                3894
            ],
            [
                4017,
                4028
            ],
            [
                4036,
                4038
            ],
            [
                4038,
                4044
            ],
            [
                4080,
                4115
            ],
            [
                4130,
                4138
            ],
            [
                4140,
                4168
            ],
            [
                4169,
                4199
            ],
            [
                4216,
                4219
            ],
            [
                4219,
                4254
            ],
            [
                4281,
                4291
            ],
            [
                4306,
                4317
            ],
            [
                4339,
                4355
            ],
            [
                4361,
                4374
            ],
            [
                4374,
                4398
            ],
            [
                4398,
                4425
            ],
            [
                4425,
                4445
            ],
            [
                4445,
                4477
            ],
            [
                4477,
                4490
            ],
            [
                4504,
                4507
            ],
            [
                4507,
                4600
            ],
            [
                4666,
                4697
            ],
            [
                4699,
                4710
            ],
            [
                4710,
                4724
            ],
            [
                4729,
                4732
            ],
            [
                4732,
                4771
            ],
            [
                4771,
                4805
            ],
            [
                4805,
                4808
            ],
            [
                4814,
                4843
            ],
            [
                4846,
                4866
            ],
            [
                4866,
                4899
            ],
            [
                4915,
                4917
            ],
            [
                4917,
                4952
            ],
            [
                4959,
                4967
            ],
            [
                4967,
                4990
            ],
            [
                4990,
                5003
            ],
            [
                5011,
                5013
            ],
            [
                5013,
                5144
            ],
            [
                5183,
                5197
            ],
            [
                5206,
                5208
            ],
            [
                5208,
                5209
            ],
            [
                5213,
                5225
            ],
            [
                5254,
                5268
            ],
            [
                5278,
                5280
            ],
            [
                5347,
                5358
            ],
            [
                5362,
                5374
            ],
            [
                5374,
                5395
            ],
            [
                5398,
                5409
            ],
            [
                5419,
                5420
            ],
            [
                5410,
                5419
            ],
            [
                5437,
                5439
            ],
            [
                5439,
                5448
            ],
            [
                5487,
                5489
            ],
            [
                5500,
                5502
            ],
            [
                5502,
                5546
            ],
            [
                5546,
                5572
            ],
            [
                5581,
                5591
            ],
            [
                5651,
                5653
            ],
            [
                5653,
                5684
            ],
            [
                5684,
                5715
            ],
            [
                5717,
                5745
            ],
            [
                5745,
                5770
            ],
            [
                5772,
                5784
            ],
            [
                5784,
                5816
            ],
            [
                5816,
                5845
            ],
            [
                5845,
                5852
            ],
            [
                5865,
                5895
            ],
            [
                5895,
                5925
            ],
            [
                5944,
                5961
            ],
            [
                5967,
                5969
            ],
            [
                5962,
                5966
            ],
            [
                5970,
                5980
            ],
            [
                6006,
                6048
            ],
            [
                6064,
                6112
            ],
            [
                6127,
                6129
            ],
            [
                6152,
                6172
            ],
            [
                6183,
                6206
            ],
            [
                6206,
                6236
            ],
            [
                6247,
                6250
            ],
            [
                6269,
                6313
            ],
            [
                6316,
                6331
            ],
            [
                6331,
                6360
            ],
            [
                6360,
                6384
            ],
            [
                6384,
                6410
            ],
            [
                6437,
                6454
            ],
            [
                6459,
                6481
            ],
            [
                6504,
                6509
            ],
            [
                6518,
                6520
            ],
            [
                6520,
                6569
            ],
            [
                6569,
                6580
            ],
            [
                6592,
                6603
            ],
            [
                6616,
                6618
            ],
            [
                6618,
                6646
            ],
            [
                6648,
                6655
            ],
            [
                6657,
                6679
            ],
            [
                6796,
                6831
            ],
            [
                6897,
                6898
            ],
            [
                6908,
                6918
            ],
            [
                6918,
                6955
            ],
            [
                6960,
                6970
            ],
            [
                7105,
                7188
            ],
            [
                7191,
                7228
            ],
            [
                7233,
                7240
            ],
            [
                7295,
                7305
            ],
            [
                7312,
                7333
            ],
            [
                7559,
                7579
            ],
            [
                7607,
                7615
            ],
            [
                7623,
                7667
            ],
            [
                7683,
                7709
            ],
            [
                7716,
                7738
            ],
            [
                7738,
                7806
            ],
            [
                7926,
                7932
            ],
            [
                7936,
                8002
            ],
            [
                8007,
                8030
            ],
            [
                8041,
                8057
            ],
            [
                8097,
                8099
            ],
            [
                8176,
                8199
            ],
            [
                8203,
                8230
            ],
            [
                8243,
                8245
            ],
            [
                8245,
                8252
            ],
            [
                8274,
                8286
            ],
            [
                8369,
                8376
            ],
            [
                8304,
                8307
            ],
            [
                8388,
                8401
            ],
            [
                8408,
                8411
            ],
            [
                8429,
                8471
            ],
            [
                8351,
                8352
            ],
            [
                8515,
                8543
            ],
            [
                8554,
                8567
            ],
            [
                8597,
                8619
            ],
            [
                8629,
                8632
            ],
            [
                8632,
                8643
            ],
            [
                8645,
                8652
            ],
            [
                8740,
                8784
            ],
            [
                8784,
                8825
            ],
            [
                8825,
                8850
            ],
            [
                8850,
                8855
            ],
            [
                8857,
                8866
            ],
            [
                8901,
                8932
            ],
            [
                8932,
                8956
            ],
            [
                8976,
                8978
            ],
            [
                8978,
                9008
            ],
            [
                9008,
                9011
            ],
            [
                9014,
                9030
            ],
            [
                9030,
                9092
            ],
            [
                9098,
                9108
            ],
            [
                9119,
                9153
            ],
            [
                9153,
                9193
            ],
            [
                9282,
                9338
            ],
            [
                9338,
                9432
            ],
            [
                9440,
                9442
            ],
            [
                9442,
                9601
            ],
            [
                9602,
                9636
            ],
            [
                9636,
                9676
            ],
            [
                9676,
                9740
            ],
            [
                9740,
                9782
            ],
            [
                9782,
                9796
            ],
            [
                9805,
                9811
            ],
            [
                9835,
                9837
            ],
            [
                9894,
                9901
            ],
            [
                9907,
                9910
            ],
            [
                9902,
                9906
            ],
            [
                9911,
                9955
            ],
            [
                9955,
                9984
            ],
            [
                9984,
                10051
            ],
            [
                10105,
                10136
            ],
            [
                10136,
                10172
            ],
            [
                10180,
                10185
            ],
            [
                10223,
                10253
            ],
            [
                10266,
                10279
            ],
            [
                10298,
                10303
            ],
            [
                10320,
                10333
            ],
            [
                10342,
                10363
            ],
            [
                10364,
                10385
            ],
            [
                10428,
                10433
            ],
            [
                10441,
                10449
            ],
            [
                10412,
                10414
            ],
            [
                10464,
                10517
            ],
            [
                10530,
                10547
            ],
            [
                10580,
                10582
            ],
            [
                10603,
                10637
            ],
            [
                10676,
                10688
            ],
            [
                10752,
                10795
            ],
            [
                10806,
                10816
            ],
            [
                10816,
                10840
            ],
            [
                10856,
                10873
            ],
            [
                10887,
                10900
            ],
            [
                10904,
                10920
            ],
            [
                10923,
                10926
            ],
            [
                10932,
                10937
            ],
            [
                10942,
                10951
            ],
            [
                10885,
                10886
            ],
            [
                10964,
                10976
            ],
            [
                10976,
                10981
            ],
            [
                11042,
                11050
            ],
            [
                11011,
                11014
            ],
            [
                11085,
                11109
            ],
            [
                11114,
                11116
            ],
            [
                11144,
                11146
            ],
            [
                11158,
                11186
            ],
            [
                11196,
                11204
            ],
            [
                11250,
                11251
            ],
            [
                11252,
                11287
            ],
            [
                11299,
                11324
            ],
            [
                11324,
                11333
            ],
            [
                11340,
                11342
            ],
            [
                11342,
                11357
            ],
            [
                11357,
                11377
            ],
            [
                11387,
                11400
            ],
            [
                11467,
                11538
            ],
            [
                11704,
                11741
            ],
            [
                11741,
                11763
            ],
            [
                11763,
                11775
            ],
            [
                11776,
                11859
            ],
            [
                11888,
                11890
            ],
            [
                11890,
                11893
            ],
            [
                11909,
                11953
            ],
            [
                11958,
                11981
            ],
            [
                11897,
                11899
            ],
            [
                12027,
                12178
            ],
            [
                12178,
                12197
            ],
            [
                12254,
                12283
            ],
            [
                12283,
                12311
            ],
            [
                12312,
                12317
            ],
            [
                12371,
                12373
            ],
            [
                12373,
                12440
            ],
            [
                12478,
                12495
            ],
            [
                12513,
                12536
            ],
            [
                12536,
                12537
            ],
            [
                12546,
                12563
            ],
            [
                12563,
                12568
            ],
            [
                12583,
                12617
            ],
            [
                12637,
                12640
            ],
            [
                12640,
                12671
            ],
            [
                12691,
                12696
            ],
            [
                12762,
                12766
            ],
            [
                12706,
                12708
            ],
            [
                12724,
                12727
            ],
            [
                12789,
                12792
            ],
            [
                12792,
                12825
            ],
            [
                12825,
                12826
            ],
            [
                12838,
                12876
            ],
            [
                12876,
                12879
            ],
            [
                12882,
                12914
            ],
            [
                12914,
                12959
            ],
            [
                13037,
                13039
            ],
            [
                13039,
                13117
            ],
            [
                13117,
                13135
            ],
            [
                13135,
                13141
            ],
            [
                13151,
                13157
            ],
            [
                13142,
                13147
            ],
            [
                13157,
                13160
            ],
            [
                13160,
                13184
            ],
            [
                13184,
                13283
            ],
            [
                13283,
                13297
            ],
            [
                13297,
                13332
            ],
            [
                13373,
                13440
            ],
            [
                13440,
                13453
            ],
            [
                13488,
                13491
            ],
            [
                13491,
                13551
            ],
            [
                13572,
                13597
            ],
            [
                13597,
                13649
            ],
            [
                13649,
                13683
            ],
            [
                13693,
                13695
            ],
            [
                13695,
                13730
            ],
            [
                13730,
                13731
            ],
            [
                13790,
                13797
            ],
            [
                13763,
                13784
            ],
            [
                13803,
                13805
            ],
            [
                13805,
                13845
            ],
            [
                13867,
                13870
            ],
            [
                13870,
                13924
            ],
            [
                13924,
                13988
            ],
            [
                13993,
                14021
            ],
            [
                14021,
                14083
            ],
            [
                14083,
                14084
            ],
            [
                14103,
                14108
            ],
            [
                14138,
                14140
            ],
            [
                14140,
                14202
            ],
            [
                14220,
                14245
            ],
            [
                14245,
                14286
            ],
            [
                14289,
                14350
            ],
            [
                14386,
                14428
            ],
            [
                14504,
                14522
            ],
            [
                14534,
                14582
            ],
            [
                14601,
                14603
            ],
            [
                14603,
                14616
            ],
            [
                14621,
                14690
            ],
            [
                14751,
                14771
            ],
            [
                14818,
                14830
            ],
            [
                14830,
                14836
            ],
            [
                14845,
                14873
            ],
            [
                14889,
                14921
            ],
            [
                14921,
                14963
            ],
            [
                15023,
                15025
            ],
            [
                15025,
                15073
            ],
            [
                15073,
                15102
            ],
            [
                15120,
                15143
            ],
            [
                15143,
                15210
            ],
            [
                15228,
                15257
            ],
            [
                15257,
                15269
            ],
            [
                15287,
                15306
            ],
            [
                15306,
                15346
            ],
            [
                15346,
                15376
            ],
            [
                15376,
                15401
            ],
            [
                15407,
                15411
            ],
            [
                15402,
                15406
            ],
            [
                15412,
                15430
            ],
            [
                15469,
                15471
            ],
            [
                15475,
                15548
            ],
            [
                15568,
                15570
            ],
            [
                15619,
                15625
            ],
            [
                15664,
                15668
            ],
            [
                15673,
                15692
            ],
            [
                15659,
                15662
            ],
            [
                15693,
                15698
            ],
            [
                15719,
                15733
            ],
            [
                15742,
                15754
            ],
            [
                15768,
                15784
            ],
            [
                15788,
                15807
            ],
            [
                15814,
                15822
            ],
            [
                15822,
                15832
            ],
            [
                15839,
                15842
            ],
            [
                15850,
                15853
            ],
            [
                15892,
                15895
            ],
            [
                15967,
                15975
            ],
            [
                16098,
                16103
            ],
            [
                15986,
                16012
            ],
            [
                16129,
                16165
            ],
            [
                16166,
                16265
            ],
            [
                16291,
                16293
            ],
            [
                16293,
                16329
            ],
            [
                16389,
                16396
            ],
            [
                16396,
                16491
            ],
            [
                16492,
                16516
            ],
            [
                16520,
                16524
            ],
            [
                16538,
                16551
            ],
            [
                16551,
                16603
            ],
            [
                16603,
                16648
            ],
            [
                16648,
                16677
            ],
            [
                16679,
                16689
            ],
            [
                16689,
                16692
            ],
            [
                16747,
                16805
            ],
            [
                16835,
                16838
            ],
            [
                16867,
                16893
            ],
            [
                16899,
                16911
            ],
            [
                16911,
                16940
            ],
            [
                16949,
                16987
            ],
            [
                16997,
                17000
            ],
            [
                17000,
                17001
            ],
            [
                17010,
                17018
            ],
            [
                17057,
                17068
            ],
            [
                17102,
                17104
            ],
            [
                17104,
                17138
            ],
            [
                17138,
                17184
            ],
            [
                17213,
                17246
            ],
            [
                17246,
                17282
            ],
            [
                17282,
                17309
            ],
            [
                17419,
                17437
            ],
            [
                17437,
                17494
            ],
            [
                17494,
                17511
            ],
            [
                17513,
                17523
            ],
            [
                17567,
                17602
            ],
            [
                17611,
                17614
            ],
            [
                17614,
                17630
            ],
            [
                17633,
                17641
            ],
            [
                17641,
                17672
            ],
            [
                17672,
                17697
            ],
            [
                17697,
                17722
            ],
            [
                17739,
                17751
            ],
            [
                17751,
                17790
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                267
            ],
            [
                267,
                407
            ],
            [
                407,
                466
            ],
            [
                466,
                662
            ],
            [
                662,
                774
            ],
            [
                774,
                920
            ],
            [
                920,
                1006
            ],
            [
                1006,
                1084
            ],
            [
                1084,
                1179
            ],
            [
                1179,
                1256
            ],
            [
                1256,
                1335
            ],
            [
                1335,
                1537
            ],
            [
                1537,
                1917
            ],
            [
                1917,
                2071
            ],
            [
                2071,
                2139
            ],
            [
                2139,
                2241
            ],
            [
                2241,
                2392
            ],
            [
                2392,
                2439
            ],
            [
                2439,
                2502
            ],
            [
                2502,
                2527
            ],
            [
                2527,
                2585
            ],
            [
                2585,
                2700
            ],
            [
                2700,
                2766
            ],
            [
                2766,
                2812
            ],
            [
                2812,
                2849
            ],
            [
                2849,
                2899
            ],
            [
                2899,
                3050
            ],
            [
                3050,
                3106
            ],
            [
                3106,
                3383
            ],
            [
                3383,
                3521
            ],
            [
                3521,
                3629
            ],
            [
                3629,
                3861
            ],
            [
                3861,
                4038
            ],
            [
                4038,
                4169
            ],
            [
                4169,
                4219
            ],
            [
                4219,
                4254
            ],
            [
                4254,
                4374
            ],
            [
                4374,
                4398
            ],
            [
                4398,
                4425
            ],
            [
                4425,
                4445
            ],
            [
                4445,
                4477
            ],
            [
                4477,
                4507
            ],
            [
                4507,
                4603
            ],
            [
                4603,
                4617
            ],
            [
                4617,
                4633
            ],
            [
                4633,
                4666
            ],
            [
                4666,
                4710
            ],
            [
                4710,
                4732
            ],
            [
                4732,
                4771
            ],
            [
                4771,
                4805
            ],
            [
                4805,
                4866
            ],
            [
                4866,
                4917
            ],
            [
                4917,
                4967
            ],
            [
                4967,
                4990
            ],
            [
                4990,
                5013
            ],
            [
                5013,
                5144
            ],
            [
                5144,
                5208
            ],
            [
                5208,
                5280
            ],
            [
                5280,
                5374
            ],
            [
                5374,
                5398
            ],
            [
                5398,
                5439
            ],
            [
                5439,
                5502
            ],
            [
                5502,
                5546
            ],
            [
                5546,
                5653
            ],
            [
                5653,
                5684
            ],
            [
                5684,
                5745
            ],
            [
                5745,
                5784
            ],
            [
                5784,
                5816
            ],
            [
                5816,
                5845
            ],
            [
                5845,
                5895
            ],
            [
                5895,
                5925
            ],
            [
                5925,
                5944
            ],
            [
                5944,
                5980
            ],
            [
                5980,
                6006
            ],
            [
                6006,
                6129
            ],
            [
                6129,
                6152
            ],
            [
                6152,
                6206
            ],
            [
                6206,
                6331
            ],
            [
                6331,
                6360
            ],
            [
                6360,
                6384
            ],
            [
                6384,
                6520
            ],
            [
                6520,
                6569
            ],
            [
                6569,
                6618
            ],
            [
                6618,
                6682
            ],
            [
                6682,
                6704
            ],
            [
                6704,
                6728
            ],
            [
                6728,
                6796
            ],
            [
                6796,
                6833
            ],
            [
                6833,
                6897
            ],
            [
                6897,
                6918
            ],
            [
                6918,
                6970
            ],
            [
                6970,
                7075
            ],
            [
                7075,
                7105
            ],
            [
                7105,
                7242
            ],
            [
                7242,
                7295
            ],
            [
                7295,
                7333
            ],
            [
                7333,
                7424
            ],
            [
                7424,
                7559
            ],
            [
                7559,
                7738
            ],
            [
                7738,
                7807
            ],
            [
                7807,
                7874
            ],
            [
                7874,
                7926
            ],
            [
                7926,
                8002
            ],
            [
                8002,
                8099
            ],
            [
                8099,
                8172
            ],
            [
                8172,
                8245
            ],
            [
                8245,
                8515
            ],
            [
                8515,
                8632
            ],
            [
                8632,
                8654
            ],
            [
                8654,
                8684
            ],
            [
                8684,
                8740
            ],
            [
                8740,
                8784
            ],
            [
                8784,
                8825
            ],
            [
                8825,
                8850
            ],
            [
                8850,
                8869
            ],
            [
                8869,
                8900
            ],
            [
                8900,
                8932
            ],
            [
                8932,
                8978
            ],
            [
                8978,
                9008
            ],
            [
                9008,
                9030
            ],
            [
                9030,
                9092
            ],
            [
                9092,
                9153
            ],
            [
                9153,
                9194
            ],
            [
                9194,
                9282
            ],
            [
                9282,
                9338
            ],
            [
                9338,
                9442
            ],
            [
                9442,
                9602
            ],
            [
                9602,
                9636
            ],
            [
                9636,
                9676
            ],
            [
                9676,
                9740
            ],
            [
                9740,
                9782
            ],
            [
                9782,
                9837
            ],
            [
                9837,
                9955
            ],
            [
                9955,
                9984
            ],
            [
                9984,
                10051
            ],
            [
                10051,
                10105
            ],
            [
                10105,
                10136
            ],
            [
                10136,
                10253
            ],
            [
                10253,
                10364
            ],
            [
                10364,
                10547
            ],
            [
                10547,
                10580
            ],
            [
                10580,
                10816
            ],
            [
                10816,
                10976
            ],
            [
                10976,
                11146
            ],
            [
                11146,
                11252
            ],
            [
                11252,
                11324
            ],
            [
                11324,
                11342
            ],
            [
                11342,
                11357
            ],
            [
                11357,
                11420
            ],
            [
                11420,
                11467
            ],
            [
                11467,
                11539
            ],
            [
                11539,
                11581
            ],
            [
                11581,
                11602
            ],
            [
                11602,
                11704
            ],
            [
                11704,
                11741
            ],
            [
                11741,
                11763
            ],
            [
                11763,
                11776
            ],
            [
                11776,
                11890
            ],
            [
                11890,
                12178
            ],
            [
                12178,
                12283
            ],
            [
                12283,
                12373
            ],
            [
                12373,
                12440
            ],
            [
                12440,
                12478
            ],
            [
                12478,
                12536
            ],
            [
                12536,
                12563
            ],
            [
                12563,
                12640
            ],
            [
                12640,
                12671
            ],
            [
                12671,
                12691
            ],
            [
                12691,
                12792
            ],
            [
                12792,
                12825
            ],
            [
                12825,
                12876
            ],
            [
                12876,
                12914
            ],
            [
                12914,
                13039
            ],
            [
                13039,
                13117
            ],
            [
                13117,
                13135
            ],
            [
                13135,
                13160
            ],
            [
                13160,
                13184
            ],
            [
                13184,
                13283
            ],
            [
                13283,
                13297
            ],
            [
                13297,
                13332
            ],
            [
                13332,
                13373
            ],
            [
                13373,
                13440
            ],
            [
                13440,
                13491
            ],
            [
                13491,
                13597
            ],
            [
                13597,
                13649
            ],
            [
                13649,
                13695
            ],
            [
                13695,
                13730
            ],
            [
                13730,
                13805
            ],
            [
                13805,
                13870
            ],
            [
                13870,
                13924
            ],
            [
                13924,
                14021
            ],
            [
                14021,
                14083
            ],
            [
                14083,
                14140
            ],
            [
                14140,
                14205
            ],
            [
                14205,
                14219
            ],
            [
                14219,
                14245
            ],
            [
                14245,
                14428
            ],
            [
                14428,
                14471
            ],
            [
                14471,
                14504
            ],
            [
                14504,
                14522
            ],
            [
                14522,
                14603
            ],
            [
                14603,
                14693
            ],
            [
                14693,
                14750
            ],
            [
                14750,
                14772
            ],
            [
                14772,
                14784
            ],
            [
                14784,
                14818
            ],
            [
                14818,
                14830
            ],
            [
                14830,
                14921
            ],
            [
                14921,
                15025
            ],
            [
                15025,
                15073
            ],
            [
                15073,
                15143
            ],
            [
                15143,
                15257
            ],
            [
                15257,
                15269
            ],
            [
                15269,
                15287
            ],
            [
                15287,
                15306
            ],
            [
                15306,
                15346
            ],
            [
                15346,
                15376
            ],
            [
                15376,
                15471
            ],
            [
                15471,
                15570
            ],
            [
                15570,
                15822
            ],
            [
                15822,
                15975
            ],
            [
                15975,
                16166
            ],
            [
                16166,
                16293
            ],
            [
                16293,
                16492
            ],
            [
                16492,
                16551
            ],
            [
                16551,
                16603
            ],
            [
                16603,
                16648
            ],
            [
                16648,
                16689
            ],
            [
                16689,
                16911
            ],
            [
                16911,
                17000
            ],
            [
                17000,
                17021
            ],
            [
                17021,
                17043
            ],
            [
                17043,
                17053
            ],
            [
                17053,
                17104
            ],
            [
                17104,
                17138
            ],
            [
                17138,
                17246
            ],
            [
                17246,
                17282
            ],
            [
                17282,
                17309
            ],
            [
                17309,
                17419
            ],
            [
                17419,
                17437
            ],
            [
                17437,
                17494
            ],
            [
                17494,
                17523
            ],
            [
                17523,
                17567
            ],
            [
                17567,
                17614
            ],
            [
                17614,
                17641
            ],
            [
                17641,
                17672
            ],
            [
                17672,
                17697
            ],
            [
                17697,
                17751
            ],
            [
                17751,
                17790
            ]
        ]
    },
    "abridged": {
        "text": "Lady Carbury's desire for a union between Roger and her daughter was greatly increased by her anxiety about her son. If her daughter could only be settled in the world, Lady Carbury thought, she could devote herself to her son's interests. She had no very clear idea of what that devotion would be. But she knew that she had paid so much money for him, and would have to pay so much more, that she might be unable to keep a home for her daughter.\nIn these troubles she constantly appealed to Roger Carbury for advice - which, however, she never followed. He recommended her to give up her house in town, and find a home for her daughter and Felix elsewhere. If Felix would not follow her, then let him bear the brunt of his own misdoings. When he had no more money he would seek her out. Lady Carbury thought Roger was always severe when he spoke of the baronet.\nBut, in truth, she did not ask for advice in order that she might follow it. She had plans with which she knew that Roger would not sympathise. She still thought that Sir Felix might bloom and burst out into grandeur, wealth, and fashion, as the husband of a great heiress. When he got money from her - when, with brazen-faced indifference to her remonstrances, he started off to his club at two in the morning - when he almost boasted of the hopelessness of his debts, a sickness of heart would come upon her, and she would weep hysterically, and lie the whole night without sleeping.\nBut if he could marry Miss Melmotte, then she would be proud of him. With such a view Roger Carbury could have no sympathy. He thought that a gentleman was disgraced by owing money to a tradesman. And Lady Carbury's heart was high with other hopes: the \"Criminal Queens\" might be a great literary success. Mr. Broune had promised. Mr. Booker had said that he would see what could be done. She had gathered from Mr. Alf's cautious words that the book would be reviewed in the Evening Pulpit.\nNo; she would not leave London. But she would continue to ask Roger's advice. Men like to have their advice asked. And, if possible, she would arrange the marriage. Her mind would fly away into regions of bliss. If only Henrietta could be engaged to her cousin, Felix marry the richest bride in Europe, and she be the author of the cleverest book of the year, what a Paradise of triumph might be open to her after all her troubles! Thinking this, for an hour she would be happy, in spite of everything.\nA few days after the ball Roger Carbury was in town, and was with her in the back drawing-room. He had come because of the condition of the baronet's affairs and the necessity - so Roger thought - of taking steps to curtail the young man's expenses. It was horrible to him that a penniless man should have horses to hunt with! He was quite prepared to speak his mind to Felix himself, if he could get hold of him.\n\"Where is he now, Lady Carbury?\"\n\"I think he's out with the Baron.\" This meant that he was hunting some forty miles from London.\n\"How does he manage it? Whose horses does he ride? Who pays for them?\"\n\"Don't be angry with me, Roger. What can I do?\"\n\"I think you should refuse to have anything to do with him while he continues in such courses. Is he to be allowed to ruin you and Hetta? It can't go on.\"\n\"You wouldn't have me throw him over.\"\n\"I think he is throwing you over. And it is so thoroughly dishonest - so ungentlemanlike! I don't understand how it goes on. I suppose you don't supply him with money.\"\n\"He has had a little.\"\nRoger frowned. \"I can understand that you should provide him with bed and food, but not that you should pander to his vices by giving him money.\" Lady Carbury winced. \"His kind of life needs a large income. I could not afford it myself.\"\n\"You are so different,\" she said.\n\"I am older, of course. But he is old enough to understand it. Has he any money beyond what you give him?\"\nThen Lady Carbury revealed her suspicions. \"I think he has been playing.\"\n\"That is the way to lose money, not to get it,\" said Roger.\n\"I suppose somebody wins, sometimes.\"\n\"They who win are the sharpers. They who lose are the dupes. I would rather he were a fool than a knave.\"\n\"O Roger, you are so severe!\"\n\"How would he pay, if he were to lose?\"\n\"I don't even know that he does play; but I think that during the last week he has had money. He comes home at all hours and sleeps late. Yesterday I went into his room and there were notes and gold lying on his table - ever so much.\"\n\"Why did you not take them?\"\n\"What; rob my own boy?\"\n\"When you tell me that you need money to pay your bills, and that he has taken yours! Why does he not repay you what he has borrowed?\"\n\"Ah, indeed, he ought to. And there were papers there; I.O.U.s, signed by other men. And I think he has bought another horse.\"\n\"Oh dear!\"\n\"If you could only induce him to stop gambling! If he has won money, it would be a great comfort if he would let me have some of it - for, to tell the truth, I hardly know where to turn.\"\nThen Roger repeated his advice. If Lady Carbury felt bound to offer a home to her ruined son in spite of all his folly, that home should be far away from London. If he chose to remain in London, let him do so on his own resources.\n\"If he is a man he would sooner break stones than live on you,\" said Roger. He would see his cousin tomorrow and speak to him. He would come at twelve, when Felix generally breakfasted. Then he assured Lady Carbury that if her son did not give her the money she needed, he, Roger, would lend her a hundred pounds.\nAfter that his voice changed, as he asked, \"Can I see Henrietta tomorrow?\"\n\"Certainly; why not?\"\n\"I should like her to know that I am coming. Paul Montague was in town the other day. He was here, I suppose?\"\n\"Yes; he called. And he was at the Melmottes' ball. Felix got a card for him. Has he gone down to Carbury?\"\n\"No, not to Carbury. I think he had some business about his partners at Liverpool. He is another young man without anything to do. Not that Paul is at all like Sir Felix.\"\n\"Don't be too hard upon poor Felix,\" said Lady Carbury. Roger, as he took his leave, thought that it would be impossible to be too hard upon Sir Felix.\nThe next morning Lady Carbury was in her son's bedroom before he was up, and with incredible weakness told him that his cousin Roger was coming to lecture him.\n\"What the Devil's the use of it?\" said Felix from beneath the bedclothes.\n\"If you speak to me in that way, Felix, I must leave the room.\"\n\"But what is the use of his coming to me? I know what he's going to say. Nothing was ever got by preaching to people who ain't good.\"\n\"Why shouldn't you be good?\"\n\"I shall do very well, mother, if that fellow will leave me alone. If you'll go now I'll get up.\" She had intended to ask him for some money, but her courage failed her. To ask for his money would be to recognise and even approve his gambling.\nIt was not yet eleven; but Felix resolved to get out of the house before that horrible bore should come with his sermon. He ate his breakfast at half-past eleven, planning how he would go out towards Marylebone Road, by which route Roger would not come. He left the house at ten to twelve, cunningly dodging round the first corner - and as he turned it, met his cousin. Roger had come early and strolled about, thinking of Henrietta. Felix felt that he had been caught unfairly.\n\"I was going to your mother's house to see you,\" said Roger.\n\"Were you? I am so sorry. I have an engagement with a fellow.\"\n\"You can come back for ten minutes,\" said Roger, taking him by the arm. \"I go down to Carbury this afternoon. Your friend can wait. Come along.\"\nHis firmness was too much for Felix, who lacked the courage to shake his cousin off. But he fortified himself with the remembrance of the money in his pocket. He remembered too certain sweet words which had passed between him and Marie Melmotte since the ball, and resolved that he would not be \"sat upon\" by Roger Carbury. The time was coming when he might defy Roger Carbury. Nevertheless, he dreaded the coming words.\n\"Your mother tells me,\" said Roger, \"that you still keep hunters.\"\n\"I have one that I kept when the others went.\"\n\"Only one horse?\"\n\"Well - to be exact, I have a hack as well.\"\n\"And another up here in town?\"\n\"No; I've just been looking at one.\"\n\"Who pays for all these horses?\"\n\"I shall not ask you to pay for them.\"\n\"No, you would be afraid to do that. But you have no scruple in asking your mother. You have squandered every shilling of your own, and now you are ruining her.\"\n\"That isn't true. I have my own money.\"\n\"Where did you get it?\"\n\"This is all very well, Roger; but I don't know that you have any right to ask me these questions. I have money. If I buy a horse I can pay for it. Of course I owe a lot of money, but other people owe me money too. I'm all right.\"\n\"Then why do you beg her last shilling from your mother, and not pay it back to her?\"\n\"She can have the twenty pounds, if you mean that.\"\n\"I mean that, and a good deal more. I suppose you have been gambling.\"\n\"I won't answer your questions. If you have nothing else to say, I'll go.\"\n\"I have something else to say, and I mean to say it.\" Felix had walked towards the door, but Roger was before him, and leaned his back against it.\n\"I am not going to be kept here against my will,\" said Felix.\n\"Listen to me. Do you wish to be looked upon as a blackguard by all the world? That is what it will be. You have spent every shilling of your own - and because your mother is affectionate and weak, you are now bringing her and your sister to beggary.\"\n\"There is the 20. Give it her,\" said Felix, counting the notes out. \"When I asked for it, I did not think she would make such a row about such a trifle. Now, have you done?\"\n\"Not quite. Do you intend that your mother should keep you for the rest of your life?\"\n\"I hope to be able to keep her before long. The truth is, Roger, you know nothing about it. If you'll leave me to myself, I shall do very well.\"\n\"I don't know any young man who ever did worse, or one who had less idea of what is right and wrong.\"\n\"Very well. I differ from you. People can't all think alike, you know. Now, if you please, I'll go.\"\nRoger felt that he hadn't said half of what he had to say. But of what use could it be to talk to a young man who was altogether callous? If his mother were not foolishly weak, she would divide herself from her son for a while, and leave him to suffer penury. That would tame him and make him humble. While he had money in his pocket it would be impossible to touch him.\n\"You will ruin your sister, and break your mother's heart,\" said Roger, firing a last harmless shot.\nWhen Lady Carbury came into the room after her son had left, she seemed to think that a great success had been achieved because the 20 had been recovered.\n\"I knew he would give it back,\" she said.\n\"Why did he not bring it to you of his own accord?\"\n\"I suppose he did not like to talk about it. Has he said that he got it by - playing?\"\n\"No; but you may take it for granted that he did get it by gambling - and also that he will lose all he has got. He talked in the wildest way, saying that he would soon have a home for you.\"\n\"Dear boy! It is quite possible. You have heard of Miss Melmotte.\"\n\"I have heard of the great French swindler who is buying his way into society.\"\n\"Everybody visits them now, Roger.\"\n\"More shame for everybody. But what of him?\"\n\"Some people think that Felix will marry his only child. Felix is handsome, isn't he? They say she'll have half a million.\"\n\"That's his game, is it?\"\n\"Don't you think he is right?\"\n\"No; I think he's wrong. But we shall hardly agree about that. Can I see Henrietta for a few minutes?\"",
        "paragraph_chars": [
            [
                0,
                447
            ],
            [
                447,
                863
            ],
            [
                863,
                1449
            ],
            [
                1449,
                1940
            ],
            [
                1940,
                2443
            ],
            [
                2443,
                2857
            ],
            [
                2857,
                2890
            ],
            [
                2890,
                2986
            ],
            [
                2986,
                3057
            ],
            [
                3057,
                3105
            ],
            [
                3105,
                3260
            ],
            [
                3260,
                3299
            ],
            [
                3299,
                3468
            ],
            [
                3468,
                3491
            ],
            [
                3491,
                3729
            ],
            [
                3729,
                3763
            ],
            [
                3763,
                3870
            ],
            [
                3870,
                3944
            ],
            [
                3944,
                4004
            ],
            [
                4004,
                4042
            ],
            [
                4042,
                4148
            ],
            [
                4148,
                4178
            ],
            [
                4178,
                4218
            ],
            [
                4218,
                4453
            ],
            [
                4453,
                4482
            ],
            [
                4482,
                4506
            ],
            [
                4506,
                4641
            ],
            [
                4641,
                4768
            ],
            [
                4768,
                4779
            ],
            [
                4779,
                4967
            ],
            [
                4967,
                5198
            ],
            [
                5198,
                5512
            ],
            [
                5512,
                5587
            ],
            [
                5587,
                5609
            ],
            [
                5609,
                5720
            ],
            [
                5720,
                5828
            ],
            [
                5828,
                6000
            ],
            [
                6000,
                6152
            ],
            [
                6152,
                6312
            ],
            [
                6312,
                6386
            ],
            [
                6386,
                6450
            ],
            [
                6450,
                6584
            ],
            [
                6584,
                6613
            ],
            [
                6613,
                6857
            ],
            [
                6857,
                7336
            ],
            [
                7336,
                7397
            ],
            [
                7397,
                7460
            ],
            [
                7460,
                7605
            ],
            [
                7605,
                8026
            ],
            [
                8026,
                8093
            ],
            [
                8093,
                8140
            ],
            [
                8140,
                8158
            ],
            [
                8158,
                8203
            ],
            [
                8203,
                8234
            ],
            [
                8234,
                8271
            ],
            [
                8271,
                8304
            ],
            [
                8304,
                8343
            ],
            [
                8343,
                8505
            ],
            [
                8505,
                8545
            ],
            [
                8545,
                8569
            ],
            [
                8569,
                8800
            ],
            [
                8800,
                8886
            ],
            [
                8886,
                8938
            ],
            [
                8938,
                9009
            ],
            [
                9009,
                9084
            ],
            [
                9084,
                9231
            ],
            [
                9231,
                9293
            ],
            [
                9293,
                9545
            ],
            [
                9545,
                9719
            ],
            [
                9719,
                9806
            ],
            [
                9806,
                9951
            ],
            [
                9951,
                10053
            ],
            [
                10053,
                10154
            ],
            [
                10154,
                10525
            ],
            [
                10525,
                10626
            ],
            [
                10626,
                10781
            ],
            [
                10781,
                10823
            ],
            [
                10823,
                10875
            ],
            [
                10875,
                10962
            ],
            [
                10962,
                11153
            ],
            [
                11153,
                11220
            ],
            [
                11220,
                11300
            ],
            [
                11300,
                11336
            ],
            [
                11336,
                11381
            ],
            [
                11381,
                11505
            ],
            [
                11505,
                11531
            ],
            [
                11531,
                11562
            ],
            [
                11562,
                11664
            ]
        ],
        "segment_chars": [
            [
                0,
                117
            ],
            [
                117,
                240
            ],
            [
                240,
                299
            ],
            [
                299,
                447
            ],
            [
                447,
                555
            ],
            [
                555,
                658
            ],
            [
                658,
                739
            ],
            [
                739,
                788
            ],
            [
                788,
                863
            ],
            [
                863,
                940
            ],
            [
                940,
                1007
            ],
            [
                1007,
                1137
            ],
            [
                1137,
                1449
            ],
            [
                1449,
                1518
            ],
            [
                1518,
                1573
            ],
            [
                1573,
                1646
            ],
            [
                1646,
                1755
            ],
            [
                1755,
                1780
            ],
            [
                1780,
                1838
            ],
            [
                1838,
                1940
            ],
            [
                1940,
                1972
            ],
            [
                1972,
                2018
            ],
            [
                2018,
                2055
            ],
            [
                2055,
                2105
            ],
            [
                2105,
                2152
            ],
            [
                2152,
                2372
            ],
            [
                2372,
                2443
            ],
            [
                2443,
                2539
            ],
            [
                2539,
                2693
            ],
            [
                2693,
                2770
            ],
            [
                2770,
                2857
            ],
            [
                2857,
                2890
            ],
            [
                2890,
                2925
            ],
            [
                2925,
                2986
            ],
            [
                2986,
                3010
            ],
            [
                3010,
                3037
            ],
            [
                3037,
                3057
            ],
            [
                3057,
                3089
            ],
            [
                3089,
                3105
            ],
            [
                3105,
                3200
            ],
            [
                3200,
                3243
            ],
            [
                3243,
                3260
            ],
            [
                3260,
                3299
            ],
            [
                3299,
                3333
            ],
            [
                3333,
                3389
            ],
            [
                3389,
                3424
            ],
            [
                3424,
                3468
            ],
            [
                3468,
                3491
            ],
            [
                3491,
                3506
            ],
            [
                3506,
                3637
            ],
            [
                3637,
                3658
            ],
            [
                3658,
                3698
            ],
            [
                3698,
                3729
            ],
            [
                3729,
                3763
            ],
            [
                3763,
                3787
            ],
            [
                3787,
                3826
            ],
            [
                3826,
                3870
            ],
            [
                3870,
                3913
            ],
            [
                3913,
                3944
            ],
            [
                3944,
                4004
            ],
            [
                4004,
                4042
            ],
            [
                4042,
                4074
            ],
            [
                4074,
                4103
            ],
            [
                4103,
                4148
            ],
            [
                4148,
                4178
            ],
            [
                4178,
                4218
            ],
            [
                4218,
                4312
            ],
            [
                4312,
                4356
            ],
            [
                4356,
                4453
            ],
            [
                4453,
                4482
            ],
            [
                4482,
                4506
            ],
            [
                4506,
                4592
            ],
            [
                4592,
                4641
            ],
            [
                4641,
                4667
            ],
            [
                4667,
                4726
            ],
            [
                4726,
                4768
            ],
            [
                4768,
                4779
            ],
            [
                4779,
                4827
            ],
            [
                4827,
                4967
            ],
            [
                4967,
                4999
            ],
            [
                4999,
                5129
            ],
            [
                5129,
                5198
            ],
            [
                5198,
                5274
            ],
            [
                5274,
                5325
            ],
            [
                5325,
                5384
            ],
            [
                5384,
                5512
            ],
            [
                5512,
                5587
            ],
            [
                5587,
                5609
            ],
            [
                5609,
                5654
            ],
            [
                5654,
                5695
            ],
            [
                5695,
                5720
            ],
            [
                5720,
                5737
            ],
            [
                5737,
                5772
            ],
            [
                5772,
                5798
            ],
            [
                5798,
                5828
            ],
            [
                5828,
                5849
            ],
            [
                5849,
                5911
            ],
            [
                5911,
                5959
            ],
            [
                5959,
                6000
            ],
            [
                6000,
                6056
            ],
            [
                6056,
                6152
            ],
            [
                6152,
                6312
            ],
            [
                6312,
                6346
            ],
            [
                6346,
                6386
            ],
            [
                6386,
                6450
            ],
            [
                6450,
                6492
            ],
            [
                6492,
                6523
            ],
            [
                6523,
                6584
            ],
            [
                6584,
                6613
            ],
            [
                6613,
                6680
            ],
            [
                6680,
                6711
            ],
            [
                6711,
                6783
            ],
            [
                6783,
                6857
            ],
            [
                6857,
                6978
            ],
            [
                6978,
                7111
            ],
            [
                7111,
                7227
            ],
            [
                7227,
                7291
            ],
            [
                7291,
                7336
            ],
            [
                7336,
                7397
            ],
            [
                7397,
                7408
            ],
            [
                7408,
                7423
            ],
            [
                7423,
                7460
            ],
            [
                7460,
                7532
            ],
            [
                7532,
                7570
            ],
            [
                7570,
                7592
            ],
            [
                7592,
                7605
            ],
            [
                7605,
                7690
            ],
            [
                7690,
                7764
            ],
            [
                7764,
                7929
            ],
            [
                7929,
                7983
            ],
            [
                7983,
                8026
            ],
            [
                8026,
                8093
            ],
            [
                8093,
                8140
            ],
            [
                8140,
                8158
            ],
            [
                8158,
                8203
            ],
            [
                8203,
                8234
            ],
            [
                8234,
                8271
            ],
            [
                8271,
                8304
            ],
            [
                8304,
                8343
            ],
            [
                8343,
                8380
            ],
            [
                8380,
                8427
            ],
            [
                8427,
                8505
            ],
            [
                8505,
                8523
            ],
            [
                8523,
                8545
            ],
            [
                8545,
                8569
            ],
            [
                8569,
                8668
            ],
            [
                8668,
                8682
            ],
            [
                8682,
                8717
            ],
            [
                8717,
                8784
            ],
            [
                8784,
                8800
            ],
            [
                8800,
                8886
            ],
            [
                8886,
                8938
            ],
            [
                8938,
                8974
            ],
            [
                8974,
                9009
            ],
            [
                9009,
                9041
            ],
            [
                9041,
                9084
            ],
            [
                9084,
                9138
            ],
            [
                9138,
                9231
            ],
            [
                9231,
                9293
            ],
            [
                9293,
                9308
            ],
            [
                9308,
                9372
            ],
            [
                9372,
                9397
            ],
            [
                9397,
                9545
            ],
            [
                9545,
                9563
            ],
            [
                9563,
                9613
            ],
            [
                9613,
                9698
            ],
            [
                9698,
                9719
            ],
            [
                9719,
                9731
            ],
            [
                9731,
                9806
            ],
            [
                9806,
                9850
            ],
            [
                9850,
                9898
            ],
            [
                9898,
                9951
            ],
            [
                9951,
                10053
            ],
            [
                10053,
                10065
            ],
            [
                10065,
                10084
            ],
            [
                10084,
                10124
            ],
            [
                10124,
                10154
            ],
            [
                10154,
                10213
            ],
            [
                10213,
                10292
            ],
            [
                10292,
                10414
            ],
            [
                10414,
                10455
            ],
            [
                10455,
                10525
            ],
            [
                10525,
                10626
            ],
            [
                10626,
                10781
            ],
            [
                10781,
                10823
            ],
            [
                10823,
                10875
            ],
            [
                10875,
                10920
            ],
            [
                10920,
                10962
            ],
            [
                10962,
                11075
            ],
            [
                11075,
                11153
            ],
            [
                11153,
                11164
            ],
            [
                11164,
                11186
            ],
            [
                11186,
                11220
            ],
            [
                11220,
                11300
            ],
            [
                11300,
                11336
            ],
            [
                11336,
                11363
            ],
            [
                11363,
                11381
            ],
            [
                11381,
                11438
            ],
            [
                11438,
                11467
            ],
            [
                11467,
                11505
            ],
            [
                11505,
                11531
            ],
            [
                11531,
                11562
            ],
            [
                11562,
                11587
            ],
            [
                11587,
                11625
            ],
            [
                11625,
                11664
            ]
        ],
        "overlap_chars": [
            [
                0,
                93
            ],
            [
                108,
                117
            ],
            [
                117,
                138
            ],
            [
                144,
                181
            ],
            [
                189,
                200
            ],
            [
                201,
                218
            ],
            [
                219,
                226
            ],
            [
                229,
                238
            ],
            [
                238,
                240
            ],
            [
                240,
                299
            ],
            [
                299,
                306
            ],
            [
                312,
                367
            ],
            [
                368,
                370
            ],
            [
                375,
                387
            ],
            [
                387,
                393
            ],
            [
                394,
                397
            ],
            [
                398,
                403
            ],
            [
                404,
                446
            ],
            [
                447,
                449
            ],
            [
                450,
                516
            ],
            [
                519,
                555
            ],
            [
                555,
                603
            ],
            [
                604,
                607
            ],
            [
                608,
                636
            ],
            [
                641,
                646
            ],
            [
                647,
                656
            ],
            [
                656,
                658
            ],
            [
                673,
                676
            ],
            [
                687,
                697
            ],
            [
                702,
                739
            ],
            [
                739,
                746
            ],
            [
                751,
                753
            ],
            [
                765,
                773
            ],
            [
                779,
                788
            ],
            [
                793,
                800
            ],
            [
                809,
                861
            ],
            [
                861,
                863
            ],
            [
                863,
                940
            ],
            [
                940,
                953
            ],
            [
                954,
                1007
            ],
            [
                1007,
                1135
            ],
            [
                1135,
                1137
            ],
            [
                1137,
                1144
            ],
            [
                1149,
                1154
            ],
            [
                1155,
                1163
            ],
            [
                1166,
                1273
            ],
            [
                1276,
                1280
            ],
            [
                1281,
                1448
            ],
            [
                1449,
                1452
            ],
            [
                1456,
                1458
            ],
            [
                1459,
                1464
            ],
            [
                1465,
                1485
            ],
            [
                1486,
                1512
            ],
            [
                1516,
                1518
            ],
            [
                1518,
                1529
            ],
            [
                1535,
                1573
            ],
            [
                1573,
                1575
            ],
            [
                1584,
                1614
            ],
            [
                1624,
                1644
            ],
            [
                1644,
                1646
            ],
            [
                1646,
                1696
            ],
            [
                1698,
                1755
            ],
            [
                1755,
                1780
            ],
            [
                1780,
                1838
            ],
            [
                1838,
                1869
            ],
            [
                1870,
                1907
            ],
            [
                1917,
                1923
            ],
            [
                1932,
                1938
            ],
            [
                1940,
                1943
            ],
            [
                1944,
                1957
            ],
            [
                1964,
                1972
            ],
            [
                1972,
                2018
            ],
            [
                2018,
                2055
            ],
            [
                2055,
                2105
            ],
            [
                2105,
                2152
            ],
            [
                2152,
                2159
            ],
            [
                2160,
                2207
            ],
            [
                2214,
                2257
            ],
            [
                2258,
                2332
            ],
            [
                2333,
                2372
            ],
            [
                2385,
                2386
            ],
            [
                2387,
                2443
            ],
            [
                2443,
                2486
            ],
            [
                2487,
                2503
            ],
            [
                2504,
                2515
            ],
            [
                2520,
                2539
            ],
            [
                2559,
                2561
            ],
            [
                2562,
                2608
            ],
            [
                2609,
                2618
            ],
            [
                2621,
                2637
            ],
            [
                2640,
                2649
            ],
            [
                2650,
                2655
            ],
            [
                2656,
                2658
            ],
            [
                2667,
                2682
            ],
            [
                2683,
                2691
            ],
            [
                2691,
                2693
            ],
            [
                2693,
                2722
            ],
            [
                2733,
                2736
            ],
            [
                2737,
                2748
            ],
            [
                2768,
                2770
            ],
            [
                2770,
                2776
            ],
            [
                2777,
                2812
            ],
            [
                2819,
                2827
            ],
            [
                2828,
                2856
            ],
            [
                2857,
                2887
            ],
            [
                2887,
                2890
            ],
            [
                2890,
                2925
            ],
            [
                2930,
                2940
            ],
            [
                2944,
                2955
            ],
            [
                2956,
                2972
            ],
            [
                2973,
                2986
            ],
            [
                2986,
                3010
            ],
            [
                3010,
                3037
            ],
            [
                3037,
                3057
            ],
            [
                3057,
                3089
            ],
            [
                3089,
                3102
            ],
            [
                3102,
                3105
            ],
            [
                3105,
                3198
            ],
            [
                3200,
                3231
            ],
            [
                3232,
                3243
            ],
            [
                3243,
                3257
            ],
            [
                3257,
                3260
            ],
            [
                3260,
                3299
            ],
            [
                3299,
                3333
            ],
            [
                3333,
                3336
            ],
            [
                3337,
                3366
            ],
            [
                3369,
                3389
            ],
            [
                3389,
                3422
            ],
            [
                3422,
                3424
            ],
            [
                3424,
                3459
            ],
            [
                3460,
                3468
            ],
            [
                3468,
                3491
            ],
            [
                3491,
                3504
            ],
            [
                3504,
                3506
            ],
            [
                3506,
                3637
            ],
            [
                3642,
                3656
            ],
            [
                3656,
                3658
            ],
            [
                3658,
                3659
            ],
            [
                3663,
                3675
            ],
            [
                3682,
                3696
            ],
            [
                3696,
                3698
            ],
            [
                3698,
                3709
            ],
            [
                3717,
                3729
            ],
            [
                3729,
                3750
            ],
            [
                3763,
                3774
            ],
            [
                3774,
                3775
            ],
            [
                3776,
                3785
            ],
            [
                3785,
                3787
            ],
            [
                3787,
                3796
            ],
            [
                3808,
                3810
            ],
            [
                3824,
                3826
            ],
            [
                3826,
                3870
            ],
            [
                3870,
                3896
            ],
            [
                3901,
                3911
            ],
            [
                3911,
                3913
            ],
            [
                3913,
                3944
            ],
            [
                3944,
                3975
            ],
            [
                3976,
                4004
            ],
            [
                4004,
                4029
            ],
            [
                4030,
                4042
            ],
            [
                4042,
                4074
            ],
            [
                4074,
                4103
            ],
            [
                4103,
                4110
            ],
            [
                4118,
                4148
            ],
            [
                4148,
                4178
            ],
            [
                4179,
                4196
            ],
            [
                4200,
                4202
            ],
            [
                4203,
                4207
            ],
            [
                4208,
                4218
            ],
            [
                4219,
                4261
            ],
            [
                4262,
                4310
            ],
            [
                4310,
                4312
            ],
            [
                4312,
                4332
            ],
            [
                4333,
                4356
            ],
            [
                4356,
                4386
            ],
            [
                4387,
                4390
            ],
            [
                4391,
                4435
            ],
            [
                4438,
                4453
            ],
            [
                4453,
                4482
            ],
            [
                4482,
                4506
            ],
            [
                4506,
                4532
            ],
            [
                4538,
                4555
            ],
            [
                4556,
                4578
            ],
            [
                4585,
                4590
            ],
            [
                4590,
                4592
            ],
            [
                4592,
                4641
            ],
            [
                4641,
                4652
            ],
            [
                4654,
                4665
            ],
            [
                4665,
                4667
            ],
            [
                4667,
                4695
            ],
            [
                4696,
                4701
            ],
            [
                4702,
                4724
            ],
            [
                4730,
                4765
            ],
            [
                4768,
                4769
            ],
            [
                4769,
                4779
            ],
            [
                4779,
                4816
            ],
            [
                4817,
                4827
            ],
            [
                4827,
                4910
            ],
            [
                4913,
                4950
            ],
            [
                4957,
                4964
            ],
            [
                4967,
                4977
            ],
            [
                4978,
                4999
            ],
            [
                4999,
                5019
            ],
            [
                5020,
                5028
            ],
            [
                5035,
                5079
            ],
            [
                5080,
                5106
            ],
            [
                5107,
                5129
            ],
            [
                5129,
                5197
            ],
            [
                5198,
                5204
            ],
            [
                5208,
                5274
            ],
            [
                5274,
                5297
            ],
            [
                5307,
                5323
            ],
            [
                5323,
                5325
            ],
            [
                5325,
                5348
            ],
            [
                5355,
                5382
            ],
            [
                5382,
                5384
            ],
            [
                5384,
                5391
            ],
            [
                5400,
                5412
            ],
            [
                5421,
                5428
            ],
            [
                5433,
                5436
            ],
            [
                5442,
                5455
            ],
            [
                5456,
                5459
            ],
            [
                5468,
                5510
            ],
            [
                5510,
                5511
            ],
            [
                5512,
                5540
            ],
            [
                5540,
                5553
            ],
            [
                5553,
                5575
            ],
            [
                5584,
                5587
            ],
            [
                5587,
                5598
            ],
            [
                5599,
                5606
            ],
            [
                5610,
                5654
            ],
            [
                5654,
                5695
            ],
            [
                5695,
                5720
            ],
            [
                5720,
                5725
            ],
            [
                5726,
                5735
            ],
            [
                5741,
                5772
            ],
            [
                5772,
                5796
            ],
            [
                5796,
                5798
            ],
            [
                5798,
                5828
            ],
            [
                5828,
                5831
            ],
            [
                5833,
                5849
            ],
            [
                5849,
                5911
            ],
            [
                5914,
                5924
            ],
            [
                5925,
                5959
            ],
            [
                5959,
                5999
            ],
            [
                6000,
                6056
            ],
            [
                6056,
                6150
            ],
            [
                6150,
                6152
            ],
            [
                6152,
                6311
            ],
            [
                6312,
                6346
            ],
            [
                6346,
                6386
            ],
            [
                6386,
                6450
            ],
            [
                6450,
                6492
            ],
            [
                6492,
                6506
            ],
            [
                6515,
                6521
            ],
            [
                6521,
                6523
            ],
            [
                6523,
                6530
            ],
            [
                6531,
                6534
            ],
            [
                6535,
                6539
            ],
            [
                6540,
                6584
            ],
            [
                6584,
                6613
            ],
            [
                6613,
                6680
            ],
            [
                6680,
                6711
            ],
            [
                6711,
                6747
            ],
            [
                6748,
                6753
            ],
            [
                6753,
                6783
            ],
            [
                6790,
                6803
            ],
            [
                6804,
                6809
            ],
            [
                6816,
                6829
            ],
            [
                6835,
                6856
            ],
            [
                6857,
                6878
            ],
            [
                6878,
                6883
            ],
            [
                6890,
                6898
            ],
            [
                6899,
                6901
            ],
            [
                6902,
                6955
            ],
            [
                6961,
                6978
            ],
            [
                6978,
                6980
            ],
            [
                6985,
                7019
            ],
            [
                7029,
                7041
            ],
            [
                7057,
                7100
            ],
            [
                7101,
                7111
            ],
            [
                7111,
                7135
            ],
            [
                7139,
                7156
            ],
            [
                7157,
                7170
            ],
            [
                7171,
                7187
            ],
            [
                7190,
                7193
            ],
            [
                7194,
                7199
            ],
            [
                7200,
                7209
            ],
            [
                7209,
                7210
            ],
            [
                7215,
                7227
            ],
            [
                7227,
                7232
            ],
            [
                7233,
                7241
            ],
            [
                7248,
                7251
            ],
            [
                7252,
                7276
            ],
            [
                7277,
                7279
            ],
            [
                7289,
                7291
            ],
            [
                7297,
                7325
            ],
            [
                7326,
                7334
            ],
            [
                7334,
                7335
            ],
            [
                7336,
                7371
            ],
            [
                7372,
                7397
            ],
            [
                7397,
                7406
            ],
            [
                7406,
                7408
            ],
            [
                7408,
                7423
            ],
            [
                7423,
                7443
            ],
            [
                7444,
                7457
            ],
            [
                7460,
                7531
            ],
            [
                7533,
                7570
            ],
            [
                7570,
                7592
            ],
            [
                7592,
                7604
            ],
            [
                7605,
                7688
            ],
            [
                7688,
                7690
            ],
            [
                7690,
                7693
            ],
            [
                7694,
                7738
            ],
            [
                7739,
                7762
            ],
            [
                7764,
                7766
            ],
            [
                7778,
                7929
            ],
            [
                7929,
                7948
            ],
            [
                7954,
                7983
            ],
            [
                7983,
                8011
            ],
            [
                8019,
                8024
            ],
            [
                8024,
                8026
            ],
            [
                8026,
                8093
            ],
            [
                8094,
                8111
            ],
            [
                8117,
                8140
            ],
            [
                8140,
                8141
            ],
            [
                8141,
                8158
            ],
            [
                8158,
                8163
            ],
            [
                8166,
                8200
            ],
            [
                8200,
                8203
            ],
            [
                8203,
                8234
            ],
            [
                8235,
                8240
            ],
            [
                8249,
                8253
            ],
            [
                8262,
                8264
            ],
            [
                8265,
                8268
            ],
            [
                8268,
                8271
            ],
            [
                8271,
                8304
            ],
            [
                8304,
                8305
            ],
            [
                8305,
                8343
            ],
            [
                8343,
                8346
            ],
            [
                8348,
                8380
            ],
            [
                8380,
                8425
            ],
            [
                8425,
                8427
            ],
            [
                8427,
                8505
            ],
            [
                8505,
                8523
            ],
            [
                8523,
                8529
            ],
            [
                8530,
                8536
            ],
            [
                8537,
                8542
            ],
            [
                8542,
                8545
            ],
            [
                8545,
                8569
            ],
            [
                8569,
                8668
            ],
            [
                8668,
                8682
            ],
            [
                8682,
                8717
            ],
            [
                8717,
                8784
            ],
            [
                8784,
                8797
            ],
            [
                8797,
                8800
            ],
            [
                8800,
                8860
            ],
            [
                8861,
                8886
            ],
            [
                8886,
                8938
            ],
            [
                8938,
                8972
            ],
            [
                8972,
                8974
            ],
            [
                8974,
                9009
            ],
            [
                9009,
                9010
            ],
            [
                9010,
                9017
            ],
            [
                9018,
                9039
            ],
            [
                9039,
                9041
            ],
            [
                9041,
                9081
            ],
            [
                9081,
                9084
            ],
            [
                9084,
                9138
            ],
            [
                9138,
                9202
            ],
            [
                9203,
                9231
            ],
            [
                9231,
                9293
            ],
            [
                9293,
                9294
            ],
            [
                9301,
                9306
            ],
            [
                9306,
                9308
            ],
            [
                9308,
                9370
            ],
            [
                9372,
                9397
            ],
            [
                9397,
                9438
            ],
            [
                9441,
                9502
            ],
            [
                9503,
                9545
            ],
            [
                9545,
                9563
            ],
            [
                9563,
                9611
            ],
            [
                9611,
                9613
            ],
            [
                9613,
                9626
            ],
            [
                9627,
                9696
            ],
            [
                9698,
                9718
            ],
            [
                9719,
                9731
            ],
            [
                9731,
                9737
            ],
            [
                9745,
                9773
            ],
            [
                9774,
                9806
            ],
            [
                9806,
                9848
            ],
            [
                9848,
                9850
            ],
            [
                9850,
                9898
            ],
            [
                9898,
                9927
            ],
            [
                9928,
                9951
            ],
            [
                9951,
                10018
            ],
            [
                10024,
                10053
            ],
            [
                10053,
                10065
            ],
            [
                10065,
                10084
            ],
            [
                10084,
                10124
            ],
            [
                10124,
                10154
            ],
            [
                10154,
                10179
            ],
            [
                10180,
                10184
            ],
            [
                10185,
                10189
            ],
            [
                10193,
                10211
            ],
            [
                10211,
                10213
            ],
            [
                10217,
                10290
            ],
            [
                10290,
                10292
            ],
            [
                10299,
                10305
            ],
            [
                10306,
                10310
            ],
            [
                10311,
                10330
            ],
            [
                10331,
                10334
            ],
            [
                10335,
                10340
            ],
            [
                10341,
                10355
            ],
            [
                10356,
                10368
            ],
            [
                10369,
                10385
            ],
            [
                10386,
                10405
            ],
            [
                10406,
                10414
            ],
            [
                10414,
                10424
            ],
            [
                10430,
                10433
            ],
            [
                10434,
                10437
            ],
            [
                10443,
                10446
            ],
            [
                10447,
                10455
            ],
            [
                10455,
                10460
            ],
            [
                10461,
                10487
            ],
            [
                10488,
                10524
            ],
            [
                10525,
                10624
            ],
            [
                10624,
                10626
            ],
            [
                10626,
                10662
            ],
            [
                10669,
                10676
            ],
            [
                10685,
                10780
            ],
            [
                10781,
                10805
            ],
            [
                10806,
                10810
            ],
            [
                10810,
                10823
            ],
            [
                10823,
                10875
            ],
            [
                10875,
                10920
            ],
            [
                10920,
                10949
            ],
            [
                10952,
                10962
            ],
            [
                10962,
                10965
            ],
            [
                10971,
                11029
            ],
            [
                11032,
                11035
            ],
            [
                11036,
                11062
            ],
            [
                11063,
                11075
            ],
            [
                11075,
                11104
            ],
            [
                11112,
                11150
            ],
            [
                11150,
                11153
            ],
            [
                11153,
                11154
            ],
            [
                11154,
                11162
            ],
            [
                11164,
                11175
            ],
            [
                11184,
                11186
            ],
            [
                11186,
                11220
            ],
            [
                11220,
                11266
            ],
            [
                11267,
                11300
            ],
            [
                11300,
                11336
            ],
            [
                11336,
                11363
            ],
            [
                11363,
                11381
            ],
            [
                11381,
                11438
            ],
            [
                11438,
                11455
            ],
            [
                11457,
                11467
            ],
            [
                11467,
                11502
            ],
            [
                11502,
                11505
            ],
            [
                11505,
                11521
            ],
            [
                11523,
                11531
            ],
            [
                11531,
                11562
            ],
            [
                11562,
                11587
            ],
            [
                11587,
                11612
            ],
            [
                11613,
                11625
            ],
            [
                11625,
                11664
            ]
        ],
        "row_chars": [
            [
                0,
                117
            ],
            [
                117,
                117
            ],
            [
                117,
                240
            ],
            [
                240,
                299
            ],
            [
                299,
                447
            ],
            [
                447,
                555
            ],
            [
                555,
                658
            ],
            [
                658,
                739
            ],
            [
                739,
                788
            ],
            [
                788,
                863
            ],
            [
                863,
                940
            ],
            [
                940,
                1007
            ],
            [
                1007,
                1137
            ],
            [
                1137,
                1449
            ],
            [
                1449,
                1518
            ],
            [
                1518,
                1573
            ],
            [
                1573,
                1646
            ],
            [
                1646,
                1755
            ],
            [
                1755,
                1755
            ],
            [
                1755,
                1755
            ],
            [
                1755,
                1780
            ],
            [
                1780,
                1838
            ],
            [
                1838,
                1940
            ],
            [
                1940,
                1972
            ],
            [
                1972,
                2018
            ],
            [
                2018,
                2055
            ],
            [
                2055,
                2105
            ],
            [
                2105,
                2105
            ],
            [
                2105,
                2152
            ],
            [
                2152,
                2372
            ],
            [
                2372,
                2443
            ],
            [
                2443,
                2539
            ],
            [
                2539,
                2693
            ],
            [
                2693,
                2770
            ],
            [
                2770,
                2857
            ],
            [
                2857,
                2890
            ],
            [
                2890,
                2925
            ],
            [
                2925,
                2986
            ],
            [
                2986,
                3010
            ],
            [
                3010,
                3037
            ],
            [
                3037,
                3057
            ],
            [
                3057,
                3089
            ],
            [
                3089,
                3105
            ],
            [
                3105,
                3200
            ],
            [
                3200,
                3200
            ],
            [
                3200,
                3200
            ],
            [
                3200,
                3200
            ],
            [
                3200,
                3243
            ],
            [
                3243,
                3260
            ],
            [
                3260,
                3299
            ],
            [
                3299,
                3333
            ],
            [
                3333,
                3389
            ],
            [
                3389,
                3424
            ],
            [
                3424,
                3468
            ],
            [
                3468,
                3491
            ],
            [
                3491,
                3506
            ],
            [
                3506,
                3637
            ],
            [
                3637,
                3658
            ],
            [
                3658,
                3698
            ],
            [
                3698,
                3729
            ],
            [
                3729,
                3763
            ],
            [
                3763,
                3787
            ],
            [
                3787,
                3826
            ],
            [
                3826,
                3870
            ],
            [
                3870,
                3913
            ],
            [
                3913,
                3944
            ],
            [
                3944,
                4004
            ],
            [
                4004,
                4042
            ],
            [
                4042,
                4074
            ],
            [
                4074,
                4103
            ],
            [
                4103,
                4148
            ],
            [
                4148,
                4178
            ],
            [
                4178,
                4178
            ],
            [
                4178,
                4218
            ],
            [
                4218,
                4218
            ],
            [
                4218,
                4312
            ],
            [
                4312,
                4312
            ],
            [
                4312,
                4356
            ],
            [
                4356,
                4453
            ],
            [
                4453,
                4482
            ],
            [
                4482,
                4506
            ],
            [
                4506,
                4592
            ],
            [
                4592,
                4641
            ],
            [
                4641,
                4667
            ],
            [
                4667,
                4726
            ],
            [
                4726,
                4726
            ],
            [
                4726,
                4726
            ],
            [
                4726,
                4726
            ],
            [
                4726,
                4768
            ],
            [
                4768,
                4768
            ],
            [
                4768,
                4779
            ],
            [
                4779,
                4827
            ],
            [
                4827,
                4827
            ],
            [
                4827,
                4827
            ],
            [
                4827,
                4967
            ],
            [
                4967,
                4967
            ],
            [
                4967,
                4999
            ],
            [
                4999,
                4999
            ],
            [
                4999,
                4999
            ],
            [
                4999,
                5129
            ],
            [
                5129,
                5198
            ],
            [
                5198,
                5198
            ],
            [
                5198,
                5198
            ],
            [
                5198,
                5274
            ],
            [
                5274,
                5325
            ],
            [
                5325,
                5325
            ],
            [
                5325,
                5384
            ],
            [
                5384,
                5512
            ],
            [
                5512,
                5587
            ],
            [
                5587,
                5609
            ],
            [
                5609,
                5609
            ],
            [
                5609,
                5609
            ],
            [
                5609,
                5654
            ],
            [
                5654,
                5695
            ],
            [
                5695,
                5720
            ],
            [
                5720,
                5737
            ],
            [
                5737,
                5737
            ],
            [
                5737,
                5772
            ],
            [
                5772,
                5798
            ],
            [
                5798,
                5828
            ],
            [
                5828,
                5849
            ],
            [
                5849,
                5911
            ],
            [
                5911,
                5959
            ],
            [
                5959,
                6000
            ],
            [
                6000,
                6000
            ],
            [
                6000,
                6056
            ],
            [
                6056,
                6152
            ],
            [
                6152,
                6312
            ],
            [
                6312,
                6346
            ],
            [
                6346,
                6386
            ],
            [
                6386,
                6450
            ],
            [
                6450,
                6492
            ],
            [
                6492,
                6523
            ],
            [
                6523,
                6584
            ],
            [
                6584,
                6613
            ],
            [
                6613,
                6680
            ],
            [
                6680,
                6680
            ],
            [
                6680,
                6711
            ],
            [
                6711,
                6783
            ],
            [
                6783,
                6857
            ],
            [
                6857,
                6978
            ],
            [
                6978,
                6978
            ],
            [
                6978,
                7111
            ],
            [
                7111,
                7227
            ],
            [
                7227,
                7291
            ],
            [
                7291,
                7336
            ],
            [
                7336,
                7397
            ],
            [
                7397,
                7408
            ],
            [
                7408,
                7423
            ],
            [
                7423,
                7460
            ],
            [
                7460,
                7460
            ],
            [
                7460,
                7532
            ],
            [
                7532,
                7532
            ],
            [
                7532,
                7532
            ],
            [
                7532,
                7532
            ],
            [
                7532,
                7570
            ],
            [
                7570,
                7592
            ],
            [
                7592,
                7605
            ],
            [
                7605,
                7690
            ],
            [
                7690,
                7929
            ],
            [
                7929,
                7983
            ],
            [
                7983,
                8026
            ],
            [
                8026,
                8093
            ],
            [
                8093,
                8093
            ],
            [
                8093,
                8140
            ],
            [
                8140,
                8158
            ],
            [
                8158,
                8203
            ],
            [
                8203,
                8234
            ],
            [
                8234,
                8234
            ],
            [
                8234,
                8271
            ],
            [
                8271,
                8304
            ],
            [
                8304,
                8343
            ],
            [
                8343,
                8380
            ],
            [
                8380,
                8427
            ],
            [
                8427,
                8505
            ],
            [
                8505,
                8523
            ],
            [
                8523,
                8545
            ],
            [
                8545,
                8569
            ],
            [
                8569,
                8668
            ],
            [
                8668,
                8682
            ],
            [
                8682,
                8717
            ],
            [
                8717,
                8717
            ],
            [
                8717,
                8784
            ],
            [
                8784,
                8800
            ],
            [
                8800,
                8886
            ],
            [
                8886,
                8938
            ],
            [
                8938,
                8974
            ],
            [
                8974,
                9009
            ],
            [
                9009,
                9041
            ],
            [
                9041,
                9084
            ],
            [
                9084,
                9138
            ],
            [
                9138,
                9231
            ],
            [
                9231,
                9293
            ],
            [
                9293,
                9308
            ],
            [
                9308,
                9372
            ],
            [
                9372,
                9372
            ],
            [
                9372,
                9397
            ],
            [
                9397,
                9545
            ],
            [
                9545,
                9545
            ],
            [
                9545,
                9545
            ],
            [
                9545,
                9563
            ],
            [
                9563,
                9613
            ],
            [
                9613,
                9698
            ],
            [
                9698,
                9698
            ],
            [
                9698,
                9719
            ],
            [
                9719,
                9719
            ],
            [
                9719,
                9719
            ],
            [
                9719,
                9731
            ],
            [
                9731,
                9806
            ],
            [
                9806,
                9850
            ],
            [
                9850,
                9898
            ],
            [
                9898,
                9951
            ],
            [
                9951,
                10053
            ],
            [
                10053,
                10065
            ],
            [
                10065,
                10065
            ],
            [
                10065,
                10084
            ],
            [
                10084,
                10124
            ],
            [
                10124,
                10154
            ],
            [
                10154,
                10213
            ],
            [
                10213,
                10292
            ],
            [
                10292,
                10414
            ],
            [
                10414,
                10455
            ],
            [
                10455,
                10525
            ],
            [
                10525,
                10626
            ],
            [
                10626,
                10781
            ],
            [
                10781,
                10823
            ],
            [
                10823,
                10875
            ],
            [
                10875,
                10920
            ],
            [
                10920,
                10962
            ],
            [
                10962,
                11075
            ],
            [
                11075,
                11153
            ],
            [
                11153,
                11164
            ],
            [
                11164,
                11164
            ],
            [
                11164,
                11164
            ],
            [
                11164,
                11186
            ],
            [
                11186,
                11220
            ],
            [
                11220,
                11300
            ],
            [
                11300,
                11336
            ],
            [
                11336,
                11363
            ],
            [
                11363,
                11363
            ],
            [
                11363,
                11381
            ],
            [
                11381,
                11438
            ],
            [
                11438,
                11467
            ],
            [
                11467,
                11467
            ],
            [
                11467,
                11505
            ],
            [
                11505,
                11531
            ],
            [
                11531,
                11562
            ],
            [
                11562,
                11587
            ],
            [
                11587,
                11625
            ],
            [
                11625,
                11664
            ]
        ]
    }
}