{
    "original": {
        "text": "When the little conversation took place between Lady Monogram and Miss Longestaffe, as recorded in the last chapter, Mr. Melmotte was in all his glory, and tickets for the entertainment were very precious. Gradually their value subsided. Lady Monogram had paid very dear for hers,--especially as the reception of Mr. Brehgert must be considered. But high prices were then being paid. A lady offered to take Marie Melmotte into the country with her for a week; but this was before the elopement. Mr. Cohenlupe was asked out to dinner to meet two peers and a countess. Lord Alfred received various presents. A young lady gave a lock of her hair to Lord Nidderdale, although it was known that he was to marry Marie Melmotte. And Miles Grendall got back an I. O. U. of considerable nominal value from Lord Grasslough, who was anxious to accommodate two country cousins who were in London. Gradually the prices fell;--not at first from any doubt in Melmotte, but through that customary reaction which may be expected on such occasions. But at eight or nine o'clock on the evening of the party the tickets were worth nothing. The rumour had then spread itself through the whole town from Pimlico to Marylebone. Men coming home from clubs had told their wives. Ladies who had been in the park had heard it. Even the hairdressers had it, and ladies' maids had been instructed by the footmen and grooms who had been holding horses and seated on the coach-boxes. It had got into the air, and had floated round dining-rooms and over toilet-tables.\nI doubt whether Sir Damask would have said a word about it to his wife as he was dressing for dinner, had he calculated what might be the result to himself. But he came home open-mouthed, and made no calculation. \"Have you heard what's up, Ju?\" he said, rushing half-dressed into his wife's room.\n[Illustration: \"Have you heard what's up, Ju?\"]\n\"What is up?\"\n\"Haven't you been out?\"\n\"I was shopping, and that kind of thing. I don't want to take that girl into the Park. I've made a mistake in having her here, but I mean to be seen with her as little as I can.\"\n\"Be good-natured, Ju, whatever you are.\"\n\"Oh, bother! I know what I'm about. What is it you mean?\"\n\"They say Melmotte's been found out.\"\n\"Found out!\" exclaimed Lady Monogram, stopping her maid in some arrangement which would not need to be continued in the event of her not going to the reception. \"What do you mean by found out?\"\n\"I don't know exactly. There are a dozen stories told. It's something about that place he bought of old Longestaffe.\"\n\"Are the Longestaffes mixed up in it? I won't have her here a day longer if there is anything against them.\"\n\"Don't be an ass, Ju. There's nothing against him except that the poor old fellow hasn't got a shilling of his money.\"\n\"Then he's ruined,--and there's an end of them.\"\n\"Perhaps he will get it now. Some say that Melmotte has forged a receipt, others a letter. Some declare that he has manufactured a whole set of title-deeds. You remember Dolly?\"\n\"Of course I know Dolly Longestaffe,\" said Lady Monogram, who had thought at one time that an alliance with Dolly might be convenient.\n\"They say he has found it all out. There was always something about Dolly more than fellows gave him credit for. At any rate, everybody says that Melmotte will be in quod before long.\"\n\"Not to-night, Damask!\"\n\"Nobody seems to know. Lupton was saying that the policemen would wait about in the room like servants till the Emperor and the Princes had gone away.\"\n\"Is Mr. Lupton going?\"\n\"He was to have been at the dinner, but hadn't made up his mind whether he'd go or not when I saw him. Nobody seems to be quite certain whether the Emperor will go. Somebody said that a Cabinet Council was to be called to know what to do.\"\n\"A Cabinet Council!\"\n\"Why, you see it's rather an awkward thing, letting the Prince go to dine with a man who perhaps may have been arrested and taken to gaol before dinner-time. That's the worst part of it. Nobody knows.\"\nLady Monogram waved her attendant away. She piqued herself upon having a French maid who could not speak a word of English, and was therefore quite careless what she said in the woman's presence. But, of course, everything she did say was repeated down-stairs in some language that had become intelligible to the servants generally. Lady Monogram sat motionless for some time, while her husband, retreating to his own domain, finished his operations. \"Damask,\" she said, when he reappeared, \"one thing is certain;--we can't go.\"\n\"After you've made such a fuss about it!\"\n\"It is a pity,--having that girl here in the house. You know, don't you, she's going to marry one of these people?\"\n\"I heard about her marriage yesterday. But Brehgert isn't one of Melmotte's set. They tell me that Brehgert isn't a bad fellow. A vulgar cad, and all that, but nothing wrong about him.\"\n\"He's a Jew,--and he's seventy years old, and makes up horribly.\"\n\"What does it matter to you if he's eighty? You are determined, then, you won't go?\"\nBut Lady Monogram had by no means determined that she wouldn't go. She had paid her price, and with that economy which sticks to a woman always in the midst of her extravagances, she could not bear to lose the thing that she had bought. She cared nothing for Melmotte's villainy, as regarded herself. That he was enriching himself by the daily plunder of the innocent she had taken for granted since she had first heard of him. She had but a confused idea of any difference between commerce and fraud. But it would grieve her greatly to become known as one of an awkward squad of people who had driven to the door, and perhaps been admitted to some wretched gathering of wretched people,--and not, after all, to have met the Emperor and the Prince. But then, should she hear on the next morning that the Emperor and the Princes, that the Princesses, and the Duchesses, with the Ambassadors, Cabinet Ministers, and proper sort of world generally, had all been there,--that the world, in short, had ignored Melmotte's villainy,--then would her grief be still greater. She sat down to dinner with her husband and Miss Longestaffe, and could not talk freely on the matter. Miss Longestaffe was still a guest of the Melmottes, although she had transferred herself to the Monograms for a day or two. And a horrible idea crossed Lady Monogram's mind. What should she do with her friend Georgiana if the whole Melmotte establishment were suddenly broken up? Of course, Madame Melmotte would refuse to take the girl back if her husband were sent to gaol. \"I suppose you'll go,\" said Sir Damask as the ladies left the room.\n\"Of course we shall,--in about an hour,\" said Lady Monogram as she left the room, looking round at him and rebuking him for his imprudence.\n\"Because, you know--\" and then he called her back. \"If you want me I'll stay, of course; but if you don't, I'll go down to the club.\"\n\"How can I say, yet? You needn't mind the club to-night.\"\n\"All right;--only it's a bore being here alone.\"\nThen Miss Longestaffe asked what \"was up.\" \"Is there any doubt about our going to-night?\"\n\"I can't say. I'm so harassed that I don't know what I'm about. There seems to be a report that the Emperor won't be there.\"\n\"Impossible!\"\n\"It's all very well to say impossible, my dear,\" said Lady Monogram; \"but still that's what people are saying. You see Mr. Melmotte is a very great man, but perhaps--something else has turned up, so that he may be thrown over. Things of that kind do happen. You had better finish dressing. I shall. But I shan't make sure of going till I hear that the Emperor is there.\" Then she descended to her husband, whom she found forlornly consoling himself with a cigar. \"Damask,\" she said, \"you must find out.\"\n\"Find out what?\"\n\"Whether the Prince and the Emperor are there.\"\n\"Send John to ask,\" suggested the husband.\n\"He would be sure to make a blunder about it. If you'd go yourself you'd learn the truth in a minute. Have a cab,--just go into the hall and you'll soon know how it all is;--I'd do it in a minute if I were you.\" Sir Damask was the most good-natured man in the world, but he did not like the job. \"What can be the objection?\" asked his wife.\n\"Go to a man's house and find out whether a man's guests are come before you go yourself! I don't just see it, Ju.\"\n\"Guests! What nonsense! The Emperor and all the Royal Family! As if it were like any other party. Such a thing, probably, never happened before, and never will happen again. If you don't go, Damask, I must; and I will.\" Sir Damask, after groaning and smoking for half a minute, said that he would go. He made many remonstrances. It was a confounded bore. He hated emperors and he hated princes. He hated the whole box and dice of that sort of thing! He \"wished to goodness\" that he had dined at his club and sent word up home that the affair was to be off. But at last he submitted, and allowed his wife to leave the room with the intention of sending for a cab. The cab was sent for and announced, but Sir Damask would not stir till he had finished his big cigar.\nIt was past ten when he left his own house. On arriving in Grosvenor Square he could at once see that the party was going on. The house was illuminated. There was a concourse of servants round the door, and half the square was already blocked up with carriages. It was not without delay that he got to the door, and when there he saw the royal liveries. There was no doubt about the party. The Emperor and the Princes and the Princesses were all there. As far as Sir Damask could then perceive, the dinner had been quite a success. But again there was a delay in getting away, and it was nearly eleven before he could reach home. \"It's all right,\" said he to his wife. \"They're there, safe enough.\"\n\"You are sure that the Emperor is there.\"\n\"As sure as a man can be without having seen him.\"\nMiss Longestaffe was present at this moment, and could not but resent what appeared to be a most unseemly slur cast upon her friends. \"I don't understand it at all,\" she said. \"Of course the Emperor is there. Everybody has known for the last month that he was coming. What is the meaning of it, Julia?\"\n\"My dear, you must allow me to manage my own little affairs my own way. I dare say I am absurd. But I have my reason. Now, Damask, if the carriage is there we had better start.\" The carriage was there, and they did start, and with a delay which seemed unprecedented, even to Lady Monogram, who was accustomed to these things, they reached the door. There was a great crush in the hall, and people were coming down-stairs. But at last they made their way into the room above, and found that the Emperor of China and all the Royalties had been there,--but had taken their departure.\nSir Damask put the ladies into the carriage and went at once to his club.",
        "paragraph_chars": [
            [
                0,
                1537
            ],
            [
                1537,
                1834
            ],
            [
                1834,
                1882
            ],
            [
                1882,
                1896
            ],
            [
                1896,
                1920
            ],
            [
                1920,
                2099
            ],
            [
                2099,
                2140
            ],
            [
                2140,
                2198
            ],
            [
                2198,
                2236
            ],
            [
                2236,
                2430
            ],
            [
                2430,
                2548
            ],
            [
                2548,
                2657
            ],
            [
                2657,
                2776
            ],
            [
                2776,
                2825
            ],
            [
                2825,
                3003
            ],
            [
                3003,
                3138
            ],
            [
                3138,
                3323
            ],
            [
                3323,
                3347
            ],
            [
                3347,
                3499
            ],
            [
                3499,
                3522
            ],
            [
                3522,
                3762
            ],
            [
                3762,
                3783
            ],
            [
                3783,
                3985
            ],
            [
                3985,
                4514
            ],
            [
                4514,
                4556
            ],
            [
                4556,
                4672
            ],
            [
                4672,
                4858
            ],
            [
                4858,
                4924
            ],
            [
                4924,
                5009
            ],
            [
                5009,
                6623
            ],
            [
                6623,
                6763
            ],
            [
                6763,
                6897
            ],
            [
                6897,
                6955
            ],
            [
                6955,
                7004
            ],
            [
                7004,
                7094
            ],
            [
                7094,
                7219
            ],
            [
                7219,
                7233
            ],
            [
                7233,
                7737
            ],
            [
                7737,
                7754
            ],
            [
                7754,
                7802
            ],
            [
                7802,
                7845
            ],
            [
                7845,
                8186
            ],
            [
                8186,
                8302
            ],
            [
                8302,
                9067
            ],
            [
                9067,
                9766
            ],
            [
                9766,
                9808
            ],
            [
                9808,
                9859
            ],
            [
                9859,
                10162
            ],
            [
                10162,
                10743
            ],
            [
                10743,
                10816
            ]
        ],
        "segment_chars": [
            [
                0,
                206
            ],
            [
                206,
                238
            ],
            [
                238,
                346
            ],
            [
                346,
                384
            ],
            [
                384,
                495
            ],
            [
                495,
                567
            ],
            [
                567,
                606
            ],
            [
                606,
                722
            ],
            [
                722,
                885
            ],
            [
                885,
                1031
            ],
            [
                1031,
                1120
            ],
            [
                1120,
                1205
            ],
            [
                1205,
                1254
            ],
            [
                1254,
                1300
            ],
            [
                1300,
                1453
            ],
            [
                1453,
                1537
            ],
            [
                1537,
                1694
            ],
            [
                1694,
                1750
            ],
            [
                1750,
                1782
            ],
            [
                1782,
                1834
            ],
            [
                1834,
                1882
            ],
            [
                1882,
                1896
            ],
            [
                1896,
                1920
            ],
            [
                1920,
                1961
            ],
            [
                1961,
                2007
            ],
            [
                2007,
                2099
            ],
            [
                2099,
                2140
            ],
            [
                2140,
                2153
            ],
            [
                2153,
                2176
            ],
            [
                2176,
                2198
            ],
            [
                2198,
                2236
            ],
            [
                2236,
                2249
            ],
            [
                2249,
                2397
            ],
            [
                2397,
                2430
            ],
            [
                2430,
                2453
            ],
            [
                2453,
                2485
            ],
            [
                2485,
                2548
            ],
            [
                2548,
                2586
            ],
            [
                2586,
                2657
            ],
            [
                2657,
                2679
            ],
            [
                2679,
                2776
            ],
            [
                2776,
                2825
            ],
            [
                2825,
                2854
            ],
            [
                2854,
                2916
            ],
            [
                2916,
                2982
            ],
            [
                2982,
                3003
            ],
            [
                3003,
                3138
            ],
            [
                3138,
                3173
            ],
            [
                3173,
                3251
            ],
            [
                3251,
                3323
            ],
            [
                3323,
                3347
            ],
            [
                3347,
                3370
            ],
            [
                3370,
                3499
            ],
            [
                3499,
                3522
            ],
            [
                3522,
                3625
            ],
            [
                3625,
                3687
            ],
            [
                3687,
                3762
            ],
            [
                3762,
                3783
            ],
            [
                3783,
                3941
            ],
            [
                3941,
                3970
            ],
            [
                3970,
                3985
            ],
            [
                3985,
                4025
            ],
            [
                4025,
                4181
            ],
            [
                4181,
                4318
            ],
            [
                4318,
                4436
            ],
            [
                4436,
                4514
            ],
            [
                4514,
                4556
            ],
            [
                4556,
                4608
            ],
            [
                4608,
                4672
            ],
            [
                4672,
                4711
            ],
            [
                4711,
                4753
            ],
            [
                4753,
                4800
            ],
            [
                4800,
                4858
            ],
            [
                4858,
                4924
            ],
            [
                4924,
                4968
            ],
            [
                4968,
                5009
            ],
            [
                5009,
                5076
            ],
            [
                5076,
                5246
            ],
            [
                5246,
                5310
            ],
            [
                5310,
                5437
            ],
            [
                5437,
                5511
            ],
            [
                5511,
                5758
            ],
            [
                5758,
                6075
            ],
            [
                6075,
                6178
            ],
            [
                6178,
                6303
            ],
            [
                6303,
                6353
            ],
            [
                6353,
                6459
            ],
            [
                6459,
                6555
            ],
            [
                6555,
                6623
            ],
            [
                6623,
                6763
            ],
            [
                6763,
                6814
            ],
            [
                6814,
                6897
            ],
            [
                6897,
                6918
            ],
            [
                6918,
                6955
            ],
            [
                6955,
                7004
            ],
            [
                7004,
                7047
            ],
            [
                7047,
                7094
            ],
            [
                7094,
                7108
            ],
            [
                7108,
                7158
            ],
            [
                7158,
                7219
            ],
            [
                7219,
                7233
            ],
            [
                7233,
                7344
            ],
            [
                7344,
                7460
            ],
            [
                7460,
                7491
            ],
            [
                7491,
                7523
            ],
            [
                7523,
                7532
            ],
            [
                7532,
                7604
            ],
            [
                7604,
                7696
            ],
            [
                7696,
                7737
            ],
            [
                7737,
                7754
            ],
            [
                7754,
                7802
            ],
            [
                7802,
                7845
            ],
            [
                7845,
                7891
            ],
            [
                7891,
                7947
            ],
            [
                7947,
                8057
            ],
            [
                8057,
                8141
            ],
            [
                8141,
                8170
            ],
            [
                8170,
                8186
            ],
            [
                8186,
                8276
            ],
            [
                8276,
                8302
            ],
            [
                8302,
                8311
            ],
            [
                8311,
                8326
            ],
            [
                8326,
                8364
            ],
            [
                8364,
                8400
            ],
            [
                8400,
                8476
            ],
            [
                8476,
                8522
            ],
            [
                8522,
                8603
            ],
            [
                8603,
                8631
            ],
            [
                8631,
                8657
            ],
            [
                8657,
                8697
            ],
            [
                8697,
                8752
            ],
            [
                8752,
                8859
            ],
            [
                8859,
                8965
            ],
            [
                8965,
                9067
            ],
            [
                9067,
                9111
            ],
            [
                9111,
                9193
            ],
            [
                9193,
                9220
            ],
            [
                9220,
                9329
            ],
            [
                9329,
                9421
            ],
            [
                9421,
                9457
            ],
            [
                9457,
                9520
            ],
            [
                9520,
                9599
            ],
            [
                9599,
                9697
            ],
            [
                9697,
                9736
            ],
            [
                9736,
                9766
            ],
            [
                9766,
                9808
            ],
            [
                9808,
                9859
            ],
            [
                9859,
                9993
            ],
            [
                9993,
                10035
            ],
            [
                10035,
                10068
            ],
            [
                10068,
                10127
            ],
            [
                10127,
                10162
            ],
            [
                10162,
                10234
            ],
            [
                10234,
                10258
            ],
            [
                10258,
                10280
            ],
            [
                10280,
                10340
            ],
            [
                10340,
                10511
            ],
            [
                10511,
                10584
            ],
            [
                10584,
                10743
            ],
            [
                10743,
                10816
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                9,
                82
            ],
            [
                115,
                206
            ],
            [
                350,
                366
            ],
            [
                372,
                384
            ],
            [
                495,
                567
            ],
            [
                567,
                606
            ],
            [
                606,
                721
            ],
            [
                954,
                957
            ],
            [
                895,
                911
            ],
            [
                1038,
                1120
            ],
            [
                1120,
                1134
            ],
            [
                1140,
                1146
            ],
            [
                1154,
                1205
            ],
            [
                1205,
                1254
            ],
            [
                1254,
                1300
            ],
            [
                1300,
                1325
            ],
            [
                1326,
                1347
            ],
            [
                1422,
                1425
            ],
            [
                1375,
                1393
            ],
            [
                1451,
                1453
            ],
            [
                1453,
                1476
            ],
            [
                1535,
                1537
            ],
            [
                1537,
                1607
            ],
            [
                1637,
                1638
            ],
            [
                1611,
                1613
            ],
            [
                1639,
                1642
            ],
            [
                1646,
                1661
            ],
            [
                1671,
                1681
            ],
            [
                1662,
                1670
            ],
            [
                1692,
                1694
            ],
            [
                1694,
                1697
            ],
            [
                1729,
                1749
            ],
            [
                1750,
                1781
            ],
            [
                1782,
                1789
            ],
            [
                1698,
                1710
            ],
            [
                1789,
                1834
            ],
            [
                1882,
                1896
            ],
            [
                2198,
                2236
            ],
            [
                2236,
                2249
            ],
            [
                2249,
                2272
            ],
            [
                2395,
                2397
            ],
            [
                2397,
                2414
            ],
            [
                2427,
                2430
            ],
            [
                2430,
                2453
            ],
            [
                2453,
                2485
            ],
            [
                2485,
                2526
            ],
            [
                2530,
                2548
            ],
            [
                2548,
                2586
            ],
            [
                2586,
                2657
            ],
            [
                2657,
                2679
            ],
            [
                2679,
                2702
            ],
            [
                2707,
                2776
            ],
            [
                2776,
                2793
            ],
            [
                2796,
                2825
            ],
            [
                2825,
                2854
            ],
            [
                2854,
                2898
            ],
            [
                2906,
                2914
            ],
            [
                2954,
                2982
            ],
            [
                3139,
                3147
            ],
            [
                2995,
                3000
            ],
            [
                3034,
                3038
            ],
            [
                3151,
                3173
            ],
            [
                3173,
                3189
            ],
            [
                3212,
                3216
            ],
            [
                3200,
                3211
            ],
            [
                3217,
                3251
            ],
            [
                3251,
                3300
            ],
            [
                3309,
                3323
            ],
            [
                3323,
                3327
            ],
            [
                3336,
                3347
            ],
            [
                3347,
                3370
            ],
            [
                3370,
                3417
            ],
            [
                3450,
                3499
            ],
            [
                3499,
                3522
            ],
            [
                3522,
                3525
            ],
            [
                3562,
                3585
            ],
            [
                3609,
                3625
            ],
            [
                3625,
                3687
            ],
            [
                3687,
                3740
            ],
            [
                3797,
                3871
            ],
            [
                3880,
                3883
            ],
            [
                3894,
                3902
            ],
            [
                3921,
                3941
            ],
            [
                3941,
                3970
            ],
            [
                3970,
                3985
            ],
            [
                3985,
                4008
            ],
            [
                4019,
                4025
            ],
            [
                4025,
                4141
            ],
            [
                4156,
                4181
            ],
            [
                4181,
                4211
            ],
            [
                4220,
                4232
            ],
            [
                4316,
                4318
            ],
            [
                4318,
                4379
            ],
            [
                4411,
                4419
            ],
            [
                4434,
                4435
            ],
            [
                4436,
                4455
            ],
            [
                4476,
                4477
            ],
            [
                4500,
                4514
            ],
            [
                4514,
                4556
            ],
            [
                4556,
                4570
            ],
            [
                4572,
                4608
            ],
            [
                4608,
                4616
            ],
            [
                4629,
                4672
            ],
            [
                4711,
                4753
            ],
            [
                4753,
                4800
            ],
            [
                4800,
                4858
            ],
            [
                4858,
                4870
            ],
            [
                4872,
                4888
            ],
            [
                4921,
                4924
            ],
            [
                4924,
                4968
            ],
            [
                4968,
                5009
            ],
            [
                5009,
                5042
            ],
            [
                5074,
                5076
            ],
            [
                5076,
                5103
            ],
            [
                5188,
                5246
            ],
            [
                5246,
                5287
            ],
            [
                5377,
                5390
            ],
            [
                5391,
                5435
            ],
            [
                5287,
                5288
            ],
            [
                5441,
                5444
            ],
            [
                5449,
                5511
            ],
            [
                5515,
                5565
            ],
            [
                5596,
                5627
            ],
            [
                5702,
                5717
            ],
            [
                5726,
                5758
            ],
            [
                5758,
                5783
            ],
            [
                5787,
                5836
            ],
            [
                5919,
                5922
            ],
            [
                5847,
                5866
            ],
            [
                5938,
                5973
            ],
            [
                6002,
                6005
            ],
            [
                6036,
                6040
            ],
            [
                6047,
                6056
            ],
            [
                6041,
                6046
            ],
            [
                6057,
                6074
            ],
            [
                6075,
                6178
            ],
            [
                6178,
                6243
            ],
            [
                6271,
                6302
            ],
            [
                6555,
                6623
            ],
            [
                6623,
                6642
            ],
            [
                6645,
                6682
            ],
            [
                6703,
                6712
            ],
            [
                6719,
                6725
            ],
            [
                6739,
                6763
            ],
            [
                6814,
                6815
            ],
            [
                6815,
                6897
            ],
            [
                7004,
                7031
            ],
            [
                7047,
                7082
            ],
            [
                7091,
                7094
            ],
            [
                7158,
                7219
            ],
            [
                7219,
                7233
            ],
            [
                7233,
                7306
            ],
            [
                7313,
                7344
            ],
            [
                7344,
                7397
            ],
            [
                7399,
                7408
            ],
            [
                7414,
                7427
            ],
            [
                7458,
                7460
            ],
            [
                7460,
                7491
            ],
            [
                7491,
                7523
            ],
            [
                7532,
                7604
            ],
            [
                7604,
                7637
            ],
            [
                7694,
                7696
            ],
            [
                7696,
                7734
            ],
            [
                7755,
                7802
            ],
            [
                7802,
                7845
            ],
            [
                7891,
                7947
            ],
            [
                7952,
                7957
            ],
            [
                8054,
                8056
            ],
            [
                8057,
                8067
            ],
            [
                8119,
                8141
            ],
            [
                8186,
                8251
            ],
            [
                8274,
                8276
            ],
            [
                8276,
                8277
            ],
            [
                8284,
                8288
            ],
            [
                8278,
                8283
            ],
            [
                8289,
                8302
            ],
            [
                8476,
                8521
            ],
            [
                8522,
                8601
            ],
            [
                8631,
                8657
            ],
            [
                8657,
                8678
            ],
            [
                8688,
                8697
            ],
            [
                8859,
                8888
            ],
            [
                8965,
                8985
            ],
            [
                9065,
                9067
            ],
            [
                9067,
                9111
            ],
            [
                9111,
                9193
            ],
            [
                9193,
                9218
            ],
            [
                9268,
                9329
            ],
            [
                9383,
                9387
            ],
            [
                9359,
                9378
            ],
            [
                9394,
                9421
            ],
            [
                9421,
                9439
            ],
            [
                9455,
                9457
            ],
            [
                9457,
                9520
            ],
            [
                9599,
                9602
            ],
            [
                9648,
                9696
            ],
            [
                9697,
                9736
            ],
            [
                9736,
                9766
            ],
            [
                9766,
                9805
            ],
            [
                9808,
                9859
            ],
            [
                9859,
                9887
            ],
            [
                9902,
                9907
            ],
            [
                9965,
                9992
            ],
            [
                9993,
                10035
            ],
            [
                10035,
                10068
            ],
            [
                10068,
                10127
            ],
            [
                10127,
                10162
            ],
            [
                10162,
                10234
            ],
            [
                10234,
                10258
            ],
            [
                10258,
                10280
            ],
            [
                10280,
                10340
            ],
            [
                10340,
                10382
            ],
            [
                10509,
                10511
            ],
            [
                10546,
                10547
            ],
            [
                10511,
                10546
            ],
            [
                10582,
                10584
            ],
            [
                10584,
                10709
            ],
            [
                10716,
                10719
            ],
            [
                10741,
                10743
            ],
            [
                10743,
                10816
            ]
        ],
        "row_chars": [
            [
                0,
                206
            ],
            [
                206,
                238
            ],
            [
                238,
                346
            ],
            [
                346,
                384
            ],
            [
                384,
                495
            ],
            [
                495,
                567
            ],
            [
                567,
                606
            ],
            [
                606,
                722
            ],
            [
                722,
                885
            ],
            [
                885,
                1120
            ],
            [
                1120,
                1205
            ],
            [
                1205,
                1254
            ],
            [
                1254,
                1300
            ],
            [
                1300,
                1453
            ],
            [
                1453,
                1537
            ],
            [
                1537,
                1694
            ],
            [
                1694,
                1834
            ],
            [
                1834,
                1882
            ],
            [
                1882,
                1896
            ],
            [
                1896,
                1920
            ],
            [
                1920,
                1961
            ],
            [
                1961,
                2007
            ],
            [
                2007,
                2099
            ],
            [
                2099,
                2140
            ],
            [
                2140,
                2153
            ],
            [
                2153,
                2176
            ],
            [
                2176,
                2198
            ],
            [
                2198,
                2236
            ],
            [
                2236,
                2249
            ],
            [
                2249,
                2397
            ],
            [
                2397,
                2430
            ],
            [
                2430,
                2453
            ],
            [
                2453,
                2485
            ],
            [
                2485,
                2548
            ],
            [
                2548,
                2586
            ],
            [
                2586,
                2657
            ],
            [
                2657,
                2679
            ],
            [
                2679,
                2776
            ],
            [
                2776,
                2825
            ],
            [
                2825,
                2854
            ],
            [
                2854,
                2982
            ],
            [
                2982,
                3173
            ],
            [
                3173,
                3251
            ],
            [
                3251,
                3323
            ],
            [
                3323,
                3347
            ],
            [
                3347,
                3370
            ],
            [
                3370,
                3499
            ],
            [
                3499,
                3522
            ],
            [
                3522,
                3625
            ],
            [
                3625,
                3687
            ],
            [
                3687,
                3762
            ],
            [
                3762,
                3783
            ],
            [
                3783,
                3941
            ],
            [
                3941,
                3970
            ],
            [
                3970,
                3985
            ],
            [
                3985,
                4025
            ],
            [
                4025,
                4181
            ],
            [
                4181,
                4318
            ],
            [
                4318,
                4436
            ],
            [
                4436,
                4514
            ],
            [
                4514,
                4556
            ],
            [
                4556,
                4608
            ],
            [
                4608,
                4672
            ],
            [
                4672,
                4711
            ],
            [
                4711,
                4753
            ],
            [
                4753,
                4800
            ],
            [
                4800,
                4858
            ],
            [
                4858,
                4924
            ],
            [
                4924,
                4968
            ],
            [
                4968,
                5009
            ],
            [
                5009,
                5076
            ],
            [
                5076,
                5246
            ],
            [
                5246,
                5511
            ],
            [
                5511,
                5758
            ],
            [
                5758,
                6075
            ],
            [
                6075,
                6178
            ],
            [
                6178,
                6303
            ],
            [
                6303,
                6353
            ],
            [
                6353,
                6459
            ],
            [
                6459,
                6555
            ],
            [
                6555,
                6623
            ],
            [
                6623,
                6763
            ],
            [
                6763,
                6814
            ],
            [
                6814,
                6897
            ],
            [
                6897,
                6918
            ],
            [
                6918,
                6955
            ],
            [
                6955,
                7004
            ],
            [
                7004,
                7094
            ],
            [
                7094,
                7108
            ],
            [
                7108,
                7158
            ],
            [
                7158,
                7219
            ],
            [
                7219,
                7233
            ],
            [
                7233,
                7344
            ],
            [
                7344,
                7460
            ],
            [
                7460,
                7491
            ],
            [
                7491,
                7523
            ],
            [
                7523,
                7532
            ],
            [
                7532,
                7604
            ],
            [
                7604,
                7696
            ],
            [
                7696,
                7802
            ],
            [
                7802,
                7845
            ],
            [
                7845,
                7891
            ],
            [
                7891,
                7947
            ],
            [
                7947,
                8057
            ],
            [
                8057,
                8141
            ],
            [
                8141,
                8170
            ],
            [
                8170,
                8186
            ],
            [
                8186,
                8276
            ],
            [
                8276,
                8302
            ],
            [
                8302,
                8311
            ],
            [
                8311,
                8326
            ],
            [
                8326,
                8364
            ],
            [
                8364,
                8400
            ],
            [
                8400,
                8476
            ],
            [
                8476,
                8522
            ],
            [
                8522,
                8657
            ],
            [
                8657,
                8697
            ],
            [
                8697,
                8752
            ],
            [
                8752,
                8859
            ],
            [
                8859,
                9067
            ],
            [
                9067,
                9111
            ],
            [
                9111,
                9193
            ],
            [
                9193,
                9329
            ],
            [
                9329,
                9421
            ],
            [
                9421,
                9457
            ],
            [
                9457,
                9520
            ],
            [
                9520,
                9599
            ],
            [
                9599,
                9697
            ],
            [
                9697,
                9736
            ],
            [
                9736,
                9766
            ],
            [
                9766,
                9808
            ],
            [
                9808,
                9859
            ],
            [
                9859,
                9993
            ],
            [
                9993,
                10035
            ],
            [
                10035,
                10068
            ],
            [
                10068,
                10127
            ],
            [
                10127,
                10162
            ],
            [
                10162,
                10234
            ],
            [
                10234,
                10258
            ],
            [
                10258,
                10280
            ],
            [
                10280,
                10340
            ],
            [
                10340,
                10511
            ],
            [
                10511,
                10584
            ],
            [
                10584,
                10743
            ],
            [
                10743,
                10816
            ]
        ]
    },
    "abridged": {
        "text": "When that little conversation took place between Lady Monogram and Miss Longestaffe, Mr. Melmotte was in all his glory, and tickets for the entertainment were very precious. High prices were being paid. Mr. Cohenlupe was asked out to dinner to meet two peers and a countess. Lord Alfred received various presents. A young lady gave a lock of her hair to Lord Nidderdale, although it was known that he was to marry Marie Melmotte.\nBut gradually the prices fell; and by eight or nine o'clock on the evening of the party the tickets were worth nothing. The rumour had spread through the whole town from Pimlico to Marylebone. Men coming home from clubs had told their wives. Ladies who had been in the park had heard it. Even the hairdressers had heard it, and ladies' maids and footmen and grooms. It had got into the air.\nI doubt whether Sir Damask would have said a word about it to his wife, if he had calculated what the result might be. But he made no calculation.\n\"Have you heard what's up, Ju?\" he said when he came home, rushing half-dressed into his wife's room.\n\"What is up?\"\n\"They say Melmotte's been found out.\"\n\"Found out!\" exclaimed Lady Monogram. \"What do you mean?\"\n\"I don't know exactly. There are a dozen stories told. It's something about that place he bought off old Longestaffe.\"\n\"Are the Longestaffes mixed up in it? I won't have her here a day longer if there is anything against them.\"\n\"Don't be an ass, Ju. There's nothing against them except that the poor old fellow hasn't got a shilling of his money.\"\n\"Then he's ruined - and there's an end of them.\"\n\"Perhaps he will get it now. Some say that Melmotte has forged a receipt, or maybe a letter, or maybe a whole set of title-deeds. They say Dolly Longstaffe has found it all out. There was always more about Dolly than fellows gave him credit for. At any rate, everybody says that Melmotte will be arrested before long.\"\n\"Not tonight, Damask!\"\n\"Nobody seems to know. Lupton was saying that the policemen would wait till the Emperor and the Princes had gone away.\"\n\"Is Mr. Lupton going?\"\n\"He hadn't made up his mind when I saw him. Nobody seems to be quite certain whether the Emperor will go. Somebody said that a Cabinet Council was to be called. It's rather an awkward thing, letting the Prince go to dine with a man who may be arrested before dinner-time. That's the worst part of it. Nobody knows.\"\nLady Monogram waved her maid away. She piqued herself upon having a French maid who could not speak a word of English, and was therefore quite careless in the woman's presence. But, of course, everything she said was repeated downstairs. Lady Monogram sat motionless for some time, while her husband finished dressing for dinner.\n\"Damask,\" she said, \"we can't go.\"\n\"After you've made such a fuss about it!\"\n\"It is a pity, having that girl here in the house. You know she's going to marry one of these people?\"\n\"But Brehgert isn't one of Melmotte's set. They tell me that Brehgert isn't a bad fellow. A vulgar cad, and all that, but nothing wrong about him.\"\n\"He's a Jew, and he's seventy.\"\n\"What does it matter to you if he's eighty? You are determined, then, you won't go?\"\nBut Lady Monogram had by no means decided. She had paid her price, and she could not bear to lose the thing that she had bought. She cared nothing for Melmotte's villainy: she had taken it for granted since she had first heard of him, and had only a confused idea of any difference between commerce and fraud. It would grieve her greatly to become known as one who had driven to the door, and had not, after all, met the Emperor and the Prince. But then, should she hear the next morning that the Emperor and the Princes and Princesses, and the world generally, had all been there when she had not - then her grief would be still greater.\nShe sat down to dinner with her husband and Miss Longestaffe, and could not talk freely on the matter. Miss Longestaffe was still a guest of the Melmottes, although she was visiting the Monograms for a day or two.\n\"I suppose you'll go,\" said Sir Damask as the ladies left the room.\n\"Of course we shall - in about an hour,\" said Lady Monogram, looking at him in rebuke him for his imprudence.\n\"Because if you want me I'll stay, of course; but if you don't, I'll go down to the club.\"\nThen Miss Longestaffe asked, \"Is there any doubt about our going tonight?\"\n\"There seems to be a report that the Emperor won't be there.\"\n\"Impossible!\"\n\"It's all very well to say impossible, my dear,\" said Lady Monogram; \"but that's what people are saying. You see Mr. Melmotte is a very great man, but perhaps - something has turned up. Things of that kind do happen. You had better finish dressing. But I shan't make sure of going till I hear that the Emperor is there.\" Then she descended to her husband. \"Damask,\" she said, \"you must find out whether the Prince and the Emperor are there.\"\n\"Send John to ask,\" suggested the husband.\n\"If you'd go yourself you'd learn the truth in a minute. Take a cab.\"\nSir Damask did not like the job. \"Go to a man's house and find out whether a man's guests are come! I just don't see it, Ju.\"\n\"If you don't go, Damask, I must; and I will.\"\nSir Damask, after groaning and smoking for half a minute, said that he would go, though it was a confounded bore. He hated emperors and princes. But at last he submitted, and the cab was sent for.\nIt was past ten when he left his own house. On arriving in Grosvenor Square he could at once see that the party was going on. The house was illuminated, and half the square was already blocked up with carriages. When he got to the door, he saw the royal liveries. There was no doubt. The Emperor and the Princes and the Princesses were all there. But it was nearly eleven before he could reach home.\n\"It's all right,\" said he to his wife. \"They're there, safe enough.\"\n\"You are sure that the Emperor is there?\"\n\"As sure as a man can be without having seen him.\"\nMiss Longestaffe was present, and resented the slur cast upon her friends.\n\"I don't understand it at all,\" she said. \"Of course the Emperor is there. Everybody has known for the last month that he was coming. What is the meaning of it, Julia?\"\n\"My dear, you must allow me to manage my own little affairs my own way. I dare say I am absurd. But I have my reason. Now, Damask, if the carriage is there we had better start.\" The carriage was there, and they did start. When they reached the house, there was a great crush in the hall. But at last they made their way into the room above, and found that the Emperor of China and all the Royalties had been there - and had departed.\nSir Damask put the ladies into the carriage and went at once to his club.",
        "paragraph_chars": [
            [
                0,
                430
            ],
            [
                430,
                821
            ],
            [
                821,
                968
            ],
            [
                968,
                1070
            ],
            [
                1070,
                1084
            ],
            [
                1084,
                1122
            ],
            [
                1122,
                1180
            ],
            [
                1180,
                1299
            ],
            [
                1299,
                1408
            ],
            [
                1408,
                1528
            ],
            [
                1528,
                1577
            ],
            [
                1577,
                1896
            ],
            [
                1896,
                1919
            ],
            [
                1919,
                2039
            ],
            [
                2039,
                2062
            ],
            [
                2062,
                2378
            ],
            [
                2378,
                2708
            ],
            [
                2708,
                2743
            ],
            [
                2743,
                2785
            ],
            [
                2785,
                2888
            ],
            [
                2888,
                3036
            ],
            [
                3036,
                3068
            ],
            [
                3068,
                3153
            ],
            [
                3153,
                3792
            ],
            [
                3792,
                4006
            ],
            [
                4006,
                4074
            ],
            [
                4074,
                4184
            ],
            [
                4184,
                4275
            ],
            [
                4275,
                4350
            ],
            [
                4350,
                4412
            ],
            [
                4412,
                4426
            ],
            [
                4426,
                4868
            ],
            [
                4868,
                4911
            ],
            [
                4911,
                4981
            ],
            [
                4981,
                5107
            ],
            [
                5107,
                5154
            ],
            [
                5154,
                5351
            ],
            [
                5351,
                5751
            ],
            [
                5751,
                5820
            ],
            [
                5820,
                5862
            ],
            [
                5862,
                5913
            ],
            [
                5913,
                5988
            ],
            [
                5988,
                6157
            ],
            [
                6157,
                6591
            ],
            [
                6591,
                6664
            ]
        ],
        "segment_chars": [
            [
                0,
                174
            ],
            [
                174,
                203
            ],
            [
                203,
                275
            ],
            [
                275,
                314
            ],
            [
                314,
                430
            ],
            [
                430,
                550
            ],
            [
                550,
                623
            ],
            [
                623,
                672
            ],
            [
                672,
                718
            ],
            [
                718,
                796
            ],
            [
                796,
                821
            ],
            [
                821,
                940
            ],
            [
                940,
                968
            ],
            [
                968,
                1000
            ],
            [
                1000,
                1070
            ],
            [
                1070,
                1084
            ],
            [
                1084,
                1122
            ],
            [
                1122,
                1135
            ],
            [
                1135,
                1160
            ],
            [
                1160,
                1180
            ],
            [
                1180,
                1203
            ],
            [
                1203,
                1235
            ],
            [
                1235,
                1299
            ],
            [
                1299,
                1337
            ],
            [
                1337,
                1408
            ],
            [
                1408,
                1430
            ],
            [
                1430,
                1528
            ],
            [
                1528,
                1577
            ],
            [
                1577,
                1606
            ],
            [
                1606,
                1707
            ],
            [
                1707,
                1755
            ],
            [
                1755,
                1823
            ],
            [
                1823,
                1896
            ],
            [
                1896,
                1919
            ],
            [
                1919,
                1942
            ],
            [
                1942,
                2039
            ],
            [
                2039,
                2062
            ],
            [
                2062,
                2106
            ],
            [
                2106,
                2168
            ],
            [
                2168,
                2223
            ],
            [
                2223,
                2334
            ],
            [
                2334,
                2363
            ],
            [
                2363,
                2378
            ],
            [
                2378,
                2413
            ],
            [
                2413,
                2555
            ],
            [
                2555,
                2616
            ],
            [
                2616,
                2708
            ],
            [
                2708,
                2743
            ],
            [
                2743,
                2785
            ],
            [
                2785,
                2836
            ],
            [
                2836,
                2888
            ],
            [
                2888,
                2931
            ],
            [
                2931,
                2978
            ],
            [
                2978,
                3036
            ],
            [
                3036,
                3068
            ],
            [
                3068,
                3112
            ],
            [
                3112,
                3153
            ],
            [
                3153,
                3196
            ],
            [
                3196,
                3282
            ],
            [
                3282,
                3463
            ],
            [
                3463,
                3598
            ],
            [
                3598,
                3792
            ],
            [
                3792,
                3895
            ],
            [
                3895,
                4006
            ],
            [
                4006,
                4074
            ],
            [
                4074,
                4184
            ],
            [
                4184,
                4275
            ],
            [
                4275,
                4350
            ],
            [
                4350,
                4412
            ],
            [
                4412,
                4426
            ],
            [
                4426,
                4531
            ],
            [
                4531,
                4612
            ],
            [
                4612,
                4643
            ],
            [
                4643,
                4675
            ],
            [
                4675,
                4747
            ],
            [
                4747,
                4782
            ],
            [
                4782,
                4868
            ],
            [
                4868,
                4911
            ],
            [
                4911,
                4968
            ],
            [
                4968,
                4981
            ],
            [
                4981,
                5014
            ],
            [
                5014,
                5081
            ],
            [
                5081,
                5107
            ],
            [
                5107,
                5154
            ],
            [
                5154,
                5268
            ],
            [
                5268,
                5299
            ],
            [
                5299,
                5351
            ],
            [
                5351,
                5395
            ],
            [
                5395,
                5477
            ],
            [
                5477,
                5563
            ],
            [
                5563,
                5615
            ],
            [
                5615,
                5635
            ],
            [
                5635,
                5698
            ],
            [
                5698,
                5751
            ],
            [
                5751,
                5790
            ],
            [
                5790,
                5820
            ],
            [
                5820,
                5862
            ],
            [
                5862,
                5913
            ],
            [
                5913,
                5988
            ],
            [
                5988,
                6030
            ],
            [
                6030,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6157
            ],
            [
                6157,
                6229
            ],
            [
                6229,
                6253
            ],
            [
                6253,
                6275
            ],
            [
                6275,
                6335
            ],
            [
                6335,
                6379
            ],
            [
                6379,
                6445
            ],
            [
                6445,
                6591
            ],
            [
                6591,
                6664
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                10,
                83
            ],
            [
                83,
                174
            ],
            [
                174,
                190
            ],
            [
                191,
                203
            ],
            [
                203,
                275
            ],
            [
                275,
                314
            ],
            [
                314,
                429
            ],
            [
                430,
                433
            ],
            [
                444,
                460
            ],
            [
                468,
                550
            ],
            [
                550,
                564
            ],
            [
                565,
                571
            ],
            [
                572,
                623
            ],
            [
                623,
                672
            ],
            [
                672,
                718
            ],
            [
                718,
                743
            ],
            [
                750,
                771
            ],
            [
                772,
                775
            ],
            [
                776,
                794
            ],
            [
                794,
                796
            ],
            [
                796,
                819
            ],
            [
                819,
                821
            ],
            [
                821,
                891
            ],
            [
                891,
                892
            ],
            [
                896,
                898
            ],
            [
                899,
                902
            ],
            [
                903,
                918
            ],
            [
                919,
                929
            ],
            [
                930,
                938
            ],
            [
                938,
                940
            ],
            [
                940,
                943
            ],
            [
                947,
                967
            ],
            [
                968,
                999
            ],
            [
                1000,
                1007
            ],
            [
                1013,
                1025
            ],
            [
                1025,
                1070
            ],
            [
                1070,
                1084
            ],
            [
                1084,
                1122
            ],
            [
                1122,
                1135
            ],
            [
                1135,
                1158
            ],
            [
                1158,
                1160
            ],
            [
                1160,
                1177
            ],
            [
                1177,
                1180
            ],
            [
                1180,
                1203
            ],
            [
                1203,
                1235
            ],
            [
                1235,
                1276
            ],
            [
                1281,
                1299
            ],
            [
                1299,
                1337
            ],
            [
                1337,
                1408
            ],
            [
                1408,
                1430
            ],
            [
                1430,
                1453
            ],
            [
                1459,
                1528
            ],
            [
                1528,
                1545
            ],
            [
                1548,
                1577
            ],
            [
                1577,
                1606
            ],
            [
                1606,
                1650
            ],
            [
                1660,
                1668
            ],
            [
                1679,
                1707
            ],
            [
                1707,
                1715
            ],
            [
                1716,
                1721
            ],
            [
                1728,
                1732
            ],
            [
                1733,
                1755
            ],
            [
                1755,
                1771
            ],
            [
                1772,
                1776
            ],
            [
                1777,
                1788
            ],
            [
                1789,
                1823
            ],
            [
                1823,
                1872
            ],
            [
                1882,
                1896
            ],
            [
                1896,
                1900
            ],
            [
                1908,
                1919
            ],
            [
                1919,
                1942
            ],
            [
                1942,
                1989
            ],
            [
                1990,
                2039
            ],
            [
                2039,
                2062
            ],
            [
                2062,
                2065
            ],
            [
                2066,
                2089
            ],
            [
                2090,
                2106
            ],
            [
                2106,
                2168
            ],
            [
                2168,
                2221
            ],
            [
                2223,
                2297
            ],
            [
                2298,
                2301
            ],
            [
                2305,
                2313
            ],
            [
                2314,
                2334
            ],
            [
                2334,
                2363
            ],
            [
                2363,
                2378
            ],
            [
                2378,
                2401
            ],
            [
                2407,
                2413
            ],
            [
                2413,
                2529
            ],
            [
                2530,
                2555
            ],
            [
                2555,
                2585
            ],
            [
                2591,
                2603
            ],
            [
                2614,
                2616
            ],
            [
                2616,
                2677
            ],
            [
                2678,
                2686
            ],
            [
                2706,
                2707
            ],
            [
                2708,
                2727
            ],
            [
                2728,
                2729
            ],
            [
                2729,
                2743
            ],
            [
                2743,
                2785
            ],
            [
                2785,
                2799
            ],
            [
                2800,
                2836
            ],
            [
                2836,
                2844
            ],
            [
                2845,
                2888
            ],
            [
                2889,
                2931
            ],
            [
                2931,
                2978
            ],
            [
                2978,
                3036
            ],
            [
                3036,
                3048
            ],
            [
                3049,
                3065
            ],
            [
                3065,
                3068
            ],
            [
                3068,
                3112
            ],
            [
                3112,
                3153
            ],
            [
                3153,
                3186
            ],
            [
                3194,
                3196
            ],
            [
                3196,
                3223
            ],
            [
                3224,
                3282
            ],
            [
                3282,
                3323
            ],
            [
                3325,
                3338
            ],
            [
                3342,
                3386
            ],
            [
                3386,
                3387
            ],
            [
                3392,
                3395
            ],
            [
                3401,
                3463
            ],
            [
                3463,
                3513
            ],
            [
                3514,
                3545
            ],
            [
                3550,
                3565
            ],
            [
                3566,
                3598
            ],
            [
                3598,
                3623
            ],
            [
                3624,
                3673
            ],
            [
                3674,
                3677
            ],
            [
                3678,
                3697
            ],
            [
                3698,
                3733
            ],
            [
                3743,
                3746
            ],
            [
                3753,
                3757
            ],
            [
                3758,
                3767
            ],
            [
                3768,
                3773
            ],
            [
                3774,
                3791
            ],
            [
                3792,
                3895
            ],
            [
                3895,
                3960
            ],
            [
                3974,
                4005
            ],
            [
                4006,
                4074
            ],
            [
                4074,
                4093
            ],
            [
                4096,
                4133
            ],
            [
                4133,
                4142
            ],
            [
                4143,
                4149
            ],
            [
                4160,
                4184
            ],
            [
                4184,
                4185
            ],
            [
                4193,
                4275
            ],
            [
                4275,
                4302
            ],
            [
                4304,
                4339
            ],
            [
                4347,
                4350
            ],
            [
                4351,
                4412
            ],
            [
                4412,
                4426
            ],
            [
                4426,
                4499
            ],
            [
                4500,
                4531
            ],
            [
                4531,
                4584
            ],
            [
                4587,
                4596
            ],
            [
                4597,
                4610
            ],
            [
                4610,
                4612
            ],
            [
                4612,
                4643
            ],
            [
                4643,
                4675
            ],
            [
                4675,
                4747
            ],
            [
                4747,
                4780
            ],
            [
                4780,
                4782
            ],
            [
                4782,
                4820
            ],
            [
                4821,
                4868
            ],
            [
                4868,
                4911
            ],
            [
                4912,
                4968
            ],
            [
                4973,
                4978
            ],
            [
                4978,
                4980
            ],
            [
                4981,
                4991
            ],
            [
                4992,
                5014
            ],
            [
                5014,
                5079
            ],
            [
                5079,
                5081
            ],
            [
                5081,
                5082
            ],
            [
                5083,
                5087
            ],
            [
                5088,
                5093
            ],
            [
                5094,
                5107
            ],
            [
                5108,
                5153
            ],
            [
                5154,
                5233
            ],
            [
                5242,
                5268
            ],
            [
                5268,
                5289
            ],
            [
                5290,
                5299
            ],
            [
                5299,
                5328
            ],
            [
                5329,
                5349
            ],
            [
                5349,
                5351
            ],
            [
                5351,
                5395
            ],
            [
                5395,
                5477
            ],
            [
                5477,
                5502
            ],
            [
                5502,
                5563
            ],
            [
                5563,
                5567
            ],
            [
                5568,
                5587
            ],
            [
                5588,
                5615
            ],
            [
                5615,
                5633
            ],
            [
                5633,
                5635
            ],
            [
                5635,
                5698
            ],
            [
                5698,
                5701
            ],
            [
                5702,
                5750
            ],
            [
                5751,
                5790
            ],
            [
                5790,
                5820
            ],
            [
                5820,
                5859
            ],
            [
                5862,
                5913
            ],
            [
                5913,
                5941
            ],
            [
                5941,
                5946
            ],
            [
                5960,
                5987
            ],
            [
                5988,
                6030
            ],
            [
                6030,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6157
            ],
            [
                6157,
                6229
            ],
            [
                6229,
                6253
            ],
            [
                6253,
                6275
            ],
            [
                6275,
                6335
            ],
            [
                6335,
                6377
            ],
            [
                6377,
                6379
            ],
            [
                6406,
                6407
            ],
            [
                6408,
                6443
            ],
            [
                6443,
                6445
            ],
            [
                6445,
                6570
            ],
            [
                6577,
                6580
            ],
            [
                6589,
                6591
            ],
            [
                6591,
                6664
            ]
        ],
        "row_chars": [
            [
                0,
                174
            ],
            [
                174,
                174
            ],
            [
                174,
                174
            ],
            [
                174,
                203
            ],
            [
                203,
                203
            ],
            [
                203,
                275
            ],
            [
                275,
                314
            ],
            [
                314,
                430
            ],
            [
                430,
                430
            ],
            [
                430,
                550
            ],
            [
                550,
                623
            ],
            [
                623,
                672
            ],
            [
                672,
                718
            ],
            [
                718,
                796
            ],
            [
                796,
                821
            ],
            [
                821,
                940
            ],
            [
                940,
                1070
            ],
            [
                1070,
                1070
            ],
            [
                1070,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1084
            ],
            [
                1084,
                1122
            ],
            [
                1122,
                1135
            ],
            [
                1135,
                1160
            ],
            [
                1160,
                1180
            ],
            [
                1180,
                1203
            ],
            [
                1203,
                1235
            ],
            [
                1235,
                1299
            ],
            [
                1299,
                1337
            ],
            [
                1337,
                1408
            ],
            [
                1408,
                1430
            ],
            [
                1430,
                1528
            ],
            [
                1528,
                1577
            ],
            [
                1577,
                1606
            ],
            [
                1606,
                1707
            ],
            [
                1707,
                1755
            ],
            [
                1755,
                1823
            ],
            [
                1823,
                1896
            ],
            [
                1896,
                1919
            ],
            [
                1919,
                1942
            ],
            [
                1942,
                2039
            ],
            [
                2039,
                2062
            ],
            [
                2062,
                2106
            ],
            [
                2106,
                2168
            ],
            [
                2168,
                2223
            ],
            [
                2223,
                2223
            ],
            [
                2223,
                2334
            ],
            [
                2334,
                2363
            ],
            [
                2363,
                2378
            ],
            [
                2378,
                2413
            ],
            [
                2413,
                2555
            ],
            [
                2555,
                2616
            ],
            [
                2616,
                2708
            ],
            [
                2708,
                2743
            ],
            [
                2743,
                2785
            ],
            [
                2785,
                2836
            ],
            [
                2836,
                2888
            ],
            [
                2888,
                2888
            ],
            [
                2888,
                2931
            ],
            [
                2931,
                2978
            ],
            [
                2978,
                3036
            ],
            [
                3036,
                3068
            ],
            [
                3068,
                3112
            ],
            [
                3112,
                3153
            ],
            [
                3153,
                3196
            ],
            [
                3196,
                3282
            ],
            [
                3282,
                3463
            ],
            [
                3463,
                3598
            ],
            [
                3598,
                3792
            ],
            [
                3792,
                3895
            ],
            [
                3895,
                4006
            ],
            [
                4006,
                4006
            ],
            [
                4006,
                4006
            ],
            [
                4006,
                4006
            ],
            [
                4006,
                4074
            ],
            [
                4074,
                4184
            ],
            [
                4184,
                4184
            ],
            [
                4184,
                4275
            ],
            [
                4275,
                4275
            ],
            [
                4275,
                4275
            ],
            [
                4275,
                4275
            ],
            [
                4275,
                4350
            ],
            [
                4350,
                4350
            ],
            [
                4350,
                4350
            ],
            [
                4350,
                4412
            ],
            [
                4412,
                4426
            ],
            [
                4426,
                4531
            ],
            [
                4531,
                4612
            ],
            [
                4612,
                4643
            ],
            [
                4643,
                4675
            ],
            [
                4675,
                4675
            ],
            [
                4675,
                4747
            ],
            [
                4747,
                4782
            ],
            [
                4782,
                4868
            ],
            [
                4868,
                4911
            ],
            [
                4911,
                4911
            ],
            [
                4911,
                4968
            ],
            [
                4968,
                4981
            ],
            [
                4981,
                5014
            ],
            [
                5014,
                5014
            ],
            [
                5014,
                5014
            ],
            [
                5014,
                5081
            ],
            [
                5081,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5154
            ],
            [
                5154,
                5268
            ],
            [
                5268,
                5299
            ],
            [
                5299,
                5299
            ],
            [
                5299,
                5299
            ],
            [
                5299,
                5351
            ],
            [
                5351,
                5395
            ],
            [
                5395,
                5477
            ],
            [
                5477,
                5563
            ],
            [
                5563,
                5615
            ],
            [
                5615,
                5635
            ],
            [
                5635,
                5698
            ],
            [
                5698,
                5698
            ],
            [
                5698,
                5751
            ],
            [
                5751,
                5790
            ],
            [
                5790,
                5820
            ],
            [
                5820,
                5862
            ],
            [
                5862,
                5913
            ],
            [
                5913,
                5988
            ],
            [
                5988,
                6030
            ],
            [
                6030,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6157
            ],
            [
                6157,
                6229
            ],
            [
                6229,
                6253
            ],
            [
                6253,
                6275
            ],
            [
                6275,
                6335
            ],
            [
                6335,
                6379
            ],
            [
                6379,
                6445
            ],
            [
                6445,
                6591
            ],
            [
                6591,
                6664
            ]
        ]
    }
}