{
    "original": {
        "text": "No election of a Member of Parliament by ballot in a borough so large as that of Westminster had as yet been achieved in England since the ballot had been established by law. Men who heretofore had known, or thought that they knew, how elections would go, who counted up promises, told off professed enemies, and weighed the doubtful ones, now confessed themselves to be in the dark. Three days since the odds had been considerably in Melmotte's favour; but this had come from the reputation attached to his name, rather than from any calculation as to the politics of the voters. Then Sunday had intervened. On the Monday Melmotte's name had continued to go down in the betting from morning to evening. Early in the day his supporters had thought little of this, attributing the fall to that vacillation which is customary in such matters; but towards the latter part of the afternoon the tidings from the City had been in everybody's mouth, and Melmotte's committee-room had been almost deserted. At six o'clock there were some who suggested that his name should be withdrawn. No such suggestion, however, was made to him,--perhaps because no one dared to make it. On the Monday evening all work and strategy for the election, as regarded Melmotte and his party, died away; and the interest of the hour was turned to the dinner.\nBut Mr. Alf's supporters were very busy. There had been a close consultation among a few of them as to what should be done by their Committee as to these charges against the opposite candidate. In the \"Pulpit\" of that evening an allusion had been made to the affair, which was of course sufficiently intelligible to those who were immediately concerned in the matter, but which had given no name and mentioned no details. Mr. Alf explained that this had been put in by the sub-editor, and that it only afforded such news as the paper was bound to give to the public. He himself pointed out the fact that no note of triumph had been sounded, and that the rumour had not been connected with the election.\nOne old gentleman was of opinion that they were bound to make the most of it. \"It's no more than we've all believed all along,\" said the old gentleman, \"and why are we to let a fellow like that get the seat if we can keep him out?\" He was of opinion that everything should be done to make the rumour with all its exaggerations as public as possible,--so that there should be no opening for an indictment for libel; and the clever old gentleman was full of devices by which this might be effected. But the Committee generally was averse to fight in this manner. Public opinion has its Bar as well as the Law Courts. If, after all, Melmotte had committed no fraud,--or, as was much more probable, should not be convicted of fraud,--then it would be said that the accusation had been forged for purely electioneering purposes, and there might be a rebound which would pretty well crush all those who had been concerned. Individual gentlemen could, of course, say what they pleased to individual voters; but it was agreed at last that no overt use should be made of the rumours by Mr. Alf's Committee. In regard to other matters, they who worked under the Committee were busy enough. The dinner to the Emperor was turned into ridicule, and the electors were asked whether they felt themselves bound to return a gentleman out of the City to Parliament because he had offered to spend a fortune on entertaining all the royalties then assembled in London. There was very much said on placards and published in newspapers to the discredit of Melmotte, but nothing was so printed which would not have appeared with equal venom had the recent rumours never been sent out from the City. At twelve o'clock at night, when Mr. Alf's committee-room was being closed, and when Melmotte was walking home to bed, the general opinion at the clubs was very much in favour of Mr. Alf.\nOn the next morning Melmotte was up before eight. As yet no policeman had called for him, nor had any official intimation reached him that an accusation was to be brought against him. On coming down from his bedroom he at once went into the back-parlour on the ground floor, which Mr. Longestaffe called his study, and which Mr. Melmotte had used since he had been in Mr. Longestaffe's house for the work which he did at home. He would be there often early in the morning, and often late at night after Lord Alfred had left him. There were two heavy desk-tables in the room, furnished with drawers down to the ground. One of these the owner of the house had kept locked for his own purposes. When the bargain for the temporary letting of the house had been made, Mr. Melmotte and Mr. Longestaffe were close friends. Terms for the purchase of Pickering had just been made, and no cause for suspicion had as yet arisen. Everything between the two gentlemen had been managed with the greatest ease. Oh dear, yes! Mr. Longestaffe could come whenever he pleased. He, Melmotte, always left the house at ten and never returned till six. The ladies would never enter that room. The servants were to regard Mr. Longestaffe quite as master of the house as far as that room was concerned. If Mr. Longestaffe could spare it, Mr. Melmotte would take the key of one of the tables. The matter was arranged very pleasantly.\nMr. Melmotte, on entering the room bolted the door, and then, sitting at his own table, took certain papers out of the drawers,--a bundle of letters and another of small documents. From these, with very little examination, he took three or four,--two or three perhaps from each. These he tore into very small fragments and burned the bits,--holding them over a gas-burner and letting the ashes fall into a large china plate. Then he blew the ashes into the yard through the open window. This he did to all these documents but one. This one he put bit by bit into his mouth, chewing the paper into a pulp till he swallowed it. When he had done this, and had re-locked his own drawers, he walked across to the other table, Mr. Longestaffe's table, and pulled the handle of one of the drawers. It opened;--and then, without touching the contents, he again closed it. He then knelt down and examined the lock, and the hole above into which the bolt of the lock ran. Having done this he again closed the drawer, drew back the bolt of the door, and, seating himself at his own desk, rang the bell which was close to hand. The servant found him writing letters after his usual hurried fashion, and was told that he was ready for breakfast. He always breakfasted alone with a heap of newspapers around him, and so he did on this day. He soon found the paragraph alluding to himself in the \"Pulpit,\" and read it without a quiver in his face or the slightest change in his colour. There was no one to see him now,--but he was acting under a resolve that at no moment, either when alone, or in a crowd, or when suddenly called upon for words,--not even when the policemen with their first hints of arrest should come upon him,--would he betray himself by the working of a single muscle, or the loss of a drop of blood from his heart. He would go through it, always armed, without a sign of shrinking. It had to be done, and he would do it.\nAt ten he walked down to the central committee-room at Whitehall Place. He thought that he would face the world better by walking than if he were taken in his own brougham. He gave orders that the carriage should be at the committee-room at eleven, and wait an hour for him if he was not there. He went along Bond Street and Piccadilly, Regent Street and through Pall Mall to Charing Cross, with the blandly triumphant smile of a man who had successfully entertained the great guest of the day. As he got near the club he met two or three men whom he knew, and bowed to them. They returned his bow graciously enough, but not one of them stopped to speak to him. Of one he knew that he would have stopped, had it not been for the rumour. Even after the man had passed on he was careful to show no displeasure on his face. He would take it all as it would come and still be the blandly triumphant Merchant Prince,--as long as the police would allow him. He probably was not aware how very different was the part he was now playing from that which he had assumed at the India Office.\nAt the committee-room he only found a few understrappers, and was informed that everything was going on regularly. The electors were balloting; but with the ballot,--so said the leader of the understrappers,--there never was any excitement. The men looked half-frightened,--as though they did not quite know whether they ought to seize their candidate, and hold him till the constable came. They certainly had not expected to see him there. \"Has Lord Alfred been here?\" Melmotte asked, standing in the inner room with his back to the empty grate. No,--Lord Alfred had not been there. \"Nor Mr. Grendall?\" The senior understrapper knew that Melmotte would have asked for \"his Secretary,\" and not for Mr. Grendall, but for the rumours. It is so hard not to tumble into Scylla when you are avoiding Charybdis. Mr. Grendall had not been there. Indeed, nobody had been there. \"In fact, there is nothing more to be done, I suppose?\" said Mr. Melmotte. The senior understrapper thought that there was nothing more to be done. He left word that his brougham should be sent away, and strolled out again on foot.\nHe went up into Covent Garden, where there was a polling booth. The place seemed to him, as one of the chief centres for a contested election, to be wonderfully quiet. He was determined to face everybody and everything, and he went close up to the booth. Here he was recognised by various men, mechanics chiefly, who came forward and shook hands with him. He remained there for an hour conversing with people, and at last made a speech to a little knot around him. He did not allude to the rumour of yesterday, nor to the paragraph in the \"Pulpit\" to which his name had not been attached; but he spoke freely enough of the general accusations that had been brought against him previously. He wished the electors to understand that nothing which had been said against him made him ashamed to meet them here or elsewhere. He was proud of his position, and proud that the electors of Westminster should recognise it. He did not, he was glad to say, know much of the law, but he was told that the law would protect him from such aspersions as had been unfairly thrown upon him. He flattered himself that he was too good an Englishman to regard the ordinary political attacks to which candidates were, as a matter of course, subject at elections;--and he could stretch his back to bear perhaps a little more than these, particularly as he looked forward to a triumphant return. But things had been said, and published, which the excitement of an election could not justify, and as to these things he must have recourse to the law. Then he made some allusion to the Princes and the Emperor, and concluded by observing that it was the proudest boast of his life to be an Englishman and a Londoner.\nIt was asserted afterwards that this was the only good speech he had ever been known to make; and it was certainly successful, as he was applauded throughout Covent Garden. A reporter for the \"Breakfast Table\" who was on duty at the place, looking for paragraphs as to the conduct of electors, gave an account of the speech in that paper, and made more of it, perhaps, than it deserved. It was asserted afterwards, and given as a great proof of Melmotte's cleverness, that he had planned the thing and gone to Covent Garden all alone having considered that in that way could he best regain a step in reputation; but in truth the affair had not been preconcerted. It was while in Whitehall Place that he had first thought of going to Covent Garden, and he had had no idea of making a speech till the people had gathered round him.\nIt was then noon, and he had to determine what he should do next. He was half inclined to go round to all the booths and make speeches. His success at Covent Garden had been very pleasant to him. But he feared that he might not be so successful elsewhere. He had shown that he was not afraid of the electors. Then an idea struck him that he would go boldly into the City,--to his own offices in Abchurch Lane. He had determined to be absent on this day, and would not be expected. But his appearance there could not on that account be taken amiss. Whatever enmities there might be, or whatever perils, he would face them. He got a cab therefore and had himself driven to Abchurch Lane.\nThe clerks were hanging about doing nothing, as though it were a holiday. The dinner, the election, and the rumour together had altogether demoralized them. But some of them at least were there, and they showed no signs of absolute insubordination. \"Mr. Grendall has not been here?\" he asked. No; Mr. Grendall had not been there; but Mr. Cohenlupe was in Mr. Grendall's room. At this moment he hardly desired to see Mr. Cohenlupe. That gentleman was privy to many of his transactions, but was by no means privy to them all. Mr. Cohenlupe knew that the estate at Pickering had been purchased, and knew that it had been mortgaged. He knew also what had become of the money which had so been raised. But he knew nothing of the circumstances of the purchase, although he probably surmised that Melmotte had succeeded in getting the title-deeds on credit, without paying the money. He was afraid that he could hardly see Cohenlupe and hold his tongue, and that he could not speak to him without danger. He and Cohenlupe might have to stand in a dock together; and Cohenlupe had none of his spirit. But the clerks would think, and would talk, were he to leave the office without seeing his old friend. He went therefore into his own room, and called to Cohenlupe as he did so.\n\"Ve didn't expect you here to-day,\" said the member for Staines.\n\"Nor did I expect to come. But there isn't much to do at Westminster while the ballot is going on; so I came up, just to look at the letters. The dinner went off pretty well yesterday, eh?\"\n\"Uncommon;--nothing better. Vy did the Lord Mayor stay away, Melmotte?\"\n\"Because he's an ass and a cur,\" said Mr. Melmotte with an assumed air of indignation. \"Alf and his people had got hold of him. There was ever so much fuss about it at first,--whether he would accept the invitation. I say it was an insult to the City to take it and not to come. I shall be even with him some of these days.\"\n\"Things will go on just the same as usual, Melmotte?\"\n\"Go on. Of course they'll go. What's to hinder them?\"\n\"There's ever so much been said,\" whispered Cohenlupe.\n\"Said;--yes,\" ejaculated Melmotte very loudly. \"You're not such a fool, I hope, as to believe every word you hear. You'll have enough to believe, if you do.\"\n\"There's no knowing vat anybody does know, and vat anybody does not know,\" said Cohenlupe.\n\"Look you here, Cohenlupe,\"--and now Melmotte also sank his voice to a whisper,--\"keep your tongue in your mouth; go about just as usual, and say nothing. It's all right. There has been some heavy pulls upon us.\"\n\"Oh dear, there has indeed!\"\n\"But any paper with my name to it will come right.\"\n\"That's nothing;--nothing at all,\" said Cohenlupe.\n\"And there is nothing;--nothing at all! I've bought some property and have paid for it; and I have bought some, and have not yet paid for it. There's no fraud in that.\"\n\"No, no,--nothing in that.\"\n\"You hold your tongue, and go about your business. I'm going to the bank now.\" Cohenlupe had been very low in spirits, and was still low in spirits; but he was somewhat better after the visit of the great man to the City.\nMr. Melmotte was as good as his word and walked straight to the bank. He kept two accounts at different banks, one for his business, and one for his private affairs. The one he now entered was that which kept what we may call his domestic account. He walked straight through, after his old fashion, to the room behind the bank in which sat the manager and the manager's one clerk, and stood upon the rug before the fire-place just as though nothing had happened,--or as nearly as though nothing had happened as was within the compass of his powers. He could not quite do it. In keeping up an appearance intended to be natural he was obliged to be somewhat milder than his wont. The manager did not behave nearly as well as he did, and the clerks manifestly betrayed their emotion. Melmotte saw that it was so;--but he had expected it, and had come there on purpose to \"put it down.\"\n\"We hardly expected to see you in the City to-day, Mr. Melmotte.\"\n\"And I didn't expect to see myself here. But it always happens that when one expects that there's most to be done, there's nothing to be done at all. They're all at work down at Westminster, balloting; but as I can't go on voting for myself, I'm of no use. I've been at Covent Garden this morning, making a stump speech, and if all that they say there is true, I haven't much to be afraid of.\"\n\"And the dinner went off pretty well?\" asked the manager.\n\"Very well, indeed. They say the Emperor liked it better than anything that has been done for him yet.\" This was a brilliant flash of imagination. \"For a friend to dine with me every day, you know, I should prefer somebody who had a little more to say for himself. But then, perhaps, you know, if you or I were in China we shouldn't have much to say for ourselves;--eh?\" The manager acceded to this proposition. \"We had one awful disappointment. His lordship from over the way didn't come.\"\n\"The Lord Mayor, you mean.\"\n\"The Lord Mayor didn't come! He was frightened at the last moment;--took it into his head that his authority in the City was somehow compromised. But the wonder was that the dinner went on without him.\" Then Melmotte referred to the purport of his call there that day. He would have to draw large cheques for his private wants. \"You don't give a dinner to an Emperor of China for nothing, you know.\" He had been in the habit of over-drawing on his private account,--making arrangements with the manager. But now, in the manager's presence, he drew a regular cheque on his business account for a large sum, and then, as a sort of afterthought, paid in the 250 which he had received from Mr. Broune on account of the money which Sir Felix had taken from Marie.\n\"There don't seem much the matter with him,\" said the manager, when Melmotte had left the room.\n\"He brazens it out, don't he?\" said the senior clerk. But the feeling of the room after full discussion inclined to the opinion that the rumours had been a political manoeuvre. Nevertheless, Mr. Melmotte would not now have been allowed to overdraw at the present moment.",
        "paragraph_chars": [
            [
                0,
                1331
            ],
            [
                1331,
                2034
            ],
            [
                2034,
                3898
            ],
            [
                3898,
                5306
            ],
            [
                5306,
                7235
            ],
            [
                7235,
                8316
            ],
            [
                8316,
                9418
            ],
            [
                9418,
                11109
            ],
            [
                11109,
                11939
            ],
            [
                11939,
                12625
            ],
            [
                12625,
                13896
            ],
            [
                13896,
                13961
            ],
            [
                13961,
                14151
            ],
            [
                14151,
                14223
            ],
            [
                14223,
                14548
            ],
            [
                14548,
                14602
            ],
            [
                14602,
                14656
            ],
            [
                14656,
                14711
            ],
            [
                14711,
                14869
            ],
            [
                14869,
                14960
            ],
            [
                14960,
                15173
            ],
            [
                15173,
                15202
            ],
            [
                15202,
                15254
            ],
            [
                15254,
                15305
            ],
            [
                15305,
                15474
            ],
            [
                15474,
                15502
            ],
            [
                15502,
                15724
            ],
            [
                15724,
                16607
            ],
            [
                16607,
                16673
            ],
            [
                16673,
                17067
            ],
            [
                17067,
                17125
            ],
            [
                17125,
                17616
            ],
            [
                17616,
                17644
            ],
            [
                17644,
                18403
            ],
            [
                18403,
                18499
            ],
            [
                18499,
                18769
            ]
        ],
        "segment_chars": [
            [
                0,
                175
            ],
            [
                175,
                384
            ],
            [
                384,
                581
            ],
            [
                581,
                609
            ],
            [
                609,
                704
            ],
            [
                704,
                999
            ],
            [
                999,
                1079
            ],
            [
                1079,
                1167
            ],
            [
                1167,
                1331
            ],
            [
                1331,
                1372
            ],
            [
                1372,
                1525
            ],
            [
                1525,
                1753
            ],
            [
                1753,
                1898
            ],
            [
                1898,
                2034
            ],
            [
                2034,
                2112
            ],
            [
                2112,
                2266
            ],
            [
                2266,
                2531
            ],
            [
                2531,
                2595
            ],
            [
                2595,
                2649
            ],
            [
                2649,
                2951
            ],
            [
                2951,
                3132
            ],
            [
                3132,
                3214
            ],
            [
                3214,
                3483
            ],
            [
                3483,
                3710
            ],
            [
                3710,
                3898
            ],
            [
                3898,
                3948
            ],
            [
                3948,
                4082
            ],
            [
                4082,
                4325
            ],
            [
                4325,
                4427
            ],
            [
                4427,
                4516
            ],
            [
                4516,
                4590
            ],
            [
                4590,
                4714
            ],
            [
                4714,
                4816
            ],
            [
                4816,
                4894
            ],
            [
                4894,
                4908
            ],
            [
                4908,
                4956
            ],
            [
                4956,
                5028
            ],
            [
                5028,
                5068
            ],
            [
                5068,
                5176
            ],
            [
                5176,
                5265
            ],
            [
                5265,
                5306
            ],
            [
                5306,
                5487
            ],
            [
                5487,
                5585
            ],
            [
                5585,
                5731
            ],
            [
                5731,
                5793
            ],
            [
                5793,
                5837
            ],
            [
                5837,
                5932
            ],
            [
                5932,
                6097
            ],
            [
                6097,
                6170
            ],
            [
                6170,
                6268
            ],
            [
                6268,
                6422
            ],
            [
                6422,
                6539
            ],
            [
                6539,
                6632
            ],
            [
                6632,
                6777
            ],
            [
                6777,
                7129
            ],
            [
                7129,
                7196
            ],
            [
                7196,
                7235
            ],
            [
                7235,
                7307
            ],
            [
                7307,
                7408
            ],
            [
                7408,
                7530
            ],
            [
                7530,
                7730
            ],
            [
                7730,
                7811
            ],
            [
                7811,
                7897
            ],
            [
                7897,
                7972
            ],
            [
                7972,
                8056
            ],
            [
                8056,
                8187
            ],
            [
                8187,
                8316
            ],
            [
                8316,
                8431
            ],
            [
                8431,
                8557
            ],
            [
                8557,
                8707
            ],
            [
                8707,
                8757
            ],
            [
                8757,
                8786
            ],
            [
                8786,
                8863
            ],
            [
                8863,
                8900
            ],
            [
                8900,
                8920
            ],
            [
                8920,
                9049
            ],
            [
                9049,
                9122
            ],
            [
                9122,
                9155
            ],
            [
                9155,
                9186
            ],
            [
                9186,
                9242
            ],
            [
                9242,
                9261
            ],
            [
                9261,
                9334
            ],
            [
                9334,
                9418
            ],
            [
                9418,
                9482
            ],
            [
                9482,
                9586
            ],
            [
                9586,
                9673
            ],
            [
                9673,
                9774
            ],
            [
                9774,
                9883
            ],
            [
                9883,
                10107
            ],
            [
                10107,
                10238
            ],
            [
                10238,
                10332
            ],
            [
                10332,
                10492
            ],
            [
                10492,
                10791
            ],
            [
                10791,
                10944
            ],
            [
                10944,
                11109
            ],
            [
                11109,
                11282
            ],
            [
                11282,
                11496
            ],
            [
                11496,
                11772
            ],
            [
                11772,
                11939
            ],
            [
                11939,
                12005
            ],
            [
                12005,
                12075
            ],
            [
                12075,
                12135
            ],
            [
                12135,
                12195
            ],
            [
                12195,
                12248
            ],
            [
                12248,
                12349
            ],
            [
                12349,
                12420
            ],
            [
                12420,
                12487
            ],
            [
                12487,
                12561
            ],
            [
                12561,
                12625
            ],
            [
                12625,
                12699
            ],
            [
                12699,
                12782
            ],
            [
                12782,
                12874
            ],
            [
                12874,
                12908
            ],
            [
                12908,
                12918
            ],
            [
                12918,
                13001
            ],
            [
                13001,
                13056
            ],
            [
                13056,
                13149
            ],
            [
                13149,
                13254
            ],
            [
                13254,
                13322
            ],
            [
                13322,
                13502
            ],
            [
                13502,
                13623
            ],
            [
                13623,
                13718
            ],
            [
                13718,
                13821
            ],
            [
                13821,
                13896
            ],
            [
                13896,
                13961
            ],
            [
                13961,
                13988
            ],
            [
                13988,
                14103
            ],
            [
                14103,
                14151
            ],
            [
                14151,
                14179
            ],
            [
                14179,
                14223
            ],
            [
                14223,
                14310
            ],
            [
                14310,
                14351
            ],
            [
                14351,
                14439
            ],
            [
                14439,
                14502
            ],
            [
                14502,
                14548
            ],
            [
                14548,
                14602
            ],
            [
                14602,
                14610
            ],
            [
                14610,
                14632
            ],
            [
                14632,
                14656
            ],
            [
                14656,
                14711
            ],
            [
                14711,
                14758
            ],
            [
                14758,
                14826
            ],
            [
                14826,
                14869
            ],
            [
                14869,
                14960
            ],
            [
                14960,
                15115
            ],
            [
                15115,
                15131
            ],
            [
                15131,
                15173
            ],
            [
                15173,
                15202
            ],
            [
                15202,
                15254
            ],
            [
                15254,
                15305
            ],
            [
                15305,
                15345
            ],
            [
                15345,
                15447
            ],
            [
                15447,
                15474
            ],
            [
                15474,
                15502
            ],
            [
                15502,
                15553
            ],
            [
                15553,
                15581
            ],
            [
                15581,
                15724
            ],
            [
                15724,
                15794
            ],
            [
                15794,
                15890
            ],
            [
                15890,
                15972
            ],
            [
                15972,
                16273
            ],
            [
                16273,
                16299
            ],
            [
                16299,
                16402
            ],
            [
                16402,
                16505
            ],
            [
                16505,
                16607
            ],
            [
                16607,
                16673
            ],
            [
                16673,
                16714
            ],
            [
                16714,
                16823
            ],
            [
                16823,
                16930
            ],
            [
                16930,
                17067
            ],
            [
                17067,
                17106
            ],
            [
                17106,
                17125
            ],
            [
                17125,
                17145
            ],
            [
                17145,
                17229
            ],
            [
                17229,
                17272
            ],
            [
                17272,
                17390
            ],
            [
                17390,
                17496
            ],
            [
                17496,
                17537
            ],
            [
                17537,
                17571
            ],
            [
                17571,
                17616
            ],
            [
                17616,
                17644
            ],
            [
                17644,
                17673
            ],
            [
                17673,
                17790
            ],
            [
                17790,
                17847
            ],
            [
                17847,
                17913
            ],
            [
                17913,
                17972
            ],
            [
                17972,
                18044
            ],
            [
                18044,
                18148
            ],
            [
                18148,
                18403
            ],
            [
                18403,
                18499
            ],
            [
                18499,
                18530
            ],
            [
                18530,
                18553
            ],
            [
                18553,
                18676
            ],
            [
                18676,
                18769
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                3,
                11
            ],
            [
                48,
                60
            ],
            [
                97,
                99
            ],
            [
                64,
                72
            ],
            [
                81,
                96
            ],
            [
                100,
                103
            ],
            [
                118,
                138
            ],
            [
                139,
                166
            ],
            [
                173,
                175
            ],
            [
                175,
                182
            ],
            [
                194,
                203
            ],
            [
                232,
                254
            ],
            [
                338,
                384
            ],
            [
                384,
                394
            ],
            [
                512,
                513
            ],
            [
                401,
                418
            ],
            [
                432,
                457
            ],
            [
                609,
                611
            ],
            [
                616,
                622
            ],
            [
                504,
                512
            ],
            [
                463,
                466
            ],
            [
                659,
                678
            ],
            [
                702,
                704
            ],
            [
                704,
                763
            ],
            [
                841,
                844
            ],
            [
                876,
                889
            ],
            [
                898,
                915
            ],
            [
                997,
                999
            ],
            [
                999,
                1079
            ],
            [
                1097,
                1098
            ],
            [
                1142,
                1154
            ],
            [
                1163,
                1165
            ],
            [
                1117,
                1123
            ],
            [
                1165,
                1167
            ],
            [
                1167,
                1169
            ],
            [
                1174,
                1188
            ],
            [
                1280,
                1331
            ],
            [
                1331,
                1372
            ],
            [
                1457,
                1472
            ],
            [
                1378,
                1381
            ],
            [
                1434,
                1453
            ],
            [
                1473,
                1500
            ],
            [
                1523,
                1525
            ],
            [
                1528,
                1531
            ],
            [
                1536,
                1539
            ],
            [
                1541,
                1556
            ],
            [
                1583,
                1597
            ],
            [
                1699,
                1702
            ],
            [
                1719,
                1753
            ],
            [
                2535,
                2548
            ],
            [
                2559,
                2572
            ],
            [
                2323,
                2326
            ],
            [
                2498,
                2500
            ],
            [
                2453,
                2456
            ],
            [
                2364,
                2370
            ],
            [
                2593,
                2595
            ],
            [
                2649,
                2695
            ],
            [
                2698,
                2708
            ],
            [
                2714,
                2761
            ],
            [
                2764,
                2814
            ],
            [
                2822,
                2825
            ],
            [
                2833,
                2856
            ],
            [
                2949,
                2950
            ],
            [
                3214,
                3243
            ],
            [
                3472,
                3474
            ],
            [
                3358,
                3361
            ],
            [
                3264,
                3311
            ],
            [
                3339,
                3350
            ],
            [
                3367,
                3438
            ],
            [
                3481,
                3483
            ],
            [
                3710,
                3712
            ],
            [
                3736,
                3737
            ],
            [
                3790,
                3865
            ],
            [
                3876,
                3898
            ],
            [
                3898,
                3948
            ],
            [
                3948,
                4008
            ],
            [
                4020,
                4082
            ],
            [
                4082,
                4084
            ],
            [
                4114,
                4151
            ],
            [
                4173,
                4235
            ],
            [
                4343,
                4348
            ],
            [
                4240,
                4244
            ],
            [
                4290,
                4302
            ],
            [
                4309,
                4323
            ],
            [
                4349,
                4374
            ],
            [
                4381,
                4394
            ],
            [
                4268,
                4269
            ],
            [
                4427,
                4447
            ],
            [
                4460,
                4471
            ],
            [
                4516,
                4528
            ],
            [
                4514,
                4515
            ],
            [
                4552,
                4590
            ],
            [
                4590,
                4594
            ],
            [
                4636,
                4649
            ],
            [
                4650,
                4654
            ],
            [
                4665,
                4673
            ],
            [
                4659,
                4660
            ],
            [
                4816,
                4894
            ],
            [
                4894,
                4908
            ],
            [
                4908,
                4956
            ],
            [
                5028,
                5068
            ],
            [
                5176,
                5256
            ],
            [
                5263,
                5265
            ],
            [
                5265,
                5306
            ],
            [
                5306,
                5340
            ],
            [
                5432,
                5433
            ],
            [
                5341,
                5386
            ],
            [
                5392,
                5432
            ],
            [
                5435,
                5469
            ],
            [
                5476,
                5487
            ],
            [
                5487,
                5497
            ],
            [
                5529,
                5550
            ],
            [
                5583,
                5585
            ],
            [
                5591,
                5598
            ],
            [
                5655,
                5659
            ],
            [
                5599,
                5644
            ],
            [
                5660,
                5677
            ],
            [
                5644,
                5645
            ],
            [
                5682,
                5731
            ],
            [
                5731,
                5793
            ],
            [
                5793,
                5837
            ],
            [
                5837,
                5931
            ],
            [
                5932,
                6009
            ],
            [
                6027,
                6044
            ],
            [
                6052,
                6097
            ],
            [
                6097,
                6106
            ],
            [
                6119,
                6170
            ],
            [
                6170,
                6230
            ],
            [
                6231,
                6268
            ],
            [
                6285,
                6312
            ],
            [
                6323,
                6326
            ],
            [
                6339,
                6348
            ],
            [
                6383,
                6396
            ],
            [
                6420,
                6422
            ],
            [
                6422,
                6459
            ],
            [
                6466,
                6469
            ],
            [
                6491,
                6539
            ],
            [
                6539,
                6631
            ],
            [
                6632,
                6659
            ],
            [
                6672,
                6686
            ],
            [
                6691,
                6694
            ],
            [
                6697,
                6737
            ],
            [
                6775,
                6777
            ],
            [
                6777,
                6804
            ],
            [
                6808,
                6809
            ],
            [
                6811,
                6817
            ],
            [
                6845,
                6862
            ],
            [
                7023,
                7080
            ],
            [
                7127,
                7129
            ],
            [
                7151,
                7152
            ],
            [
                7129,
                7151
            ],
            [
                7167,
                7174
            ],
            [
                7177,
                7195
            ],
            [
                7235,
                7307
            ],
            [
                7307,
                7353
            ],
            [
                7357,
                7369
            ],
            [
                7387,
                7393
            ],
            [
                7406,
                7408
            ],
            [
                7530,
                7589
            ],
            [
                7598,
                7730
            ],
            [
                7730,
                7811
            ],
            [
                7811,
                7897
            ],
            [
                8005,
                8056
            ],
            [
                8056,
                8064
            ],
            [
                8098,
                8145
            ],
            [
                8148,
                8186
            ],
            [
                8316,
                8363
            ],
            [
                8429,
                8431
            ],
            [
                8431,
                8434
            ],
            [
                8508,
                8513
            ],
            [
                8458,
                8479
            ],
            [
                8482,
                8489
            ],
            [
                8525,
                8557
            ],
            [
                8600,
                8604
            ],
            [
                8565,
                8587
            ],
            [
                8632,
                8636
            ],
            [
                8722,
                8756
            ],
            [
                8757,
                8786
            ],
            [
                8786,
                8800
            ],
            [
                8861,
                8863
            ],
            [
                8900,
                8901
            ],
            [
                8905,
                8920
            ],
            [
                9161,
                9185
            ],
            [
                9186,
                9187
            ],
            [
                9196,
                9242
            ],
            [
                9242,
                9261
            ],
            [
                9261,
                9277
            ],
            [
                9286,
                9332
            ],
            [
                9384,
                9389
            ],
            [
                9390,
                9418
            ],
            [
                9418,
                9482
            ],
            [
                9482,
                9505
            ],
            [
                9561,
                9586
            ],
            [
                9586,
                9611
            ],
            [
                9626,
                9649
            ],
            [
                9656,
                9673
            ],
            [
                9673,
                9774
            ],
            [
                9774,
                9785
            ],
            [
                9792,
                9882
            ],
            [
                9883,
                9927
            ],
            [
                10005,
                10026
            ],
            [
                10034,
                10107
            ],
            [
                10107,
                10148
            ],
            [
                10238,
                10271
            ],
            [
                10402,
                10442
            ],
            [
                10443,
                10453
            ],
            [
                10490,
                10492
            ],
            [
                10492,
                10550
            ],
            [
                10558,
                10561
            ],
            [
                10581,
                10588
            ],
            [
                10592,
                10597
            ],
            [
                10609,
                10613
            ],
            [
                10598,
                10608
            ],
            [
                10646,
                10659
            ],
            [
                10733,
                10791
            ],
            [
                10791,
                10837
            ],
            [
                10856,
                10917
            ],
            [
                10932,
                10934
            ],
            [
                10939,
                10944
            ],
            [
                10944,
                11019
            ],
            [
                11030,
                11109
            ],
            [
                11109,
                11182
            ],
            [
                11201,
                11234
            ],
            [
                11280,
                11282
            ],
            [
                11282,
                11300
            ],
            [
                11312,
                11317
            ],
            [
                11347,
                11348
            ],
            [
                11319,
                11347
            ],
            [
                11401,
                11495
            ],
            [
                11939,
                11970
            ],
            [
                11981,
                11985
            ],
            [
                11996,
                12005
            ],
            [
                12005,
                12075
            ],
            [
                12075,
                12126
            ],
            [
                12133,
                12135
            ],
            [
                12135,
                12195
            ],
            [
                12253,
                12310
            ],
            [
                12312,
                12318
            ],
            [
                12323,
                12347
            ],
            [
                12391,
                12392
            ],
            [
                12349,
                12351
            ],
            [
                12397,
                12418
            ],
            [
                12418,
                12420
            ],
            [
                12524,
                12539
            ],
            [
                12505,
                12519
            ],
            [
                12539,
                12560
            ],
            [
                12561,
                12573
            ],
            [
                12584,
                12624
            ],
            [
                12625,
                12635
            ],
            [
                12636,
                12698
            ],
            [
                12874,
                12908
            ],
            [
                12908,
                12918
            ],
            [
                12918,
                12920
            ],
            [
                12953,
                13001
            ],
            [
                13001,
                13056
            ],
            [
                13056,
                13113
            ],
            [
                13118,
                13129
            ],
            [
                13144,
                13149
            ],
            [
                13153,
                13215
            ],
            [
                13217,
                13220
            ],
            [
                13243,
                13254
            ],
            [
                13322,
                13378
            ],
            [
                13500,
                13502
            ],
            [
                13576,
                13602
            ],
            [
                13541,
                13550
            ],
            [
                13607,
                13623
            ],
            [
                13640,
                13678
            ],
            [
                13716,
                13718
            ],
            [
                13718,
                13738
            ],
            [
                13756,
                13760
            ],
            [
                13767,
                13769
            ],
            [
                13762,
                13766
            ],
            [
                13770,
                13821
            ],
            [
                13821,
                13847
            ],
            [
                13852,
                13881
            ],
            [
                13894,
                13896
            ],
            [
                13896,
                13922
            ],
            [
                13961,
                13986
            ],
            [
                13986,
                13988
            ],
            [
                13988,
                14069
            ],
            [
                14079,
                14103
            ],
            [
                14103,
                14151
            ],
            [
                14151,
                14160
            ],
            [
                14177,
                14179
            ],
            [
                14179,
                14223
            ],
            [
                14223,
                14273
            ],
            [
                14274,
                14278
            ],
            [
                14282,
                14289
            ],
            [
                14297,
                14310
            ],
            [
                14310,
                14351
            ],
            [
                14439,
                14473
            ],
            [
                14500,
                14502
            ],
            [
                14502,
                14526
            ],
            [
                14532,
                14548
            ],
            [
                14548,
                14602
            ],
            [
                14610,
                14619
            ],
            [
                14630,
                14632
            ],
            [
                14632,
                14656
            ],
            [
                14656,
                14711
            ],
            [
                14711,
                14717
            ],
            [
                14719,
                14758
            ],
            [
                14758,
                14824
            ],
            [
                14869,
                14900
            ],
            [
                14941,
                14960
            ],
            [
                14960,
                14965
            ],
            [
                14970,
                14987
            ],
            [
                14989,
                14992
            ],
            [
                14997,
                15038
            ],
            [
                15041,
                15042
            ],
            [
                15074,
                15115
            ],
            [
                15115,
                15131
            ],
            [
                15207,
                15251
            ],
            [
                15345,
                15447
            ],
            [
                15447,
                15474
            ],
            [
                15474,
                15478
            ],
            [
                15484,
                15502
            ],
            [
                15502,
                15503
            ],
            [
                15507,
                15553
            ],
            [
                15553,
                15581
            ],
            [
                15581,
                15619
            ],
            [
                15649,
                15683
            ],
            [
                15688,
                15693
            ],
            [
                15722,
                15724
            ],
            [
                15724,
                15736
            ],
            [
                15765,
                15771
            ],
            [
                15781,
                15792
            ],
            [
                15794,
                15801
            ],
            [
                15950,
                15970
            ],
            [
                15843,
                15855
            ],
            [
                15806,
                15814
            ],
            [
                15970,
                15972
            ],
            [
                15972,
                15998
            ],
            [
                16023,
                16029
            ],
            [
                16030,
                16034
            ],
            [
                16051,
                16093
            ],
            [
                16098,
                16114
            ],
            [
                16128,
                16185
            ],
            [
                16271,
                16272
            ],
            [
                16402,
                16443
            ],
            [
                16453,
                16469
            ],
            [
                16481,
                16505
            ],
            [
                16505,
                16517
            ],
            [
                16523,
                16525
            ],
            [
                16532,
                16533
            ],
            [
                16535,
                16571
            ],
            [
                16578,
                16607
            ],
            [
                16607,
                16649
            ],
            [
                16656,
                16673
            ],
            [
                16673,
                16714
            ],
            [
                16714,
                16717
            ],
            [
                16823,
                16874
            ],
            [
                16879,
                16889
            ],
            [
                16903,
                16930
            ],
            [
                16930,
                16992
            ],
            [
                17064,
                17067
            ],
            [
                17067,
                17106
            ],
            [
                17106,
                17125
            ],
            [
                17125,
                17145
            ],
            [
                17145,
                17229
            ],
            [
                17229,
                17272
            ],
            [
                17272,
                17278
            ],
            [
                17321,
                17347
            ],
            [
                17294,
                17298
            ],
            [
                17356,
                17390
            ],
            [
                17390,
                17407
            ],
            [
                17417,
                17489
            ],
            [
                17491,
                17493
            ],
            [
                17538,
                17548
            ],
            [
                17555,
                17571
            ],
            [
                17645,
                17671
            ],
            [
                17790,
                17793
            ],
            [
                17814,
                17846
            ],
            [
                17847,
                17876
            ],
            [
                17885,
                17896
            ],
            [
                17911,
                17913
            ],
            [
                17913,
                17972
            ],
            [
                17972,
                18031
            ],
            [
                18041,
                18044
            ],
            [
                18184,
                18340
            ],
            [
                18401,
                18403
            ],
            [
                18403,
                18488
            ],
            [
                18497,
                18499
            ],
            [
                18499,
                18530
            ],
            [
                18530,
                18553
            ],
            [
                18603,
                18664
            ],
            [
                18672,
                18676
            ],
            [
                18676,
                18712
            ],
            [
                18717,
                18769
            ]
        ],
        "row_chars": [
            [
                0,
                175
            ],
            [
                175,
                384
            ],
            [
                384,
                704
            ],
            [
                704,
                999
            ],
            [
                999,
                1079
            ],
            [
                1079,
                1167
            ],
            [
                1167,
                1331
            ],
            [
                1331,
                1372
            ],
            [
                1372,
                1525
            ],
            [
                1525,
                1753
            ],
            [
                1753,
                1898
            ],
            [
                1898,
                2034
            ],
            [
                2034,
                2112
            ],
            [
                2112,
                2266
            ],
            [
                2266,
                2595
            ],
            [
                2595,
                2649
            ],
            [
                2649,
                2951
            ],
            [
                2951,
                3132
            ],
            [
                3132,
                3214
            ],
            [
                3214,
                3483
            ],
            [
                3483,
                3710
            ],
            [
                3710,
                3898
            ],
            [
                3898,
                3948
            ],
            [
                3948,
                4082
            ],
            [
                4082,
                4427
            ],
            [
                4427,
                4590
            ],
            [
                4590,
                4894
            ],
            [
                4894,
                4908
            ],
            [
                4908,
                4956
            ],
            [
                4956,
                5028
            ],
            [
                5028,
                5068
            ],
            [
                5068,
                5176
            ],
            [
                5176,
                5265
            ],
            [
                5265,
                5306
            ],
            [
                5306,
                5487
            ],
            [
                5487,
                5585
            ],
            [
                5585,
                5731
            ],
            [
                5731,
                5793
            ],
            [
                5793,
                5837
            ],
            [
                5837,
                5932
            ],
            [
                5932,
                6097
            ],
            [
                6097,
                6170
            ],
            [
                6170,
                6268
            ],
            [
                6268,
                6422
            ],
            [
                6422,
                6539
            ],
            [
                6539,
                6632
            ],
            [
                6632,
                6777
            ],
            [
                6777,
                7129
            ],
            [
                7129,
                7196
            ],
            [
                7196,
                7235
            ],
            [
                7235,
                7307
            ],
            [
                7307,
                7408
            ],
            [
                7408,
                7530
            ],
            [
                7530,
                7730
            ],
            [
                7730,
                7811
            ],
            [
                7811,
                7897
            ],
            [
                7897,
                7972
            ],
            [
                7972,
                8056
            ],
            [
                8056,
                8187
            ],
            [
                8187,
                8316
            ],
            [
                8316,
                8431
            ],
            [
                8431,
                8557
            ],
            [
                8557,
                8757
            ],
            [
                8757,
                8786
            ],
            [
                8786,
                8863
            ],
            [
                8863,
                8900
            ],
            [
                8900,
                8920
            ],
            [
                8920,
                9049
            ],
            [
                9049,
                9122
            ],
            [
                9122,
                9155
            ],
            [
                9155,
                9186
            ],
            [
                9186,
                9242
            ],
            [
                9242,
                9261
            ],
            [
                9261,
                9418
            ],
            [
                9418,
                9482
            ],
            [
                9482,
                9586
            ],
            [
                9586,
                9673
            ],
            [
                9673,
                9774
            ],
            [
                9774,
                9883
            ],
            [
                9883,
                10107
            ],
            [
                10107,
                10492
            ],
            [
                10492,
                10791
            ],
            [
                10791,
                10944
            ],
            [
                10944,
                11109
            ],
            [
                11109,
                11282
            ],
            [
                11282,
                11496
            ],
            [
                11496,
                11772
            ],
            [
                11772,
                11939
            ],
            [
                11939,
                12005
            ],
            [
                12005,
                12075
            ],
            [
                12075,
                12135
            ],
            [
                12135,
                12195
            ],
            [
                12195,
                12248
            ],
            [
                12248,
                12420
            ],
            [
                12420,
                12487
            ],
            [
                12487,
                12561
            ],
            [
                12561,
                12625
            ],
            [
                12625,
                12699
            ],
            [
                12699,
                12782
            ],
            [
                12782,
                12874
            ],
            [
                12874,
                12908
            ],
            [
                12908,
                12918
            ],
            [
                12918,
                13001
            ],
            [
                13001,
                13056
            ],
            [
                13056,
                13149
            ],
            [
                13149,
                13254
            ],
            [
                13254,
                13322
            ],
            [
                13322,
                13502
            ],
            [
                13502,
                13623
            ],
            [
                13623,
                13718
            ],
            [
                13718,
                13821
            ],
            [
                13821,
                13896
            ],
            [
                13896,
                13961
            ],
            [
                13961,
                13988
            ],
            [
                13988,
                14103
            ],
            [
                14103,
                14151
            ],
            [
                14151,
                14179
            ],
            [
                14179,
                14223
            ],
            [
                14223,
                14310
            ],
            [
                14310,
                14351
            ],
            [
                14351,
                14439
            ],
            [
                14439,
                14502
            ],
            [
                14502,
                14548
            ],
            [
                14548,
                14602
            ],
            [
                14602,
                14610
            ],
            [
                14610,
                14632
            ],
            [
                14632,
                14656
            ],
            [
                14656,
                14711
            ],
            [
                14711,
                14758
            ],
            [
                14758,
                14826
            ],
            [
                14826,
                14869
            ],
            [
                14869,
                14960
            ],
            [
                14960,
                15115
            ],
            [
                15115,
                15131
            ],
            [
                15131,
                15173
            ],
            [
                15173,
                15202
            ],
            [
                15202,
                15254
            ],
            [
                15254,
                15305
            ],
            [
                15305,
                15345
            ],
            [
                15345,
                15447
            ],
            [
                15447,
                15474
            ],
            [
                15474,
                15502
            ],
            [
                15502,
                15553
            ],
            [
                15553,
                15581
            ],
            [
                15581,
                15724
            ],
            [
                15724,
                15972
            ],
            [
                15972,
                16273
            ],
            [
                16273,
                16299
            ],
            [
                16299,
                16402
            ],
            [
                16402,
                16505
            ],
            [
                16505,
                16607
            ],
            [
                16607,
                16673
            ],
            [
                16673,
                16714
            ],
            [
                16714,
                16930
            ],
            [
                16930,
                17067
            ],
            [
                17067,
                17106
            ],
            [
                17106,
                17125
            ],
            [
                17125,
                17145
            ],
            [
                17145,
                17229
            ],
            [
                17229,
                17272
            ],
            [
                17272,
                17390
            ],
            [
                17390,
                17496
            ],
            [
                17496,
                17537
            ],
            [
                17537,
                17571
            ],
            [
                17571,
                17616
            ],
            [
                17616,
                17644
            ],
            [
                17644,
                17673
            ],
            [
                17673,
                17790
            ],
            [
                17790,
                17847
            ],
            [
                17847,
                17913
            ],
            [
                17913,
                17972
            ],
            [
                17972,
                18044
            ],
            [
                18044,
                18148
            ],
            [
                18148,
                18403
            ],
            [
                18403,
                18499
            ],
            [
                18499,
                18530
            ],
            [
                18530,
                18553
            ],
            [
                18553,
                18676
            ],
            [
                18676,
                18769
            ]
        ]
    },
    "abridged": {
        "text": "No parliamentary election in a borough as large as Westminster had yet happened in England since the secret ballot had been established. Men who previously had known how elections would go, now confessed themselves to be in the dark. Three days ago, the odds had been in Melmotte's favour; but on Monday his name had gone down in the betting. Early in the day his supporters had thought little of this, but by late afternoon the news from the City had spread. At six o'clock there were some who suggested that his name should be withdrawn. However, no one dared suggest it to him. On Monday evening the interest of the hour was turned to the dinner.\nBut Mr. Alf's supporters were very busy. Their Committee had consulted about what should be done as to these charges against Melmotte. The Pulpit of that evening alluded to the affair, but gave no name and mentioned no details. The Committee was averse to fighting the election by making the rumours public. If, after all, Melmotte had committed no fraud - or, as was more probable, should not be convicted of fraud - then it would be said that the accusation had been invented for electioneering purposes.\nHowever, the dinner to the Emperor was ridiculed in the newspaper, and the electors were asked whether they felt they should elect a gentleman to Parliament because he had offered to spend a fortune on entertaining royalty. At midnight, when Melmotte was walking home to bed, the general opinion at the clubs was in favour of Mr. Alf.\nOn the next morning Melmotte was up before eight. As yet no policeman had called for him, nor had any official word reached him that an accusation was to be brought against him. On rising he at once went into the back-parlour which Mr. Longestaffe called his study, and which Mr. Melmotte often used for the work he did at home early in the morning, and late at night.\nThere were two heavy desks in the room: one of these Mr. Longstaffe had kept locked for his own purposes. When the house had first been let to Melmotte, everything between the two gentlemen had been managed with the greatest ease. Oh dear, yes! Mr. Longestaffe could come whenever he pleased. The ladies would never enter that room. If Mr. Longestaffe could spare it, Mr. Melmotte would take the key of one of the desks. The matter was arranged very pleasantly.\nMr. Melmotte, on entering the room, bolted the door, and then, sitting at his own desk, took certain papers out of the drawers: a bundle of letters and another of documents. From these he took three or four. He tore them into very small fragments and burned the bits over a gas-burner, letting the ashes fall into a large china plate. Then he blew the ashes into the yard through the open window. This he did to all these documents but one. This one he put bit by bit into his mouth, chewing the paper into a pulp till he swallowed it.\nWhen he had done this, and had re-locked his own drawers, he walked across to Mr. Longestaffe's desk and pulled the handle of one of the drawers. It opened. Without touching the contents, he again closed it. He then knelt down and examined the lock, and the hole above, into which the bolt of the lock ran. He again closed the drawer, unlocked the study door, and rang the bell. The servant found him writing letters at his desk, and was told that he was ready for breakfast. He always breakfasted alone with a heap of newspapers around him, and so he did on this day.\nHe soon found the paragraph about himself in the Pulpit, and read it without a quiver in his face. There was no one to see him, but he had resolved that at no moment would he betray himself by the working of a single muscle. Whatever happened, he would go through it without any sign of shrinking.\nAt ten he walked down to the central committee-room at Whitehall Place. He thought that he would face the world better walking than in his carriage. He went along Bond Street and Piccadilly, Regent Street and Pall Mall to Charing Cross, with the blandly triumphant smile of a man who had successfully entertained the great guest of the day. As he got near the club he met two or three men whom he knew, and bowed to them. They returned his bow graciously enough, but not one of them stopped to speak to him. He was careful to show no displeasure on his face. He would still be the blandly triumphant Merchant Prince - as long as the police would allow him.\nAt the committee-room he only found a few underlings. The ballot was under way; but with the ballot - so said these men - there never was any excitement. They looked half-frightened; they had not expected to see him there.\n\"Has Lord Alfred been here?\" Melmotte asked. \"Or Mr. Grendall?\" No, nobody had been there.\n\"There is nothing more to be done, I suppose?\" said Mr. Melmotte. The senior underling thought that there was nothing more to be done, and Melmotte strolled out again on foot.\nHe went up into Covent Garden, where there was a polling booth. The place seemed to him to be wonderfully quiet. He was determined to face everything, and he went up to the booth. Here he was recognised by various men, mechanics chiefly, who came forward and shook hands with him. He remained for an hour conversing with people, and at last made a speech to a little knot around him.\nHe did not allude to the rumour of yesterday; but he spoke freely of the general accusations that had been brought against him previously. He wished the electors to understand that he was proud of his position, and that the law would protect him from such unfair aspersions. He flattered himself that he was too good an Englishman to bother about the attacks which were made on candidates at elections; particularly as he looked forward to a triumphant return. But things had been said, and published, which an election could not justify, and as to these things he must go to law. Then he made some allusion to the Princes and the Emperor, and concluded by saying that it was the proudest boast of his life to be an Englishman and a Londoner.\nIt was asserted afterwards that this was the only good speech he had ever made; and it was certainly successful. A reporter for the Breakfast Table, who was on duty at the place, gave an account of the speech in that paper, and made more of it, perhaps, than it deserved.\nIt was then noon, and he had to decide what to do next. He was half inclined to go round to all the booths and make speeches. His success at Covent Garden had been very pleasant. But he feared that he might not be so successful elsewhere. An idea struck him that he would go boldly into the City, to his offices in Abchurch Lane, although he would not be expected today. Whatever perils there might be, he would face them.\nHe got a cab and had himself driven to Abchurch Lane. The clerks there were hanging about doing nothing, as though it were a holiday.\n\"Mr. Grendall has not been here?\" he asked. No; but Mr. Cohenlupe was in Mr. Grendall's room. At this moment he hardly desired to see Mr. Cohenlupe. That gentleman was privy to many of his transactions, but by no means all. Cohenlupe knew that the estate at Pickering had been purchased and mortgaged. But he knew nothing of the circumstances of the purchase. Melmotte felt that he could not speak to Cohenlupe without danger. They might have to stand in a dock together. But the clerks would talk if he were to leave the office without seeing his old friend. He went therefore into his room, and called to Cohenlupe.\n\"Ve didn't expect you here today.\"\n\"Nor did I expect to come,\" said Melmotte. \"But there isn't much to do at Westminster while the ballot is going on; so I came to look at the letters. The dinner went off pretty well yesterday, eh?\"\n\"Uncommon. Vy did the Lord Mayor stay away, Melmotte?\"\n\"Because he's an ass and a cur,\" said Mr. Melmotte, with assumed indignation. \"Alf and his people had got hold of him. I say it was an insult to the City. I shall be even with him one of these days.\"\n\"Things will go on just the same as usual, Melmotte?\"\n\"Of course. What's to hinder them?\"\n\"There's ever so much been said,\" whispered Cohenlupe.\n\"Said; yes,\" ejaculated Melmotte very loudly. \"You're not such a fool, I hope, as to believe every word you hear.\"\n\"There's no knowing vat anybody knows,\" said Cohenlupe.\n\"Look here, Cohenlupe,\" - and Melmotte also sank his voice to a whisper - \"go about just as usual, and say nothing. It's all right. Any paper with my name to it will come right. I've bought some property and have paid for it; and I have bought some, and have not yet paid for it. There's no fraud in that.\"\n\"No, nothing in that.\"\n\"Hold your tongue, and go about your business. I'm going to the bank now.\" Cohenlupe had been very low in spirits; but he was somewhat better after Melmotte's visit.\nMr. Melmotte walked to the bank where he kept his domestic account rather than his business accounts. He walked straight through to the back room in which sat the manager and the manager's clerk, and stood before the fire-place just as though nothing had happened.\nThe manager did not behave nearly as well, and the clerks betrayed their emotion. Melmotte saw it; but he had expected it, and had come on purpose to \"put it down.\"\n\"We hardly expected to see you in the City today, Mr. Melmotte.\"\n\"And I didn't expect to see myself here. But they're all at work down at Westminster, balloting; and as I can't vote for myself, I'm of no use. I've been at Covent Garden this morning, making a stump speech.\"\n\"And the dinner went off pretty well?\" asked the manager.\n\"Very well, indeed. They say the Emperor liked it better than anything that has been done for him yet.\" This was a brilliant flash of imagination. \"For a dining companion, I should prefer somebody with a little more to say for himself. But then, perhaps, if you or I were in China we shouldn't have much to say for ourselves; eh? We had one disappointment. The Lord Mayor didn't come. But the dinner went on without him.\"\nThen Melmotte referred to the purpose of his call. He would have to draw large cheques for his private wants. \"You don't give a dinner to an Emperor of China for nothing.\" He drew a regular cheque on his business account for a large sum, and then, as a sort of afterthought, paid in the 250 which he had received from Mr. Broune.\n\"There don't seem much the matter with him,\" said the manager, when Melmotte had left.\n\"He brazens it out, don't he?\" said the senior clerk. They inclined to the opinion that the rumours had been a political manuvre. Nevertheless, Mr. Melmotte would not have been allowed to overdraw at the present moment.",
        "paragraph_chars": [
            [
                0,
                650
            ],
            [
                650,
                1157
            ],
            [
                1157,
                1492
            ],
            [
                1492,
                1861
            ],
            [
                1861,
                2323
            ],
            [
                2323,
                2859
            ],
            [
                2859,
                3428
            ],
            [
                3428,
                3726
            ],
            [
                3726,
                4383
            ],
            [
                4383,
                4606
            ],
            [
                4606,
                4697
            ],
            [
                4697,
                4873
            ],
            [
                4873,
                5257
            ],
            [
                5257,
                6000
            ],
            [
                6000,
                6272
            ],
            [
                6272,
                6695
            ],
            [
                6695,
                6829
            ],
            [
                6829,
                7447
            ],
            [
                7447,
                7482
            ],
            [
                7482,
                7680
            ],
            [
                7680,
                7735
            ],
            [
                7735,
                7935
            ],
            [
                7935,
                7989
            ],
            [
                7989,
                8025
            ],
            [
                8025,
                8080
            ],
            [
                8080,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8558
            ],
            [
                8558,
                8581
            ],
            [
                8581,
                8747
            ],
            [
                8747,
                9012
            ],
            [
                9012,
                9177
            ],
            [
                9177,
                9242
            ],
            [
                9242,
                9451
            ],
            [
                9451,
                9509
            ],
            [
                9509,
                9931
            ],
            [
                9931,
                10261
            ],
            [
                10261,
                10348
            ],
            [
                10348,
                10567
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                234
            ],
            [
                234,
                343
            ],
            [
                343,
                460
            ],
            [
                460,
                540
            ],
            [
                540,
                581
            ],
            [
                581,
                650
            ],
            [
                650,
                691
            ],
            [
                691,
                785
            ],
            [
                785,
                878
            ],
            [
                878,
                958
            ],
            [
                958,
                1157
            ],
            [
                1157,
                1381
            ],
            [
                1381,
                1492
            ],
            [
                1492,
                1542
            ],
            [
                1542,
                1670
            ],
            [
                1670,
                1861
            ],
            [
                1861,
                1967
            ],
            [
                1967,
                2092
            ],
            [
                2092,
                2106
            ],
            [
                2106,
                2154
            ],
            [
                2154,
                2194
            ],
            [
                2194,
                2282
            ],
            [
                2282,
                2323
            ],
            [
                2323,
                2497
            ],
            [
                2497,
                2531
            ],
            [
                2531,
                2658
            ],
            [
                2658,
                2720
            ],
            [
                2720,
                2764
            ],
            [
                2764,
                2859
            ],
            [
                2859,
                3005
            ],
            [
                3005,
                3016
            ],
            [
                3016,
                3067
            ],
            [
                3067,
                3166
            ],
            [
                3166,
                3238
            ],
            [
                3238,
                3335
            ],
            [
                3335,
                3428
            ],
            [
                3428,
                3527
            ],
            [
                3527,
                3653
            ],
            [
                3653,
                3726
            ],
            [
                3726,
                3798
            ],
            [
                3798,
                3875
            ],
            [
                3875,
                4067
            ],
            [
                4067,
                4148
            ],
            [
                4148,
                4234
            ],
            [
                4234,
                4285
            ],
            [
                4285,
                4383
            ],
            [
                4383,
                4437
            ],
            [
                4437,
                4537
            ],
            [
                4537,
                4606
            ],
            [
                4606,
                4635
            ],
            [
                4635,
                4651
            ],
            [
                4651,
                4670
            ],
            [
                4670,
                4697
            ],
            [
                4697,
                4744
            ],
            [
                4744,
                4763
            ],
            [
                4763,
                4873
            ],
            [
                4873,
                4937
            ],
            [
                4937,
                4986
            ],
            [
                4986,
                5053
            ],
            [
                5053,
                5154
            ],
            [
                5154,
                5257
            ],
            [
                5257,
                5396
            ],
            [
                5396,
                5532
            ],
            [
                5532,
                5718
            ],
            [
                5718,
                5838
            ],
            [
                5838,
                6000
            ],
            [
                6000,
                6113
            ],
            [
                6113,
                6272
            ],
            [
                6272,
                6328
            ],
            [
                6328,
                6398
            ],
            [
                6398,
                6451
            ],
            [
                6451,
                6511
            ],
            [
                6511,
                6643
            ],
            [
                6643,
                6695
            ],
            [
                6695,
                6749
            ],
            [
                6749,
                6829
            ],
            [
                6829,
                6863
            ],
            [
                6863,
                6873
            ],
            [
                6873,
                6923
            ],
            [
                6923,
                6978
            ],
            [
                6978,
                7053
            ],
            [
                7053,
                7131
            ],
            [
                7131,
                7189
            ],
            [
                7189,
                7256
            ],
            [
                7256,
                7301
            ],
            [
                7301,
                7389
            ],
            [
                7389,
                7447
            ],
            [
                7447,
                7482
            ],
            [
                7482,
                7525
            ],
            [
                7525,
                7632
            ],
            [
                7632,
                7680
            ],
            [
                7680,
                7691
            ],
            [
                7691,
                7735
            ],
            [
                7735,
                7813
            ],
            [
                7813,
                7854
            ],
            [
                7854,
                7890
            ],
            [
                7890,
                7935
            ],
            [
                7935,
                7989
            ],
            [
                7989,
                8001
            ],
            [
                8001,
                8025
            ],
            [
                8025,
                8080
            ],
            [
                8080,
                8126
            ],
            [
                8126,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8367
            ],
            [
                8367,
                8383
            ],
            [
                8383,
                8429
            ],
            [
                8429,
                8531
            ],
            [
                8531,
                8558
            ],
            [
                8558,
                8581
            ],
            [
                8581,
                8628
            ],
            [
                8628,
                8656
            ],
            [
                8656,
                8747
            ],
            [
                8747,
                8849
            ],
            [
                8849,
                9012
            ],
            [
                9012,
                9094
            ],
            [
                9094,
                9177
            ],
            [
                9177,
                9242
            ],
            [
                9242,
                9283
            ],
            [
                9283,
                9386
            ],
            [
                9386,
                9451
            ],
            [
                9451,
                9490
            ],
            [
                9490,
                9509
            ],
            [
                9509,
                9529
            ],
            [
                9529,
                9613
            ],
            [
                9613,
                9656
            ],
            [
                9656,
                9745
            ],
            [
                9745,
                9839
            ],
            [
                9839,
                9866
            ],
            [
                9866,
                9894
            ],
            [
                9894,
                9931
            ],
            [
                9931,
                9982
            ],
            [
                9982,
                10041
            ],
            [
                10041,
                10103
            ],
            [
                10103,
                10261
            ],
            [
                10261,
                10348
            ],
            [
                10348,
                10379
            ],
            [
                10379,
                10402
            ],
            [
                10402,
                10478
            ],
            [
                10478,
                10567
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                17,
                25
            ],
            [
                26,
                38
            ],
            [
                39,
                41
            ],
            [
                42,
                50
            ],
            [
                51,
                66
            ],
            [
                67,
                70
            ],
            [
                80,
                100
            ],
            [
                108,
                135
            ],
            [
                135,
                137
            ],
            [
                137,
                144
            ],
            [
                156,
                165
            ],
            [
                166,
                188
            ],
            [
                188,
                234
            ],
            [
                234,
                244
            ],
            [
                248,
                249
            ],
            [
                250,
                267
            ],
            [
                268,
                293
            ],
            [
                294,
                296
            ],
            [
                297,
                303
            ],
            [
                304,
                312
            ],
            [
                313,
                316
            ],
            [
                322,
                341
            ],
            [
                341,
                343
            ],
            [
                343,
                402
            ],
            [
                403,
                406
            ],
            [
                415,
                428
            ],
            [
                434,
                451
            ],
            [
                458,
                460
            ],
            [
                460,
                540
            ],
            [
                547,
                548
            ],
            [
                549,
                561
            ],
            [
                570,
                572
            ],
            [
                573,
                579
            ],
            [
                579,
                581
            ],
            [
                581,
                583
            ],
            [
                584,
                598
            ],
            [
                599,
                650
            ],
            [
                650,
                691
            ],
            [
                691,
                706
            ],
            [
                707,
                710
            ],
            [
                727,
                746
            ],
            [
                747,
                774
            ],
            [
                783,
                785
            ],
            [
                785,
                788
            ],
            [
                792,
                795
            ],
            [
                796,
                811
            ],
            [
                820,
                834
            ],
            [
                835,
                838
            ],
            [
                844,
                878
            ],
            [
                878,
                891
            ],
            [
                892,
                905
            ],
            [
                915,
                918
            ],
            [
                928,
                930
            ],
            [
                938,
                941
            ],
            [
                950,
                956
            ],
            [
                956,
                958
            ],
            [
                958,
                1004
            ],
            [
                1007,
                1017
            ],
            [
                1018,
                1065
            ],
            [
                1068,
                1118
            ],
            [
                1128,
                1131
            ],
            [
                1132,
                1155
            ],
            [
                1155,
                1156
            ],
            [
                1166,
                1195
            ],
            [
                1206,
                1208
            ],
            [
                1209,
                1212
            ],
            [
                1222,
                1269
            ],
            [
                1288,
                1299
            ],
            [
                1300,
                1371
            ],
            [
                1379,
                1381
            ],
            [
                1381,
                1383
            ],
            [
                1392,
                1393
            ],
            [
                1394,
                1469
            ],
            [
                1470,
                1492
            ],
            [
                1492,
                1542
            ],
            [
                1542,
                1602
            ],
            [
                1608,
                1670
            ],
            [
                1670,
                1672
            ],
            [
                1680,
                1717
            ],
            [
                1718,
                1780
            ],
            [
                1781,
                1786
            ],
            [
                1787,
                1791
            ],
            [
                1792,
                1804
            ],
            [
                1805,
                1819
            ],
            [
                1820,
                1845
            ],
            [
                1846,
                1859
            ],
            [
                1859,
                1860
            ],
            [
                1861,
                1881
            ],
            [
                1888,
                1899
            ],
            [
                1901,
                1913
            ],
            [
                1916,
                1917
            ],
            [
                1929,
                1967
            ],
            [
                1967,
                1971
            ],
            [
                1972,
                1985
            ],
            [
                1992,
                1996
            ],
            [
                2004,
                2012
            ],
            [
                2012,
                2013
            ],
            [
                2014,
                2092
            ],
            [
                2092,
                2106
            ],
            [
                2106,
                2154
            ],
            [
                2154,
                2194
            ],
            [
                2194,
                2274
            ],
            [
                2280,
                2282
            ],
            [
                2282,
                2323
            ],
            [
                2323,
                2357
            ],
            [
                2357,
                2358
            ],
            [
                2359,
                2404
            ],
            [
                2409,
                2449
            ],
            [
                2451,
                2485
            ],
            [
                2486,
                2497
            ],
            [
                2497,
                2507
            ],
            [
                2508,
                2529
            ],
            [
                2529,
                2531
            ],
            [
                2531,
                2538
            ],
            [
                2539,
                2543
            ],
            [
                2544,
                2589
            ],
            [
                2590,
                2607
            ],
            [
                2607,
                2608
            ],
            [
                2609,
                2658
            ],
            [
                2658,
                2720
            ],
            [
                2720,
                2764
            ],
            [
                2764,
                2858
            ],
            [
                2859,
                2936
            ],
            [
                2937,
                2954
            ],
            [
                2960,
                3005
            ],
            [
                3005,
                3014
            ],
            [
                3016,
                3067
            ],
            [
                3067,
                3127
            ],
            [
                3129,
                3166
            ],
            [
                3166,
                3193
            ],
            [
                3203,
                3206
            ],
            [
                3213,
                3222
            ],
            [
                3223,
                3236
            ],
            [
                3236,
                3238
            ],
            [
                3238,
                3275
            ],
            [
                3279,
                3282
            ],
            [
                3287,
                3335
            ],
            [
                3335,
                3427
            ],
            [
                3428,
                3455
            ],
            [
                3462,
                3476
            ],
            [
                3480,
                3483
            ],
            [
                3485,
                3525
            ],
            [
                3525,
                3527
            ],
            [
                3527,
                3554
            ],
            [
                3554,
                3555
            ],
            [
                3556,
                3562
            ],
            [
                3576,
                3593
            ],
            [
                3594,
                3651
            ],
            [
                3651,
                3653
            ],
            [
                3670,
                3671
            ],
            [
                3672,
                3694
            ],
            [
                3695,
                3702
            ],
            [
                3707,
                3725
            ],
            [
                3726,
                3798
            ],
            [
                3798,
                3844
            ],
            [
                3845,
                3857
            ],
            [
                3858,
                3864
            ],
            [
                3873,
                3875
            ],
            [
                3875,
                3934
            ],
            [
                3935,
                4067
            ],
            [
                4067,
                4148
            ],
            [
                4148,
                4234
            ],
            [
                4234,
                4285
            ],
            [
                4285,
                4293
            ],
            [
                4294,
                4341
            ],
            [
                4344,
                4382
            ],
            [
                4383,
                4430
            ],
            [
                4435,
                4437
            ],
            [
                4437,
                4440
            ],
            [
                4452,
                4457
            ],
            [
                4461,
                4482
            ],
            [
                4485,
                4492
            ],
            [
                4505,
                4537
            ],
            [
                4537,
                4541
            ],
            [
                4542,
                4564
            ],
            [
                4566,
                4570
            ],
            [
                4571,
                4605
            ],
            [
                4606,
                4635
            ],
            [
                4635,
                4649
            ],
            [
                4649,
                4651
            ],
            [
                4651,
                4652
            ],
            [
                4655,
                4670
            ],
            [
                4672,
                4696
            ],
            [
                4697,
                4698
            ],
            [
                4698,
                4744
            ],
            [
                4744,
                4763
            ],
            [
                4763,
                4779
            ],
            [
                4784,
                4830
            ],
            [
                4830,
                4835
            ],
            [
                4845,
                4873
            ],
            [
                4873,
                4937
            ],
            [
                4937,
                4960
            ],
            [
                4961,
                4986
            ],
            [
                4986,
                5011
            ],
            [
                5012,
                5035
            ],
            [
                5036,
                5053
            ],
            [
                5053,
                5154
            ],
            [
                5154,
                5165
            ],
            [
                5166,
                5256
            ],
            [
                5257,
                5301
            ],
            [
                5301,
                5322
            ],
            [
                5323,
                5396
            ],
            [
                5396,
                5437
            ],
            [
                5438,
                5471
            ],
            [
                5472,
                5512
            ],
            [
                5520,
                5530
            ],
            [
                5530,
                5532
            ],
            [
                5532,
                5590
            ],
            [
                5604,
                5607
            ],
            [
                5608,
                5615
            ],
            [
                5616,
                5621
            ],
            [
                5622,
                5626
            ],
            [
                5635,
                5645
            ],
            [
                5646,
                5659
            ],
            [
                5660,
                5718
            ],
            [
                5718,
                5764
            ],
            [
                5765,
                5826
            ],
            [
                5830,
                5832
            ],
            [
                5833,
                5838
            ],
            [
                5838,
                5913
            ],
            [
                5921,
                6000
            ],
            [
                6000,
                6073
            ],
            [
                6078,
                6111
            ],
            [
                6111,
                6113
            ],
            [
                6113,
                6131
            ],
            [
                6142,
                6147
            ],
            [
                6147,
                6148
            ],
            [
                6149,
                6177
            ],
            [
                6177,
                6271
            ],
            [
                6272,
                6303
            ],
            [
                6311,
                6315
            ],
            [
                6319,
                6328
            ],
            [
                6328,
                6398
            ],
            [
                6398,
                6449
            ],
            [
                6449,
                6451
            ],
            [
                6451,
                6511
            ],
            [
                6511,
                6568
            ],
            [
                6569,
                6575
            ],
            [
                6576,
                6600
            ],
            [
                6600,
                6601
            ],
            [
                6611,
                6613
            ],
            [
                6614,
                6635
            ],
            [
                6641,
                6643
            ],
            [
                6643,
                6658
            ],
            [
                6659,
                6673
            ],
            [
                6673,
                6694
            ],
            [
                6695,
                6707
            ],
            [
                6708,
                6748
            ],
            [
                6749,
                6759
            ],
            [
                6766,
                6828
            ],
            [
                6829,
                6863
            ],
            [
                6863,
                6873
            ],
            [
                6873,
                6875
            ],
            [
                6875,
                6923
            ],
            [
                6923,
                6978
            ],
            [
                6978,
                7035
            ],
            [
                7036,
                7047
            ],
            [
                7048,
                7053
            ],
            [
                7053,
                7115
            ],
            [
                7116,
                7119
            ],
            [
                7120,
                7131
            ],
            [
                7131,
                7187
            ],
            [
                7187,
                7189
            ],
            [
                7203,
                7229
            ],
            [
                7230,
                7239
            ],
            [
                7240,
                7256
            ],
            [
                7261,
                7299
            ],
            [
                7299,
                7301
            ],
            [
                7301,
                7321
            ],
            [
                7322,
                7326
            ],
            [
                7330,
                7332
            ],
            [
                7333,
                7337
            ],
            [
                7338,
                7389
            ],
            [
                7389,
                7415
            ],
            [
                7416,
                7445
            ],
            [
                7445,
                7447
            ],
            [
                7447,
                7473
            ],
            [
                7482,
                7507
            ],
            [
                7523,
                7525
            ],
            [
                7526,
                7607
            ],
            [
                7608,
                7632
            ],
            [
                7632,
                7680
            ],
            [
                7680,
                7689
            ],
            [
                7689,
                7691
            ],
            [
                7691,
                7735
            ],
            [
                7735,
                7785
            ],
            [
                7787,
                7791
            ],
            [
                7792,
                7799
            ],
            [
                7800,
                7813
            ],
            [
                7813,
                7854
            ],
            [
                7854,
                7888
            ],
            [
                7888,
                7890
            ],
            [
                7890,
                7914
            ],
            [
                7919,
                7935
            ],
            [
                7935,
                7989
            ],
            [
                7990,
                7999
            ],
            [
                7999,
                8001
            ],
            [
                8001,
                8025
            ],
            [
                8025,
                8080
            ],
            [
                8080,
                8086
            ],
            [
                8087,
                8126
            ],
            [
                8126,
                8192
            ],
            [
                8195,
                8226
            ],
            [
                8232,
                8251
            ],
            [
                8251,
                8256
            ],
            [
                8257,
                8274
            ],
            [
                8277,
                8280
            ],
            [
                8281,
                8322
            ],
            [
                8325,
                8326
            ],
            [
                8326,
                8367
            ],
            [
                8367,
                8383
            ],
            [
                8383,
                8427
            ],
            [
                8429,
                8531
            ],
            [
                8531,
                8558
            ],
            [
                8558,
                8562
            ],
            [
                8563,
                8581
            ],
            [
                8581,
                8582
            ],
            [
                8582,
                8628
            ],
            [
                8628,
                8656
            ],
            [
                8656,
                8694
            ],
            [
                8694,
                8728
            ],
            [
                8740,
                8745
            ],
            [
                8745,
                8747
            ],
            [
                8747,
                8759
            ],
            [
                8760,
                8766
            ],
            [
                8767,
                8778
            ],
            [
                8785,
                8792
            ],
            [
                8793,
                8813
            ],
            [
                8826,
                8838
            ],
            [
                8839,
                8847
            ],
            [
                8847,
                8849
            ],
            [
                8849,
                8875
            ],
            [
                8876,
                8882
            ],
            [
                8888,
                8892
            ],
            [
                8893,
                8935
            ],
            [
                8936,
                8952
            ],
            [
                8953,
                9010
            ],
            [
                9010,
                9011
            ],
            [
                9012,
                9053
            ],
            [
                9053,
                9069
            ],
            [
                9070,
                9094
            ],
            [
                9094,
                9106
            ],
            [
                9107,
                9109
            ],
            [
                9109,
                9110
            ],
            [
                9111,
                9147
            ],
            [
                9148,
                9177
            ],
            [
                9177,
                9219
            ],
            [
                9225,
                9242
            ],
            [
                9242,
                9283
            ],
            [
                9283,
                9286
            ],
            [
                9287,
                9338
            ],
            [
                9343,
                9353
            ],
            [
                9359,
                9386
            ],
            [
                9386,
                9448
            ],
            [
                9448,
                9451
            ],
            [
                9451,
                9490
            ],
            [
                9490,
                9509
            ],
            [
                9509,
                9529
            ],
            [
                9529,
                9613
            ],
            [
                9613,
                9656
            ],
            [
                9656,
                9662
            ],
            [
                9679,
                9705
            ],
            [
                9706,
                9710
            ],
            [
                9711,
                9745
            ],
            [
                9745,
                9762
            ],
            [
                9762,
                9834
            ],
            [
                9835,
                9837
            ],
            [
                9839,
                9849
            ],
            [
                9850,
                9866
            ],
            [
                9866,
                9892
            ],
            [
                9894,
                9897
            ],
            [
                9898,
                9930
            ],
            [
                9931,
                9960
            ],
            [
                9969,
                9980
            ],
            [
                9980,
                9982
            ],
            [
                9982,
                10041
            ],
            [
                10041,
                10100
            ],
            [
                10100,
                10103
            ],
            [
                10103,
                10259
            ],
            [
                10259,
                10261
            ],
            [
                10261,
                10346
            ],
            [
                10346,
                10348
            ],
            [
                10348,
                10379
            ],
            [
                10379,
                10402
            ],
            [
                10407,
                10468
            ],
            [
                10474,
                10478
            ],
            [
                10478,
                10514
            ],
            [
                10515,
                10567
            ]
        ],
        "row_chars": [
            [
                0,
                137
            ],
            [
                137,
                234
            ],
            [
                234,
                343
            ],
            [
                343,
                460
            ],
            [
                460,
                540
            ],
            [
                540,
                581
            ],
            [
                581,
                650
            ],
            [
                650,
                691
            ],
            [
                691,
                785
            ],
            [
                785,
                878
            ],
            [
                878,
                878
            ],
            [
                878,
                878
            ],
            [
                878,
                878
            ],
            [
                878,
                878
            ],
            [
                878,
                958
            ],
            [
                958,
                958
            ],
            [
                958,
                1157
            ],
            [
                1157,
                1157
            ],
            [
                1157,
                1157
            ],
            [
                1157,
                1381
            ],
            [
                1381,
                1381
            ],
            [
                1381,
                1492
            ],
            [
                1492,
                1542
            ],
            [
                1542,
                1670
            ],
            [
                1670,
                1861
            ],
            [
                1861,
                1967
            ],
            [
                1967,
                2092
            ],
            [
                2092,
                2106
            ],
            [
                2106,
                2154
            ],
            [
                2154,
                2154
            ],
            [
                2154,
                2194
            ],
            [
                2194,
                2194
            ],
            [
                2194,
                2282
            ],
            [
                2282,
                2323
            ],
            [
                2323,
                2497
            ],
            [
                2497,
                2531
            ],
            [
                2531,
                2658
            ],
            [
                2658,
                2720
            ],
            [
                2720,
                2764
            ],
            [
                2764,
                2859
            ],
            [
                2859,
                3005
            ],
            [
                3005,
                3067
            ],
            [
                3067,
                3166
            ],
            [
                3166,
                3238
            ],
            [
                3238,
                3335
            ],
            [
                3335,
                3428
            ],
            [
                3428,
                3527
            ],
            [
                3527,
                3653
            ],
            [
                3653,
                3726
            ],
            [
                3726,
                3726
            ],
            [
                3726,
                3798
            ],
            [
                3798,
                3875
            ],
            [
                3875,
                3875
            ],
            [
                3875,
                4067
            ],
            [
                4067,
                4148
            ],
            [
                4148,
                4234
            ],
            [
                4234,
                4234
            ],
            [
                4234,
                4285
            ],
            [
                4285,
                4383
            ],
            [
                4383,
                4383
            ],
            [
                4383,
                4437
            ],
            [
                4437,
                4537
            ],
            [
                4537,
                4606
            ],
            [
                4606,
                4635
            ],
            [
                4635,
                4651
            ],
            [
                4651,
                4651
            ],
            [
                4651,
                4670
            ],
            [
                4670,
                4670
            ],
            [
                4670,
                4670
            ],
            [
                4670,
                4670
            ],
            [
                4670,
                4697
            ],
            [
                4697,
                4744
            ],
            [
                4744,
                4763
            ],
            [
                4763,
                4873
            ],
            [
                4873,
                4937
            ],
            [
                4937,
                4986
            ],
            [
                4986,
                5053
            ],
            [
                5053,
                5154
            ],
            [
                5154,
                5257
            ],
            [
                5257,
                5396
            ],
            [
                5396,
                5532
            ],
            [
                5532,
                5718
            ],
            [
                5718,
                5838
            ],
            [
                5838,
                6000
            ],
            [
                6000,
                6113
            ],
            [
                6113,
                6272
            ],
            [
                6272,
                6272
            ],
            [
                6272,
                6272
            ],
            [
                6272,
                6328
            ],
            [
                6328,
                6398
            ],
            [
                6398,
                6451
            ],
            [
                6451,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6643
            ],
            [
                6643,
                6643
            ],
            [
                6643,
                6695
            ],
            [
                6695,
                6749
            ],
            [
                6749,
                6829
            ],
            [
                6829,
                6829
            ],
            [
                6829,
                6829
            ],
            [
                6829,
                6863
            ],
            [
                6863,
                6873
            ],
            [
                6873,
                6923
            ],
            [
                6923,
                6978
            ],
            [
                6978,
                7053
            ],
            [
                7053,
                7131
            ],
            [
                7131,
                7131
            ],
            [
                7131,
                7189
            ],
            [
                7189,
                7256
            ],
            [
                7256,
                7301
            ],
            [
                7301,
                7389
            ],
            [
                7389,
                7447
            ],
            [
                7447,
                7482
            ],
            [
                7482,
                7525
            ],
            [
                7525,
                7632
            ],
            [
                7632,
                7680
            ],
            [
                7680,
                7691
            ],
            [
                7691,
                7735
            ],
            [
                7735,
                7813
            ],
            [
                7813,
                7854
            ],
            [
                7854,
                7854
            ],
            [
                7854,
                7890
            ],
            [
                7890,
                7935
            ],
            [
                7935,
                7989
            ],
            [
                7989,
                7989
            ],
            [
                7989,
                8001
            ],
            [
                8001,
                8025
            ],
            [
                8025,
                8080
            ],
            [
                8080,
                8126
            ],
            [
                8126,
                8195
            ],
            [
                8195,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8367
            ],
            [
                8367,
                8383
            ],
            [
                8383,
                8383
            ],
            [
                8383,
                8383
            ],
            [
                8383,
                8429
            ],
            [
                8429,
                8429
            ],
            [
                8429,
                8429
            ],
            [
                8429,
                8531
            ],
            [
                8531,
                8558
            ],
            [
                8558,
                8581
            ],
            [
                8581,
                8628
            ],
            [
                8628,
                8656
            ],
            [
                8656,
                8747
            ],
            [
                8747,
                8849
            ],
            [
                8849,
                9012
            ],
            [
                9012,
                9012
            ],
            [
                9012,
                9012
            ],
            [
                9012,
                9094
            ],
            [
                9094,
                9177
            ],
            [
                9177,
                9242
            ],
            [
                9242,
                9283
            ],
            [
                9283,
                9386
            ],
            [
                9386,
                9451
            ],
            [
                9451,
                9490
            ],
            [
                9490,
                9509
            ],
            [
                9509,
                9529
            ],
            [
                9529,
                9613
            ],
            [
                9613,
                9656
            ],
            [
                9656,
                9745
            ],
            [
                9745,
                9839
            ],
            [
                9839,
                9839
            ],
            [
                9839,
                9866
            ],
            [
                9866,
                9866
            ],
            [
                9866,
                9866
            ],
            [
                9866,
                9894
            ],
            [
                9894,
                9894
            ],
            [
                9894,
                9931
            ],
            [
                9931,
                9982
            ],
            [
                9982,
                10041
            ],
            [
                10041,
                10103
            ],
            [
                10103,
                10103
            ],
            [
                10103,
                10261
            ],
            [
                10261,
                10348
            ],
            [
                10348,
                10379
            ],
            [
                10379,
                10402
            ],
            [
                10402,
                10478
            ],
            [
                10478,
                10567
            ]
        ]
    }
}