{
    "original": {
        "text": "Mr. Alf's central committee-room was in Great George Street, and there the battle was kept alive all the day. It had been decided, as the reader has been told, that no direct advantage should be taken of that loud blast of accusation which had been heard throughout the town on the previous afternoon. There had not been sufficient time for inquiry as to the truth of that blast. If there were just ground for the things that had been said, Mr. Melmotte would no doubt soon be in gaol, or would be--wanted. Many had thought that he would escape as soon as the dinner was over, and had been disappointed when they heard that he had been seen walking down towards his own committee-room on the following morning. Others had been told that at the last moment his name would be withdrawn,--and a question arose as to whether he had the legal power to withdraw his name after a certain hour on the day before the ballot. An effort was made to convince a portion of the electors that he had withdrawn, or would have withdrawn, or should have withdrawn. When Melmotte was at Covent Garden, a large throng of men went to Whitehall Place with the view of ascertaining the truth. He certainly had made no attempt at withdrawal. They who propagated this report certainly damaged Mr. Alf's cause. A second reaction set in, and there grew a feeling that Mr. Melmotte was being ill-used. Those evil things had been said of him,--many at least so declared,--not from any true motive, but simply to secure Mr. Alf's return. Tidings of the speech in Covent Garden were spread about at the various polling places, and did good service to the so-called Conservative cause. Mr. Alf's friends, hearing all this, instigated him also to make a speech. Something should be said, if only that it might be reported in the newspapers, to show that they had behaved with generosity, instead of having injured their enemy by false attacks. Whatever Mr. Alf might say, he might at any rate be sure of a favourable reporter.\nAbout two o'clock in the day, Mr. Alf did make a speech,--and a very good speech it was, if correctly reported in the \"Evening Pulpit.\" Mr. Alf was a clever man, ready at all points, with all his powers immediately at command, and, no doubt, he did make a good speech. But in this speech, in which we may presume that it would be his intention to convince the electors that they ought to return him to Parliament, because, of the two candidates, he was the fittest to represent their views, he did not say a word as to his own political ideas, not, indeed, a word that could be accepted as manifesting his own fitness for the place which it was his ambition to fill. He contented himself with endeavouring to show that the other man was not fit;--and that he and his friends, though solicitous of proving to the electors that Mr. Melmotte was about the most unfit man in the world, had been guilty of nothing shabby in their manner of doing so. \"Mr. Melmotte,\" he said, \"comes before you as a Conservative, and has told us, by the mouths of his friends,--for he has not favoured us with many words of his own,--that he is supported by the whole Conservative party. That party is not my party, but I respect it. Where, however, are these Conservative supporters? We have heard, till we are sick of it, of the banquet which Mr. Melmotte gave yesterday. I am told that very few of those whom he calls his Conservative friends could be induced to attend that banquet. It is equally notorious that the leading merchants of the City refused to grace the table of this great commercial prince. I say that the leaders of the Conservative party have at last found their candidate out, have repudiated him;--and are seeking now to free themselves from the individual shame of having supported the candidature of such a man by remaining in their own houses instead of clustering round the polling booths. Go to Mr. Melmotte's committee-room and inquire if those leading Conservatives be there. Look about, and see whether they are walking with him in the streets, or standing with him in public places, or taking the air with him in the parks. I respect the leaders of the Conservative party; but they have made a mistake in this matter, and they know it.\" Then he ended by alluding to the rumours of yesterday. \"I scorn,\" said he, \"to say anything against the personal character of a political opponent, which I am not in a position to prove. I make no allusion, and have made no allusion, to reports which were circulated yesterday about him, and which I believe were originated in the City. They may be false or they may be true. As I know nothing of the matter, I prefer to regard them as false, and I recommend you to do the same. But I declared to you long before these reports were in men's mouths, that Mr. Melmotte was not entitled by his character to represent you in parliament, and I repeat that assertion. A great British merchant, indeed! How long, do you think, should a man be known in this city before that title be accorded to him? Who knew aught of this man two years since,--unless, indeed, it be some one who had burnt his wings in trafficking with him in some continental city? Ask the character of this great British merchant in Hamburg and Vienna; ask it in Paris;--ask those whose business here has connected them with the assurance companies of foreign countries, and you will be told whether this is a fit man to represent Westminster in the British parliament!\" There was much more yet; but such was the tone of the speech which Mr. Alf made with the object of inducing the electors to vote for himself.\nAt two or three o'clock in the day, nobody knew how the matter was going. It was supposed that the working-classes were in favour of Melmotte, partly from their love of a man who spends a great deal of money, partly from the belief that he was being ill-used,--partly, no doubt, from that occult sympathy which is felt for crime, when the crime committed is injurious to the upper classes. Masses of men will almost feel that a certain amount of injustice ought to be inflicted on their betters, so as to make things even, and will persuade themselves that a criminal should be declared to be innocent, because the crime committed has had a tendency to oppress the rich and pull down the mighty from their seats. Some few years since, the basest calumnies that were ever published in this country, uttered by one of the basest men that ever disgraced the country, levelled, for the most part, at men of whose characters and services the country was proud, were received with a certain amount of sympathy by men not themselves dishonest, because they who were thus slandered had received so many good things from Fortune, that a few evil things were thought to be due to them. There had not as yet been time for the formation of such a feeling generally, in respect of Mr. Melmotte. But there was a commencement of it. It had been asserted that Melmotte was a public robber. Whom had he robbed? Not the poor. There was not a man in London who caused the payment of a larger sum in weekly wages than Mr. Melmotte.\nAbout three o'clock, the editor of the \"Morning Breakfast Table\" called on Lady Carbury. \"What is it all about?\" she asked, as soon as her friend was seated. There had been no time for him to explain anything at Madame Melmotte's reception, and Lady Carbury had as yet failed in learning any certain news of what was going on.\n\"I don't know what to make of it,\" said Mr. Broune. \"There is a story abroad that Mr. Melmotte has forged some document with reference to a purchase he made,--and hanging on to that story are other stories as to moneys that he has raised. I should say that it was simply an electioneering trick, and a very unfair trick, were it not that all his own side seem to believe it.\"\n\"Do you believe it?\"\n\"Ah,--I could answer almost any question sooner than that.\"\n\"Then he can't be rich at all.\"\n\"Even that would not follow. He has such large concerns in hand that he might be very much pressed for funds, and yet be possessed of immense wealth. Everybody says that he pays all his bills.\"\n\"Will he be returned?\" she asked.\n\"From what we hear, we think not. I shall know more about it in an hour or two. At present I should not like to have to publish an opinion; but were I forced to bet, I would bet against him. Nobody is doing anything for him. There can be no doubt that his own party are ashamed of him. As things used to be, this would have been fatal to him at the day of election; but now, with the ballot, it won't matter so much. If I were a candidate, at present, I think I would go to bed on the last day, and beg all my committee to do the same as soon as they had put in their voting papers.\"\n\"I am glad Felix did not go to Liverpool,\" said Lady Carbury.\n\"It would not have made much difference. She would have been brought back all the same. They say Lord Nidderdale still means to marry her.\"\n\"I saw him talking to her last night.\"\n\"There must be an immense amount of property somewhere. No one doubts that he was rich when he came to England two years ago, and they say everything has prospered that he has put his hand to since. The Mexican Railway shares had fallen this morning, but they were at 15 premium yesterday morning. He must have made an enormous deal out of that.\" But Mr. Broune's eloquence on this occasion was chiefly displayed in regard to the presumption of Mr. Alf. \"I shouldn't think him such a fool if he had announced his resignation of the editorship when he came before the world as a candidate for parliament. But a man must be mad who imagines that he can sit for Westminster and edit a London daily paper at the same time.\"\n\"Has it never been done?\"\n\"Never, I think;--that is, by the editor of such a paper as the 'Pulpit.' How is a man who sits in parliament himself ever to pretend to discuss the doings of parliament with impartiality? But Alf believes that he can do more than anybody else ever did, and he'll come to the ground. Where's Felix now?\"\n\"Do not ask me,\" said the poor mother.\n\"Is he doing anything?\"\n\"He lies in bed all day, and is out all night.\"\n\"But that wants money.\" She only shook her head. \"You do not give him any?\"\n\"I have none to give.\"\n\"I should simply take the key of the house from him,--or bolt the door if he will not give it up.\"\n\"And be in bed, and listen while he knocks,--knowing that he must wander in the streets if I refuse to let him in? A mother cannot do that, Mr. Broune. A child has such a hold upon his mother. When her reason has bade her to condemn him, her heart will not let her carry out the sentence.\" Mr. Broune never now thought of kissing Lady Carbury; but when she spoke thus, he got up and took her hand, and she, as she pressed his hand, had no fear that she would be kissed. The feeling between them was changed.\nMelmotte dined at home that evening with no company but that of his wife and daughter. Latterly one of the Grendalls had almost always joined their party when they did not dine out. Indeed, it was an understood thing, that Miles Grendall should dine there always, unless he explained his absence by some engagement,--so that his presence there had come to be considered as a part of his duty. Not unfrequently \"Alfred\" and Miles would both come, as Melmotte's dinners and wines were good, and occasionally the father would take the son's place,--but on this day they were both absent. Madame Melmotte had not as yet said a word to any one indicating her own apprehension of any evil. But not a person had called to-day,--the day after the great party,--and even she, though she was naturally callous in such matters, had begun to think that she was deserted. She had, too, become so used to the presence of the Grendalls, that she now missed their company. She thought that on this day, of all days, when the world was balloting for her husband at Westminster, they would both have been with him to discuss the work of the day. \"Is not Mr. Grendall coming?\" she asked, as she took her seat at the table.\n\"No, he is not,\" said Melmotte.\n\"Nor Lord Alfred?\"\n\"Nor Lord Alfred.\" Melmotte had returned home much comforted by the day's proceedings. No one had dared to say a harsh word to his face. Nothing further had reached his ears. After leaving the bank he had gone back to his office, and had written letters,--just as if nothing had happened; and, as far as he could judge, his clerks had plucked up courage. One of them, about five o'clock, came into him with news from the west, and with second editions of the evening papers. The clerk expressed his opinion that the election was going well. Mr. Melmotte, judging from the papers, one of which was supposed to be on his side and the other of course against him, thought that his affairs altogether were looking well. The Westminster election had not the foremost place in his thoughts; but he took what was said on that subject as indicating the minds of men upon the other matter. He read Alf's speech, and consoled himself with thinking that Mr. Alf had not dared to make new accusations against him. All that about Hamburgh and Vienna and Paris was as old as the hills, and availed nothing. His whole candidature had been carried in the face of that. \"I think we shall do pretty well,\" he said to the clerk. His very presence in Abchurch Lane of course gave confidence. And thus, when he came home, something of the old arrogance had come back upon him, and he could swagger at any rate before his wife and servants. \"Nor Lord Alfred,\" he said with scorn. Then he added more. \"The father and son are two d---- curs.\" This of course frightened Madame Melmotte, and she joined this desertion of the Grendalls to her own solitude all the day.\n\"Is there anything wrong, Melmotte?\" she said afterwards, creeping up to him in the back parlour, and speaking in French.\n\"What do you call wrong?\"\n\"I don't know;--but I seem to be afraid of something.\"\n\"I should have thought you were used to that kind of feeling by this time.\"\n\"Then there is something.\"\n\"Don't be a fool. There is always something. There is always much. You don't suppose that this kind of thing can be carried on as smoothly as the life of an old maid with 400 a year paid quarterly in advance.\"\n\"Shall we have to--move again?\" she asked.\n\"How am I to tell? You haven't much to do when we move, and may get plenty to eat and drink wherever you go. Does that girl mean to marry Lord Nidderdale?\" Madame Melmotte shook her head. \"What a poor creature you must be when you can't talk her out of a fancy for such a reprobate as young Carbury. If she throws me over, I'll throw her over. I'll flog her within an inch of her life if she disobeys me. You tell her that I say so.\"\n\"Then he may flog me,\" said Marie, when so much of the conversation was repeated to her that evening. \"Papa does not know me if he thinks that I'm to be made to marry a man by flogging.\" No such attempt was at any rate made that night, for the father and husband did not again see his wife or daughter.\nEarly the next day a report was current that Mr. Alf had been returned. The numbers had not as yet been counted, or the books made up;--but that was the opinion expressed. All the morning newspapers, including the \"Breakfast Table,\" repeated this report,--but each gave it as the general opinion on the matter. The truth would not be known till seven or eight o'clock in the evening. The Conservative papers did not scruple to say that the presumed election of Mr. Alf was owing to a sudden declension in the confidence originally felt in Mr. Melmotte. The \"Breakfast Table,\" which had supported Mr. Melmotte's candidature, gave no reason, and expressed more doubt on the result than the other papers. \"We know not how such an opinion forms itself,\" the writer said;--\"but it seems to have been formed. As nothing as yet is really known, or can be known, we express no opinion of our own upon the matter.\"\nMr. Melmotte again went into the City, and found that things seemed to have returned very much into their usual grooves. The Mexican Railway shares were low, and Mr. Cohenlupe was depressed in spirits and unhappy;--but nothing dreadful had occurred or seemed to be threatened. If nothing dreadful did occur, the railway shares would probably recover, or nearly recover, their position. In the course of the day, Melmotte received a letter from Messrs. Slow and Bideawhile, which, of itself, certainly contained no comfort;--but there was comfort to be drawn even from that letter, by reason of what it did not contain. The letter was unfriendly in its tone and peremptory. It had come evidently from a hostile party. It had none of the feeling which had hitherto prevailed in the intercourse between these two well-known Conservative gentlemen, Mr. Adolphus Longestaffe and Mr. Augustus Melmotte. But there was no allusion in it to forgery; no question of criminal proceedings; no hint at aught beyond the not unnatural desire of Mr. Longestaffe and Mr. Longestaffe's son to be paid for the property at Pickering which Mr. Melmotte had purchased.\n\"We have to remind you,\" said the letter, in continuation of paragraphs which had contained simply demands for the money, \"that the title-deeds were delivered to you on receipt by us of authority to that effect from the Messrs. Longestaffe, father and son, on the understanding that the purchase-money was to be at once paid to us by you. We are informed that the property has been since mortgaged by you. We do not state this as a fact. But the information, whether true or untrue, forces upon us the necessity of demanding that you should at once pay to us the purchase-money,--80,000,--or else return to us the title-deeds of the estate.\"\nThis letter, which was signed Slow and Bideawhile, declared positively that the title-deeds had been given up on authority received by them from both the Longestaffes,--father and son. Now the accusation brought against Melmotte, as far as he could as yet understand it, was that he had forged the signature to the young Mr. Longestaffe's letter. Messrs. Slow and Bideawhile were therefore on his side. As to the simple debt, he cared little comparatively about that. Many fine men were walking about London who owed large sums of money which they could not pay.\nAs he was sitting at his solitary dinner this evening,--for both his wife and daughter had declined to join him, saying that they had dined early,--news was brought to him that he had been elected for Westminster. He had beaten Mr. Alf by something not much less than a thousand votes.\nIt was very much to be member for Westminster. So much had at any rate been achieved by him who had begun the world without a shilling and without a friend,--almost without education! Much as he loved money, and much as he loved the spending of money, and much as he had made and much as he had spent, no triumph of his life had been so great to him as this. Brought into the world in a gutter, without father or mother, with no good thing ever done for him, he was now a member of the British Parliament, and member for one of the first cities in the empire. Ignorant as he was he understood the magnitude of the achievement, and dismayed as he was as to his present position, still at this moment he enjoyed keenly a certain amount of elation. Of course he had committed forgery;--of course he had committed robbery. That, indeed, was nothing, for he had been cheating and forging and stealing all his life. Of course he was in danger of almost immediate detection and punishment. He hardly hoped that the evil day would be very much longer protracted, and yet he enjoyed his triumph. Whatever they might do, quick as they might be, they could hardly prevent his taking his seat in the House of Commons. Then if they sent him to penal servitude for life, they would have to say that they had so treated the member for Westminster!\nHe drank a bottle of claret, and then got some brandy-and-water. In such troubles as were coming upon him now, he would hardly get sufficient support from wine. He knew that he had better not drink;--that is, he had better not drink, supposing the world to be free to him for his own work and his own enjoyment. But if the world were no longer free to him, if he were really coming to penal servitude and annihilation,--then why should he not drink while the time lasted? An hour of triumphant joy might be an eternity to a man, if the man's imagination were strong enough to make him so regard his hour. He therefore took his brandy-and-water freely, and as he took it he was able to throw his fears behind him, and to assure himself that, after all, he might even yet escape from his bondages. No;--he would drink no more. This he said to himself as he filled another beaker. He would work instead. He would put his shoulder to the wheel, and would yet conquer his enemies. It would not be so easy to convict a member for Westminster,--especially if money were spent freely. Was he not the man who, at his own cost, had entertained the Emperor of China? Would not that be remembered in his favour? Would not men be unwilling to punish the man who had received at his own table all the Princes of the land, and the Prime Minister, and all the Ministers? To convict him would be a national disgrace. He fully realised all this as he lifted the glass to his mouth, and puffed out the smoke in large volumes through his lips. But money must be spent! Yes;--money must be had! Cohenlupe certainly had money. Though he squeezed it out of the coward's veins he would have it. At any rate, he would not despair. There was a fight to be fought yet, and he would fight it to the end. Then he took a deep drink, and slowly, with careful and almost solemn steps, he made his way up to his bed.",
        "paragraph_chars": [
            [
                0,
                1994
            ],
            [
                1994,
                5615
            ],
            [
                5615,
                7127
            ],
            [
                7127,
                7454
            ],
            [
                7454,
                7830
            ],
            [
                7830,
                7851
            ],
            [
                7851,
                7911
            ],
            [
                7911,
                7943
            ],
            [
                7943,
                8137
            ],
            [
                8137,
                8171
            ],
            [
                8171,
                8755
            ],
            [
                8755,
                8817
            ],
            [
                8817,
                8957
            ],
            [
                8957,
                8996
            ],
            [
                8996,
                9716
            ],
            [
                9716,
                9742
            ],
            [
                9742,
                10046
            ],
            [
                10046,
                10085
            ],
            [
                10085,
                10109
            ],
            [
                10109,
                10157
            ],
            [
                10157,
                10233
            ],
            [
                10233,
                10256
            ],
            [
                10256,
                10355
            ],
            [
                10355,
                10863
            ],
            [
                10863,
                12067
            ],
            [
                12067,
                12099
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                13760
            ],
            [
                13760,
                13882
            ],
            [
                13882,
                13908
            ],
            [
                13908,
                13963
            ],
            [
                13963,
                14039
            ],
            [
                14039,
                14066
            ],
            [
                14066,
                14276
            ],
            [
                14276,
                14319
            ],
            [
                14319,
                14753
            ],
            [
                14753,
                15056
            ],
            [
                15056,
                15962
            ],
            [
                15962,
                17109
            ],
            [
                17109,
                17751
            ],
            [
                17751,
                18314
            ],
            [
                18314,
                18600
            ],
            [
                18600,
                19933
            ],
            [
                19933,
                21816
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                302
            ],
            [
                302,
                380
            ],
            [
                380,
                507
            ],
            [
                507,
                711
            ],
            [
                711,
                916
            ],
            [
                916,
                1047
            ],
            [
                1047,
                1170
            ],
            [
                1170,
                1218
            ],
            [
                1218,
                1285
            ],
            [
                1285,
                1374
            ],
            [
                1374,
                1508
            ],
            [
                1508,
                1654
            ],
            [
                1654,
                1729
            ],
            [
                1729,
                1911
            ],
            [
                1911,
                1994
            ],
            [
                1994,
                2130
            ],
            [
                2130,
                2263
            ],
            [
                2263,
                2661
            ],
            [
                2661,
                2939
            ],
            [
                2939,
                3159
            ],
            [
                3159,
                3205
            ],
            [
                3205,
                3256
            ],
            [
                3256,
                3345
            ],
            [
                3345,
                3458
            ],
            [
                3458,
                3581
            ],
            [
                3581,
                3888
            ],
            [
                3888,
                3977
            ],
            [
                3977,
                4127
            ],
            [
                4127,
                4240
            ],
            [
                4240,
                4295
            ],
            [
                4295,
                4427
            ],
            [
                4427,
                4577
            ],
            [
                4577,
                4616
            ],
            [
                4616,
                4719
            ],
            [
                4719,
                4902
            ],
            [
                4902,
                4936
            ],
            [
                4936,
                5033
            ],
            [
                5033,
                5183
            ],
            [
                5183,
                5473
            ],
            [
                5473,
                5615
            ],
            [
                5615,
                5689
            ],
            [
                5689,
                6005
            ],
            [
                6005,
                6328
            ],
            [
                6328,
                6791
            ],
            [
                6791,
                6897
            ],
            [
                6897,
                6933
            ],
            [
                6933,
                6989
            ],
            [
                6989,
                7009
            ],
            [
                7009,
                7023
            ],
            [
                7023,
                7127
            ],
            [
                7127,
                7216
            ],
            [
                7216,
                7240
            ],
            [
                7240,
                7285
            ],
            [
                7285,
                7454
            ],
            [
                7454,
                7506
            ],
            [
                7506,
                7693
            ],
            [
                7693,
                7830
            ],
            [
                7830,
                7851
            ],
            [
                7851,
                7911
            ],
            [
                7911,
                7943
            ],
            [
                7943,
                7972
            ],
            [
                7972,
                8093
            ],
            [
                8093,
                8137
            ],
            [
                8137,
                8160
            ],
            [
                8160,
                8171
            ],
            [
                8171,
                8205
            ],
            [
                8205,
                8251
            ],
            [
                8251,
                8362
            ],
            [
                8362,
                8396
            ],
            [
                8396,
                8457
            ],
            [
                8457,
                8588
            ],
            [
                8588,
                8755
            ],
            [
                8755,
                8817
            ],
            [
                8817,
                8858
            ],
            [
                8858,
                8905
            ],
            [
                8905,
                8957
            ],
            [
                8957,
                8996
            ],
            [
                8996,
                9052
            ],
            [
                9052,
                9195
            ],
            [
                9195,
                9294
            ],
            [
                9294,
                9343
            ],
            [
                9343,
                9450
            ],
            [
                9450,
                9600
            ],
            [
                9600,
                9716
            ],
            [
                9716,
                9742
            ],
            [
                9742,
                9816
            ],
            [
                9816,
                9931
            ],
            [
                9931,
                10026
            ],
            [
                10026,
                10046
            ],
            [
                10046,
                10085
            ],
            [
                10085,
                10109
            ],
            [
                10109,
                10157
            ],
            [
                10157,
                10181
            ],
            [
                10181,
                10206
            ],
            [
                10206,
                10233
            ],
            [
                10233,
                10256
            ],
            [
                10256,
                10355
            ],
            [
                10355,
                10470
            ],
            [
                10470,
                10507
            ],
            [
                10507,
                10548
            ],
            [
                10548,
                10645
            ],
            [
                10645,
                10825
            ],
            [
                10825,
                10863
            ],
            [
                10863,
                10950
            ],
            [
                10950,
                11045
            ],
            [
                11045,
                11256
            ],
            [
                11256,
                11448
            ],
            [
                11448,
                11547
            ],
            [
                11547,
                11722
            ],
            [
                11722,
                11820
            ],
            [
                11820,
                11991
            ],
            [
                11991,
                12021
            ],
            [
                12021,
                12067
            ],
            [
                12067,
                12099
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                12137
            ],
            [
                12137,
                12205
            ],
            [
                12205,
                12255
            ],
            [
                12255,
                12293
            ],
            [
                12293,
                12473
            ],
            [
                12473,
                12593
            ],
            [
                12593,
                12659
            ],
            [
                12659,
                12834
            ],
            [
                12834,
                12999
            ],
            [
                12999,
                13120
            ],
            [
                13120,
                13211
            ],
            [
                13211,
                13271
            ],
            [
                13271,
                13328
            ],
            [
                13328,
                13390
            ],
            [
                13390,
                13537
            ],
            [
                13537,
                13576
            ],
            [
                13576,
                13596
            ],
            [
                13596,
                13637
            ],
            [
                13637,
                13760
            ],
            [
                13760,
                13797
            ],
            [
                13797,
                13882
            ],
            [
                13882,
                13908
            ],
            [
                13908,
                13963
            ],
            [
                13963,
                14039
            ],
            [
                14039,
                14066
            ],
            [
                14066,
                14084
            ],
            [
                14084,
                14111
            ],
            [
                14111,
                14133
            ],
            [
                14133,
                14276
            ],
            [
                14276,
                14308
            ],
            [
                14308,
                14319
            ],
            [
                14319,
                14338
            ],
            [
                14338,
                14428
            ],
            [
                14428,
                14475
            ],
            [
                14475,
                14507
            ],
            [
                14507,
                14619
            ],
            [
                14619,
                14663
            ],
            [
                14663,
                14724
            ],
            [
                14724,
                14753
            ],
            [
                14753,
                14855
            ],
            [
                14855,
                14940
            ],
            [
                14940,
                15056
            ],
            [
                15056,
                15128
            ],
            [
                15128,
                15228
            ],
            [
                15228,
                15367
            ],
            [
                15367,
                15440
            ],
            [
                15440,
                15609
            ],
            [
                15609,
                15758
            ],
            [
                15758,
                15859
            ],
            [
                15859,
                15962
            ],
            [
                15962,
                16083
            ],
            [
                16083,
                16239
            ],
            [
                16239,
                16348
            ],
            [
                16348,
                16581
            ],
            [
                16581,
                16635
            ],
            [
                16635,
                16679
            ],
            [
                16679,
                16859
            ],
            [
                16859,
                17109
            ],
            [
                17109,
                17448
            ],
            [
                17448,
                17515
            ],
            [
                17515,
                17547
            ],
            [
                17547,
                17751
            ],
            [
                17751,
                17936
            ],
            [
                17936,
                18098
            ],
            [
                18098,
                18154
            ],
            [
                18154,
                18219
            ],
            [
                18219,
                18314
            ],
            [
                18314,
                18528
            ],
            [
                18528,
                18600
            ],
            [
                18600,
                18647
            ],
            [
                18647,
                18784
            ],
            [
                18784,
                18959
            ],
            [
                18959,
                19160
            ],
            [
                19160,
                19346
            ],
            [
                19346,
                19419
            ],
            [
                19419,
                19510
            ],
            [
                19510,
                19583
            ],
            [
                19583,
                19687
            ],
            [
                19687,
                19806
            ],
            [
                19806,
                19933
            ],
            [
                19933,
                19998
            ],
            [
                19998,
                20094
            ],
            [
                20094,
                20245
            ],
            [
                20245,
                20405
            ],
            [
                20405,
                20538
            ],
            [
                20538,
                20729
            ],
            [
                20729,
                20758
            ],
            [
                20758,
                20811
            ],
            [
                20811,
                20834
            ],
            [
                20834,
                20909
            ],
            [
                20909,
                21010
            ],
            [
                21010,
                21089
            ],
            [
                21089,
                21133
            ],
            [
                21133,
                21288
            ],
            [
                21288,
                21333
            ],
            [
                21333,
                21457
            ],
            [
                21457,
                21482
            ],
            [
                21482,
                21507
            ],
            [
                21507,
                21538
            ],
            [
                21538,
                21604
            ],
            [
                21604,
                21639
            ],
            [
                21639,
                21709
            ],
            [
                21709,
                21816
            ]
        ],
        "overlap_chars": [
            [
                0,
                100
            ],
            [
                105,
                110
            ],
            [
                110,
                129
            ],
            [
                160,
                203
            ],
            [
                134,
                137
            ],
            [
                129,
                130
            ],
            [
                337,
                340
            ],
            [
                302,
                320
            ],
            [
                332,
                336
            ],
            [
                352,
                354
            ],
            [
                359,
                364
            ],
            [
                378,
                380
            ],
            [
                380,
                382
            ],
            [
                439,
                479
            ],
            [
                505,
                506
            ],
            [
                507,
                648
            ],
            [
                654,
                711
            ],
            [
                916,
                946
            ],
            [
                964,
                994
            ],
            [
                1045,
                1047
            ],
            [
                1047,
                1128
            ],
            [
                1170,
                1172
            ],
            [
                1183,
                1217
            ],
            [
                1218,
                1285
            ],
            [
                1326,
                1335
            ],
            [
                1321,
                1325
            ],
            [
                1336,
                1374
            ],
            [
                1374,
                1405
            ],
            [
                1415,
                1419
            ],
            [
                1432,
                1440
            ],
            [
                1473,
                1499
            ],
            [
                1506,
                1508
            ],
            [
                1516,
                1546
            ],
            [
                1552,
                1558
            ],
            [
                1594,
                1623
            ],
            [
                1634,
                1653
            ],
            [
                1654,
                1680
            ],
            [
                1685,
                1690
            ],
            [
                1702,
                1729
            ],
            [
                1729,
                1837
            ],
            [
                1881,
                1892
            ],
            [
                1909,
                1910
            ],
            [
                1994,
                2011
            ],
            [
                2022,
                2049
            ],
            [
                2052,
                2111
            ],
            [
                2121,
                2127
            ],
            [
                2263,
                2281
            ],
            [
                2485,
                2506
            ],
            [
                2513,
                2537
            ],
            [
                2596,
                2611
            ],
            [
                2338,
                2340
            ],
            [
                2321,
                2323
            ],
            [
                2551,
                2552
            ],
            [
                2417,
                2419
            ],
            [
                2396,
                2406
            ],
            [
                2659,
                2661
            ],
            [
                2661,
                2663
            ],
            [
                2700,
                2739
            ],
            [
                2741,
                2769
            ],
            [
                2862,
                2864
            ],
            [
                2799,
                2801
            ],
            [
                2820,
                2832
            ],
            [
                2874,
                2909
            ],
            [
                2937,
                2938
            ],
            [
                2939,
                3016
            ],
            [
                3105,
                3159
            ],
            [
                3205,
                3256
            ],
            [
                3256,
                3345
            ],
            [
                3345,
                3371
            ],
            [
                3392,
                3458
            ],
            [
                3487,
                3537
            ],
            [
                3542,
                3547
            ],
            [
                3579,
                3581
            ],
            [
                3581,
                3629
            ],
            [
                3696,
                3699
            ],
            [
                3757,
                3759
            ],
            [
                3655,
                3664
            ],
            [
                3886,
                3888
            ],
            [
                3977,
                4084
            ],
            [
                4125,
                4127
            ],
            [
                4180,
                4204
            ],
            [
                4219,
                4239
            ],
            [
                4245,
                4295
            ],
            [
                4427,
                4445
            ],
            [
                4474,
                4490
            ],
            [
                4496,
                4516
            ],
            [
                4526,
                4547
            ],
            [
                4553,
                4577
            ],
            [
                4577,
                4616
            ],
            [
                4719,
                4745
            ],
            [
                4789,
                4793
            ],
            [
                4798,
                4814
            ],
            [
                4841,
                4871
            ],
            [
                4900,
                4902
            ],
            [
                4902,
                4936
            ],
            [
                5033,
                5041
            ],
            [
                5048,
                5069
            ],
            [
                5181,
                5183
            ],
            [
                5183,
                5186
            ],
            [
                5232,
                5242
            ],
            [
                5247,
                5253
            ],
            [
                5265,
                5271
            ],
            [
                5373,
                5473
            ],
            [
                5507,
                5522
            ],
            [
                5540,
                5547
            ],
            [
                5527,
                5533
            ],
            [
                5613,
                5615
            ],
            [
                5615,
                5638
            ],
            [
                5649,
                5670
            ],
            [
                5678,
                5689
            ],
            [
                5689,
                5873
            ],
            [
                5986,
                6005
            ],
            [
                6933,
                6989
            ],
            [
                6989,
                7009
            ],
            [
                7009,
                7023
            ],
            [
                7023,
                7127
            ],
            [
                7127,
                7165
            ],
            [
                7167,
                7190
            ],
            [
                7192,
                7215
            ],
            [
                7216,
                7240
            ],
            [
                7240,
                7249
            ],
            [
                7283,
                7284
            ],
            [
                7454,
                7506
            ],
            [
                7506,
                7573
            ],
            [
                7613,
                7616
            ],
            [
                7642,
                7659
            ],
            [
                7673,
                7693
            ],
            [
                7693,
                7727
            ],
            [
                7761,
                7767
            ],
            [
                7728,
                7742
            ],
            [
                7768,
                7830
            ],
            [
                7830,
                7851
            ],
            [
                7851,
                7852
            ],
            [
                7857,
                7858
            ],
            [
                7908,
                7911
            ],
            [
                7911,
                7943
            ],
            [
                7943,
                7972
            ],
            [
                7972,
                8093
            ],
            [
                8093,
                8137
            ],
            [
                8137,
                8148
            ],
            [
                8157,
                8160
            ],
            [
                8160,
                8171
            ],
            [
                8251,
                8261
            ],
            [
                8337,
                8362
            ],
            [
                8362,
                8396
            ],
            [
                8396,
                8455
            ],
            [
                8755,
                8817
            ],
            [
                8817,
                8858
            ],
            [
                8858,
                8905
            ],
            [
                8905,
                8954
            ],
            [
                8997,
                9052
            ],
            [
                9052,
                9125
            ],
            [
                9195,
                9221
            ],
            [
                9256,
                9292
            ],
            [
                9245,
                9246
            ],
            [
                9126,
                9130
            ],
            [
                9226,
                9232
            ],
            [
                9188,
                9194
            ],
            [
                9294,
                9323
            ],
            [
                9329,
                9342
            ],
            [
                9343,
                9357
            ],
            [
                9387,
                9390
            ],
            [
                9441,
                9450
            ],
            [
                9604,
                9713
            ],
            [
                9823,
                9851
            ],
            [
                9868,
                9929
            ],
            [
                10026,
                10031
            ],
            [
                10034,
                10046
            ],
            [
                10046,
                10084
            ],
            [
                10109,
                10157
            ],
            [
                10206,
                10230
            ],
            [
                10173,
                10178
            ],
            [
                10230,
                10233
            ],
            [
                10233,
                10256
            ],
            [
                10256,
                10308
            ],
            [
                10310,
                10355
            ],
            [
                10355,
                10356
            ],
            [
                10400,
                10470
            ],
            [
                10470,
                10507
            ],
            [
                10507,
                10518
            ],
            [
                10524,
                10546
            ],
            [
                10645,
                10751
            ],
            [
                10765,
                10776
            ],
            [
                10791,
                10825
            ],
            [
                10825,
                10863
            ],
            [
                10863,
                10903
            ],
            [
                10927,
                10950
            ],
            [
                11448,
                11493
            ],
            [
                11513,
                11520
            ],
            [
                11545,
                11547
            ],
            [
                11547,
                11556
            ],
            [
                11557,
                11574
            ],
            [
                11577,
                11578
            ],
            [
                11584,
                11613
            ],
            [
                11616,
                11619
            ],
            [
                11820,
                11836
            ],
            [
                11770,
                11783
            ],
            [
                11929,
                11934
            ],
            [
                11940,
                11954
            ],
            [
                11896,
                11907
            ],
            [
                11850,
                11862
            ],
            [
                11754,
                11757
            ],
            [
                11720,
                11721
            ],
            [
                11991,
                12021
            ],
            [
                12021,
                12067
            ],
            [
                12067,
                12099
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                12137
            ],
            [
                12137,
                12205
            ],
            [
                12205,
                12255
            ],
            [
                12293,
                12372
            ],
            [
                12374,
                12405
            ],
            [
                12471,
                12473
            ],
            [
                12597,
                12602
            ],
            [
                12516,
                12519
            ],
            [
                12573,
                12591
            ],
            [
                12543,
                12548
            ],
            [
                12603,
                12659
            ],
            [
                13002,
                13120
            ],
            [
                13120,
                13139
            ],
            [
                13144,
                13188
            ],
            [
                13209,
                13210
            ],
            [
                13271,
                13328
            ],
            [
                13328,
                13362
            ],
            [
                13373,
                13390
            ],
            [
                13390,
                13398
            ],
            [
                13400,
                13453
            ],
            [
                13472,
                13494
            ],
            [
                13507,
                13536
            ],
            [
                13596,
                13600
            ],
            [
                13616,
                13625
            ],
            [
                13630,
                13634
            ],
            [
                13806,
                13816
            ],
            [
                13827,
                13856
            ],
            [
                13880,
                13881
            ],
            [
                13760,
                13796
            ],
            [
                13882,
                13908
            ],
            [
                13908,
                13922
            ],
            [
                13924,
                13963
            ],
            [
                13963,
                14007
            ],
            [
                14024,
                14039
            ],
            [
                14039,
                14066
            ],
            [
                14066,
                14084
            ],
            [
                14084,
                14109
            ],
            [
                14276,
                14293
            ],
            [
                14295,
                14308
            ],
            [
                14308,
                14319
            ],
            [
                14319,
                14338
            ],
            [
                14428,
                14475
            ],
            [
                14475,
                14507
            ],
            [
                14663,
                14724
            ],
            [
                14724,
                14753
            ],
            [
                14753,
                14855
            ],
            [
                14855,
                14940
            ],
            [
                14940,
                14987
            ],
            [
                15054,
                15056
            ],
            [
                15056,
                15117
            ],
            [
                15254,
                15255
            ],
            [
                15128,
                15147
            ],
            [
                15151,
                15168
            ],
            [
                15367,
                15439
            ],
            [
                15962,
                16083
            ],
            [
                16083,
                16141
            ],
            [
                16167,
                16175
            ],
            [
                16177,
                16210
            ],
            [
                16237,
                16239
            ],
            [
                16239,
                16311
            ],
            [
                16346,
                16347
            ],
            [
                16348,
                16452
            ],
            [
                16463,
                16483
            ],
            [
                16490,
                16519
            ],
            [
                16525,
                16529
            ],
            [
                16541,
                16542
            ],
            [
                16553,
                16581
            ],
            [
                16581,
                16618
            ],
            [
                16805,
                16806
            ],
            [
                16859,
                16901
            ],
            [
                16918,
                16950
            ],
            [
                16957,
                17011
            ],
            [
                17030,
                17074
            ],
            [
                17107,
                17109
            ],
            [
                17109,
                17150
            ],
            [
                17208,
                17277
            ],
            [
                17278,
                17285
            ],
            [
                17292,
                17304
            ],
            [
                17320,
                17348
            ],
            [
                17364,
                17433
            ],
            [
                17440,
                17448
            ],
            [
                17448,
                17485
            ],
            [
                17491,
                17496
            ],
            [
                17486,
                17490
            ],
            [
                17497,
                17515
            ],
            [
                17555,
                17566
            ],
            [
                17592,
                17687
            ],
            [
                17689,
                17695
            ],
            [
                17698,
                17751
            ],
            [
                17751,
                17762
            ],
            [
                17802,
                17885
            ],
            [
                17891,
                17917
            ],
            [
                17920,
                17936
            ],
            [
                17936,
                17979
            ],
            [
                18022,
                18098
            ],
            [
                18106,
                18154
            ],
            [
                18154,
                18192
            ],
            [
                18207,
                18219
            ],
            [
                18219,
                18314
            ],
            [
                18314,
                18316
            ],
            [
                18320,
                18367
            ],
            [
                18370,
                18404
            ],
            [
                18448,
                18459
            ],
            [
                18462,
                18528
            ],
            [
                18528,
                18552
            ],
            [
                18582,
                18600
            ],
            [
                18692,
                18755
            ],
            [
                18758,
                18784
            ],
            [
                18784,
                18806
            ],
            [
                18900,
                18959
            ],
            [
                18959,
                19002
            ],
            [
                19019,
                19104
            ],
            [
                19117,
                19120
            ],
            [
                19158,
                19159
            ],
            [
                19284,
                19346
            ],
            [
                19346,
                19381
            ],
            [
                19383,
                19419
            ],
            [
                19419,
                19423
            ],
            [
                19433,
                19510
            ],
            [
                19510,
                19581
            ],
            [
                19659,
                19687
            ],
            [
                19735,
                19806
            ],
            [
                19806,
                19933
            ],
            [
                19933,
                19970
            ],
            [
                19975,
                19998
            ],
            [
                20094,
                20131
            ],
            [
                20245,
                20248
            ],
            [
                20358,
                20405
            ],
            [
                20538,
                20584
            ],
            [
                20603,
                20693
            ],
            [
                20699,
                20709
            ],
            [
                20727,
                20729
            ],
            [
                20734,
                20756
            ],
            [
                20763,
                20811
            ],
            [
                20811,
                20834
            ],
            [
                20834,
                20877
            ],
            [
                20888,
                20909
            ],
            [
                20909,
                20924
            ],
            [
                20928,
                20968
            ],
            [
                21008,
                21010
            ],
            [
                21010,
                21032
            ],
            [
                21051,
                21089
            ],
            [
                21182,
                21185
            ],
            [
                21139,
                21142
            ],
            [
                21186,
                21263
            ],
            [
                21286,
                21288
            ],
            [
                21288,
                21332
            ],
            [
                21604,
                21639
            ],
            [
                21639,
                21709
            ],
            [
                21714,
                21716
            ],
            [
                21734,
                21739
            ],
            [
                21709,
                21713
            ],
            [
                21748,
                21801
            ],
            [
                21805,
                21807
            ],
            [
                21812,
                21816
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                380
            ],
            [
                380,
                507
            ],
            [
                507,
                711
            ],
            [
                711,
                916
            ],
            [
                916,
                1047
            ],
            [
                1047,
                1218
            ],
            [
                1218,
                1285
            ],
            [
                1285,
                1374
            ],
            [
                1374,
                1508
            ],
            [
                1508,
                1654
            ],
            [
                1654,
                1729
            ],
            [
                1729,
                1911
            ],
            [
                1911,
                1994
            ],
            [
                1994,
                2130
            ],
            [
                2130,
                2263
            ],
            [
                2263,
                2661
            ],
            [
                2661,
                2939
            ],
            [
                2939,
                3159
            ],
            [
                3159,
                3205
            ],
            [
                3205,
                3256
            ],
            [
                3256,
                3345
            ],
            [
                3345,
                3458
            ],
            [
                3458,
                3581
            ],
            [
                3581,
                3888
            ],
            [
                3888,
                3977
            ],
            [
                3977,
                4127
            ],
            [
                4127,
                4240
            ],
            [
                4240,
                4295
            ],
            [
                4295,
                4427
            ],
            [
                4427,
                4577
            ],
            [
                4577,
                4616
            ],
            [
                4616,
                4719
            ],
            [
                4719,
                4902
            ],
            [
                4902,
                4936
            ],
            [
                4936,
                5033
            ],
            [
                5033,
                5183
            ],
            [
                5183,
                5473
            ],
            [
                5473,
                5615
            ],
            [
                5615,
                5689
            ],
            [
                5689,
                6005
            ],
            [
                6005,
                6328
            ],
            [
                6328,
                6791
            ],
            [
                6791,
                6897
            ],
            [
                6897,
                6933
            ],
            [
                6933,
                6989
            ],
            [
                6989,
                7009
            ],
            [
                7009,
                7023
            ],
            [
                7023,
                7127
            ],
            [
                7127,
                7216
            ],
            [
                7216,
                7240
            ],
            [
                7240,
                7285
            ],
            [
                7285,
                7454
            ],
            [
                7454,
                7506
            ],
            [
                7506,
                7693
            ],
            [
                7693,
                7830
            ],
            [
                7830,
                7851
            ],
            [
                7851,
                7911
            ],
            [
                7911,
                7943
            ],
            [
                7943,
                7972
            ],
            [
                7972,
                8093
            ],
            [
                8093,
                8137
            ],
            [
                8137,
                8160
            ],
            [
                8160,
                8171
            ],
            [
                8171,
                8205
            ],
            [
                8205,
                8251
            ],
            [
                8251,
                8362
            ],
            [
                8362,
                8396
            ],
            [
                8396,
                8457
            ],
            [
                8457,
                8588
            ],
            [
                8588,
                8755
            ],
            [
                8755,
                8817
            ],
            [
                8817,
                8858
            ],
            [
                8858,
                8905
            ],
            [
                8905,
                8957
            ],
            [
                8957,
                8996
            ],
            [
                8996,
                9052
            ],
            [
                9052,
                9294
            ],
            [
                9294,
                9343
            ],
            [
                9343,
                9450
            ],
            [
                9450,
                9600
            ],
            [
                9600,
                9716
            ],
            [
                9716,
                9742
            ],
            [
                9742,
                9816
            ],
            [
                9816,
                9931
            ],
            [
                9931,
                10026
            ],
            [
                10026,
                10046
            ],
            [
                10046,
                10085
            ],
            [
                10085,
                10109
            ],
            [
                10109,
                10157
            ],
            [
                10157,
                10233
            ],
            [
                10233,
                10256
            ],
            [
                10256,
                10355
            ],
            [
                10355,
                10470
            ],
            [
                10470,
                10507
            ],
            [
                10507,
                10548
            ],
            [
                10548,
                10645
            ],
            [
                10645,
                10825
            ],
            [
                10825,
                10863
            ],
            [
                10863,
                10950
            ],
            [
                10950,
                11045
            ],
            [
                11045,
                11256
            ],
            [
                11256,
                11448
            ],
            [
                11448,
                11547
            ],
            [
                11547,
                11991
            ],
            [
                11991,
                12021
            ],
            [
                12021,
                12067
            ],
            [
                12067,
                12099
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                12137
            ],
            [
                12137,
                12205
            ],
            [
                12205,
                12255
            ],
            [
                12255,
                12293
            ],
            [
                12293,
                12473
            ],
            [
                12473,
                12659
            ],
            [
                12659,
                12834
            ],
            [
                12834,
                12999
            ],
            [
                12999,
                13120
            ],
            [
                13120,
                13211
            ],
            [
                13211,
                13271
            ],
            [
                13271,
                13328
            ],
            [
                13328,
                13390
            ],
            [
                13390,
                13537
            ],
            [
                13537,
                13576
            ],
            [
                13576,
                13596
            ],
            [
                13596,
                13637
            ],
            [
                13637,
                13760
            ],
            [
                13760,
                13882
            ],
            [
                13882,
                13908
            ],
            [
                13908,
                13963
            ],
            [
                13963,
                14039
            ],
            [
                14039,
                14066
            ],
            [
                14066,
                14084
            ],
            [
                14084,
                14111
            ],
            [
                14111,
                14133
            ],
            [
                14133,
                14276
            ],
            [
                14276,
                14308
            ],
            [
                14308,
                14319
            ],
            [
                14319,
                14338
            ],
            [
                14338,
                14428
            ],
            [
                14428,
                14475
            ],
            [
                14475,
                14507
            ],
            [
                14507,
                14619
            ],
            [
                14619,
                14663
            ],
            [
                14663,
                14724
            ],
            [
                14724,
                14753
            ],
            [
                14753,
                14855
            ],
            [
                14855,
                14940
            ],
            [
                14940,
                15056
            ],
            [
                15056,
                15440
            ],
            [
                15440,
                15609
            ],
            [
                15609,
                15758
            ],
            [
                15758,
                15859
            ],
            [
                15859,
                15962
            ],
            [
                15962,
                16083
            ],
            [
                16083,
                16239
            ],
            [
                16239,
                16348
            ],
            [
                16348,
                16581
            ],
            [
                16581,
                17109
            ],
            [
                17109,
                17448
            ],
            [
                17448,
                17515
            ],
            [
                17515,
                17547
            ],
            [
                17547,
                17751
            ],
            [
                17751,
                17936
            ],
            [
                17936,
                18098
            ],
            [
                18098,
                18154
            ],
            [
                18154,
                18219
            ],
            [
                18219,
                18314
            ],
            [
                18314,
                18528
            ],
            [
                18528,
                18600
            ],
            [
                18600,
                18647
            ],
            [
                18647,
                18784
            ],
            [
                18784,
                18959
            ],
            [
                18959,
                19160
            ],
            [
                19160,
                19346
            ],
            [
                19346,
                19419
            ],
            [
                19419,
                19510
            ],
            [
                19510,
                19687
            ],
            [
                19687,
                19806
            ],
            [
                19806,
                19933
            ],
            [
                19933,
                19998
            ],
            [
                19998,
                20094
            ],
            [
                20094,
                20405
            ],
            [
                20405,
                20538
            ],
            [
                20538,
                20729
            ],
            [
                20729,
                20811
            ],
            [
                20811,
                20834
            ],
            [
                20834,
                20909
            ],
            [
                20909,
                21010
            ],
            [
                21010,
                21089
            ],
            [
                21089,
                21133
            ],
            [
                21133,
                21288
            ],
            [
                21288,
                21333
            ],
            [
                21333,
                21457
            ],
            [
                21457,
                21482
            ],
            [
                21482,
                21507
            ],
            [
                21507,
                21538
            ],
            [
                21538,
                21604
            ],
            [
                21604,
                21639
            ],
            [
                21639,
                21709
            ],
            [
                21709,
                21816
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Alf's central committee-room was in Great George Street, and there the battle was kept alive all day. It had been decided that no direct advantage should be taken of the rumour, for there had not been enough time to ascertain its truth. If it was true, Mr. Melmotte would no doubt soon be in jail.\nMany had thought that he would escape as soon as the dinner was over, and had been disappointed when they heard that he had been seen walking towards his own committee-room on the following morning. An effort was made to convince some electors that he had withdrawn. When Melmotte was at Covent Garden, a large throng of men went to Whitehall Place to inquire, and found that he had made no attempt at withdrawal.\nThey who propagated this report certainly damaged Mr. Alf's cause. A feeling grew that Mr. Melmotte was being ill-used. Those evil things had been said - many declared - simply to secure Mr. Alf's success in the election. News of the speech in Covent Garden spread, and did good service to the Conservative cause.\nMr. Alf's friends, hearing this, urged him also to make a speech. Something should be said, if only that it might be reported in the newspapers, to show that they had behaved generously to their enemy.\nAt about two o'clock, Mr. Alf did make a speech - and a very good speech it was, if correctly reported in the Evening Pulpit. But in this speech he did not say a word about his own political ideas, nor even about his own fitness to be a Member of Parliament. Instead, he tried to show that the other man was not fit; and that he and his friends, in wishing to prove Mr. Melmotte's unfitness, had been guilty of nothing shabby.\n\"Mr. Melmotte,\" he said, \"comes before you as a Conservative, and has told us that he is supported by the whole Conservative party. Where, however, are these Conservative supporters? We have heard, till we are sick of it, of the banquet which Mr. Melmotte gave yesterday. I am told that very few of his Conservative friends could be induced to attend that banquet. The leading merchants of the City refused to grace his table. I say that the leaders of the Conservative party are ashamed of this candidate. Where are they? Look about, and see whether they are walking with him in the streets, or standing with him in public places. They have made a mistake, and they know it.\"\nHe ended by alluding to the rumours of yesterday. \"I make no allusion to reports which circulated yesterday, and which I believe originated in the City. They may be false or they may be true. But I declared to you long ago that Melmotte was not fit to represent you in parliament. A great British merchant, indeed! Who knew anything of this man two years ago? Ask about him in Hamburg or Vienna or Paris; and you will be told whether this is a fit man to represent Westminster in the British parliament!\" This was the tone of Mr. Alf's speech.\nAt two or three o'clock, nobody knew how the ballot was going. It was supposed that the working-classes were in favour of Melmotte, partly from their love of a man who spends a great deal of money, partly from the belief that he was being ill-used by the upper classes. It had been asserted that Melmotte was a public robber. Whom had he robbed? Not the poor. There was not a man in London who caused the payment of a larger sum in weekly wages than Mr. Melmotte.\nAbout three o'clock, the editor of the Morning Breakfast Table called on Lady Carbury.\n\"What is it all about?\" she asked.\n\"I don't know what to make of it,\" said Mr. Broune. \"There is a story abroad that Mr. Melmotte has forged some document - and there are other stories about money that he has raised. I should say that it was simply an unfair electioneering trick, were it not that all his own side seem to believe it.\"\n\"Do you believe it?\"\n\"I don't know.\"\n\"Then he can't be rich at all.\"\n\"Even that would not follow. He has such large concerns in hand that he might be very much pressed for funds, and yet be possessed of immense wealth. Everybody says that he pays all his bills.\"\n\"Will he be elected?\" she asked.\n\"At present I would bet against him. Nobody is doing anything for him. There can be no doubt that his own party are ashamed of him.\"\n\"I am glad Felix did not go to Liverpool,\" said Lady Carbury.\n\"It would not have made much difference. She would have been brought back all the same. They say Lord Nidderdale still means to marry her. There must be an immense amount of property somewhere. No one doubts that he was rich when he came to England two years ago, and the Mexican Railway shares were at 15 premium yesterday morning, though they have fallen since. He must have made an enormous amount out of that.\"\nBut Mr. Broune was more scathing about Mr. Alf. \"A man must be mad who imagines that he can sit for Westminster and edit a London daily paper at the same time. A man who sits in parliament cannot pretend to discuss the doings of parliament with impartiality. Where is Felix now?\"\n\"Do not ask me,\" said the poor mother. \"He lies in bed all day, and is out all night.\"\n\"You do not give him any money?\"\n\"I have none to give.\"\n\"I should simply take the key of the house from him, or bolt the door if he will not give it up.\"\n\"Knowing that he must wander in the streets if I refuse to let him in? A mother cannot do that, Mr. Broune. A child has a hold upon his mother.\"\nMr. Broune never now thought of kissing Lady Carbury; but when she spoke thus, he got up and took her hand. She pressed it with no fear that she would be kissed. The feeling between them was changed.\nMelmotte dined at home that evening with only his wife and daughter. Madame Melmotte had not as yet said a word to anyone about her own fears. But not a single person had called today - the day after the great party; and she thought that the Grendalls would have been with her husband today of all days, during the ballot.\n\"Is not Mr. Grendall coming?\" she asked, as she took her seat at the table.\n\"No, he is not,\" said Melmotte.\n\"Nor Lord Alfred?\"\n\"Nor Lord Alfred.\" Melmotte had returned home much comforted by the day's proceedings. No one had dared to say a harsh word to his face. After leaving the bank he had gone back to his office, and had written letters, just as if nothing had happened. A clerk brought him the evening papers, and expressed his opinion that the election was going well. Mr. Melmotte read Alf's speech, and consoled himself with thinking that Mr. Alf had not dared to make new accusations against him. All that about Hamburg and Vienna and Paris was as old as the hills.\n\"I think we shall do pretty well,\" he said to the clerk. His very presence in Abchurch Lane gave confidence. And thus when he came home, something of the old arrogance had returned, and he could swagger before his wife and servants.\n\"The Grendall's are two d___ curs,\" he said.\nHis wife afterwards crept up to him in the back parlour. \"Is there anything wrong, Melmotte?\"\n\"What do you call wrong?\"\n\"I don't know; but I seem to be afraid of something.\"\n\"I should have thought you were used to that by this time.\"\n\"Then there is something.\"\n\"Don't be a fool. There is always something.\"\n\"Shall we have to move again?\" she asked.\n\"How am I to tell? Does that girl mean to marry Lord Nidderdale?\" Madame Melmotte shook her head. \"I'll flog her within an inch of her life if she disobeys me. You tell her that I say so.\"\n\"Then he may flog me,\" said Marie, when so much of the conversation was repeated to her that evening. \"Papa does not know me if he thinks that I'm to be made to marry a man by flogging.\" No such attempt was at any rate made that night.\nEarly the next day a report was current that Mr. Alf had been elected, although the numbers had not yet been counted, and the truth would not be known till seven or eight o'clock in the evening.\nMr. Melmotte again went into the City, and found that things seemed to have returned very much into their usual grooves. The Mexican Railway shares were low, and Mr. Cohenlupe was unhappy; but nothing dreadful had occurred. If nothing dreadful did occur, the railway shares would probably recover.\nIn the course of the day, Melmotte received a letter from Messrs. Slow and Bideawhile, which, of itself, contained no comfort - yet there was comfort to be drawn from it, because of what it did not contain. The letter was unfriendly in its tone, but there was no allusion in it to forgery or criminal proceedings; no hint at anything beyond the not unnatural desire of Mr. Longestaffe and his son to be paid for the property at Pickering.\n\"We have to remind you,\" said the letter, after demands for the money, \"that the title-deeds were delivered to you on our receipt of authority from the Messrs. Longestaffe, on the understanding that the purchase-money was to be at once paid by you. We are informed that the property has since been mortgaged by you. This information forces upon us the necessity of demanding that you should at once pay to us the purchase-money, 80,000; or else return to us the title-deeds of the estate.\"\nThis letter declared positively that the title-deeds had been given up on authority received by the lawyers from both the Longestaffes - father and son. Now the accusation brought against Melmotte was that he had forged the signature to the young Mr. Longestaffe's letter. Slow and Bideawhile were therefore on his side. As to the simple debt, he cared little about that. Many fine men were walking about London who owed large sums of money which they could not pay.\nAs Melmotte was sitting at his solitary dinner this evening - for both his wife and daughter had dined early - news was brought to him that he had been elected for Westminster. He had beaten Mr. Alf by almost a thousand votes.\nThis was a great achievement for someone who had begun the world without a shilling and without a friend - almost without education! Much as he loved money, no triumph of his life had been so great to him as this. Brought into the world in a gutter, without parents, with no good thing ever done for him, he was now a member of the British Parliament for Westminster.\nAt this moment he enjoyed keenly a certain amount of elation. Of course he had committed forgery; of course he had committed robbery. That was nothing, for he had been cheating and forging and stealing all his life. Of course he was in danger of almost immediate detection and punishment - yet he enjoyed his triumph. They could hardly prevent his taking his seat in the House of Commons. Then if they sent him to penal servitude for life, they would have to say that they had so treated the member for Westminster!\nHe drank a bottle of claret, and then had some brandy-and-water. He knew that he had better not drink; but why should he not drink while the time lasted? He therefore took his brandy-and-water freely, until he was able to throw his fears behind him, and to assure himself that, after all, he might yet escape. He would drink no more, he said to himself as he filled another beaker. He would work instead. He would put his shoulder to the wheel, and conquer his enemies. It would not be easy to convict a member for Westminster. Was he not the man who had entertained the Emperor of China? Had he not received at his own table all the Princes of the land, and the Prime Minister? To convict him would be a national disgrace.\nAt any rate, he would not despair. There was a fight to be fought yet, and he would fight it to the end. He drank deeply, and then with careful and almost solemn steps, he made his way to bed.",
        "paragraph_chars": [
            [
                0,
                302
            ],
            [
                302,
                716
            ],
            [
                716,
                1030
            ],
            [
                1030,
                1232
            ],
            [
                1232,
                1659
            ],
            [
                1659,
                2336
            ],
            [
                2336,
                2880
            ],
            [
                2880,
                3344
            ],
            [
                3344,
                3431
            ],
            [
                3431,
                3466
            ],
            [
                3466,
                3767
            ],
            [
                3767,
                3788
            ],
            [
                3788,
                3804
            ],
            [
                3804,
                3836
            ],
            [
                3836,
                4030
            ],
            [
                4030,
                4063
            ],
            [
                4063,
                4196
            ],
            [
                4196,
                4258
            ],
            [
                4258,
                4673
            ],
            [
                4673,
                4953
            ],
            [
                4953,
                5040
            ],
            [
                5040,
                5073
            ],
            [
                5073,
                5096
            ],
            [
                5096,
                5194
            ],
            [
                5194,
                5339
            ],
            [
                5339,
                5539
            ],
            [
                5539,
                5862
            ],
            [
                5862,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                5989
            ],
            [
                5989,
                6539
            ],
            [
                6539,
                6772
            ],
            [
                6772,
                6817
            ],
            [
                6817,
                6911
            ],
            [
                6911,
                6937
            ],
            [
                6937,
                6991
            ],
            [
                6991,
                7051
            ],
            [
                7051,
                7078
            ],
            [
                7078,
                7124
            ],
            [
                7124,
                7166
            ],
            [
                7166,
                7355
            ],
            [
                7355,
                7591
            ],
            [
                7591,
                7786
            ],
            [
                7786,
                8084
            ],
            [
                8084,
                8523
            ],
            [
                8523,
                9013
            ],
            [
                9013,
                9480
            ],
            [
                9480,
                9707
            ],
            [
                9707,
                10075
            ],
            [
                10075,
                10591
            ],
            [
                10591,
                11315
            ],
            [
                11315,
                11507
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                241
            ],
            [
                241,
                302
            ],
            [
                302,
                501
            ],
            [
                501,
                569
            ],
            [
                569,
                716
            ],
            [
                716,
                783
            ],
            [
                783,
                836
            ],
            [
                836,
                938
            ],
            [
                938,
                1030
            ],
            [
                1030,
                1096
            ],
            [
                1096,
                1232
            ],
            [
                1232,
                1358
            ],
            [
                1358,
                1491
            ],
            [
                1491,
                1659
            ],
            [
                1659,
                1791
            ],
            [
                1791,
                1842
            ],
            [
                1842,
                1931
            ],
            [
                1931,
                2024
            ],
            [
                2024,
                2086
            ],
            [
                2086,
                2166
            ],
            [
                2166,
                2182
            ],
            [
                2182,
                2291
            ],
            [
                2291,
                2336
            ],
            [
                2336,
                2386
            ],
            [
                2386,
                2489
            ],
            [
                2489,
                2528
            ],
            [
                2528,
                2617
            ],
            [
                2617,
                2651
            ],
            [
                2651,
                2696
            ],
            [
                2696,
                2841
            ],
            [
                2841,
                2880
            ],
            [
                2880,
                2943
            ],
            [
                2943,
                3150
            ],
            [
                3150,
                3206
            ],
            [
                3206,
                3226
            ],
            [
                3226,
                3240
            ],
            [
                3240,
                3344
            ],
            [
                3344,
                3431
            ],
            [
                3431,
                3455
            ],
            [
                3455,
                3466
            ],
            [
                3466,
                3518
            ],
            [
                3518,
                3648
            ],
            [
                3648,
                3767
            ],
            [
                3767,
                3788
            ],
            [
                3788,
                3804
            ],
            [
                3804,
                3836
            ],
            [
                3836,
                3865
            ],
            [
                3865,
                3986
            ],
            [
                3986,
                4030
            ],
            [
                4030,
                4052
            ],
            [
                4052,
                4063
            ],
            [
                4063,
                4100
            ],
            [
                4100,
                4134
            ],
            [
                4134,
                4196
            ],
            [
                4196,
                4258
            ],
            [
                4258,
                4299
            ],
            [
                4299,
                4346
            ],
            [
                4346,
                4397
            ],
            [
                4397,
                4452
            ],
            [
                4452,
                4622
            ],
            [
                4622,
                4673
            ],
            [
                4673,
                4721
            ],
            [
                4721,
                4833
            ],
            [
                4833,
                4932
            ],
            [
                4932,
                4953
            ],
            [
                4953,
                4992
            ],
            [
                4992,
                5040
            ],
            [
                5040,
                5073
            ],
            [
                5073,
                5096
            ],
            [
                5096,
                5194
            ],
            [
                5194,
                5265
            ],
            [
                5265,
                5302
            ],
            [
                5302,
                5339
            ],
            [
                5339,
                5447
            ],
            [
                5447,
                5501
            ],
            [
                5501,
                5539
            ],
            [
                5539,
                5608
            ],
            [
                5608,
                5682
            ],
            [
                5682,
                5862
            ],
            [
                5862,
                5892
            ],
            [
                5892,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                5989
            ],
            [
                5989,
                6008
            ],
            [
                6008,
                6076
            ],
            [
                6076,
                6126
            ],
            [
                6126,
                6239
            ],
            [
                6239,
                6339
            ],
            [
                6339,
                6470
            ],
            [
                6470,
                6539
            ],
            [
                6539,
                6596
            ],
            [
                6596,
                6648
            ],
            [
                6648,
                6772
            ],
            [
                6772,
                6817
            ],
            [
                6817,
                6874
            ],
            [
                6874,
                6911
            ],
            [
                6911,
                6937
            ],
            [
                6937,
                6991
            ],
            [
                6991,
                7051
            ],
            [
                7051,
                7078
            ],
            [
                7078,
                7096
            ],
            [
                7096,
                7124
            ],
            [
                7124,
                7155
            ],
            [
                7155,
                7166
            ],
            [
                7166,
                7185
            ],
            [
                7185,
                7232
            ],
            [
                7232,
                7264
            ],
            [
                7264,
                7326
            ],
            [
                7326,
                7355
            ],
            [
                7355,
                7457
            ],
            [
                7457,
                7542
            ],
            [
                7542,
                7591
            ],
            [
                7591,
                7786
            ],
            [
                7786,
                7907
            ],
            [
                7907,
                8010
            ],
            [
                8010,
                8084
            ],
            [
                8084,
                8291
            ],
            [
                8291,
                8523
            ],
            [
                8523,
                8772
            ],
            [
                8772,
                8839
            ],
            [
                8839,
                9013
            ],
            [
                9013,
                9166
            ],
            [
                9166,
                9286
            ],
            [
                9286,
                9334
            ],
            [
                9334,
                9385
            ],
            [
                9385,
                9480
            ],
            [
                9480,
                9657
            ],
            [
                9657,
                9707
            ],
            [
                9707,
                9840
            ],
            [
                9840,
                9921
            ],
            [
                9921,
                10075
            ],
            [
                10075,
                10137
            ],
            [
                10137,
                10209
            ],
            [
                10209,
                10291
            ],
            [
                10291,
                10393
            ],
            [
                10393,
                10464
            ],
            [
                10464,
                10591
            ],
            [
                10591,
                10656
            ],
            [
                10656,
                10745
            ],
            [
                10745,
                10901
            ],
            [
                10901,
                10973
            ],
            [
                10973,
                10996
            ],
            [
                10996,
                11061
            ],
            [
                11061,
                11119
            ],
            [
                11119,
                11180
            ],
            [
                11180,
                11270
            ],
            [
                11270,
                11315
            ],
            [
                11315,
                11350
            ],
            [
                11350,
                11420
            ],
            [
                11420,
                11507
            ]
        ],
        "overlap_chars": [
            [
                0,
                100
            ],
            [
                101,
                106
            ],
            [
                106,
                125
            ],
            [
                126,
                169
            ],
            [
                170,
                173
            ],
            [
                180,
                181
            ],
            [
                182,
                185
            ],
            [
                186,
                204
            ],
            [
                212,
                216
            ],
            [
                217,
                219
            ],
            [
                234,
                239
            ],
            [
                239,
                241
            ],
            [
                241,
                243
            ],
            [
                255,
                295
            ],
            [
                300,
                301
            ],
            [
                302,
                443
            ],
            [
                444,
                501
            ],
            [
                501,
                531
            ],
            [
                537,
                567
            ],
            [
                567,
                569
            ],
            [
                569,
                650
            ],
            [
                678,
                680
            ],
            [
                681,
                715
            ],
            [
                716,
                783
            ],
            [
                783,
                792
            ],
            [
                793,
                797
            ],
            [
                798,
                836
            ],
            [
                836,
                867
            ],
            [
                870,
                874
            ],
            [
                875,
                883
            ],
            [
                886,
                912
            ],
            [
                936,
                938
            ],
            [
                943,
                973
            ],
            [
                974,
                980
            ],
            [
                980,
                1009
            ],
            [
                1010,
                1029
            ],
            [
                1030,
                1056
            ],
            [
                1057,
                1062
            ],
            [
                1069,
                1096
            ],
            [
                1096,
                1204
            ],
            [
                1219,
                1230
            ],
            [
                1230,
                1231
            ],
            [
                1235,
                1252
            ],
            [
                1252,
                1279
            ],
            [
                1282,
                1341
            ],
            [
                1350,
                1356
            ],
            [
                1358,
                1376
            ],
            [
                1377,
                1398
            ],
            [
                1405,
                1429
            ],
            [
                1445,
                1460
            ],
            [
                1461,
                1463
            ],
            [
                1464,
                1466
            ],
            [
                1467,
                1468
            ],
            [
                1476,
                1478
            ],
            [
                1479,
                1489
            ],
            [
                1489,
                1491
            ],
            [
                1500,
                1502
            ],
            [
                1509,
                1548
            ],
            [
                1549,
                1577
            ],
            [
                1578,
                1580
            ],
            [
                1589,
                1591
            ],
            [
                1598,
                1610
            ],
            [
                1622,
                1657
            ],
            [
                1657,
                1658
            ],
            [
                1659,
                1736
            ],
            [
                1737,
                1791
            ],
            [
                1791,
                1842
            ],
            [
                1842,
                1931
            ],
            [
                1931,
                1957
            ],
            [
                1958,
                2024
            ],
            [
                2024,
                2074
            ],
            [
                2079,
                2084
            ],
            [
                2084,
                2086
            ],
            [
                2086,
                2134
            ],
            [
                2135,
                2138
            ],
            [
                2147,
                2149
            ],
            [
                2155,
                2164
            ],
            [
                2164,
                2166
            ],
            [
                2182,
                2289
            ],
            [
                2289,
                2291
            ],
            [
                2291,
                2315
            ],
            [
                2315,
                2335
            ],
            [
                2336,
                2386
            ],
            [
                2387,
                2405
            ],
            [
                2406,
                2422
            ],
            [
                2423,
                2443
            ],
            [
                2443,
                2464
            ],
            [
                2465,
                2489
            ],
            [
                2489,
                2528
            ],
            [
                2528,
                2554
            ],
            [
                2559,
                2563
            ],
            [
                2564,
                2580
            ],
            [
                2585,
                2615
            ],
            [
                2615,
                2617
            ],
            [
                2617,
                2651
            ],
            [
                2651,
                2659
            ],
            [
                2669,
                2690
            ],
            [
                2694,
                2696
            ],
            [
                2696,
                2699
            ],
            [
                2710,
                2720
            ],
            [
                2724,
                2730
            ],
            [
                2734,
                2740
            ],
            [
                2741,
                2841
            ],
            [
                2846,
                2861
            ],
            [
                2862,
                2869
            ],
            [
                2872,
                2878
            ],
            [
                2878,
                2880
            ],
            [
                2880,
                2903
            ],
            [
                2903,
                2924
            ],
            [
                2932,
                2943
            ],
            [
                2943,
                3127
            ],
            [
                3131,
                3150
            ],
            [
                3150,
                3206
            ],
            [
                3206,
                3226
            ],
            [
                3226,
                3240
            ],
            [
                3240,
                3344
            ],
            [
                3344,
                3382
            ],
            [
                3383,
                3406
            ],
            [
                3407,
                3430
            ],
            [
                3431,
                3455
            ],
            [
                3455,
                3464
            ],
            [
                3464,
                3465
            ],
            [
                3466,
                3518
            ],
            [
                3518,
                3585
            ],
            [
                3588,
                3591
            ],
            [
                3598,
                3615
            ],
            [
                3628,
                3648
            ],
            [
                3648,
                3682
            ],
            [
                3683,
                3689
            ],
            [
                3690,
                3704
            ],
            [
                3705,
                3767
            ],
            [
                3767,
                3788
            ],
            [
                3788,
                3789
            ],
            [
                3789,
                3790
            ],
            [
                3801,
                3804
            ],
            [
                3804,
                3836
            ],
            [
                3836,
                3865
            ],
            [
                3865,
                3986
            ],
            [
                3986,
                4030
            ],
            [
                4030,
                4041
            ],
            [
                4049,
                4052
            ],
            [
                4052,
                4063
            ],
            [
                4064,
                4074
            ],
            [
                4075,
                4100
            ],
            [
                4100,
                4134
            ],
            [
                4134,
                4193
            ],
            [
                4196,
                4258
            ],
            [
                4258,
                4299
            ],
            [
                4299,
                4346
            ],
            [
                4346,
                4395
            ],
            [
                4397,
                4452
            ],
            [
                4452,
                4525
            ],
            [
                4526,
                4552
            ],
            [
                4553,
                4589
            ],
            [
                4589,
                4590
            ],
            [
                4598,
                4602
            ],
            [
                4608,
                4614
            ],
            [
                4615,
                4621
            ],
            [
                4622,
                4651
            ],
            [
                4659,
                4672
            ],
            [
                4673,
                4687
            ],
            [
                4688,
                4691
            ],
            [
                4712,
                4721
            ],
            [
                4722,
                4831
            ],
            [
                4833,
                4861
            ],
            [
                4869,
                4930
            ],
            [
                4932,
                4937
            ],
            [
                4941,
                4953
            ],
            [
                4953,
                4991
            ],
            [
                4992,
                5040
            ],
            [
                5040,
                5064
            ],
            [
                5065,
                5070
            ],
            [
                5070,
                5073
            ],
            [
                5073,
                5096
            ],
            [
                5096,
                5148
            ],
            [
                5149,
                5194
            ],
            [
                5194,
                5195
            ],
            [
                5195,
                5265
            ],
            [
                5265,
                5302
            ],
            [
                5302,
                5313
            ],
            [
                5314,
                5336
            ],
            [
                5339,
                5445
            ],
            [
                5447,
                5458
            ],
            [
                5467,
                5501
            ],
            [
                5501,
                5539
            ],
            [
                5539,
                5579
            ],
            [
                5585,
                5608
            ],
            [
                5608,
                5653
            ],
            [
                5667,
                5674
            ],
            [
                5680,
                5682
            ],
            [
                5682,
                5691
            ],
            [
                5699,
                5716
            ],
            [
                5723,
                5724
            ],
            [
                5725,
                5754
            ],
            [
                5756,
                5759
            ],
            [
                5760,
                5776
            ],
            [
                5777,
                5790
            ],
            [
                5791,
                5796
            ],
            [
                5797,
                5811
            ],
            [
                5812,
                5823
            ],
            [
                5830,
                5842
            ],
            [
                5850,
                5853
            ],
            [
                5860,
                5861
            ],
            [
                5862,
                5892
            ],
            [
                5892,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                5989
            ],
            [
                5989,
                6008
            ],
            [
                6008,
                6076
            ],
            [
                6076,
                6126
            ],
            [
                6126,
                6205
            ],
            [
                6206,
                6237
            ],
            [
                6237,
                6239
            ],
            [
                6241,
                6246
            ],
            [
                6255,
                6258
            ],
            [
                6259,
                6277
            ],
            [
                6277,
                6282
            ],
            [
                6283,
                6339
            ],
            [
                6352,
                6470
            ],
            [
                6470,
                6489
            ],
            [
                6493,
                6537
            ],
            [
                6537,
                6538
            ],
            [
                6539,
                6596
            ],
            [
                6596,
                6630
            ],
            [
                6631,
                6648
            ],
            [
                6648,
                6656
            ],
            [
                6657,
                6710
            ],
            [
                6719,
                6741
            ],
            [
                6742,
                6771
            ],
            [
                6772,
                6776
            ],
            [
                6788,
                6797
            ],
            [
                6801,
                6805
            ],
            [
                6826,
                6836
            ],
            [
                6843,
                6872
            ],
            [
                6872,
                6873
            ],
            [
                6874,
                6910
            ],
            [
                6911,
                6937
            ],
            [
                6937,
                6951
            ],
            [
                6952,
                6991
            ],
            [
                6991,
                7035
            ],
            [
                7036,
                7051
            ],
            [
                7051,
                7078
            ],
            [
                7078,
                7096
            ],
            [
                7096,
                7121
            ],
            [
                7124,
                7141
            ],
            [
                7142,
                7155
            ],
            [
                7155,
                7166
            ],
            [
                7166,
                7185
            ],
            [
                7185,
                7232
            ],
            [
                7232,
                7264
            ],
            [
                7265,
                7326
            ],
            [
                7326,
                7355
            ],
            [
                7355,
                7457
            ],
            [
                7457,
                7542
            ],
            [
                7542,
                7589
            ],
            [
                7589,
                7591
            ],
            [
                7591,
                7652
            ],
            [
                7660,
                7661
            ],
            [
                7671,
                7690
            ],
            [
                7691,
                7708
            ],
            [
                7713,
                7785
            ],
            [
                7786,
                7907
            ],
            [
                7907,
                7965
            ],
            [
                7966,
                7974
            ],
            [
                7975,
                8008
            ],
            [
                8008,
                8010
            ],
            [
                8010,
                8082
            ],
            [
                8082,
                8083
            ],
            [
                8084,
                8188
            ],
            [
                8189,
                8209
            ],
            [
                8216,
                8245
            ],
            [
                8246,
                8250
            ],
            [
                8253,
                8254
            ],
            [
                8263,
                8291
            ],
            [
                8291,
                8328
            ],
            [
                8328,
                8329
            ],
            [
                8330,
                8372
            ],
            [
                8376,
                8408
            ],
            [
                8418,
                8472
            ],
            [
                8477,
                8521
            ],
            [
                8521,
                8523
            ],
            [
                8523,
                8564
            ],
            [
                8571,
                8640
            ],
            [
                8645,
                8652
            ],
            [
                8653,
                8665
            ],
            [
                8666,
                8694
            ],
            [
                8694,
                8763
            ],
            [
                8764,
                8772
            ],
            [
                8772,
                8809
            ],
            [
                8810,
                8815
            ],
            [
                8816,
                8820
            ],
            [
                8821,
                8839
            ],
            [
                8844,
                8855
            ],
            [
                8856,
                8951
            ],
            [
                8952,
                8958
            ],
            [
                8960,
                9013
            ],
            [
                9013,
                9024
            ],
            [
                9025,
                9108
            ],
            [
                9121,
                9147
            ],
            [
                9150,
                9166
            ],
            [
                9166,
                9209
            ],
            [
                9210,
                9286
            ],
            [
                9286,
                9334
            ],
            [
                9334,
                9372
            ],
            [
                9373,
                9385
            ],
            [
                9385,
                9480
            ],
            [
                9480,
                9482
            ],
            [
                9492,
                9539
            ],
            [
                9542,
                9576
            ],
            [
                9577,
                9588
            ],
            [
                9591,
                9657
            ],
            [
                9657,
                9681
            ],
            [
                9689,
                9707
            ],
            [
                9748,
                9811
            ],
            [
                9814,
                9840
            ],
            [
                9840,
                9862
            ],
            [
                9862,
                9921
            ],
            [
                9921,
                9964
            ],
            [
                9972,
                10057
            ],
            [
                10058,
                10061
            ],
            [
                10073,
                10074
            ],
            [
                10075,
                10137
            ],
            [
                10137,
                10172
            ],
            [
                10173,
                10209
            ],
            [
                10209,
                10213
            ],
            [
                10214,
                10291
            ],
            [
                10291,
                10362
            ],
            [
                10365,
                10393
            ],
            [
                10393,
                10464
            ],
            [
                10464,
                10591
            ],
            [
                10591,
                10628
            ],
            [
                10633,
                10656
            ],
            [
                10656,
                10693
            ],
            [
                10694,
                10697
            ],
            [
                10698,
                10745
            ],
            [
                10745,
                10791
            ],
            [
                10798,
                10888
            ],
            [
                10889,
                10899
            ],
            [
                10899,
                10901
            ],
            [
                10901,
                10923
            ],
            [
                10925,
                10973
            ],
            [
                10973,
                10996
            ],
            [
                10996,
                11039
            ],
            [
                11040,
                11061
            ],
            [
                11061,
                11076
            ],
            [
                11077,
                11117
            ],
            [
                11117,
                11119
            ],
            [
                11119,
                11141
            ],
            [
                11142,
                11180
            ],
            [
                11180,
                11183
            ],
            [
                11187,
                11190
            ],
            [
                11191,
                11268
            ],
            [
                11268,
                11270
            ],
            [
                11270,
                11314
            ],
            [
                11315,
                11350
            ],
            [
                11350,
                11420
            ],
            [
                11420,
                11422
            ],
            [
                11435,
                11440
            ],
            [
                11441,
                11445
            ],
            [
                11446,
                11499
            ],
            [
                11500,
                11502
            ],
            [
                11503,
                11507
            ]
        ],
        "row_chars": [
            [
                0,
                106
            ],
            [
                106,
                241
            ],
            [
                241,
                302
            ],
            [
                302,
                501
            ],
            [
                501,
                501
            ],
            [
                501,
                569
            ],
            [
                569,
                716
            ],
            [
                716,
                783
            ],
            [
                783,
                836
            ],
            [
                836,
                938
            ],
            [
                938,
                1030
            ],
            [
                1030,
                1096
            ],
            [
                1096,
                1232
            ],
            [
                1232,
                1232
            ],
            [
                1232,
                1358
            ],
            [
                1358,
                1358
            ],
            [
                1358,
                1491
            ],
            [
                1491,
                1659
            ],
            [
                1659,
                1791
            ],
            [
                1791,
                1791
            ],
            [
                1791,
                1842
            ],
            [
                1842,
                1931
            ],
            [
                1931,
                2024
            ],
            [
                2024,
                2086
            ],
            [
                2086,
                2166
            ],
            [
                2166,
                2182
            ],
            [
                2182,
                2291
            ],
            [
                2291,
                2336
            ],
            [
                2336,
                2386
            ],
            [
                2386,
                2386
            ],
            [
                2386,
                2489
            ],
            [
                2489,
                2528
            ],
            [
                2528,
                2528
            ],
            [
                2528,
                2617
            ],
            [
                2617,
                2651
            ],
            [
                2651,
                2651
            ],
            [
                2651,
                2696
            ],
            [
                2696,
                2841
            ],
            [
                2841,
                2880
            ],
            [
                2880,
                2943
            ],
            [
                2943,
                3150
            ],
            [
                3150,
                3150
            ],
            [
                3150,
                3150
            ],
            [
                3150,
                3150
            ],
            [
                3150,
                3150
            ],
            [
                3150,
                3206
            ],
            [
                3206,
                3226
            ],
            [
                3226,
                3240
            ],
            [
                3240,
                3344
            ],
            [
                3344,
                3431
            ],
            [
                3431,
                3455
            ],
            [
                3455,
                3466
            ],
            [
                3466,
                3466
            ],
            [
                3466,
                3518
            ],
            [
                3518,
                3648
            ],
            [
                3648,
                3767
            ],
            [
                3767,
                3788
            ],
            [
                3788,
                3804
            ],
            [
                3804,
                3836
            ],
            [
                3836,
                3865
            ],
            [
                3865,
                3986
            ],
            [
                3986,
                4030
            ],
            [
                4030,
                4052
            ],
            [
                4052,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4100
            ],
            [
                4100,
                4134
            ],
            [
                4134,
                4196
            ],
            [
                4196,
                4196
            ],
            [
                4196,
                4196
            ],
            [
                4196,
                4258
            ],
            [
                4258,
                4299
            ],
            [
                4299,
                4346
            ],
            [
                4346,
                4397
            ],
            [
                4397,
                4397
            ],
            [
                4397,
                4452
            ],
            [
                4452,
                4622
            ],
            [
                4622,
                4673
            ],
            [
                4673,
                4721
            ],
            [
                4721,
                4721
            ],
            [
                4721,
                4833
            ],
            [
                4833,
                4833
            ],
            [
                4833,
                4833
            ],
            [
                4833,
                4932
            ],
            [
                4932,
                4932
            ],
            [
                4932,
                4953
            ],
            [
                4953,
                4992
            ],
            [
                4992,
                4992
            ],
            [
                4992,
                5040
            ],
            [
                5040,
                5073
            ],
            [
                5073,
                5096
            ],
            [
                5096,
                5194
            ],
            [
                5194,
                5265
            ],
            [
                5265,
                5302
            ],
            [
                5302,
                5339
            ],
            [
                5339,
                5339
            ],
            [
                5339,
                5501
            ],
            [
                5501,
                5539
            ],
            [
                5539,
                5608
            ],
            [
                5608,
                5608
            ],
            [
                5608,
                5608
            ],
            [
                5608,
                5608
            ],
            [
                5608,
                5682
            ],
            [
                5682,
                5862
            ],
            [
                5862,
                5892
            ],
            [
                5892,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                5989
            ],
            [
                5989,
                6008
            ],
            [
                6008,
                6076
            ],
            [
                6076,
                6126
            ],
            [
                6126,
                6126
            ],
            [
                6126,
                6239
            ],
            [
                6239,
                6339
            ],
            [
                6339,
                6339
            ],
            [
                6339,
                6339
            ],
            [
                6339,
                6470
            ],
            [
                6470,
                6539
            ],
            [
                6539,
                6539
            ],
            [
                6539,
                6596
            ],
            [
                6596,
                6648
            ],
            [
                6648,
                6772
            ],
            [
                6772,
                6772
            ],
            [
                6772,
                6772
            ],
            [
                6772,
                6817
            ],
            [
                6817,
                6817
            ],
            [
                6817,
                6911
            ],
            [
                6911,
                6937
            ],
            [
                6937,
                6991
            ],
            [
                6991,
                7051
            ],
            [
                7051,
                7078
            ],
            [
                7078,
                7096
            ],
            [
                7096,
                7124
            ],
            [
                7124,
                7124
            ],
            [
                7124,
                7124
            ],
            [
                7124,
                7155
            ],
            [
                7155,
                7166
            ],
            [
                7166,
                7185
            ],
            [
                7185,
                7185
            ],
            [
                7185,
                7232
            ],
            [
                7232,
                7264
            ],
            [
                7264,
                7264
            ],
            [
                7264,
                7264
            ],
            [
                7264,
                7326
            ],
            [
                7326,
                7355
            ],
            [
                7355,
                7457
            ],
            [
                7457,
                7542
            ],
            [
                7542,
                7591
            ],
            [
                7591,
                7786
            ],
            [
                7786,
                7786
            ],
            [
                7786,
                7786
            ],
            [
                7786,
                7786
            ],
            [
                7786,
                7786
            ],
            [
                7786,
                7907
            ],
            [
                7907,
                8010
            ],
            [
                8010,
                8084
            ],
            [
                8084,
                8291
            ],
            [
                8291,
                8523
            ],
            [
                8523,
                8772
            ],
            [
                8772,
                8839
            ],
            [
                8839,
                8839
            ],
            [
                8839,
                9013
            ],
            [
                9013,
                9166
            ],
            [
                9166,
                9286
            ],
            [
                9286,
                9334
            ],
            [
                9334,
                9385
            ],
            [
                9385,
                9480
            ],
            [
                9480,
                9657
            ],
            [
                9657,
                9707
            ],
            [
                9707,
                9707
            ],
            [
                9707,
                9840
            ],
            [
                9840,
                9921
            ],
            [
                9921,
                10075
            ],
            [
                10075,
                10137
            ],
            [
                10137,
                10209
            ],
            [
                10209,
                10291
            ],
            [
                10291,
                10393
            ],
            [
                10393,
                10464
            ],
            [
                10464,
                10591
            ],
            [
                10591,
                10656
            ],
            [
                10656,
                10656
            ],
            [
                10656,
                10745
            ],
            [
                10745,
                10745
            ],
            [
                10745,
                10901
            ],
            [
                10901,
                10973
            ],
            [
                10973,
                10996
            ],
            [
                10996,
                11061
            ],
            [
                11061,
                11119
            ],
            [
                11119,
                11180
            ],
            [
                11180,
                11180
            ],
            [
                11180,
                11270
            ],
            [
                11270,
                11315
            ],
            [
                11315,
                11315
            ],
            [
                11315,
                11315
            ],
            [
                11315,
                11315
            ],
            [
                11315,
                11315
            ],
            [
                11315,
                11315
            ],
            [
                11315,
                11350
            ],
            [
                11350,
                11420
            ],
            [
                11420,
                11507
            ]
        ]
    }
}