{
    "original": {
        "text": "Poor Hetta passed a very bad night. The story she had heard seemed to be almost too awful to be true,--even about any one else. The man had come to her, and had asked her to be his wife,--and yet at that very moment was living in habits of daily intercourse with another woman whom he had promised to marry! And then, too, his courtship with her had been so graceful, so soft, so modest, and yet so long continued! Though he had been slow in speech, she had known since their first meeting how he regarded her! The whole state of his mind had, she had thought, been visible to her,--had been intelligible, gentle, and affectionate. He had been aware of her friends' feeling, and had therefore hesitated. He had kept himself from her because he had owed so much to friendship. And yet his love had not been the less true, and had not been less dear to poor Hetta. She had waited, sure that it would come,--having absolute confidence in his honour and love. And now she was told that this man had been playing a game so base, and at the same time so foolish, that she could find not only no excuse but no possible cause for it. It was not like any story she had heard before of man's faithlessness. Though she was wretched and sore at heart she swore to herself that she would not believe it. She knew that her mother would write to Roger Carbury,--but she knew also that nothing more would be said about the letter till the answer should come. Nor could she turn anywhere else for comfort. She did not dare to appeal to Paul himself. As regarded him, for the present she could only rely on the assurance, which she continued to give herself, that she would not believe a word of the story that had been told her.\nBut there was other wretchedness besides her own. She had undertaken to give Marie Melmotte's message to her brother. She had done so, and she must now let Marie have her brother's reply. That might be told in a very few words--\"Everything is over!\" But it had to be told.\n\"I want to call upon Miss Melmotte, if you'll let me,\" she said to her mother at breakfast.\n\"Why should you want to see Miss Melmotte? I thought you hated the Melmottes?\"\n\"I don't hate them, mamma. I certainly don't hate her. I have a message to take to her,--from Felix.\"\n\"A message--from Felix.\"\n\"It is an answer from him. She wanted to know if all that was over. Of course it is over. Whether he said so or not, it would be so. They could never be married now;--could they, mamma?\"\nThe marriage, in Lady Carbury's mind, was no longer even desirable. She, too, was beginning to disbelieve in the Melmotte wealth, and did quite disbelieve that that wealth would come to her son, even should he succeed in marrying the daughter. It was impossible that Melmotte should forgive such offence as had now been committed. \"It is out of the question,\" she said. \"That, like everything else with us, has been a wretched failure. You can go, if you please. Felix is under no obligation to them, and has taken nothing from them. I should much doubt whether the girl will get anybody to take her now. You can't go alone, you know,\" Lady Carbury added. But Hetta said that she did not at all object to going alone as far as that. It was only just over Oxford Street.\nSo she went out and made her way into Grosvenor Square. She had heard, but at the time remembered nothing, of the temporary migration of the Melmottes to Bruton Street. Seeing, as she approached the house, that there was a confusion there of carts and workmen, she hesitated. But she went on, and rang the bell at the door, which was wide open. Within the hall the pilasters and trophies, the wreaths and the banners, which three or four days since had been built up with so much trouble, were now being pulled down and hauled away. And amidst the ruins Melmotte himself was standing. He was now a member of Parliament, and was to take his place that night in the House. Nothing, at any rate, should prevent that. It might be but for a short time;--but it should be written in the history of his life that he had sat in the British House of Commons as member for Westminster. At the present moment he was careful to show himself everywhere. It was now noon, and he had already been into the City. At this moment he was talking to the contractor for the work,--having just propitiated that man by a payment which would hardly have been made so soon but for the necessity which these wretched stories had entailed upon him of keeping up his credit for the possession of money. Hetta timidly asked one of the workmen whether Miss Melmotte was there. \"Do you want my daughter?\" said Melmotte coming forward, and just touching his hat. \"She is not living here at present.\"\n\"Oh,--I remember now,\" said Hetta.\n\"May I be allowed to tell her who was asking after her?\" At the present moment Melmotte was not unreasonably suspicious about his daughter.\n\"I am Miss Carbury,\" said Hetta in a very low voice.\n\"Oh, indeed;--Miss Carbury!--the sister of Sir Felix Carbury?\" There was something in the tone of the man's voice which grated painfully on Hetta's ears,--but she answered the question. \"Oh;--Sir Felix's sister! May I be permitted to ask whether--you have any business with my daughter?\" The story was a hard one to tell, with all the workmen around her, in the midst of the lumber, with the coarse face of the suspicious man looking down upon her; but she did tell it very simply. She had come with a message from her brother. There had been something between her brother and Miss Melmotte, and her brother had felt that it would be best that he should acknowledge that it must be all over. \"I wonder whether that is true,\" said Melmotte, looking at her out of his great coarse eyes, with his eyebrows knit, with his hat on his head and his hands in his pockets. Hetta, not knowing how, at the moment, to repudiate the suspicion expressed, was silent. \"Because, you know, there has been a deal of falsehood and double dealing. Sir Felix has behaved infamously; yes,--by G----, infamously. A day or two before my daughter started, he gave me a written assurance that the whole thing was over, and now he sends you here. How am I to know what you are really after?\"\n\"I have come because I thought I could do some good,\" she said, trembling with anger and fear. \"I was speaking to your daughter at your party.\"\n\"Oh, you were there;--were you? It may be as you say, but how is one to tell? When one has been deceived like that, one is apt to be suspicious, Miss Carbury.\" Here was one who had spent his life in lying to the world, and who was in his very heart shocked at the atrocity of a man who had lied to him! \"You are not plotting another journey to Liverpool;--are you?\" To this Hetta could make no answer. The insult was too much, but alone, unsupported, she did not know how to give him back scorn for scorn. At last he proposed to take her across to Bruton Street himself, and at his bidding she walked by his side. \"May I hear what you say to her?\" he asked.\n\"If you suspect me, Mr. Melmotte, I had better not see her at all. It is only that there may no longer be any doubt.\"\n\"You can say it all before me.\"\n\"No;--I could not do that. But I have told you, and you can say it for me. If you please, I think I will go home now.\"\nBut Melmotte knew that his daughter would not believe him on such a subject. This girl she probably would believe. And though Melmotte himself found it difficult to trust anybody, he thought that there was more possible good than evil to be expected from the proposed interview. \"Oh, you shall see her,\" he said. \"I don't suppose she's such a fool as to try that kind of thing again.\" Then the door in Bruton Street was opened, and Hetta, repenting her mission, found herself almost pushed into the hall. She was bidden to follow Melmotte up-stairs, and was left alone in the drawing-room, as she thought, for a long time. Then the door was slowly opened and Marie crept into the room. \"Miss Carbury,\" she said, \"this is so good of you,--so good of you! I do so love you for coming to me! You said you would love me. You will; will you not?\" and Marie, sitting down by the stranger, took her hand and encircled her waist.\n\"Mr. Melmotte has told you why I have come.\"\n\"Yes;--that is, I don't know. I never believe what papa says to me.\" To poor Hetta such an announcement as this was horrible. \"We are at daggers drawn. He thinks I ought to do just what he tells me, as though my very soul were not my own. I won't agree to that;--would you?\" Hetta had not come there to preach disobedience, but could not fail to remember at the moment that she was not disposed to obey her mother in an affair of the same kind. \"What does he say, dear?\"\nHetta's message was to be conveyed in three words, and when those were told, there was nothing more to be said. \"It must all be over, Miss Melmotte.\"\n\"Is that his message, Miss Carbury?\" Hetta nodded her head. \"Is that all?\"\n\"What more can I say? The other night you told me to bid him send you word. And I thought he ought to do so. I gave him your message, and I have brought back the answer. My brother, you know, has no income of his own;--nothing at all.\"\n\"But I have,\" said Marie with eagerness.\n\"But your father--\"\n\"It does not depend upon papa. If papa treats me badly, I can give it to my husband. I know I can. If I can venture, cannot he?\" \"I think it is impossible.\"\n\"Impossible! Nothing should be impossible. All the people that one hears of that are really true to their loves never find anything impossible. Does he love me, Miss Carbury? It all depends on that. That's what I want to know.\" She paused, but Hetta could not answer the question. \"You must know about your brother. Don't you know whether he does love me? If you know I think you ought to tell me.\" Hetta was still silent. \"Have you nothing to say?\"\n\"Miss Melmotte--\" began poor Hetta very slowly.\n\"Call me Marie. You said you would love me;--did you not? I don't even know what your name is.\"\n\"My name is--Hetta.\"\n\"Hetta;--that's short for something. But it's very pretty. I have no brother, no sister. And I'll tell you, though you must not tell anybody again;--I have no real mother. Madame Melmotte is not my mamma, though papa chooses that it should be thought so.\" All this she whispered, with rapid words, almost into Hetta's ear. \"And papa is so cruel to me! He beats me sometimes.\" The new friend, round whom Marie still had her arm, shuddered as she heard this. \"But I never will yield a bit for that. When he boxes and thumps me I always turn and gnash my teeth at him. Can you wonder that I want to have a friend? Can you be surprised that I should be always thinking of my lover? But,--if he doesn't love me, what am I to do then?\"\n\"I don't know what I am to say,\" ejaculated Hetta amidst her sobs. Whether the girl was good or bad, to be sought or to be avoided, there was so much tragedy in her position that Hetta's heart was melted with sympathy.\n\"I wonder whether you love anybody, and whether he loves you,\" said Marie. Hetta certainly had not come there to talk of her own affairs, and made no reply to this. \"I suppose you won't tell me about yourself.\"\n\"I wish I could tell you something for your own comfort.\"\n\"He will not try again, you think?\"\n\"I am sure he will not.\"\n\"I wonder what he fears. I should fear nothing,--nothing. Why should not we walk out of the house, and be married any way? Nobody has a right to stop me. Papa could only turn me out of his house. I will venture if he will.\"\nIt seemed to Hetta that even listening to such a proposition amounted to falsehood,--to that guilt of which Mr. Melmotte had dared to suppose that she could be capable. \"I cannot listen to it. Indeed I cannot listen to it. My brother is sure that he cannot--cannot--\"\n\"Cannot love me, Hetta! Say it out, if it is true.\"\n\"It is true,\" said Hetta. There came over the face of the other girl a stern hard look, as though she had resolved at the moment to throw away from her all soft womanly things. And she relaxed her hold on Hetta's waist. \"Oh, my dear, I do not mean to be cruel, but you ask me for the truth.\"\n\"Yes; I did.\"\n\"Men are not, I think, like girls.\"\n\"I suppose not,\" said Marie slowly. \"What liars they are, what brutes;--what wretches! Why should he tell me lies like that? Why should he break my heart? That other man never said that he loved me. Did he never love me,--once?\"\nHetta could hardly say that her brother was incapable of such love as Marie expected, but she knew that it was so. \"It is better that you should think of him no more.\"\n\"Are you like that? If you had loved a man and told him of it, and agreed to be his wife and done as I have, could you bear to be told to think of him no more,--just as though you had got rid of a servant or a horse? I won't love him. No;--I'll hate him. But I must think of him. I'll marry that other man to spite him, and then, when he finds that we are rich, he'll be broken-hearted.\"\n\"You should try to forgive him, Marie.\"\n\"Never. Do not tell him that I forgive him. I command you not to tell him that. Tell him,--tell him, that I hate him, and that if I ever meet him, I will look at him so that he shall never forget it. I could,--oh!--you do not know what I could do. Tell me;--did he tell you to say that he did not love me?\"\n\"I wish I had not come,\" said Hetta.\n\"I am glad you have come. It was very kind. I don't hate you. Of course I ought to know. But did he say that I was to be told that he did not love me?\"\n\"No;--he did not say that.\"\n\"Then how do you know? What did he say?\"\n\"That it was all over.\"\n\"Because he is afraid of papa. Are you sure he does not love me?\"\n\"I am sure.\"\n\"Then he is a brute. Tell him that I say that he is a false-hearted liar, and that I trample him under my foot.\" Marie as she said this thrust her foot upon the ground as though that false one were in truth beneath it,--and spoke aloud, as though regardless who might hear her. \"I despise him;--despise him. They are all bad, but he is the worst of all. Papa beats me, but I can bear that. Mamma reviles me and I can bear that. He might have beaten me and reviled me, and I could have borne it. But to think that he was a liar all the time;--that I can't bear.\" Then she burst into tears. Hetta kissed her, tried to comfort her, and left her sobbing on the sofa.\nLater in the day, two or three hours after Miss Carbury had gone, Marie Melmotte, who had not shown herself at luncheon, walked into Madame Melmotte's room, and thus declared her purpose. \"You can tell papa that I will marry Lord Nidderdale whenever he pleases.\" She spoke in French and very rapidly.\nOn hearing this Madame Melmotte expressed herself to be delighted. \"Your papa,\" said she, \"will be very glad to hear that you have thought better of this at last. Lord Nidderdale is, I am sure, a very good young man.\"\n\"Yes,\" continued Marie, boiling over with passion as she spoke. \"I'll marry Lord Nidderdale, or that horrid Mr. Grendall who is worse than all the others, or his old fool of a father,--or the sweeper at the crossing,--or the black man that waits at table, or anybody else that he chooses to pick up. I don't care who it is the least in the world. But I'll lead him such a life afterwards! I'll make Lord Nidderdale repent the hour he saw me! You may tell papa.\" And then, having thus entrusted her message to Madame Melmotte, Marie left the room.",
        "paragraph_chars": [
            [
                0,
                1712
            ],
            [
                1712,
                1985
            ],
            [
                1985,
                2077
            ],
            [
                2077,
                2156
            ],
            [
                2156,
                2258
            ],
            [
                2258,
                2283
            ],
            [
                2283,
                2470
            ],
            [
                2470,
                3240
            ],
            [
                3240,
                4708
            ],
            [
                4708,
                4743
            ],
            [
                4743,
                4883
            ],
            [
                4883,
                4936
            ],
            [
                4936,
                6201
            ],
            [
                6201,
                6345
            ],
            [
                6345,
                7003
            ],
            [
                7003,
                7121
            ],
            [
                7121,
                7153
            ],
            [
                7153,
                7272
            ],
            [
                7272,
                8194
            ],
            [
                8194,
                8239
            ],
            [
                8239,
                8710
            ],
            [
                8710,
                8860
            ],
            [
                8860,
                8935
            ],
            [
                8935,
                9171
            ],
            [
                9171,
                9212
            ],
            [
                9212,
                9232
            ],
            [
                9232,
                9389
            ],
            [
                9389,
                9839
            ],
            [
                9839,
                9887
            ],
            [
                9887,
                9983
            ],
            [
                9983,
                10004
            ],
            [
                10004,
                10734
            ],
            [
                10734,
                10953
            ],
            [
                10953,
                11164
            ],
            [
                11164,
                11222
            ],
            [
                11222,
                11258
            ],
            [
                11258,
                11283
            ],
            [
                11283,
                11507
            ],
            [
                11507,
                11775
            ],
            [
                11775,
                11827
            ],
            [
                11827,
                12119
            ],
            [
                12119,
                12133
            ],
            [
                12133,
                12169
            ],
            [
                12169,
                12398
            ],
            [
                12398,
                12566
            ],
            [
                12566,
                12954
            ],
            [
                12954,
                12994
            ],
            [
                12994,
                13301
            ],
            [
                13301,
                13338
            ],
            [
                13338,
                13490
            ],
            [
                13490,
                13518
            ],
            [
                13518,
                13559
            ],
            [
                13559,
                13583
            ],
            [
                13583,
                13649
            ],
            [
                13649,
                13662
            ],
            [
                13662,
                14325
            ],
            [
                14325,
                14626
            ],
            [
                14626,
                14844
            ],
            [
                14844,
                15390
            ]
        ],
        "segment_chars": [
            [
                0,
                36
            ],
            [
                36,
                128
            ],
            [
                128,
                308
            ],
            [
                308,
                415
            ],
            [
                415,
                511
            ],
            [
                511,
                632
            ],
            [
                632,
                704
            ],
            [
                704,
                776
            ],
            [
                776,
                863
            ],
            [
                863,
                956
            ],
            [
                956,
                1126
            ],
            [
                1126,
                1197
            ],
            [
                1197,
                1291
            ],
            [
                1291,
                1443
            ],
            [
                1443,
                1489
            ],
            [
                1489,
                1533
            ],
            [
                1533,
                1712
            ],
            [
                1712,
                1762
            ],
            [
                1762,
                1830
            ],
            [
                1830,
                1900
            ],
            [
                1900,
                1962
            ],
            [
                1962,
                1985
            ],
            [
                1985,
                2077
            ],
            [
                2077,
                2120
            ],
            [
                2120,
                2156
            ],
            [
                2156,
                2183
            ],
            [
                2183,
                2211
            ],
            [
                2211,
                2258
            ],
            [
                2258,
                2283
            ],
            [
                2283,
                2310
            ],
            [
                2310,
                2351
            ],
            [
                2351,
                2373
            ],
            [
                2373,
                2416
            ],
            [
                2416,
                2470
            ],
            [
                2470,
                2538
            ],
            [
                2538,
                2714
            ],
            [
                2714,
                2801
            ],
            [
                2801,
                2840
            ],
            [
                2840,
                2906
            ],
            [
                2906,
                2933
            ],
            [
                2933,
                3004
            ],
            [
                3004,
                3075
            ],
            [
                3075,
                3126
            ],
            [
                3126,
                3203
            ],
            [
                3203,
                3240
            ],
            [
                3240,
                3296
            ],
            [
                3296,
                3409
            ],
            [
                3409,
                3516
            ],
            [
                3516,
                3585
            ],
            [
                3585,
                3773
            ],
            [
                3773,
                3825
            ],
            [
                3825,
                3911
            ],
            [
                3911,
                3954
            ],
            [
                3954,
                4116
            ],
            [
                4116,
                4181
            ],
            [
                4181,
                4237
            ],
            [
                4237,
                4515
            ],
            [
                4515,
                4587
            ],
            [
                4587,
                4614
            ],
            [
                4614,
                4671
            ],
            [
                4671,
                4708
            ],
            [
                4708,
                4743
            ],
            [
                4743,
                4800
            ],
            [
                4800,
                4883
            ],
            [
                4883,
                4936
            ],
            [
                4936,
                4999
            ],
            [
                4999,
                5122
            ],
            [
                5122,
                5148
            ],
            [
                5148,
                5224
            ],
            [
                5224,
                5418
            ],
            [
                5418,
                5464
            ],
            [
                5464,
                5628
            ],
            [
                5628,
                5800
            ],
            [
                5800,
                5889
            ],
            [
                5889,
                5964
            ],
            [
                5964,
                6026
            ],
            [
                6026,
                6156
            ],
            [
                6156,
                6201
            ],
            [
                6201,
                6296
            ],
            [
                6296,
                6345
            ],
            [
                6345,
                6377
            ],
            [
                6377,
                6423
            ],
            [
                6423,
                6505
            ],
            [
                6505,
                6648
            ],
            [
                6648,
                6711
            ],
            [
                6711,
                6747
            ],
            [
                6747,
                6851
            ],
            [
                6851,
                6959
            ],
            [
                6959,
                6993
            ],
            [
                6993,
                7003
            ],
            [
                7003,
                7070
            ],
            [
                7070,
                7121
            ],
            [
                7121,
                7153
            ],
            [
                7153,
                7180
            ],
            [
                7180,
                7228
            ],
            [
                7228,
                7272
            ],
            [
                7272,
                7349
            ],
            [
                7349,
                7387
            ],
            [
                7387,
                7551
            ],
            [
                7551,
                7585
            ],
            [
                7585,
                7657
            ],
            [
                7657,
                7777
            ],
            [
                7777,
                7895
            ],
            [
                7895,
                7958
            ],
            [
                7958,
                8026
            ],
            [
                8026,
                8061
            ],
            [
                8061,
                8089
            ],
            [
                8089,
                8114
            ],
            [
                8114,
                8194
            ],
            [
                8194,
                8239
            ],
            [
                8239,
                8269
            ],
            [
                8269,
                8308
            ],
            [
                8308,
                8365
            ],
            [
                8365,
                8391
            ],
            [
                8391,
                8478
            ],
            [
                8478,
                8514
            ],
            [
                8514,
                8684
            ],
            [
                8684,
                8710
            ],
            [
                8710,
                8822
            ],
            [
                8822,
                8860
            ],
            [
                8860,
                8897
            ],
            [
                8897,
                8920
            ],
            [
                8920,
                8935
            ],
            [
                8935,
                8957
            ],
            [
                8957,
                9011
            ],
            [
                9011,
                9044
            ],
            [
                9044,
                9105
            ],
            [
                9105,
                9171
            ],
            [
                9171,
                9212
            ],
            [
                9212,
                9232
            ],
            [
                9232,
                9263
            ],
            [
                9263,
                9317
            ],
            [
                9317,
                9331
            ],
            [
                9331,
                9361
            ],
            [
                9361,
                9389
            ],
            [
                9389,
                9402
            ],
            [
                9402,
                9432
            ],
            [
                9432,
                9533
            ],
            [
                9533,
                9564
            ],
            [
                9564,
                9588
            ],
            [
                9588,
                9617
            ],
            [
                9617,
                9670
            ],
            [
                9670,
                9705
            ],
            [
                9705,
                9745
            ],
            [
                9745,
                9788
            ],
            [
                9788,
                9812
            ],
            [
                9812,
                9839
            ],
            [
                9839,
                9887
            ],
            [
                9887,
                9903
            ],
            [
                9903,
                9945
            ],
            [
                9945,
                9983
            ],
            [
                9983,
                10004
            ],
            [
                10004,
                10041
            ],
            [
                10041,
                10063
            ],
            [
                10063,
                10093
            ],
            [
                10093,
                10176
            ],
            [
                10176,
                10260
            ],
            [
                10260,
                10327
            ],
            [
                10327,
                10356
            ],
            [
                10356,
                10380
            ],
            [
                10380,
                10461
            ],
            [
                10461,
                10501
            ],
            [
                10501,
                10570
            ],
            [
                10570,
                10615
            ],
            [
                10615,
                10682
            ],
            [
                10682,
                10734
            ],
            [
                10734,
                10801
            ],
            [
                10801,
                10953
            ],
            [
                10953,
                11028
            ],
            [
                11028,
                11118
            ],
            [
                11118,
                11164
            ],
            [
                11164,
                11222
            ],
            [
                11222,
                11258
            ],
            [
                11258,
                11283
            ],
            [
                11283,
                11308
            ],
            [
                11308,
                11341
            ],
            [
                11341,
                11406
            ],
            [
                11406,
                11437
            ],
            [
                11437,
                11479
            ],
            [
                11479,
                11507
            ],
            [
                11507,
                11676
            ],
            [
                11676,
                11700
            ],
            [
                11700,
                11730
            ],
            [
                11730,
                11775
            ],
            [
                11775,
                11799
            ],
            [
                11799,
                11827
            ],
            [
                11827,
                11853
            ],
            [
                11853,
                12004
            ],
            [
                12004,
                12047
            ],
            [
                12047,
                12119
            ],
            [
                12119,
                12133
            ],
            [
                12133,
                12169
            ],
            [
                12169,
                12205
            ],
            [
                12205,
                12256
            ],
            [
                12256,
                12294
            ],
            [
                12294,
                12324
            ],
            [
                12324,
                12368
            ],
            [
                12368,
                12398
            ],
            [
                12398,
                12513
            ],
            [
                12513,
                12566
            ],
            [
                12566,
                12586
            ],
            [
                12586,
                12783
            ],
            [
                12783,
                12801
            ],
            [
                12801,
                12821
            ],
            [
                12821,
                12846
            ],
            [
                12846,
                12954
            ],
            [
                12954,
                12994
            ],
            [
                12994,
                13002
            ],
            [
                13002,
                13038
            ],
            [
                13038,
                13074
            ],
            [
                13074,
                13194
            ],
            [
                13194,
                13242
            ],
            [
                13242,
                13301
            ],
            [
                13301,
                13338
            ],
            [
                13338,
                13364
            ],
            [
                13364,
                13382
            ],
            [
                13382,
                13400
            ],
            [
                13400,
                13427
            ],
            [
                13427,
                13490
            ],
            [
                13490,
                13518
            ],
            [
                13518,
                13541
            ],
            [
                13541,
                13559
            ],
            [
                13559,
                13583
            ],
            [
                13583,
                13614
            ],
            [
                13614,
                13649
            ],
            [
                13649,
                13662
            ],
            [
                13662,
                13683
            ],
            [
                13683,
                13775
            ],
            [
                13775,
                13940
            ],
            [
                13940,
                13970
            ],
            [
                13970,
                14016
            ],
            [
                14016,
                14052
            ],
            [
                14052,
                14090
            ],
            [
                14090,
                14157
            ],
            [
                14157,
                14224
            ],
            [
                14224,
                14251
            ],
            [
                14251,
                14325
            ],
            [
                14325,
                14513
            ],
            [
                14513,
                14588
            ],
            [
                14588,
                14626
            ],
            [
                14626,
                14693
            ],
            [
                14693,
                14789
            ],
            [
                14789,
                14844
            ],
            [
                14844,
                14908
            ],
            [
                14908,
                15144
            ],
            [
                15144,
                15191
            ],
            [
                15191,
                15233
            ],
            [
                15233,
                15286
            ],
            [
                15286,
                15306
            ],
            [
                15306,
                15390
            ]
        ],
        "overlap_chars": [
            [
                0,
                36
            ],
            [
                327,
                336
            ],
            [
                346,
                391
            ],
            [
                396,
                415
            ],
            [
                511,
                580
            ],
            [
                606,
                612
            ],
            [
                614,
                632
            ],
            [
                632,
                702
            ],
            [
                702,
                704
            ],
            [
                776,
                819
            ],
            [
                861,
                863
            ],
            [
                867,
                878
            ],
            [
                905,
                955
            ],
            [
                956,
                1027
            ],
            [
                1045,
                1076
            ],
            [
                1100,
                1126
            ],
            [
                1197,
                1291
            ],
            [
                1291,
                1344
            ],
            [
                1441,
                1443
            ],
            [
                1489,
                1532
            ],
            [
                1712,
                1762
            ],
            [
                1762,
                1769
            ],
            [
                1789,
                1828
            ],
            [
                1845,
                1900
            ],
            [
                1900,
                1938
            ],
            [
                1940,
                1962
            ],
            [
                1962,
                1985
            ],
            [
                1985,
                2019
            ],
            [
                2037,
                2077
            ],
            [
                2077,
                2081
            ],
            [
                2118,
                2120
            ],
            [
                2120,
                2156
            ],
            [
                2156,
                2169
            ],
            [
                2174,
                2183
            ],
            [
                2211,
                2227
            ],
            [
                2239,
                2243
            ],
            [
                2245,
                2255
            ],
            [
                2310,
                2351
            ],
            [
                2351,
                2373
            ],
            [
                2416,
                2448
            ],
            [
                2450,
                2470
            ],
            [
                2492,
                2499
            ],
            [
                2548,
                2603
            ],
            [
                2714,
                2716
            ],
            [
                2721,
                2731
            ],
            [
                2484,
                2486
            ],
            [
                2732,
                2760
            ],
            [
                2499,
                2501
            ],
            [
                2766,
                2773
            ],
            [
                2536,
                2537
            ],
            [
                2801,
                2840
            ],
            [
                2906,
                2933
            ],
            [
                3004,
                3005
            ],
            [
                3018,
                3073
            ],
            [
                3240,
                3242
            ],
            [
                3130,
                3135
            ],
            [
                3260,
                3272
            ],
            [
                3172,
                3174
            ],
            [
                3278,
                3296
            ],
            [
                3409,
                3415
            ],
            [
                3461,
                3472
            ],
            [
                3479,
                3499
            ],
            [
                3435,
                3444
            ],
            [
                3499,
                3516
            ],
            [
                3516,
                3585
            ],
            [
                3585,
                3600
            ],
            [
                3627,
                3628
            ],
            [
                3601,
                3614
            ],
            [
                3633,
                3644
            ],
            [
                3649,
                3663
            ],
            [
                3689,
                3772
            ],
            [
                3784,
                3825
            ],
            [
                3825,
                3911
            ],
            [
                3954,
                3965
            ],
            [
                3970,
                3987
            ],
            [
                3989,
                4020
            ],
            [
                4029,
                4063
            ],
            [
                4072,
                4115
            ],
            [
                4116,
                4118
            ],
            [
                4123,
                4130
            ],
            [
                4138,
                4181
            ],
            [
                4324,
                4328
            ],
            [
                4202,
                4235
            ],
            [
                4196,
                4201
            ],
            [
                4252,
                4258
            ],
            [
                4188,
                4191
            ],
            [
                4312,
                4319
            ],
            [
                4270,
                4284
            ],
            [
                4338,
                4345
            ],
            [
                4235,
                4236
            ],
            [
                4515,
                4586
            ],
            [
                4587,
                4614
            ],
            [
                4614,
                4671
            ],
            [
                4671,
                4705
            ],
            [
                4744,
                4799
            ],
            [
                4883,
                4936
            ],
            [
                4936,
                4947
            ],
            [
                5128,
                5148
            ],
            [
                5148,
                5153
            ],
            [
                5170,
                5181
            ],
            [
                5183,
                5223
            ],
            [
                5224,
                5256
            ],
            [
                5383,
                5418
            ],
            [
                5418,
                5464
            ],
            [
                5464,
                5614
            ],
            [
                5618,
                5621
            ],
            [
                5615,
                5617
            ],
            [
                5622,
                5627
            ],
            [
                5628,
                5675
            ],
            [
                5721,
                5743
            ],
            [
                5798,
                5800
            ],
            [
                5889,
                5964
            ],
            [
                5964,
                5996
            ],
            [
                6024,
                6026
            ],
            [
                6026,
                6156
            ],
            [
                6156,
                6201
            ],
            [
                6201,
                6296
            ],
            [
                6296,
                6345
            ],
            [
                6345,
                6364
            ],
            [
                6367,
                6377
            ],
            [
                6423,
                6502
            ],
            [
                6649,
                6699
            ],
            [
                6701,
                6708
            ],
            [
                6874,
                6878
            ],
            [
                6883,
                6906
            ],
            [
                6871,
                6873
            ],
            [
                6879,
                6882
            ],
            [
                6920,
                6959
            ],
            [
                6959,
                6993
            ],
            [
                6993,
                7003
            ],
            [
                7153,
                7156
            ],
            [
                7178,
                7180
            ],
            [
                7180,
                7228
            ],
            [
                7228,
                7272
            ],
            [
                7272,
                7349
            ],
            [
                7349,
                7386
            ],
            [
                7551,
                7585
            ],
            [
                7585,
                7656
            ],
            [
                7662,
                7709
            ],
            [
                7734,
                7777
            ],
            [
                7777,
                7780
            ],
            [
                7826,
                7860
            ],
            [
                7878,
                7895
            ],
            [
                7895,
                7957
            ],
            [
                7958,
                8007
            ],
            [
                8024,
                8026
            ],
            [
                8026,
                8061
            ],
            [
                8061,
                8089
            ],
            [
                8089,
                8114
            ],
            [
                8114,
                8137
            ],
            [
                8153,
                8194
            ],
            [
                8194,
                8239
            ],
            [
                8239,
                8244
            ],
            [
                8246,
                8269
            ],
            [
                8269,
                8308
            ],
            [
                8308,
                8321
            ],
            [
                8346,
                8350
            ],
            [
                8330,
                8342
            ],
            [
                8351,
                8365
            ],
            [
                8391,
                8450
            ],
            [
                8456,
                8478
            ],
            [
                8478,
                8500
            ],
            [
                8502,
                8511
            ],
            [
                8685,
                8694
            ],
            [
                8698,
                8710
            ],
            [
                8822,
                8860
            ],
            [
                8920,
                8932
            ],
            [
                8880,
                8896
            ],
            [
                8935,
                8957
            ],
            [
                9044,
                9105
            ],
            [
                9105,
                9140
            ],
            [
                9154,
                9171
            ],
            [
                9171,
                9212
            ],
            [
                9212,
                9228
            ],
            [
                9232,
                9263
            ],
            [
                9263,
                9317
            ],
            [
                9317,
                9331
            ],
            [
                9331,
                9360
            ],
            [
                9361,
                9389
            ],
            [
                9389,
                9402
            ],
            [
                9402,
                9432
            ],
            [
                9533,
                9564
            ],
            [
                9564,
                9588
            ],
            [
                9588,
                9617
            ],
            [
                9617,
                9655
            ],
            [
                9668,
                9670
            ],
            [
                9731,
                9735
            ],
            [
                9728,
                9730
            ],
            [
                9736,
                9745
            ],
            [
                9745,
                9788
            ],
            [
                9788,
                9812
            ],
            [
                9812,
                9839
            ],
            [
                9839,
                9853
            ],
            [
                9857,
                9887
            ],
            [
                9887,
                9903
            ],
            [
                9945,
                9983
            ],
            [
                9983,
                9984
            ],
            [
                9996,
                10004
            ],
            [
                10004,
                10011
            ],
            [
                10013,
                10041
            ],
            [
                10041,
                10063
            ],
            [
                10063,
                10093
            ],
            [
                10093,
                10144
            ],
            [
                10153,
                10176
            ],
            [
                10176,
                10207
            ],
            [
                10328,
                10356
            ],
            [
                10356,
                10380
            ],
            [
                10432,
                10461
            ],
            [
                10461,
                10484
            ],
            [
                10491,
                10501
            ],
            [
                10501,
                10508
            ],
            [
                10519,
                10530
            ],
            [
                10538,
                10570
            ],
            [
                10615,
                10682
            ],
            [
                10682,
                10685
            ],
            [
                10688,
                10734
            ],
            [
                10734,
                10752
            ],
            [
                10758,
                10764
            ],
            [
                10918,
                10952
            ],
            [
                11164,
                11207
            ],
            [
                11212,
                11222
            ],
            [
                11222,
                11258
            ],
            [
                11258,
                11283
            ],
            [
                11283,
                11308
            ],
            [
                11308,
                11329
            ],
            [
                11339,
                11341
            ],
            [
                11341,
                11351
            ],
            [
                11356,
                11358
            ],
            [
                11352,
                11355
            ],
            [
                11359,
                11396
            ],
            [
                11404,
                11406
            ],
            [
                11406,
                11435
            ],
            [
                11773,
                11774
            ],
            [
                11700,
                11706
            ],
            [
                11730,
                11763
            ],
            [
                11709,
                11715
            ],
            [
                11775,
                11799
            ],
            [
                11799,
                11827
            ],
            [
                11827,
                11852
            ],
            [
                11853,
                11914
            ],
            [
                12004,
                12046
            ],
            [
                12047,
                12095
            ],
            [
                12100,
                12119
            ],
            [
                12119,
                12133
            ],
            [
                12133,
                12169
            ],
            [
                12169,
                12205
            ],
            [
                12205,
                12239
            ],
            [
                12241,
                12256
            ],
            [
                12294,
                12324
            ],
            [
                12368,
                12388
            ],
            [
                12395,
                12398
            ],
            [
                12513,
                12566
            ],
            [
                12566,
                12567
            ],
            [
                12571,
                12574
            ],
            [
                12584,
                12586
            ],
            [
                12586,
                12612
            ],
            [
                12633,
                12654
            ],
            [
                12673,
                12724
            ],
            [
                12781,
                12783
            ],
            [
                12783,
                12801
            ],
            [
                12801,
                12804
            ],
            [
                12806,
                12821
            ],
            [
                12821,
                12846
            ],
            [
                12846,
                12954
            ],
            [
                12954,
                12994
            ],
            [
                12994,
                13002
            ],
            [
                13002,
                13038
            ],
            [
                13074,
                13082
            ],
            [
                13095,
                13110
            ],
            [
                13192,
                13194
            ],
            [
                13252,
                13301
            ],
            [
                13301,
                13338
            ],
            [
                13338,
                13364
            ],
            [
                13364,
                13382
            ],
            [
                13382,
                13400
            ],
            [
                13614,
                13649
            ],
            [
                13649,
                13662
            ],
            [
                13662,
                13683
            ],
            [
                13683,
                13772
            ],
            [
                13941,
                13954
            ],
            [
                13968,
                13970
            ],
            [
                13992,
                14016
            ],
            [
                14016,
                14052
            ],
            [
                14052,
                14090
            ],
            [
                14090,
                14157
            ],
            [
                14157,
                14202
            ],
            [
                14204,
                14223
            ],
            [
                14224,
                14251
            ],
            [
                14251,
                14325
            ],
            [
                14343,
                14361
            ],
            [
                14325,
                14330
            ],
            [
                14389,
                14405
            ],
            [
                14446,
                14485
            ],
            [
                14491,
                14499
            ],
            [
                14513,
                14587
            ],
            [
                14693,
                14703
            ],
            [
                14717,
                14742
            ],
            [
                14703,
                14710
            ],
            [
                14642,
                14657
            ],
            [
                14691,
                14692
            ],
            [
                14844,
                14866
            ],
            [
                14906,
                14908
            ],
            [
                14908,
                14964
            ],
            [
                14997,
                15026
            ],
            [
                15029,
                15060
            ],
            [
                15100,
                15131
            ],
            [
                15142,
                15144
            ],
            [
                15144,
                15166
            ],
            [
                15189,
                15191
            ],
            [
                15191,
                15233
            ],
            [
                15233,
                15286
            ],
            [
                15286,
                15306
            ],
            [
                15306,
                15309
            ],
            [
                15316,
                15322
            ],
            [
                15328,
                15337
            ],
            [
                15342,
                15390
            ]
        ],
        "row_chars": [
            [
                0,
                36
            ],
            [
                36,
                128
            ],
            [
                128,
                308
            ],
            [
                308,
                415
            ],
            [
                415,
                511
            ],
            [
                511,
                632
            ],
            [
                632,
                704
            ],
            [
                704,
                776
            ],
            [
                776,
                863
            ],
            [
                863,
                956
            ],
            [
                956,
                1126
            ],
            [
                1126,
                1197
            ],
            [
                1197,
                1291
            ],
            [
                1291,
                1443
            ],
            [
                1443,
                1489
            ],
            [
                1489,
                1533
            ],
            [
                1533,
                1712
            ],
            [
                1712,
                1762
            ],
            [
                1762,
                1900
            ],
            [
                1900,
                1962
            ],
            [
                1962,
                1985
            ],
            [
                1985,
                2077
            ],
            [
                2077,
                2120
            ],
            [
                2120,
                2156
            ],
            [
                2156,
                2183
            ],
            [
                2183,
                2211
            ],
            [
                2211,
                2258
            ],
            [
                2258,
                2283
            ],
            [
                2283,
                2310
            ],
            [
                2310,
                2351
            ],
            [
                2351,
                2373
            ],
            [
                2373,
                2416
            ],
            [
                2416,
                2470
            ],
            [
                2470,
                2801
            ],
            [
                2801,
                2840
            ],
            [
                2840,
                2906
            ],
            [
                2906,
                2933
            ],
            [
                2933,
                3004
            ],
            [
                3004,
                3075
            ],
            [
                3075,
                3126
            ],
            [
                3126,
                3296
            ],
            [
                3296,
                3409
            ],
            [
                3409,
                3516
            ],
            [
                3516,
                3585
            ],
            [
                3585,
                3773
            ],
            [
                3773,
                3825
            ],
            [
                3825,
                3911
            ],
            [
                3911,
                3954
            ],
            [
                3954,
                4116
            ],
            [
                4116,
                4181
            ],
            [
                4181,
                4515
            ],
            [
                4515,
                4587
            ],
            [
                4587,
                4614
            ],
            [
                4614,
                4671
            ],
            [
                4671,
                4708
            ],
            [
                4708,
                4743
            ],
            [
                4743,
                4800
            ],
            [
                4800,
                4883
            ],
            [
                4883,
                4936
            ],
            [
                4936,
                4999
            ],
            [
                4999,
                5122
            ],
            [
                5122,
                5148
            ],
            [
                5148,
                5224
            ],
            [
                5224,
                5418
            ],
            [
                5418,
                5464
            ],
            [
                5464,
                5628
            ],
            [
                5628,
                5800
            ],
            [
                5800,
                5889
            ],
            [
                5889,
                5964
            ],
            [
                5964,
                6026
            ],
            [
                6026,
                6156
            ],
            [
                6156,
                6201
            ],
            [
                6201,
                6296
            ],
            [
                6296,
                6345
            ],
            [
                6345,
                6377
            ],
            [
                6377,
                6423
            ],
            [
                6423,
                6505
            ],
            [
                6505,
                6648
            ],
            [
                6648,
                6711
            ],
            [
                6711,
                6747
            ],
            [
                6747,
                6851
            ],
            [
                6851,
                6959
            ],
            [
                6959,
                6993
            ],
            [
                6993,
                7003
            ],
            [
                7003,
                7070
            ],
            [
                7070,
                7121
            ],
            [
                7121,
                7153
            ],
            [
                7153,
                7180
            ],
            [
                7180,
                7228
            ],
            [
                7228,
                7272
            ],
            [
                7272,
                7349
            ],
            [
                7349,
                7387
            ],
            [
                7387,
                7551
            ],
            [
                7551,
                7585
            ],
            [
                7585,
                7657
            ],
            [
                7657,
                7777
            ],
            [
                7777,
                7895
            ],
            [
                7895,
                7958
            ],
            [
                7958,
                8026
            ],
            [
                8026,
                8061
            ],
            [
                8061,
                8089
            ],
            [
                8089,
                8114
            ],
            [
                8114,
                8194
            ],
            [
                8194,
                8239
            ],
            [
                8239,
                8269
            ],
            [
                8269,
                8308
            ],
            [
                8308,
                8365
            ],
            [
                8365,
                8391
            ],
            [
                8391,
                8478
            ],
            [
                8478,
                8514
            ],
            [
                8514,
                8684
            ],
            [
                8684,
                8710
            ],
            [
                8710,
                8822
            ],
            [
                8822,
                8860
            ],
            [
                8860,
                8935
            ],
            [
                8935,
                8957
            ],
            [
                8957,
                9011
            ],
            [
                9011,
                9044
            ],
            [
                9044,
                9105
            ],
            [
                9105,
                9171
            ],
            [
                9171,
                9212
            ],
            [
                9212,
                9232
            ],
            [
                9232,
                9263
            ],
            [
                9263,
                9317
            ],
            [
                9317,
                9331
            ],
            [
                9331,
                9361
            ],
            [
                9361,
                9389
            ],
            [
                9389,
                9402
            ],
            [
                9402,
                9432
            ],
            [
                9432,
                9533
            ],
            [
                9533,
                9564
            ],
            [
                9564,
                9588
            ],
            [
                9588,
                9617
            ],
            [
                9617,
                9670
            ],
            [
                9670,
                9705
            ],
            [
                9705,
                9745
            ],
            [
                9745,
                9788
            ],
            [
                9788,
                9812
            ],
            [
                9812,
                9839
            ],
            [
                9839,
                9887
            ],
            [
                9887,
                9903
            ],
            [
                9903,
                9945
            ],
            [
                9945,
                9983
            ],
            [
                9983,
                10004
            ],
            [
                10004,
                10041
            ],
            [
                10041,
                10063
            ],
            [
                10063,
                10093
            ],
            [
                10093,
                10176
            ],
            [
                10176,
                10260
            ],
            [
                10260,
                10327
            ],
            [
                10327,
                10356
            ],
            [
                10356,
                10380
            ],
            [
                10380,
                10461
            ],
            [
                10461,
                10501
            ],
            [
                10501,
                10570
            ],
            [
                10570,
                10615
            ],
            [
                10615,
                10682
            ],
            [
                10682,
                10734
            ],
            [
                10734,
                10801
            ],
            [
                10801,
                10953
            ],
            [
                10953,
                11028
            ],
            [
                11028,
                11118
            ],
            [
                11118,
                11164
            ],
            [
                11164,
                11222
            ],
            [
                11222,
                11258
            ],
            [
                11258,
                11283
            ],
            [
                11283,
                11308
            ],
            [
                11308,
                11341
            ],
            [
                11341,
                11406
            ],
            [
                11406,
                11437
            ],
            [
                11437,
                11479
            ],
            [
                11479,
                11507
            ],
            [
                11507,
                11676
            ],
            [
                11676,
                11700
            ],
            [
                11700,
                11775
            ],
            [
                11775,
                11799
            ],
            [
                11799,
                11827
            ],
            [
                11827,
                11853
            ],
            [
                11853,
                12047
            ],
            [
                12047,
                12119
            ],
            [
                12119,
                12133
            ],
            [
                12133,
                12169
            ],
            [
                12169,
                12205
            ],
            [
                12205,
                12256
            ],
            [
                12256,
                12294
            ],
            [
                12294,
                12324
            ],
            [
                12324,
                12368
            ],
            [
                12368,
                12398
            ],
            [
                12398,
                12513
            ],
            [
                12513,
                12566
            ],
            [
                12566,
                12586
            ],
            [
                12586,
                12783
            ],
            [
                12783,
                12801
            ],
            [
                12801,
                12821
            ],
            [
                12821,
                12846
            ],
            [
                12846,
                12954
            ],
            [
                12954,
                12994
            ],
            [
                12994,
                13002
            ],
            [
                13002,
                13038
            ],
            [
                13038,
                13074
            ],
            [
                13074,
                13194
            ],
            [
                13194,
                13242
            ],
            [
                13242,
                13301
            ],
            [
                13301,
                13338
            ],
            [
                13338,
                13364
            ],
            [
                13364,
                13382
            ],
            [
                13382,
                13400
            ],
            [
                13400,
                13427
            ],
            [
                13427,
                13490
            ],
            [
                13490,
                13518
            ],
            [
                13518,
                13541
            ],
            [
                13541,
                13559
            ],
            [
                13559,
                13583
            ],
            [
                13583,
                13614
            ],
            [
                13614,
                13649
            ],
            [
                13649,
                13662
            ],
            [
                13662,
                13683
            ],
            [
                13683,
                13775
            ],
            [
                13775,
                13940
            ],
            [
                13940,
                13970
            ],
            [
                13970,
                14016
            ],
            [
                14016,
                14052
            ],
            [
                14052,
                14090
            ],
            [
                14090,
                14157
            ],
            [
                14157,
                14224
            ],
            [
                14224,
                14251
            ],
            [
                14251,
                14325
            ],
            [
                14325,
                14588
            ],
            [
                14588,
                14626
            ],
            [
                14626,
                14789
            ],
            [
                14789,
                14844
            ],
            [
                14844,
                14908
            ],
            [
                14908,
                15144
            ],
            [
                15144,
                15191
            ],
            [
                15191,
                15233
            ],
            [
                15233,
                15286
            ],
            [
                15286,
                15306
            ],
            [
                15306,
                15390
            ]
        ]
    },
    "abridged": {
        "text": "Poor Hetta passed a very bad night. Paul's courtship had been so graceful, so soft, so modest, and so long continued! The whole state of his mind had, she had thought, been visible to her - gentle and affectionate. He had been aware of her friends' feeling, and had therefore hesitated to declare himself. And yet his love had not been the less true. Poor Hetta had waited, having absolute confidence in his honour and love.\nAnd now she was told that this man had been playing a game so base, and so foolish, that she could find no possible cause for it. Though she was wretched and sore at heart she swore to herself that she would not believe it. She knew that her mother would write to Roger Carbury. She did not dare to appeal to Paul himself.\nBut there was other wretchedness besides her own. She had given Marie Melmotte's message to her brother, and she must now let Marie have her brother's reply. That might be told in a very few words - \"Everything is over!\" But it had to be told.\n\"I want to call upon Miss Melmotte,\" she said to her mother at breakfast.\n\"Why? I thought you hated the Melmottes?\"\n\"I don't hate her, mamma. I have a message for her, from Felix. She wanted to know if all that was over. Of course it is over. They could never be married now; could they, mamma?\"\nLady Carbury was beginning to disbelieve in the Melmotte wealth, and thought it impossible in any case that Melmotte should forgive Felix's offence.\n\"It is out of the question,\" she said. \"You can go, if you please. I doubt whether the girl will get anybody to take her now.\"\nSo Hetta made her way to Grosvenor Square. Seeing a confusion of carts and workmen outside the house, she hesitated. But she went on, and rang the bell at the door, which was wide open. Within the hall, the pilasters, wreaths and banners, which had been built up with so much trouble, were now being pulled down and hauled away.\nAmidst the ruins Melmotte himself was standing. He was now a member of Parliament, and was to take his place that night in the House. It might be only for a short time; but it should be written in the story of his life that he had sat in the House of Commons as member for Westminster.\nAt present he was careful to show himself everywhere. That morning he had already been into the City, and he was now propitiating the contractor about payment.\nHetta timidly asked one of the workmen whether Miss Melmotte was there.\n\"Do you want my daughter?\" said Melmotte coming forward, and just touching his hat. \"She is not living here at present. May I be allowed to tell her who was asking after her?\"\n\"I am Miss Carbury,\" said Hetta in a very low voice.\n\"Oh, indeed! Sir Felix's sister! May I ask whether you have any business with my daughter?\"\nThe story was a hard one to tell; but she did tell it very simply. She had come with a message from her brother. There had been something between her brother and Miss Melmotte, and her brother had felt that it would be best that he should acknowledge that it must all be over.\n\"I wonder whether that is true,\" said Melmotte, with his eyebrows knit. \"Because, you know, there has been a deal of falsehood and double dealing. Sir Felix has behaved infamously. A day or two before my daughter started, he gave me a written assurance that the whole thing was over, and now he sends you here. How am I to know what you are really after?\"\n\"I have come because I thought I could do some good,\" she said, trembling with anger and fear. \"I was speaking to your daughter at your party.\"\n\"Oh, you were there, were you? When one has been deceived like that, one is apt to be suspicious, Miss Carbury. You are not plotting another journey to Liverpool; are you? I will take you across to Bruton Street to see her.\"\nAt his bidding she walked by his side. \"May I hear what you say to her?\" he asked.\n\"No. But I have told you, and you can say it for me. If you please, I think I will go home now.\"\nBut Melmotte knew that his daughter would not believe him on such a subject. This girl she probably would believe.\n\"Oh, you shall see her,\" he said. \"I don't suppose she's such a fool as to try that kind of thing again.\"\nThe door in Bruton Street was opened, and Hetta found herself almost pushed into the hall. She was left alone in the drawing-room for a long time. Then the door was slowly opened and Marie crept into the room.\n\"Miss Carbury,\" she said, \"this is so good of you! I do so love you for coming to me! You said you would love me. You will; will you not?\" and Marie, sitting down, took her hand and encircled her waist.\n\"Mr. Melmotte has told you why I have come.\"\n\"Yes; that is, I don't know. I never believe what papa says to me.\" To poor Hetta this announcement was horrible. \"He thinks I ought to do just what he tells me, as though my soul were not my own. I won't agree to that; would you? What does Felix say, dear?\"\n\"It must all be over, Miss Melmotte.\"\n\"Is that all, Miss Carbury?\"\n\"What more can I say? I gave him your message, and I have brought back the answer. My brother, you know, has no income - nothing at all.\"\n\"But I have,\" said Marie with eagerness.\n\"But your father-\"\n\"It does not depend upon papa. If papa treats me badly, I can give it to my husband. I know I can. If I can venture, cannot he?\"\n\"I think it is impossible.\"\n\"Impossible! Nothing should be impossible. Does he love me, Miss Carbury? It all depends on that. That's what I want to know.\" She paused, but Hetta could not answer. \"Does he love me? If you know I think you ought to tell me.\" Hetta was still silent. \"Have you nothing to say?\"\n\"Miss Melmotte-\" began poor Hetta very slowly.\n\"Call me Marie. I don't even know what your name is.\"\n\"Hetta.\"\n\"Hetta; that's short for something. But it's very pretty. I have no brother, no sister. And I'll tell you, though you must not tell anybody: I have no real mother. Madame Melmotte is not my mamma. And papa is so cruel to me! He beats me sometimes.\" Hetta shuddered as she heard this. \"But I never will yield for that. When he thumps me I turn and gnash my teeth at him. Can you be surprised that I should be always thinking of my lover? But if he doesn't love me, what am I to do then?\"\n\"I don't know what to say.\" Hetta's heart was melted with sympathy. \"I wish I could tell you something for your comfort.\"\n\"He will not try again, you think?\"\n\"I am sure he will not.\"\n\"I wonder what he fears. I should fear nothing. Why should we not walk out of the house, and be married anyway? Nobody has a right to stop me.\"\n\"Indeed my brother is sure that he cannot - cannot-\"\n\"Cannot love me, Hetta! Say it out, if it is true.\"\n\"It is true,\" said Hetta.\nThere came over the face of the other girl a stern hard look, and she relaxed her hold on Hetta's waist.\n\"Oh, my dear, I do not mean to be cruel, but you asked me for the truth.\"\n\"Yes; I did.\"\n\"Men are not, I think, like girls.\"\n\"I suppose not,\" said Marie slowly. \"What liars they are, what brutes; what wretches! Why should he break my heart? Did he never love me?\"\n\"It is better that you should think of him no more.\"\n\"Could you? If you had loved a man and agreed to be his wife, could you bear to be told to think of him no more? I won't love him. No; I'll hate him. But I must think of him. I'll marry that other man to spite him, and then, when he finds that we are rich, he'll be broken-hearted.\"\n\"You should try to forgive him, Marie.\"\n\"Never. Do not tell him that I forgive him. Tell him that I hate him. Did he tell you to say that he did not love me?\"\n\"I wish I had not come,\" said Hetta.\n\"I am glad you have come. It was very kind. I don't hate you. But are you sure he does not love me?\"\n\"I am sure.\"\n\"Then he is a brute. Tell him that I say that he is a false-hearted liar, and that I trample him under my foot. I despise him. He is the worst of all. Papa beats me, but I can bear that. Mamma reviles me and I can bear that. He might have beaten me and reviled me, and I could have borne it. But to think that he was a liar all the time; that I can't bear.\"\nThen she burst into tears. Hetta kissed her, tried to comfort her, and left her sobbing on the sofa.\nTwo or three hours later, Marie Melmotte walked into Madame Melmotte's room, and declared: \"You can tell papa that I will marry Lord Nidderdale whenever he pleases.\"\n\"Your papa will be very glad to hear it,\" said Madame Melmotte.\n\"Yes,\" continued Marie passionately. \"I'll marry Lord Nidderdale, or that horrid Mr. Grendall, or his old fool of a father - or the sweeper at the crossing, or anybody else that he chooses. I don't care who it is. But I'll lead him such a life afterwards! I'll make Lord Nidderdale repent the hour he saw me! You may tell papa.\" And having entrusted this message to Madame Melmotte, Marie left the room.",
        "paragraph_chars": [
            [
                0,
                425
            ],
            [
                425,
                748
            ],
            [
                748,
                992
            ],
            [
                992,
                1066
            ],
            [
                1066,
                1108
            ],
            [
                1108,
                1288
            ],
            [
                1288,
                1437
            ],
            [
                1437,
                1564
            ],
            [
                1564,
                1893
            ],
            [
                1893,
                2179
            ],
            [
                2179,
                2339
            ],
            [
                2339,
                2411
            ],
            [
                2411,
                2587
            ],
            [
                2587,
                2640
            ],
            [
                2640,
                2732
            ],
            [
                2732,
                3009
            ],
            [
                3009,
                3365
            ],
            [
                3365,
                3509
            ],
            [
                3509,
                3734
            ],
            [
                3734,
                3817
            ],
            [
                3817,
                3914
            ],
            [
                3914,
                4029
            ],
            [
                4029,
                4135
            ],
            [
                4135,
                4345
            ],
            [
                4345,
                4548
            ],
            [
                4548,
                4593
            ],
            [
                4593,
                4852
            ],
            [
                4852,
                4890
            ],
            [
                4890,
                4919
            ],
            [
                4919,
                5057
            ],
            [
                5057,
                5098
            ],
            [
                5098,
                5117
            ],
            [
                5117,
                5246
            ],
            [
                5246,
                5274
            ],
            [
                5274,
                5553
            ],
            [
                5553,
                5600
            ],
            [
                5600,
                5654
            ],
            [
                5654,
                5663
            ],
            [
                5663,
                6150
            ],
            [
                6150,
                6272
            ],
            [
                6272,
                6308
            ],
            [
                6308,
                6333
            ],
            [
                6333,
                6477
            ],
            [
                6477,
                6530
            ],
            [
                6530,
                6582
            ],
            [
                6582,
                6608
            ],
            [
                6608,
                6713
            ],
            [
                6713,
                6787
            ],
            [
                6787,
                6801
            ],
            [
                6801,
                6837
            ],
            [
                6837,
                6976
            ],
            [
                6976,
                7029
            ],
            [
                7029,
                7312
            ],
            [
                7312,
                7352
            ],
            [
                7352,
                7471
            ],
            [
                7471,
                7508
            ],
            [
                7508,
                7609
            ],
            [
                7609,
                7622
            ],
            [
                7622,
                7980
            ],
            [
                7980,
                8081
            ],
            [
                8081,
                8247
            ],
            [
                8247,
                8311
            ],
            [
                8311,
                8714
            ]
        ],
        "segment_chars": [
            [
                0,
                36
            ],
            [
                36,
                118
            ],
            [
                118,
                215
            ],
            [
                215,
                306
            ],
            [
                306,
                351
            ],
            [
                351,
                425
            ],
            [
                425,
                555
            ],
            [
                555,
                649
            ],
            [
                649,
                704
            ],
            [
                704,
                748
            ],
            [
                748,
                798
            ],
            [
                798,
                906
            ],
            [
                906,
                969
            ],
            [
                969,
                992
            ],
            [
                992,
                1066
            ],
            [
                1066,
                1072
            ],
            [
                1072,
                1108
            ],
            [
                1108,
                1134
            ],
            [
                1134,
                1172
            ],
            [
                1172,
                1213
            ],
            [
                1213,
                1235
            ],
            [
                1235,
                1288
            ],
            [
                1288,
                1437
            ],
            [
                1437,
                1476
            ],
            [
                1476,
                1504
            ],
            [
                1504,
                1564
            ],
            [
                1564,
                1607
            ],
            [
                1607,
                1681
            ],
            [
                1681,
                1750
            ],
            [
                1750,
                1893
            ],
            [
                1893,
                1941
            ],
            [
                1941,
                2027
            ],
            [
                2027,
                2179
            ],
            [
                2179,
                2233
            ],
            [
                2233,
                2339
            ],
            [
                2339,
                2411
            ],
            [
                2411,
                2438
            ],
            [
                2438,
                2495
            ],
            [
                2495,
                2531
            ],
            [
                2531,
                2587
            ],
            [
                2587,
                2640
            ],
            [
                2640,
                2653
            ],
            [
                2653,
                2673
            ],
            [
                2673,
                2732
            ],
            [
                2732,
                2799
            ],
            [
                2799,
                2845
            ],
            [
                2845,
                3009
            ],
            [
                3009,
                3081
            ],
            [
                3081,
                3156
            ],
            [
                3156,
                3190
            ],
            [
                3190,
                3320
            ],
            [
                3320,
                3365
            ],
            [
                3365,
                3460
            ],
            [
                3460,
                3509
            ],
            [
                3509,
                3540
            ],
            [
                3540,
                3621
            ],
            [
                3621,
                3681
            ],
            [
                3681,
                3734
            ],
            [
                3734,
                3773
            ],
            [
                3773,
                3807
            ],
            [
                3807,
                3817
            ],
            [
                3817,
                3822
            ],
            [
                3822,
                3870
            ],
            [
                3870,
                3914
            ],
            [
                3914,
                3991
            ],
            [
                3991,
                4029
            ],
            [
                4029,
                4063
            ],
            [
                4063,
                4135
            ],
            [
                4135,
                4226
            ],
            [
                4226,
                4282
            ],
            [
                4282,
                4345
            ],
            [
                4345,
                4396
            ],
            [
                4396,
                4431
            ],
            [
                4431,
                4459
            ],
            [
                4459,
                4484
            ],
            [
                4484,
                4548
            ],
            [
                4548,
                4593
            ],
            [
                4593,
                4622
            ],
            [
                4622,
                4661
            ],
            [
                4661,
                4707
            ],
            [
                4707,
                4790
            ],
            [
                4790,
                4824
            ],
            [
                4824,
                4852
            ],
            [
                4852,
                4890
            ],
            [
                4890,
                4919
            ],
            [
                4919,
                4941
            ],
            [
                4941,
                5002
            ],
            [
                5002,
                5057
            ],
            [
                5057,
                5098
            ],
            [
                5098,
                5117
            ],
            [
                5117,
                5148
            ],
            [
                5148,
                5202
            ],
            [
                5202,
                5216
            ],
            [
                5216,
                5246
            ],
            [
                5246,
                5274
            ],
            [
                5274,
                5287
            ],
            [
                5287,
                5317
            ],
            [
                5317,
                5348
            ],
            [
                5348,
                5372
            ],
            [
                5372,
                5401
            ],
            [
                5401,
                5441
            ],
            [
                5441,
                5459
            ],
            [
                5459,
                5502
            ],
            [
                5502,
                5526
            ],
            [
                5526,
                5553
            ],
            [
                5553,
                5600
            ],
            [
                5600,
                5616
            ],
            [
                5616,
                5654
            ],
            [
                5654,
                5663
            ],
            [
                5663,
                5699
            ],
            [
                5699,
                5721
            ],
            [
                5721,
                5751
            ],
            [
                5751,
                5827
            ],
            [
                5827,
                5860
            ],
            [
                5860,
                5888
            ],
            [
                5888,
                5912
            ],
            [
                5912,
                5947
            ],
            [
                5947,
                5981
            ],
            [
                5981,
                6033
            ],
            [
                6033,
                6100
            ],
            [
                6100,
                6150
            ],
            [
                6150,
                6178
            ],
            [
                6178,
                6218
            ],
            [
                6218,
                6272
            ],
            [
                6272,
                6308
            ],
            [
                6308,
                6333
            ],
            [
                6333,
                6358
            ],
            [
                6358,
                6381
            ],
            [
                6381,
                6445
            ],
            [
                6445,
                6477
            ],
            [
                6477,
                6530
            ],
            [
                6530,
                6554
            ],
            [
                6554,
                6582
            ],
            [
                6582,
                6608
            ],
            [
                6608,
                6713
            ],
            [
                6713,
                6787
            ],
            [
                6787,
                6801
            ],
            [
                6801,
                6837
            ],
            [
                6837,
                6873
            ],
            [
                6873,
                6923
            ],
            [
                6923,
                6953
            ],
            [
                6953,
                6976
            ],
            [
                6976,
                7029
            ],
            [
                7029,
                7041
            ],
            [
                7041,
                7142
            ],
            [
                7142,
                7160
            ],
            [
                7160,
                7179
            ],
            [
                7179,
                7204
            ],
            [
                7204,
                7312
            ],
            [
                7312,
                7352
            ],
            [
                7352,
                7360
            ],
            [
                7360,
                7396
            ],
            [
                7396,
                7422
            ],
            [
                7422,
                7471
            ],
            [
                7471,
                7508
            ],
            [
                7508,
                7534
            ],
            [
                7534,
                7552
            ],
            [
                7552,
                7570
            ],
            [
                7570,
                7609
            ],
            [
                7609,
                7622
            ],
            [
                7622,
                7643
            ],
            [
                7643,
                7734
            ],
            [
                7734,
                7749
            ],
            [
                7749,
                7773
            ],
            [
                7773,
                7809
            ],
            [
                7809,
                7847
            ],
            [
                7847,
                7914
            ],
            [
                7914,
                7980
            ],
            [
                7980,
                8007
            ],
            [
                8007,
                8081
            ],
            [
                8081,
                8247
            ],
            [
                8247,
                8311
            ],
            [
                8311,
                8348
            ],
            [
                8348,
                8501
            ],
            [
                8501,
                8525
            ],
            [
                8525,
                8567
            ],
            [
                8567,
                8620
            ],
            [
                8620,
                8640
            ],
            [
                8640,
                8714
            ]
        ],
        "overlap_chars": [
            [
                0,
                36
            ],
            [
                43,
                52
            ],
            [
                53,
                98
            ],
            [
                99,
                118
            ],
            [
                118,
                187
            ],
            [
                190,
                196
            ],
            [
                197,
                215
            ],
            [
                215,
                285
            ],
            [
                304,
                306
            ],
            [
                306,
                349
            ],
            [
                349,
                351
            ],
            [
                362,
                373
            ],
            [
                374,
                424
            ],
            [
                425,
                496
            ],
            [
                497,
                528
            ],
            [
                529,
                555
            ],
            [
                555,
                649
            ],
            [
                649,
                702
            ],
            [
                702,
                704
            ],
            [
                704,
                747
            ],
            [
                748,
                798
            ],
            [
                798,
                805
            ],
            [
                812,
                851
            ],
            [
                851,
                906
            ],
            [
                906,
                944
            ],
            [
                947,
                969
            ],
            [
                969,
                992
            ],
            [
                992,
                1026
            ],
            [
                1026,
                1066
            ],
            [
                1066,
                1070
            ],
            [
                1070,
                1072
            ],
            [
                1072,
                1108
            ],
            [
                1108,
                1121
            ],
            [
                1125,
                1134
            ],
            [
                1134,
                1150
            ],
            [
                1155,
                1159
            ],
            [
                1160,
                1170
            ],
            [
                1172,
                1213
            ],
            [
                1213,
                1235
            ],
            [
                1235,
                1267
            ],
            [
                1268,
                1288
            ],
            [
                1293,
                1300
            ],
            [
                1301,
                1356
            ],
            [
                1365,
                1367
            ],
            [
                1368,
                1378
            ],
            [
                1379,
                1381
            ],
            [
                1391,
                1419
            ],
            [
                1425,
                1427
            ],
            [
                1428,
                1435
            ],
            [
                1435,
                1436
            ],
            [
                1437,
                1476
            ],
            [
                1477,
                1504
            ],
            [
                1504,
                1505
            ],
            [
                1506,
                1561
            ],
            [
                1564,
                1566
            ],
            [
                1567,
                1572
            ],
            [
                1573,
                1585
            ],
            [
                1586,
                1588
            ],
            [
                1589,
                1607
            ],
            [
                1607,
                1613
            ],
            [
                1614,
                1625
            ],
            [
                1626,
                1646
            ],
            [
                1655,
                1664
            ],
            [
                1664,
                1681
            ],
            [
                1681,
                1750
            ],
            [
                1750,
                1765
            ],
            [
                1765,
                1766
            ],
            [
                1767,
                1780
            ],
            [
                1782,
                1793
            ],
            [
                1794,
                1808
            ],
            [
                1809,
                1892
            ],
            [
                1900,
                1941
            ],
            [
                1941,
                2027
            ],
            [
                2027,
                2038
            ],
            [
                2044,
                2061
            ],
            [
                2062,
                2093
            ],
            [
                2100,
                2134
            ],
            [
                2135,
                2178
            ],
            [
                2179,
                2181
            ],
            [
                2182,
                2189
            ],
            [
                2190,
                2233
            ],
            [
                2233,
                2237
            ],
            [
                2246,
                2279
            ],
            [
                2279,
                2284
            ],
            [
                2285,
                2291
            ],
            [
                2292,
                2295
            ],
            [
                2296,
                2303
            ],
            [
                2309,
                2323
            ],
            [
                2330,
                2337
            ],
            [
                2337,
                2338
            ],
            [
                2339,
                2410
            ],
            [
                2411,
                2438
            ],
            [
                2438,
                2495
            ],
            [
                2495,
                2529
            ],
            [
                2531,
                2586
            ],
            [
                2587,
                2640
            ],
            [
                2640,
                2651
            ],
            [
                2653,
                2673
            ],
            [
                2673,
                2678
            ],
            [
                2679,
                2690
            ],
            [
                2691,
                2731
            ],
            [
                2732,
                2764
            ],
            [
                2764,
                2799
            ],
            [
                2799,
                2845
            ],
            [
                2845,
                2995
            ],
            [
                2996,
                2999
            ],
            [
                3000,
                3002
            ],
            [
                3003,
                3008
            ],
            [
                3009,
                3056
            ],
            [
                3057,
                3079
            ],
            [
                3079,
                3081
            ],
            [
                3081,
                3156
            ],
            [
                3156,
                3188
            ],
            [
                3188,
                3190
            ],
            [
                3190,
                3320
            ],
            [
                3320,
                3365
            ],
            [
                3365,
                3460
            ],
            [
                3460,
                3509
            ],
            [
                3509,
                3528
            ],
            [
                3530,
                3540
            ],
            [
                3540,
                3619
            ],
            [
                3621,
                3671
            ],
            [
                3672,
                3679
            ],
            [
                3688,
                3692
            ],
            [
                3697,
                3720
            ],
            [
                3721,
                3723
            ],
            [
                3728,
                3731
            ],
            [
                3734,
                3773
            ],
            [
                3773,
                3807
            ],
            [
                3807,
                3817
            ],
            [
                3817,
                3820
            ],
            [
                3820,
                3822
            ],
            [
                3822,
                3870
            ],
            [
                3870,
                3914
            ],
            [
                3914,
                3991
            ],
            [
                3991,
                4028
            ],
            [
                4029,
                4063
            ],
            [
                4063,
                4134
            ],
            [
                4135,
                4182
            ],
            [
                4183,
                4226
            ],
            [
                4226,
                4229
            ],
            [
                4230,
                4264
            ],
            [
                4265,
                4282
            ],
            [
                4282,
                4344
            ],
            [
                4345,
                4394
            ],
            [
                4394,
                4396
            ],
            [
                4396,
                4431
            ],
            [
                4431,
                4459
            ],
            [
                4459,
                4484
            ],
            [
                4484,
                4507
            ],
            [
                4507,
                4548
            ],
            [
                4548,
                4593
            ],
            [
                4593,
                4598
            ],
            [
                4599,
                4622
            ],
            [
                4622,
                4661
            ],
            [
                4661,
                4674
            ],
            [
                4675,
                4679
            ],
            [
                4680,
                4692
            ],
            [
                4693,
                4707
            ],
            [
                4708,
                4767
            ],
            [
                4768,
                4790
            ],
            [
                4790,
                4812
            ],
            [
                4813,
                4822
            ],
            [
                4824,
                4833
            ],
            [
                4840,
                4852
            ],
            [
                4852,
                4890
            ],
            [
                4890,
                4902
            ],
            [
                4902,
                4918
            ],
            [
                4919,
                4941
            ],
            [
                4941,
                5002
            ],
            [
                5002,
                5037
            ],
            [
                5040,
                5057
            ],
            [
                5057,
                5098
            ],
            [
                5098,
                5114
            ],
            [
                5117,
                5148
            ],
            [
                5148,
                5202
            ],
            [
                5202,
                5216
            ],
            [
                5216,
                5245
            ],
            [
                5246,
                5274
            ],
            [
                5274,
                5287
            ],
            [
                5287,
                5317
            ],
            [
                5317,
                5348
            ],
            [
                5348,
                5372
            ],
            [
                5372,
                5401
            ],
            [
                5401,
                5439
            ],
            [
                5439,
                5441
            ],
            [
                5442,
                5446
            ],
            [
                5447,
                5449
            ],
            [
                5450,
                5459
            ],
            [
                5459,
                5502
            ],
            [
                5502,
                5526
            ],
            [
                5526,
                5553
            ],
            [
                5553,
                5567
            ],
            [
                5570,
                5600
            ],
            [
                5600,
                5616
            ],
            [
                5616,
                5654
            ],
            [
                5654,
                5655
            ],
            [
                5655,
                5663
            ],
            [
                5663,
                5670
            ],
            [
                5671,
                5699
            ],
            [
                5699,
                5721
            ],
            [
                5721,
                5751
            ],
            [
                5751,
                5802
            ],
            [
                5804,
                5827
            ],
            [
                5827,
                5858
            ],
            [
                5860,
                5888
            ],
            [
                5888,
                5912
            ],
            [
                5918,
                5947
            ],
            [
                5947,
                5970
            ],
            [
                5971,
                5981
            ],
            [
                5981,
                5988
            ],
            [
                5989,
                6000
            ],
            [
                6001,
                6033
            ],
            [
                6033,
                6100
            ],
            [
                6100,
                6103
            ],
            [
                6104,
                6150
            ],
            [
                6150,
                6168
            ],
            [
                6169,
                6175
            ],
            [
                6183,
                6217
            ],
            [
                6218,
                6261
            ],
            [
                6262,
                6272
            ],
            [
                6272,
                6308
            ],
            [
                6308,
                6333
            ],
            [
                6333,
                6358
            ],
            [
                6358,
                6379
            ],
            [
                6379,
                6381
            ],
            [
                6381,
                6391
            ],
            [
                6392,
                6394
            ],
            [
                6395,
                6398
            ],
            [
                6399,
                6436
            ],
            [
                6443,
                6445
            ],
            [
                6445,
                6474
            ],
            [
                6477,
                6478
            ],
            [
                6478,
                6484
            ],
            [
                6485,
                6518
            ],
            [
                6521,
                6527
            ],
            [
                6530,
                6554
            ],
            [
                6554,
                6582
            ],
            [
                6582,
                6607
            ],
            [
                6608,
                6669
            ],
            [
                6670,
                6712
            ],
            [
                6713,
                6761
            ],
            [
                6768,
                6787
            ],
            [
                6787,
                6801
            ],
            [
                6801,
                6837
            ],
            [
                6837,
                6873
            ],
            [
                6873,
                6907
            ],
            [
                6908,
                6923
            ],
            [
                6923,
                6953
            ],
            [
                6953,
                6973
            ],
            [
                6973,
                6976
            ],
            [
                6976,
                7029
            ],
            [
                7029,
                7030
            ],
            [
                7036,
                7039
            ],
            [
                7039,
                7041
            ],
            [
                7041,
                7067
            ],
            [
                7068,
                7089
            ],
            [
                7089,
                7140
            ],
            [
                7140,
                7142
            ],
            [
                7142,
                7160
            ],
            [
                7160,
                7163
            ],
            [
                7164,
                7179
            ],
            [
                7179,
                7204
            ],
            [
                7204,
                7312
            ],
            [
                7312,
                7352
            ],
            [
                7352,
                7360
            ],
            [
                7360,
                7396
            ],
            [
                7396,
                7404
            ],
            [
                7405,
                7420
            ],
            [
                7420,
                7422
            ],
            [
                7422,
                7471
            ],
            [
                7471,
                7508
            ],
            [
                7508,
                7534
            ],
            [
                7534,
                7552
            ],
            [
                7552,
                7570
            ],
            [
                7574,
                7609
            ],
            [
                7609,
                7622
            ],
            [
                7622,
                7643
            ],
            [
                7643,
                7732
            ],
            [
                7734,
                7747
            ],
            [
                7747,
                7749
            ],
            [
                7749,
                7773
            ],
            [
                7773,
                7809
            ],
            [
                7809,
                7847
            ],
            [
                7847,
                7914
            ],
            [
                7914,
                7959
            ],
            [
                7960,
                7979
            ],
            [
                7980,
                8007
            ],
            [
                8007,
                8081
            ],
            [
                8081,
                8099
            ],
            [
                8100,
                8105
            ],
            [
                8105,
                8121
            ],
            [
                8122,
                8161
            ],
            [
                8162,
                8170
            ],
            [
                8172,
                8246
            ],
            [
                8247,
                8257
            ],
            [
                8258,
                8283
            ],
            [
                8286,
                8293
            ],
            [
                8294,
                8309
            ],
            [
                8309,
                8310
            ],
            [
                8311,
                8333
            ],
            [
                8346,
                8348
            ],
            [
                8348,
                8404
            ],
            [
                8404,
                8433
            ],
            [
                8436,
                8467
            ],
            [
                8468,
                8499
            ],
            [
                8499,
                8501
            ],
            [
                8501,
                8523
            ],
            [
                8523,
                8525
            ],
            [
                8525,
                8567
            ],
            [
                8567,
                8620
            ],
            [
                8620,
                8640
            ],
            [
                8640,
                8643
            ],
            [
                8644,
                8650
            ],
            [
                8651,
                8660
            ],
            [
                8666,
                8714
            ]
        ],
        "row_chars": [
            [
                0,
                36
            ],
            [
                36,
                36
            ],
            [
                36,
                36
            ],
            [
                36,
                118
            ],
            [
                118,
                118
            ],
            [
                118,
                215
            ],
            [
                215,
                306
            ],
            [
                306,
                306
            ],
            [
                306,
                351
            ],
            [
                351,
                425
            ],
            [
                425,
                555
            ],
            [
                555,
                555
            ],
            [
                555,
                649
            ],
            [
                649,
                704
            ],
            [
                704,
                704
            ],
            [
                704,
                748
            ],
            [
                748,
                748
            ],
            [
                748,
                798
            ],
            [
                798,
                906
            ],
            [
                906,
                969
            ],
            [
                969,
                992
            ],
            [
                992,
                1066
            ],
            [
                1066,
                1072
            ],
            [
                1072,
                1108
            ],
            [
                1108,
                1134
            ],
            [
                1134,
                1134
            ],
            [
                1134,
                1172
            ],
            [
                1172,
                1172
            ],
            [
                1172,
                1172
            ],
            [
                1172,
                1213
            ],
            [
                1213,
                1235
            ],
            [
                1235,
                1235
            ],
            [
                1235,
                1288
            ],
            [
                1288,
                1437
            ],
            [
                1437,
                1476
            ],
            [
                1476,
                1476
            ],
            [
                1476,
                1504
            ],
            [
                1504,
                1504
            ],
            [
                1504,
                1564
            ],
            [
                1564,
                1564
            ],
            [
                1564,
                1607
            ],
            [
                1607,
                1607
            ],
            [
                1607,
                1681
            ],
            [
                1681,
                1750
            ],
            [
                1750,
                1893
            ],
            [
                1893,
                1941
            ],
            [
                1941,
                2027
            ],
            [
                2027,
                2027
            ],
            [
                2027,
                2179
            ],
            [
                2179,
                2233
            ],
            [
                2233,
                2339
            ],
            [
                2339,
                2411
            ],
            [
                2411,
                2438
            ],
            [
                2438,
                2495
            ],
            [
                2495,
                2531
            ],
            [
                2531,
                2531
            ],
            [
                2531,
                2587
            ],
            [
                2587,
                2587
            ],
            [
                2587,
                2640
            ],
            [
                2640,
                2653
            ],
            [
                2653,
                2653
            ],
            [
                2653,
                2673
            ],
            [
                2673,
                2732
            ],
            [
                2732,
                2799
            ],
            [
                2799,
                2845
            ],
            [
                2845,
                3009
            ],
            [
                3009,
                3081
            ],
            [
                3081,
                3081
            ],
            [
                3081,
                3156
            ],
            [
                3156,
                3190
            ],
            [
                3190,
                3320
            ],
            [
                3320,
                3365
            ],
            [
                3365,
                3460
            ],
            [
                3460,
                3509
            ],
            [
                3509,
                3540
            ],
            [
                3540,
                3540
            ],
            [
                3540,
                3621
            ],
            [
                3621,
                3621
            ],
            [
                3621,
                3681
            ],
            [
                3681,
                3681
            ],
            [
                3681,
                3681
            ],
            [
                3681,
                3773
            ],
            [
                3773,
                3807
            ],
            [
                3807,
                3817
            ],
            [
                3817,
                3817
            ],
            [
                3817,
                3817
            ],
            [
                3817,
                3817
            ],
            [
                3817,
                3822
            ],
            [
                3822,
                3870
            ],
            [
                3870,
                3914
            ],
            [
                3914,
                3991
            ],
            [
                3991,
                4029
            ],
            [
                4029,
                4029
            ],
            [
                4029,
                4063
            ],
            [
                4063,
                4135
            ],
            [
                4135,
                4226
            ],
            [
                4226,
                4282
            ],
            [
                4282,
                4345
            ],
            [
                4345,
                4396
            ],
            [
                4396,
                4431
            ],
            [
                4431,
                4459
            ],
            [
                4459,
                4484
            ],
            [
                4484,
                4548
            ],
            [
                4548,
                4593
            ],
            [
                4593,
                4622
            ],
            [
                4622,
                4661
            ],
            [
                4661,
                4707
            ],
            [
                4707,
                4707
            ],
            [
                4707,
                4790
            ],
            [
                4790,
                4824
            ],
            [
                4824,
                4824
            ],
            [
                4824,
                4852
            ],
            [
                4852,
                4852
            ],
            [
                4852,
                4890
            ],
            [
                4890,
                4919
            ],
            [
                4919,
                4941
            ],
            [
                4941,
                4941
            ],
            [
                4941,
                4941
            ],
            [
                4941,
                5002
            ],
            [
                5002,
                5057
            ],
            [
                5057,
                5098
            ],
            [
                5098,
                5117
            ],
            [
                5117,
                5148
            ],
            [
                5148,
                5202
            ],
            [
                5202,
                5216
            ],
            [
                5216,
                5246
            ],
            [
                5246,
                5274
            ],
            [
                5274,
                5287
            ],
            [
                5287,
                5317
            ],
            [
                5317,
                5317
            ],
            [
                5317,
                5348
            ],
            [
                5348,
                5372
            ],
            [
                5372,
                5401
            ],
            [
                5401,
                5441
            ],
            [
                5441,
                5441
            ],
            [
                5441,
                5459
            ],
            [
                5459,
                5502
            ],
            [
                5502,
                5526
            ],
            [
                5526,
                5553
            ],
            [
                5553,
                5600
            ],
            [
                5600,
                5616
            ],
            [
                5616,
                5616
            ],
            [
                5616,
                5654
            ],
            [
                5654,
                5663
            ],
            [
                5663,
                5699
            ],
            [
                5699,
                5721
            ],
            [
                5721,
                5751
            ],
            [
                5751,
                5827
            ],
            [
                5827,
                5860
            ],
            [
                5860,
                5860
            ],
            [
                5860,
                5888
            ],
            [
                5888,
                5912
            ],
            [
                5912,
                5947
            ],
            [
                5947,
                5981
            ],
            [
                5981,
                6033
            ],
            [
                6033,
                6033
            ],
            [
                6033,
                6100
            ],
            [
                6100,
                6150
            ],
            [
                6150,
                6178
            ],
            [
                6178,
                6218
            ],
            [
                6218,
                6218
            ],
            [
                6218,
                6218
            ],
            [
                6218,
                6218
            ],
            [
                6218,
                6272
            ],
            [
                6272,
                6308
            ],
            [
                6308,
                6333
            ],
            [
                6333,
                6358
            ],
            [
                6358,
                6381
            ],
            [
                6381,
                6445
            ],
            [
                6445,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6530
            ],
            [
                6530,
                6554
            ],
            [
                6554,
                6582
            ],
            [
                6582,
                6608
            ],
            [
                6608,
                6713
            ],
            [
                6713,
                6787
            ],
            [
                6787,
                6801
            ],
            [
                6801,
                6837
            ],
            [
                6837,
                6873
            ],
            [
                6873,
                6923
            ],
            [
                6923,
                6923
            ],
            [
                6923,
                6953
            ],
            [
                6953,
                6953
            ],
            [
                6953,
                6976
            ],
            [
                6976,
                6976
            ],
            [
                6976,
                7029
            ],
            [
                7029,
                7041
            ],
            [
                7041,
                7142
            ],
            [
                7142,
                7160
            ],
            [
                7160,
                7179
            ],
            [
                7179,
                7204
            ],
            [
                7204,
                7312
            ],
            [
                7312,
                7352
            ],
            [
                7352,
                7360
            ],
            [
                7360,
                7396
            ],
            [
                7396,
                7396
            ],
            [
                7396,
                7422
            ],
            [
                7422,
                7422
            ],
            [
                7422,
                7471
            ],
            [
                7471,
                7508
            ],
            [
                7508,
                7534
            ],
            [
                7534,
                7552
            ],
            [
                7552,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7570
            ],
            [
                7570,
                7609
            ],
            [
                7609,
                7622
            ],
            [
                7622,
                7643
            ],
            [
                7643,
                7734
            ],
            [
                7734,
                7734
            ],
            [
                7734,
                7749
            ],
            [
                7749,
                7773
            ],
            [
                7773,
                7809
            ],
            [
                7809,
                7847
            ],
            [
                7847,
                7914
            ],
            [
                7914,
                7980
            ],
            [
                7980,
                8007
            ],
            [
                8007,
                8081
            ],
            [
                8081,
                8247
            ],
            [
                8247,
                8247
            ],
            [
                8247,
                8311
            ],
            [
                8311,
                8311
            ],
            [
                8311,
                8348
            ],
            [
                8348,
                8501
            ],
            [
                8501,
                8525
            ],
            [
                8525,
                8567
            ],
            [
                8567,
                8620
            ],
            [
                8620,
                8640
            ],
            [
                8640,
                8714
            ]
        ]
    }
}