{
    "original": {
        "text": "Roger Carbury said well that it was very improbable that he and his cousin, the widow, should agree in their opinions as to the expedience of fortune-hunting by marriage. It was impossible that they should ever understand each other. To Lady Carbury the prospect of a union between her son and Miss Melmotte was one of unmixed joy and triumph. Could it have been possible that Marie Melmotte should be rich and her father be a man doomed to a deserved sentence in a penal settlement, there might perhaps be a doubt about it. The wealth even in that case would certainly carry the day against the disgrace, and Lady Carbury would find reasons why \"poor Marie\" should not be punished for her father's sins, even while enjoying the money which those sins had produced. But how different were the existing facts? Mr. Melmotte was not at the galleys, but was entertaining duchesses in Grosvenor Square. People said that Mr. Melmotte had a reputation throughout Europe as a gigantic swindler,--as one who in the dishonest and successful pursuit of wealth had stopped at nothing. People said of him that he had framed and carried out long premeditated and deeply laid schemes for the ruin of those who had trusted him, that he had swallowed up the property of all who had come in contact with him, that he was fed with the blood of widows and children;--but what was all this to Lady Carbury? If the duchesses condoned it all, did it become her to be prudish? People also said that Melmotte would yet get a fall,--that a man who had risen after such a fashion never could long keep his head up. But he might keep his head up long enough to give Marie her fortune. And then Felix wanted a fortune so badly;--was so exactly the young man who ought to marry a fortune! To Lady Carbury there was no second way of looking at the matter.\nAnd to Roger Carbury also there was no second way of looking at it. That condonation of antecedents which, in the hurry of the world, is often vouchsafed to success, that growing feeling which induces people to assert to themselves that they are not bound to go outside the general verdict, and that they may shake hands with whomsoever the world shakes hands with, had never reached him. The old-fashioned idea that the touching of pitch will defile still prevailed with him. He was a gentleman;--and would have felt himself disgraced to enter the house of such a one as Augustus Melmotte. Not all the duchesses in the peerage, or all the money in the city, could alter his notions or induce him to modify his conduct. But he knew that it would be useless for him to explain this to Lady Carbury. He trusted, however, that one of the family might be taught to appreciate the difference between honour and dishonour. Henrietta Carbury had, he thought, a higher turn of mind than her mother, and had as yet been kept free from soil. As for Felix,--he had so grovelled in the gutters as to be dirt all over. Nothing short of the prolonged sufferings of half a life could cleanse him.\nHe found Henrietta alone in the drawing-room. \"Have you seen Felix?\" she said, as soon as they had greeted each other.\n\"Yes. I caught him in the street.\"\n\"We are so unhappy about him.\"\n\"I cannot say but that you have reason. I think, you know, that your mother indulges him foolishly.\"\n\"Poor mamma! She worships the very ground he treads on.\"\n\"Even a mother should not throw her worship away like that. The fact is that your brother will ruin you both if this goes on.\"\n\"What can mamma do?\"\n\"Leave London, and then refuse to pay a shilling on his behalf.\"\n\"What would Felix do in the country?\"\n\"If he did nothing, how much better would that be than what he does in town? You would not like him to become a professional gambler.\"\n\"Oh, Mr. Carbury; you do not mean that he does that!\"\n\"It seems cruel to say such things to you,--but in a matter of such importance one is bound to speak the truth. I have no influence over your mother; but you may have some. She asks my advice, but has not the slightest idea of listening to it. I don't blame her for that; but I am anxious for the sake of--, for the sake of the family.\"\n\"I am sure you are.\"\n\"Especially for your sake. You will never throw him over.\"\n\"You would not ask me to throw him over.\"\n\"But he may drag you into the mud. For his sake you have already been taken into the house of that man Melmotte.\"\n\"I do not think that I shall be injured by anything of that kind,\" said Henrietta, drawing herself up.\n\"Pardon me if I seem to interfere.\"\n\"Oh, no;--it is no interference from you.\"\n\"Pardon me then if I am rough. To me it seems that an injury is done to you if you are made to go to the house of such a one as this man. Why does your mother seek his society? Not because she likes him; not because she has any sympathy with him or his family;--but simply because there is a rich daughter.\"\n\"Everybody goes there, Mr. Carbury.\"\n\"Yes,--that is the excuse which everybody makes. Is that sufficient reason for you to go to a man's house? Is there not another place to which we are told that a great many are going, simply because the road has become thronged and fashionable? Have you no feeling that you ought to choose your friends for certain reasons of your own? I admit there is one reason here. They have a great deal of money, and it is thought possible that he may get some of it by falsely swearing to a girl that he loves her. After what you have heard, are the Melmottes people with whom you would wish to be connected?\"\n\"I don't know.\"\n\"I do. I know very well. They are absolutely disgraceful. A social connection with the first crossing-sweeper would be less objectionable.\" He spoke with a degree of energy of which he was himself altogether unaware. He knit his brows, and his eyes flashed, and his nostrils were extended. Of course she thought of his own offer to herself. Of course her mind at once conceived,--not that the Melmotte connection could ever really affect him, for she felt sure that she would never accept his offer,--but that he might think that he would be so affected. Of course she resented the feeling which she thus attributed to him. But, in truth, he was much too simple-minded for any such complex idea. \"Felix,\" he continued, \"has already descended so far that I cannot pretend to be anxious as to what houses he may frequent. But I should be sorry to think that you should often be seen at Mr. Melmotte's.\"\n\"I think, Mr. Carbury, that mamma will take care that I am not taken where I ought not to be taken.\"\n\"I wish you to have some opinion of your own as to what is proper for you.\"\n\"I hope I have. I am sorry you should think that I have not.\"\n\"I am old-fashioned, Hetta.\"\n\"And we belong to a newer and worse sort of world. I dare say it is so. You have been always very kind, but I almost doubt whether you can change us now. I have sometimes thought that you and mamma were hardly fit for each other.\"\n\"I have thought that you and I were,--or possibly might be fit for each other.\"\n\"Oh,--as for me, I shall always take mamma's side. If mamma chooses to go to the Melmottes I shall certainly go with her. If that is contamination, I suppose I must be contaminated. I don't see why I'm to consider myself better than any one else.\"\n\"I have always thought that you were better than any one else.\"\n\"That was before I went to the Melmottes. I am sure you have altered your opinion now. Indeed, you have told me so. I am afraid, Mr. Carbury, you must go your way, and we must go ours.\"\nHe looked into her face as she spoke, and gradually began to perceive the working of her mind. He was so true himself that he did not understand that there should be with her even that violet-coloured tinge of prevarication which women assume as an additional charm. Could she really have thought that he was attending to his own possible future interests when he warned her as to the making of new acquaintances?\n\"For myself,\" he said, putting out his hand and making a slight vain effort to get hold of hers, \"I have only one wish in the world; and that is, to travel the same road with you. I do not say that you ought to wish it too; but you ought to know that I am sincere. When I spoke of the Melmottes, did you believe that I was thinking of myself?\"\n\"Oh no;--how should I?\"\n\"I was speaking to you then as to a cousin who might regard me as an elder brother. No contact with legions of Melmottes could make you other to me than the woman on whom my heart has settled. Even were you in truth disgraced,--could disgrace touch one so pure as you,--it would be the same. I love you so well that I have already taken you for better or for worse. I cannot change. My nature is too stubborn for such changes. Have you a word to say to comfort me?\" She turned away her head, but did not answer him at once. \"Do you understand how much I am in need of comfort?\"\n\"You can do very well without comfort from me.\"\n\"No, indeed. I shall live, no doubt; but I shall not do very well. As it is, I am not doing at all well. I am becoming sour and moody, and ill at ease with my friends. I would have you believe me, at any rate, when I say I love you.\"\n\"I suppose you mean something.\"\n\"I mean a great deal, dear. I mean all that a man can mean. That is it. You hardly understand that I am serious to the extent of ecstatic joy on the one side, and utter indifference to the world on the other. I shall never give it up till I learn that you are to be married to some one else.\"\n\"What can I say, Mr. Carbury?\"\n\"That you will love me.\"\n\"But if I don't?\"\n\"Say that you will try.\"\n\"No; I will not say that. Love should come without a struggle. I don't know how one person is to try to love another in that way. I like you very much; but being married is such a terrible thing.\"\n\"It would not be terrible to me, dear.\"\n\"Yes;--when you found that I was too young for your tastes.\"\n\"I shall persevere, you know. Will you assure me of this,--that if you promise your hand to another man, you will let me know at once?\"\n\"I suppose I may promise that,\" she said, after pausing for a moment.\n\"There is no one as yet?\"\n\"There is no one. But, Mr. Carbury, you have no right to question me. I don't think it generous. I allow you to say things that nobody else could say because you are a cousin and because mamma trusts you so much. No one but mamma has a right to ask me whether I care for any one.\"\n\"Are you angry with me?\"\n\"No.\"\n\"If I have offended you it is because I love you so dearly.\"\n\"I am not offended, but I don't like to be questioned by a gentleman. I don't think any girl would like it. I am not to tell everybody all that happens.\"\n\"Perhaps when you reflect how much of my happiness depends upon it you will forgive me. Good-bye now.\" She put out her hand to him and allowed it to remain in his for a moment. \"When I walk about the old shrubberies at Carbury where we used to be together, I am always asking myself what chance there is of your walking there as the mistress.\"\n\"There is no chance.\"\n\"I am, of course, prepared to hear you say so. Well; good-bye, and may God bless you.\"\nThe man had no poetry about him. He did not even care for romance. All the outside belongings of love which are so pleasant to many men and which to many women afford the one sweetness in life which they really relish, were nothing to him. There are both men and women to whom even the delays and disappointments of love are charming, even when they exist to the detriment of hope. It is sweet to such persons to be melancholy, sweet to pine, sweet to feel that they are now wretched after a romantic fashion as have been those heroes and heroines of whose sufferings they have read in poetry. But there was nothing of this with Roger Carbury. He had, as he believed, found the woman that he really wanted, who was worthy of his love, and now, having fixed his heart upon her, he longed for her with an amazing longing. He had spoken the simple truth when he declared that life had become indifferent to him without her. No man in England could be less likely to throw himself off the Monument or to blow out his brains. But he felt numbed in all the joints of his mind by this sorrow. He could not make one thing bear upon another, so as to console himself after any fashion. There was but one thing for him;--to persevere till he got her, or till he had finally lost her. And should the latter be his fate, as he began to fear that it would be, then, he would live, but live only, like a crippled man.\nHe felt almost sure in his heart of hearts that the girl loved that other, younger man. That she had never owned to such love he was quite sure. The man himself and Henrietta also had both assured him on this point, and he was a man easily satisfied by words and prone to believe. But he knew that Paul Montague was attached to her, and that it was Paul's intention to cling to his love. Sorrowfully looking forward through the vista of future years, he thought he saw that Henrietta would become Paul's wife. Were it so, what should he do? Annihilate himself as far as all personal happiness in the world was concerned, and look solely to their happiness, their prosperity, and their joys? Be as it were a beneficent old fairy to them, though the agony of his own disappointment should never depart from him? Should he do this, and be blessed by them,--or should he let Paul Montague know what deep resentment such ingratitude could produce? When had a father been kinder to a son, or a brother to a brother, than he had been to Paul? His home had been the young man's home, and his purse the young man's purse. What right could the young man have to come upon him just as he was perfecting his bliss and rob him of all that he had in the world? He was conscious all the while that there was a something wrong in his argument,--that Paul when he commenced to love the girl knew nothing of his friend's love,--that the girl, though Paul had never come in the way, might probably have been as obdurate as she was now to his entreaties. He knew all this because his mind was clear. But yet the injustice,--at any rate, the misery was so great, that to forgive it and to reward it would be weak, womanly, and foolish. Roger Carbury did not quite believe in the forgiveness of injuries. If you pardon all the evil done to you, you encourage others to do you evil! If you give your cloak to him who steals your coat, how long will it be before your shirt and trousers will go also? Roger Carbury returned that afternoon to Suffolk, and as he thought of it all throughout the journey, he resolved that he would never forgive Paul Montague if Paul Montague should become his cousin's husband.",
        "paragraph_chars": [
            [
                0,
                1825
            ],
            [
                1825,
                3007
            ],
            [
                3007,
                3126
            ],
            [
                3126,
                3161
            ],
            [
                3161,
                3192
            ],
            [
                3192,
                3293
            ],
            [
                3293,
                3350
            ],
            [
                3350,
                3477
            ],
            [
                3477,
                3498
            ],
            [
                3498,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3736
            ],
            [
                3736,
                3790
            ],
            [
                3790,
                4127
            ],
            [
                4127,
                4148
            ],
            [
                4148,
                4207
            ],
            [
                4207,
                4249
            ],
            [
                4249,
                4363
            ],
            [
                4363,
                4466
            ],
            [
                4466,
                4502
            ],
            [
                4502,
                4545
            ],
            [
                4545,
                4853
            ],
            [
                4853,
                4890
            ],
            [
                4890,
                5491
            ],
            [
                5491,
                5507
            ],
            [
                5507,
                6408
            ],
            [
                6408,
                6509
            ],
            [
                6509,
                6585
            ],
            [
                6585,
                6647
            ],
            [
                6647,
                6676
            ],
            [
                6676,
                6907
            ],
            [
                6907,
                6987
            ],
            [
                6987,
                7235
            ],
            [
                7235,
                7299
            ],
            [
                7299,
                7485
            ],
            [
                7485,
                7899
            ],
            [
                7899,
                8243
            ],
            [
                8243,
                8267
            ],
            [
                8267,
                8845
            ],
            [
                8845,
                8893
            ],
            [
                8893,
                9127
            ],
            [
                9127,
                9159
            ],
            [
                9159,
                9452
            ],
            [
                9452,
                9483
            ],
            [
                9483,
                9508
            ],
            [
                9508,
                9526
            ],
            [
                9526,
                9551
            ],
            [
                9551,
                9748
            ],
            [
                9748,
                9788
            ],
            [
                9788,
                9849
            ],
            [
                9849,
                9985
            ],
            [
                9985,
                10055
            ],
            [
                10055,
                10081
            ],
            [
                10081,
                10362
            ],
            [
                10362,
                10387
            ],
            [
                10387,
                10393
            ],
            [
                10393,
                10454
            ],
            [
                10454,
                10608
            ],
            [
                10608,
                10952
            ],
            [
                10952,
                10974
            ],
            [
                10974,
                11061
            ],
            [
                11061,
                12465
            ],
            [
                12465,
                14650
            ]
        ],
        "segment_chars": [
            [
                0,
                171
            ],
            [
                171,
                234
            ],
            [
                234,
                344
            ],
            [
                344,
                525
            ],
            [
                525,
                766
            ],
            [
                766,
                809
            ],
            [
                809,
                898
            ],
            [
                898,
                1073
            ],
            [
                1073,
                1386
            ],
            [
                1386,
                1453
            ],
            [
                1453,
                1588
            ],
            [
                1588,
                1657
            ],
            [
                1657,
                1759
            ],
            [
                1759,
                1825
            ],
            [
                1825,
                1893
            ],
            [
                1893,
                2214
            ],
            [
                2214,
                2302
            ],
            [
                2302,
                2416
            ],
            [
                2416,
                2545
            ],
            [
                2545,
                2623
            ],
            [
                2623,
                2742
            ],
            [
                2742,
                2857
            ],
            [
                2857,
                2931
            ],
            [
                2931,
                3007
            ],
            [
                3007,
                3053
            ],
            [
                3053,
                3076
            ],
            [
                3076,
                3126
            ],
            [
                3126,
                3132
            ],
            [
                3132,
                3161
            ],
            [
                3161,
                3192
            ],
            [
                3192,
                3232
            ],
            [
                3232,
                3293
            ],
            [
                3293,
                3306
            ],
            [
                3306,
                3350
            ],
            [
                3350,
                3410
            ],
            [
                3410,
                3477
            ],
            [
                3477,
                3498
            ],
            [
                3498,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3678
            ],
            [
                3678,
                3736
            ],
            [
                3736,
                3790
            ],
            [
                3790,
                3902
            ],
            [
                3902,
                3963
            ],
            [
                3963,
                4034
            ],
            [
                4034,
                4127
            ],
            [
                4127,
                4148
            ],
            [
                4148,
                4175
            ],
            [
                4175,
                4207
            ],
            [
                4207,
                4249
            ],
            [
                4249,
                4284
            ],
            [
                4284,
                4363
            ],
            [
                4363,
                4466
            ],
            [
                4466,
                4502
            ],
            [
                4502,
                4545
            ],
            [
                4545,
                4576
            ],
            [
                4576,
                4683
            ],
            [
                4683,
                4722
            ],
            [
                4722,
                4853
            ],
            [
                4853,
                4890
            ],
            [
                4890,
                4939
            ],
            [
                4939,
                4997
            ],
            [
                4997,
                5135
            ],
            [
                5135,
                5226
            ],
            [
                5226,
                5260
            ],
            [
                5260,
                5396
            ],
            [
                5396,
                5491
            ],
            [
                5491,
                5507
            ],
            [
                5507,
                5514
            ],
            [
                5514,
                5532
            ],
            [
                5532,
                5565
            ],
            [
                5565,
                5647
            ],
            [
                5647,
                5724
            ],
            [
                5724,
                5797
            ],
            [
                5797,
                5848
            ],
            [
                5848,
                6062
            ],
            [
                6062,
                6131
            ],
            [
                6131,
                6203
            ],
            [
                6203,
                6327
            ],
            [
                6327,
                6408
            ],
            [
                6408,
                6509
            ],
            [
                6509,
                6585
            ],
            [
                6585,
                6601
            ],
            [
                6601,
                6647
            ],
            [
                6647,
                6676
            ],
            [
                6676,
                6727
            ],
            [
                6727,
                6748
            ],
            [
                6748,
                6830
            ],
            [
                6830,
                6907
            ],
            [
                6907,
                6987
            ],
            [
                6987,
                7038
            ],
            [
                7038,
                7109
            ],
            [
                7109,
                7169
            ],
            [
                7169,
                7235
            ],
            [
                7235,
                7299
            ],
            [
                7299,
                7341
            ],
            [
                7341,
                7386
            ],
            [
                7386,
                7415
            ],
            [
                7415,
                7485
            ],
            [
                7485,
                7580
            ],
            [
                7580,
                7752
            ],
            [
                7752,
                7899
            ],
            [
                7899,
                8079
            ],
            [
                8079,
                8164
            ],
            [
                8164,
                8243
            ],
            [
                8243,
                8267
            ],
            [
                8267,
                8351
            ],
            [
                8351,
                8460
            ],
            [
                8460,
                8559
            ],
            [
                8559,
                8633
            ],
            [
                8633,
                8650
            ],
            [
                8650,
                8694
            ],
            [
                8694,
                8733
            ],
            [
                8733,
                8791
            ],
            [
                8791,
                8845
            ],
            [
                8845,
                8893
            ],
            [
                8893,
                8906
            ],
            [
                8906,
                8960
            ],
            [
                8960,
                8998
            ],
            [
                8998,
                9061
            ],
            [
                9061,
                9127
            ],
            [
                9127,
                9159
            ],
            [
                9159,
                9187
            ],
            [
                9187,
                9219
            ],
            [
                9219,
                9231
            ],
            [
                9231,
                9368
            ],
            [
                9368,
                9452
            ],
            [
                9452,
                9483
            ],
            [
                9483,
                9508
            ],
            [
                9508,
                9526
            ],
            [
                9526,
                9551
            ],
            [
                9551,
                9577
            ],
            [
                9577,
                9614
            ],
            [
                9614,
                9681
            ],
            [
                9681,
                9748
            ],
            [
                9748,
                9788
            ],
            [
                9788,
                9849
            ],
            [
                9849,
                9879
            ],
            [
                9879,
                9985
            ],
            [
                9985,
                10055
            ],
            [
                10055,
                10081
            ],
            [
                10081,
                10099
            ],
            [
                10099,
                10151
            ],
            [
                10151,
                10178
            ],
            [
                10178,
                10294
            ],
            [
                10294,
                10362
            ],
            [
                10362,
                10387
            ],
            [
                10387,
                10393
            ],
            [
                10393,
                10454
            ],
            [
                10454,
                10524
            ],
            [
                10524,
                10562
            ],
            [
                10562,
                10608
            ],
            [
                10608,
                10696
            ],
            [
                10696,
                10711
            ],
            [
                10711,
                10785
            ],
            [
                10785,
                10952
            ],
            [
                10952,
                10974
            ],
            [
                10974,
                11021
            ],
            [
                11021,
                11061
            ],
            [
                11061,
                11094
            ],
            [
                11094,
                11128
            ],
            [
                11128,
                11301
            ],
            [
                11301,
                11443
            ],
            [
                11443,
                11655
            ],
            [
                11655,
                11705
            ],
            [
                11705,
                11881
            ],
            [
                11881,
                11982
            ],
            [
                11982,
                12082
            ],
            [
                12082,
                12147
            ],
            [
                12147,
                12238
            ],
            [
                12238,
                12335
            ],
            [
                12335,
                12465
            ],
            [
                12465,
                12553
            ],
            [
                12553,
                12610
            ],
            [
                12610,
                12746
            ],
            [
                12746,
                12853
            ],
            [
                12853,
                12975
            ],
            [
                12975,
                13006
            ],
            [
                13006,
                13156
            ],
            [
                13156,
                13275
            ],
            [
                13275,
                13408
            ],
            [
                13408,
                13501
            ],
            [
                13501,
                13578
            ],
            [
                13578,
                13712
            ],
            [
                13712,
                14000
            ],
            [
                14000,
                14045
            ],
            [
                14045,
                14180
            ],
            [
                14180,
                14248
            ],
            [
                14248,
                14325
            ],
            [
                14325,
                14442
            ],
            [
                14442,
                14650
            ]
        ],
        "overlap_chars": [
            [
                76,
                79
            ],
            [
                139,
                169
            ],
            [
                74,
                75
            ],
            [
                171,
                193
            ],
            [
                0,
                5
            ],
            [
                60,
                63
            ],
            [
                6,
                13
            ],
            [
                199,
                234
            ],
            [
                234,
                318
            ],
            [
                327,
                344
            ],
            [
                536,
                540
            ],
            [
                686,
                696
            ],
            [
                604,
                605
            ],
            [
                525,
                535
            ],
            [
                554,
                583
            ],
            [
                764,
                765
            ],
            [
                811,
                829
            ],
            [
                844,
                898
            ],
            [
                898,
                914
            ],
            [
                1097,
                1099
            ],
            [
                928,
                986
            ],
            [
                995,
                998
            ],
            [
                1049,
                1052
            ],
            [
                1115,
                1126
            ],
            [
                1161,
                1211
            ],
            [
                1016,
                1019
            ],
            [
                1220,
                1289
            ],
            [
                917,
                918
            ],
            [
                1080,
                1084
            ],
            [
                1291,
                1345
            ],
            [
                1347,
                1386
            ],
            [
                1386,
                1414
            ],
            [
                1418,
                1419
            ],
            [
                1441,
                1453
            ],
            [
                1453,
                1489
            ],
            [
                1500,
                1504
            ],
            [
                1570,
                1586
            ],
            [
                1565,
                1569
            ],
            [
                1586,
                1588
            ],
            [
                1588,
                1657
            ],
            [
                1657,
                1671
            ],
            [
                1700,
                1732
            ],
            [
                1742,
                1759
            ],
            [
                1759,
                1787
            ],
            [
                1795,
                1825
            ],
            [
                1825,
                1893
            ],
            [
                2214,
                2275
            ],
            [
                2300,
                2302
            ],
            [
                2302,
                2321
            ],
            [
                2323,
                2369
            ],
            [
                2406,
                2414
            ],
            [
                2374,
                2379
            ],
            [
                2414,
                2416
            ],
            [
                2416,
                2437
            ],
            [
                2454,
                2456
            ],
            [
                2465,
                2482
            ],
            [
                2484,
                2507
            ],
            [
                2543,
                2545
            ],
            [
                2545,
                2581
            ],
            [
                2590,
                2623
            ],
            [
                2623,
                2648
            ],
            [
                2667,
                2742
            ],
            [
                2742,
                2814
            ],
            [
                2855,
                2856
            ],
            [
                3007,
                3053
            ],
            [
                3053,
                3076
            ],
            [
                3076,
                3084
            ],
            [
                3124,
                3126
            ],
            [
                3126,
                3132
            ],
            [
                3132,
                3161
            ],
            [
                3161,
                3192
            ],
            [
                3232,
                3293
            ],
            [
                3293,
                3306
            ],
            [
                3306,
                3322
            ],
            [
                3328,
                3350
            ],
            [
                3350,
                3410
            ],
            [
                3427,
                3477
            ],
            [
                3477,
                3498
            ],
            [
                3498,
                3516
            ],
            [
                3522,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3678
            ],
            [
                3678,
                3736
            ],
            [
                3736,
                3790
            ],
            [
                3790,
                3812
            ],
            [
                3831,
                3832
            ],
            [
                3834,
                3837
            ],
            [
                3882,
                3902
            ],
            [
                3902,
                3963
            ],
            [
                3963,
                3981
            ],
            [
                3995,
                4034
            ],
            [
                4034,
                4094
            ],
            [
                4114,
                4124
            ],
            [
                4149,
                4163
            ],
            [
                4138,
                4141
            ],
            [
                4173,
                4175
            ],
            [
                4257,
                4284
            ],
            [
                4284,
                4318
            ],
            [
                4330,
                4363
            ],
            [
                4363,
                4466
            ],
            [
                4466,
                4499
            ],
            [
                4505,
                4506
            ],
            [
                4561,
                4576
            ],
            [
                4596,
                4665
            ],
            [
                4678,
                4683
            ],
            [
                4683,
                4722
            ],
            [
                4722,
                4748
            ],
            [
                4807,
                4853
            ],
            [
                4853,
                4890
            ],
            [
                4890,
                4895
            ],
            [
                4897,
                4939
            ],
            [
                4939,
                4964
            ],
            [
                4995,
                4997
            ],
            [
                5135,
                5196
            ],
            [
                5216,
                5224
            ],
            [
                5205,
                5212
            ],
            [
                5224,
                5226
            ],
            [
                5423,
                5491
            ],
            [
                5491,
                5507
            ],
            [
                5514,
                5532
            ],
            [
                5532,
                5565
            ],
            [
                5565,
                5589
            ],
            [
                5600,
                5647
            ],
            [
                5647,
                5703
            ],
            [
                5715,
                5724
            ],
            [
                5724,
                5763
            ],
            [
                5795,
                5797
            ],
            [
                5797,
                5825
            ],
            [
                5830,
                5848
            ],
            [
                5887,
                5949
            ],
            [
                5973,
                5982
            ],
            [
                6008,
                6011
            ],
            [
                6017,
                6062
            ],
            [
                6072,
                6084
            ],
            [
                6129,
                6130
            ],
            [
                6136,
                6152
            ],
            [
                6158,
                6203
            ],
            [
                6203,
                6291
            ],
            [
                6325,
                6327
            ],
            [
                6327,
                6408
            ],
            [
                6408,
                6446
            ],
            [
                6467,
                6470
            ],
            [
                6447,
                6451
            ],
            [
                6477,
                6509
            ],
            [
                6509,
                6585
            ],
            [
                6585,
                6601
            ],
            [
                6601,
                6647
            ],
            [
                6647,
                6676
            ],
            [
                6676,
                6680
            ],
            [
                6727,
                6728
            ],
            [
                6681,
                6726
            ],
            [
                6748,
                6756
            ],
            [
                6762,
                6768
            ],
            [
                6757,
                6761
            ],
            [
                6769,
                6785
            ],
            [
                6793,
                6830
            ],
            [
                7038,
                7085
            ],
            [
                7096,
                7109
            ],
            [
                7109,
                7169
            ],
            [
                7169,
                7219
            ],
            [
                7228,
                7235
            ],
            [
                7235,
                7283
            ],
            [
                7292,
                7296
            ],
            [
                7299,
                7341
            ],
            [
                7341,
                7386
            ],
            [
                7415,
                7485
            ],
            [
                7485,
                7580
            ],
            [
                7752,
                7793
            ],
            [
                7807,
                7859
            ],
            [
                7880,
                7899
            ],
            [
                7899,
                7921
            ],
            [
                7947,
                7955
            ],
            [
                7963,
                7977
            ],
            [
                7938,
                7942
            ],
            [
                7994,
                8043
            ],
            [
                8045,
                8079
            ],
            [
                8097,
                8100
            ],
            [
                8140,
                8164
            ],
            [
                8164,
                8243
            ],
            [
                8243,
                8250
            ],
            [
                8252,
                8267
            ],
            [
                8267,
                8289
            ],
            [
                8295,
                8297
            ],
            [
                8301,
                8309
            ],
            [
                8349,
                8351
            ],
            [
                8351,
                8408
            ],
            [
                8415,
                8460
            ],
            [
                8559,
                8633
            ],
            [
                8633,
                8650
            ],
            [
                8650,
                8675
            ],
            [
                8692,
                8694
            ],
            [
                8694,
                8712
            ],
            [
                8720,
                8733
            ],
            [
                8733,
                8777
            ],
            [
                8789,
                8791
            ],
            [
                8791,
                8845
            ],
            [
                8845,
                8893
            ],
            [
                8906,
                8935
            ],
            [
                8972,
                8984
            ],
            [
                8949,
                8959
            ],
            [
                8998,
                9061
            ],
            [
                9078,
                9127
            ],
            [
                9127,
                9159
            ],
            [
                9159,
                9187
            ],
            [
                9187,
                9219
            ],
            [
                9219,
                9231
            ],
            [
                9231,
                9368
            ],
            [
                9368,
                9435
            ],
            [
                9445,
                9452
            ],
            [
                9452,
                9483
            ],
            [
                9483,
                9508
            ],
            [
                9508,
                9526
            ],
            [
                9526,
                9551
            ],
            [
                9551,
                9577
            ],
            [
                9577,
                9614
            ],
            [
                9614,
                9681
            ],
            [
                9681,
                9748
            ],
            [
                9748,
                9788
            ],
            [
                9788,
                9793
            ],
            [
                9795,
                9849
            ],
            [
                9849,
                9879
            ],
            [
                9913,
                9953
            ],
            [
                9879,
                9887
            ],
            [
                9963,
                9985
            ],
            [
                9985,
                9995
            ],
            [
                10014,
                10025
            ],
            [
                10053,
                10055
            ],
            [
                10055,
                10071
            ],
            [
                10075,
                10081
            ],
            [
                10081,
                10082
            ],
            [
                10091,
                10093
            ],
            [
                10097,
                10099
            ],
            [
                10099,
                10151
            ],
            [
                10151,
                10178
            ],
            [
                10178,
                10284
            ],
            [
                10292,
                10294
            ],
            [
                10301,
                10304
            ],
            [
                10294,
                10300
            ],
            [
                10305,
                10351
            ],
            [
                10359,
                10362
            ],
            [
                10393,
                10454
            ],
            [
                10454,
                10522
            ],
            [
                10608,
                10696
            ],
            [
                10696,
                10711
            ],
            [
                10711,
                10785
            ],
            [
                10785,
                10834
            ],
            [
                10863,
                10952
            ],
            [
                10952,
                10971
            ],
            [
                10974,
                11021
            ],
            [
                11021,
                11061
            ],
            [
                11061,
                11094
            ],
            [
                11128,
                11135
            ],
            [
                11275,
                11278
            ],
            [
                11155,
                11162
            ],
            [
                11280,
                11301
            ],
            [
                11301,
                11310
            ],
            [
                11316,
                11394
            ],
            [
                11441,
                11443
            ],
            [
                11443,
                11502
            ],
            [
                11644,
                11646
            ],
            [
                11551,
                11569
            ],
            [
                11653,
                11655
            ],
            [
                11655,
                11705
            ],
            [
                11805,
                11832
            ],
            [
                11836,
                11881
            ],
            [
                11881,
                11938
            ],
            [
                11950,
                11982
            ],
            [
                11982,
                11999
            ],
            [
                12009,
                12020
            ],
            [
                12058,
                12082
            ],
            [
                12082,
                12147
            ],
            [
                12238,
                12247
            ],
            [
                12252,
                12269
            ],
            [
                12272,
                12312
            ],
            [
                12317,
                12335
            ],
            [
                12335,
                12389
            ],
            [
                12395,
                12412
            ],
            [
                12414,
                12427
            ],
            [
                12444,
                12465
            ],
            [
                12465,
                12484
            ],
            [
                12508,
                12527
            ],
            [
                12551,
                12553
            ],
            [
                12553,
                12571
            ],
            [
                12581,
                12610
            ],
            [
                12626,
                12639
            ],
            [
                12645,
                12687
            ],
            [
                12744,
                12746
            ],
            [
                12746,
                12796
            ],
            [
                12851,
                12853
            ],
            [
                12853,
                12888
            ],
            [
                12902,
                12926
            ],
            [
                12934,
                12974
            ],
            [
                12975,
                13006
            ],
            [
                13035,
                13057
            ],
            [
                13084,
                13104
            ],
            [
                13122,
                13156
            ],
            [
                13156,
                13158
            ],
            [
                13170,
                13182
            ],
            [
                13187,
                13192
            ],
            [
                13193,
                13201
            ],
            [
                13209,
                13244
            ],
            [
                13273,
                13275
            ],
            [
                13319,
                13354
            ],
            [
                13360,
                13375
            ],
            [
                13381,
                13392
            ],
            [
                13406,
                13408
            ],
            [
                13419,
                13425
            ],
            [
                13413,
                13416
            ],
            [
                13426,
                13450
            ],
            [
                13453,
                13501
            ],
            [
                13501,
                13578
            ],
            [
                13578,
                13588
            ],
            [
                13609,
                13616
            ],
            [
                13671,
                13711
            ],
            [
                13712,
                13728
            ],
            [
                13743,
                13757
            ],
            [
                13760,
                13791
            ],
            [
                13794,
                13811
            ],
            [
                13822,
                13854
            ],
            [
                13865,
                13872
            ],
            [
                13875,
                13888
            ],
            [
                13935,
                13948
            ],
            [
                13897,
                13901
            ],
            [
                13998,
                14000
            ],
            [
                14000,
                14016
            ],
            [
                14043,
                14045
            ],
            [
                14045,
                14048
            ],
            [
                14053,
                14066
            ],
            [
                14093,
                14122
            ],
            [
                14140,
                14180
            ],
            [
                14180,
                14218
            ],
            [
                14238,
                14248
            ],
            [
                14248,
                14323
            ],
            [
                14456,
                14509
            ],
            [
                14513,
                14515
            ],
            [
                14531,
                14605
            ],
            [
                14629,
                14650
            ]
        ],
        "row_chars": [
            [
                0,
                234
            ],
            [
                234,
                344
            ],
            [
                344,
                525
            ],
            [
                525,
                766
            ],
            [
                766,
                809
            ],
            [
                809,
                898
            ],
            [
                898,
                1386
            ],
            [
                1386,
                1453
            ],
            [
                1453,
                1588
            ],
            [
                1588,
                1657
            ],
            [
                1657,
                1759
            ],
            [
                1759,
                1825
            ],
            [
                1825,
                1893
            ],
            [
                1893,
                2214
            ],
            [
                2214,
                2302
            ],
            [
                2302,
                2416
            ],
            [
                2416,
                2545
            ],
            [
                2545,
                2623
            ],
            [
                2623,
                2742
            ],
            [
                2742,
                2857
            ],
            [
                2857,
                2931
            ],
            [
                2931,
                3007
            ],
            [
                3007,
                3053
            ],
            [
                3053,
                3076
            ],
            [
                3076,
                3126
            ],
            [
                3126,
                3132
            ],
            [
                3132,
                3161
            ],
            [
                3161,
                3192
            ],
            [
                3192,
                3232
            ],
            [
                3232,
                3293
            ],
            [
                3293,
                3306
            ],
            [
                3306,
                3350
            ],
            [
                3350,
                3410
            ],
            [
                3410,
                3477
            ],
            [
                3477,
                3498
            ],
            [
                3498,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3678
            ],
            [
                3678,
                3736
            ],
            [
                3736,
                3790
            ],
            [
                3790,
                3902
            ],
            [
                3902,
                3963
            ],
            [
                3963,
                4034
            ],
            [
                4034,
                4175
            ],
            [
                4175,
                4207
            ],
            [
                4207,
                4249
            ],
            [
                4249,
                4284
            ],
            [
                4284,
                4363
            ],
            [
                4363,
                4466
            ],
            [
                4466,
                4576
            ],
            [
                4576,
                4683
            ],
            [
                4683,
                4722
            ],
            [
                4722,
                4853
            ],
            [
                4853,
                4890
            ],
            [
                4890,
                4939
            ],
            [
                4939,
                4997
            ],
            [
                4997,
                5135
            ],
            [
                5135,
                5226
            ],
            [
                5226,
                5260
            ],
            [
                5260,
                5396
            ],
            [
                5396,
                5491
            ],
            [
                5491,
                5507
            ],
            [
                5507,
                5514
            ],
            [
                5514,
                5532
            ],
            [
                5532,
                5565
            ],
            [
                5565,
                5647
            ],
            [
                5647,
                5724
            ],
            [
                5724,
                5797
            ],
            [
                5797,
                5848
            ],
            [
                5848,
                6062
            ],
            [
                6062,
                6131
            ],
            [
                6131,
                6203
            ],
            [
                6203,
                6327
            ],
            [
                6327,
                6408
            ],
            [
                6408,
                6509
            ],
            [
                6509,
                6585
            ],
            [
                6585,
                6601
            ],
            [
                6601,
                6647
            ],
            [
                6647,
                6676
            ],
            [
                6676,
                6748
            ],
            [
                6748,
                6830
            ],
            [
                6830,
                6907
            ],
            [
                6907,
                6987
            ],
            [
                6987,
                7038
            ],
            [
                7038,
                7109
            ],
            [
                7109,
                7169
            ],
            [
                7169,
                7235
            ],
            [
                7235,
                7299
            ],
            [
                7299,
                7341
            ],
            [
                7341,
                7386
            ],
            [
                7386,
                7415
            ],
            [
                7415,
                7485
            ],
            [
                7485,
                7580
            ],
            [
                7580,
                7752
            ],
            [
                7752,
                7899
            ],
            [
                7899,
                8079
            ],
            [
                8079,
                8164
            ],
            [
                8164,
                8243
            ],
            [
                8243,
                8267
            ],
            [
                8267,
                8351
            ],
            [
                8351,
                8460
            ],
            [
                8460,
                8559
            ],
            [
                8559,
                8633
            ],
            [
                8633,
                8650
            ],
            [
                8650,
                8694
            ],
            [
                8694,
                8733
            ],
            [
                8733,
                8791
            ],
            [
                8791,
                8845
            ],
            [
                8845,
                8893
            ],
            [
                8893,
                8906
            ],
            [
                8906,
                8998
            ],
            [
                8998,
                9061
            ],
            [
                9061,
                9127
            ],
            [
                9127,
                9159
            ],
            [
                9159,
                9187
            ],
            [
                9187,
                9219
            ],
            [
                9219,
                9231
            ],
            [
                9231,
                9368
            ],
            [
                9368,
                9452
            ],
            [
                9452,
                9483
            ],
            [
                9483,
                9508
            ],
            [
                9508,
                9526
            ],
            [
                9526,
                9551
            ],
            [
                9551,
                9577
            ],
            [
                9577,
                9614
            ],
            [
                9614,
                9681
            ],
            [
                9681,
                9748
            ],
            [
                9748,
                9788
            ],
            [
                9788,
                9849
            ],
            [
                9849,
                9879
            ],
            [
                9879,
                9985
            ],
            [
                9985,
                10055
            ],
            [
                10055,
                10081
            ],
            [
                10081,
                10099
            ],
            [
                10099,
                10151
            ],
            [
                10151,
                10178
            ],
            [
                10178,
                10294
            ],
            [
                10294,
                10362
            ],
            [
                10362,
                10387
            ],
            [
                10387,
                10393
            ],
            [
                10393,
                10454
            ],
            [
                10454,
                10524
            ],
            [
                10524,
                10562
            ],
            [
                10562,
                10608
            ],
            [
                10608,
                10696
            ],
            [
                10696,
                10711
            ],
            [
                10711,
                10785
            ],
            [
                10785,
                10952
            ],
            [
                10952,
                10974
            ],
            [
                10974,
                11021
            ],
            [
                11021,
                11061
            ],
            [
                11061,
                11094
            ],
            [
                11094,
                11128
            ],
            [
                11128,
                11301
            ],
            [
                11301,
                11443
            ],
            [
                11443,
                11655
            ],
            [
                11655,
                11705
            ],
            [
                11705,
                11881
            ],
            [
                11881,
                11982
            ],
            [
                11982,
                12082
            ],
            [
                12082,
                12147
            ],
            [
                12147,
                12238
            ],
            [
                12238,
                12335
            ],
            [
                12335,
                12465
            ],
            [
                12465,
                12553
            ],
            [
                12553,
                12610
            ],
            [
                12610,
                12746
            ],
            [
                12746,
                12853
            ],
            [
                12853,
                12975
            ],
            [
                12975,
                13006
            ],
            [
                13006,
                13156
            ],
            [
                13156,
                13275
            ],
            [
                13275,
                13408
            ],
            [
                13408,
                13501
            ],
            [
                13501,
                13578
            ],
            [
                13578,
                13712
            ],
            [
                13712,
                14000
            ],
            [
                14000,
                14045
            ],
            [
                14045,
                14180
            ],
            [
                14180,
                14248
            ],
            [
                14248,
                14325
            ],
            [
                14325,
                14442
            ],
            [
                14442,
                14650
            ]
        ]
    },
    "abridged": {
        "text": "On the subject of fortune-hunting by marriage, it was impossible that Roger and Lady Carbury should ever understand each other. To Lady Carbury the prospect of a union between her son and Miss Melmotte was one of joy and triumph. Even if her father were disgraced, the wealth would certainly carry the day.\nBut in fact Mr. Melmotte was not in jail, but was entertaining duchesses in Grosvenor Square. People said that he had a reputation throughout Europe as a gigantic swindler, who had carried out schemes for the ruin of those who had trusted him, and had swallowed up the property of all who had come in contact with him. They said that he was fed with the blood of widows and children; - but what was all this to Lady Carbury? If the duchesses condoned it, why should she be prudish? People also said that Melmotte would fall; he couldn't keep his head up for long. But he might keep his head up long enough to give Marie her fortune. And then Felix was so exactly the young man who should marry a fortune! To Lady Carbury there was no other way of looking at the matter.\nAnd to Roger Carbury also there was no second way of looking at it. He had the old-fashioned idea that the touching of pitch will defile one. He was a gentleman; and would have felt himself disgraced to enter Melmotte's house. Not all the duchesses or money in the city could alter his notions. But he knew that it would be useless to explain this to Lady Carbury. He trusted, however, that Henrietta Carbury might be taught to appreciate the difference between honour and dishonour. Henrietta Carbury had, he thought, a higher turn of mind than her mother.\nHe found Henrietta alone in the drawing-room. \"Have you seen Felix?\" she said.\n\"Yes. I caught him in the street.\"\n\"We are so unhappy about him.\"\n\"I think, you know, that your mother indulges him foolishly.\"\n\"Poor mamma! She worships the ground he treads on.\"\n\"Even a mother should not throw her worship away like that. Your brother will ruin you both if this goes on.\"\n\"What can mamma do?\"\n\"Leave London, and refuse to pay a shilling on his behalf.\"\n\"What would Felix do in the country?\"\n\"If he did nothing, how much better would that be than what he does in town? You would not like him to become a professional gambler.\"\n\"Oh, Mr. Carbury; you do not mean that he does that!\"\n\"It seems cruel to say it, but I have to speak the truth. I have no influence over your mother; but you may have some. She asks my advice without having the slightest idea of listening to it. I don't blame her for that; but I am anxious for the sake of the family - and especially for you. Felix may drag you into the mud. For his sake you have already been to the house of that man Melmotte.\"\n\"I do not think that I shall be injured by anything of that kind,\" said Henrietta, drawing herself up.\n\"Pardon me if I seem to interfere, or if I am rough. I feel an injury is done to you if you are made to go to the house of such a man. Why does your mother seek his society? Not because she likes him; but simply because there is a rich daughter.\"\n\"Everybody goes there, Mr. Carbury.\"\n\"Yes, that is the excuse which everybody makes. Is that sufficient reason? Have you no feeling that you ought to choose your friends for your own reasons? Are the Melmottes people with whom you would wish to be connected?\"\n\"I don't know.\"\n\"I know very well. They are absolutely disgraceful. A social connection with a crossing-sweeper would be less objectionable.\" He spoke with a degree of energy of which he was himself unaware. He knit his brows, and his eyes flashed. Of course she thought of his offer to herself. Not that the Melmotte connection could ever really affect him, because she would not marry him - but he might think that he would be so affected. She resented this.\nIn truth, he was too simple-minded for any such complex idea. \"Felix,\" he continued, \"has already descended so far that I cannot pretend to be anxious about him. But I should be sorry to think that you should often be seen at Mr. Melmotte's.\"\n\"I think, Mr. Carbury, that mamma will not take me where I ought not to be taken.\"\n\"I wish you to have some opinion of your own as to what is proper for you.\"\n\"I hope I have. I am sorry you should think that I have not.\"\n\"I am old-fashioned, Hetta.\"\n\"And I daresay we belong to a newer and worse sort of world. You have always been very kind, but I doubt whether you can change us now. If mamma chooses to go to the Melmottes I shall go with her. If that is contamination, I suppose I must be contaminated. I don't see why I'm to consider myself better than anyone else.\"\n\"I have always thought that you were better than anyone else,\" said Roger.\n\"That was before I went to the Melmottes. I am sure you have altered your opinion now. I am afraid, Mr. Carbury, you must go your way, and we must go ours.\"\nHe looked into her face as she spoke, and gradually began to perceive the working of her mind. Could she really have thought that he was concerned with his own possible future interests when he warned her about her new acquaintances?\n\"For myself,\" he said, making a vain effort to take her hand, \"I have only one wish in the world; and that is to travel the same road with you. You must know that I am sincere. When I spoke of the Melmottes, did you believe that I was thinking of myself?\"\n\"Oh no; how should I?\"\n\"I was speaking to you as a cousin. No contact with legions of Melmottes could make you other than the woman on whom my heart has settled. I love you so well that I have already taken you for better or for worse. I cannot change. My nature is too stubborn. Have you a word to comfort me?\" She turned away her head, but did not answer. \"Do you understand how much I am in need of comfort?\"\n\"You can do very well without comfort from me.\"\n\"I shall live, no doubt; but I am not doing very well. I am becoming sour and moody, and ill at ease with my friends. Please believe me, at any rate, when I say I love you.\"\n\"I suppose you mean something.\"\n\"I mean a great deal, dear. I mean all that a man can mean. That is it. You hardly understand that I am serious to the extent of ecstatic joy on the one side, and utter indifference to the world on the other. I shall never give it up till I learn that you are to be married to someone else.\"\n\"What can I say, Mr. Carbury?\"\n\"That you will love me.\"\n\"But if I don't?\"\n\"Say that you will try.\"\n\"No; I will not say that. Love should come without a struggle. I don't know how one person is to try to love another in that way. I like you very much; but being married is such a terrible thing.\"\n\"It would not be terrible to me, dear.\"\n\"Yes; when you found that I was too young for your tastes.\"\n\"I shall persevere, you know. If you promise your hand to another man, will you let me know at once?\"\n\"I suppose so,\" she said.\n\"There is no one yet?\"\n\"No. But, Mr. Carbury, you have no right to question me. I don't think it generous. I allow you to say things that nobody else could say because you are a cousin and because mamma trusts you. But no one except mamma has a right to ask me whether I care for anyone.\"\n\"If I have offended you it is because I love you so dearly.\"\n\"I am not offended, but I don't like to be questioned by a gentleman.\"\n\"Perhaps when you reflect how much of my happiness depends upon it you will forgive me. Good-bye now.\" She put out her hand to him and allowed it to remain in his for a moment. \"When I walk about the old shrubberies at Carbury, I am always asking myself what chance there is of your walking there as the mistress.\"\n\"There is no chance,\" she said.\n\"I am, of course, prepared to hear you say so. Well; good-bye, and may God bless you.\"\nThe man had no poetry about him. All the embellishments of love were nothing to him. There are men and women to whom even the delays and disappointments of love are charming. It is sweet to such persons to be melancholy, sweet to pine in a romantic fashion. But there was nothing of this with Roger Carbury. Having fixed his heart upon Henrietta, he longed for her with an amazing longing. He had spoken the simple truth when he declared that life was indifferent to him without her. No man in England was less likely to blow out his brains. But he felt numbed in all the joints of his mind by this sorrow. There was only one thing for him: to persevere till he got her, or till he finally lost her. And should the latter be his fate, as he began to fear it would be, then he would live like a crippled man.\nHe felt almost sure that the girl loved Paul. That she had never confessed such love he was quite sure. Paul and Henrietta had both assured him on this point, and he believed them. But he knew that Paul Montague was attached to her. Sorrowfully looking forward through future years, he thought that Henrietta would become Paul's wife.\nWere it so, what should he do? Forget all personal happiness, and look solely to their prosperity, and their joys? Be a beneficent fairy godfather to them, in the agony of his own disappointment? Or should he let Paul Montague know of his deep resentment of Paul's ingratitude? What father had been kinder to a son, or brother to a brother, than he had been to Paul? His home had been the young man's home, and his purse the young man's purse. What right did Paul have to rob him of all that he had in the world?\nHe was conscious that there was something wrong in his argument; that Paul when he began to love the girl knew nothing of Roger's love - that the girl would probably have refused him even without Paul. He knew all this. But still the injustice was so great, that to forgive it would be weak, womanly, and foolish. Roger Carbury did not quite believe in forgiving injuries. If you pardon all the evil done to you, you encourage others to do you evil.\nHe returned that afternoon to Suffolk, and as he thought about it during the journey, he resolved that he would never forgive Paul Montague if Paul became his cousin's husband.",
        "paragraph_chars": [
            [
                0,
                307
            ],
            [
                307,
                1077
            ],
            [
                1077,
                1635
            ],
            [
                1635,
                1714
            ],
            [
                1714,
                1749
            ],
            [
                1749,
                1780
            ],
            [
                1780,
                1842
            ],
            [
                1842,
                1894
            ],
            [
                1894,
                2004
            ],
            [
                2004,
                2025
            ],
            [
                2025,
                2085
            ],
            [
                2085,
                2123
            ],
            [
                2123,
                2258
            ],
            [
                2258,
                2312
            ],
            [
                2312,
                2706
            ],
            [
                2706,
                2809
            ],
            [
                2809,
                3056
            ],
            [
                3056,
                3093
            ],
            [
                3093,
                3316
            ],
            [
                3316,
                3332
            ],
            [
                3332,
                3777
            ],
            [
                3777,
                4020
            ],
            [
                4020,
                4103
            ],
            [
                4103,
                4179
            ],
            [
                4179,
                4241
            ],
            [
                4241,
                4270
            ],
            [
                4270,
                4592
            ],
            [
                4592,
                4667
            ],
            [
                4667,
                4824
            ],
            [
                4824,
                5058
            ],
            [
                5058,
                5314
            ],
            [
                5314,
                5337
            ],
            [
                5337,
                5726
            ],
            [
                5726,
                5774
            ],
            [
                5774,
                5948
            ],
            [
                5948,
                5980
            ],
            [
                5980,
                6272
            ],
            [
                6272,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6346
            ],
            [
                6346,
                6371
            ],
            [
                6371,
                6568
            ],
            [
                6568,
                6608
            ],
            [
                6608,
                6668
            ],
            [
                6668,
                6770
            ],
            [
                6770,
                6796
            ],
            [
                6796,
                6819
            ],
            [
                6819,
                7085
            ],
            [
                7085,
                7146
            ],
            [
                7146,
                7217
            ],
            [
                7217,
                7532
            ],
            [
                7532,
                7564
            ],
            [
                7564,
                7651
            ],
            [
                7651,
                8459
            ],
            [
                8459,
                8794
            ],
            [
                8794,
                9307
            ],
            [
                9307,
                9757
            ],
            [
                9757,
                9933
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                230
            ],
            [
                230,
                307
            ],
            [
                307,
                401
            ],
            [
                401,
                626
            ],
            [
                626,
                732
            ],
            [
                732,
                789
            ],
            [
                789,
                871
            ],
            [
                871,
                940
            ],
            [
                940,
                1012
            ],
            [
                1012,
                1077
            ],
            [
                1077,
                1145
            ],
            [
                1145,
                1219
            ],
            [
                1219,
                1304
            ],
            [
                1304,
                1372
            ],
            [
                1372,
                1442
            ],
            [
                1442,
                1561
            ],
            [
                1561,
                1635
            ],
            [
                1635,
                1681
            ],
            [
                1681,
                1704
            ],
            [
                1704,
                1714
            ],
            [
                1714,
                1720
            ],
            [
                1720,
                1749
            ],
            [
                1749,
                1780
            ],
            [
                1780,
                1842
            ],
            [
                1842,
                1855
            ],
            [
                1855,
                1894
            ],
            [
                1894,
                1954
            ],
            [
                1954,
                2004
            ],
            [
                2004,
                2025
            ],
            [
                2025,
                2085
            ],
            [
                2085,
                2123
            ],
            [
                2123,
                2200
            ],
            [
                2200,
                2258
            ],
            [
                2258,
                2312
            ],
            [
                2312,
                2370
            ],
            [
                2370,
                2431
            ],
            [
                2431,
                2504
            ],
            [
                2504,
                2602
            ],
            [
                2602,
                2635
            ],
            [
                2635,
                2706
            ],
            [
                2706,
                2809
            ],
            [
                2809,
                2862
            ],
            [
                2862,
                2944
            ],
            [
                2944,
                2983
            ],
            [
                2983,
                3056
            ],
            [
                3056,
                3093
            ],
            [
                3093,
                3141
            ],
            [
                3141,
                3168
            ],
            [
                3168,
                3248
            ],
            [
                3248,
                3316
            ],
            [
                3316,
                3332
            ],
            [
                3332,
                3351
            ],
            [
                3351,
                3384
            ],
            [
                3384,
                3458
            ],
            [
                3458,
                3524
            ],
            [
                3524,
                3565
            ],
            [
                3565,
                3612
            ],
            [
                3612,
                3758
            ],
            [
                3758,
                3777
            ],
            [
                3777,
                3839
            ],
            [
                3839,
                3939
            ],
            [
                3939,
                4020
            ],
            [
                4020,
                4103
            ],
            [
                4103,
                4179
            ],
            [
                4179,
                4195
            ],
            [
                4195,
                4241
            ],
            [
                4241,
                4270
            ],
            [
                4270,
                4331
            ],
            [
                4331,
                4406
            ],
            [
                4406,
                4467
            ],
            [
                4467,
                4527
            ],
            [
                4527,
                4592
            ],
            [
                4592,
                4667
            ],
            [
                4667,
                4709
            ],
            [
                4709,
                4754
            ],
            [
                4754,
                4824
            ],
            [
                4824,
                4919
            ],
            [
                4919,
                5058
            ],
            [
                5058,
                5202
            ],
            [
                5202,
                5235
            ],
            [
                5235,
                5314
            ],
            [
                5314,
                5337
            ],
            [
                5337,
                5373
            ],
            [
                5373,
                5476
            ],
            [
                5476,
                5550
            ],
            [
                5550,
                5567
            ],
            [
                5567,
                5594
            ],
            [
                5594,
                5626
            ],
            [
                5626,
                5672
            ],
            [
                5672,
                5726
            ],
            [
                5726,
                5774
            ],
            [
                5774,
                5829
            ],
            [
                5829,
                5892
            ],
            [
                5892,
                5948
            ],
            [
                5948,
                5980
            ],
            [
                5980,
                6008
            ],
            [
                6008,
                6040
            ],
            [
                6040,
                6052
            ],
            [
                6052,
                6189
            ],
            [
                6189,
                6272
            ],
            [
                6272,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6346
            ],
            [
                6346,
                6371
            ],
            [
                6371,
                6397
            ],
            [
                6397,
                6434
            ],
            [
                6434,
                6501
            ],
            [
                6501,
                6568
            ],
            [
                6568,
                6608
            ],
            [
                6608,
                6668
            ],
            [
                6668,
                6698
            ],
            [
                6698,
                6770
            ],
            [
                6770,
                6796
            ],
            [
                6796,
                6819
            ],
            [
                6819,
                6824
            ],
            [
                6824,
                6876
            ],
            [
                6876,
                6903
            ],
            [
                6903,
                7011
            ],
            [
                7011,
                7085
            ],
            [
                7085,
                7146
            ],
            [
                7146,
                7217
            ],
            [
                7217,
                7305
            ],
            [
                7305,
                7320
            ],
            [
                7320,
                7394
            ],
            [
                7394,
                7532
            ],
            [
                7532,
                7564
            ],
            [
                7564,
                7611
            ],
            [
                7611,
                7651
            ],
            [
                7651,
                7684
            ],
            [
                7684,
                7736
            ],
            [
                7736,
                7826
            ],
            [
                7826,
                7909
            ],
            [
                7909,
                7959
            ],
            [
                7959,
                8041
            ],
            [
                8041,
                8135
            ],
            [
                8135,
                8193
            ],
            [
                8193,
                8258
            ],
            [
                8258,
                8351
            ],
            [
                8351,
                8459
            ],
            [
                8459,
                8505
            ],
            [
                8505,
                8563
            ],
            [
                8563,
                8640
            ],
            [
                8640,
                8692
            ],
            [
                8692,
                8794
            ],
            [
                8794,
                8825
            ],
            [
                8825,
                8909
            ],
            [
                8909,
                8990
            ],
            [
                8990,
                9072
            ],
            [
                9072,
                9161
            ],
            [
                9161,
                9238
            ],
            [
                9238,
                9307
            ],
            [
                9307,
                9509
            ],
            [
                9509,
                9527
            ],
            [
                9527,
                9621
            ],
            [
                9621,
                9680
            ],
            [
                9680,
                9757
            ],
            [
                9757,
                9933
            ]
        ],
        "overlap_chars": [
            [
                3,
                6
            ],
            [
                15,
                45
            ],
            [
                45,
                46
            ],
            [
                47,
                69
            ],
            [
                70,
                75
            ],
            [
                76,
                79
            ],
            [
                85,
                92
            ],
            [
                93,
                128
            ],
            [
                128,
                212
            ],
            [
                213,
                230
            ],
            [
                230,
                234
            ],
            [
                238,
                248
            ],
            [
                263,
                264
            ],
            [
                265,
                275
            ],
            [
                276,
                305
            ],
            [
                305,
                306
            ],
            [
                321,
                339
            ],
            [
                347,
                401
            ],
            [
                401,
                417
            ],
            [
                418,
                420
            ],
            [
                421,
                479
            ],
            [
                480,
                483
            ],
            [
                484,
                487
            ],
            [
                488,
                499
            ],
            [
                500,
                550
            ],
            [
                551,
                554
            ],
            [
                555,
                624
            ],
            [
                624,
                625
            ],
            [
                631,
                635
            ],
            [
                636,
                690
            ],
            [
                693,
                732
            ],
            [
                732,
                760
            ],
            [
                760,
                761
            ],
            [
                777,
                789
            ],
            [
                789,
                825
            ],
            [
                826,
                830
            ],
            [
                844,
                860
            ],
            [
                865,
                869
            ],
            [
                869,
                871
            ],
            [
                871,
                940
            ],
            [
                940,
                954
            ],
            [
                955,
                987
            ],
            [
                995,
                1012
            ],
            [
                1012,
                1040
            ],
            [
                1047,
                1077
            ],
            [
                1077,
                1145
            ],
            [
                1152,
                1213
            ],
            [
                1217,
                1219
            ],
            [
                1219,
                1238
            ],
            [
                1239,
                1285
            ],
            [
                1286,
                1294
            ],
            [
                1297,
                1302
            ],
            [
                1302,
                1304
            ],
            [
                1304,
                1325
            ],
            [
                1326,
                1328
            ],
            [
                1329,
                1346
            ],
            [
                1347,
                1370
            ],
            [
                1370,
                1372
            ],
            [
                1372,
                1408
            ],
            [
                1409,
                1442
            ],
            [
                1442,
                1467
            ],
            [
                1486,
                1561
            ],
            [
                1561,
                1633
            ],
            [
                1633,
                1634
            ],
            [
                1635,
                1681
            ],
            [
                1681,
                1704
            ],
            [
                1704,
                1712
            ],
            [
                1712,
                1714
            ],
            [
                1714,
                1720
            ],
            [
                1720,
                1749
            ],
            [
                1749,
                1780
            ],
            [
                1781,
                1842
            ],
            [
                1842,
                1855
            ],
            [
                1855,
                1871
            ],
            [
                1872,
                1894
            ],
            [
                1894,
                1954
            ],
            [
                1954,
                2004
            ],
            [
                2004,
                2025
            ],
            [
                2025,
                2043
            ],
            [
                2044,
                2085
            ],
            [
                2085,
                2123
            ],
            [
                2123,
                2200
            ],
            [
                2200,
                2258
            ],
            [
                2258,
                2312
            ],
            [
                2312,
                2334
            ],
            [
                2337,
                2338
            ],
            [
                2339,
                2342
            ],
            [
                2350,
                2370
            ],
            [
                2370,
                2431
            ],
            [
                2431,
                2449
            ],
            [
                2465,
                2504
            ],
            [
                2504,
                2564
            ],
            [
                2565,
                2575
            ],
            [
                2582,
                2596
            ],
            [
                2597,
                2600
            ],
            [
                2600,
                2602
            ],
            [
                2608,
                2635
            ],
            [
                2635,
                2669
            ],
            [
                2673,
                2706
            ],
            [
                2706,
                2809
            ],
            [
                2809,
                2842
            ],
            [
                2842,
                2843
            ],
            [
                2847,
                2862
            ],
            [
                2869,
                2938
            ],
            [
                2939,
                2944
            ],
            [
                2944,
                2983
            ],
            [
                2983,
                3009
            ],
            [
                3010,
                3056
            ],
            [
                3056,
                3093
            ],
            [
                3093,
                3098
            ],
            [
                3099,
                3141
            ],
            [
                3141,
                3166
            ],
            [
                3166,
                3168
            ],
            [
                3168,
                3229
            ],
            [
                3230,
                3238
            ],
            [
                3239,
                3246
            ],
            [
                3246,
                3248
            ],
            [
                3248,
                3316
            ],
            [
                3316,
                3332
            ],
            [
                3333,
                3351
            ],
            [
                3351,
                3384
            ],
            [
                3384,
                3408
            ],
            [
                3411,
                3458
            ],
            [
                3458,
                3514
            ],
            [
                3515,
                3524
            ],
            [
                3524,
                3563
            ],
            [
                3563,
                3565
            ],
            [
                3565,
                3593
            ],
            [
                3594,
                3612
            ],
            [
                3612,
                3674
            ],
            [
                3683,
                3692
            ],
            [
                3709,
                3712
            ],
            [
                3713,
                3758
            ],
            [
                3758,
                3770
            ],
            [
                3775,
                3776
            ],
            [
                3777,
                3793
            ],
            [
                3794,
                3839
            ],
            [
                3839,
                3927
            ],
            [
                3937,
                3939
            ],
            [
                3939,
                4020
            ],
            [
                4020,
                4058
            ],
            [
                4059,
                4062
            ],
            [
                4063,
                4067
            ],
            [
                4071,
                4103
            ],
            [
                4103,
                4179
            ],
            [
                4179,
                4195
            ],
            [
                4195,
                4241
            ],
            [
                4241,
                4270
            ],
            [
                4270,
                4274
            ],
            [
                4275,
                4276
            ],
            [
                4285,
                4330
            ],
            [
                4331,
                4339
            ],
            [
                4340,
                4346
            ],
            [
                4347,
                4351
            ],
            [
                4352,
                4368
            ],
            [
                4369,
                4406
            ],
            [
                4406,
                4453
            ],
            [
                4454,
                4467
            ],
            [
                4467,
                4527
            ],
            [
                4527,
                4577
            ],
            [
                4585,
                4592
            ],
            [
                4592,
                4640
            ],
            [
                4648,
                4652
            ],
            [
                4667,
                4709
            ],
            [
                4709,
                4754
            ],
            [
                4754,
                4824
            ],
            [
                4824,
                4919
            ],
            [
                4919,
                4960
            ],
            [
                4976,
                5028
            ],
            [
                5039,
                5058
            ],
            [
                5058,
                5080
            ],
            [
                5081,
                5089
            ],
            [
                5090,
                5104
            ],
            [
                5114,
                5118
            ],
            [
                5118,
                5167
            ],
            [
                5168,
                5202
            ],
            [
                5202,
                5205
            ],
            [
                5211,
                5235
            ],
            [
                5235,
                5314
            ],
            [
                5314,
                5321
            ],
            [
                5322,
                5337
            ],
            [
                5337,
                5359
            ],
            [
                5360,
                5362
            ],
            [
                5363,
                5371
            ],
            [
                5371,
                5373
            ],
            [
                5373,
                5430
            ],
            [
                5431,
                5476
            ],
            [
                5476,
                5550
            ],
            [
                5550,
                5567
            ],
            [
                5567,
                5592
            ],
            [
                5592,
                5594
            ],
            [
                5594,
                5612
            ],
            [
                5613,
                5626
            ],
            [
                5626,
                5670
            ],
            [
                5670,
                5672
            ],
            [
                5672,
                5726
            ],
            [
                5726,
                5774
            ],
            [
                5775,
                5804
            ],
            [
                5805,
                5817
            ],
            [
                5818,
                5828
            ],
            [
                5829,
                5892
            ],
            [
                5899,
                5948
            ],
            [
                5948,
                5980
            ],
            [
                5980,
                6008
            ],
            [
                6008,
                6040
            ],
            [
                6040,
                6052
            ],
            [
                6052,
                6189
            ],
            [
                6189,
                6256
            ],
            [
                6265,
                6272
            ],
            [
                6272,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6346
            ],
            [
                6346,
                6371
            ],
            [
                6371,
                6397
            ],
            [
                6397,
                6434
            ],
            [
                6434,
                6501
            ],
            [
                6501,
                6568
            ],
            [
                6568,
                6608
            ],
            [
                6608,
                6613
            ],
            [
                6614,
                6668
            ],
            [
                6668,
                6698
            ],
            [
                6698,
                6738
            ],
            [
                6739,
                6747
            ],
            [
                6748,
                6770
            ],
            [
                6770,
                6780
            ],
            [
                6783,
                6794
            ],
            [
                6794,
                6796
            ],
            [
                6796,
                6812
            ],
            [
                6813,
                6819
            ],
            [
                6819,
                6820
            ],
            [
                6820,
                6822
            ],
            [
                6822,
                6824
            ],
            [
                6824,
                6876
            ],
            [
                6876,
                6903
            ],
            [
                6903,
                7009
            ],
            [
                7009,
                7011
            ],
            [
                7011,
                7014
            ],
            [
                7015,
                7021
            ],
            [
                7029,
                7075
            ],
            [
                7082,
                7085
            ],
            [
                7085,
                7146
            ],
            [
                7146,
                7214
            ],
            [
                7217,
                7305
            ],
            [
                7305,
                7320
            ],
            [
                7320,
                7394
            ],
            [
                7394,
                7443
            ],
            [
                7443,
                7532
            ],
            [
                7532,
                7551
            ],
            [
                7564,
                7611
            ],
            [
                7611,
                7651
            ],
            [
                7651,
                7684
            ],
            [
                7684,
                7691
            ],
            [
                7698,
                7701
            ],
            [
                7707,
                7714
            ],
            [
                7715,
                7736
            ],
            [
                7736,
                7745
            ],
            [
                7746,
                7824
            ],
            [
                7824,
                7826
            ],
            [
                7826,
                7885
            ],
            [
                7886,
                7888
            ],
            [
                7889,
                7907
            ],
            [
                7907,
                7909
            ],
            [
                7909,
                7959
            ],
            [
                7959,
                7986
            ],
            [
                7996,
                8041
            ],
            [
                8041,
                8098
            ],
            [
                8103,
                8135
            ],
            [
                8135,
                8152
            ],
            [
                8157,
                8168
            ],
            [
                8169,
                8193
            ],
            [
                8193,
                8258
            ],
            [
                8258,
                8267
            ],
            [
                8273,
                8290
            ],
            [
                8292,
                8332
            ],
            [
                8333,
                8351
            ],
            [
                8351,
                8405
            ],
            [
                8406,
                8423
            ],
            [
                8424,
                8437
            ],
            [
                8438,
                8459
            ],
            [
                8459,
                8478
            ],
            [
                8479,
                8498
            ],
            [
                8503,
                8505
            ],
            [
                8505,
                8523
            ],
            [
                8534,
                8563
            ],
            [
                8568,
                8581
            ],
            [
                8582,
                8624
            ],
            [
                8638,
                8640
            ],
            [
                8640,
                8690
            ],
            [
                8690,
                8692
            ],
            [
                8692,
                8727
            ],
            [
                8728,
                8752
            ],
            [
                8753,
                8793
            ],
            [
                8794,
                8825
            ],
            [
                8832,
                8854
            ],
            [
                8854,
                8874
            ],
            [
                8875,
                8909
            ],
            [
                8909,
                8911
            ],
            [
                8912,
                8924
            ],
            [
                8925,
                8930
            ],
            [
                8941,
                8949
            ],
            [
                8953,
                8988
            ],
            [
                8988,
                8990
            ],
            [
                8990,
                9025
            ],
            [
                9033,
                9048
            ],
            [
                9059,
                9070
            ],
            [
                9070,
                9072
            ],
            [
                9077,
                9083
            ],
            [
                9084,
                9087
            ],
            [
                9088,
                9112
            ],
            [
                9113,
                9161
            ],
            [
                9161,
                9238
            ],
            [
                9238,
                9248
            ],
            [
                9258,
                9265
            ],
            [
                9266,
                9306
            ],
            [
                9307,
                9323
            ],
            [
                9324,
                9338
            ],
            [
                9339,
                9370
            ],
            [
                9372,
                9389
            ],
            [
                9396,
                9428
            ],
            [
                9434,
                9441
            ],
            [
                9444,
                9457
            ],
            [
                9464,
                9477
            ],
            [
                9503,
                9507
            ],
            [
                9507,
                9509
            ],
            [
                9509,
                9525
            ],
            [
                9525,
                9527
            ],
            [
                9527,
                9530
            ],
            [
                9537,
                9550
            ],
            [
                9551,
                9580
            ],
            [
                9581,
                9621
            ],
            [
                9621,
                9659
            ],
            [
                9670,
                9680
            ],
            [
                9680,
                9755
            ],
            [
                9760,
                9813
            ],
            [
                9820,
                9822
            ],
            [
                9830,
                9904
            ],
            [
                9912,
                9933
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                230
            ],
            [
                230,
                230
            ],
            [
                230,
                307
            ],
            [
                307,
                307
            ],
            [
                307,
                401
            ],
            [
                401,
                732
            ],
            [
                732,
                789
            ],
            [
                789,
                871
            ],
            [
                871,
                940
            ],
            [
                940,
                1012
            ],
            [
                1012,
                1077
            ],
            [
                1077,
                1145
            ],
            [
                1145,
                1145
            ],
            [
                1145,
                1219
            ],
            [
                1219,
                1304
            ],
            [
                1304,
                1372
            ],
            [
                1372,
                1442
            ],
            [
                1442,
                1561
            ],
            [
                1561,
                1635
            ],
            [
                1635,
                1635
            ],
            [
                1635,
                1635
            ],
            [
                1635,
                1681
            ],
            [
                1681,
                1704
            ],
            [
                1704,
                1714
            ],
            [
                1714,
                1720
            ],
            [
                1720,
                1749
            ],
            [
                1749,
                1780
            ],
            [
                1780,
                1780
            ],
            [
                1780,
                1842
            ],
            [
                1842,
                1855
            ],
            [
                1855,
                1894
            ],
            [
                1894,
                1954
            ],
            [
                1954,
                2004
            ],
            [
                2004,
                2025
            ],
            [
                2025,
                2085
            ],
            [
                2085,
                2123
            ],
            [
                2123,
                2200
            ],
            [
                2200,
                2258
            ],
            [
                2258,
                2312
            ],
            [
                2312,
                2370
            ],
            [
                2370,
                2431
            ],
            [
                2431,
                2504
            ],
            [
                2504,
                2602
            ],
            [
                2602,
                2602
            ],
            [
                2602,
                2602
            ],
            [
                2602,
                2635
            ],
            [
                2635,
                2706
            ],
            [
                2706,
                2809
            ],
            [
                2809,
                2862
            ],
            [
                2862,
                2944
            ],
            [
                2944,
                2983
            ],
            [
                2983,
                3056
            ],
            [
                3056,
                3093
            ],
            [
                3093,
                3141
            ],
            [
                3141,
                3168
            ],
            [
                3168,
                3168
            ],
            [
                3168,
                3248
            ],
            [
                3248,
                3248
            ],
            [
                3248,
                3248
            ],
            [
                3248,
                3316
            ],
            [
                3316,
                3332
            ],
            [
                3332,
                3332
            ],
            [
                3332,
                3351
            ],
            [
                3351,
                3384
            ],
            [
                3384,
                3458
            ],
            [
                3458,
                3524
            ],
            [
                3524,
                3565
            ],
            [
                3565,
                3612
            ],
            [
                3612,
                3758
            ],
            [
                3758,
                3777
            ],
            [
                3777,
                3839
            ],
            [
                3839,
                3939
            ],
            [
                3939,
                4020
            ],
            [
                4020,
                4103
            ],
            [
                4103,
                4179
            ],
            [
                4179,
                4195
            ],
            [
                4195,
                4241
            ],
            [
                4241,
                4270
            ],
            [
                4270,
                4331
            ],
            [
                4331,
                4406
            ],
            [
                4406,
                4406
            ],
            [
                4406,
                4406
            ],
            [
                4406,
                4406
            ],
            [
                4406,
                4467
            ],
            [
                4467,
                4527
            ],
            [
                4527,
                4592
            ],
            [
                4592,
                4667
            ],
            [
                4667,
                4709
            ],
            [
                4709,
                4754
            ],
            [
                4754,
                4754
            ],
            [
                4754,
                4824
            ],
            [
                4824,
                4919
            ],
            [
                4919,
                4919
            ],
            [
                4919,
                5058
            ],
            [
                5058,
                5202
            ],
            [
                5202,
                5235
            ],
            [
                5235,
                5314
            ],
            [
                5314,
                5337
            ],
            [
                5337,
                5373
            ],
            [
                5373,
                5476
            ],
            [
                5476,
                5476
            ],
            [
                5476,
                5550
            ],
            [
                5550,
                5567
            ],
            [
                5567,
                5594
            ],
            [
                5594,
                5626
            ],
            [
                5626,
                5672
            ],
            [
                5672,
                5726
            ],
            [
                5726,
                5774
            ],
            [
                5774,
                5774
            ],
            [
                5774,
                5829
            ],
            [
                5829,
                5892
            ],
            [
                5892,
                5948
            ],
            [
                5948,
                5980
            ],
            [
                5980,
                6008
            ],
            [
                6008,
                6040
            ],
            [
                6040,
                6052
            ],
            [
                6052,
                6189
            ],
            [
                6189,
                6272
            ],
            [
                6272,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6346
            ],
            [
                6346,
                6371
            ],
            [
                6371,
                6397
            ],
            [
                6397,
                6434
            ],
            [
                6434,
                6501
            ],
            [
                6501,
                6568
            ],
            [
                6568,
                6608
            ],
            [
                6608,
                6668
            ],
            [
                6668,
                6698
            ],
            [
                6698,
                6770
            ],
            [
                6770,
                6796
            ],
            [
                6796,
                6819
            ],
            [
                6819,
                6824
            ],
            [
                6824,
                6876
            ],
            [
                6876,
                6903
            ],
            [
                6903,
                7011
            ],
            [
                7011,
                7085
            ],
            [
                7085,
                7085
            ],
            [
                7085,
                7085
            ],
            [
                7085,
                7146
            ],
            [
                7146,
                7217
            ],
            [
                7217,
                7217
            ],
            [
                7217,
                7217
            ],
            [
                7217,
                7305
            ],
            [
                7305,
                7320
            ],
            [
                7320,
                7394
            ],
            [
                7394,
                7532
            ],
            [
                7532,
                7564
            ],
            [
                7564,
                7611
            ],
            [
                7611,
                7651
            ],
            [
                7651,
                7684
            ],
            [
                7684,
                7684
            ],
            [
                7684,
                7736
            ],
            [
                7736,
                7826
            ],
            [
                7826,
                7909
            ],
            [
                7909,
                7959
            ],
            [
                7959,
                8041
            ],
            [
                8041,
                8135
            ],
            [
                8135,
                8193
            ],
            [
                8193,
                8258
            ],
            [
                8258,
                8258
            ],
            [
                8258,
                8351
            ],
            [
                8351,
                8459
            ],
            [
                8459,
                8505
            ],
            [
                8505,
                8563
            ],
            [
                8563,
                8640
            ],
            [
                8640,
                8692
            ],
            [
                8692,
                8794
            ],
            [
                8794,
                8825
            ],
            [
                8825,
                8909
            ],
            [
                8909,
                8990
            ],
            [
                8990,
                9072
            ],
            [
                9072,
                9161
            ],
            [
                9161,
                9238
            ],
            [
                9238,
                9307
            ],
            [
                9307,
                9509
            ],
            [
                9509,
                9527
            ],
            [
                9527,
                9621
            ],
            [
                9621,
                9680
            ],
            [
                9680,
                9757
            ],
            [
                9757,
                9757
            ],
            [
                9757,
                9933
            ]
        ]
    }
}