{
    "original": {
        "text": "When Marie Melmotte assured Sir Felix Carbury that her father had already endowed her with a large fortune which could not be taken from her without her own consent, she spoke no more than the truth. She knew of the matter almost as little as it was possible that she should know. As far as reticence on the subject was compatible with the object he had in view Melmotte had kept from her all knowledge of the details of the arrangement. But it had been necessary when the thing was done to explain, or to pretend to explain, much; and Marie's memory and also her intelligence had been strong beyond her father's anticipation. He was deriving a very considerable income from a large sum of money which he had invested in foreign funds in her name, and had got her to execute a power of attorney enabling him to draw this income on her behalf. This he had done fearing shipwreck in the course which he meant to run, and resolved that, let circumstances go as they might, there should still be left enough to him of the money which he had realised to enable him to live in comfort and luxury, should he be doomed to live in obscurity, or even in infamy. He had sworn to himself solemnly that under no circumstances would he allow this money to go back into the vortex of his speculations, and hitherto he had been true to his oath. Though bankruptcy and apparent ruin might be imminent he would not bolster up his credit by the use of this money even though it might appear at the moment that the money would be sufficient for the purpose. If such a day should come, then, with that certain income, he would make himself happy, if possible, or at any rate luxurious, in whatever city of the world might know least of his antecedents, and give him the warmest welcome on behalf of his wealth. Such had been his scheme of life. But he had failed to consider various circumstances. His daughter might be untrue to him, or in the event of her marriage might fail to release his property,--or it might be that the very money should be required to dower his daughter. Or there might come troubles on him so great that even the certainty of a future income would not enable him to bear them. Now, at this present moment, his mind was tortured by great anxiety. Were he to resume this property it would more than enable him to pay all that was due to the Longestaffes. It would do that and tide him for a time over some other difficulties. Now in regard to the Longestaffes themselves, he certainly had no desire to depart from the rule which he had made for himself, on their behalf. Were it necessary that a crash should come they would be as good creditors as any other. But then he was painfully alive to the fact that something beyond simple indebtedness was involved in that transaction. He had with his own hand traced Dolly Longestaffe's signature on the letter which he had found in old Mr. Longestaffe's drawer. He had found it in an envelope, addressed by the elder Mr. Longestaffe to Messrs. Slow and Bideawhile, and he had himself posted this letter in a pillar-box near to his own house. In the execution of this manoeuvre, circumstances had greatly befriended him. He had become the tenant of Mr. Longestaffe's house, and at the same time had only been the joint tenant of Mr. Longestaffe's study,--so that Mr. Longestaffe's papers were almost in his very hands. To pick a lock was with him an accomplishment long since learned. But his science in that line did not go so far as to enable him to replace the bolt in its receptacle. He had picked a lock, had found the letter prepared by Mr. Bideawhile with its accompanying envelope, and had then already learned enough of the domestic circumstances of the Longestaffe family to feel assured that unless he could assist the expedition of this hitherto uncompleted letter by his own skill, the letter would never reach its intended destination. In all this fortune had in some degree befriended him. The circumstances being as they were it was hardly possible that the forgery should be discovered. Even though the young man were to swear that the signature was not his, even though the old man were to swear that he had left that drawer properly locked with the unsigned letter in it, still there could be no evidence. People might think. People might speak. People might feel sure. And then a crash would come. But there would still be that ample fortune on which to retire and eat and drink and make merry for the rest of his days.\nThen there came annoying complications in his affairs. What had been so easy in reference to that letter which Dolly Longestaffe never would have signed, was less easy but still feasible in another matter. Under the joint pressure of immediate need, growing ambition, and increasing audacity it had been done. Then the rumours that were spread abroad,--which to Melmotte were serious indeed,--they named, at any rate in reference to Dolly Longestaffe, the very thing that had been done. Now if that, or the like of that, were brought actually home to him, if twelve jurymen could be got to say that he had done that thing, of what use then would be all that money? When that fear arose, then there arose also the question whether it might not be well to use the money to save him from such ruin, if it might be so used. No doubt all danger in that Longestaffe affair might be bought off by payment of the price stipulated for the Pickering property. Neither would Dolly Longestaffe nor Squercum, of whom Mr. Melmotte had already heard, concern himself in this matter if the money claimed were paid. But then the money would be as good as wasted by such a payment, if, as he firmly believed, no sufficient evidence could be produced to prove the thing which he had done.\nBut the complications were so many! Perhaps in his admiration for the country of his adoption Mr. Melmotte had allowed himself to attach higher privileges to the British aristocracy than do in truth belong to them. He did in his heart believe that could he be known to all the world as the father-in-law of the eldest son of the Marquis of Auld Reekie he would become, not really free of the law, but almost safe from its fangs in regard to such an affair as this. He thought he could so use the family with which he would be connected as to force from it that protection which he would need. And then again, if he could tide over this bad time, how glorious would it be to have a British Marquis for his son-in-law! Like many others he had failed altogether to enquire when the pleasure to himself would come, or what would be its nature. But he did believe that such a marriage would add a charm to his life. Now he knew that Lord Nidderdale could not be got to marry his daughter without the positive assurance of absolute property, but he did think that the income which might thus be transferred with Marie, though it fell short of that which had been promised, might suffice for the time; and he had already given proof to the Marquis's lawyer that his daughter was possessed of the property in question.\nAnd indeed, there was another complication which had arisen within the last few days and which had startled Mr. Melmotte very much indeed. On a certain morning he had sent for Marie to the study and had told her that he should require her signature in reference to a deed. She had asked him what deed. He had replied that it would be a document regarding money and reminded her that she had signed such a deed once before, telling her that it was all in the way of business. It was not necessary that she should ask any more questions as she would be wanted only to sign the paper. Then Marie astounded him, not merely by showing him that she understood a great deal more of the transaction than he had thought,--but also by a positive refusal to sign anything at all. The reader may understand that there had been many words between them. \"I know, papa. It is that you may have the money to do what you like with. You have been so unkind to me about Sir Felix Carbury that I won't do it. If I ever marry the money will belong to my husband!\" His breath almost failed him as he listened to these words. He did not know whether to approach her with threats, with entreaties, or with blows. Before the interview was over he had tried all three. He had told her that he could and would put her in prison for conduct so fraudulent. He besought her not to ruin her parent by such monstrous perversity. And at last he took her by both arms and shook her violently. But Marie was quite firm. He might cut her to pieces; but she would sign nothing. \"I suppose you thought Sir Felix would have had the entire sum,\" said the father with deriding scorn.\n\"And he would;--if he had the spirit to take it,\" answered Marie.\nThis was another reason for sticking to the Nidderdale plan. He would no doubt lose the immediate income, but in doing so he would secure the Marquis. He was therefore induced, on weighing in his nicest-balanced scales the advantages and disadvantages, to leave the Longestaffes unpaid and to let Nidderdale have the money. Not that he could make up his mind to such a course with any conviction that he was doing the best for himself. The dangers on all sides were very great! But at the present moment audacity recommended itself to him, and this was the boldest stroke. Marie had now said that she would accept Nidderdale,--or the sweep at the crossing.\nOn Monday morning,--it was on the preceding Thursday that he had made his famous speech in Parliament,--one of the Bideawhiles had come to him in the City. He had told Mr. Bideawhile that all the world knew that just at the present moment money was very \"tight\" in the City. \"We are not asking for payment of a commercial debt,\" said Mr. Bideawhile, \"but for the price of a considerable property which you have purchased.\" Mr. Melmotte had suggested that the characteristics of the money were the same, let the sum in question have become due how it might. Then he offered to make the payment in two bills at three and six months' date, with proper interest allowed. But this offer Mr. Bideawhile scouted with indignation, demanding that the title-deeds might be restored to them.\n\"You have no right whatever to demand the title-deeds,\" said Melmotte. \"You can only claim the sum due, and I have already told you how I propose to pay it.\"\nMr. Bideawhile was nearly beside himself with dismay. In the whole course of his business, in all the records of the very respectable firm to which he belonged, there had never been such a thing as this. Of course Mr. Longestaffe had been the person to blame,--so at least all the Bideawhiles declared among themselves. He had been so anxious to have dealings with the man of money that he had insisted that the title-deeds should be given up. But then the title-deeds had not been his to surrender. The Pickering estate had been the joint property of him and his son. The house had been already pulled down, and now the purchaser offered bills in lieu of the purchase money! \"Do you mean to tell me, Mr. Melmotte, that you have not got the money to pay for what you have bought, and that nevertheless the title-deeds have already gone out of your hands?\"\n\"I have property to ten times the value, twenty times the value, thirty times the value,\" said Melmotte proudly; \"but you must know I should think by this time that a man engaged in large affairs cannot always realise such a sum as eighty thousand pounds at a day's notice.\" Mr. Bideawhile without using language that was absolutely vituperative gave Mr. Melmotte to understand that he thought that he and his client had been robbed, and that he should at once take whatever severest steps the law put in his power. As Mr. Melmotte shrugged his shoulders and made no further reply, Mr. Bideawhile could only take his departure.\nThe attorney, although he was bound to be staunch to his own client, and to his own house in opposition to Mr. Squercum, nevertheless was becoming doubtful in his own mind as to the genuineness of the letter which Dolly was so persistent in declaring that he had not signed. Mr. Longestaffe himself, who was at any rate an honest man, had given it as his opinion that Dolly had not signed the letter. His son had certainly refused to sign it once, and as far as he knew could have had no opportunity of signing it since. He was all but sure that he had left the letter under lock and key in his own drawer in the room which had latterly become Melmotte's study as well as his own. Then, on entering the room in Melmotte's presence,--their friendship at the time having already ceased,--he found that his drawer was open. This same Mr. Bideawhile was with him at the time. \"Do you mean to say that I have opened your drawer?\" said Mr. Melmotte. Mr. Longestaffe had become very red in the face and had replied by saying that he certainly made no such accusation, but as certainly he had not left the drawer unlocked. He knew his own habits and was sure that he had never left that drawer open in his life. \"Then you must have changed the habits of your life on this occasion,\" said Mr. Melmotte with spirit. Mr. Longestaffe would trust himself to no other word within the house, but, when they were out in the street together, he assured the lawyer that certainly that drawer had been left locked, and that to the best of his belief the letter unsigned had been left within the drawer. Mr. Bideawhile could only remark that it was the most unfortunate circumstance with which he had ever been concerned.\nThe marriage with Nidderdale would upon the whole be the best thing, if it could only be accomplished. The reader must understand that though Mr. Melmotte had allowed himself considerable poetical licence in that statement as to property thirty times as great as the price which he ought to have paid for Pickering, still there was property. The man's speculations had been so great and so wide that he did not really know what he owned, or what he owed. But he did know that at the present moment he was driven very hard for large sums. His chief trust for immediate money was in Cohenlupe, in whose hands had really been the manipulation of the shares of the Mexican railway. He had trusted much to Cohenlupe,--more than it had been customary with him to trust to any man. Cohenlupe assured him that nothing could be done with the railway shares at the present moment. They had fallen under the panic almost to nothing. Now in the time of his trouble Melmotte wanted money from the great railway, but just because he wanted money the great railway was worth nothing. Cohenlupe told him that he must tide over the evil hour,--or rather over an evil month. It was at Cohenlupe's instigation that he had offered the two bills to Mr. Bideawhile. \"Offer 'em again,\" said Cohenlupe. \"He must take the bills sooner or later.\"\nOn the Monday afternoon Melmotte met Lord Nidderdale in the lobby of the House. \"Have you seen Marie lately?\" he said. Nidderdale had been assured that morning, by his father's lawyer, in his father's presence, that if he married Miss Melmotte at present he would undoubtedly become possessed of an income amounting to something over 5,000 a year. He had intended to get more than that,--and was hardly prepared to accept Marie at such a price; but then there probably would be more. No doubt there was a difficulty about Pickering. Melmotte certainly had been raising money. But this might probably be an affair of a few weeks. Melmotte had declared that Pickering should be made over to the young people at the marriage. His father had recommended him to get the girl to name a day. The marriage could be broken off at the last day if the property were not forthcoming.\n\"I'm going up to your house almost immediately,\" said Nidderdale.\n\"You'll find the women at tea to a certainty between five and six,\" said Melmotte.",
        "paragraph_chars": [
            [
                0,
                4489
            ],
            [
                4489,
                5759
            ],
            [
                5759,
                7070
            ],
            [
                7070,
                8713
            ],
            [
                8713,
                8779
            ],
            [
                8779,
                9436
            ],
            [
                9436,
                10217
            ],
            [
                10217,
                10375
            ],
            [
                10375,
                11231
            ],
            [
                11231,
                11859
            ],
            [
                11859,
                13561
            ],
            [
                13561,
                14882
            ],
            [
                14882,
                15754
            ],
            [
                15754,
                15820
            ],
            [
                15820,
                15902
            ]
        ],
        "segment_chars": [
            [
                0,
                200
            ],
            [
                200,
                281
            ],
            [
                281,
                438
            ],
            [
                438,
                627
            ],
            [
                627,
                843
            ],
            [
                843,
                1152
            ],
            [
                1152,
                1330
            ],
            [
                1330,
                1538
            ],
            [
                1538,
                1790
            ],
            [
                1790,
                1824
            ],
            [
                1824,
                1877
            ],
            [
                1877,
                2060
            ],
            [
                2060,
                2183
            ],
            [
                2183,
                2252
            ],
            [
                2252,
                2359
            ],
            [
                2359,
                2430
            ],
            [
                2430,
                2575
            ],
            [
                2575,
                2664
            ],
            [
                2664,
                2784
            ],
            [
                2784,
                2912
            ],
            [
                2912,
                3092
            ],
            [
                3092,
                3170
            ],
            [
                3170,
                3368
            ],
            [
                3368,
                3434
            ],
            [
                3434,
                3537
            ],
            [
                3537,
                3899
            ],
            [
                3899,
                3954
            ],
            [
                3954,
                4053
            ],
            [
                4053,
                4274
            ],
            [
                4274,
                4294
            ],
            [
                4294,
                4314
            ],
            [
                4314,
                4338
            ],
            [
                4338,
                4367
            ],
            [
                4367,
                4489
            ],
            [
                4489,
                4544
            ],
            [
                4544,
                4695
            ],
            [
                4695,
                4799
            ],
            [
                4799,
                4976
            ],
            [
                4976,
                5154
            ],
            [
                5154,
                5309
            ],
            [
                5309,
                5439
            ],
            [
                5439,
                5588
            ],
            [
                5588,
                5759
            ],
            [
                5759,
                5795
            ],
            [
                5795,
                5974
            ],
            [
                5974,
                6224
            ],
            [
                6224,
                6352
            ],
            [
                6352,
                6476
            ],
            [
                6476,
                6599
            ],
            [
                6599,
                6670
            ],
            [
                6670,
                7070
            ],
            [
                7070,
                7209
            ],
            [
                7209,
                7343
            ],
            [
                7343,
                7372
            ],
            [
                7372,
                7545
            ],
            [
                7545,
                7652
            ],
            [
                7652,
                7839
            ],
            [
                7839,
                7910
            ],
            [
                7910,
                7925
            ],
            [
                7925,
                7985
            ],
            [
                7985,
                8059
            ],
            [
                8059,
                8113
            ],
            [
                8113,
                8173
            ],
            [
                8173,
                8259
            ],
            [
                8259,
                8313
            ],
            [
                8313,
                8398
            ],
            [
                8398,
                8467
            ],
            [
                8467,
                8529
            ],
            [
                8529,
                8555
            ],
            [
                8555,
                8611
            ],
            [
                8611,
                8713
            ],
            [
                8713,
                8779
            ],
            [
                8779,
                8840
            ],
            [
                8840,
                8930
            ],
            [
                8930,
                9103
            ],
            [
                9103,
                9215
            ],
            [
                9215,
                9257
            ],
            [
                9257,
                9352
            ],
            [
                9352,
                9436
            ],
            [
                9436,
                9592
            ],
            [
                9592,
                9711
            ],
            [
                9711,
                9859
            ],
            [
                9859,
                9993
            ],
            [
                9993,
                10103
            ],
            [
                10103,
                10217
            ],
            [
                10217,
                10288
            ],
            [
                10288,
                10375
            ],
            [
                10375,
                10429
            ],
            [
                10429,
                10579
            ],
            [
                10579,
                10695
            ],
            [
                10695,
                10819
            ],
            [
                10819,
                10875
            ],
            [
                10875,
                10944
            ],
            [
                10944,
                11051
            ],
            [
                11051,
                11231
            ],
            [
                11231,
                11506
            ],
            [
                11506,
                11747
            ],
            [
                11747,
                11859
            ],
            [
                11859,
                12134
            ],
            [
                12134,
                12260
            ],
            [
                12260,
                12380
            ],
            [
                12380,
                12540
            ],
            [
                12540,
                12680
            ],
            [
                12680,
                12731
            ],
            [
                12731,
                12784
            ],
            [
                12784,
                12803
            ],
            [
                12803,
                12974
            ],
            [
                12974,
                13063
            ],
            [
                13063,
                13165
            ],
            [
                13165,
                13443
            ],
            [
                13443,
                13561
            ],
            [
                13561,
                13664
            ],
            [
                13664,
                13903
            ],
            [
                13903,
                14016
            ],
            [
                14016,
                14099
            ],
            [
                14099,
                14239
            ],
            [
                14239,
                14336
            ],
            [
                14336,
                14432
            ],
            [
                14432,
                14483
            ],
            [
                14483,
                14630
            ],
            [
                14630,
                14718
            ],
            [
                14718,
                14805
            ],
            [
                14805,
                14840
            ],
            [
                14840,
                14882
            ],
            [
                14882,
                14962
            ],
            [
                14962,
                14992
            ],
            [
                14992,
                15001
            ],
            [
                15001,
                15230
            ],
            [
                15230,
                15366
            ],
            [
                15366,
                15415
            ],
            [
                15415,
                15458
            ],
            [
                15458,
                15511
            ],
            [
                15511,
                15605
            ],
            [
                15605,
                15667
            ],
            [
                15667,
                15754
            ],
            [
                15754,
                15820
            ],
            [
                15820,
                15902
            ]
        ],
        "overlap_chars": [
            [
                0,
                152
            ],
            [
                157,
                175
            ],
            [
                189,
                200
            ],
            [
                200,
                281
            ],
            [
                362,
                379
            ],
            [
                389,
                392
            ],
            [
                406,
                417
            ],
            [
                380,
                388
            ],
            [
                436,
                438
            ],
            [
                438,
                463
            ],
            [
                488,
                576
            ],
            [
                586,
                627
            ],
            [
                702,
                717
            ],
            [
                675,
                695
            ],
            [
                718,
                751
            ],
            [
                627,
                629
            ],
            [
                752,
                766
            ],
            [
                775,
                815
            ],
            [
                663,
                674
            ],
            [
                828,
                843
            ],
            [
                843,
                859
            ],
            [
                928,
                932
            ],
            [
                898,
                900
            ],
            [
                976,
                988
            ],
            [
                997,
                1003
            ],
            [
                1018,
                1023
            ],
            [
                1060,
                1078
            ],
            [
                1089,
                1113
            ],
            [
                1122,
                1131
            ],
            [
                1150,
                1151
            ],
            [
                1824,
                1877
            ],
            [
                1877,
                1980
            ],
            [
                2060,
                2088
            ],
            [
                2096,
                2118
            ],
            [
                2134,
                2157
            ],
            [
                1995,
                1997
            ],
            [
                2058,
                2059
            ],
            [
                2188,
                2190
            ],
            [
                2196,
                2203
            ],
            [
                2186,
                2187
            ],
            [
                2221,
                2236
            ],
            [
                2243,
                2252
            ],
            [
                2252,
                2262
            ],
            [
                2270,
                2292
            ],
            [
                2303,
                2357
            ],
            [
                2376,
                2379
            ],
            [
                2293,
                2297
            ],
            [
                2428,
                2430
            ],
            [
                2476,
                2478
            ],
            [
                2447,
                2450
            ],
            [
                2461,
                2474
            ],
            [
                2573,
                2575
            ],
            [
                2664,
                2667
            ],
            [
                2673,
                2689
            ],
            [
                2708,
                2712
            ],
            [
                2730,
                2736
            ],
            [
                2750,
                2762
            ],
            [
                2782,
                2784
            ],
            [
                2784,
                2808
            ],
            [
                2816,
                2912
            ],
            [
                2912,
                2918
            ],
            [
                2925,
                2942
            ],
            [
                2944,
                2953
            ],
            [
                3053,
                3055
            ],
            [
                2967,
                2970
            ],
            [
                2978,
                2982
            ],
            [
                2983,
                3025
            ],
            [
                3034,
                3040
            ],
            [
                3026,
                3033
            ],
            [
                3090,
                3091
            ],
            [
                3227,
                3233
            ],
            [
                3239,
                3243
            ],
            [
                3221,
                3222
            ],
            [
                3383,
                3386
            ],
            [
                3258,
                3301
            ],
            [
                3223,
                3226
            ],
            [
                3170,
                3176
            ],
            [
                3414,
                3432
            ],
            [
                3368,
                3382
            ],
            [
                3301,
                3302
            ],
            [
                3467,
                3470
            ],
            [
                3535,
                3537
            ],
            [
                3537,
                3558
            ],
            [
                3639,
                3642
            ],
            [
                3559,
                3606
            ],
            [
                3897,
                3899
            ],
            [
                4053,
                4057
            ],
            [
                4065,
                4124
            ],
            [
                4137,
                4191
            ],
            [
                4201,
                4207
            ],
            [
                4238,
                4274
            ],
            [
                4294,
                4306
            ],
            [
                4312,
                4314
            ],
            [
                4338,
                4341
            ],
            [
                4347,
                4354
            ],
            [
                4361,
                4367
            ],
            [
                4367,
                4433
            ],
            [
                4452,
                4489
            ],
            [
                4489,
                4527
            ],
            [
                4542,
                4544
            ],
            [
                4804,
                4807
            ],
            [
                4821,
                4839
            ],
            [
                4974,
                4976
            ],
            [
                4980,
                4982
            ],
            [
                5055,
                5059
            ],
            [
                5010,
                5014
            ],
            [
                5083,
                5099
            ],
            [
                5110,
                5154
            ],
            [
                5211,
                5234
            ],
            [
                5240,
                5284
            ],
            [
                5376,
                5378
            ],
            [
                5411,
                5439
            ],
            [
                5439,
                5446
            ],
            [
                5453,
                5483
            ],
            [
                5447,
                5452
            ],
            [
                5525,
                5532
            ],
            [
                5556,
                5568
            ],
            [
                5577,
                5588
            ],
            [
                5588,
                5655
            ],
            [
                5657,
                5662
            ],
            [
                5670,
                5678
            ],
            [
                5680,
                5682
            ],
            [
                5694,
                5702
            ],
            [
                5730,
                5733
            ],
            [
                5703,
                5720
            ],
            [
                5757,
                5759
            ],
            [
                5795,
                5802
            ],
            [
                5853,
                5865
            ],
            [
                5896,
                5945
            ],
            [
                5949,
                5974
            ],
            [
                5974,
                5976
            ],
            [
                6132,
                6138
            ],
            [
                6002,
                6006
            ],
            [
                6013,
                6015
            ],
            [
                6045,
                6110
            ],
            [
                6126,
                6127
            ],
            [
                6111,
                6119
            ],
            [
                6016,
                6018
            ],
            [
                6167,
                6176
            ],
            [
                6032,
                6035
            ],
            [
                6181,
                6186
            ],
            [
                6144,
                6154
            ],
            [
                6222,
                6224
            ],
            [
                6352,
                6355
            ],
            [
                6368,
                6439
            ],
            [
                6448,
                6476
            ],
            [
                6674,
                6702
            ],
            [
                6709,
                6712
            ],
            [
                6723,
                6749
            ],
            [
                6785,
                6801
            ],
            [
                6812,
                6820
            ],
            [
                6901,
                6915
            ],
            [
                6848,
                6859
            ],
            [
                6720,
                6722
            ],
            [
                6865,
                6870
            ],
            [
                6926,
                6939
            ],
            [
                6952,
                7026
            ],
            [
                7031,
                7040
            ],
            [
                7068,
                7070
            ],
            [
                7092,
                7112
            ],
            [
                7119,
                7129
            ],
            [
                7159,
                7209
            ],
            [
                7222,
                7289
            ],
            [
                7305,
                7318
            ],
            [
                7335,
                7343
            ],
            [
                7343,
                7372
            ],
            [
                7372,
                7394
            ],
            [
                7513,
                7516
            ],
            [
                7404,
                7430
            ],
            [
                7491,
                7492
            ],
            [
                7431,
                7434
            ],
            [
                7448,
                7456
            ],
            [
                7552,
                7555
            ],
            [
                7582,
                7651
            ],
            [
                7652,
                7781
            ],
            [
                7783,
                7796
            ],
            [
                7806,
                7838
            ],
            [
                7985,
                8057
            ],
            [
                8057,
                8059
            ],
            [
                8059,
                8074
            ],
            [
                8075,
                8112
            ],
            [
                8113,
                8141
            ],
            [
                8160,
                8173
            ],
            [
                8173,
                8199
            ],
            [
                8218,
                8226
            ],
            [
                8232,
                8246
            ],
            [
                8252,
                8259
            ],
            [
                8289,
                8291
            ],
            [
                8296,
                8311
            ],
            [
                8313,
                8315
            ],
            [
                8320,
                8336
            ],
            [
                8347,
                8370
            ],
            [
                8398,
                8436
            ],
            [
                8343,
                8346
            ],
            [
                8479,
                8481
            ],
            [
                8508,
                8529
            ],
            [
                8529,
                8555
            ],
            [
                8555,
                8610
            ],
            [
                8779,
                8840
            ],
            [
                8956,
                8967
            ],
            [
                8954,
                8955
            ],
            [
                8937,
                8946
            ],
            [
                9030,
                9031
            ],
            [
                8930,
                8932
            ],
            [
                9032,
                9103
            ],
            [
                9215,
                9255
            ],
            [
                9257,
                9260
            ],
            [
                9311,
                9313
            ],
            [
                9336,
                9340
            ],
            [
                9350,
                9352
            ],
            [
                9352,
                9403
            ],
            [
                9406,
                9436
            ],
            [
                9463,
                9469
            ],
            [
                9439,
                9445
            ],
            [
                9506,
                9538
            ],
            [
                9540,
                9590
            ],
            [
                9453,
                9454
            ],
            [
                9723,
                9741
            ],
            [
                9791,
                9794
            ],
            [
                9590,
                9591
            ],
            [
                10001,
                10103
            ],
            [
                10103,
                10132
            ],
            [
                10157,
                10189
            ],
            [
                10196,
                10217
            ],
            [
                10217,
                10288
            ],
            [
                10288,
                10375
            ],
            [
                10375,
                10429
            ],
            [
                10429,
                10464
            ],
            [
                10534,
                10579
            ],
            [
                10579,
                10604
            ],
            [
                10625,
                10633
            ],
            [
                10636,
                10638
            ],
            [
                10652,
                10695
            ],
            [
                10695,
                10819
            ],
            [
                10819,
                10822
            ],
            [
                10828,
                10873
            ],
            [
                10879,
                10888
            ],
            [
                10905,
                10944
            ],
            [
                10944,
                10957
            ],
            [
                10963,
                10970
            ],
            [
                10958,
                10962
            ],
            [
                10971,
                11030
            ],
            [
                11044,
                11050
            ],
            [
                11051,
                11163
            ],
            [
                11177,
                11231
            ],
            [
                11231,
                11247
            ],
            [
                11251,
                11260
            ],
            [
                11270,
                11278
            ],
            [
                11303,
                11362
            ],
            [
                11391,
                11505
            ],
            [
                11506,
                11520
            ],
            [
                11609,
                11629
            ],
            [
                11637,
                11676
            ],
            [
                11684,
                11696
            ],
            [
                11706,
                11747
            ],
            [
                11747,
                11838
            ],
            [
                11857,
                11859
            ],
            [
                11968,
                11969
            ],
            [
                11885,
                11888
            ],
            [
                12006,
                12014
            ],
            [
                12037,
                12078
            ],
            [
                12110,
                12134
            ],
            [
                12134,
                12157
            ],
            [
                12194,
                12197
            ],
            [
                12400,
                12427
            ],
            [
                12447,
                12486
            ],
            [
                12496,
                12519
            ],
            [
                12538,
                12540
            ],
            [
                12546,
                12566
            ],
            [
                12544,
                12545
            ],
            [
                12567,
                12590
            ],
            [
                12645,
                12647
            ],
            [
                12648,
                12679
            ],
            [
                12731,
                12784
            ],
            [
                12784,
                12803
            ],
            [
                12803,
                12866
            ],
            [
                12877,
                12884
            ],
            [
                12895,
                12923
            ],
            [
                12937,
                12943
            ],
            [
                12885,
                12894
            ],
            [
                12953,
                12963
            ],
            [
                12972,
                12974
            ],
            [
                12974,
                13000
            ],
            [
                13018,
                13062
            ],
            [
                13063,
                13090
            ],
            [
                13105,
                13109
            ],
            [
                13095,
                13101
            ],
            [
                13115,
                13165
            ],
            [
                13165,
                13234
            ],
            [
                13441,
                13443
            ],
            [
                13443,
                13487
            ],
            [
                13492,
                13508
            ],
            [
                13559,
                13561
            ],
            [
                13561,
                13629
            ],
            [
                13630,
                13641
            ],
            [
                13647,
                13664
            ],
            [
                14059,
                14086
            ],
            [
                14097,
                14099
            ],
            [
                14099,
                14114
            ],
            [
                14135,
                14152
            ],
            [
                14306,
                14310
            ],
            [
                14204,
                14237
            ],
            [
                14259,
                14261
            ],
            [
                14311,
                14314
            ],
            [
                14239,
                14253
            ],
            [
                14274,
                14283
            ],
            [
                14324,
                14336
            ],
            [
                14336,
                14411
            ],
            [
                14416,
                14423
            ],
            [
                14432,
                14447
            ],
            [
                14464,
                14483
            ],
            [
                14718,
                14804
            ],
            [
                14805,
                14840
            ],
            [
                14840,
                14853
            ],
            [
                14864,
                14882
            ],
            [
                14882,
                14961
            ],
            [
                14962,
                14992
            ],
            [
                14992,
                15001
            ],
            [
                15001,
                15066
            ],
            [
                15093,
                15125
            ],
            [
                15137,
                15200
            ],
            [
                15211,
                15230
            ],
            [
                15230,
                15267
            ],
            [
                15325,
                15366
            ],
            [
                15366,
                15415
            ],
            [
                15458,
                15461
            ],
            [
                15415,
                15423
            ],
            [
                15434,
                15456
            ],
            [
                15520,
                15605
            ],
            [
                15605,
                15667
            ],
            [
                15667,
                15711
            ],
            [
                15716,
                15754
            ],
            [
                15754,
                15781
            ],
            [
                15800,
                15820
            ],
            [
                15820,
                15849
            ],
            [
                15865,
                15902
            ]
        ],
        "row_chars": [
            [
                0,
                200
            ],
            [
                200,
                281
            ],
            [
                281,
                438
            ],
            [
                438,
                627
            ],
            [
                627,
                843
            ],
            [
                843,
                1152
            ],
            [
                1152,
                1330
            ],
            [
                1330,
                1538
            ],
            [
                1538,
                1790
            ],
            [
                1790,
                1824
            ],
            [
                1824,
                1877
            ],
            [
                1877,
                2183
            ],
            [
                2183,
                2252
            ],
            [
                2252,
                2430
            ],
            [
                2430,
                2575
            ],
            [
                2575,
                2664
            ],
            [
                2664,
                2784
            ],
            [
                2784,
                2912
            ],
            [
                2912,
                3092
            ],
            [
                3092,
                3170
            ],
            [
                3170,
                3537
            ],
            [
                3537,
                3899
            ],
            [
                3899,
                3954
            ],
            [
                3954,
                4053
            ],
            [
                4053,
                4274
            ],
            [
                4274,
                4294
            ],
            [
                4294,
                4314
            ],
            [
                4314,
                4338
            ],
            [
                4338,
                4367
            ],
            [
                4367,
                4489
            ],
            [
                4489,
                4544
            ],
            [
                4544,
                4695
            ],
            [
                4695,
                4799
            ],
            [
                4799,
                4976
            ],
            [
                4976,
                5154
            ],
            [
                5154,
                5439
            ],
            [
                5439,
                5588
            ],
            [
                5588,
                5759
            ],
            [
                5759,
                5795
            ],
            [
                5795,
                5974
            ],
            [
                5974,
                6224
            ],
            [
                6224,
                6352
            ],
            [
                6352,
                6476
            ],
            [
                6476,
                6599
            ],
            [
                6599,
                6670
            ],
            [
                6670,
                7070
            ],
            [
                7070,
                7209
            ],
            [
                7209,
                7343
            ],
            [
                7343,
                7372
            ],
            [
                7372,
                7652
            ],
            [
                7652,
                7839
            ],
            [
                7839,
                7910
            ],
            [
                7910,
                7925
            ],
            [
                7925,
                7985
            ],
            [
                7985,
                8059
            ],
            [
                8059,
                8113
            ],
            [
                8113,
                8173
            ],
            [
                8173,
                8259
            ],
            [
                8259,
                8529
            ],
            [
                8529,
                8555
            ],
            [
                8555,
                8611
            ],
            [
                8611,
                8713
            ],
            [
                8713,
                8779
            ],
            [
                8779,
                8840
            ],
            [
                8840,
                8930
            ],
            [
                8930,
                9103
            ],
            [
                9103,
                9215
            ],
            [
                9215,
                9352
            ],
            [
                9352,
                9436
            ],
            [
                9436,
                9859
            ],
            [
                9859,
                9993
            ],
            [
                9993,
                10103
            ],
            [
                10103,
                10217
            ],
            [
                10217,
                10288
            ],
            [
                10288,
                10375
            ],
            [
                10375,
                10429
            ],
            [
                10429,
                10579
            ],
            [
                10579,
                10695
            ],
            [
                10695,
                10819
            ],
            [
                10819,
                10944
            ],
            [
                10944,
                11051
            ],
            [
                11051,
                11231
            ],
            [
                11231,
                11506
            ],
            [
                11506,
                11747
            ],
            [
                11747,
                11859
            ],
            [
                11859,
                12134
            ],
            [
                12134,
                12540
            ],
            [
                12540,
                12680
            ],
            [
                12680,
                12731
            ],
            [
                12731,
                12784
            ],
            [
                12784,
                12803
            ],
            [
                12803,
                12974
            ],
            [
                12974,
                13063
            ],
            [
                13063,
                13165
            ],
            [
                13165,
                13443
            ],
            [
                13443,
                13561
            ],
            [
                13561,
                13664
            ],
            [
                13664,
                13903
            ],
            [
                13903,
                14016
            ],
            [
                14016,
                14099
            ],
            [
                14099,
                14336
            ],
            [
                14336,
                14483
            ],
            [
                14483,
                14630
            ],
            [
                14630,
                14718
            ],
            [
                14718,
                14805
            ],
            [
                14805,
                14840
            ],
            [
                14840,
                14882
            ],
            [
                14882,
                14962
            ],
            [
                14962,
                14992
            ],
            [
                14992,
                15001
            ],
            [
                15001,
                15230
            ],
            [
                15230,
                15366
            ],
            [
                15366,
                15415
            ],
            [
                15415,
                15605
            ],
            [
                15605,
                15667
            ],
            [
                15667,
                15754
            ],
            [
                15754,
                15820
            ],
            [
                15820,
                15902
            ]
        ]
    },
    "abridged": {
        "text": "When Marie Melmotte assured Sir Felix Carbury that her father had already endowed her with a large fortune which could not be taken from her without her consent, she spoke the truth. She knew of the matter almost as little as it was possible that she should know. Melmotte had kept all the details from her. But it had been necessary for him to explain, or to pretend to explain, much; and Marie's memory and also her intelligence were strong beyond her father's anticipation. He had invested a large sum of money in foreign funds in her name, and he had got her to give him a power of attorney enabling him to draw the income from them on her behalf. This he had done so that he should still have enough money to live in comfort, should he be doomed to obscurity.\nBut he had failed to consider various circumstances. His daughter might be untrue to him, or in the event of her marriage might fail to release his property; or there might come troubles so great that even the future income would not be enough.\nAt present, he was tortured by anxiety. Were he to take back this property it would enable him to pay all that was due to the Longestaffes, and more. He did not care about the Longstaffes themselves. But he was painfully aware that not just a simple debt was involved. He had with his own hand written Dolly Longestaffe's signature on the letter which he had found in old Mr. Longestaffe's drawer. He had discovered it in an envelope addressed in Mr. Longstaffe's writing to Messrs. Slow and Bideawhile, and he had posted it himself.\nAt the time, he was the joint tenant of Mr. Longestaffe's study; and he had long since learned to pick a lock, though he could not then relock it. He had picked a lock, and had found the letter prepared by Mr. Bideawhile. Even if the young man were to swear that the signature was not his, and the old man were to swear that he had left that drawer locked, still there could be no evidence. People might talk. And a crash might come. But there would still be that ample fortune on which to retire and make merry for the rest of his days.\nThen there came annoying complications. Rumours of the forgery were spread abroad. If a jury were persuaded that he had done it, of what use then would be all that money? He wondered whether it might not be better to use the money to save him from such ruin, by paying for the Pickering property. Neither Dolly Longestaffe nor Squercum would concern themselves any further if the money were paid. But then the money would be as good as wasted by such a payment, if - as he believed - no firm evidence of the forgery could be produced.\nPerhaps Mr. Melmotte attached higher privileges to the British aristocracy than in truth belong to them. He really believed that if he became the father-in-law of the eldest son of the Marquis of Auld Reekie, he would be safe from the fangs of the law. And if he could tide over this bad time, how glorious would it be to have a Marquis for his son-in-law! He knew that Lord Nidderdale would not marry his daughter without property, but he thought that the funds which had been transferred to Marie might suffice; and he had already given proof to the Marquis's lawyer that his daughter possessed them.\nNow another complication had arisen which had startled Mr. Melmotte very much indeed. One morning he had sent for Marie to the study and had told her that he required her signature for a deed. She had asked him what deed. He had replied that it was a document regarding money, and that she need not ask any more questions as she would be wanted only to sign the paper.\nThen Marie astounded him, not merely by showing him that she understood a great deal more of the transaction than he had thought, but also by a refusal to sign anything at all.\n\"You have been so unkind to me about Sir Felix Carbury that I won't do it,\" she said. \"If I ever marry, the money will belong to my husband!\"\nHis breath almost failed him at these words. He did not know whether to use threats, entreaties, or blows. He tried all three: he told her that he would put her in prison, he besought her not to ruin her parent, and then he shook her violently. But Marie was quite firm. He might cut her to pieces; but she would sign nothing.\nThis was another reason for sticking to the Nidderdale plan. On weighing things up, therefore, he decided to leave the Longestaffes unpaid and to let Nidderdale have the money. The dangers on all sides were very great; but he intended to be bold. Marie had now said that she would accept Nidderdale - or the sweep at the crossing.\nOn the Monday after his famous speech in Parliament, one of the Bideawhiles had come to him in the City, asking for payment for Pickering. Mr. Melmotte offered to make the payment in two bills at three and six months' date, with proper interest allowed. But this offer Mr. Bideawhile rejected indignantly, demanding that the title-deeds should be restored to them.\n\"You have no right whatever to demand the title-deeds,\" said Melmotte. \"You can only claim the sum due, and I have already told you how I propose to pay it.\"\nMr. Bideawhile was nearly beside himself with dismay. In the whole course of his business, there had never been such a thing as this. Of course Mr. Longestaffe was to blame - so the Bideawhiles declared among themselves. He had been so anxious to have dealings with the man of money that he had insisted that the title-deeds should be given up. But the title-deeds had not been his to surrender; for Pickering was the joint property of him and his son. The house had already been pulled down, and now the purchaser offered bills in lieu of money!\n\"Do you mean to tell me, Mr. Melmotte, that you have not got the money to pay for what you have bought, and that the title-deeds have already gone out of your hands?\"\n\"I have property of ten times, twenty times the value,\" said Melmotte proudly; \"but you must know that a man engaged in large affairs cannot always realise such a sum as eighty thousand pounds at a day's notice.\"\nMr. Bideawhile replied that he thought that his client had been robbed, and that he would at once take the severest steps the law put in his power. As Mr. Melmotte shrugged his shoulders and made no further reply, Mr. Bideawhile could only depart.\nMr. Bideawhile was now doubtful about the genuineness of the letter which Dolly declared that he had not signed. Mr. Longestaffe himself had asserted that he had left the letter locked in his own drawer in the room which had become Melmotte's study. On entering the room with Mr. Bideawhile, in Melmotte's presence, he had found that his drawer was open.\n\"Do you mean to say that I have opened your drawer?\" said Mr. Melmotte. Mr. Longestaffe had become very red in the face and had replied that he made no such accusation, but he had certainly locked the drawer. He knew his own habits and had never left that drawer open in his life.\n\"Then you must have changed your habits on this occasion,\" said Mr. Melmotte with spirit. Mr. Longestaffe would trust himself to no other word within the house. Mr. Bideawhile could only remark that it was most unfortunate.\nThe marriage with Nidderdale would upon the whole be the best thing, thought Melmotte, if it could be accomplished. He was driven very hard for money. His chief trust was in Cohenlupe, who dealt with the shares of the Mexican railway: to him he had trusted more than he normally trusted to any man. Cohenlupe assured him that nothing could be done with the railway shares at present; they had fallen almost to nothing. It was at Cohenlupe's instigation that he had offered the two bills to Mr. Bideawhile.\n\"Offer 'em again,\" said Cohenlupe. \"He must take them sooner or later.\"\nOn the Monday afternoon Melmotte met Lord Nidderdale in the lobby of the House.\n\"Have you seen Marie lately?\" he said. Nidderdale had been assured that morning, by his father's lawyer, that if he married Miss Melmotte now he would undoubtedly become possessed of an income amounting to over 5,000 a year. He had intended to get more than that; but then there probably would be more. No doubt there was a difficulty about Pickering. But Melmotte had been raising money, and had declared that Pickering should be made over to the young people at the marriage. His father had recommended him to get the girl to name a day. The marriage could be broken off at the last minute if the property were not forthcoming.\n\"I'm going up to your house now,\" said Nidderdale.\n\"You'll find the women at tea between five and six,\" said Melmotte.",
        "paragraph_chars": [
            [
                0,
                765
            ],
            [
                765,
                1010
            ],
            [
                1010,
                1544
            ],
            [
                1544,
                2082
            ],
            [
                2082,
                2617
            ],
            [
                2617,
                3220
            ],
            [
                3220,
                3589
            ],
            [
                3589,
                3766
            ],
            [
                3766,
                3908
            ],
            [
                3908,
                4235
            ],
            [
                4235,
                4566
            ],
            [
                4566,
                4931
            ],
            [
                4931,
                5089
            ],
            [
                5089,
                5636
            ],
            [
                5636,
                5803
            ],
            [
                5803,
                6016
            ],
            [
                6016,
                6264
            ],
            [
                6264,
                6619
            ],
            [
                6619,
                6900
            ],
            [
                6900,
                7124
            ],
            [
                7124,
                7630
            ],
            [
                7630,
                7702
            ],
            [
                7702,
                7782
            ],
            [
                7782,
                8412
            ],
            [
                8412,
                8463
            ],
            [
                8463,
                8530
            ]
        ],
        "segment_chars": [
            [
                0,
                183
            ],
            [
                183,
                264
            ],
            [
                264,
                308
            ],
            [
                308,
                477
            ],
            [
                477,
                652
            ],
            [
                652,
                765
            ],
            [
                765,
                818
            ],
            [
                818,
                1010
            ],
            [
                1010,
                1050
            ],
            [
                1050,
                1160
            ],
            [
                1160,
                1210
            ],
            [
                1210,
                1279
            ],
            [
                1279,
                1408
            ],
            [
                1408,
                1544
            ],
            [
                1544,
                1691
            ],
            [
                1691,
                1766
            ],
            [
                1766,
                1935
            ],
            [
                1935,
                1954
            ],
            [
                1954,
                1978
            ],
            [
                1978,
                2082
            ],
            [
                2082,
                2122
            ],
            [
                2122,
                2165
            ],
            [
                2165,
                2253
            ],
            [
                2253,
                2379
            ],
            [
                2379,
                2479
            ],
            [
                2479,
                2617
            ],
            [
                2617,
                2722
            ],
            [
                2722,
                2870
            ],
            [
                2870,
                2974
            ],
            [
                2974,
                3220
            ],
            [
                3220,
                3306
            ],
            [
                3306,
                3413
            ],
            [
                3413,
                3442
            ],
            [
                3442,
                3589
            ],
            [
                3589,
                3766
            ],
            [
                3766,
                3852
            ],
            [
                3852,
                3908
            ],
            [
                3908,
                3953
            ],
            [
                3953,
                4015
            ],
            [
                4015,
                4153
            ],
            [
                4153,
                4179
            ],
            [
                4179,
                4235
            ],
            [
                4235,
                4296
            ],
            [
                4296,
                4412
            ],
            [
                4412,
                4482
            ],
            [
                4482,
                4566
            ],
            [
                4566,
                4705
            ],
            [
                4705,
                4820
            ],
            [
                4820,
                4931
            ],
            [
                4931,
                5002
            ],
            [
                5002,
                5089
            ],
            [
                5089,
                5143
            ],
            [
                5143,
                5223
            ],
            [
                5223,
                5310
            ],
            [
                5310,
                5434
            ],
            [
                5434,
                5542
            ],
            [
                5542,
                5636
            ],
            [
                5636,
                5803
            ],
            [
                5803,
                6016
            ],
            [
                6016,
                6164
            ],
            [
                6164,
                6264
            ],
            [
                6264,
                6377
            ],
            [
                6377,
                6514
            ],
            [
                6514,
                6619
            ],
            [
                6619,
                6672
            ],
            [
                6672,
                6691
            ],
            [
                6691,
                6828
            ],
            [
                6828,
                6900
            ],
            [
                6900,
                6990
            ],
            [
                6990,
                7061
            ],
            [
                7061,
                7124
            ],
            [
                7124,
                7240
            ],
            [
                7240,
                7275
            ],
            [
                7275,
                7423
            ],
            [
                7423,
                7543
            ],
            [
                7543,
                7630
            ],
            [
                7630,
                7665
            ],
            [
                7665,
                7702
            ],
            [
                7702,
                7782
            ],
            [
                7782,
                7812
            ],
            [
                7812,
                7821
            ],
            [
                7821,
                8007
            ],
            [
                8007,
                8085
            ],
            [
                8085,
                8134
            ],
            [
                8134,
                8260
            ],
            [
                8260,
                8322
            ],
            [
                8322,
                8412
            ],
            [
                8412,
                8463
            ],
            [
                8463,
                8530
            ]
        ],
        "overlap_chars": [
            [
                0,
                152
            ],
            [
                153,
                171
            ],
            [
                172,
                183
            ],
            [
                183,
                264
            ],
            [
                264,
                281
            ],
            [
                282,
                285
            ],
            [
                286,
                297
            ],
            [
                298,
                306
            ],
            [
                306,
                308
            ],
            [
                308,
                333
            ],
            [
                342,
                430
            ],
            [
                436,
                477
            ],
            [
                477,
                492
            ],
            [
                493,
                513
            ],
            [
                514,
                547
            ],
            [
                548,
                550
            ],
            [
                551,
                565
            ],
            [
                575,
                615
            ],
            [
                620,
                631
            ],
            [
                637,
                652
            ],
            [
                652,
                668
            ],
            [
                672,
                676
            ],
            [
                677,
                679
            ],
            [
                680,
                692
            ],
            [
                698,
                704
            ],
            [
                705,
                710
            ],
            [
                711,
                729
            ],
            [
                729,
                753
            ],
            [
                754,
                763
            ],
            [
                763,
                764
            ],
            [
                765,
                818
            ],
            [
                818,
                921
            ],
            [
                923,
                951
            ],
            [
                952,
                974
            ],
            [
                975,
                998
            ],
            [
                999,
                1001
            ],
            [
                1008,
                1009
            ],
            [
                1010,
                1012
            ],
            [
                1013,
                1020
            ],
            [
                1020,
                1021
            ],
            [
                1025,
                1040
            ],
            [
                1041,
                1050
            ],
            [
                1050,
                1060
            ],
            [
                1071,
                1093
            ],
            [
                1094,
                1148
            ],
            [
                1150,
                1153
            ],
            [
                1154,
                1158
            ],
            [
                1158,
                1160
            ],
            [
                1160,
                1162
            ],
            [
                1182,
                1185
            ],
            [
                1195,
                1208
            ],
            [
                1208,
                1210
            ],
            [
                1210,
                1213
            ],
            [
                1214,
                1230
            ],
            [
                1237,
                1241
            ],
            [
                1253,
                1259
            ],
            [
                1265,
                1277
            ],
            [
                1277,
                1279
            ],
            [
                1279,
                1303
            ],
            [
                1312,
                1408
            ],
            [
                1408,
                1414
            ],
            [
                1426,
                1443
            ],
            [
                1444,
                1453
            ],
            [
                1454,
                1456
            ],
            [
                1457,
                1460
            ],
            [
                1467,
                1471
            ],
            [
                1482,
                1524
            ],
            [
                1525,
                1531
            ],
            [
                1535,
                1542
            ],
            [
                1542,
                1543
            ],
            [
                1544,
                1550
            ],
            [
                1551,
                1555
            ],
            [
                1555,
                1556
            ],
            [
                1560,
                1563
            ],
            [
                1564,
                1607
            ],
            [
                1609,
                1612
            ],
            [
                1613,
                1619
            ],
            [
                1620,
                1638
            ],
            [
                1639,
                1653
            ],
            [
                1653,
                1654
            ],
            [
                1671,
                1674
            ],
            [
                1689,
                1691
            ],
            [
                1691,
                1712
            ],
            [
                1713,
                1716
            ],
            [
                1717,
                1764
            ],
            [
                1764,
                1766
            ],
            [
                1766,
                1770
            ],
            [
                1774,
                1833
            ],
            [
                1838,
                1892
            ],
            [
                1893,
                1899
            ],
            [
                1899,
                1935
            ],
            [
                1935,
                1947
            ],
            [
                1952,
                1954
            ],
            [
                1954,
                1957
            ],
            [
                1958,
                1965
            ],
            [
                1972,
                1978
            ],
            [
                1978,
                2044
            ],
            [
                2045,
                2082
            ],
            [
                2082,
                2120
            ],
            [
                2120,
                2122
            ],
            [
                2133,
                2136
            ],
            [
                2145,
                2163
            ],
            [
                2163,
                2165
            ],
            [
                2165,
                2167
            ],
            [
                2170,
                2174
            ],
            [
                2175,
                2179
            ],
            [
                2190,
                2206
            ],
            [
                2209,
                2253
            ],
            [
                2265,
                2288
            ],
            [
                2296,
                2340
            ],
            [
                2341,
                2343
            ],
            [
                2351,
                2379
            ],
            [
                2379,
                2386
            ],
            [
                2387,
                2417
            ],
            [
                2418,
                2423
            ],
            [
                2424,
                2431
            ],
            [
                2455,
                2467
            ],
            [
                2468,
                2479
            ],
            [
                2479,
                2546
            ],
            [
                2549,
                2554
            ],
            [
                2555,
                2563
            ],
            [
                2566,
                2568
            ],
            [
                2574,
                2582
            ],
            [
                2586,
                2589
            ],
            [
                2598,
                2615
            ],
            [
                2615,
                2617
            ],
            [
                2617,
                2624
            ],
            [
                2625,
                2637
            ],
            [
                2647,
                2696
            ],
            [
                2697,
                2722
            ],
            [
                2722,
                2724
            ],
            [
                2725,
                2731
            ],
            [
                2741,
                2745
            ],
            [
                2749,
                2751
            ],
            [
                2759,
                2824
            ],
            [
                2824,
                2825
            ],
            [
                2826,
                2834
            ],
            [
                2835,
                2837
            ],
            [
                2838,
                2847
            ],
            [
                2848,
                2851
            ],
            [
                2852,
                2857
            ],
            [
                2858,
                2868
            ],
            [
                2868,
                2870
            ],
            [
                2870,
                2873
            ],
            [
                2874,
                2945
            ],
            [
                2946,
                2974
            ],
            [
                2974,
                3002
            ],
            [
                3009,
                3012
            ],
            [
                3013,
                3039
            ],
            [
                3040,
                3056
            ],
            [
                3065,
                3073
            ],
            [
                3080,
                3094
            ],
            [
                3095,
                3106
            ],
            [
                3107,
                3109
            ],
            [
                3110,
                3115
            ],
            [
                3116,
                3129
            ],
            [
                3129,
                3203
            ],
            [
                3204,
                3213
            ],
            [
                3218,
                3220
            ],
            [
                3224,
                3244
            ],
            [
                3245,
                3255
            ],
            [
                3256,
                3306
            ],
            [
                3310,
                3377
            ],
            [
                3387,
                3400
            ],
            [
                3405,
                3413
            ],
            [
                3413,
                3442
            ],
            [
                3442,
                3464
            ],
            [
                3465,
                3468
            ],
            [
                3469,
                3495
            ],
            [
                3495,
                3496
            ],
            [
                3497,
                3500
            ],
            [
                3501,
                3509
            ],
            [
                3515,
                3518
            ],
            [
                3519,
                3588
            ],
            [
                3589,
                3718
            ],
            [
                3719,
                3732
            ],
            [
                3733,
                3765
            ],
            [
                3767,
                3839
            ],
            [
                3850,
                3852
            ],
            [
                3853,
                3868
            ],
            [
                3870,
                3907
            ],
            [
                3908,
                3936
            ],
            [
                3940,
                3953
            ],
            [
                3953,
                3979
            ],
            [
                3984,
                3992
            ],
            [
                3993,
                4007
            ],
            [
                4008,
                4015
            ],
            [
                4015,
                4017
            ],
            [
                4018,
                4033
            ],
            [
                4035,
                4037
            ],
            [
                4038,
                4054
            ],
            [
                4055,
                4078
            ],
            [
                4080,
                4118
            ],
            [
                4120,
                4123
            ],
            [
                4129,
                4131
            ],
            [
                4132,
                4153
            ],
            [
                4153,
                4179
            ],
            [
                4179,
                4234
            ],
            [
                4235,
                4296
            ],
            [
                4296,
                4307
            ],
            [
                4317,
                4318
            ],
            [
                4319,
                4328
            ],
            [
                4328,
                4329
            ],
            [
                4330,
                4332
            ],
            [
                4341,
                4412
            ],
            [
                4412,
                4452
            ],
            [
                4454,
                4457
            ],
            [
                4470,
                4472
            ],
            [
                4476,
                4480
            ],
            [
                4480,
                4482
            ],
            [
                4482,
                4533
            ],
            [
                4536,
                4566
            ],
            [
                4566,
                4572
            ],
            [
                4573,
                4579
            ],
            [
                4586,
                4618
            ],
            [
                4619,
                4669
            ],
            [
                4669,
                4670
            ],
            [
                4671,
                4689
            ],
            [
                4690,
                4693
            ],
            [
                4703,
                4704
            ],
            [
                4718,
                4820
            ],
            [
                4820,
                4849
            ],
            [
                4870,
                4902
            ],
            [
                4910,
                4931
            ],
            [
                4931,
                5002
            ],
            [
                5002,
                5089
            ],
            [
                5089,
                5143
            ],
            [
                5143,
                5178
            ],
            [
                5178,
                5223
            ],
            [
                5223,
                5248
            ],
            [
                5253,
                5261
            ],
            [
                5264,
                5266
            ],
            [
                5267,
                5310
            ],
            [
                5310,
                5434
            ],
            [
                5434,
                5437
            ],
            [
                5438,
                5483
            ],
            [
                5489,
                5498
            ],
            [
                5503,
                5542
            ],
            [
                5542,
                5555
            ],
            [
                5556,
                5563
            ],
            [
                5564,
                5568
            ],
            [
                5569,
                5628
            ],
            [
                5629,
                5635
            ],
            [
                5636,
                5748
            ],
            [
                5749,
                5803
            ],
            [
                5803,
                5819
            ],
            [
                5823,
                5832
            ],
            [
                5832,
                5840
            ],
            [
                5841,
                5900
            ],
            [
                5901,
                6015
            ],
            [
                6016,
                6030
            ],
            [
                6039,
                6059
            ],
            [
                6060,
                6099
            ],
            [
                6106,
                6118
            ],
            [
                6123,
                6164
            ],
            [
                6164,
                6255
            ],
            [
                6262,
                6264
            ],
            [
                6266,
                6267
            ],
            [
                6279,
                6282
            ],
            [
                6287,
                6295
            ],
            [
                6302,
                6343
            ],
            [
                6353,
                6377
            ],
            [
                6377,
                6400
            ],
            [
                6401,
                6404
            ],
            [
                6414,
                6441
            ],
            [
                6449,
                6488
            ],
            [
                6489,
                6512
            ],
            [
                6512,
                6514
            ],
            [
                6514,
                6534
            ],
            [
                6554,
                6555
            ],
            [
                6556,
                6579
            ],
            [
                6580,
                6582
            ],
            [
                6587,
                6618
            ],
            [
                6619,
                6672
            ],
            [
                6672,
                6691
            ],
            [
                6691,
                6754
            ],
            [
                6755,
                6762
            ],
            [
                6763,
                6791
            ],
            [
                6792,
                6798
            ],
            [
                6799,
                6808
            ],
            [
                6816,
                6826
            ],
            [
                6826,
                6828
            ],
            [
                6828,
                6854
            ],
            [
                6855,
                6899
            ],
            [
                6900,
                6927
            ],
            [
                6928,
                6932
            ],
            [
                6933,
                6939
            ],
            [
                6940,
                6990
            ],
            [
                6990,
                7059
            ],
            [
                7059,
                7061
            ],
            [
                7061,
                7105
            ],
            [
                7106,
                7122
            ],
            [
                7122,
                7124
            ],
            [
                7124,
                7192
            ],
            [
                7211,
                7222
            ],
            [
                7223,
                7240
            ],
            [
                7240,
                7267
            ],
            [
                7273,
                7275
            ],
            [
                7275,
                7290
            ],
            [
                7291,
                7308
            ],
            [
                7319,
                7323
            ],
            [
                7324,
                7357
            ],
            [
                7359,
                7361
            ],
            [
                7362,
                7365
            ],
            [
                7366,
                7380
            ],
            [
                7381,
                7390
            ],
            [
                7411,
                7423
            ],
            [
                7423,
                7498
            ],
            [
                7499,
                7506
            ],
            [
                7508,
                7523
            ],
            [
                7524,
                7543
            ],
            [
                7543,
                7629
            ],
            [
                7630,
                7665
            ],
            [
                7665,
                7678
            ],
            [
                7684,
                7702
            ],
            [
                7702,
                7781
            ],
            [
                7782,
                7812
            ],
            [
                7812,
                7821
            ],
            [
                7821,
                7886
            ],
            [
                7887,
                7919
            ],
            [
                7924,
                7987
            ],
            [
                7988,
                8007
            ],
            [
                8007,
                8044
            ],
            [
                8044,
                8085
            ],
            [
                8085,
                8134
            ],
            [
                8134,
                8137
            ],
            [
                8138,
                8146
            ],
            [
                8147,
                8169
            ],
            [
                8175,
                8260
            ],
            [
                8260,
                8322
            ],
            [
                8322,
                8366
            ],
            [
                8374,
                8412
            ],
            [
                8412,
                8439
            ],
            [
                8443,
                8463
            ],
            [
                8463,
                8492
            ],
            [
                8493,
                8530
            ]
        ],
        "row_chars": [
            [
                0,
                183
            ],
            [
                183,
                264
            ],
            [
                264,
                308
            ],
            [
                308,
                477
            ],
            [
                477,
                652
            ],
            [
                652,
                765
            ],
            [
                765,
                765
            ],
            [
                765,
                765
            ],
            [
                765,
                765
            ],
            [
                765,
                765
            ],
            [
                765,
                818
            ],
            [
                818,
                1010
            ],
            [
                1010,
                1050
            ],
            [
                1050,
                1160
            ],
            [
                1160,
                1210
            ],
            [
                1210,
                1210
            ],
            [
                1210,
                1279
            ],
            [
                1279,
                1408
            ],
            [
                1408,
                1544
            ],
            [
                1544,
                1544
            ],
            [
                1544,
                1691
            ],
            [
                1691,
                1766
            ],
            [
                1766,
                1766
            ],
            [
                1766,
                1766
            ],
            [
                1766,
                1935
            ],
            [
                1935,
                1935
            ],
            [
                1935,
                1954
            ],
            [
                1954,
                1954
            ],
            [
                1954,
                1978
            ],
            [
                1978,
                2082
            ],
            [
                2082,
                2122
            ],
            [
                2122,
                2122
            ],
            [
                2122,
                2122
            ],
            [
                2122,
                2165
            ],
            [
                2165,
                2253
            ],
            [
                2253,
                2379
            ],
            [
                2379,
                2479
            ],
            [
                2479,
                2617
            ],
            [
                2617,
                2617
            ],
            [
                2617,
                2722
            ],
            [
                2722,
                2870
            ],
            [
                2870,
                2870
            ],
            [
                2870,
                2974
            ],
            [
                2974,
                2974
            ],
            [
                2974,
                2974
            ],
            [
                2974,
                3220
            ],
            [
                3220,
                3306
            ],
            [
                3306,
                3413
            ],
            [
                3413,
                3442
            ],
            [
                3442,
                3589
            ],
            [
                3589,
                3766
            ],
            [
                3766,
                3766
            ],
            [
                3766,
                3766
            ],
            [
                3766,
                3766
            ],
            [
                3766,
                3852
            ],
            [
                3852,
                3908
            ],
            [
                3908,
                3953
            ],
            [
                3953,
                4015
            ],
            [
                4015,
                4153
            ],
            [
                4153,
                4179
            ],
            [
                4179,
                4235
            ],
            [
                4235,
                4235
            ],
            [
                4235,
                4235
            ],
            [
                4235,
                4296
            ],
            [
                4296,
                4296
            ],
            [
                4296,
                4412
            ],
            [
                4412,
                4412
            ],
            [
                4412,
                4482
            ],
            [
                4482,
                4566
            ],
            [
                4566,
                4705
            ],
            [
                4705,
                4705
            ],
            [
                4705,
                4820
            ],
            [
                4820,
                4931
            ],
            [
                4931,
                5002
            ],
            [
                5002,
                5089
            ],
            [
                5089,
                5143
            ],
            [
                5143,
                5223
            ],
            [
                5223,
                5310
            ],
            [
                5310,
                5434
            ],
            [
                5434,
                5542
            ],
            [
                5542,
                5636
            ],
            [
                5636,
                5803
            ],
            [
                5803,
                6016
            ],
            [
                6016,
                6164
            ],
            [
                6164,
                6264
            ],
            [
                6264,
                6377
            ],
            [
                6377,
                6514
            ],
            [
                6514,
                6619
            ],
            [
                6619,
                6619
            ],
            [
                6619,
                6672
            ],
            [
                6672,
                6691
            ],
            [
                6691,
                6828
            ],
            [
                6828,
                6900
            ],
            [
                6900,
                6990
            ],
            [
                6990,
                7061
            ],
            [
                7061,
                7124
            ],
            [
                7124,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7240
            ],
            [
                7240,
                7275
            ],
            [
                7275,
                7423
            ],
            [
                7423,
                7543
            ],
            [
                7543,
                7543
            ],
            [
                7543,
                7543
            ],
            [
                7543,
                7630
            ],
            [
                7630,
                7665
            ],
            [
                7665,
                7702
            ],
            [
                7702,
                7782
            ],
            [
                7782,
                7812
            ],
            [
                7812,
                7821
            ],
            [
                7821,
                8007
            ],
            [
                8007,
                8085
            ],
            [
                8085,
                8134
            ],
            [
                8134,
                8260
            ],
            [
                8260,
                8322
            ],
            [
                8322,
                8412
            ],
            [
                8412,
                8463
            ],
            [
                8463,
                8530
            ]
        ]
    }
}