{
    "original": {
        "text": "Lady Carbury was at this time so miserable in regard to her son that she found herself unable to be active as she would otherwise have been in her endeavours to separate Paul Montague and her daughter. Roger had come up to town and given his opinion, very freely at any rate with regard to Sir Felix. But Roger had immediately returned to Suffolk, and the poor mother in want of assistance and consolation turned naturally to Mr. Broune, who came to see her for a few minutes almost every evening. It had now become almost a part of Mr. Broune's life to see Lady Carbury once in the day. She told him of the two propositions which Roger had made: first, that she should fix her residence in some second-rate French or German town, and that Sir Felix should be made to go with her; and, secondly, that she should take possession of Carbury manor for six months. \"And where would Mr. Carbury go?\" asked Mr. Broune.\n\"He's so good that he doesn't care what he does with himself. There's a cottage on the place, he says, that he would move to.\" Mr. Broune shook his head. Mr. Broune did not think that an offer so quixotically generous as this should be accepted. As to the German or French town, Mr. Broune said that the plan was no doubt feasible, but he doubted whether the thing to be achieved was worth the terrible sacrifice demanded. He was inclined to think that Sir Felix should go to the colonies. \"That he might drink himself to death,\" said Lady Carbury, who now had no secrets from Mr. Broune. Sir Felix in the mean time was still in the doctor's hands up-stairs. He had no doubt been very severely thrashed, but there was not in truth very much ailing him beyond the cuts on his face. He was, however, at the present moment better satisfied to be an invalid than to have to come out of his room and to meet the world. \"As to Melmotte,\" said Mr. Broune, \"they say now that he is in some terrible mess which will ruin him and all who have trusted him.\"\n\"And the girl?\"\n\"It is impossible to understand it all. Melmotte was to have been summoned before the Lord Mayor to-day on some charge of fraud;--but it was postponed. And I was told this morning that Nidderdale still means to marry the girl. I don't think anybody knows the truth about it. We shall hold our tongue about him till we really do know something.\" The \"we\" of whom Mr. Broune spoke was, of course, the \"Morning Breakfast Table.\"\nBut in all this there was nothing about Hetta. Hetta, however, thought very much of her own condition, and found herself driven to take some special step by the receipt of two letters from her lover, written to her from Liverpool. They had never met since she had confessed her love to him. The first letter she did not at once answer, as she was at that moment waiting to hear what Roger Carbury would say about Mrs. Hurtle. Roger Carbury had spoken, leaving a conviction on her mind that Mrs. Hurtle was by no means a fiction,--but indeed a fact very injurious to her happiness. Then Paul's second love-letter had come, full of joy, and love, and contentment,--with not a word in it which seemed to have been in the slightest degree influenced by the existence of a Mrs. Hurtle. Had there been no Mrs. Hurtle, the letter would have been all that Hetta could have desired; and she could have answered it, unless forbidden by her mother, with all a girl's usual enthusiastic affection for her chosen lord. But it was impossible that she should now answer it in that strain;--and it was equally impossible that she should leave such letters unanswered. Roger had told her to \"ask himself;\" and she now found herself constrained to bid him either come to her and answer the question, or, if he thought it better, to give her some written account of Mrs. Hurtle,--so that she might know who the lady was, and whether the lady's condition did in any way interfere with her own happiness. So she wrote to Paul, as follows:--\nWelbeck Street, 16th July, 18--.\nMY DEAR PAUL.\nShe found that after that which had passed between them she could not call him \"My dear Sir,\" or \"My dear Mr. Montague,\" and that it must either be \"Sir\" or \"My dear Paul.\" He was dear to her,--very dear; and she thought that he had not been as yet convicted of any conduct bad enough to force her to treat him as an outcast. Had there been no Mrs. Hurtle he would have been her \"Dearest Paul,\"--but she made her choice, and so commenced.\nMY DEAR PAUL,\nA strange report has come round to me about a lady called Mrs. Hurtle. I have been told that she is an American lady living in London, and that she is engaged to be your wife. I cannot believe this. It is too horrid to be true. But I fear,--I fear there is something true that will be very very sad for me to hear. It was from my brother I first heard it,--who was of course bound to tell me anything he knew. I have talked to mamma about it, and to my cousin Roger. I am sure Roger knows it all;--but he will not tell me. He said,--\"Ask himself.\" And so I ask you. Of course I can write about nothing else till I have heard about this. I am sure I need not tell you that it has made me very unhappy. If you cannot come and see me at once, you had better write. I have told mamma about this letter.\nThen came the difficulty of the signature, with the declaration which must naturally be attached to it. After some hesitation she subscribed herself,\nYour affectionate friend,\nHENRIETTA CARBURY.\n\"Most affectionately your own Hetta\" would have been the form in which she would have wished to finish the first letter she had ever written to him.\nPaul received it at Liverpool on the Wednesday morning, and on the Wednesday evening he was in Welbeck Street. He had been quite aware that it had been incumbent on him to tell her the whole history of Mrs. Hurtle. He had meant to keep back--almost nothing. But it had been impossible for him to do so on that one occasion on which he had pleaded his love to her successfully. Let any reader who is intelligent in such matters say whether it would have been possible for him then to have commenced the story of Mrs. Hurtle and to have told it to the bitter end. Such a story must be postponed for a second or a third interview. Or it may, indeed, be communicated by letter. When Paul was called away to Liverpool he did consider whether he should write the story. But there are many reasons strong against such written communications. A man may desire that the woman he loves should hear the record of his folly,--so that, in after days, there may be nothing to be detected; so that, should the Mrs. Hurtle of his life at any time intrude upon his happiness, he may with a clear brow and undaunted heart say to his beloved one,--\"Ah, this is the trouble of which I spoke to you.\" And then he and his beloved one will be in one cause together. But he hardly wishes to supply his beloved one with a written record of his folly. And then who does not know how much tenderness a man may show to his own faults by the tone of his voice, by half-spoken sentences, and by an admixture of words of love for the lady who has filled up the vacant space once occupied by the Mrs. Hurtle of his romance? But the written record must go through from beginning to end, self-accusing, thoroughly perspicuous, with no sweet, soft falsehoods hidden under the half-expressed truth. The soft falsehoods which would be sweet as the scent of violets in a personal interview, would stand in danger of being denounced as deceit added to deceit, if sent in a letter. I think therefore that Paul Montague did quite right in hurrying up to London.\nHe asked for Miss Carbury, and when told that Miss Henrietta was with her mother, he sent his name up and said that he would wait in the dining-room. He had thoroughly made up his mind to this course. They should know that he had come at once; but he would not, if it could be helped, make his statement in the presence of Lady Carbury. Then, up-stairs, there was a little discussion. Hetta pleaded her right to see him alone. She had done what Roger had advised, and had done it with her mother's consent. Her mother might be sure that she would not again accept her lover till this story of Mrs. Hurtle had been sifted to the very bottom. But she must herself hear what her lover had to say for himself. Felix was at the time in the drawing-room and suggested that he should go down and see Paul Montague on his sister's behalf;--but his mother looked at him with scorn, and his sister quietly said that she would rather see Mr. Montague herself. Felix had been so cowed by circumstances that he did not say another word, and Hetta left the room alone.\nWhen she entered the parlour Paul stept forward to take her in his arms. That was a matter of course. She knew it would be so, and she had prepared herself for it. \"Paul,\" she said, \"let me hear about all this--first.\" She sat down at some distance from him,--and he found himself compelled to seat himself at some little distance from her.\n\"And so you have heard of Mrs. Hurtle,\" he said, with a faint attempt at a smile.\n\"Yes;--Felix told me, and Roger evidently had heard about her.\"\n\"Oh yes; Roger Carbury has heard about her from the beginning;--knows the whole history almost as well as I know it myself. I don't think your brother is as well informed.\"\n\"Perhaps not. But--isn't it a story that--concerns me?\"\n\"Certainly it so far concerns you, Hetta, that you ought to know it. And I trust you will believe that it was my intention to tell it you.\"\n\"I will believe anything that you will tell me.\"\n\"If so, I don't think that you will quarrel with me when you know all. I was engaged to marry Mrs. Hurtle.\"\n\"Is she a widow?\"--He did not answer this at once. \"I suppose she must be a widow if you were going to marry her.\"\n\"Yes;--she is a widow. She was divorced.\"\n\"Oh, Paul! And she is an American?\"\n\"Yes.\"\n\"And you loved her?\"\nMontague was desirous of telling his own story, and did not wish to be interrogated. \"If you will allow me I will tell it you all from beginning to end.\"\n\"Oh, certainly. But I suppose you loved her. If you meant to marry her you must have loved her.\" There was a frown upon Hetta's brow and a tone of anger in her voice which made Paul uneasy.\n\"Yes;--I loved her once; but I will tell you all.\" Then he did tell his story, with a repetition of which the reader need not be detained. Hetta listened with fair attention,--not interrupting very often, though when she did interrupt, the little words which she spoke were bitter enough. But she heard the story of the long journey across the American continent, of the ocean journey before the end of which Paul had promised to make this woman his wife. \"Had she been divorced then?\" asked Hetta,--\"because I believe they get themselves divorced just when they like.\" Simple as the question was he could not answer it. \"I could only know what she told me,\" he said, as he went on with his story. Then Mrs. Hurtle had gone on to Paris, and he, as soon as he reached Carbury, had revealed everything to Roger. \"Did you give her up then?\" demanded Hetta with stern severity. No,--not then. He had gone back to San Francisco, and,--he had not intended to say that the engagement had been renewed, but he was forced to acknowledge that it had not been broken off. Then he had written to her on his second return to England,--and then she had appeared in London at Mrs. Pipkin's lodgings in Islington. \"I can hardly tell you how terrible that was to me,\" he said, \"for I had by that time become quite aware that my happiness must depend upon you.\" He tried the gentle, soft falsehoods that should have been as sweet as violets. Perhaps they were sweet. It is odd how stern a girl can be, while her heart is almost breaking with love. Hetta was very stern.\n\"But Felix says you took her to Lowestoft,--quite the other day.\"\nMontague had intended to tell all,--almost all. There was a something about the journey to Lowestoft which it would be impossible to make Hetta understand, and he thought that that might be omitted. \"It was on account of her health.\"\n\"Oh;--on account of her health. And did you go to the play with her?\"\n\"I did.\"\n\"Was that for her--health?\"\n\"Oh, Hetta, do not speak to me like that! Cannot you understand that when she came here, following me, I could not desert her?\"\n\"I cannot understand why you deserted her at all,\" said Hetta. \"You say you loved her, and you promised to marry her. It seems horrid to me to marry a divorced woman,--a woman who just says that she was divorced. But that is because I don't understand American ways. And I am sure you must have loved her when you took her to the theatre, and down to Lowestoft,--for her health. That was only a week ago.\"\n\"It was nearly three weeks,\" said Paul in despair.\n\"Oh;--nearly three weeks! That is not such a very long time for a gentleman to change his mind on such a matter. You were engaged to her, not three weeks ago.\"\n\"No, Hetta, I was not engaged to her then.\"\n\"I suppose she thought you were when she went to Lowestoft with you.\"\n\"She wanted then to force me to--to--to--. Oh, Hetta, it is so hard to explain, but I am sure that you understand. I do know that you do not, cannot think that I have, even for one moment, been false to you.\"\n\"But why should you be false to her? Why should I step in and crush all her hopes? I can understand that Roger should think badly of her because she was--divorced. Of course he would. But an engagement is an engagement. You had better go back to Mrs. Hurtle and tell her that you are quite ready to keep your promise.\"\n[Illustration: \"You had better go back to Mrs. Hurtle.\"]\n\"She knows now that it is all over.\"\n\"I dare say you will be able to persuade her to reconsider it. When she came all the way here from San Francisco after you, and when she asked you to take her to the theatre, and to Lowestoft--because of her health, she must be very much attached to you. And she is waiting here,--no doubt on purpose for you. She is a very old friend,--very old,--and you ought not to treat her unkindly. Good bye, Mr. Montague. I think you had better lose no time in going--back to Mrs. Hurtle.\" All this she said with sundry little impedimentary gurgles in her throat, but without a tear and without any sign of tenderness.\n\"You don't mean to tell me, Hetta, that you are going to quarrel with me!\"\n\"I don't know about quarrelling. I don't wish to quarrel with any one. But of course we can't be friends when you have married--Mrs. Hurtle.\"\n\"Nothing on earth would induce me to marry her.\"\n\"Of course I cannot say anything about that. When they told me this story I did not believe them. No; I hardly believed Roger when,--he would not tell it for he was too kind,--but when he would not contradict it. It seemed to be almost impossible that you should have come to me just at the very same moment. For, after all, Mr. Montague, nearly three weeks is a very short time. That trip to Lowestoft couldn't have been much above a week before you came to me.\"\n\"What does it matter?\"\n\"Oh no; of course not;--nothing to you. I think I will go away now, Mr. Montague. It was very good of you to come and tell me all. It makes it so much easier.\"\n\"Do you mean to say that--you are going to--throw me over?\"\n\"I don't want you to throw Mrs. Hurtle over. Good bye.\"\n\"Hetta!\"\n\"No; I will not have you lay your hand upon me. Good night, Mr. Montague.\" And so she left him.\nPaul Montague was beside himself with dismay as he left the house. He had never allowed himself for a moment to believe that this affair of Mrs. Hurtle would really separate him from Hetta Carbury. If she could only really know it all, there could be no such result. He had been true to her from the first moment in which he had seen her, never swerving from his love. It was to be supposed that he had loved some woman before; but, as the world goes, that would not, could not, affect her. But her anger was founded on the presence of Mrs. Hurtle in London,--which he would have given half his possessions to have prevented. But when she did come, was he to have refused to see her? Would Hetta have wished him to be cold and cruel like that? No doubt he had behaved badly to Mrs. Hurtle;--but that trouble he had overcome. And now Hetta was quarrelling with him, though he certainly had never behaved badly to her.\nHe was almost angry with Hetta as he walked home. Everything that he could do he had done for her. For her sake he had quarrelled with Roger Carbury. For her sake,--in order that he might be effectually free from Mrs. Hurtle,--he had determined to endure the spring of the wild cat. For her sake,--so he told himself,--he had been content to abide by that odious railway company, in order that he might if possible preserve an income on which to support her. And now she told him that they must part,--and that only because he had not been cruelly indifferent to the unfortunate woman who had followed him from America. There was no logic in it, no reason,--and, as he thought, very little heart. \"I don't want you to throw Mrs. Hurtle over,\" she had said. Why should Mrs. Hurtle be anything to her? Surely she might have left Mrs. Hurtle to fight her own battles. But they were all against him. Roger Carbury, Lady Carbury, and Sir Felix; and the end of it would be that she would be forced into marriage with a man almost old enough to be her father! She could not ever really have loved him. That was the truth. She must be incapable of such love as was his own for her. True love always forgives. And here there was really so very little to forgive! Such were his thoughts as he went to bed that night. But he probably omitted to ask himself whether he would have forgiven her very readily had he found that she had been living \"nearly three weeks ago\" in close intercourse with another lover of whom he had hitherto never even heard the name. But then,--as all the world knows,--there is a wide difference between young men and young women!\nHetta, as soon as she had dismissed her lover, went up at once to her own room. Thither she was soon followed by her mother, whose anxious ear had heard the closing of the front door. \"Well; what has he said?\" asked Lady Carbury. Hetta was in tears,--or very nigh to tears,--struggling to repress them, and struggling almost successfully. \"You have found that what we told you about that woman was all true.\"\n\"Enough of it was true,\" said Hetta, who, angry as she was with her lover, was not on that account less angry with her mother for disturbing her bliss.\n\"What do you mean by that, Hetta? Had you not better speak to me openly?\"\n\"I say, mamma, that enough was true. I do not know how to speak more openly. I need not go into all the miserable story of the woman. He is like other men, I suppose. He has entangled himself with some abominable creature and then when he is tired of her thinks that he has nothing to do but to say so,--and to begin with somebody else.\"\n\"Roger Carbury is very different.\"\n\"Oh, mamma, you will make me ill if you go on like that. It seems to me that you do not understand in the least.\"\n\"I say he is not like that.\"\n\"Not in the least. Of course I know that he is not in the least like that.\"\n\"I say that he can be trusted.\"\n\"Of course he can be trusted. Who doubts it?\"\n\"And that if you would give yourself to him, there would be no cause for any alarm.\"\n\"Mamma,\" said Hetta jumping up, \"how can you talk to me in that way? As soon as one man doesn't suit, I am to give myself to another! Oh, mamma, how can you propose it? Nothing on earth will ever induce me to be more to Roger Carbury than I am now.\"\n\"You have told Mr. Montague that he is not to come here again?\"\n\"I don't know what I told him, but he knows very well what I mean.\"\n\"That it is all over?\" Hetta made no reply. \"Hetta, I have a right to ask that, and I have a right to expect a reply. I do not say that you have hitherto behaved badly about Mr. Montague.\"\n\"I have not behaved badly. I have told you everything. I have done nothing that I am ashamed of.\"\n\"But we have now found out that he has behaved very badly. He has come here to you,--with unexampled treachery to your cousin Roger--\"\n\"I deny that,\" exclaimed Hetta.\n\"And at the very time was almost living with this woman who says that she is divorced from her husband in America! Have you told him that you will see him no more?\"\n\"He understood that.\"\n\"If you have not told him so plainly, I must tell him.\"\n\"Mamma, you need not trouble yourself. I have told him very plainly.\" Then Lady Carbury expressed herself satisfied for the moment, and left her daughter to her solitude.",
        "paragraph_chars": [
            [
                0,
                913
            ],
            [
                913,
                1960
            ],
            [
                1960,
                1976
            ],
            [
                1976,
                2402
            ],
            [
                2402,
                3922
            ],
            [
                3922,
                3955
            ],
            [
                3955,
                3969
            ],
            [
                3969,
                4408
            ],
            [
                4408,
                4422
            ],
            [
                4422,
                5221
            ],
            [
                5221,
                5371
            ],
            [
                5371,
                5397
            ],
            [
                5397,
                5416
            ],
            [
                5416,
                5565
            ],
            [
                5565,
                7586
            ],
            [
                7586,
                8641
            ],
            [
                8641,
                8982
            ],
            [
                8982,
                9064
            ],
            [
                9064,
                9128
            ],
            [
                9128,
                9301
            ],
            [
                9301,
                9357
            ],
            [
                9357,
                9497
            ],
            [
                9497,
                9546
            ],
            [
                9546,
                9654
            ],
            [
                9654,
                9769
            ],
            [
                9769,
                9811
            ],
            [
                9811,
                9847
            ],
            [
                9847,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                10029
            ],
            [
                10029,
                10219
            ],
            [
                10219,
                11771
            ],
            [
                11771,
                11837
            ],
            [
                11837,
                12071
            ],
            [
                12071,
                12141
            ],
            [
                12141,
                12150
            ],
            [
                12150,
                12178
            ],
            [
                12178,
                12306
            ],
            [
                12306,
                12712
            ],
            [
                12712,
                12763
            ],
            [
                12763,
                12923
            ],
            [
                12923,
                12967
            ],
            [
                12967,
                13037
            ],
            [
                13037,
                13246
            ],
            [
                13246,
                13565
            ],
            [
                13565,
                13622
            ],
            [
                13622,
                13659
            ],
            [
                13659,
                14269
            ],
            [
                14269,
                14344
            ],
            [
                14344,
                14486
            ],
            [
                14486,
                14535
            ],
            [
                14535,
                14999
            ],
            [
                14999,
                15022
            ],
            [
                15022,
                15182
            ],
            [
                15182,
                15242
            ],
            [
                15242,
                15298
            ],
            [
                15298,
                15307
            ],
            [
                15307,
                15403
            ],
            [
                15403,
                16320
            ],
            [
                16320,
                17966
            ],
            [
                17966,
                18375
            ],
            [
                18375,
                18527
            ],
            [
                18527,
                18601
            ],
            [
                18601,
                18939
            ],
            [
                18939,
                18974
            ],
            [
                18974,
                19088
            ],
            [
                19088,
                19117
            ],
            [
                19117,
                19193
            ],
            [
                19193,
                19225
            ],
            [
                19225,
                19271
            ],
            [
                19271,
                19356
            ],
            [
                19356,
                19606
            ],
            [
                19606,
                19670
            ],
            [
                19670,
                19738
            ],
            [
                19738,
                19927
            ],
            [
                19927,
                20025
            ],
            [
                20025,
                20160
            ],
            [
                20160,
                20192
            ],
            [
                20192,
                20357
            ],
            [
                20357,
                20379
            ],
            [
                20379,
                20435
            ],
            [
                20435,
                20605
            ]
        ],
        "segment_chars": [
            [
                0,
                202
            ],
            [
                202,
                301
            ],
            [
                301,
                498
            ],
            [
                498,
                588
            ],
            [
                588,
                861
            ],
            [
                861,
                895
            ],
            [
                895,
                913
            ],
            [
                913,
                975
            ],
            [
                975,
                1040
            ],
            [
                1040,
                1067
            ],
            [
                1067,
                1159
            ],
            [
                1159,
                1336
            ],
            [
                1336,
                1403
            ],
            [
                1403,
                1502
            ],
            [
                1502,
                1572
            ],
            [
                1572,
                1694
            ],
            [
                1694,
                1827
            ],
            [
                1827,
                1960
            ],
            [
                1960,
                1976
            ],
            [
                1976,
                2016
            ],
            [
                2016,
                2128
            ],
            [
                2128,
                2203
            ],
            [
                2203,
                2251
            ],
            [
                2251,
                2321
            ],
            [
                2321,
                2402
            ],
            [
                2402,
                2449
            ],
            [
                2449,
                2633
            ],
            [
                2633,
                2693
            ],
            [
                2693,
                2828
            ],
            [
                2828,
                2983
            ],
            [
                2983,
                3183
            ],
            [
                3183,
                3408
            ],
            [
                3408,
                3554
            ],
            [
                3554,
                3886
            ],
            [
                3886,
                3922
            ],
            [
                3922,
                3955
            ],
            [
                3955,
                3969
            ],
            [
                3969,
                4142
            ],
            [
                4142,
                4295
            ],
            [
                4295,
                4408
            ],
            [
                4408,
                4422
            ],
            [
                4422,
                4493
            ],
            [
                4493,
                4598
            ],
            [
                4598,
                4621
            ],
            [
                4621,
                4650
            ],
            [
                4650,
                4737
            ],
            [
                4737,
                4832
            ],
            [
                4832,
                4889
            ],
            [
                4889,
                4945
            ],
            [
                4945,
                4970
            ],
            [
                4970,
                4988
            ],
            [
                4988,
                5059
            ],
            [
                5059,
                5123
            ],
            [
                5123,
                5184
            ],
            [
                5184,
                5221
            ],
            [
                5221,
                5325
            ],
            [
                5325,
                5371
            ],
            [
                5371,
                5397
            ],
            [
                5397,
                5416
            ],
            [
                5416,
                5565
            ],
            [
                5565,
                5676
            ],
            [
                5676,
                5780
            ],
            [
                5780,
                5823
            ],
            [
                5823,
                5942
            ],
            [
                5942,
                6127
            ],
            [
                6127,
                6193
            ],
            [
                6193,
                6239
            ],
            [
                6239,
                6329
            ],
            [
                6329,
                6400
            ],
            [
                6400,
                6745
            ],
            [
                6745,
                6808
            ],
            [
                6808,
                6891
            ],
            [
                6891,
                7157
            ],
            [
                7157,
                7328
            ],
            [
                7328,
                7507
            ],
            [
                7507,
                7586
            ],
            [
                7586,
                7736
            ],
            [
                7736,
                7787
            ],
            [
                7787,
                7923
            ],
            [
                7923,
                7971
            ],
            [
                7971,
                8013
            ],
            [
                8013,
                8093
            ],
            [
                8093,
                8227
            ],
            [
                8227,
                8292
            ],
            [
                8292,
                8535
            ],
            [
                8535,
                8641
            ],
            [
                8641,
                8714
            ],
            [
                8714,
                8743
            ],
            [
                8743,
                8805
            ],
            [
                8805,
                8860
            ],
            [
                8860,
                8982
            ],
            [
                8982,
                9064
            ],
            [
                9064,
                9128
            ],
            [
                9128,
                9252
            ],
            [
                9252,
                9301
            ],
            [
                9301,
                9315
            ],
            [
                9315,
                9357
            ],
            [
                9357,
                9426
            ],
            [
                9426,
                9497
            ],
            [
                9497,
                9546
            ],
            [
                9546,
                9617
            ],
            [
                9617,
                9654
            ],
            [
                9654,
                9671
            ],
            [
                9671,
                9705
            ],
            [
                9705,
                9769
            ],
            [
                9769,
                9792
            ],
            [
                9792,
                9811
            ],
            [
                9811,
                9822
            ],
            [
                9822,
                9847
            ],
            [
                9847,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                9960
            ],
            [
                9960,
                10029
            ],
            [
                10029,
                10045
            ],
            [
                10045,
                10074
            ],
            [
                10074,
                10126
            ],
            [
                10126,
                10219
            ],
            [
                10219,
                10270
            ],
            [
                10270,
                10358
            ],
            [
                10358,
                10508
            ],
            [
                10508,
                10675
            ],
            [
                10675,
                10705
            ],
            [
                10705,
                10789
            ],
            [
                10789,
                10840
            ],
            [
                10840,
                10917
            ],
            [
                10917,
                11029
            ],
            [
                11029,
                11057
            ],
            [
                11057,
                11093
            ],
            [
                11093,
                11108
            ],
            [
                11108,
                11280
            ],
            [
                11280,
                11417
            ],
            [
                11417,
                11563
            ],
            [
                11563,
                11643
            ],
            [
                11643,
                11668
            ],
            [
                11668,
                11749
            ],
            [
                11749,
                11771
            ],
            [
                11771,
                11837
            ],
            [
                11837,
                11885
            ],
            [
                11885,
                12036
            ],
            [
                12036,
                12071
            ],
            [
                12071,
                12103
            ],
            [
                12103,
                12141
            ],
            [
                12141,
                12150
            ],
            [
                12150,
                12178
            ],
            [
                12178,
                12220
            ],
            [
                12220,
                12306
            ],
            [
                12306,
                12369
            ],
            [
                12369,
                12424
            ],
            [
                12424,
                12519
            ],
            [
                12519,
                12573
            ],
            [
                12573,
                12685
            ],
            [
                12685,
                12712
            ],
            [
                12712,
                12763
            ],
            [
                12763,
                12789
            ],
            [
                12789,
                12876
            ],
            [
                12876,
                12923
            ],
            [
                12923,
                12967
            ],
            [
                12967,
                13037
            ],
            [
                13037,
                13080
            ],
            [
                13080,
                13152
            ],
            [
                13152,
                13246
            ],
            [
                13246,
                13283
            ],
            [
                13283,
                13329
            ],
            [
                13329,
                13410
            ],
            [
                13410,
                13430
            ],
            [
                13430,
                13466
            ],
            [
                13466,
                13565
            ],
            [
                13565,
                13622
            ],
            [
                13622,
                13659
            ],
            [
                13659,
                13722
            ],
            [
                13722,
                13914
            ],
            [
                13914,
                13969
            ],
            [
                13969,
                14048
            ],
            [
                14048,
                14072
            ],
            [
                14072,
                14140
            ],
            [
                14140,
                14269
            ],
            [
                14269,
                14344
            ],
            [
                14344,
                14377
            ],
            [
                14377,
                14415
            ],
            [
                14415,
                14477
            ],
            [
                14477,
                14486
            ],
            [
                14486,
                14535
            ],
            [
                14535,
                14580
            ],
            [
                14580,
                14633
            ],
            [
                14633,
                14748
            ],
            [
                14748,
                14844
            ],
            [
                14844,
                14915
            ],
            [
                14915,
                14999
            ],
            [
                14999,
                15022
            ],
            [
                15022,
                15062
            ],
            [
                15062,
                15104
            ],
            [
                15104,
                15153
            ],
            [
                15153,
                15182
            ],
            [
                15182,
                15242
            ],
            [
                15242,
                15287
            ],
            [
                15287,
                15298
            ],
            [
                15298,
                15307
            ],
            [
                15307,
                15355
            ],
            [
                15355,
                15382
            ],
            [
                15382,
                15403
            ],
            [
                15403,
                15470
            ],
            [
                15470,
                15601
            ],
            [
                15601,
                15670
            ],
            [
                15670,
                15772
            ],
            [
                15772,
                15894
            ],
            [
                15894,
                16029
            ],
            [
                16029,
                16087
            ],
            [
                16087,
                16147
            ],
            [
                16147,
                16228
            ],
            [
                16228,
                16320
            ],
            [
                16320,
                16370
            ],
            [
                16370,
                16419
            ],
            [
                16419,
                16470
            ],
            [
                16470,
                16603
            ],
            [
                16603,
                16779
            ],
            [
                16779,
                16940
            ],
            [
                16940,
                17017
            ],
            [
                17017,
                17077
            ],
            [
                17077,
                17120
            ],
            [
                17120,
                17185
            ],
            [
                17185,
                17216
            ],
            [
                17216,
                17373
            ],
            [
                17373,
                17415
            ],
            [
                17415,
                17435
            ],
            [
                17435,
                17494
            ],
            [
                17494,
                17521
            ],
            [
                17521,
                17574
            ],
            [
                17574,
                17627
            ],
            [
                17627,
                17868
            ],
            [
                17868,
                17966
            ],
            [
                17966,
                18046
            ],
            [
                18046,
                18150
            ],
            [
                18150,
                18176
            ],
            [
                18176,
                18196
            ],
            [
                18196,
                18305
            ],
            [
                18305,
                18375
            ],
            [
                18375,
                18527
            ],
            [
                18527,
                18561
            ],
            [
                18561,
                18601
            ],
            [
                18601,
                18638
            ],
            [
                18638,
                18678
            ],
            [
                18678,
                18735
            ],
            [
                18735,
                18768
            ],
            [
                18768,
                18939
            ],
            [
                18939,
                18974
            ],
            [
                18974,
                19031
            ],
            [
                19031,
                19088
            ],
            [
                19088,
                19117
            ],
            [
                19117,
                19136
            ],
            [
                19136,
                19193
            ],
            [
                19193,
                19225
            ],
            [
                19225,
                19255
            ],
            [
                19255,
                19271
            ],
            [
                19271,
                19356
            ],
            [
                19356,
                19425
            ],
            [
                19425,
                19490
            ],
            [
                19490,
                19525
            ],
            [
                19525,
                19606
            ],
            [
                19606,
                19670
            ],
            [
                19670,
                19738
            ],
            [
                19738,
                19761
            ],
            [
                19761,
                19782
            ],
            [
                19782,
                19856
            ],
            [
                19856,
                19927
            ],
            [
                19927,
                19954
            ],
            [
                19954,
                19982
            ],
            [
                19982,
                20025
            ],
            [
                20025,
                20084
            ],
            [
                20084,
                20160
            ],
            [
                20160,
                20192
            ],
            [
                20192,
                20307
            ],
            [
                20307,
                20357
            ],
            [
                20357,
                20379
            ],
            [
                20379,
                20435
            ],
            [
                20435,
                20474
            ],
            [
                20474,
                20505
            ],
            [
                20505,
                20605
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                56,
                72
            ],
            [
                87,
                99
            ],
            [
                100,
                202
            ],
            [
                305,
                314
            ],
            [
                327,
                346
            ],
            [
                368,
                370
            ],
            [
                376,
                405
            ],
            [
                406,
                436
            ],
            [
                496,
                498
            ],
            [
                498,
                570
            ],
            [
                583,
                588
            ],
            [
                588,
                603
            ],
            [
                631,
                636
            ],
            [
                645,
                669
            ],
            [
                812,
                816
            ],
            [
                740,
                749
            ],
            [
                765,
                767
            ],
            [
                688,
                734
            ],
            [
                784,
                811
            ],
            [
                831,
                860
            ],
            [
                861,
                895
            ],
            [
                895,
                913
            ],
            [
                975,
                1039
            ],
            [
                1040,
                1067
            ],
            [
                1078,
                1130
            ],
            [
                1139,
                1159
            ],
            [
                1159,
                1267
            ],
            [
                1293,
                1306
            ],
            [
                1316,
                1325
            ],
            [
                1334,
                1336
            ],
            [
                1336,
                1402
            ],
            [
                1403,
                1404
            ],
            [
                1404,
                1501
            ],
            [
                1502,
                1511
            ],
            [
                1529,
                1560
            ],
            [
                1570,
                1572
            ],
            [
                1621,
                1643
            ],
            [
                1649,
                1694
            ],
            [
                1711,
                1713
            ],
            [
                1718,
                1725
            ],
            [
                1700,
                1710
            ],
            [
                1694,
                1696
            ],
            [
                1750,
                1766
            ],
            [
                1767,
                1771
            ],
            [
                1808,
                1826
            ],
            [
                1827,
                1960
            ],
            [
                1960,
                1976
            ],
            [
                1976,
                2016
            ],
            [
                2016,
                2072
            ],
            [
                2080,
                2104
            ],
            [
                2106,
                2128
            ],
            [
                2128,
                2142
            ],
            [
                2161,
                2201
            ],
            [
                2406,
                2449
            ],
            [
                2449,
                2503
            ],
            [
                2574,
                2633
            ],
            [
                2633,
                2641
            ],
            [
                2648,
                2693
            ],
            [
                2693,
                2748
            ],
            [
                2764,
                2828
            ],
            [
                2828,
                2861
            ],
            [
                2878,
                2881
            ],
            [
                2887,
                2929
            ],
            [
                2981,
                2982
            ],
            [
                2983,
                3062
            ],
            [
                3065,
                3080
            ],
            [
                3151,
                3183
            ],
            [
                3183,
                3275
            ],
            [
                3408,
                3411
            ],
            [
                3446,
                3449
            ],
            [
                3280,
                3283
            ],
            [
                3450,
                3459
            ],
            [
                3552,
                3554
            ],
            [
                3554,
                3580
            ],
            [
                3581,
                3588
            ],
            [
                3886,
                3919
            ],
            [
                3955,
                3967
            ],
            [
                4295,
                4361
            ],
            [
                4408,
                4422
            ],
            [
                4422,
                4447
            ],
            [
                4454,
                4493
            ],
            [
                4493,
                4598
            ],
            [
                4598,
                4621
            ],
            [
                4621,
                4637
            ],
            [
                4648,
                4650
            ],
            [
                4650,
                4653
            ],
            [
                4663,
                4711
            ],
            [
                4717,
                4737
            ],
            [
                4760,
                4776
            ],
            [
                4744,
                4759
            ],
            [
                4776,
                4777
            ],
            [
                4832,
                4889
            ],
            [
                4889,
                4917
            ],
            [
                4920,
                4945
            ],
            [
                4970,
                4988
            ],
            [
                5059,
                5123
            ],
            [
                5123,
                5184
            ],
            [
                5184,
                5221
            ],
            [
                5371,
                5397
            ],
            [
                5397,
                5416
            ],
            [
                5565,
                5578
            ],
            [
                5582,
                5676
            ],
            [
                5676,
                5704
            ],
            [
                5734,
                5780
            ],
            [
                5780,
                5805
            ],
            [
                5807,
                5823
            ],
            [
                5823,
                5942
            ],
            [
                6239,
                6243
            ],
            [
                6249,
                6329
            ],
            [
                6808,
                6811
            ],
            [
                6815,
                6891
            ],
            [
                6891,
                6894
            ],
            [
                6938,
                6939
            ],
            [
                6948,
                6952
            ],
            [
                6927,
                6937
            ],
            [
                6971,
                6973
            ],
            [
                6978,
                6985
            ],
            [
                6990,
                6995
            ],
            [
                7132,
                7133
            ],
            [
                7507,
                7571
            ],
            [
                7575,
                7586
            ],
            [
                7586,
                7736
            ],
            [
                7834,
                7922
            ],
            [
                7929,
                7931
            ],
            [
                7932,
                7971
            ],
            [
                7971,
                8013
            ],
            [
                8013,
                8049
            ],
            [
                8066,
                8093
            ],
            [
                8227,
                8278
            ],
            [
                8290,
                8292
            ],
            [
                8292,
                8297
            ],
            [
                8298,
                8301
            ],
            [
                8338,
                8416
            ],
            [
                8418,
                8508
            ],
            [
                8526,
                8535
            ],
            [
                8535,
                8540
            ],
            [
                8584,
                8641
            ],
            [
                8641,
                8674
            ],
            [
                8681,
                8714
            ],
            [
                8772,
                8800
            ],
            [
                8803,
                8804
            ],
            [
                8805,
                8850
            ],
            [
                8852,
                8860
            ],
            [
                8860,
                8898
            ],
            [
                8980,
                8982
            ],
            [
                8982,
                9064
            ],
            [
                9064,
                9068
            ],
            [
                9074,
                9128
            ],
            [
                9128,
                9142
            ],
            [
                9198,
                9215
            ],
            [
                9250,
                9252
            ],
            [
                9252,
                9301
            ],
            [
                9301,
                9315
            ],
            [
                9315,
                9318
            ],
            [
                9323,
                9341
            ],
            [
                9352,
                9357
            ],
            [
                9357,
                9367
            ],
            [
                9404,
                9424
            ],
            [
                9390,
                9397
            ],
            [
                9424,
                9426
            ],
            [
                9426,
                9497
            ],
            [
                9497,
                9546
            ],
            [
                9617,
                9654
            ],
            [
                9654,
                9669
            ],
            [
                9706,
                9769
            ],
            [
                9769,
                9774
            ],
            [
                9776,
                9792
            ],
            [
                9792,
                9811
            ],
            [
                9811,
                9822
            ],
            [
                9822,
                9847
            ],
            [
                9847,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                9883
            ],
            [
                9927,
                9960
            ],
            [
                9960,
                10029
            ],
            [
                10029,
                10045
            ],
            [
                10074,
                10126
            ],
            [
                10126,
                10219
            ],
            [
                10219,
                10224
            ],
            [
                10226,
                10270
            ],
            [
                10270,
                10296
            ],
            [
                10356,
                10358
            ],
            [
                10358,
                10372
            ],
            [
                10392,
                10393
            ],
            [
                10395,
                10454
            ],
            [
                10466,
                10471
            ],
            [
                10488,
                10508
            ],
            [
                10508,
                10595
            ],
            [
                10628,
                10674
            ],
            [
                10675,
                10705
            ],
            [
                10705,
                10716
            ],
            [
                10789,
                10840
            ],
            [
                10840,
                10842
            ],
            [
                10849,
                10853
            ],
            [
                10859,
                10917
            ],
            [
                10917,
                11028
            ],
            [
                11029,
                11057
            ],
            [
                11057,
                11093
            ],
            [
                11093,
                11096
            ],
            [
                11098,
                11108
            ],
            [
                11108,
                11146
            ],
            [
                11218,
                11251
            ],
            [
                11181,
                11195
            ],
            [
                11255,
                11280
            ],
            [
                11285,
                11339
            ],
            [
                11341,
                11416
            ],
            [
                11417,
                11461
            ],
            [
                11467,
                11562
            ],
            [
                11668,
                11749
            ],
            [
                11749,
                11770
            ],
            [
                11771,
                11772
            ],
            [
                11779,
                11812
            ],
            [
                11815,
                11837
            ],
            [
                11837,
                11866
            ],
            [
                11873,
                11885
            ],
            [
                11885,
                11894
            ],
            [
                11897,
                11991
            ],
            [
                12034,
                12036
            ],
            [
                12036,
                12071
            ],
            [
                12071,
                12075
            ],
            [
                12077,
                12103
            ],
            [
                12103,
                12141
            ],
            [
                12141,
                12150
            ],
            [
                12150,
                12167
            ],
            [
                12169,
                12178
            ],
            [
                12178,
                12220
            ],
            [
                12220,
                12306
            ],
            [
                12306,
                12369
            ],
            [
                12369,
                12424
            ],
            [
                12577,
                12667
            ],
            [
                12669,
                12685
            ],
            [
                12685,
                12712
            ],
            [
                12712,
                12763
            ],
            [
                12763,
                12767
            ],
            [
                12776,
                12789
            ],
            [
                12876,
                12923
            ],
            [
                12923,
                12967
            ],
            [
                12967,
                13037
            ],
            [
                13037,
                13068
            ],
            [
                13070,
                13072
            ],
            [
                13080,
                13130
            ],
            [
                13136,
                13152
            ],
            [
                13167,
                13170
            ],
            [
                13179,
                13246
            ],
            [
                13246,
                13283
            ],
            [
                13283,
                13329
            ],
            [
                13329,
                13398
            ],
            [
                13408,
                13410
            ],
            [
                13410,
                13430
            ],
            [
                13430,
                13466
            ],
            [
                13466,
                13565
            ],
            [
                13622,
                13659
            ],
            [
                13659,
                13717
            ],
            [
                13720,
                13722
            ],
            [
                13806,
                13808
            ],
            [
                13736,
                13782
            ],
            [
                13875,
                13914
            ],
            [
                13969,
                13994
            ],
            [
                14007,
                14048
            ],
            [
                14048,
                14072
            ],
            [
                14072,
                14116
            ],
            [
                14118,
                14140
            ],
            [
                14140,
                14162
            ],
            [
                14170,
                14176
            ],
            [
                14199,
                14232
            ],
            [
                14245,
                14269
            ],
            [
                14269,
                14344
            ],
            [
                14377,
                14415
            ],
            [
                14415,
                14470
            ],
            [
                14472,
                14476
            ],
            [
                14486,
                14535
            ],
            [
                14535,
                14536
            ],
            [
                14546,
                14580
            ],
            [
                14580,
                14633
            ],
            [
                14748,
                14763
            ],
            [
                14771,
                14813
            ],
            [
                14957,
                14961
            ],
            [
                14968,
                14974
            ],
            [
                14849,
                14854
            ],
            [
                14915,
                14937
            ],
            [
                14996,
                14999
            ],
            [
                14999,
                15022
            ],
            [
                15022,
                15025
            ],
            [
                15046,
                15062
            ],
            [
                15062,
                15104
            ],
            [
                15104,
                15153
            ],
            [
                15153,
                15182
            ],
            [
                15182,
                15206
            ],
            [
                15208,
                15224
            ],
            [
                15226,
                15242
            ],
            [
                15242,
                15287
            ],
            [
                15287,
                15298
            ],
            [
                15298,
                15307
            ],
            [
                15307,
                15311
            ],
            [
                15319,
                15322
            ],
            [
                15332,
                15355
            ],
            [
                15355,
                15382
            ],
            [
                15382,
                15403
            ],
            [
                15403,
                15447
            ],
            [
                15468,
                15470
            ],
            [
                15470,
                15601
            ],
            [
                15670,
                15740
            ],
            [
                15770,
                15772
            ],
            [
                15799,
                15829
            ],
            [
                15853,
                15869
            ],
            [
                15882,
                15894
            ],
            [
                15898,
                15960
            ],
            [
                16027,
                16029
            ],
            [
                16033,
                16041
            ],
            [
                16046,
                16051
            ],
            [
                16056,
                16058
            ],
            [
                16062,
                16087
            ],
            [
                16087,
                16120
            ],
            [
                16121,
                16135
            ],
            [
                16145,
                16147
            ],
            [
                16147,
                16192
            ],
            [
                16194,
                16197
            ],
            [
                16211,
                16226
            ],
            [
                16198,
                16210
            ],
            [
                16226,
                16228
            ],
            [
                16228,
                16320
            ],
            [
                16320,
                16370
            ],
            [
                16370,
                16419
            ],
            [
                16419,
                16470
            ],
            [
                16470,
                16482
            ],
            [
                16547,
                16603
            ],
            [
                16603,
                16615
            ],
            [
                16618,
                16636
            ],
            [
                16639,
                16645
            ],
            [
                16671,
                16722
            ],
            [
                16744,
                16779
            ],
            [
                16779,
                16820
            ],
            [
                16836,
                16882
            ],
            [
                16938,
                16940
            ],
            [
                16940,
                16965
            ],
            [
                16978,
                17016
            ],
            [
                17017,
                17077
            ],
            [
                17077,
                17120
            ],
            [
                17185,
                17216
            ],
            [
                17216,
                17258
            ],
            [
                17373,
                17415
            ],
            [
                17415,
                17435
            ],
            [
                17435,
                17494
            ],
            [
                17494,
                17521
            ],
            [
                17521,
                17524
            ],
            [
                17530,
                17539
            ],
            [
                17547,
                17573
            ],
            [
                17574,
                17627
            ],
            [
                17627,
                17776
            ],
            [
                17798,
                17831
            ],
            [
                17841,
                17857
            ],
            [
                17866,
                17868
            ],
            [
                17868,
                17877
            ],
            [
                17904,
                17966
            ],
            [
                17966,
                18001
            ],
            [
                18011,
                18046
            ],
            [
                18054,
                18061
            ],
            [
                18067,
                18149
            ],
            [
                18150,
                18176
            ],
            [
                18176,
                18196
            ],
            [
                18196,
                18205
            ],
            [
                18273,
                18283
            ],
            [
                18252,
                18262
            ],
            [
                18209,
                18214
            ],
            [
                18303,
                18305
            ],
            [
                18305,
                18375
            ],
            [
                18375,
                18410
            ],
            [
                18525,
                18526
            ],
            [
                18735,
                18768
            ],
            [
                18768,
                18903
            ],
            [
                18905,
                18939
            ],
            [
                18939,
                18974
            ],
            [
                18974,
                19031
            ],
            [
                19051,
                19088
            ],
            [
                19088,
                19114
            ],
            [
                19205,
                19225
            ],
            [
                19225,
                19255
            ],
            [
                19255,
                19271
            ],
            [
                19271,
                19272
            ],
            [
                19281,
                19356
            ],
            [
                19356,
                19375
            ],
            [
                19376,
                19425
            ],
            [
                19425,
                19490
            ],
            [
                19525,
                19564
            ],
            [
                19576,
                19581
            ],
            [
                19603,
                19606
            ],
            [
                19606,
                19670
            ],
            [
                19670,
                19738
            ],
            [
                19738,
                19761
            ],
            [
                19761,
                19782
            ],
            [
                19782,
                19789
            ],
            [
                19822,
                19856
            ],
            [
                20030,
                20084
            ],
            [
                20084,
                20108
            ],
            [
                20110,
                20156
            ],
            [
                20160,
                20192
            ],
            [
                20192,
                20277
            ],
            [
                20305,
                20307
            ],
            [
                20307,
                20357
            ],
            [
                20357,
                20379
            ],
            [
                20379,
                20435
            ],
            [
                20435,
                20474
            ],
            [
                20474,
                20504
            ],
            [
                20505,
                20605
            ]
        ],
        "row_chars": [
            [
                0,
                202
            ],
            [
                202,
                301
            ],
            [
                301,
                498
            ],
            [
                498,
                588
            ],
            [
                588,
                861
            ],
            [
                861,
                895
            ],
            [
                895,
                913
            ],
            [
                913,
                975
            ],
            [
                975,
                1040
            ],
            [
                1040,
                1067
            ],
            [
                1067,
                1159
            ],
            [
                1159,
                1336
            ],
            [
                1336,
                1403
            ],
            [
                1403,
                1502
            ],
            [
                1502,
                1572
            ],
            [
                1572,
                1694
            ],
            [
                1694,
                1827
            ],
            [
                1827,
                1960
            ],
            [
                1960,
                1976
            ],
            [
                1976,
                2016
            ],
            [
                2016,
                2128
            ],
            [
                2128,
                2203
            ],
            [
                2203,
                2251
            ],
            [
                2251,
                2321
            ],
            [
                2321,
                2402
            ],
            [
                2402,
                2449
            ],
            [
                2449,
                2633
            ],
            [
                2633,
                2693
            ],
            [
                2693,
                2828
            ],
            [
                2828,
                2983
            ],
            [
                2983,
                3183
            ],
            [
                3183,
                3554
            ],
            [
                3554,
                3886
            ],
            [
                3886,
                3922
            ],
            [
                3922,
                3955
            ],
            [
                3955,
                3969
            ],
            [
                3969,
                4142
            ],
            [
                4142,
                4295
            ],
            [
                4295,
                4408
            ],
            [
                4408,
                4422
            ],
            [
                4422,
                4493
            ],
            [
                4493,
                4598
            ],
            [
                4598,
                4621
            ],
            [
                4621,
                4650
            ],
            [
                4650,
                4737
            ],
            [
                4737,
                4889
            ],
            [
                4889,
                4945
            ],
            [
                4945,
                4970
            ],
            [
                4970,
                4988
            ],
            [
                4988,
                5059
            ],
            [
                5059,
                5123
            ],
            [
                5123,
                5184
            ],
            [
                5184,
                5221
            ],
            [
                5221,
                5325
            ],
            [
                5325,
                5371
            ],
            [
                5371,
                5397
            ],
            [
                5397,
                5416
            ],
            [
                5416,
                5565
            ],
            [
                5565,
                5676
            ],
            [
                5676,
                5780
            ],
            [
                5780,
                5823
            ],
            [
                5823,
                5942
            ],
            [
                5942,
                6127
            ],
            [
                6127,
                6193
            ],
            [
                6193,
                6239
            ],
            [
                6239,
                6329
            ],
            [
                6329,
                6400
            ],
            [
                6400,
                6745
            ],
            [
                6745,
                6808
            ],
            [
                6808,
                6891
            ],
            [
                6891,
                7157
            ],
            [
                7157,
                7328
            ],
            [
                7328,
                7507
            ],
            [
                7507,
                7586
            ],
            [
                7586,
                7736
            ],
            [
                7736,
                7787
            ],
            [
                7787,
                7923
            ],
            [
                7923,
                7971
            ],
            [
                7971,
                8013
            ],
            [
                8013,
                8093
            ],
            [
                8093,
                8227
            ],
            [
                8227,
                8292
            ],
            [
                8292,
                8535
            ],
            [
                8535,
                8641
            ],
            [
                8641,
                8714
            ],
            [
                8714,
                8743
            ],
            [
                8743,
                8805
            ],
            [
                8805,
                8860
            ],
            [
                8860,
                8982
            ],
            [
                8982,
                9064
            ],
            [
                9064,
                9128
            ],
            [
                9128,
                9252
            ],
            [
                9252,
                9301
            ],
            [
                9301,
                9315
            ],
            [
                9315,
                9357
            ],
            [
                9357,
                9426
            ],
            [
                9426,
                9497
            ],
            [
                9497,
                9546
            ],
            [
                9546,
                9617
            ],
            [
                9617,
                9654
            ],
            [
                9654,
                9671
            ],
            [
                9671,
                9705
            ],
            [
                9705,
                9769
            ],
            [
                9769,
                9792
            ],
            [
                9792,
                9811
            ],
            [
                9811,
                9822
            ],
            [
                9822,
                9847
            ],
            [
                9847,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                9960
            ],
            [
                9960,
                10029
            ],
            [
                10029,
                10045
            ],
            [
                10045,
                10074
            ],
            [
                10074,
                10126
            ],
            [
                10126,
                10219
            ],
            [
                10219,
                10270
            ],
            [
                10270,
                10358
            ],
            [
                10358,
                10508
            ],
            [
                10508,
                10675
            ],
            [
                10675,
                10705
            ],
            [
                10705,
                10789
            ],
            [
                10789,
                10840
            ],
            [
                10840,
                10917
            ],
            [
                10917,
                11029
            ],
            [
                11029,
                11057
            ],
            [
                11057,
                11093
            ],
            [
                11093,
                11108
            ],
            [
                11108,
                11280
            ],
            [
                11280,
                11417
            ],
            [
                11417,
                11563
            ],
            [
                11563,
                11643
            ],
            [
                11643,
                11668
            ],
            [
                11668,
                11749
            ],
            [
                11749,
                11771
            ],
            [
                11771,
                11837
            ],
            [
                11837,
                11885
            ],
            [
                11885,
                12036
            ],
            [
                12036,
                12071
            ],
            [
                12071,
                12103
            ],
            [
                12103,
                12141
            ],
            [
                12141,
                12150
            ],
            [
                12150,
                12178
            ],
            [
                12178,
                12220
            ],
            [
                12220,
                12306
            ],
            [
                12306,
                12369
            ],
            [
                12369,
                12424
            ],
            [
                12424,
                12519
            ],
            [
                12519,
                12573
            ],
            [
                12573,
                12685
            ],
            [
                12685,
                12712
            ],
            [
                12712,
                12763
            ],
            [
                12763,
                12789
            ],
            [
                12789,
                12876
            ],
            [
                12876,
                12923
            ],
            [
                12923,
                12967
            ],
            [
                12967,
                13037
            ],
            [
                13037,
                13152
            ],
            [
                13152,
                13246
            ],
            [
                13246,
                13283
            ],
            [
                13283,
                13329
            ],
            [
                13329,
                13410
            ],
            [
                13410,
                13430
            ],
            [
                13430,
                13466
            ],
            [
                13466,
                13565
            ],
            [
                13565,
                13622
            ],
            [
                13622,
                13659
            ],
            [
                13659,
                13722
            ],
            [
                13722,
                13914
            ],
            [
                13914,
                13969
            ],
            [
                13969,
                14048
            ],
            [
                14048,
                14072
            ],
            [
                14072,
                14140
            ],
            [
                14140,
                14269
            ],
            [
                14269,
                14344
            ],
            [
                14344,
                14377
            ],
            [
                14377,
                14415
            ],
            [
                14415,
                14477
            ],
            [
                14477,
                14486
            ],
            [
                14486,
                14535
            ],
            [
                14535,
                14580
            ],
            [
                14580,
                14633
            ],
            [
                14633,
                14748
            ],
            [
                14748,
                14999
            ],
            [
                14999,
                15022
            ],
            [
                15022,
                15062
            ],
            [
                15062,
                15104
            ],
            [
                15104,
                15153
            ],
            [
                15153,
                15182
            ],
            [
                15182,
                15242
            ],
            [
                15242,
                15287
            ],
            [
                15287,
                15298
            ],
            [
                15298,
                15307
            ],
            [
                15307,
                15355
            ],
            [
                15355,
                15382
            ],
            [
                15382,
                15403
            ],
            [
                15403,
                15470
            ],
            [
                15470,
                15601
            ],
            [
                15601,
                15670
            ],
            [
                15670,
                15772
            ],
            [
                15772,
                15894
            ],
            [
                15894,
                16029
            ],
            [
                16029,
                16087
            ],
            [
                16087,
                16147
            ],
            [
                16147,
                16228
            ],
            [
                16228,
                16320
            ],
            [
                16320,
                16370
            ],
            [
                16370,
                16419
            ],
            [
                16419,
                16470
            ],
            [
                16470,
                16603
            ],
            [
                16603,
                16779
            ],
            [
                16779,
                16940
            ],
            [
                16940,
                17017
            ],
            [
                17017,
                17077
            ],
            [
                17077,
                17120
            ],
            [
                17120,
                17185
            ],
            [
                17185,
                17216
            ],
            [
                17216,
                17373
            ],
            [
                17373,
                17415
            ],
            [
                17415,
                17435
            ],
            [
                17435,
                17494
            ],
            [
                17494,
                17521
            ],
            [
                17521,
                17574
            ],
            [
                17574,
                17627
            ],
            [
                17627,
                17868
            ],
            [
                17868,
                17966
            ],
            [
                17966,
                18046
            ],
            [
                18046,
                18150
            ],
            [
                18150,
                18176
            ],
            [
                18176,
                18196
            ],
            [
                18196,
                18305
            ],
            [
                18305,
                18375
            ],
            [
                18375,
                18527
            ],
            [
                18527,
                18561
            ],
            [
                18561,
                18601
            ],
            [
                18601,
                18638
            ],
            [
                18638,
                18678
            ],
            [
                18678,
                18735
            ],
            [
                18735,
                18768
            ],
            [
                18768,
                18939
            ],
            [
                18939,
                18974
            ],
            [
                18974,
                19031
            ],
            [
                19031,
                19088
            ],
            [
                19088,
                19117
            ],
            [
                19117,
                19136
            ],
            [
                19136,
                19193
            ],
            [
                19193,
                19225
            ],
            [
                19225,
                19255
            ],
            [
                19255,
                19271
            ],
            [
                19271,
                19356
            ],
            [
                19356,
                19425
            ],
            [
                19425,
                19490
            ],
            [
                19490,
                19525
            ],
            [
                19525,
                19606
            ],
            [
                19606,
                19670
            ],
            [
                19670,
                19738
            ],
            [
                19738,
                19761
            ],
            [
                19761,
                19782
            ],
            [
                19782,
                19856
            ],
            [
                19856,
                19927
            ],
            [
                19927,
                19954
            ],
            [
                19954,
                19982
            ],
            [
                19982,
                20025
            ],
            [
                20025,
                20084
            ],
            [
                20084,
                20160
            ],
            [
                20160,
                20192
            ],
            [
                20192,
                20307
            ],
            [
                20307,
                20357
            ],
            [
                20357,
                20379
            ],
            [
                20379,
                20435
            ],
            [
                20435,
                20474
            ],
            [
                20474,
                20505
            ],
            [
                20505,
                20605
            ]
        ]
    },
    "abridged": {
        "text": "Lady Carbury was at this time so miserable about her son that she was unable to be as active as she would otherwise have been in her endeavours to separate Paul Montague and her daughter. Roger had returned to Suffolk; so in need of assistance and consolation she turned naturally to Mr. Broune. It had now become almost a part of Mr. Broune's life to see Lady Carbury every day. She told him of Roger's proposals: first, that she should take Sir Felix abroad to live in some second-rate French or German town, and, secondly, that she should live at Carbury manor for six months.\n\"And where would Mr. Carbury go?\" asked Mr. Broune.\n\"There's a cottage on the place, he says, that he would move to.\"\nMr. Broune shook his head. He did not think that an offer so quixotically generous should be accepted. As to the German or French town, Mr. Broune said that the plan was no doubt feasible, but he doubted whether it was worth the sacrifice. He was inclined to think that Sir Felix should go to the colonies.\n\"So that he might drink himself to death,\" said Lady Carbury, who now had no secrets from Mr. Broune.\nSir Felix was still in the doctor's hands upstairs. There was not in truth much ailing him beyond the cuts on his face. At present, however, he preferred to be an invalid rather than to meet the world.\n\"As to Melmotte,\" said Mr. Broune, \"they say now that he is in some terrible mess which will ruin him and all who have trusted him.\"\n\"And the girl?\"\n\"It is impossible to understand it all. Melmotte was to have been summoned before the Lord Mayor today on some charge of fraud; but it was postponed. And I was told Nidderdale still means to marry the girl.\"\nIn all this there was nothing about Hetta. Hetta, however, thought very much of her own condition. She received two letters from her lover, written to her from Liverpool. They had not met since she had confessed her love to him. The first letter she did not at once answer, as she was waiting to hear what Roger Carbury would say about Mrs. Hurtle. Roger Carbury had spoken, leaving her convinced that Mrs. Hurtle was by no means a fiction.\nThen Paul's second love-letter had come, full of joy, and love, and contentment - with not a word that suggested the existence of a Mrs. Hurtle. Had there been no Mrs. Hurtle, the letter would have been all that Hetta could have desired; but now she did not know how to answer it. Roger had told her to \"ask Paul himself.\" So she wrote to Paul, as follows:\nMy dear Paul,\n(Had there been no Mrs. Hurtle he would have been her \"Dearest Paul.\")\nMy dear Paul,\nA strange report has come to me about a lady called Mrs. Hurtle. I have been told that she is an American lady living in London, and that she is engaged to be your wife. I cannot believe this. It is too horrid. But I fear there is something true that will be very sad for me to hear. I first heard it from my brother, and I have talked to mamma about it, and to my cousin Roger. I am sure Roger knows it all, but he will not tell me. And so I ask you. I am sure I need not tell you that it has made me very unhappy. If you cannot come and see me at once, you had better write. I have told mamma about this letter.\nYour affectionate friend,\nHenrietta Carbury.\nPaul received this letter at Liverpool on the Wednesday morning, and on the Wednesday evening he was in Welbeck Street. He had been quite aware that he needed to tell her the whole history of Mrs. Hurtle. He had meant to keep back - almost nothing. But it had been impossible for him to do so on that one occasion on which he had pleaded his love to her successfully. When he was called away to Liverpool he did consider whether he should write the story. But a man hardly wishes to supply his beloved one with a written record of his folly. And a writer cannot show tenderness by tone of voice. I think therefore that Paul Montague did quite right in hurrying to London.\nHe asked for Miss Carbury, and when told that Miss Henrietta was with her mother, he sent his name up and said that he would wait in the dining-room. He would not, if it could be helped, make his statement in the presence of Lady Carbury.\nUpstairs, there was a little discussion. Hetta pleaded her right to see him alone. She had done what Roger had advised, with her mother's consent. But she must herself hear what her lover had to say. Felix, who was there, suggested that he should go down and see Paul Montague on his sister's behalf; but his mother looked at him with scorn, and his sister quietly said that she would rather go herself. Felix did not say another word, and Hetta left the room alone.\nWhen she entered the parlour Paul stepped forward to take her in his arms. She had prepared herself for this.\n\"Paul,\" she said, \"let me hear about all this first.\" She sat down at some distance from him.\n\"And so you have heard of Mrs. Hurtle,\" he said, with a faint attempt at a smile.\n\"Yes. Felix told me, and Roger evidently had heard about her.\"\n\"Oh yes; Roger knows the whole history. I don't think your brother is as well informed.\"\n\"Perhaps not. But - isn't it a story that - concerns me?\"\n\"Certainly you ought to know it, Hetta. And I trust you will believe that it was my intention to tell it you.\"\n\"I will believe anything that you will tell me.\"\n\"Well, then, I was engaged to marry Mrs. Hurtle.\"\n\"Is she a widow? I suppose she must be a widow if you were going to marry her.\"\n\"Yes; she is a widow. She was divorced.\"\n\"Oh, Paul! And she is an American?\"\n\"Yes.\"\n\"And you loved her?\"\nMontague did not wish to be interrogated. \"If you will allow me I will tell it you all from beginning to end.\"\n\"Oh, certainly. But if you meant to marry her you must have loved her.\" There was a frown upon Hetta's brow and a tone of anger in her voice which made Paul uneasy.\n\"Yes; I loved her once; but I will tell you all.\" Then he did tell his story. Hetta listened, not interrupting very often, though when she did interrupt, her words were bitter enough. But she heard the story of the long journey across the American continent, of the ocean crossing when Paul had promised to make this woman his wife.\n\"Had she been divorced then?\" asked Hetta.\nSimple as the question was he could not answer it. \"I only knew what she told me,\" he said, as he went on with his story. Then Mrs. Hurtle had gone on to Paris, and he, as soon as he reached Carbury, had revealed everything to Roger.\n\"Did you give her up then?\" demanded Hetta with stern severity. No, not then. He had gone back to San Francisco, and - he was forced to acknowledge that the engagement had not been broken off. He had written to her on his second return to England, and then she had appeared in London at Mrs. Pipkin's lodgings in Islington.\n\"I can hardly tell you how terrible that was,\" he said, \"for I had by that time become quite aware that my happiness must depend upon you.\"\nIt is odd how stern a girl can be, while her heart is almost breaking with love. Hetta was very stern. \"Felix says you took her to Lowestoft - quite the other day.\"\nMontague had intended to tell almost all. There was something about the journey to Lowestoft which it would be impossible to make Hetta understand. \"It was on account of her health.\"\n\"Oh; on account of her health. And did you go to the play with her?\"\n\"I did.\"\n\"Was that for her health?\"\n\"Oh, Hetta, do not speak to me like that! Cannot you understand that when she came here, following me, I could not desert her?\"\n\"I cannot understand why you deserted her at all,\" said Hetta. \"You say you loved her, and you promised to marry her. I am sure you must have loved her when you took her to the theatre, and down to Lowestoft, for her health. That was only a week ago.\"\n\"It was nearly three weeks,\" said Paul in despair.\n\"Oh; nearly three weeks! You were engaged to her, not three weeks ago.\"\n\"No, Hetta, I was not engaged to her then.\"\n\"I suppose she thought you were when she went to Lowestoft with you.\"\n\"She wanted then to force me to - to - Oh, Hetta, it is so hard to explain, but I am sure you understand. You cannot think that I have, even for one moment, been false to you.\"\n\"But why should you be false to her? Why should I step in and crush all her hopes? I can understand that Roger should think badly of her because she was divorced. Of course he would. But an engagement is an engagement. You had better go back to Mrs. Hurtle and tell her that you are quite ready to keep your promise.\"\n\"She knows now that it is all over.\"\n\"I dare say you will be able to persuade her to reconsider. To have come all the way here from San Francisco after you, she must be very much attached to you. She is a very old friend, and you ought not to treat her unkindly. Good bye, Mr. Montague. I think you had better lose no time in going back to Mrs. Hurtle.\" All this she said with little chokes in her throat, but without a tear or any sign of tenderness.\n\"You don't mean to tell me, Hetta, that you are going to quarrel with me!\"\n\"I don't wish to quarrel with any one. But of course we can't be friends when you have married - Mrs. Hurtle.\"\n\"Nothing on earth would induce me to marry her.\"\n\"I cannot say anything about that. When they told me this story I did not believe them. It seemed to be impossible that you should have come to me not much more than a week after that trip to Lowestoft.\"\n\"What does it matter?\"\n\"Oh, nothing to you. I think I will go away now, Mr. Montague. It was very good of you to come and tell me all. It makes it so much easier.\"\n\"Do you mean to say that you are going to - throw me over?\"\n\"I don't want you to throw Mrs. Hurtle over. Good bye.\"\n\"Hetta!\"\n\"No; do not lay your hand upon me. Good night, Mr. Montague.\" And so she left him.\nPaul Montague was beside himself with dismay. He had never allowed himself for a moment to believe that this affair of Mrs. Hurtle would really separate him from Hetta Carbury. He had been true to her from the first moment in which he had seen her. Even if he had loved some woman before, that would not affect her. Her anger was founded on the presence of Mrs. Hurtle in London. Yet when she had come, could he have refused to see her? Would Hetta have wished him to be so cold and cruel? No doubt he had behaved badly to Mrs. Hurtle; but he had overcome that trouble. And now Hetta was quarrelling with him, though he certainly had never behaved badly to her.\nHe was almost angry with Hetta as he walked home. Everything that he could do he had done for her. For her sake he had quarrelled with Roger Carbury. For her sake he had determined to endure the spring of the wild cat. For her sake - so he told himself - he had stayed involved with that odious railway company, in order that he might have an income on which to support her. And now she told him that they must part, because he had not been cruelly indifferent to Mrs. Hurtle. There was no logic in it, and, as he thought, very little heart.\n\"I don't want you to throw Mrs. Hurtle over,\" she had said. Why should Mrs. Hurtle be anything to her? But they were all against him. Roger Carbury, Lady Carbury, and Sir Felix. She could not ever really have loved him. That was the truth. She must be incapable of such love as was his own for her. True love always forgives. And there was so very little to forgive!\nSuch were his thoughts as he went to bed that night. But he probably omitted to ask himself whether he would have forgiven her very readily had he found that she had been living \"nearly three weeks ago\" with another lover of whom he had never even heard. But then, there is a wide difference between young men and young women!\nHetta, as soon as she had dismissed him, went up at once to her own room. She was followed by her mother, whose anxious ear had heard the closing of the front door.\n\"Well; what has he said?\" asked Lady Carbury. Hetta was struggling to repress her tears. \"You have found that what we told you about that woman was all true.\"\n\"Enough of it was true,\" said Hetta. \"He is like other men, I suppose. He has entangled himself with some abominable creature and then when he is tired of her thinks that he has nothing to do but to say so, and to begin with somebody else.\"\n\"Roger Carbury is very different.\"\n\"Oh, mamma, you will make me ill if you go on like that. You do not understand in the least.\"\n\"I say he is not like that. He can be trusted.\"\n\"Of course he can be trusted. Who doubts it?\"\n\"If you would give yourself to him, there would be no cause for any alarm.\"\n\"Mamma,\" said Hetta, jumping up, \"how can you talk to me in that way? As soon as one man doesn't suit, I am to give myself to another! Nothing on earth will ever induce me to marry Roger.\"\n\"You have told Mr. Montague that he is not to come here again?\"\n\"I don't know what I told him, but he knows very well what I mean.\"\n\"That it is all over?\" Hetta made no reply. \"Hetta, I have a right to expect a reply. We have now found out that he has behaved very badly. He has come here to you, with unexampled treachery to your cousin Roger-\"\n\"I deny that,\" exclaimed Hetta.\n\"And at the very time was almost living with this woman who says that she is divorced! Have you told him that you will see him no more?\"\n\"He understood that.\"\n\"If you have not told him so plainly, I must tell him.\"\n\"Mamma, you need not trouble yourself. I have told him very plainly.\"\nThen Lady Carbury expressed herself satisfied for the moment, and left her daughter to her solitude.",
        "paragraph_chars": [
            [
                0,
                580
            ],
            [
                580,
                632
            ],
            [
                632,
                698
            ],
            [
                698,
                1005
            ],
            [
                1005,
                1107
            ],
            [
                1107,
                1309
            ],
            [
                1309,
                1442
            ],
            [
                1442,
                1458
            ],
            [
                1458,
                1666
            ],
            [
                1666,
                2107
            ],
            [
                2107,
                2464
            ],
            [
                2464,
                2478
            ],
            [
                2478,
                2549
            ],
            [
                2549,
                2563
            ],
            [
                2563,
                3177
            ],
            [
                3177,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3894
            ],
            [
                3894,
                4133
            ],
            [
                4133,
                4600
            ],
            [
                4600,
                4710
            ],
            [
                4710,
                4804
            ],
            [
                4804,
                4886
            ],
            [
                4886,
                4949
            ],
            [
                4949,
                5038
            ],
            [
                5038,
                5096
            ],
            [
                5096,
                5207
            ],
            [
                5207,
                5256
            ],
            [
                5256,
                5306
            ],
            [
                5306,
                5386
            ],
            [
                5386,
                5427
            ],
            [
                5427,
                5463
            ],
            [
                5463,
                5470
            ],
            [
                5470,
                5491
            ],
            [
                5491,
                5602
            ],
            [
                5602,
                5767
            ],
            [
                5767,
                6100
            ],
            [
                6100,
                6143
            ],
            [
                6143,
                6377
            ],
            [
                6377,
                6701
            ],
            [
                6701,
                6841
            ],
            [
                6841,
                7006
            ],
            [
                7006,
                7189
            ],
            [
                7189,
                7258
            ],
            [
                7258,
                7267
            ],
            [
                7267,
                7294
            ],
            [
                7294,
                7422
            ],
            [
                7422,
                7674
            ],
            [
                7674,
                7725
            ],
            [
                7725,
                7797
            ],
            [
                7797,
                7841
            ],
            [
                7841,
                7911
            ],
            [
                7911,
                8088
            ],
            [
                8088,
                8406
            ],
            [
                8406,
                8443
            ],
            [
                8443,
                8858
            ],
            [
                8858,
                8933
            ],
            [
                8933,
                9044
            ],
            [
                9044,
                9093
            ],
            [
                9093,
                9297
            ],
            [
                9297,
                9320
            ],
            [
                9320,
                9461
            ],
            [
                9461,
                9521
            ],
            [
                9521,
                9577
            ],
            [
                9577,
                9586
            ],
            [
                9586,
                9669
            ],
            [
                9669,
                10331
            ],
            [
                10331,
                10873
            ],
            [
                10873,
                11240
            ],
            [
                11240,
                11567
            ],
            [
                11567,
                11732
            ],
            [
                11732,
                11891
            ],
            [
                11891,
                12132
            ],
            [
                12132,
                12167
            ],
            [
                12167,
                12261
            ],
            [
                12261,
                12309
            ],
            [
                12309,
                12355
            ],
            [
                12355,
                12431
            ],
            [
                12431,
                12620
            ],
            [
                12620,
                12684
            ],
            [
                12684,
                12752
            ],
            [
                12752,
                12966
            ],
            [
                12966,
                12998
            ],
            [
                12998,
                13135
            ],
            [
                13135,
                13157
            ],
            [
                13157,
                13213
            ],
            [
                13213,
                13283
            ],
            [
                13283,
                13383
            ]
        ],
        "segment_chars": [
            [
                0,
                188
            ],
            [
                188,
                296
            ],
            [
                296,
                380
            ],
            [
                380,
                580
            ],
            [
                580,
                614
            ],
            [
                614,
                632
            ],
            [
                632,
                698
            ],
            [
                698,
                725
            ],
            [
                725,
                801
            ],
            [
                801,
                938
            ],
            [
                938,
                1005
            ],
            [
                1005,
                1107
            ],
            [
                1107,
                1159
            ],
            [
                1159,
                1227
            ],
            [
                1227,
                1309
            ],
            [
                1309,
                1442
            ],
            [
                1442,
                1458
            ],
            [
                1458,
                1498
            ],
            [
                1498,
                1608
            ],
            [
                1608,
                1666
            ],
            [
                1666,
                1709
            ],
            [
                1709,
                1765
            ],
            [
                1765,
                1837
            ],
            [
                1837,
                1895
            ],
            [
                1895,
                2015
            ],
            [
                2015,
                2107
            ],
            [
                2107,
                2252
            ],
            [
                2252,
                2388
            ],
            [
                2388,
                2430
            ],
            [
                2430,
                2464
            ],
            [
                2464,
                2478
            ],
            [
                2478,
                2549
            ],
            [
                2549,
                2563
            ],
            [
                2563,
                2628
            ],
            [
                2628,
                2733
            ],
            [
                2733,
                2756
            ],
            [
                2756,
                2774
            ],
            [
                2774,
                2847
            ],
            [
                2847,
                2942
            ],
            [
                2942,
                2997
            ],
            [
                2997,
                3015
            ],
            [
                3015,
                3079
            ],
            [
                3079,
                3140
            ],
            [
                3140,
                3177
            ],
            [
                3177,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3342
            ],
            [
                3342,
                3427
            ],
            [
                3427,
                3471
            ],
            [
                3471,
                3590
            ],
            [
                3590,
                3678
            ],
            [
                3678,
                3764
            ],
            [
                3764,
                3818
            ],
            [
                3818,
                3894
            ],
            [
                3894,
                4044
            ],
            [
                4044,
                4133
            ],
            [
                4133,
                4174
            ],
            [
                4174,
                4216
            ],
            [
                4216,
                4280
            ],
            [
                4280,
                4333
            ],
            [
                4333,
                4537
            ],
            [
                4537,
                4600
            ],
            [
                4600,
                4675
            ],
            [
                4675,
                4710
            ],
            [
                4710,
                4764
            ],
            [
                4764,
                4804
            ],
            [
                4804,
                4886
            ],
            [
                4886,
                4892
            ],
            [
                4892,
                4949
            ],
            [
                4949,
                4989
            ],
            [
                4989,
                5038
            ],
            [
                5038,
                5052
            ],
            [
                5052,
                5096
            ],
            [
                5096,
                5136
            ],
            [
                5136,
                5207
            ],
            [
                5207,
                5256
            ],
            [
                5256,
                5306
            ],
            [
                5306,
                5323
            ],
            [
                5323,
                5386
            ],
            [
                5386,
                5408
            ],
            [
                5408,
                5427
            ],
            [
                5427,
                5438
            ],
            [
                5438,
                5463
            ],
            [
                5463,
                5470
            ],
            [
                5470,
                5491
            ],
            [
                5491,
                5533
            ],
            [
                5533,
                5602
            ],
            [
                5602,
                5618
            ],
            [
                5618,
                5674
            ],
            [
                5674,
                5767
            ],
            [
                5767,
                5817
            ],
            [
                5817,
                5845
            ],
            [
                5845,
                5951
            ],
            [
                5951,
                6100
            ],
            [
                6100,
                6130
            ],
            [
                6130,
                6143
            ],
            [
                6143,
                6194
            ],
            [
                6194,
                6265
            ],
            [
                6265,
                6377
            ],
            [
                6377,
                6405
            ],
            [
                6405,
                6441
            ],
            [
                6441,
                6455
            ],
            [
                6455,
                6570
            ],
            [
                6570,
                6701
            ],
            [
                6701,
                6841
            ],
            [
                6841,
                6922
            ],
            [
                6922,
                6944
            ],
            [
                6944,
                7006
            ],
            [
                7006,
                7048
            ],
            [
                7048,
                7154
            ],
            [
                7154,
                7189
            ],
            [
                7189,
                7220
            ],
            [
                7220,
                7258
            ],
            [
                7258,
                7267
            ],
            [
                7267,
                7294
            ],
            [
                7294,
                7336
            ],
            [
                7336,
                7422
            ],
            [
                7422,
                7485
            ],
            [
                7485,
                7540
            ],
            [
                7540,
                7647
            ],
            [
                7647,
                7674
            ],
            [
                7674,
                7725
            ],
            [
                7725,
                7750
            ],
            [
                7750,
                7797
            ],
            [
                7797,
                7841
            ],
            [
                7841,
                7911
            ],
            [
                7911,
                8017
            ],
            [
                8017,
                8088
            ],
            [
                8088,
                8125
            ],
            [
                8125,
                8171
            ],
            [
                8171,
                8251
            ],
            [
                8251,
                8271
            ],
            [
                8271,
                8307
            ],
            [
                8307,
                8406
            ],
            [
                8406,
                8443
            ],
            [
                8443,
                8503
            ],
            [
                8503,
                8602
            ],
            [
                8602,
                8669
            ],
            [
                8669,
                8693
            ],
            [
                8693,
                8760
            ],
            [
                8760,
                8858
            ],
            [
                8858,
                8933
            ],
            [
                8933,
                8972
            ],
            [
                8972,
                9044
            ],
            [
                9044,
                9093
            ],
            [
                9093,
                9128
            ],
            [
                9128,
                9181
            ],
            [
                9181,
                9297
            ],
            [
                9297,
                9320
            ],
            [
                9320,
                9341
            ],
            [
                9341,
                9383
            ],
            [
                9383,
                9432
            ],
            [
                9432,
                9461
            ],
            [
                9461,
                9521
            ],
            [
                9521,
                9566
            ],
            [
                9566,
                9577
            ],
            [
                9577,
                9586
            ],
            [
                9586,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9669
            ],
            [
                9669,
                9715
            ],
            [
                9715,
                9846
            ],
            [
                9846,
                9918
            ],
            [
                9918,
                9985
            ],
            [
                9985,
                10049
            ],
            [
                10049,
                10106
            ],
            [
                10106,
                10159
            ],
            [
                10159,
                10239
            ],
            [
                10239,
                10331
            ],
            [
                10331,
                10381
            ],
            [
                10381,
                10430
            ],
            [
                10430,
                10481
            ],
            [
                10481,
                10550
            ],
            [
                10550,
                10706
            ],
            [
                10706,
                10808
            ],
            [
                10808,
                10873
            ],
            [
                10873,
                10933
            ],
            [
                10933,
                10976
            ],
            [
                10976,
                11007
            ],
            [
                11007,
                11051
            ],
            [
                11051,
                11093
            ],
            [
                11093,
                11113
            ],
            [
                11113,
                11172
            ],
            [
                11172,
                11199
            ],
            [
                11199,
                11240
            ],
            [
                11240,
                11293
            ],
            [
                11293,
                11495
            ],
            [
                11495,
                11567
            ],
            [
                11567,
                11641
            ],
            [
                11641,
                11732
            ],
            [
                11732,
                11758
            ],
            [
                11758,
                11778
            ],
            [
                11778,
                11821
            ],
            [
                11821,
                11891
            ],
            [
                11891,
                11928
            ],
            [
                11928,
                11962
            ],
            [
                11962,
                12132
            ],
            [
                12132,
                12167
            ],
            [
                12167,
                12224
            ],
            [
                12224,
                12261
            ],
            [
                12261,
                12289
            ],
            [
                12289,
                12309
            ],
            [
                12309,
                12339
            ],
            [
                12339,
                12355
            ],
            [
                12355,
                12431
            ],
            [
                12431,
                12501
            ],
            [
                12501,
                12566
            ],
            [
                12566,
                12620
            ],
            [
                12620,
                12684
            ],
            [
                12684,
                12752
            ],
            [
                12752,
                12775
            ],
            [
                12775,
                12796
            ],
            [
                12796,
                12838
            ],
            [
                12838,
                12892
            ],
            [
                12892,
                12966
            ],
            [
                12966,
                12998
            ],
            [
                12998,
                13085
            ],
            [
                13085,
                13135
            ],
            [
                13135,
                13157
            ],
            [
                13157,
                13213
            ],
            [
                13213,
                13252
            ],
            [
                13252,
                13283
            ],
            [
                13283,
                13383
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                49,
                65
            ],
            [
                70,
                82
            ],
            [
                86,
                188
            ],
            [
                188,
                197
            ],
            [
                198,
                217
            ],
            [
                222,
                224
            ],
            [
                230,
                259
            ],
            [
                264,
                294
            ],
            [
                294,
                296
            ],
            [
                296,
                368
            ],
            [
                375,
                380
            ],
            [
                380,
                395
            ],
            [
                396,
                401
            ],
            [
                413,
                437
            ],
            [
                438,
                442
            ],
            [
                443,
                452
            ],
            [
                460,
                462
            ],
            [
                468,
                514
            ],
            [
                514,
                541
            ],
            [
                550,
                579
            ],
            [
                580,
                614
            ],
            [
                614,
                632
            ],
            [
                633,
                697
            ],
            [
                698,
                725
            ],
            [
                728,
                780
            ],
            [
                781,
                801
            ],
            [
                801,
                909
            ],
            [
                913,
                926
            ],
            [
                927,
                936
            ],
            [
                936,
                938
            ],
            [
                938,
                1004
            ],
            [
                1005,
                1006
            ],
            [
                1009,
                1106
            ],
            [
                1107,
                1116
            ],
            [
                1117,
                1148
            ],
            [
                1157,
                1159
            ],
            [
                1159,
                1181
            ],
            [
                1182,
                1227
            ],
            [
                1227,
                1229
            ],
            [
                1230,
                1237
            ],
            [
                1237,
                1247
            ],
            [
                1248,
                1250
            ],
            [
                1261,
                1277
            ],
            [
                1285,
                1289
            ],
            [
                1290,
                1308
            ],
            [
                1309,
                1442
            ],
            [
                1442,
                1458
            ],
            [
                1458,
                1498
            ],
            [
                1498,
                1554
            ],
            [
                1561,
                1585
            ],
            [
                1586,
                1608
            ],
            [
                1608,
                1622
            ],
            [
                1623,
                1663
            ],
            [
                1666,
                1709
            ],
            [
                1709,
                1763
            ],
            [
                1778,
                1837
            ],
            [
                1837,
                1845
            ],
            [
                1850,
                1895
            ],
            [
                1895,
                1950
            ],
            [
                1951,
                2015
            ],
            [
                2015,
                2048
            ],
            [
                2049,
                2052
            ],
            [
                2063,
                2105
            ],
            [
                2105,
                2106
            ],
            [
                2107,
                2186
            ],
            [
                2189,
                2204
            ],
            [
                2220,
                2252
            ],
            [
                2252,
                2344
            ],
            [
                2345,
                2348
            ],
            [
                2349,
                2352
            ],
            [
                2353,
                2356
            ],
            [
                2377,
                2386
            ],
            [
                2386,
                2388
            ],
            [
                2388,
                2414
            ],
            [
                2420,
                2427
            ],
            [
                2430,
                2463
            ],
            [
                2464,
                2476
            ],
            [
                2479,
                2545
            ],
            [
                2549,
                2563
            ],
            [
                2563,
                2588
            ],
            [
                2589,
                2628
            ],
            [
                2628,
                2733
            ],
            [
                2733,
                2756
            ],
            [
                2756,
                2772
            ],
            [
                2772,
                2774
            ],
            [
                2774,
                2777
            ],
            [
                2778,
                2826
            ],
            [
                2827,
                2847
            ],
            [
                2847,
                2863
            ],
            [
                2864,
                2879
            ],
            [
                2879,
                2880
            ],
            [
                2885,
                2942
            ],
            [
                2942,
                2970
            ],
            [
                2972,
                2997
            ],
            [
                2997,
                3015
            ],
            [
                3015,
                3079
            ],
            [
                3079,
                3140
            ],
            [
                3140,
                3177
            ],
            [
                3177,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3235
            ],
            [
                3248,
                3342
            ],
            [
                3342,
                3370
            ],
            [
                3381,
                3427
            ],
            [
                3427,
                3452
            ],
            [
                3455,
                3471
            ],
            [
                3471,
                3590
            ],
            [
                3590,
                3594
            ],
            [
                3598,
                3678
            ],
            [
                3678,
                3681
            ],
            [
                3688,
                3764
            ],
            [
                3764,
                3767
            ],
            [
                3768,
                3769
            ],
            [
                3784,
                3788
            ],
            [
                3789,
                3799
            ],
            [
                3800,
                3802
            ],
            [
                3803,
                3810
            ],
            [
                3811,
                3816
            ],
            [
                3816,
                3817
            ],
            [
                3818,
                3882
            ],
            [
                3883,
                3894
            ],
            [
                3894,
                4044
            ],
            [
                4044,
                4132
            ],
            [
                4133,
                4135
            ],
            [
                4135,
                4174
            ],
            [
                4174,
                4216
            ],
            [
                4216,
                4252
            ],
            [
                4253,
                4280
            ],
            [
                4280,
                4331
            ],
            [
                4331,
                4333
            ],
            [
                4333,
                4338
            ],
            [
                4344,
                4347
            ],
            [
                4355,
                4433
            ],
            [
                4434,
                4524
            ],
            [
                4528,
                4537
            ],
            [
                4537,
                4542
            ],
            [
                4543,
                4600
            ],
            [
                4600,
                4633
            ],
            [
                4642,
                4675
            ],
            [
                4675,
                4703
            ],
            [
                4708,
                4709
            ],
            [
                4710,
                4755
            ],
            [
                4756,
                4764
            ],
            [
                4764,
                4802
            ],
            [
                4802,
                4804
            ],
            [
                4804,
                4886
            ],
            [
                4886,
                4890
            ],
            [
                4895,
                4949
            ],
            [
                4949,
                4963
            ],
            [
                4970,
                4987
            ],
            [
                4987,
                4989
            ],
            [
                4989,
                5038
            ],
            [
                5038,
                5052
            ],
            [
                5052,
                5055
            ],
            [
                5061,
                5079
            ],
            [
                5091,
                5096
            ],
            [
                5096,
                5106
            ],
            [
                5107,
                5127
            ],
            [
                5127,
                5134
            ],
            [
                5134,
                5136
            ],
            [
                5136,
                5207
            ],
            [
                5207,
                5256
            ],
            [
                5269,
                5306
            ],
            [
                5306,
                5321
            ],
            [
                5323,
                5386
            ],
            [
                5386,
                5391
            ],
            [
                5392,
                5408
            ],
            [
                5408,
                5427
            ],
            [
                5427,
                5438
            ],
            [
                5438,
                5463
            ],
            [
                5463,
                5470
            ],
            [
                5470,
                5491
            ],
            [
                5491,
                5499
            ],
            [
                5500,
                5533
            ],
            [
                5533,
                5602
            ],
            [
                5602,
                5618
            ],
            [
                5622,
                5674
            ],
            [
                5674,
                5767
            ],
            [
                5767,
                5772
            ],
            [
                5773,
                5817
            ],
            [
                5817,
                5843
            ],
            [
                5843,
                5845
            ],
            [
                5845,
                5859
            ],
            [
                5859,
                5860
            ],
            [
                5861,
                5920
            ],
            [
                5925,
                5930
            ],
            [
                5931,
                5951
            ],
            [
                5951,
                6038
            ],
            [
                6053,
                6099
            ],
            [
                6100,
                6130
            ],
            [
                6130,
                6141
            ],
            [
                6143,
                6194
            ],
            [
                6194,
                6196
            ],
            [
                6197,
                6201
            ],
            [
                6207,
                6265
            ],
            [
                6265,
                6376
            ],
            [
                6377,
                6405
            ],
            [
                6405,
                6441
            ],
            [
                6441,
                6444
            ],
            [
                6445,
                6455
            ],
            [
                6455,
                6493
            ],
            [
                6496,
                6529
            ],
            [
                6530,
                6544
            ],
            [
                6545,
                6570
            ],
            [
                6570,
                6624
            ],
            [
                6625,
                6700
            ],
            [
                6701,
                6745
            ],
            [
                6745,
                6840
            ],
            [
                6841,
                6922
            ],
            [
                6922,
                6943
            ],
            [
                6944,
                6945
            ],
            [
                6948,
                6981
            ],
            [
                6984,
                7006
            ],
            [
                7006,
                7035
            ],
            [
                7036,
                7048
            ],
            [
                7048,
                7057
            ],
            [
                7058,
                7152
            ],
            [
                7152,
                7154
            ],
            [
                7154,
                7189
            ],
            [
                7189,
                7193
            ],
            [
                7194,
                7220
            ],
            [
                7220,
                7258
            ],
            [
                7258,
                7267
            ],
            [
                7267,
                7284
            ],
            [
                7285,
                7294
            ],
            [
                7294,
                7336
            ],
            [
                7336,
                7422
            ],
            [
                7422,
                7485
            ],
            [
                7485,
                7540
            ],
            [
                7540,
                7630
            ],
            [
                7631,
                7647
            ],
            [
                7647,
                7674
            ],
            [
                7674,
                7725
            ],
            [
                7725,
                7729
            ],
            [
                7737,
                7750
            ],
            [
                7750,
                7797
            ],
            [
                7797,
                7841
            ],
            [
                7841,
                7911
            ],
            [
                7911,
                7942
            ],
            [
                7945,
                7947
            ],
            [
                7950,
                8000
            ],
            [
                8001,
                8017
            ],
            [
                8017,
                8020
            ],
            [
                8021,
                8088
            ],
            [
                8088,
                8125
            ],
            [
                8125,
                8171
            ],
            [
                8171,
                8240
            ],
            [
                8249,
                8251
            ],
            [
                8251,
                8271
            ],
            [
                8271,
                8307
            ],
            [
                8307,
                8406
            ],
            [
                8406,
                8443
            ],
            [
                8443,
                8501
            ],
            [
                8501,
                8503
            ],
            [
                8503,
                8505
            ],
            [
                8516,
                8562
            ],
            [
                8563,
                8602
            ],
            [
                8602,
                8627
            ],
            [
                8628,
                8669
            ],
            [
                8669,
                8693
            ],
            [
                8693,
                8737
            ],
            [
                8738,
                8760
            ],
            [
                8760,
                8782
            ],
            [
                8783,
                8789
            ],
            [
                8797,
                8830
            ],
            [
                8834,
                8858
            ],
            [
                8858,
                8933
            ],
            [
                8934,
                8972
            ],
            [
                8972,
                9027
            ],
            [
                9030,
                9034
            ],
            [
                9044,
                9093
            ],
            [
                9093,
                9094
            ],
            [
                9094,
                9128
            ],
            [
                9128,
                9181
            ],
            [
                9181,
                9196
            ],
            [
                9197,
                9239
            ],
            [
                9244,
                9248
            ],
            [
                9259,
                9265
            ],
            [
                9266,
                9271
            ],
            [
                9272,
                9294
            ],
            [
                9294,
                9297
            ],
            [
                9297,
                9320
            ],
            [
                9320,
                9323
            ],
            [
                9325,
                9341
            ],
            [
                9341,
                9383
            ],
            [
                9383,
                9432
            ],
            [
                9432,
                9461
            ],
            [
                9461,
                9485
            ],
            [
                9486,
                9502
            ],
            [
                9505,
                9521
            ],
            [
                9521,
                9566
            ],
            [
                9566,
                9577
            ],
            [
                9577,
                9586
            ],
            [
                9586,
                9590
            ],
            [
                9594,
                9597
            ],
            [
                9598,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9669
            ],
            [
                9669,
                9713
            ],
            [
                9713,
                9715
            ],
            [
                9715,
                9846
            ],
            [
                9846,
                9916
            ],
            [
                9916,
                9918
            ],
            [
                9926,
                9956
            ],
            [
                9956,
                9972
            ],
            [
                9973,
                9985
            ],
            [
                9985,
                10047
            ],
            [
                10047,
                10049
            ],
            [
                10053,
                10061
            ],
            [
                10066,
                10071
            ],
            [
                10078,
                10080
            ],
            [
                10081,
                10106
            ],
            [
                10106,
                10139
            ],
            [
                10143,
                10157
            ],
            [
                10157,
                10159
            ],
            [
                10159,
                10204
            ],
            [
                10205,
                10208
            ],
            [
                10209,
                10224
            ],
            [
                10225,
                10237
            ],
            [
                10237,
                10239
            ],
            [
                10239,
                10331
            ],
            [
                10331,
                10381
            ],
            [
                10381,
                10430
            ],
            [
                10430,
                10481
            ],
            [
                10481,
                10493
            ],
            [
                10494,
                10550
            ],
            [
                10550,
                10562
            ],
            [
                10565,
                10583
            ],
            [
                10586,
                10592
            ],
            [
                10614,
                10665
            ],
            [
                10671,
                10706
            ],
            [
                10706,
                10747
            ],
            [
                10748,
                10794
            ],
            [
                10806,
                10808
            ],
            [
                10808,
                10833
            ],
            [
                10834,
                10872
            ],
            [
                10873,
                10933
            ],
            [
                10933,
                10976
            ],
            [
                10976,
                11007
            ],
            [
                11007,
                11049
            ],
            [
                11051,
                11093
            ],
            [
                11093,
                11113
            ],
            [
                11113,
                11172
            ],
            [
                11172,
                11199
            ],
            [
                11199,
                11202
            ],
            [
                11203,
                11212
            ],
            [
                11213,
                11239
            ],
            [
                11240,
                11293
            ],
            [
                11293,
                11442
            ],
            [
                11443,
                11476
            ],
            [
                11477,
                11493
            ],
            [
                11493,
                11495
            ],
            [
                11495,
                11504
            ],
            [
                11505,
                11567
            ],
            [
                11567,
                11602
            ],
            [
                11606,
                11641
            ],
            [
                11641,
                11648
            ],
            [
                11649,
                11731
            ],
            [
                11732,
                11758
            ],
            [
                11758,
                11778
            ],
            [
                11778,
                11787
            ],
            [
                11788,
                11798
            ],
            [
                11799,
                11809
            ],
            [
                11814,
                11819
            ],
            [
                11819,
                11821
            ],
            [
                11821,
                11891
            ],
            [
                11891,
                11926
            ],
            [
                11926,
                11927
            ],
            [
                11929,
                11962
            ],
            [
                11962,
                12097
            ],
            [
                12098,
                12132
            ],
            [
                12132,
                12167
            ],
            [
                12167,
                12224
            ],
            [
                12224,
                12261
            ],
            [
                12261,
                12287
            ],
            [
                12289,
                12309
            ],
            [
                12309,
                12339
            ],
            [
                12339,
                12355
            ],
            [
                12355,
                12356
            ],
            [
                12356,
                12431
            ],
            [
                12431,
                12450
            ],
            [
                12452,
                12501
            ],
            [
                12501,
                12566
            ],
            [
                12566,
                12605
            ],
            [
                12612,
                12617
            ],
            [
                12617,
                12620
            ],
            [
                12620,
                12684
            ],
            [
                12684,
                12752
            ],
            [
                12752,
                12775
            ],
            [
                12775,
                12796
            ],
            [
                12796,
                12803
            ],
            [
                12804,
                12838
            ],
            [
                12838,
                12892
            ],
            [
                12892,
                12916
            ],
            [
                12917,
                12963
            ],
            [
                12966,
                12998
            ],
            [
                12998,
                13083
            ],
            [
                13083,
                13085
            ],
            [
                13085,
                13135
            ],
            [
                13135,
                13157
            ],
            [
                13157,
                13213
            ],
            [
                13213,
                13252
            ],
            [
                13252,
                13282
            ],
            [
                13283,
                13383
            ]
        ],
        "row_chars": [
            [
                0,
                188
            ],
            [
                188,
                188
            ],
            [
                188,
                296
            ],
            [
                296,
                380
            ],
            [
                380,
                580
            ],
            [
                580,
                614
            ],
            [
                614,
                632
            ],
            [
                632,
                632
            ],
            [
                632,
                698
            ],
            [
                698,
                725
            ],
            [
                725,
                801
            ],
            [
                801,
                938
            ],
            [
                938,
                1005
            ],
            [
                1005,
                1107
            ],
            [
                1107,
                1159
            ],
            [
                1159,
                1227
            ],
            [
                1227,
                1309
            ],
            [
                1309,
                1442
            ],
            [
                1442,
                1458
            ],
            [
                1458,
                1498
            ],
            [
                1498,
                1608
            ],
            [
                1608,
                1666
            ],
            [
                1666,
                1666
            ],
            [
                1666,
                1666
            ],
            [
                1666,
                1666
            ],
            [
                1666,
                1709
            ],
            [
                1709,
                1837
            ],
            [
                1837,
                1895
            ],
            [
                1895,
                2015
            ],
            [
                2015,
                2107
            ],
            [
                2107,
                2252
            ],
            [
                2252,
                2388
            ],
            [
                2388,
                2430
            ],
            [
                2430,
                2464
            ],
            [
                2464,
                2464
            ],
            [
                2464,
                2478
            ],
            [
                2478,
                2478
            ],
            [
                2478,
                2478
            ],
            [
                2478,
                2549
            ],
            [
                2549,
                2563
            ],
            [
                2563,
                2628
            ],
            [
                2628,
                2733
            ],
            [
                2733,
                2756
            ],
            [
                2756,
                2774
            ],
            [
                2774,
                2847
            ],
            [
                2847,
                2942
            ],
            [
                2942,
                2997
            ],
            [
                2997,
                2997
            ],
            [
                2997,
                3015
            ],
            [
                3015,
                3015
            ],
            [
                3015,
                3079
            ],
            [
                3079,
                3140
            ],
            [
                3140,
                3177
            ],
            [
                3177,
                3177
            ],
            [
                3177,
                3177
            ],
            [
                3177,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3222
            ],
            [
                3222,
                3342
            ],
            [
                3342,
                3427
            ],
            [
                3427,
                3471
            ],
            [
                3471,
                3590
            ],
            [
                3590,
                3590
            ],
            [
                3590,
                3590
            ],
            [
                3590,
                3590
            ],
            [
                3590,
                3678
            ],
            [
                3678,
                3678
            ],
            [
                3678,
                3678
            ],
            [
                3678,
                3678
            ],
            [
                3678,
                3764
            ],
            [
                3764,
                3818
            ],
            [
                3818,
                3818
            ],
            [
                3818,
                3818
            ],
            [
                3818,
                3894
            ],
            [
                3894,
                4044
            ],
            [
                4044,
                4044
            ],
            [
                4044,
                4133
            ],
            [
                4133,
                4174
            ],
            [
                4174,
                4216
            ],
            [
                4216,
                4280
            ],
            [
                4280,
                4280
            ],
            [
                4280,
                4333
            ],
            [
                4333,
                4537
            ],
            [
                4537,
                4600
            ],
            [
                4600,
                4675
            ],
            [
                4675,
                4675
            ],
            [
                4675,
                4710
            ],
            [
                4710,
                4764
            ],
            [
                4764,
                4804
            ],
            [
                4804,
                4886
            ],
            [
                4886,
                4949
            ],
            [
                4949,
                4989
            ],
            [
                4989,
                5038
            ],
            [
                5038,
                5052
            ],
            [
                5052,
                5096
            ],
            [
                5096,
                5136
            ],
            [
                5136,
                5207
            ],
            [
                5207,
                5256
            ],
            [
                5256,
                5256
            ],
            [
                5256,
                5306
            ],
            [
                5306,
                5323
            ],
            [
                5323,
                5323
            ],
            [
                5323,
                5386
            ],
            [
                5386,
                5408
            ],
            [
                5408,
                5427
            ],
            [
                5427,
                5438
            ],
            [
                5438,
                5463
            ],
            [
                5463,
                5470
            ],
            [
                5470,
                5491
            ],
            [
                5491,
                5533
            ],
            [
                5533,
                5602
            ],
            [
                5602,
                5618
            ],
            [
                5618,
                5618
            ],
            [
                5618,
                5674
            ],
            [
                5674,
                5767
            ],
            [
                5767,
                5817
            ],
            [
                5817,
                5845
            ],
            [
                5845,
                5951
            ],
            [
                5951,
                6100
            ],
            [
                6100,
                6130
            ],
            [
                6130,
                6143
            ],
            [
                6143,
                6194
            ],
            [
                6194,
                6265
            ],
            [
                6265,
                6377
            ],
            [
                6377,
                6405
            ],
            [
                6405,
                6441
            ],
            [
                6441,
                6455
            ],
            [
                6455,
                6570
            ],
            [
                6570,
                6701
            ],
            [
                6701,
                6841
            ],
            [
                6841,
                6841
            ],
            [
                6841,
                6841
            ],
            [
                6841,
                6922
            ],
            [
                6922,
                6944
            ],
            [
                6944,
                7006
            ],
            [
                7006,
                7048
            ],
            [
                7048,
                7154
            ],
            [
                7154,
                7189
            ],
            [
                7189,
                7220
            ],
            [
                7220,
                7258
            ],
            [
                7258,
                7267
            ],
            [
                7267,
                7294
            ],
            [
                7294,
                7336
            ],
            [
                7336,
                7422
            ],
            [
                7422,
                7485
            ],
            [
                7485,
                7540
            ],
            [
                7540,
                7540
            ],
            [
                7540,
                7540
            ],
            [
                7540,
                7647
            ],
            [
                7647,
                7674
            ],
            [
                7674,
                7725
            ],
            [
                7725,
                7750
            ],
            [
                7750,
                7750
            ],
            [
                7750,
                7797
            ],
            [
                7797,
                7841
            ],
            [
                7841,
                7911
            ],
            [
                7911,
                8017
            ],
            [
                8017,
                8088
            ],
            [
                8088,
                8125
            ],
            [
                8125,
                8171
            ],
            [
                8171,
                8251
            ],
            [
                8251,
                8271
            ],
            [
                8271,
                8307
            ],
            [
                8307,
                8406
            ],
            [
                8406,
                8406
            ],
            [
                8406,
                8443
            ],
            [
                8443,
                8503
            ],
            [
                8503,
                8602
            ],
            [
                8602,
                8602
            ],
            [
                8602,
                8669
            ],
            [
                8669,
                8693
            ],
            [
                8693,
                8760
            ],
            [
                8760,
                8858
            ],
            [
                8858,
                8933
            ],
            [
                8933,
                8933
            ],
            [
                8933,
                8972
            ],
            [
                8972,
                9044
            ],
            [
                9044,
                9044
            ],
            [
                9044,
                9093
            ],
            [
                9093,
                9128
            ],
            [
                9128,
                9181
            ],
            [
                9181,
                9181
            ],
            [
                9181,
                9297
            ],
            [
                9297,
                9320
            ],
            [
                9320,
                9341
            ],
            [
                9341,
                9383
            ],
            [
                9383,
                9432
            ],
            [
                9432,
                9461
            ],
            [
                9461,
                9521
            ],
            [
                9521,
                9566
            ],
            [
                9566,
                9577
            ],
            [
                9577,
                9586
            ],
            [
                9586,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9669
            ],
            [
                9669,
                9715
            ],
            [
                9715,
                9846
            ],
            [
                9846,
                9846
            ],
            [
                9846,
                9918
            ],
            [
                9918,
                9985
            ],
            [
                9985,
                10049
            ],
            [
                10049,
                10106
            ],
            [
                10106,
                10159
            ],
            [
                10159,
                10239
            ],
            [
                10239,
                10331
            ],
            [
                10331,
                10381
            ],
            [
                10381,
                10430
            ],
            [
                10430,
                10481
            ],
            [
                10481,
                10550
            ],
            [
                10550,
                10706
            ],
            [
                10706,
                10808
            ],
            [
                10808,
                10873
            ],
            [
                10873,
                10933
            ],
            [
                10933,
                10976
            ],
            [
                10976,
                10976
            ],
            [
                10976,
                11007
            ],
            [
                11007,
                11051
            ],
            [
                11051,
                11093
            ],
            [
                11093,
                11113
            ],
            [
                11113,
                11172
            ],
            [
                11172,
                11199
            ],
            [
                11199,
                11240
            ],
            [
                11240,
                11293
            ],
            [
                11293,
                11495
            ],
            [
                11495,
                11567
            ],
            [
                11567,
                11641
            ],
            [
                11641,
                11732
            ],
            [
                11732,
                11758
            ],
            [
                11758,
                11778
            ],
            [
                11778,
                11821
            ],
            [
                11821,
                11891
            ],
            [
                11891,
                11928
            ],
            [
                11928,
                11928
            ],
            [
                11928,
                11928
            ],
            [
                11928,
                11928
            ],
            [
                11928,
                11928
            ],
            [
                11928,
                11928
            ],
            [
                11928,
                11962
            ],
            [
                11962,
                12132
            ],
            [
                12132,
                12167
            ],
            [
                12167,
                12224
            ],
            [
                12224,
                12261
            ],
            [
                12261,
                12289
            ],
            [
                12289,
                12289
            ],
            [
                12289,
                12289
            ],
            [
                12289,
                12309
            ],
            [
                12309,
                12339
            ],
            [
                12339,
                12355
            ],
            [
                12355,
                12431
            ],
            [
                12431,
                12501
            ],
            [
                12501,
                12566
            ],
            [
                12566,
                12566
            ],
            [
                12566,
                12620
            ],
            [
                12620,
                12684
            ],
            [
                12684,
                12752
            ],
            [
                12752,
                12775
            ],
            [
                12775,
                12796
            ],
            [
                12796,
                12838
            ],
            [
                12838,
                12838
            ],
            [
                12838,
                12838
            ],
            [
                12838,
                12838
            ],
            [
                12838,
                12838
            ],
            [
                12838,
                12892
            ],
            [
                12892,
                12966
            ],
            [
                12966,
                12998
            ],
            [
                12998,
                13085
            ],
            [
                13085,
                13135
            ],
            [
                13135,
                13157
            ],
            [
                13157,
                13213
            ],
            [
                13213,
                13252
            ],
            [
                13252,
                13283
            ],
            [
                13283,
                13383
            ]
        ]
    }
}