{
    "original": {
        "text": "All this time Mr. Longestaffe was necessarily detained in London while the three ladies of his family were living forlornly at Caversham. He had taken his younger daughter home on the day after his visit to Lady Monogram, and in all his intercourse with her had spoken of her suggested marriage with Mr. Brehgert as a thing utterly out of the question. Georgiana had made one little fight for her independence at the Jermyn Street Hotel. \"Indeed, papa, I think it's very hard,\" she said.\n\"What's hard? I think a great many things are hard; but I have to bear them.\"\n\"You can do nothing for me.\"\n\"Do nothing for you! Haven't you got a home to live in, and clothes to wear, and a carriage to go about in,--and books to read if you choose to read them? What do you expect?\"\n\"You know, papa, that's nonsense.\"\n\"How do you dare to tell me that what I say is nonsense?\"\n\"Of course there's a house to live in and clothes to wear; but what's to be the end of it? Sophia, I suppose, is going to be married.\"\n\"I am happy to say she is,--to a most respectable young man and a thorough gentleman.\"\n\"And Dolly has his own way of going on.\"\n\"You have nothing to do with Adolphus.\"\n\"Nor will he have anything to do with me. If I don't marry what's to become of me? It isn't that Mr. Brehgert is the sort of man I should choose.\"\n\"Do not mention his name to me.\"\n\"But what am I to do? You give up the house in town, and how am I to see people? It was you sent me to Mr. Melmotte.\"\n\"I didn't send you to Mr. Melmotte.\"\n\"It was at your suggestion I went there, papa. And of course I could only see the people he had there. I like nice people as well as anybody.\"\n\"There's no use talking any more about it.\"\n\"I don't see that. I must talk about it, and think about it too. If I can put up with Mr. Brehgert I don't see why you and mamma should complain.\"\n\"A Jew!\"\n\"People don't think about that as they used to, papa. He has a very fine income, and I should always have a house in--\"\nThen Mr. Longestaffe became so furious and loud, that he stopped her for that time. \"Look here,\" he said, \"if you mean to tell me that you will marry that man without my consent, I can't prevent it. But you shall not marry him as my daughter. You shall be turned out of my house, and I will never have your name pronounced in my presence again. It is disgusting,--degrading,--disgraceful!\" And then he left her.\nOn the next morning before he started for Caversham he did see Mr. Brehgert; but he told Georgiana nothing of the interview, nor had she the courage to ask him. The objectionable name was not mentioned again in her father's hearing, but there was a sad scene between herself, Lady Pomona, and her sister. When Mr. Longestaffe and his younger daughter arrived, the poor mother did not go down into the hall to meet her child,--from whom she had that morning received the dreadful tidings about the Jew. As to these tidings she had as yet heard no direct condemnation from her husband. The effect upon Lady Pomona had been more grievous even than that made upon the father. Mr. Longestaffe had been able to declare immediately that the proposed marriage was out of the question, that nothing of the kind should be allowed, and could take upon himself to see the Jew with the object of breaking off the engagement. But poor Lady Pomona was helpless in her sorrow. If Georgiana chose to marry a Jew tradesman she could not help it. But such an occurrence in the family would, she felt, be to her as though the end of all things had come. She could never again hold up her head, never go into society, never take pleasure in her powdered footmen. When her daughter should have married a Jew, she didn't think that she could pluck up the courage to look even her neighbours Mrs. Yeld and Mrs. Hepworth in the face. Georgiana found no one in the hall to meet her, and dreaded to go to her mother. She first went with her maid to her own room, and waited there till Sophia came to her. As she sat pretending to watch the process of unpacking, she strove to regain her courage. Why need she be afraid of anybody? Why, at any rate, should she be afraid of other females? Had she not always been dominant over her mother and sister? \"Oh, Georgey,\" said Sophia, \"this is wonderful news!\"\n\"I suppose it seems wonderful that anybody should be going to be married except yourself.\"\n\"No;--but such a very odd match!\"\n\"Look here, Sophia. If you don't like it, you need not talk about it. We shall always have a house in town, and you will not. If you don't like to come to us, you needn't. That's about all.\"\n\"George wouldn't let me go there at all,\" said Sophia.\n\"Then--George--had better keep you at home at Toodlam. Where's mamma? I should have thought somebody might have come and met me to say a word to me, instead of allowing me to creep into the house like this.\"\n\"Mamma isn't at all well; but she's up and in her own room. You mustn't be surprised, Georgey, if you find mamma very--very much cut up about this.\" Then Georgiana understood that she must be content to stand all alone in the world, unless she made up her mind to give up Mr. Brehgert.\n\"So I've come back,\" said Georgiana, stooping down and kissing her mother.\n\"Oh, Georgiana; oh, Georgiana!\" said Lady Pomona, slowly raising herself and covering her face with one of her hands. \"This is dreadful. It will kill me. It will indeed. I didn't expect it from you.\"\n\"What is the good of all that, mamma?\"\n\"It seems to me that it can't be possible. It's unnatural. It's worse than your wife's sister. I'm sure there's something in the Bible against it. You never would read your Bible, or you wouldn't be going to do this.\"\n\"Lady Julia Start has done just the same thing,--and she goes everywhere.\"\n\"What does your papa say? I'm sure your papa won't allow it. If he's fixed about anything, it's about the Jews. An accursed race;--think of that, Georgiana;--expelled from Paradise.\"\n\"Mamma, that's nonsense.\"\n\"Scattered about all over the world, so that nobody knows who anybody is. And it's only since those nasty Radicals came up that they have been able to sit in Parliament.\"\n\"One of the greatest judges in the land is a Jew,\" said Georgiana, who had already learned to fortify her own case.\n\"Nothing that the Radicals can do can make them anything else but what they are. I'm sure that Mr. Whitstable, who is to be your brother-in-law, will never condescend to speak to him.\"\nNow, if there was anybody whom Georgiana Longestaffe had despised from her youth upwards it was George Whitstable. He had been a laughing-stock to her when they were children, had been regarded as a lout when he left school, and had been her common example of rural dullness since he had become a man. He certainly was neither beautiful nor bright;--but he was a Conservative squire born of Tory parents. Nor was he rich,--having but a moderate income, sufficient to maintain a moderate country house and no more. When first there came indications that Sophia intended to put up with George Whitstable, the more ambitious sister did not spare the shafts of her scorn. And now she was told that George Whitstable would not speak to her future husband! She was not to marry Mr. Brehgert lest she should bring disgrace, among others, upon George Whitstable! This was not to be endured.\n\"Then Mr. Whitstable may keep himself at home at Toodlam and not trouble his head at all about me or my husband. I'm sure I shan't trouble myself as to what a poor creature like that may think about me. George Whitstable knows as much about London as I do about the moon.\"\n\"He has always been in county society,\" said Sophia, \"and was staying only the other day at Lord Cantab's.\"\n\"Then there were two fools together,\" said Georgiana, who at this moment was very unhappy.\n\"Mr. Whitstable is an excellent young man, and I am sure he will make your sister happy; but as for Mr. Brehgert,--I can't bear to have his name mentioned in my hearing.\"\n\"Then, mamma, it had better not be mentioned. At any rate it shan't be mentioned again by me.\" Having so spoken, Georgiana bounced out of the room and did not meet her mother and sister again till she came down into the drawing-room before dinner.\nHer position was one very trying both to her nerves and to her feelings. She presumed that her father had seen Mr. Brehgert, but did not in the least know what had passed between them. It might be that her father had been so decided in his objection as to induce Mr. Brehgert to abandon his intention,--and if this were so, there could be no reason why she should endure the misery of having the Jew thrown in her face. Among them all they had made her think that she would never become Mrs. Brehgert. She certainly was not prepared to nail her colours upon the mast and to live and die for Brehgert. She was almost sick of the thing herself. But she could not back out of it so as to obliterate all traces of the disgrace. Even if she should not ultimately marry the Jew, it would be known that she had been engaged to a Jew,--and then it would certainly be said afterwards that the Jew had jilted her. She was thus vacillating in her mind, not knowing whether to go on with Brehgert or to abandon him. That evening Lady Pomona retired immediately after dinner, being \"far from well.\" It was of course known to them all that Mr. Brehgert was her ailment. She was accompanied by her elder daughter, and Georgiana was left with her father. Not a word was spoken between them. He sat behind his newspaper till he went to sleep, and she found herself alone and deserted in that big room. It seemed to her that even the servants treated her with disdain. Her own maid had already given her notice. It was manifestly the intention of her family to ostracise her altogether. Of what service would it be to her that Lady Julia Goldsheiner should be received everywhere, if she herself were to be left without a single Christian friend? Would a life passed exclusively among the Jews content even her lessened ambition? At ten o'clock she kissed her father's head and went to bed. Her father grunted less audibly than usual under the operation. She had always given herself credit for high spirits, but she began to fear that her courage would not suffice to carry her through sufferings such as these.\nOn the next day her father returned to town, and the three ladies were left alone. Great preparations were going on for the Whitstable wedding. Dresses were being made and linen marked, and consultations held,--from all which things Georgiana was kept quite apart. The accepted lover came over to lunch, and was made as much of as though the Whitstables had always kept a town house. Sophy loomed so large in her triumph and happiness, that it was not to be borne. All Caversham treated her with a new respect. And yet if Toodlam was a couple of thousand a year, it was all it was;--and there were two unmarried sisters! Lady Pomona went half into hysterics every time she saw her younger daughter, and became in her way a most oppressive parent. Oh, heavens;--was Mr. Brehgert with his two houses worth all this? A feeling of intense regret for the things she was losing came over her. Even Caversham, the Caversham of old days which she had hated, but in which she had made herself respected and partly feared by everybody about the place,--had charms for her which seemed to her delightful now that they were lost for ever. Then she had always considered herself to be the first personage in the house,--superior even to her father;--but now she was decidedly the last.\nHer second evening was worse even than the first. When Mr. Longestaffe was not at home the family sat in a small dingy room between the library and the dining-room, and on this occasion the family consisted only of Georgiana. In the course of the evening she went up-stairs and calling her sister out into the passage demanded to be told why she was thus deserted. \"Poor mamma is very ill,\" said Sophy.\n\"I won't stand it if I'm to be treated like this,\" said Georgiana. \"I'll go away somewhere.\"\n\"How can I help it, Georgey? It's your own doing. Of course you must have known that you were going to separate yourself from us.\"\nOn the next morning there came a dispatch from Mr. Longestaffe,--of what nature Georgey did not know as it was addressed to Lady Pomona. But one enclosure she was allowed to see. \"Mamma,\" said Sophy, \"thinks you ought to know how Dolly feels about it.\" And then a letter from Dolly to his father was put into Georgey's hands. The letter was as follows:--\nMY DEAR FATHER,--\nCan it be true that Georgey is thinking of marrying that horrid vulgar Jew, old Brehgert? The fellows say so; but I can't believe it. I'm sure you wouldn't let her. You ought to lock her up.\nYours affectionately,\nA. LONGESTAFFE.\nDolly's letters made his father very angry, as, short as they were, they always contained advice or instruction, such as should come from a father to a son, rather than from a son to a father. This letter had not been received with a welcome. Nevertheless the head of the family had thought it worth his while to make use of it, and had sent it to Caversham in order that it might be shown to his rebellious daughter.\nAnd so Dolly had said that she ought to be locked up! She'd like to see somebody do it! As soon as she had read her brother's epistle she tore it into fragments and threw it away in her sister's presence. \"How can mamma be such a hypocrite as to pretend to care what Dolly says? Who doesn't know that he's an idiot? And papa has thought it worth his while to send that down here for me to see! Well, after that I must say that I don't much care what papa does.\"\n\"I don't see why Dolly shouldn't have an opinion as well as anybody else,\" said Sophy.\n\"As well as George Whitstable? As far as stupidness goes they are about the same. But Dolly has a little more knowledge of the world.\"\n\"Of course we all know, Georgiana,\" rejoined the elder sister, \"that for cuteness and that kind of thing one must look among the commercial classes, and especially among a certain sort.\"\n\"I've done with you all,\" said Georgey rushing out of the room. \"I'll have nothing more to do with any one of you.\"\nBut it is very difficult for a young lady to have done with her family! A young man may go anywhere, and may be lost at sea; or come and claim his property after twenty years. A young man may demand an allowance, and has almost a right to live alone. The young male bird is supposed to fly away from the paternal nest. But the daughter of a house is compelled to adhere to her father till she shall get a husband. The only way in which Georgey could \"have done\" with them all at Caversham would be by trusting herself to Mr. Brehgert, and at the present moment she did not know whether Mr. Brehgert did or did not consider himself as engaged to her.\nThat day also passed away with ineffable tedium. At one time she was so beaten down by ennui that she almost offered her assistance to her sister in reference to the wedding garments. In spite of the very bitter words which had been spoken in the morning she would have done so had Sophy afforded her the slightest opportunity. But Sophy was heartlessly cruel in her indifference. In her younger days she had had her bad things, and now,--with George Whitstable by her side,--she meant to have good things, the goodness of which was infinitely enhanced by the badness of her sister's things. She had been so greatly despised that the charm of despising again was irresistible. And she was able to reconcile her cruelty to her conscience by telling herself that duty required her to show implacable resistance to such a marriage as this which her sister contemplated. Therefore Georgiana dragged out another day, not in the least knowing what was to be her fate.",
        "paragraph_chars": [
            [
                0,
                488
            ],
            [
                488,
                566
            ],
            [
                566,
                595
            ],
            [
                595,
                771
            ],
            [
                771,
                806
            ],
            [
                806,
                864
            ],
            [
                864,
                999
            ],
            [
                999,
                1086
            ],
            [
                1086,
                1127
            ],
            [
                1127,
                1167
            ],
            [
                1167,
                1314
            ],
            [
                1314,
                1347
            ],
            [
                1347,
                1465
            ],
            [
                1465,
                1502
            ],
            [
                1502,
                1645
            ],
            [
                1645,
                1689
            ],
            [
                1689,
                1836
            ],
            [
                1836,
                1845
            ],
            [
                1845,
                1965
            ],
            [
                1965,
                2377
            ],
            [
                2377,
                4253
            ],
            [
                4253,
                4344
            ],
            [
                4344,
                4378
            ],
            [
                4378,
                4569
            ],
            [
                4569,
                4624
            ],
            [
                4624,
                4832
            ],
            [
                4832,
                5118
            ],
            [
                5118,
                5193
            ],
            [
                5193,
                5393
            ],
            [
                5393,
                5432
            ],
            [
                5432,
                5650
            ],
            [
                5650,
                5725
            ],
            [
                5725,
                5908
            ],
            [
                5908,
                5934
            ],
            [
                5934,
                6105
            ],
            [
                6105,
                6221
            ],
            [
                6221,
                6406
            ],
            [
                6406,
                7289
            ],
            [
                7289,
                7562
            ],
            [
                7562,
                7670
            ],
            [
                7670,
                7761
            ],
            [
                7761,
                7932
            ],
            [
                7932,
                8180
            ],
            [
                8180,
                10275
            ],
            [
                10275,
                11548
            ],
            [
                11548,
                11951
            ],
            [
                11951,
                12044
            ],
            [
                12044,
                12175
            ],
            [
                12175,
                12530
            ],
            [
                12530,
                12548
            ],
            [
                12548,
                12739
            ],
            [
                12739,
                12761
            ],
            [
                12761,
                12777
            ],
            [
                12777,
                13195
            ],
            [
                13195,
                13657
            ],
            [
                13657,
                13744
            ],
            [
                13744,
                13879
            ],
            [
                13879,
                14066
            ],
            [
                14066,
                14182
            ],
            [
                14182,
                14832
            ],
            [
                14832,
                15793
            ]
        ],
        "segment_chars": [
            [
                0,
                138
            ],
            [
                138,
                353
            ],
            [
                353,
                438
            ],
            [
                438,
                488
            ],
            [
                488,
                502
            ],
            [
                502,
                566
            ],
            [
                566,
                595
            ],
            [
                595,
                616
            ],
            [
                616,
                750
            ],
            [
                750,
                771
            ],
            [
                771,
                806
            ],
            [
                806,
                864
            ],
            [
                864,
                955
            ],
            [
                955,
                999
            ],
            [
                999,
                1086
            ],
            [
                1086,
                1127
            ],
            [
                1127,
                1167
            ],
            [
                1167,
                1209
            ],
            [
                1209,
                1250
            ],
            [
                1250,
                1314
            ],
            [
                1314,
                1347
            ],
            [
                1347,
                1369
            ],
            [
                1369,
                1428
            ],
            [
                1428,
                1465
            ],
            [
                1465,
                1502
            ],
            [
                1502,
                1549
            ],
            [
                1549,
                1605
            ],
            [
                1605,
                1645
            ],
            [
                1645,
                1689
            ],
            [
                1689,
                1708
            ],
            [
                1708,
                1754
            ],
            [
                1754,
                1836
            ],
            [
                1836,
                1845
            ],
            [
                1845,
                1899
            ],
            [
                1899,
                1965
            ],
            [
                1965,
                2049
            ],
            [
                2049,
                2164
            ],
            [
                2164,
                2208
            ],
            [
                2208,
                2310
            ],
            [
                2310,
                2355
            ],
            [
                2355,
                2377
            ],
            [
                2377,
                2538
            ],
            [
                2538,
                2682
            ],
            [
                2682,
                2879
            ],
            [
                2879,
                2961
            ],
            [
                2961,
                3049
            ],
            [
                3049,
                3289
            ],
            [
                3289,
                3338
            ],
            [
                3338,
                3405
            ],
            [
                3405,
                3511
            ],
            [
                3511,
                3619
            ],
            [
                3619,
                3786
            ],
            [
                3786,
                3867
            ],
            [
                3867,
                3955
            ],
            [
                3955,
                4046
            ],
            [
                4046,
                4081
            ],
            [
                4081,
                4138
            ],
            [
                4138,
                4199
            ],
            [
                4199,
                4253
            ],
            [
                4253,
                4344
            ],
            [
                4344,
                4378
            ],
            [
                4378,
                4398
            ],
            [
                4398,
                4448
            ],
            [
                4448,
                4504
            ],
            [
                4504,
                4550
            ],
            [
                4550,
                4569
            ],
            [
                4569,
                4624
            ],
            [
                4624,
                4679
            ],
            [
                4679,
                4694
            ],
            [
                4694,
                4832
            ],
            [
                4832,
                4892
            ],
            [
                4892,
                4981
            ],
            [
                4981,
                5118
            ],
            [
                5118,
                5193
            ],
            [
                5193,
                5225
            ],
            [
                5225,
                5311
            ],
            [
                5311,
                5330
            ],
            [
                5330,
                5347
            ],
            [
                5347,
                5363
            ],
            [
                5363,
                5393
            ],
            [
                5393,
                5432
            ],
            [
                5432,
                5475
            ],
            [
                5475,
                5491
            ],
            [
                5491,
                5527
            ],
            [
                5527,
                5579
            ],
            [
                5579,
                5650
            ],
            [
                5650,
                5725
            ],
            [
                5725,
                5751
            ],
            [
                5751,
                5786
            ],
            [
                5786,
                5837
            ],
            [
                5837,
                5908
            ],
            [
                5908,
                5934
            ],
            [
                5934,
                6008
            ],
            [
                6008,
                6105
            ],
            [
                6105,
                6221
            ],
            [
                6221,
                6302
            ],
            [
                6302,
                6406
            ],
            [
                6406,
                6521
            ],
            [
                6521,
                6708
            ],
            [
                6708,
                6811
            ],
            [
                6811,
                6920
            ],
            [
                6920,
                7074
            ],
            [
                7074,
                7157
            ],
            [
                7157,
                7261
            ],
            [
                7261,
                7289
            ],
            [
                7289,
                7402
            ],
            [
                7402,
                7492
            ],
            [
                7492,
                7562
            ],
            [
                7562,
                7670
            ],
            [
                7670,
                7761
            ],
            [
                7761,
                7932
            ],
            [
                7932,
                7978
            ],
            [
                7978,
                8027
            ],
            [
                8027,
                8180
            ],
            [
                8180,
                8253
            ],
            [
                8253,
                8365
            ],
            [
                8365,
                8600
            ],
            [
                8600,
                8682
            ],
            [
                8682,
                8781
            ],
            [
                8781,
                8823
            ],
            [
                8823,
                8904
            ],
            [
                8904,
                9084
            ],
            [
                9084,
                9184
            ],
            [
                9184,
                9266
            ],
            [
                9266,
                9336
            ],
            [
                9336,
                9419
            ],
            [
                9419,
                9455
            ],
            [
                9455,
                9565
            ],
            [
                9565,
                9631
            ],
            [
                9631,
                9674
            ],
            [
                9674,
                9749
            ],
            [
                9749,
                9909
            ],
            [
                9909,
                9992
            ],
            [
                9992,
                10053
            ],
            [
                10053,
                10117
            ],
            [
                10117,
                10275
            ],
            [
                10275,
                10358
            ],
            [
                10358,
                10419
            ],
            [
                10419,
                10540
            ],
            [
                10540,
                10659
            ],
            [
                10659,
                10740
            ],
            [
                10740,
                10786
            ],
            [
                10786,
                10896
            ],
            [
                10896,
                11022
            ],
            [
                11022,
                11089
            ],
            [
                11089,
                11162
            ],
            [
                11162,
                11402
            ],
            [
                11402,
                11548
            ],
            [
                11548,
                11598
            ],
            [
                11598,
                11774
            ],
            [
                11774,
                11913
            ],
            [
                11913,
                11951
            ],
            [
                11951,
                12018
            ],
            [
                12018,
                12044
            ],
            [
                12044,
                12073
            ],
            [
                12073,
                12094
            ],
            [
                12094,
                12175
            ],
            [
                12175,
                12312
            ],
            [
                12312,
                12354
            ],
            [
                12354,
                12428
            ],
            [
                12428,
                12501
            ],
            [
                12501,
                12530
            ],
            [
                12530,
                12548
            ],
            [
                12548,
                12638
            ],
            [
                12638,
                12682
            ],
            [
                12682,
                12713
            ],
            [
                12713,
                12739
            ],
            [
                12739,
                12761
            ],
            [
                12761,
                12777
            ],
            [
                12777,
                12970
            ],
            [
                12970,
                13020
            ],
            [
                13020,
                13195
            ],
            [
                13195,
                13249
            ],
            [
                13249,
                13283
            ],
            [
                13283,
                13400
            ],
            [
                13400,
                13474
            ],
            [
                13474,
                13511
            ],
            [
                13511,
                13589
            ],
            [
                13589,
                13657
            ],
            [
                13657,
                13744
            ],
            [
                13744,
                13775
            ],
            [
                13775,
                13826
            ],
            [
                13826,
                13879
            ],
            [
                13879,
                14066
            ],
            [
                14066,
                14130
            ],
            [
                14130,
                14182
            ],
            [
                14182,
                14254
            ],
            [
                14254,
                14358
            ],
            [
                14358,
                14433
            ],
            [
                14433,
                14501
            ],
            [
                14501,
                14596
            ],
            [
                14596,
                14832
            ],
            [
                14832,
                14881
            ],
            [
                14881,
                15016
            ],
            [
                15016,
                15160
            ],
            [
                15160,
                15213
            ],
            [
                15213,
                15424
            ],
            [
                15424,
                15509
            ],
            [
                15509,
                15699
            ],
            [
                15699,
                15793
            ]
        ],
        "overlap_chars": [
            [
                141,
                225
            ],
            [
                258,
                315
            ],
            [
                324,
                352
            ],
            [
                353,
                438
            ],
            [
                438,
                488
            ],
            [
                502,
                566
            ],
            [
                566,
                595
            ],
            [
                595,
                616
            ],
            [
                616,
                701
            ],
            [
                748,
                750
            ],
            [
                750,
                771
            ],
            [
                771,
                803
            ],
            [
                1209,
                1250
            ],
            [
                1250,
                1314
            ],
            [
                1314,
                1347
            ],
            [
                1347,
                1369
            ],
            [
                1428,
                1438
            ],
            [
                1439,
                1465
            ],
            [
                1465,
                1502
            ],
            [
                1502,
                1549
            ],
            [
                1549,
                1603
            ],
            [
                1645,
                1689
            ],
            [
                1708,
                1754
            ],
            [
                1754,
                1836
            ],
            [
                1836,
                1845
            ],
            [
                1845,
                1899
            ],
            [
                1899,
                1961
            ],
            [
                1965,
                1992
            ],
            [
                1996,
                2012
            ],
            [
                2047,
                2049
            ],
            [
                2071,
                2164
            ],
            [
                2164,
                2208
            ],
            [
                2208,
                2310
            ],
            [
                2310,
                2326
            ],
            [
                2349,
                2355
            ],
            [
                2355,
                2377
            ],
            [
                2377,
                2431
            ],
            [
                2440,
                2460
            ],
            [
                2432,
                2435
            ],
            [
                2466,
                2475
            ],
            [
                2500,
                2501
            ],
            [
                2510,
                2513
            ],
            [
                2514,
                2537
            ],
            [
                2614,
                2635
            ],
            [
                2588,
                2591
            ],
            [
                2651,
                2664
            ],
            [
                2680,
                2682
            ],
            [
                2682,
                2686
            ],
            [
                2728,
                2763
            ],
            [
                2769,
                2801
            ],
            [
                2803,
                2879
            ],
            [
                3310,
                3338
            ],
            [
                3338,
                3395
            ],
            [
                3401,
                3403
            ],
            [
                3405,
                3408
            ],
            [
                3449,
                3457
            ],
            [
                3469,
                3511
            ],
            [
                3511,
                3572
            ],
            [
                3617,
                3619
            ],
            [
                3619,
                3724
            ],
            [
                3730,
                3744
            ],
            [
                3773,
                3785
            ],
            [
                3786,
                3795
            ],
            [
                3832,
                3833
            ],
            [
                3802,
                3820
            ],
            [
                3877,
                3955
            ],
            [
                4012,
                4046
            ],
            [
                4046,
                4081
            ],
            [
                4138,
                4198
            ],
            [
                4199,
                4250
            ],
            [
                4354,
                4378
            ],
            [
                4378,
                4396
            ],
            [
                4398,
                4448
            ],
            [
                4448,
                4504
            ],
            [
                4504,
                4550
            ],
            [
                4550,
                4556
            ],
            [
                4563,
                4569
            ],
            [
                4569,
                4601
            ],
            [
                4608,
                4624
            ],
            [
                4624,
                4629
            ],
            [
                4639,
                4679
            ],
            [
                4679,
                4692
            ],
            [
                4832,
                4857
            ],
            [
                4862,
                4867
            ],
            [
                4875,
                4892
            ],
            [
                4951,
                4980
            ],
            [
                5084,
                5087
            ],
            [
                4986,
                5020
            ],
            [
                5035,
                5040
            ],
            [
                5045,
                5075
            ],
            [
                5101,
                5118
            ],
            [
                5118,
                5119
            ],
            [
                5122,
                5138
            ],
            [
                5139,
                5143
            ],
            [
                5153,
                5163
            ],
            [
                5169,
                5193
            ],
            [
                5193,
                5194
            ],
            [
                5209,
                5225
            ],
            [
                5235,
                5241
            ],
            [
                5243,
                5249
            ],
            [
                5258,
                5265
            ],
            [
                5241,
                5242
            ],
            [
                5270,
                5292
            ],
            [
                5300,
                5303
            ],
            [
                5309,
                5311
            ],
            [
                5311,
                5330
            ],
            [
                5330,
                5345
            ],
            [
                5393,
                5432
            ],
            [
                5432,
                5433
            ],
            [
                5453,
                5475
            ],
            [
                5475,
                5491
            ],
            [
                5527,
                5577
            ],
            [
                5650,
                5696
            ],
            [
                5699,
                5725
            ],
            [
                5725,
                5751
            ],
            [
                5751,
                5759
            ],
            [
                5770,
                5786
            ],
            [
                5786,
                5820
            ],
            [
                5831,
                5837
            ],
            [
                5837,
                5853
            ],
            [
                5892,
                5908
            ],
            [
                5908,
                5934
            ],
            [
                5934,
                6006
            ],
            [
                6105,
                6221
            ],
            [
                6302,
                6406
            ],
            [
                6406,
                6486
            ],
            [
                6495,
                6521
            ],
            [
                6521,
                6523
            ],
            [
                6582,
                6680
            ],
            [
                6706,
                6708
            ],
            [
                6708,
                6754
            ],
            [
                6760,
                6788
            ],
            [
                6826,
                6827
            ],
            [
                6870,
                6920
            ],
            [
                7074,
                7094
            ],
            [
                7157,
                7221
            ],
            [
                7237,
                7261
            ],
            [
                7261,
                7289
            ],
            [
                7289,
                7370
            ],
            [
                7378,
                7383
            ],
            [
                7400,
                7402
            ],
            [
                7402,
                7492
            ],
            [
                7492,
                7562
            ],
            [
                7761,
                7873
            ],
            [
                7876,
                7891
            ],
            [
                7897,
                7915
            ],
            [
                7929,
                7932
            ],
            [
                7990,
                8027
            ],
            [
                8045,
                8142
            ],
            [
                8165,
                8180
            ],
            [
                8180,
                8196
            ],
            [
                8201,
                8212
            ],
            [
                8251,
                8253
            ],
            [
                8253,
                8316
            ],
            [
                8330,
                8365
            ],
            [
                8365,
                8396
            ],
            [
                8443,
                8480
            ],
            [
                8598,
                8600
            ],
            [
                8615,
                8623
            ],
            [
                8611,
                8614
            ],
            [
                8624,
                8682
            ],
            [
                8682,
                8781
            ],
            [
                8781,
                8823
            ],
            [
                8904,
                8915
            ],
            [
                8951,
                9005
            ],
            [
                9008,
                9025
            ],
            [
                9036,
                9043
            ],
            [
                9055,
                9083
            ],
            [
                9084,
                9108
            ],
            [
                9120,
                9184
            ],
            [
                9184,
                9263
            ],
            [
                9379,
                9382
            ],
            [
                9323,
                9326
            ],
            [
                9308,
                9309
            ],
            [
                9383,
                9419
            ],
            [
                9419,
                9440
            ],
            [
                9453,
                9455
            ],
            [
                9455,
                9565
            ],
            [
                9565,
                9631
            ],
            [
                9631,
                9674
            ],
            [
                9674,
                9676
            ],
            [
                9692,
                9695
            ],
            [
                9713,
                9719
            ],
            [
                9720,
                9749
            ],
            [
                9752,
                9756
            ],
            [
                9765,
                9776
            ],
            [
                9863,
                9908
            ],
            [
                9992,
                10053
            ],
            [
                10053,
                10095
            ],
            [
                10169,
                10170
            ],
            [
                10175,
                10219
            ],
            [
                10231,
                10275
            ],
            [
                10275,
                10358
            ],
            [
                10358,
                10417
            ],
            [
                10459,
                10460
            ],
            [
                10486,
                10490
            ],
            [
                10495,
                10500
            ],
            [
                10508,
                10526
            ],
            [
                10533,
                10540
            ],
            [
                10617,
                10621
            ],
            [
                10559,
                10591
            ],
            [
                10595,
                10602
            ],
            [
                10657,
                10659
            ],
            [
                10659,
                10664
            ],
            [
                10688,
                10695
            ],
            [
                10719,
                10740
            ],
            [
                10740,
                10786
            ],
            [
                10786,
                10793
            ],
            [
                10797,
                10808
            ],
            [
                10809,
                10836
            ],
            [
                10858,
                10895
            ],
            [
                10896,
                10972
            ],
            [
                11020,
                11022
            ],
            [
                11036,
                11089
            ],
            [
                11089,
                11162
            ],
            [
                11162,
                11177
            ],
            [
                11204,
                11209
            ],
            [
                11229,
                11231
            ],
            [
                11195,
                11203
            ],
            [
                11210,
                11224
            ],
            [
                11318,
                11336
            ],
            [
                11368,
                11402
            ],
            [
                11402,
                11479
            ],
            [
                11509,
                11510
            ],
            [
                11512,
                11548
            ],
            [
                11548,
                11598
            ],
            [
                11598,
                11671
            ],
            [
                11696,
                11774
            ],
            [
                11803,
                11811
            ],
            [
                11822,
                11844
            ],
            [
                11866,
                11912
            ],
            [
                11913,
                11951
            ],
            [
                11951,
                12018
            ],
            [
                12018,
                12044
            ],
            [
                12044,
                12073
            ],
            [
                12073,
                12092
            ],
            [
                12175,
                12207
            ],
            [
                12217,
                12238
            ],
            [
                12286,
                12312
            ],
            [
                12320,
                12354
            ],
            [
                12471,
                12474
            ],
            [
                12437,
                12456
            ],
            [
                12516,
                12527
            ],
            [
                12530,
                12544
            ],
            [
                12548,
                12638
            ],
            [
                12638,
                12682
            ],
            [
                12682,
                12713
            ],
            [
                12713,
                12739
            ],
            [
                12739,
                12761
            ],
            [
                12761,
                12777
            ],
            [
                12777,
                12873
            ],
            [
                12890,
                12970
            ],
            [
                13020,
                13089
            ],
            [
                13119,
                13134
            ],
            [
                13158,
                13195
            ],
            [
                13199,
                13207
            ],
            [
                13212,
                13249
            ],
            [
                13283,
                13320
            ],
            [
                13329,
                13373
            ],
            [
                13398,
                13399
            ],
            [
                13400,
                13414
            ],
            [
                13441,
                13474
            ],
            [
                13474,
                13509
            ],
            [
                13657,
                13744
            ],
            [
                13744,
                13775
            ],
            [
                13775,
                13826
            ],
            [
                14067,
                14089
            ],
            [
                14128,
                14130
            ],
            [
                14131,
                14168
            ],
            [
                14173,
                14182
            ],
            [
                14182,
                14254
            ],
            [
                14358,
                14373
            ],
            [
                14501,
                14596
            ],
            [
                14596,
                14720
            ],
            [
                14743,
                14780
            ],
            [
                14805,
                14832
            ],
            [
                14832,
                14840
            ],
            [
                14897,
                14903
            ],
            [
                14930,
                14948
            ],
            [
                14964,
                14966
            ],
            [
                14967,
                14977
            ],
            [
                14858,
                14862
            ],
            [
                14994,
                15016
            ],
            [
                15087,
                15160
            ],
            [
                15160,
                15213
            ],
            [
                15424,
                15484
            ],
            [
                15491,
                15508
            ],
            [
                15699,
                15747
            ],
            [
                15761,
                15793
            ]
        ],
        "row_chars": [
            [
                0,
                138
            ],
            [
                138,
                353
            ],
            [
                353,
                438
            ],
            [
                438,
                488
            ],
            [
                488,
                502
            ],
            [
                502,
                566
            ],
            [
                566,
                595
            ],
            [
                595,
                616
            ],
            [
                616,
                750
            ],
            [
                750,
                771
            ],
            [
                771,
                806
            ],
            [
                806,
                864
            ],
            [
                864,
                955
            ],
            [
                955,
                999
            ],
            [
                999,
                1086
            ],
            [
                1086,
                1127
            ],
            [
                1127,
                1167
            ],
            [
                1167,
                1209
            ],
            [
                1209,
                1250
            ],
            [
                1250,
                1314
            ],
            [
                1314,
                1347
            ],
            [
                1347,
                1369
            ],
            [
                1369,
                1428
            ],
            [
                1428,
                1465
            ],
            [
                1465,
                1502
            ],
            [
                1502,
                1549
            ],
            [
                1549,
                1605
            ],
            [
                1605,
                1645
            ],
            [
                1645,
                1689
            ],
            [
                1689,
                1708
            ],
            [
                1708,
                1754
            ],
            [
                1754,
                1836
            ],
            [
                1836,
                1845
            ],
            [
                1845,
                1899
            ],
            [
                1899,
                1965
            ],
            [
                1965,
                2049
            ],
            [
                2049,
                2164
            ],
            [
                2164,
                2208
            ],
            [
                2208,
                2310
            ],
            [
                2310,
                2355
            ],
            [
                2355,
                2377
            ],
            [
                2377,
                2538
            ],
            [
                2538,
                2682
            ],
            [
                2682,
                2879
            ],
            [
                2879,
                2961
            ],
            [
                2961,
                3049
            ],
            [
                3049,
                3289
            ],
            [
                3289,
                3338
            ],
            [
                3338,
                3511
            ],
            [
                3511,
                3619
            ],
            [
                3619,
                3786
            ],
            [
                3786,
                3955
            ],
            [
                3955,
                4046
            ],
            [
                4046,
                4081
            ],
            [
                4081,
                4138
            ],
            [
                4138,
                4199
            ],
            [
                4199,
                4253
            ],
            [
                4253,
                4344
            ],
            [
                4344,
                4378
            ],
            [
                4378,
                4448
            ],
            [
                4448,
                4504
            ],
            [
                4504,
                4550
            ],
            [
                4550,
                4569
            ],
            [
                4569,
                4624
            ],
            [
                4624,
                4679
            ],
            [
                4679,
                4694
            ],
            [
                4694,
                4832
            ],
            [
                4832,
                4892
            ],
            [
                4892,
                4981
            ],
            [
                4981,
                5118
            ],
            [
                5118,
                5193
            ],
            [
                5193,
                5225
            ],
            [
                5225,
                5311
            ],
            [
                5311,
                5330
            ],
            [
                5330,
                5347
            ],
            [
                5347,
                5363
            ],
            [
                5363,
                5393
            ],
            [
                5393,
                5432
            ],
            [
                5432,
                5475
            ],
            [
                5475,
                5491
            ],
            [
                5491,
                5527
            ],
            [
                5527,
                5579
            ],
            [
                5579,
                5650
            ],
            [
                5650,
                5725
            ],
            [
                5725,
                5751
            ],
            [
                5751,
                5786
            ],
            [
                5786,
                5837
            ],
            [
                5837,
                5908
            ],
            [
                5908,
                5934
            ],
            [
                5934,
                6008
            ],
            [
                6008,
                6105
            ],
            [
                6105,
                6221
            ],
            [
                6221,
                6302
            ],
            [
                6302,
                6406
            ],
            [
                6406,
                6521
            ],
            [
                6521,
                6708
            ],
            [
                6708,
                6920
            ],
            [
                6920,
                7074
            ],
            [
                7074,
                7261
            ],
            [
                7261,
                7289
            ],
            [
                7289,
                7402
            ],
            [
                7402,
                7492
            ],
            [
                7492,
                7562
            ],
            [
                7562,
                7670
            ],
            [
                7670,
                7761
            ],
            [
                7761,
                7932
            ],
            [
                7932,
                7978
            ],
            [
                7978,
                8027
            ],
            [
                8027,
                8180
            ],
            [
                8180,
                8253
            ],
            [
                8253,
                8365
            ],
            [
                8365,
                8600
            ],
            [
                8600,
                8682
            ],
            [
                8682,
                8781
            ],
            [
                8781,
                8823
            ],
            [
                8823,
                8904
            ],
            [
                8904,
                9084
            ],
            [
                9084,
                9184
            ],
            [
                9184,
                9419
            ],
            [
                9419,
                9455
            ],
            [
                9455,
                9565
            ],
            [
                9565,
                9631
            ],
            [
                9631,
                9674
            ],
            [
                9674,
                9749
            ],
            [
                9749,
                9909
            ],
            [
                9909,
                9992
            ],
            [
                9992,
                10053
            ],
            [
                10053,
                10275
            ],
            [
                10275,
                10358
            ],
            [
                10358,
                10540
            ],
            [
                10540,
                10659
            ],
            [
                10659,
                10740
            ],
            [
                10740,
                10786
            ],
            [
                10786,
                10896
            ],
            [
                10896,
                11022
            ],
            [
                11022,
                11089
            ],
            [
                11089,
                11162
            ],
            [
                11162,
                11402
            ],
            [
                11402,
                11548
            ],
            [
                11548,
                11598
            ],
            [
                11598,
                11774
            ],
            [
                11774,
                11913
            ],
            [
                11913,
                11951
            ],
            [
                11951,
                12018
            ],
            [
                12018,
                12044
            ],
            [
                12044,
                12073
            ],
            [
                12073,
                12094
            ],
            [
                12094,
                12175
            ],
            [
                12175,
                12312
            ],
            [
                12312,
                12354
            ],
            [
                12354,
                12428
            ],
            [
                12428,
                12530
            ],
            [
                12530,
                12548
            ],
            [
                12548,
                12638
            ],
            [
                12638,
                12682
            ],
            [
                12682,
                12713
            ],
            [
                12713,
                12739
            ],
            [
                12739,
                12761
            ],
            [
                12761,
                12777
            ],
            [
                12777,
                12970
            ],
            [
                12970,
                13020
            ],
            [
                13020,
                13195
            ],
            [
                13195,
                13249
            ],
            [
                13249,
                13283
            ],
            [
                13283,
                13400
            ],
            [
                13400,
                13474
            ],
            [
                13474,
                13511
            ],
            [
                13511,
                13589
            ],
            [
                13589,
                13657
            ],
            [
                13657,
                13744
            ],
            [
                13744,
                13775
            ],
            [
                13775,
                13826
            ],
            [
                13826,
                13879
            ],
            [
                13879,
                14066
            ],
            [
                14066,
                14130
            ],
            [
                14130,
                14182
            ],
            [
                14182,
                14254
            ],
            [
                14254,
                14358
            ],
            [
                14358,
                14596
            ],
            [
                14596,
                14832
            ],
            [
                14832,
                15016
            ],
            [
                15016,
                15160
            ],
            [
                15160,
                15213
            ],
            [
                15213,
                15424
            ],
            [
                15424,
                15509
            ],
            [
                15509,
                15699
            ],
            [
                15699,
                15793
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Longestaffe had taken his younger daughter home on the day after his visit to Lady Monogram, and had spoken of her suggested marriage with Mr. Brehgert as utterly out of the question.\nGeorgiana had made one little fight for her independence at the Jermyn Street Hotel. \"Indeed, papa, I think it's very hard,\" she said.\n\"I think a great many things are hard; but I have to bear them.\"\n\"You can do nothing for me.\"\n\"Do nothing for you! Haven't you got a home to live in, and clothes to wear, and a carriage to go about in? What do you expect?\"\n\"You know, papa, that's nonsense. If I don't marry what's to become of me? It isn't that Mr. Brehgert is the sort of man I should choose.\"\n\"Do not mention his name to me.\"\n\"But what am I to do? It was you that sent me to Mr. Melmotte.\"\n\"I didn't send you to Mr. Melmotte.\"\n\"It was at your suggestion I went there, papa. And of course I could only see the people he had there.\"\n\"There's no use talking any more about it.\"\n\"I must talk about it, and think about it too. If I can put up with Mr. Brehgert I don't see why you and mamma should complain.\"\n\"A Jew!\"\n\"People don't think about that as they used to, papa. He has a very fine income, and I should always have a house in-\"\nThen Mr. Longestaffe became furious and loud. \"If you mean to tell me that you will marry that man without my consent, I can't prevent it. But you shall not marry him as my daughter. You shall be turned out of my house, and I will never have your name pronounced in my presence again. It is disgusting - degrading - disgraceful!\" And then he left her.\nOn the next morning before he started for Caversham he saw Mr. Brehgert; but he did not tell Georgiana what was said, and she did not have the courage to ask him.\nThen there was a sad scene with her mother, Lady Pomona. When they arrived, the poor mother did not go into the hall to meet her child, from whom she had that morning received the dreadful tidings about the Jew. She was helpless in her sorrow. If Georgiana chose to marry a Jew tradesman she could not stop it; but she felt as though the end of all things had come. She could never again hold up her head, never go into society. When her daughter should have married a Jew, she didn't think that she could pluck up the courage to look her neighbours in the face.\nGeorgiana, finding no one in the hall, went with her maid to her own room, and waited there till Sophia came to her. She strove to regain her courage. Why need she be afraid of anybody? Had she not always been dominant over her mother and sister?\n\"Oh, Georgey,\" said Sophia, \"this is wonderful news! Such a very odd match!\"\n\"Look here, Sophia, if you don't like it, you need not talk about it. We shall always have a house in town, and you will not. If you don't like to come to us, you needn't. That's all.\"\n\"George wouldn't let me go there,\" said Sophia.\n\"Then he had better keep you at home at Toodlam. Where's mamma?\"\n\"Mamma isn't at all well; she's in her own room. She is very much cut up about this.\"\nAs she sought her mother, Georgiana understood that she must stand alone in the world, unless she gave up Mr. Brehgert.\n\"I've come back,\" she said, stooping and kissing her mother.\n\"Oh, Georgiana!\" Lady Pomona slowly raised herself, covering her face with her hand. \"This is dreadful. It will kill me.\"\n\"What is the good of all that, mamma?\"\n\"It can't be possible. It's unnatural. I'm sure there's something in the Bible against it.\"\n\"Lady Julia Start has done just the same thing - and she goes everywhere.\"\n\"What does your papa say? I'm sure he won't allow it. If he's fixed about anything, it's Jews. An accursed race - expelled from Paradise.\"\n\"Mamma, that's nonsense.\"\n\"Scattered about all over the world, so that nobody knows who anybody is.\"\n\"One of the greatest judges in the land is a Jew,\" said Georgiana, who had already learned to fortify her own case.\n\"I'm sure that Mr. Whitstable, who is to be your brother-in-law, will never condescend to speak to him.\"\nNow, if there was anybody whom Georgiana Longestaffe had despised from her youth it was George Whitstable. He had been regarded as a lout when he left school, and had been her common example of rural dullness. He certainly was neither beautiful nor bright; he was a Conservative squire, able to maintain a moderate country house and no more. And now she was told she was not to marry Mr. Brehgert lest she should bring disgrace upon George Whitstable! This was not to be endured.\n\"Then Mr. Whitstable may keep himself at home at Toodlam and not trouble his head about us. I'm sure I shan't trouble myself as to what a poor creature like that may think about me. George Whitstable knows as much about London as I do about the moon.\"\n\"Mr. Whitstable is an excellent young man, and I am sure he will make your sister happy; but as for Mr. Brehgert - I can't bear to hear his name mentioned.\"\n\"Then it shan't be mentioned again by me.\" Georgiana bounced out of the room and did not meet her mother and sister again till she came down before dinner.\nHer position was very trying. She presumed that her father had seen Mr. Brehgert, but did not know what had passed between them. It might be that her father had induced Mr. Brehgert to abandon his intention. They had all made her think that she would never become Mrs. Brehgert. She certainly was not prepared to nail her colours upon the mast and to live and die for Brehgert. She was almost sick of the thing herself. But even if she were to back out, it would be known that she had been engaged to a Jew - and then it would be said that the Jew had jilted her.\nShe was thus vacillating, not knowing whether to go on with Brehgert or to abandon him. That evening Lady Pomona retired immediately after dinner, being \"far from well,\" and Sophia went with her. Georgiana was left with her father. Not a word was spoken. He sat behind his newspaper till he went to sleep, and she found herself alone and deserted in that big room. It seemed to her that even the servants treated her with disdain. Her own maid had already given her notice. It seemed the family intended to ostracise her altogether. What would it be like to be left without a single Christian friend?\nAt ten o'clock she kissed her father's head and went to bed. Her father grunted less audibly than usual, and she began to fear that her courage would not carry her through sufferings such as these.\nOn the next day her father returned to town, and the three ladies were left alone. Great preparations were going on for the Whitstable wedding, from which Georgiana was kept apart. George Whitstable came over to lunch, and was made much of. Sophy's triumph was not to be borne. All Caversham treated her with a new respect. And yet Toodlam was barely a couple of thousand a year - and there were two unmarried sisters!\nLady Pomona went half into hysterics every time she saw her younger daughter. Was Mr. Brehgert with his two houses worth all this? A feeling of intense regret for the things she was losing came over her. Even Caversham, which in old days she had hated, had charms for her now that they were lost for ever. Then she had always considered herself to be the first personage in the house; but now she was decidedly the last.\nHer second evening was worse even than the first. When Mr. Longestaffe was not at home the family sat in a small dingy room next to the dining-room, and on this occasion the family consisted only of Georgiana. She went upstairs, and calling her sister, demanded to be told why she was thus deserted.\n\"Poor mamma is very ill,\" said Sophy.\n\"I won't stand it if I'm to be treated like this,\" said Georgiana. \"I'll go away somewhere.\"\n\"How can I help it, Georgey? It's your own doing.\"\nOn the next morning there came a letter from Mr. Longestaffe, addressed to Lady Pomona. It contained an enclosure she was allowed to see. It was a letter from Dolly, as follows:\nMy dear Father,-\nCan it be true that Georgey is thinking of marrying that horrid vulgar Jew, old Brehgert? The fellows say so; but I can't believe it. I'm sure you wouldn't let her. You ought to lock her up.\nYours affectionately,\nA. Longestaffe.\nDolly's letters made his father very angry, as, short as they were, they always contained advice such as should come from a father to a son, rather than from a son to a father. Nevertheless the head of the family had thought it worth his while to send it to Caversham to be shown to his rebellious daughter.\nSo Dolly said that she ought to be locked up! As soon as she had read her brother's letter she tore it into fragments and threw it away.\n\"How can mamma pretend to care what Dolly says? Who doesn't know that he's an idiot?\"\n\"I don't see why Dolly shouldn't have an opinion as well as anybody else,\" said Sophy.\n\"As well as George Whitstable? As far as stupidness goes they are about the same. I've done with you all. I'll have nothing more to do with any of you.\"\nBut it is very difficult for a young lady to have done with her family! A young man may go anywhere; but the daughter of a house is compelled to adhere to her father till she shall get a husband. The only way in which Georgey could \"have done\" with them all at Caversham would be by trusting herself to Mr. Brehgert, and she did not know whether Mr. Brehgert still considered himself as engaged to her.\nThat day was so tedious she almost offered to help her sister with the wedding garments. She would have done so had Sophy afforded her the slightest opportunity. But Sophy was heartlessly cruel in her indifference. She had been so greatly despised that the charm of despising in her turn was irresistible.\nTherefore Georgiana dragged out another day, not knowing what was to be her fate.",
        "paragraph_chars": [
            [
                0,
                188
            ],
            [
                188,
                323
            ],
            [
                323,
                388
            ],
            [
                388,
                417
            ],
            [
                417,
                546
            ],
            [
                546,
                685
            ],
            [
                685,
                718
            ],
            [
                718,
                782
            ],
            [
                782,
                819
            ],
            [
                819,
                923
            ],
            [
                923,
                967
            ],
            [
                967,
                1096
            ],
            [
                1096,
                1105
            ],
            [
                1105,
                1224
            ],
            [
                1224,
                1576
            ],
            [
                1576,
                1739
            ],
            [
                1739,
                2302
            ],
            [
                2302,
                2549
            ],
            [
                2549,
                2626
            ],
            [
                2626,
                2811
            ],
            [
                2811,
                2859
            ],
            [
                2859,
                2924
            ],
            [
                2924,
                3010
            ],
            [
                3010,
                3130
            ],
            [
                3130,
                3191
            ],
            [
                3191,
                3313
            ],
            [
                3313,
                3352
            ],
            [
                3352,
                3444
            ],
            [
                3444,
                3519
            ],
            [
                3519,
                3658
            ],
            [
                3658,
                3684
            ],
            [
                3684,
                3759
            ],
            [
                3759,
                3875
            ],
            [
                3875,
                3980
            ],
            [
                3980,
                4460
            ],
            [
                4460,
                4712
            ],
            [
                4712,
                4869
            ],
            [
                4869,
                5025
            ],
            [
                5025,
                5589
            ],
            [
                5589,
                6190
            ],
            [
                6190,
                6388
            ],
            [
                6388,
                6807
            ],
            [
                6807,
                7228
            ],
            [
                7228,
                7528
            ],
            [
                7528,
                7566
            ],
            [
                7566,
                7659
            ],
            [
                7659,
                7710
            ],
            [
                7710,
                7888
            ],
            [
                7888,
                7905
            ],
            [
                7905,
                8096
            ],
            [
                8096,
                8118
            ],
            [
                8118,
                8134
            ],
            [
                8134,
                8442
            ],
            [
                8442,
                8579
            ],
            [
                8579,
                8665
            ],
            [
                8665,
                8752
            ],
            [
                8752,
                8905
            ],
            [
                8905,
                9308
            ],
            [
                9308,
                9614
            ],
            [
                9614,
                9695
            ]
        ],
        "segment_chars": [
            [
                0,
                188
            ],
            [
                188,
                273
            ],
            [
                273,
                323
            ],
            [
                323,
                388
            ],
            [
                388,
                417
            ],
            [
                417,
                438
            ],
            [
                438,
                525
            ],
            [
                525,
                546
            ],
            [
                546,
                580
            ],
            [
                580,
                621
            ],
            [
                621,
                685
            ],
            [
                685,
                718
            ],
            [
                718,
                740
            ],
            [
                740,
                782
            ],
            [
                782,
                819
            ],
            [
                819,
                866
            ],
            [
                866,
                923
            ],
            [
                923,
                967
            ],
            [
                967,
                1014
            ],
            [
                1014,
                1096
            ],
            [
                1096,
                1105
            ],
            [
                1105,
                1159
            ],
            [
                1159,
                1224
            ],
            [
                1224,
                1270
            ],
            [
                1270,
                1363
            ],
            [
                1363,
                1407
            ],
            [
                1407,
                1509
            ],
            [
                1509,
                1554
            ],
            [
                1554,
                1576
            ],
            [
                1576,
                1739
            ],
            [
                1739,
                1796
            ],
            [
                1796,
                1951
            ],
            [
                1951,
                1983
            ],
            [
                1983,
                2105
            ],
            [
                2105,
                2168
            ],
            [
                2168,
                2302
            ],
            [
                2302,
                2419
            ],
            [
                2419,
                2453
            ],
            [
                2453,
                2488
            ],
            [
                2488,
                2549
            ],
            [
                2549,
                2602
            ],
            [
                2602,
                2626
            ],
            [
                2626,
                2696
            ],
            [
                2696,
                2752
            ],
            [
                2752,
                2798
            ],
            [
                2798,
                2811
            ],
            [
                2811,
                2859
            ],
            [
                2859,
                2908
            ],
            [
                2908,
                2924
            ],
            [
                2924,
                2973
            ],
            [
                2973,
                3010
            ],
            [
                3010,
                3130
            ],
            [
                3130,
                3191
            ],
            [
                3191,
                3208
            ],
            [
                3208,
                3276
            ],
            [
                3276,
                3295
            ],
            [
                3295,
                3313
            ],
            [
                3313,
                3352
            ],
            [
                3352,
                3375
            ],
            [
                3375,
                3391
            ],
            [
                3391,
                3444
            ],
            [
                3444,
                3519
            ],
            [
                3519,
                3545
            ],
            [
                3545,
                3573
            ],
            [
                3573,
                3614
            ],
            [
                3614,
                3658
            ],
            [
                3658,
                3684
            ],
            [
                3684,
                3759
            ],
            [
                3759,
                3875
            ],
            [
                3875,
                3980
            ],
            [
                3980,
                4087
            ],
            [
                4087,
                4190
            ],
            [
                4190,
                4322
            ],
            [
                4322,
                4432
            ],
            [
                4432,
                4460
            ],
            [
                4460,
                4552
            ],
            [
                4552,
                4642
            ],
            [
                4642,
                4712
            ],
            [
                4712,
                4869
            ],
            [
                4869,
                4912
            ],
            [
                4912,
                5025
            ],
            [
                5025,
                5055
            ],
            [
                5055,
                5154
            ],
            [
                5154,
                5233
            ],
            [
                5233,
                5304
            ],
            [
                5304,
                5403
            ],
            [
                5403,
                5445
            ],
            [
                5445,
                5589
            ],
            [
                5589,
                5677
            ],
            [
                5677,
                5785
            ],
            [
                5785,
                5821
            ],
            [
                5821,
                5844
            ],
            [
                5844,
                5954
            ],
            [
                5954,
                6020
            ],
            [
                6020,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6190
            ],
            [
                6190,
                6251
            ],
            [
                6251,
                6388
            ],
            [
                6388,
                6471
            ],
            [
                6471,
                6569
            ],
            [
                6569,
                6629
            ],
            [
                6629,
                6666
            ],
            [
                6666,
                6712
            ],
            [
                6712,
                6807
            ],
            [
                6807,
                6885
            ],
            [
                6885,
                6938
            ],
            [
                6938,
                7011
            ],
            [
                7011,
                7113
            ],
            [
                7113,
                7228
            ],
            [
                7228,
                7278
            ],
            [
                7278,
                7438
            ],
            [
                7438,
                7528
            ],
            [
                7528,
                7566
            ],
            [
                7566,
                7633
            ],
            [
                7633,
                7659
            ],
            [
                7659,
                7688
            ],
            [
                7688,
                7710
            ],
            [
                7710,
                7798
            ],
            [
                7798,
                7848
            ],
            [
                7848,
                7888
            ],
            [
                7888,
                7905
            ],
            [
                7905,
                7995
            ],
            [
                7995,
                8039
            ],
            [
                8039,
                8070
            ],
            [
                8070,
                8096
            ],
            [
                8096,
                8118
            ],
            [
                8118,
                8134
            ],
            [
                8134,
                8311
            ],
            [
                8311,
                8442
            ],
            [
                8442,
                8488
            ],
            [
                8488,
                8579
            ],
            [
                8579,
                8627
            ],
            [
                8627,
                8665
            ],
            [
                8665,
                8752
            ],
            [
                8752,
                8783
            ],
            [
                8783,
                8834
            ],
            [
                8834,
                8858
            ],
            [
                8858,
                8905
            ],
            [
                8905,
                8977
            ],
            [
                8977,
                9101
            ],
            [
                9101,
                9308
            ],
            [
                9308,
                9397
            ],
            [
                9397,
                9470
            ],
            [
                9470,
                9523
            ],
            [
                9523,
                9614
            ],
            [
                9614,
                9695
            ]
        ],
        "overlap_chars": [
            [
                16,
                100
            ],
            [
                101,
                158
            ],
            [
                159,
                187
            ],
            [
                188,
                273
            ],
            [
                273,
                323
            ],
            [
                324,
                388
            ],
            [
                388,
                417
            ],
            [
                417,
                438
            ],
            [
                438,
                523
            ],
            [
                523,
                525
            ],
            [
                525,
                546
            ],
            [
                546,
                578
            ],
            [
                580,
                621
            ],
            [
                621,
                685
            ],
            [
                685,
                718
            ],
            [
                718,
                740
            ],
            [
                740,
                750
            ],
            [
                756,
                782
            ],
            [
                782,
                819
            ],
            [
                819,
                866
            ],
            [
                866,
                920
            ],
            [
                923,
                967
            ],
            [
                968,
                1014
            ],
            [
                1014,
                1096
            ],
            [
                1096,
                1105
            ],
            [
                1105,
                1159
            ],
            [
                1159,
                1221
            ],
            [
                1224,
                1251
            ],
            [
                1252,
                1268
            ],
            [
                1268,
                1270
            ],
            [
                1270,
                1363
            ],
            [
                1363,
                1407
            ],
            [
                1407,
                1509
            ],
            [
                1509,
                1525
            ],
            [
                1548,
                1554
            ],
            [
                1554,
                1576
            ],
            [
                1576,
                1630
            ],
            [
                1635,
                1655
            ],
            [
                1656,
                1659
            ],
            [
                1669,
                1678
            ],
            [
                1692,
                1693
            ],
            [
                1698,
                1701
            ],
            [
                1715,
                1738
            ],
            [
                1744,
                1765
            ],
            [
                1771,
                1774
            ],
            [
                1781,
                1794
            ],
            [
                1794,
                1796
            ],
            [
                1796,
                1800
            ],
            [
                1806,
                1841
            ],
            [
                1842,
                1874
            ],
            [
                1875,
                1951
            ],
            [
                1955,
                1983
            ],
            [
                1983,
                2040
            ],
            [
                2046,
                2048
            ],
            [
                2050,
                2053
            ],
            [
                2054,
                2062
            ],
            [
                2063,
                2105
            ],
            [
                2105,
                2166
            ],
            [
                2166,
                2168
            ],
            [
                2168,
                2273
            ],
            [
                2274,
                2288
            ],
            [
                2289,
                2301
            ],
            [
                2302,
                2311
            ],
            [
                2311,
                2312
            ],
            [
                2321,
                2339
            ],
            [
                2341,
                2419
            ],
            [
                2419,
                2453
            ],
            [
                2453,
                2488
            ],
            [
                2488,
                2548
            ],
            [
                2549,
                2600
            ],
            [
                2602,
                2626
            ],
            [
                2626,
                2644
            ],
            [
                2646,
                2696
            ],
            [
                2696,
                2752
            ],
            [
                2752,
                2798
            ],
            [
                2798,
                2804
            ],
            [
                2805,
                2811
            ],
            [
                2811,
                2843
            ],
            [
                2843,
                2859
            ],
            [
                2859,
                2864
            ],
            [
                2868,
                2908
            ],
            [
                2908,
                2921
            ],
            [
                2924,
                2949
            ],
            [
                2950,
                2955
            ],
            [
                2956,
                2973
            ],
            [
                2980,
                3009
            ],
            [
                3024,
                3027
            ],
            [
                3036,
                3070
            ],
            [
                3071,
                3076
            ],
            [
                3077,
                3107
            ],
            [
                3113,
                3130
            ],
            [
                3130,
                3131
            ],
            [
                3131,
                3147
            ],
            [
                3152,
                3156
            ],
            [
                3156,
                3166
            ],
            [
                3167,
                3191
            ],
            [
                3191,
                3192
            ],
            [
                3192,
                3208
            ],
            [
                3213,
                3219
            ],
            [
                3220,
                3226
            ],
            [
                3234,
                3241
            ],
            [
                3241,
                3242
            ],
            [
                3243,
                3265
            ],
            [
                3266,
                3269
            ],
            [
                3274,
                3276
            ],
            [
                3276,
                3295
            ],
            [
                3295,
                3310
            ],
            [
                3313,
                3352
            ],
            [
                3352,
                3353
            ],
            [
                3353,
                3375
            ],
            [
                3375,
                3391
            ],
            [
                3391,
                3441
            ],
            [
                3444,
                3490
            ],
            [
                3493,
                3519
            ],
            [
                3519,
                3545
            ],
            [
                3545,
                3553
            ],
            [
                3557,
                3573
            ],
            [
                3573,
                3607
            ],
            [
                3608,
                3614
            ],
            [
                3614,
                3630
            ],
            [
                3642,
                3658
            ],
            [
                3658,
                3684
            ],
            [
                3684,
                3756
            ],
            [
                3759,
                3875
            ],
            [
                3876,
                3980
            ],
            [
                3980,
                4060
            ],
            [
                4061,
                4087
            ],
            [
                4087,
                4089
            ],
            [
                4090,
                4188
            ],
            [
                4188,
                4190
            ],
            [
                4190,
                4236
            ],
            [
                4237,
                4265
            ],
            [
                4265,
                4266
            ],
            [
                4272,
                4322
            ],
            [
                4322,
                4342
            ],
            [
                4343,
                4407
            ],
            [
                4408,
                4432
            ],
            [
                4432,
                4460
            ],
            [
                4460,
                4541
            ],
            [
                4542,
                4547
            ],
            [
                4550,
                4552
            ],
            [
                4552,
                4642
            ],
            [
                4642,
                4712
            ],
            [
                4712,
                4824
            ],
            [
                4827,
                4842
            ],
            [
                4848,
                4866
            ],
            [
                4866,
                4869
            ],
            [
                4875,
                4912
            ],
            [
                4912,
                5009
            ],
            [
                5010,
                5025
            ],
            [
                5025,
                5041
            ],
            [
                5042,
                5053
            ],
            [
                5053,
                5055
            ],
            [
                5055,
                5118
            ],
            [
                5119,
                5154
            ],
            [
                5154,
                5185
            ],
            [
                5194,
                5231
            ],
            [
                5231,
                5233
            ],
            [
                5233,
                5241
            ],
            [
                5242,
                5245
            ],
            [
                5246,
                5304
            ],
            [
                5304,
                5403
            ],
            [
                5403,
                5445
            ],
            [
                5449,
                5460
            ],
            [
                5477,
                5531
            ],
            [
                5534,
                5551
            ],
            [
                5552,
                5559
            ],
            [
                5560,
                5588
            ],
            [
                5589,
                5613
            ],
            [
                5613,
                5677
            ],
            [
                5677,
                5756
            ],
            [
                5759,
                5762
            ],
            [
                5780,
                5783
            ],
            [
                5783,
                5784
            ],
            [
                5785,
                5821
            ],
            [
                5821,
                5842
            ],
            [
                5842,
                5844
            ],
            [
                5844,
                5954
            ],
            [
                5954,
                6020
            ],
            [
                6020,
                6063
            ],
            [
                6063,
                6065
            ],
            [
                6073,
                6076
            ],
            [
                6077,
                6083
            ],
            [
                6093,
                6122
            ],
            [
                6122,
                6126
            ],
            [
                6127,
                6138
            ],
            [
                6144,
                6189
            ],
            [
                6190,
                6251
            ],
            [
                6251,
                6293
            ],
            [
                6293,
                6294
            ],
            [
                6299,
                6343
            ],
            [
                6344,
                6388
            ],
            [
                6388,
                6471
            ],
            [
                6471,
                6530
            ],
            [
                6530,
                6531
            ],
            [
                6532,
                6536
            ],
            [
                6537,
                6542
            ],
            [
                6543,
                6561
            ],
            [
                6562,
                6569
            ],
            [
                6576,
                6580
            ],
            [
                6587,
                6619
            ],
            [
                6620,
                6627
            ],
            [
                6627,
                6629
            ],
            [
                6629,
                6634
            ],
            [
                6637,
                6644
            ],
            [
                6645,
                6666
            ],
            [
                6666,
                6712
            ],
            [
                6712,
                6719
            ],
            [
                6720,
                6731
            ],
            [
                6739,
                6766
            ],
            [
                6769,
                6806
            ],
            [
                6807,
                6883
            ],
            [
                6883,
                6885
            ],
            [
                6885,
                6938
            ],
            [
                6938,
                7011
            ],
            [
                7011,
                7026
            ],
            [
                7027,
                7032
            ],
            [
                7033,
                7035
            ],
            [
                7036,
                7044
            ],
            [
                7045,
                7059
            ],
            [
                7060,
                7078
            ],
            [
                7079,
                7113
            ],
            [
                7113,
                7190
            ],
            [
                7190,
                7191
            ],
            [
                7192,
                7228
            ],
            [
                7228,
                7278
            ],
            [
                7278,
                7351
            ],
            [
                7360,
                7438
            ],
            [
                7438,
                7446
            ],
            [
                7457,
                7479
            ],
            [
                7481,
                7527
            ],
            [
                7528,
                7566
            ],
            [
                7566,
                7633
            ],
            [
                7633,
                7659
            ],
            [
                7659,
                7688
            ],
            [
                7688,
                7707
            ],
            [
                7710,
                7742
            ],
            [
                7750,
                7771
            ],
            [
                7772,
                7798
            ],
            [
                7814,
                7848
            ],
            [
                7851,
                7854
            ],
            [
                7855,
                7874
            ],
            [
                7876,
                7887
            ],
            [
                7888,
                7902
            ],
            [
                7905,
                7995
            ],
            [
                7995,
                8039
            ],
            [
                8039,
                8070
            ],
            [
                8070,
                8096
            ],
            [
                8096,
                8118
            ],
            [
                8118,
                8134
            ],
            [
                8134,
                8230
            ],
            [
                8231,
                8311
            ],
            [
                8311,
                8380
            ],
            [
                8386,
                8401
            ],
            [
                8405,
                8442
            ],
            [
                8442,
                8450
            ],
            [
                8451,
                8488
            ],
            [
                8488,
                8525
            ],
            [
                8533,
                8577
            ],
            [
                8577,
                8578
            ],
            [
                8579,
                8593
            ],
            [
                8594,
                8627
            ],
            [
                8627,
                8662
            ],
            [
                8665,
                8752
            ],
            [
                8752,
                8783
            ],
            [
                8783,
                8834
            ],
            [
                8834,
                8856
            ],
            [
                8856,
                8858
            ],
            [
                8858,
                8895
            ],
            [
                8896,
                8905
            ],
            [
                8905,
                8977
            ],
            [
                8977,
                8992
            ],
            [
                9006,
                9101
            ],
            [
                9101,
                9225
            ],
            [
                9226,
                9263
            ],
            [
                9281,
                9308
            ],
            [
                9308,
                9316
            ],
            [
                9317,
                9323
            ],
            [
                9332,
                9350
            ],
            [
                9351,
                9353
            ],
            [
                9359,
                9369
            ],
            [
                9370,
                9374
            ],
            [
                9375,
                9397
            ],
            [
                9397,
                9470
            ],
            [
                9470,
                9523
            ],
            [
                9523,
                9583
            ],
            [
                9596,
                9613
            ],
            [
                9614,
                9662
            ],
            [
                9663,
                9695
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                188
            ],
            [
                188,
                273
            ],
            [
                273,
                323
            ],
            [
                323,
                323
            ],
            [
                323,
                388
            ],
            [
                388,
                417
            ],
            [
                417,
                438
            ],
            [
                438,
                525
            ],
            [
                525,
                546
            ],
            [
                546,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                580
            ],
            [
                580,
                621
            ],
            [
                621,
                685
            ],
            [
                685,
                718
            ],
            [
                718,
                740
            ],
            [
                740,
                740
            ],
            [
                740,
                782
            ],
            [
                782,
                819
            ],
            [
                819,
                866
            ],
            [
                866,
                923
            ],
            [
                923,
                923
            ],
            [
                923,
                967
            ],
            [
                967,
                967
            ],
            [
                967,
                1014
            ],
            [
                1014,
                1096
            ],
            [
                1096,
                1105
            ],
            [
                1105,
                1159
            ],
            [
                1159,
                1224
            ],
            [
                1224,
                1270
            ],
            [
                1270,
                1363
            ],
            [
                1363,
                1407
            ],
            [
                1407,
                1509
            ],
            [
                1509,
                1554
            ],
            [
                1554,
                1576
            ],
            [
                1576,
                1739
            ],
            [
                1739,
                1796
            ],
            [
                1796,
                1951
            ],
            [
                1951,
                1951
            ],
            [
                1951,
                1951
            ],
            [
                1951,
                1951
            ],
            [
                1951,
                1983
            ],
            [
                1983,
                2105
            ],
            [
                2105,
                2168
            ],
            [
                2168,
                2302
            ],
            [
                2302,
                2419
            ],
            [
                2419,
                2453
            ],
            [
                2453,
                2488
            ],
            [
                2488,
                2488
            ],
            [
                2488,
                2549
            ],
            [
                2549,
                2602
            ],
            [
                2602,
                2602
            ],
            [
                2602,
                2626
            ],
            [
                2626,
                2696
            ],
            [
                2696,
                2752
            ],
            [
                2752,
                2798
            ],
            [
                2798,
                2811
            ],
            [
                2811,
                2859
            ],
            [
                2859,
                2908
            ],
            [
                2908,
                2924
            ],
            [
                2924,
                2924
            ],
            [
                2924,
                2973
            ],
            [
                2973,
                3010
            ],
            [
                3010,
                3130
            ],
            [
                3130,
                3191
            ],
            [
                3191,
                3208
            ],
            [
                3208,
                3276
            ],
            [
                3276,
                3295
            ],
            [
                3295,
                3313
            ],
            [
                3313,
                3313
            ],
            [
                3313,
                3313
            ],
            [
                3313,
                3352
            ],
            [
                3352,
                3375
            ],
            [
                3375,
                3391
            ],
            [
                3391,
                3391
            ],
            [
                3391,
                3444
            ],
            [
                3444,
                3444
            ],
            [
                3444,
                3519
            ],
            [
                3519,
                3545
            ],
            [
                3545,
                3573
            ],
            [
                3573,
                3614
            ],
            [
                3614,
                3658
            ],
            [
                3658,
                3684
            ],
            [
                3684,
                3759
            ],
            [
                3759,
                3759
            ],
            [
                3759,
                3875
            ],
            [
                3875,
                3875
            ],
            [
                3875,
                3980
            ],
            [
                3980,
                4087
            ],
            [
                4087,
                4190
            ],
            [
                4190,
                4322
            ],
            [
                4322,
                4322
            ],
            [
                4322,
                4432
            ],
            [
                4432,
                4460
            ],
            [
                4460,
                4552
            ],
            [
                4552,
                4642
            ],
            [
                4642,
                4712
            ],
            [
                4712,
                4712
            ],
            [
                4712,
                4712
            ],
            [
                4712,
                4869
            ],
            [
                4869,
                4869
            ],
            [
                4869,
                4912
            ],
            [
                4912,
                5025
            ],
            [
                5025,
                5055
            ],
            [
                5055,
                5154
            ],
            [
                5154,
                5233
            ],
            [
                5233,
                5304
            ],
            [
                5304,
                5403
            ],
            [
                5403,
                5445
            ],
            [
                5445,
                5445
            ],
            [
                5445,
                5589
            ],
            [
                5589,
                5677
            ],
            [
                5677,
                5821
            ],
            [
                5821,
                5844
            ],
            [
                5844,
                5954
            ],
            [
                5954,
                6020
            ],
            [
                6020,
                6063
            ],
            [
                6063,
                6122
            ],
            [
                6122,
                6190
            ],
            [
                6190,
                6190
            ],
            [
                6190,
                6251
            ],
            [
                6251,
                6388
            ],
            [
                6388,
                6471
            ],
            [
                6471,
                6569
            ],
            [
                6569,
                6629
            ],
            [
                6629,
                6666
            ],
            [
                6666,
                6712
            ],
            [
                6712,
                6807
            ],
            [
                6807,
                6885
            ],
            [
                6885,
                6938
            ],
            [
                6938,
                7011
            ],
            [
                7011,
                7113
            ],
            [
                7113,
                7228
            ],
            [
                7228,
                7278
            ],
            [
                7278,
                7438
            ],
            [
                7438,
                7528
            ],
            [
                7528,
                7566
            ],
            [
                7566,
                7633
            ],
            [
                7633,
                7659
            ],
            [
                7659,
                7688
            ],
            [
                7688,
                7710
            ],
            [
                7710,
                7710
            ],
            [
                7710,
                7798
            ],
            [
                7798,
                7848
            ],
            [
                7848,
                7848
            ],
            [
                7848,
                7888
            ],
            [
                7888,
                7905
            ],
            [
                7905,
                7995
            ],
            [
                7995,
                8039
            ],
            [
                8039,
                8070
            ],
            [
                8070,
                8096
            ],
            [
                8096,
                8118
            ],
            [
                8118,
                8134
            ],
            [
                8134,
                8311
            ],
            [
                8311,
                8311
            ],
            [
                8311,
                8442
            ],
            [
                8442,
                8488
            ],
            [
                8488,
                8488
            ],
            [
                8488,
                8579
            ],
            [
                8579,
                8627
            ],
            [
                8627,
                8665
            ],
            [
                8665,
                8665
            ],
            [
                8665,
                8665
            ],
            [
                8665,
                8752
            ],
            [
                8752,
                8783
            ],
            [
                8783,
                8834
            ],
            [
                8834,
                8834
            ],
            [
                8834,
                8834
            ],
            [
                8834,
                8858
            ],
            [
                8858,
                8905
            ],
            [
                8905,
                8977
            ],
            [
                8977,
                8977
            ],
            [
                8977,
                9101
            ],
            [
                9101,
                9308
            ],
            [
                9308,
                9397
            ],
            [
                9397,
                9470
            ],
            [
                9470,
                9523
            ],
            [
                9523,
                9523
            ],
            [
                9523,
                9614
            ],
            [
                9614,
                9614
            ],
            [
                9614,
                9695
            ]
        ]
    }
}