{
    "original": {
        "text": "It is hoped that the reader need hardly be informed that Hetta Carbury was a very miserable young woman as soon as she decided that duty compelled her to divide herself altogether from Paul Montague. I think that she was irrational; but to her it seemed that the offence against herself,--the offence against her own dignity as a woman,--was too great to be forgiven. There can be no doubt that it would all have been forgiven with the greatest ease had Paul told the story before it had reached her ears from any other source. Had he said to her,--when her heart was softest towards him,--I once loved another woman, and that woman is here now in London, a trouble to me, persecuting me, and her history is so and so, and the history of my love for her was after this fashion, and the history of my declining love is after that fashion, and of this at any rate you may be sure, that this woman has never been near my heart from the first moment in which I saw you;--had he told it to her thus, there would not have been an opening for anger. And he doubtless would have so told it, had not Hetta's brother interfered too quickly. He was then forced to exculpate himself, to confess rather than to tell his own story,--and to admit facts which wore the air of having been concealed, and which had already been conceived to be altogether damning if true. It was that journey to Lowestoft, not yet a month old, which did the mischief,--a journey as to which Hetta was not slow in understanding all that Roger Carbury had thought about it, though Roger would say nothing of it to herself. Paul had been staying at the seaside with this woman in amicable intimacy,--this horrid woman,--in intimacy worse than amicable, and had been visiting her daily at Islington! Hetta felt quite sure that he had never passed a day without going there since the arrival of the woman; and everybody would know what that meant. And during this very hour he had been,--well, perhaps not exactly making love to herself, but looking at her and talking to her, and behaving to her in a manner such as could not but make her understand that he intended to make love to her. Of course they had really understood it, since they had met at Madame Melmotte's first ball, when she had made a plea that she could not allow herself to dance with him more than,--say half-a-dozen times. Of course she had not intended him then to know that she would receive his love with favour; but equally of course she had known that he must so feel it. She had not only told herself, but had told her mother, that her heart was given away to this man; and yet the man during this very time was spending his hours with a--woman, with a strange American woman, to whom he acknowledged that he had been once engaged. How could she not quarrel with him? How could she refrain from telling him that everything must be over between them? Everybody was against him,--her mother, her brother, and her cousin: and she felt that she had not a word to say in his defence. A horrid woman! A wretched, bad, bold American intriguing woman! It was terrible to her that a friend of hers should ever have attached himself to such a creature;--but that he should have come to her with a second tale of love long, long before he had cleared himself from the first;--perhaps with no intention of clearing himself from the first! Of course she could not forgive him! No;--she would never forgive him. She would break her heart for him. That was a matter of course; but she would never forgive him. She knew well what it was that her mother wanted. Her mother thought that by forcing her into a quarrel with Montague she would force her also into a marriage with Roger Carbury. But her mother would find out that in that she was mistaken. She would never marry her cousin, though she would be always ready to acknowledge his worth. She was sure now that she would never marry any man. As she made this resolve she had a wicked satisfaction in feeling that it would be a trouble to her mother;--for though she was altogether in accord with Lady Carbury as to the iniquities of Paul Montague she was not the less angry with her mother for being so ready to expose those iniquities.\nOh, with what slow, cautious fingers, with what heartbroken tenderness did she take out from its guardian case the brooch which Paul had given her! It had as yet been an only present, and in thanking him for it, which she had done with full, free-spoken words of love, she had begged him to send her no other, so that that might ever be to her,--to her dying day,--the one precious thing that had been given to her by her lover while she was yet a girl. Now it must be sent back;--and, no doubt, it would go to that abominable woman! But her fingers lingered over it as she touched it, and she would fain have kissed it, had she not told herself that she would have been disgraced, even in her solitude, by such a demonstration of affection. She had given her answer to Paul Montague; and, as she would have no further personal correspondence with him, she took the brooch to her mother with a request that it might be returned.\n\"Of course, my dear, I will send it back to him. Is there nothing else?\"\n\"No, mamma;--nothing else. I have no letters, and no other present. You always knew everything that took place. If you will just send that back to him,--without a word. You won't say anything,--will you, mamma?\"\n\"There is nothing for me to say if you have really made him understand you.\"\n\"I think he understood me, mamma. You need not doubt about that.\"\n\"He has behaved very, very badly,--from the beginning,\" said Lady Carbury.\nBut Hetta did not really think that the young man had behaved very badly from the beginning, and certainly did not wish to be told of his misbehaviour. No doubt she thought that the young man had behaved very well in falling in love with her directly he saw her;--only that he had behaved so badly in taking Mrs. Hurtle to Lowestoft afterwards! \"It's no good talking about that, mamma. I hope you will never talk of him any more.\"\n\"He is quite unworthy,\" said Lady Carbury.\n\"I can't bear to--have him--abused,\" said Hetta sobbing.\n\"My dear Hetta, I have no doubt this has made you for the time unhappy. Such little accidents do make people unhappy--for the time. But it will be much for the best that you should endeavour not to be so sensitive about it. The world is too rough and too hard for people to allow their feelings full play. You have to look out for the future, and you can best do so by resolving that Paul Montague shall be forgotten at once.\"\n\"Oh, mamma, don't. How is a person to resolve? Oh, mamma, don't say any more.\"\n\"But, my dear, there is more that I must say. Your future life is before you, and I must think of it, and you must think of it. Of course you must be married.\"\n\"There is no of course at all.\"\n\"Of course you must be married,\" continued Lady Carbury, \"and of course it is your duty to think of the way in which this may be best done. My income is becoming less and less every day. I already owe money to your cousin, and I owe money to Mr. Broune.\"\n\"Money to Mr. Broune!\"\n\"Yes,--to Mr. Broune. I had to pay a sum for Felix which Mr. Broune told me ought to be paid. And I owe money to tradesmen. I fear that I shall not be able to keep on this house. And they tell me,--your cousin and Mr. Broune,--that it is my duty to take Felix out of London,--probably abroad.\"\n\"Of course I shall go with you.\"\n\"It may be so at first; but, perhaps, even that may not be necessary. Why should you? What pleasure could you have in it? Think what my life must be with Felix in some French or German town!\"\n\"Mamma, why don't you let me be a comfort to you? Why do you speak of me always as though I were a burden?\"\n\"Everybody is a burden to other people. It is the way of life. But you,--if you will only yield in ever so little,--you may go where you will be no burden, where you will be accepted simply as a blessing. You have the opportunity of securing comfort for your whole life, and of making a friend, not only for yourself, but for me and your brother, of one whose friendship we cannot fail to want.\"\n\"Mamma, you cannot really mean to talk about that now?\"\n\"Why should I not mean it? What is the use of indulging in high-flown nonsense? Make up your mind to be the wife of your cousin Roger.\"\n\"This is horrid,\" said Hetta, bursting out in her agony. \"Cannot you understand that I am broken-hearted about Paul, that I love him from my very soul, that parting from him is like tearing my heart in pieces? I know that I must, because he has behaved so very badly,--and because of that wicked woman! And so I have. But I did not think that in the very next hour you would bid me give myself to somebody else! I will never marry Roger Carbury. You may be quite--quite sure that I shall never marry any one. If you won't take me with you when you go away with Felix, I must stay behind and try and earn my bread. I suppose I could go out as a nurse.\" Then, without waiting for a reply she left the room and betook herself to her own apartment.\nLady Carbury did not even understand her daughter. She could not conceive that she had in any way acted unkindly in taking the opportunity of Montague's rejection for pressing the suit of the other lover. She was simply anxious to get a husband for her daughter,--as she had been anxious to get a wife for her son,--in order that her child might live comfortably. But she felt that whenever she spoke common sense to Hetta, her daughter took it as an offence, and flew into tantrums, being altogether unable to accommodate herself to the hard truths of the world. Deep as was the sorrow which her son brought upon her, and great as was the disgrace, she could feel more sympathy for him than for the girl. If there was anything that she could not forgive in life it was romance. And yet she, at any rate, believed that she delighted in romantic poetry! At the present moment she was very wretched; and was certainly unselfish in her wish to see her daughter comfortably settled before she commenced those miserable roamings with her son which seemed to be her coming destiny.\nIn these days she thought a good deal of Mr. Broune's offer, and of her own refusal. It was odd that since that refusal she had seen more of him, and had certainly known much more of him than she had ever seen or known before. Previous to that little episode their intimacy had been very fictitious, as are many intimacies. They had played at being friends, knowing but very little of each other. But now, during the last five or six weeks,--since she had refused his offer,--they had really learned to know each other. In the exquisite misery of her troubles, she had told him the truth about herself and her son, and he had responded, not by compliments, but by real aid and true counsel. His whole tone was altered to her, as was hers to him. There was no longer any egregious flattery between them,--and he, in speaking to her, would be almost rough to her. Once he had told her that she would be a fool if she did not do so and so. The consequence was that she almost regretted that she had allowed him to escape. But she certainly made no effort to recover the lost prize, for she told him all her troubles. It was on that afternoon, after her disagreement with her daughter, that Marie Melmotte came to her. And, on that same evening, closeted with Mr. Broune in her back room, she told him of both occurrences. \"If the girl has got the money--,\" she began, regretting her son's obstinacy.\n\"I don't believe a bit of it,\" said Broune. \"From all that I can hear, I don't think that there is any money. And if there is, you may be sure that Melmotte would not let it slip through his fingers in that way. I would not have anything to do with it.\"\n\"You think it is all over with the Melmottes?\"\n\"A rumour reached me just now that he had been already arrested.\" It was now between nine and ten in the evening. \"But as I came away from my room, I heard that he was down at the House. That he will have to stand a trial for forgery, I think there cannot be a doubt, and I imagine that it will be found that not a shilling will be saved out of the property.\"\n\"What a wonderful career it has been!\"\n\"Yes,--the strangest thing that has come up in our days. I am inclined to think that the utter ruin at this moment has been brought about by his reckless personal expenditure.\"\n\"Why did he spend such a lot of money?\"\n\"Because he thought that he could conquer the world by it, and obtain universal credit. He very nearly succeeded too. Only he had forgotten to calculate the force of the envy of his competitors.\"\n\"You think he has committed forgery?\"\n\"Certainly, I think so. Of course we know nothing as yet.\"\n\"Then I suppose it is better that Felix should not have married her.\"\n\"Certainly better. No redemption was to have been had on that side, and I don't think you should regret the loss of such money as his.\" Lady Carbury shook her head, meaning probably to imply that even Melmotte's money would have had no bad odour to one so dreadfully in want of assistance as her son. \"At any rate do not think of it any more.\" Then she told him her grief about Hetta. \"Ah, there,\" said he, \"I feel myself less able to express an authoritative opinion.\"\n\"He doesn't owe a shilling,\" said Lady Carbury, \"and he is really a fine gentleman.\"\n\"But if she doesn't like him?\"\n\"Oh, but she does. She thinks him to be the finest person in the world. She would obey him a great deal sooner than she would me. But she has her mind stuffed with nonsense about love.\"\n\"A great many people, Lady Carbury, have their minds stuffed with that nonsense.\"\n\"Yes;--and ruin themselves with it, as she will do. Love is like any other luxury. You have no right to it unless you can afford it. And those who will have it when they can't afford it, will come to the ground like this Mr. Melmotte. How odd it seems! It isn't a fortnight since we all thought him the greatest man in London.\" Mr. Broune only smiled, not thinking it worth his while to declare that he had never held that opinion about the late idol of Abchurch Lane.\nOn the following morning, very early, while Melmotte was still lying, as yet undiscovered, on the floor of Mr. Longestaffe's room, a letter was brought up to Hetta by the maid-servant, who told her that Mr. Montague had delivered it with his own hands. She took it greedily, and then repressing herself, put it with an assumed gesture of indifference beneath her pillow. But as soon as the girl had left the room she at once seized her treasure. It never occurred to her as yet to think whether she would or would not receive a letter from her dismissed lover. She had told him that he must go, and go for ever, and had taken it for granted that he would do so,--probably willingly. No doubt he would be delighted to return to the American woman. But now that she had the letter, she allowed no doubt to come between her and the reading of it. As soon as she was alone she opened it, and she ran through its contents without allowing herself a moment for thinking, as she went on, whether the excuses made by her lover were or were not such as she ought to accept.\nDEAREST HETTA,\nI think you have been most unjust to me, and if you have ever loved me I cannot understand your injustice. I have never deceived you in anything, not by a word, or for a moment. Unless you mean to throw me over because I did once love another woman, I do not know what cause of anger you have. I could not tell you about Mrs. Hurtle till you had accepted me, and, as you yourself must know, I had had no opportunity to tell you anything afterwards till the story had reached your ears. I hardly know what I said the other day, I was so miserable at your accusation. But I suppose I said then, and I again declare now, that I had made up my mind that circumstances would not admit of her becoming my wife before I had ever seen you, and that I have certainly never wavered in my determination since I saw you. I can with safety refer to Roger as to this, because I was with him when I so determined, and made up my mind very much at his instance. This was before I had ever even met you.\nIf I understand it all right you are angry because I have associated with Mrs. Hurtle since I so determined. I am not going back to my first acquaintance with her now. You may blame me for that if you please,--though it cannot have been a fault against you. But, after what had occurred, was I to refuse to see her when she came to England to see me? I think that would have been cowardly. Of course I went to her. And when she was all alone here, without a single other friend, and telling me that she was unwell, and asking me to take her down to the seaside, was I to refuse? I think that that would have been unkind. It was a dreadful trouble to me. But of course I did it.\nShe asked me to renew my engagement. I am bound to tell you that, but I know in telling you that it will go no farther. I declined, telling her that it was my purpose to ask another woman to be my wife. Of course there has been anger and sorrow,--anger on her part and sorrow on mine. But there has been no doubt. And at last she yielded. As far as she was concerned my trouble was over,--except in so far that her unhappiness has been a great trouble to me,--when, on a sudden, I found that the story had reached you in such a form as to make you determined to quarrel with me!\nOf course you do not know it all, for I cannot tell you all without telling her history. But you know everything that in the least concerns yourself, and I do say that you have no cause whatever for anger. I am writing at night. This evening your brooch was brought to me with three or four cutting words from your mother. But I cannot understand that if you really love me, you should wish to separate yourself from me,--or that, if you ever loved me, you should cease to love me now because of Mrs. Hurtle.\nI am so absolutely confused by the blow that I hardly know what I am writing, and take first one outrageous idea into my head and then another. My love for you is so thorough and so intense that I cannot bring myself to look forward to living without you, now that you have once owned that you have loved me. I cannot think it possible that love, such as I suppose yours must have been, could be made to cease all at a moment. Mine can't. I don't think it is natural that we should be parted.\nIf you want corroboration of my story go yourself to Mrs. Hurtle. Anything is better than that we both should be broken-hearted.\nYours most affectionately,\nPAUL MONTAGUE.",
        "paragraph_chars": [
            [
                0,
                4213
            ],
            [
                4213,
                5142
            ],
            [
                5142,
                5215
            ],
            [
                5215,
                5427
            ],
            [
                5427,
                5504
            ],
            [
                5504,
                5570
            ],
            [
                5570,
                5645
            ],
            [
                5645,
                6076
            ],
            [
                6076,
                6119
            ],
            [
                6119,
                6176
            ],
            [
                6176,
                6603
            ],
            [
                6603,
                6682
            ],
            [
                6682,
                6842
            ],
            [
                6842,
                6874
            ],
            [
                6874,
                7129
            ],
            [
                7129,
                7152
            ],
            [
                7152,
                7446
            ],
            [
                7446,
                7479
            ],
            [
                7479,
                7671
            ],
            [
                7671,
                7779
            ],
            [
                7779,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8367
            ],
            [
                8367,
                9112
            ],
            [
                9112,
                10188
            ],
            [
                10188,
                11585
            ],
            [
                11585,
                11839
            ],
            [
                11839,
                11886
            ],
            [
                11886,
                12246
            ],
            [
                12246,
                12285
            ],
            [
                12285,
                12462
            ],
            [
                12462,
                12502
            ],
            [
                12502,
                12698
            ],
            [
                12698,
                12736
            ],
            [
                12736,
                12795
            ],
            [
                12795,
                12865
            ],
            [
                12865,
                13335
            ],
            [
                13335,
                13420
            ],
            [
                13420,
                13451
            ],
            [
                13451,
                13637
            ],
            [
                13637,
                13719
            ],
            [
                13719,
                14188
            ],
            [
                14188,
                15253
            ],
            [
                15253,
                15268
            ],
            [
                15268,
                16255
            ],
            [
                16255,
                16933
            ],
            [
                16933,
                17512
            ],
            [
                17512,
                18021
            ],
            [
                18021,
                18514
            ],
            [
                18514,
                18643
            ],
            [
                18643,
                18670
            ],
            [
                18670,
                18684
            ]
        ],
        "segment_chars": [
            [
                0,
                200
            ],
            [
                200,
                368
            ],
            [
                368,
                528
            ],
            [
                528,
                1043
            ],
            [
                1043,
                1131
            ],
            [
                1131,
                1354
            ],
            [
                1354,
                1586
            ],
            [
                1586,
                1761
            ],
            [
                1761,
                1908
            ],
            [
                1908,
                2149
            ],
            [
                2149,
                2354
            ],
            [
                2354,
                2508
            ],
            [
                2508,
                2769
            ],
            [
                2769,
                2805
            ],
            [
                2805,
                2887
            ],
            [
                2887,
                3016
            ],
            [
                3016,
                3032
            ],
            [
                3032,
                3081
            ],
            [
                3081,
                3364
            ],
            [
                3364,
                3401
            ],
            [
                3401,
                3435
            ],
            [
                3435,
                3470
            ],
            [
                3470,
                3532
            ],
            [
                3532,
                3582
            ],
            [
                3582,
                3711
            ],
            [
                3711,
                3772
            ],
            [
                3772,
                3865
            ],
            [
                3865,
                3918
            ],
            [
                3918,
                4213
            ],
            [
                4213,
                4361
            ],
            [
                4361,
                4667
            ],
            [
                4667,
                4747
            ],
            [
                4747,
                4955
            ],
            [
                4955,
                5142
            ],
            [
                5142,
                5191
            ],
            [
                5191,
                5215
            ],
            [
                5215,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5327
            ],
            [
                5327,
                5384
            ],
            [
                5384,
                5427
            ],
            [
                5427,
                5504
            ],
            [
                5504,
                5538
            ],
            [
                5538,
                5570
            ],
            [
                5570,
                5645
            ],
            [
                5645,
                5797
            ],
            [
                5797,
                5990
            ],
            [
                5990,
                6031
            ],
            [
                6031,
                6076
            ],
            [
                6076,
                6119
            ],
            [
                6119,
                6176
            ],
            [
                6176,
                6248
            ],
            [
                6248,
                6308
            ],
            [
                6308,
                6400
            ],
            [
                6400,
                6482
            ],
            [
                6482,
                6603
            ],
            [
                6603,
                6622
            ],
            [
                6622,
                6650
            ],
            [
                6650,
                6682
            ],
            [
                6682,
                6728
            ],
            [
                6728,
                6810
            ],
            [
                6810,
                6842
            ],
            [
                6842,
                6874
            ],
            [
                6874,
                7014
            ],
            [
                7014,
                7061
            ],
            [
                7061,
                7129
            ],
            [
                7129,
                7152
            ],
            [
                7152,
                7174
            ],
            [
                7174,
                7246
            ],
            [
                7246,
                7276
            ],
            [
                7276,
                7331
            ],
            [
                7331,
                7446
            ],
            [
                7446,
                7479
            ],
            [
                7479,
                7549
            ],
            [
                7549,
                7565
            ],
            [
                7565,
                7601
            ],
            [
                7601,
                7671
            ],
            [
                7671,
                7721
            ],
            [
                7721,
                7779
            ],
            [
                7779,
                7819
            ],
            [
                7819,
                7842
            ],
            [
                7842,
                7984
            ],
            [
                7984,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8258
            ],
            [
                8258,
                8311
            ],
            [
                8311,
                8367
            ],
            [
                8367,
                8424
            ],
            [
                8424,
                8577
            ],
            [
                8577,
                8670
            ],
            [
                8670,
                8685
            ],
            [
                8685,
                8779
            ],
            [
                8779,
                8813
            ],
            [
                8813,
                8876
            ],
            [
                8876,
                8981
            ],
            [
                8981,
                9019
            ],
            [
                9019,
                9112
            ],
            [
                9112,
                9163
            ],
            [
                9163,
                9317
            ],
            [
                9317,
                9476
            ],
            [
                9476,
                9676
            ],
            [
                9676,
                9818
            ],
            [
                9818,
                9891
            ],
            [
                9891,
                9965
            ],
            [
                9965,
                10188
            ],
            [
                10188,
                10273
            ],
            [
                10273,
                10415
            ],
            [
                10415,
                10512
            ],
            [
                10512,
                10585
            ],
            [
                10585,
                10708
            ],
            [
                10708,
                10879
            ],
            [
                10879,
                10934
            ],
            [
                10934,
                11050
            ],
            [
                11050,
                11125
            ],
            [
                11125,
                11207
            ],
            [
                11207,
                11302
            ],
            [
                11302,
                11403
            ],
            [
                11403,
                11507
            ],
            [
                11507,
                11585
            ],
            [
                11585,
                11629
            ],
            [
                11629,
                11695
            ],
            [
                11695,
                11797
            ],
            [
                11797,
                11839
            ],
            [
                11839,
                11886
            ],
            [
                11886,
                11952
            ],
            [
                11952,
                12000
            ],
            [
                12000,
                12073
            ],
            [
                12073,
                12246
            ],
            [
                12246,
                12285
            ],
            [
                12285,
                12342
            ],
            [
                12342,
                12462
            ],
            [
                12462,
                12502
            ],
            [
                12502,
                12590
            ],
            [
                12590,
                12620
            ],
            [
                12620,
                12698
            ],
            [
                12698,
                12736
            ],
            [
                12736,
                12760
            ],
            [
                12760,
                12795
            ],
            [
                12795,
                12865
            ],
            [
                12865,
                12884
            ],
            [
                12884,
                13001
            ],
            [
                13001,
                13166
            ],
            [
                13166,
                13209
            ],
            [
                13209,
                13250
            ],
            [
                13250,
                13335
            ],
            [
                13335,
                13420
            ],
            [
                13420,
                13451
            ],
            [
                13451,
                13470
            ],
            [
                13470,
                13523
            ],
            [
                13523,
                13581
            ],
            [
                13581,
                13637
            ],
            [
                13637,
                13719
            ],
            [
                13719,
                13771
            ],
            [
                13771,
                13802
            ],
            [
                13802,
                13852
            ],
            [
                13852,
                13954
            ],
            [
                13954,
                13972
            ],
            [
                13972,
                14047
            ],
            [
                14047,
                14188
            ],
            [
                14188,
                14441
            ],
            [
                14441,
                14559
            ],
            [
                14559,
                14634
            ],
            [
                14634,
                14749
            ],
            [
                14749,
                14871
            ],
            [
                14871,
                14935
            ],
            [
                14935,
                15032
            ],
            [
                15032,
                15253
            ],
            [
                15253,
                15268
            ],
            [
                15268,
                15375
            ],
            [
                15375,
                15446
            ],
            [
                15446,
                15562
            ],
            [
                15562,
                15754
            ],
            [
                15754,
                15834
            ],
            [
                15834,
                16077
            ],
            [
                16077,
                16214
            ],
            [
                16214,
                16255
            ],
            [
                16255,
                16364
            ],
            [
                16364,
                16423
            ],
            [
                16423,
                16513
            ],
            [
                16513,
                16606
            ],
            [
                16606,
                16645
            ],
            [
                16645,
                16670
            ],
            [
                16670,
                16834
            ],
            [
                16834,
                16876
            ],
            [
                16876,
                16909
            ],
            [
                16909,
                16933
            ],
            [
                16933,
                16970
            ],
            [
                16970,
                17053
            ],
            [
                17053,
                17136
            ],
            [
                17136,
                17218
            ],
            [
                17218,
                17247
            ],
            [
                17247,
                17272
            ],
            [
                17272,
                17512
            ],
            [
                17512,
                17601
            ],
            [
                17601,
                17718
            ],
            [
                17718,
                17741
            ],
            [
                17741,
                17835
            ],
            [
                17835,
                18021
            ],
            [
                18021,
                18165
            ],
            [
                18165,
                18330
            ],
            [
                18330,
                18448
            ],
            [
                18448,
                18460
            ],
            [
                18460,
                18514
            ],
            [
                18514,
                18580
            ],
            [
                18580,
                18643
            ],
            [
                18643,
                18670
            ],
            [
                18670,
                18684
            ]
        ],
        "overlap_chars": [
            [
                75,
                76
            ],
            [
                63,
                74
            ],
            [
                77,
                91
            ],
            [
                115,
                131
            ],
            [
                151,
                200
            ],
            [
                200,
                278
            ],
            [
                309,
                312
            ],
            [
                317,
                335
            ],
            [
                338,
                368
            ],
            [
                368,
                403
            ],
            [
                408,
                509
            ],
            [
                520,
                528
            ],
            [
                532,
                534
            ],
            [
                528,
                531
            ],
            [
                535,
                547
            ],
            [
                590,
                717
            ],
            [
                862,
                877
            ],
            [
                824,
                828
            ],
            [
                1001,
                1020
            ],
            [
                1041,
                1042
            ],
            [
                1131,
                1133
            ],
            [
                1293,
                1296
            ],
            [
                1305,
                1309
            ],
            [
                1143,
                1149
            ],
            [
                1172,
                1194
            ],
            [
                1198,
                1217
            ],
            [
                1219,
                1243
            ],
            [
                1267,
                1281
            ],
            [
                1352,
                1354
            ],
            [
                1354,
                1431
            ],
            [
                1584,
                1586
            ],
            [
                1586,
                1660
            ],
            [
                1715,
                1761
            ],
            [
                1761,
                1833
            ],
            [
                1864,
                1869
            ],
            [
                1937,
                1945
            ],
            [
                2041,
                2052
            ],
            [
                1989,
                1996
            ],
            [
                2057,
                2068
            ],
            [
                1981,
                1985
            ],
            [
                2144,
                2149
            ],
            [
                2508,
                2515
            ],
            [
                2525,
                2537
            ],
            [
                2564,
                2614
            ],
            [
                2645,
                2667
            ],
            [
                2683,
                2769
            ],
            [
                2769,
                2805
            ],
            [
                3406,
                3435
            ],
            [
                3435,
                3469
            ],
            [
                3532,
                3550
            ],
            [
                3563,
                3582
            ],
            [
                3582,
                3605
            ],
            [
                3626,
                3649
            ],
            [
                3654,
                3669
            ],
            [
                3675,
                3711
            ],
            [
                3711,
                3745
            ],
            [
                3754,
                3772
            ],
            [
                3776,
                3822
            ],
            [
                3826,
                3832
            ],
            [
                3842,
                3865
            ],
            [
                3865,
                3917
            ],
            [
                4217,
                4231
            ],
            [
                4242,
                4309
            ],
            [
                4319,
                4361
            ],
            [
                4361,
                4367
            ],
            [
                4375,
                4379
            ],
            [
                4383,
                4395
            ],
            [
                4550,
                4556
            ],
            [
                4665,
                4667
            ],
            [
                4667,
                4692
            ],
            [
                4694,
                4747
            ],
            [
                4747,
                4771
            ],
            [
                4780,
                4893
            ],
            [
                4917,
                4955
            ],
            [
                5003,
                5060
            ],
            [
                4983,
                4996
            ],
            [
                5064,
                5142
            ],
            [
                5142,
                5191
            ],
            [
                5191,
                5215
            ],
            [
                5215,
                5226
            ],
            [
                5228,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5327
            ],
            [
                5327,
                5365
            ],
            [
                5368,
                5382
            ],
            [
                5570,
                5603
            ],
            [
                5605,
                5645
            ],
            [
                5645,
                5654
            ],
            [
                5742,
                5797
            ],
            [
                5797,
                5886
            ],
            [
                5909,
                5989
            ],
            [
                5990,
                6031
            ],
            [
                6031,
                6076
            ],
            [
                6076,
                6119
            ],
            [
                6119,
                6135
            ],
            [
                6137,
                6145
            ],
            [
                6153,
                6166
            ],
            [
                6167,
                6176
            ],
            [
                6176,
                6248
            ],
            [
                6308,
                6311
            ],
            [
                6346,
                6400
            ],
            [
                6482,
                6603
            ],
            [
                6603,
                6620
            ],
            [
                6682,
                6728
            ],
            [
                6728,
                6782
            ],
            [
                6808,
                6810
            ],
            [
                6810,
                6842
            ],
            [
                6842,
                6874
            ],
            [
                6874,
                7014
            ],
            [
                7014,
                7061
            ],
            [
                7061,
                7129
            ],
            [
                7129,
                7152
            ],
            [
                7152,
                7156
            ],
            [
                7174,
                7202
            ],
            [
                7244,
                7246
            ],
            [
                7246,
                7276
            ],
            [
                7276,
                7315
            ],
            [
                7319,
                7331
            ],
            [
                7331,
                7347
            ],
            [
                7350,
                7376
            ],
            [
                7379,
                7426
            ],
            [
                7428,
                7446
            ],
            [
                7446,
                7479
            ],
            [
                7479,
                7480
            ],
            [
                7508,
                7515
            ],
            [
                7522,
                7549
            ],
            [
                7565,
                7601
            ],
            [
                7601,
                7671
            ],
            [
                7671,
                7721
            ],
            [
                7721,
                7779
            ],
            [
                7779,
                7819
            ],
            [
                7819,
                7842
            ],
            [
                7842,
                7849
            ],
            [
                7852,
                7892
            ],
            [
                7895,
                7961
            ],
            [
                7969,
                7984
            ],
            [
                7984,
                8049
            ],
            [
                8074,
                8124
            ],
            [
                8172,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8235
            ],
            [
                8245,
                8248
            ],
            [
                8256,
                8258
            ],
            [
                8311,
                8367
            ],
            [
                8367,
                8424
            ],
            [
                8424,
                8577
            ],
            [
                8577,
                8633
            ],
            [
                8636,
                8670
            ],
            [
                8670,
                8685
            ],
            [
                8685,
                8779
            ],
            [
                8779,
                8813
            ],
            [
                8847,
                8866
            ],
            [
                8874,
                8876
            ],
            [
                8876,
                8905
            ],
            [
                8933,
                8957
            ],
            [
                8966,
                8981
            ],
            [
                8981,
                9019
            ],
            [
                9025,
                9070
            ],
            [
                9110,
                9112
            ],
            [
                9112,
                9163
            ],
            [
                9163,
                9224
            ],
            [
                9315,
                9317
            ],
            [
                9317,
                9364
            ],
            [
                9446,
                9451
            ],
            [
                9373,
                9374
            ],
            [
                9437,
                9441
            ],
            [
                9379,
                9382
            ],
            [
                9452,
                9476
            ],
            [
                9476,
                9594
            ],
            [
                9674,
                9676
            ],
            [
                9818,
                9891
            ],
            [
                9891,
                9902
            ],
            [
                9917,
                9964
            ],
            [
                9965,
                9967
            ],
            [
                9972,
                9979
            ],
            [
                9987,
                10171
            ],
            [
                10179,
                10188
            ],
            [
                10188,
                10273
            ],
            [
                10273,
                10332
            ],
            [
                10375,
                10383
            ],
            [
                10388,
                10392
            ],
            [
                10338,
                10341
            ],
            [
                10407,
                10415
            ],
            [
                10415,
                10418
            ],
            [
                10447,
                10470
            ],
            [
                10476,
                10486
            ],
            [
                10512,
                10553
            ],
            [
                10563,
                10585
            ],
            [
                10585,
                10627
            ],
            [
                10630,
                10662
            ],
            [
                10664,
                10708
            ],
            [
                10708,
                10710
            ],
            [
                10735,
                10879
            ],
            [
                10879,
                10934
            ],
            [
                10934,
                10957
            ],
            [
                10968,
                10989
            ],
            [
                11048,
                11049
            ],
            [
                11129,
                11140
            ],
            [
                11150,
                11207
            ],
            [
                11207,
                11265
            ],
            [
                11300,
                11301
            ],
            [
                11302,
                11403
            ],
            [
                11403,
                11454
            ],
            [
                11471,
                11506
            ],
            [
                11507,
                11537
            ],
            [
                11542,
                11551
            ],
            [
                11583,
                11585
            ],
            [
                11585,
                11601
            ],
            [
                11611,
                11629
            ],
            [
                11629,
                11630
            ],
            [
                11656,
                11695
            ],
            [
                11695,
                11783
            ],
            [
                11795,
                11797
            ],
            [
                11797,
                11839
            ],
            [
                11839,
                11886
            ],
            [
                12078,
                12099
            ],
            [
                12102,
                12120
            ],
            [
                12145,
                12246
            ],
            [
                12246,
                12251
            ],
            [
                12264,
                12285
            ],
            [
                12285,
                12290
            ],
            [
                12292,
                12342
            ],
            [
                12511,
                12553
            ],
            [
                12559,
                12590
            ],
            [
                12590,
                12618
            ],
            [
                12698,
                12736
            ],
            [
                12736,
                12737
            ],
            [
                12748,
                12758
            ],
            [
                12795,
                12865
            ],
            [
                12865,
                12875
            ],
            [
                12882,
                12884
            ],
            [
                12937,
                13000
            ],
            [
                13001,
                13028
            ],
            [
                13164,
                13166
            ],
            [
                13209,
                13249
            ],
            [
                13250,
                13279
            ],
            [
                13287,
                13310
            ],
            [
                13325,
                13335
            ],
            [
                13335,
                13420
            ],
            [
                13420,
                13451
            ],
            [
                13451,
                13470
            ],
            [
                13470,
                13523
            ],
            [
                13523,
                13581
            ],
            [
                13581,
                13637
            ],
            [
                13637,
                13719
            ],
            [
                13719,
                13724
            ],
            [
                13726,
                13771
            ],
            [
                13771,
                13802
            ],
            [
                13802,
                13850
            ],
            [
                14188,
                14256
            ],
            [
                14265,
                14277
            ],
            [
                14279,
                14420
            ],
            [
                14439,
                14440
            ],
            [
                14441,
                14444
            ],
            [
                14492,
                14498
            ],
            [
                14499,
                14503
            ],
            [
                14507,
                14514
            ],
            [
                14526,
                14538
            ],
            [
                14557,
                14559
            ],
            [
                14559,
                14604
            ],
            [
                14613,
                14634
            ],
            [
                15057,
                15075
            ],
            [
                15080,
                15151
            ],
            [
                15169,
                15211
            ],
            [
                15224,
                15253
            ],
            [
                15253,
                15268
            ],
            [
                15268,
                15307
            ],
            [
                15373,
                15375
            ],
            [
                15375,
                15446
            ],
            [
                15446,
                15562
            ],
            [
                15562,
                15630
            ],
            [
                15659,
                15660
            ],
            [
                15665,
                15695
            ],
            [
                15716,
                15754
            ],
            [
                15754,
                15834
            ],
            [
                15834,
                15917
            ],
            [
                16066,
                16067
            ],
            [
                15938,
                15941
            ],
            [
                15951,
                15954
            ],
            [
                15972,
                16015
            ],
            [
                16026,
                16059
            ],
            [
                16075,
                16077
            ],
            [
                16077,
                16082
            ],
            [
                16095,
                16154
            ],
            [
                16165,
                16214
            ],
            [
                16214,
                16255
            ],
            [
                16255,
                16273
            ],
            [
                16278,
                16346
            ],
            [
                16362,
                16364
            ],
            [
                16364,
                16423
            ],
            [
                16513,
                16606
            ],
            [
                16606,
                16645
            ],
            [
                16645,
                16670
            ],
            [
                16670,
                16834
            ],
            [
                16876,
                16909
            ],
            [
                16909,
                16933
            ],
            [
                16933,
                16970
            ],
            [
                17053,
                17081
            ],
            [
                17100,
                17136
            ],
            [
                17136,
                17177
            ],
            [
                17180,
                17218
            ],
            [
                17218,
                17247
            ],
            [
                17247,
                17271
            ],
            [
                17512,
                17537
            ],
            [
                17541,
                17544
            ],
            [
                17425,
                17434
            ],
            [
                17544,
                17601
            ],
            [
                17601,
                17629
            ],
            [
                17643,
                17718
            ],
            [
                17718,
                17741
            ],
            [
                17741,
                17835
            ],
            [
                17835,
                17931
            ],
            [
                17934,
                18021
            ],
            [
                18021,
                18097
            ],
            [
                18163,
                18165
            ],
            [
                18165,
                18275
            ],
            [
                18328,
                18330
            ],
            [
                18330,
                18361
            ],
            [
                18362,
                18366
            ],
            [
                18408,
                18448
            ],
            [
                18448,
                18459
            ],
            [
                18514,
                18580
            ],
            [
                18580,
                18611
            ],
            [
                18617,
                18623
            ],
            [
                18612,
                18616
            ],
            [
                18624,
                18643
            ],
            [
                18643,
                18670
            ],
            [
                18670,
                18684
            ]
        ],
        "row_chars": [
            [
                0,
                200
            ],
            [
                200,
                368
            ],
            [
                368,
                528
            ],
            [
                528,
                1043
            ],
            [
                1043,
                1131
            ],
            [
                1131,
                1354
            ],
            [
                1354,
                1586
            ],
            [
                1586,
                1761
            ],
            [
                1761,
                2149
            ],
            [
                2149,
                2354
            ],
            [
                2354,
                2508
            ],
            [
                2508,
                2769
            ],
            [
                2769,
                2805
            ],
            [
                2805,
                2887
            ],
            [
                2887,
                3016
            ],
            [
                3016,
                3032
            ],
            [
                3032,
                3081
            ],
            [
                3081,
                3364
            ],
            [
                3364,
                3401
            ],
            [
                3401,
                3435
            ],
            [
                3435,
                3470
            ],
            [
                3470,
                3532
            ],
            [
                3532,
                3582
            ],
            [
                3582,
                3711
            ],
            [
                3711,
                3772
            ],
            [
                3772,
                3865
            ],
            [
                3865,
                3918
            ],
            [
                3918,
                4213
            ],
            [
                4213,
                4361
            ],
            [
                4361,
                4667
            ],
            [
                4667,
                4747
            ],
            [
                4747,
                4955
            ],
            [
                4955,
                5142
            ],
            [
                5142,
                5191
            ],
            [
                5191,
                5215
            ],
            [
                5215,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5327
            ],
            [
                5327,
                5384
            ],
            [
                5384,
                5427
            ],
            [
                5427,
                5504
            ],
            [
                5504,
                5538
            ],
            [
                5538,
                5570
            ],
            [
                5570,
                5645
            ],
            [
                5645,
                5797
            ],
            [
                5797,
                5990
            ],
            [
                5990,
                6031
            ],
            [
                6031,
                6076
            ],
            [
                6076,
                6119
            ],
            [
                6119,
                6176
            ],
            [
                6176,
                6248
            ],
            [
                6248,
                6308
            ],
            [
                6308,
                6400
            ],
            [
                6400,
                6482
            ],
            [
                6482,
                6603
            ],
            [
                6603,
                6622
            ],
            [
                6622,
                6650
            ],
            [
                6650,
                6682
            ],
            [
                6682,
                6728
            ],
            [
                6728,
                6810
            ],
            [
                6810,
                6842
            ],
            [
                6842,
                6874
            ],
            [
                6874,
                7014
            ],
            [
                7014,
                7061
            ],
            [
                7061,
                7129
            ],
            [
                7129,
                7152
            ],
            [
                7152,
                7246
            ],
            [
                7246,
                7276
            ],
            [
                7276,
                7331
            ],
            [
                7331,
                7446
            ],
            [
                7446,
                7479
            ],
            [
                7479,
                7549
            ],
            [
                7549,
                7565
            ],
            [
                7565,
                7601
            ],
            [
                7601,
                7671
            ],
            [
                7671,
                7721
            ],
            [
                7721,
                7779
            ],
            [
                7779,
                7819
            ],
            [
                7819,
                7842
            ],
            [
                7842,
                7984
            ],
            [
                7984,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8258
            ],
            [
                8258,
                8311
            ],
            [
                8311,
                8367
            ],
            [
                8367,
                8424
            ],
            [
                8424,
                8577
            ],
            [
                8577,
                8670
            ],
            [
                8670,
                8685
            ],
            [
                8685,
                8779
            ],
            [
                8779,
                8813
            ],
            [
                8813,
                8876
            ],
            [
                8876,
                8981
            ],
            [
                8981,
                9019
            ],
            [
                9019,
                9112
            ],
            [
                9112,
                9163
            ],
            [
                9163,
                9317
            ],
            [
                9317,
                9476
            ],
            [
                9476,
                9676
            ],
            [
                9676,
                9818
            ],
            [
                9818,
                9891
            ],
            [
                9891,
                9965
            ],
            [
                9965,
                10188
            ],
            [
                10188,
                10273
            ],
            [
                10273,
                10415
            ],
            [
                10415,
                10585
            ],
            [
                10585,
                10708
            ],
            [
                10708,
                10879
            ],
            [
                10879,
                10934
            ],
            [
                10934,
                11050
            ],
            [
                11050,
                11125
            ],
            [
                11125,
                11207
            ],
            [
                11207,
                11302
            ],
            [
                11302,
                11403
            ],
            [
                11403,
                11507
            ],
            [
                11507,
                11585
            ],
            [
                11585,
                11629
            ],
            [
                11629,
                11695
            ],
            [
                11695,
                11797
            ],
            [
                11797,
                11839
            ],
            [
                11839,
                11886
            ],
            [
                11886,
                11952
            ],
            [
                11952,
                12000
            ],
            [
                12000,
                12073
            ],
            [
                12073,
                12246
            ],
            [
                12246,
                12285
            ],
            [
                12285,
                12342
            ],
            [
                12342,
                12462
            ],
            [
                12462,
                12502
            ],
            [
                12502,
                12590
            ],
            [
                12590,
                12620
            ],
            [
                12620,
                12698
            ],
            [
                12698,
                12736
            ],
            [
                12736,
                12760
            ],
            [
                12760,
                12795
            ],
            [
                12795,
                12865
            ],
            [
                12865,
                12884
            ],
            [
                12884,
                13001
            ],
            [
                13001,
                13166
            ],
            [
                13166,
                13209
            ],
            [
                13209,
                13250
            ],
            [
                13250,
                13335
            ],
            [
                13335,
                13420
            ],
            [
                13420,
                13451
            ],
            [
                13451,
                13470
            ],
            [
                13470,
                13523
            ],
            [
                13523,
                13581
            ],
            [
                13581,
                13637
            ],
            [
                13637,
                13719
            ],
            [
                13719,
                13771
            ],
            [
                13771,
                13802
            ],
            [
                13802,
                13852
            ],
            [
                13852,
                13954
            ],
            [
                13954,
                13972
            ],
            [
                13972,
                14047
            ],
            [
                14047,
                14188
            ],
            [
                14188,
                14441
            ],
            [
                14441,
                14559
            ],
            [
                14559,
                14634
            ],
            [
                14634,
                14749
            ],
            [
                14749,
                14871
            ],
            [
                14871,
                14935
            ],
            [
                14935,
                15032
            ],
            [
                15032,
                15253
            ],
            [
                15253,
                15268
            ],
            [
                15268,
                15375
            ],
            [
                15375,
                15446
            ],
            [
                15446,
                15562
            ],
            [
                15562,
                15754
            ],
            [
                15754,
                15834
            ],
            [
                15834,
                16077
            ],
            [
                16077,
                16214
            ],
            [
                16214,
                16255
            ],
            [
                16255,
                16364
            ],
            [
                16364,
                16423
            ],
            [
                16423,
                16513
            ],
            [
                16513,
                16606
            ],
            [
                16606,
                16645
            ],
            [
                16645,
                16670
            ],
            [
                16670,
                16834
            ],
            [
                16834,
                16876
            ],
            [
                16876,
                16909
            ],
            [
                16909,
                16933
            ],
            [
                16933,
                16970
            ],
            [
                16970,
                17053
            ],
            [
                17053,
                17136
            ],
            [
                17136,
                17218
            ],
            [
                17218,
                17247
            ],
            [
                17247,
                17272
            ],
            [
                17272,
                17601
            ],
            [
                17601,
                17718
            ],
            [
                17718,
                17741
            ],
            [
                17741,
                17835
            ],
            [
                17835,
                18021
            ],
            [
                18021,
                18165
            ],
            [
                18165,
                18330
            ],
            [
                18330,
                18448
            ],
            [
                18448,
                18460
            ],
            [
                18460,
                18514
            ],
            [
                18514,
                18580
            ],
            [
                18580,
                18643
            ],
            [
                18643,
                18670
            ],
            [
                18670,
                18684
            ]
        ]
    },
    "abridged": {
        "text": "Hetta Carbury was very miserable after she decided that she had to divide herself altogether from Paul Montague. I think that she was irrational; but to her it seemed that the offence against her dignity as a woman was too great to be forgiven. There can be no doubt that it would have been forgiven with the greatest ease had Paul told the story before it had reached her ears from another source. If he had said to her, I once loved another woman, and that woman is here now in London, a trouble to me, persecuting me, and her history is so and so - you may be sure that she would not have been angry.\nBut he had been forced to confess rather than tell his own story, and to admit facts which had been concealed. It was that journey to Lowestoft, not yet a month old, which did the mischief. Paul had been staying at the seaside with this woman in amicable intimacy, and had been visiting her daily at Islington! Hetta felt quite sure that he had never passed a day without going there; and meanwhile had been behaving to herself in a manner which implied love for her. She had told herself that her heart was given away to this man; and yet he was spending his hours with a strange American woman, to whom he acknowledged that he had been once engaged. How could she not quarrel with him? She would never forgive him. She would break her heart for him.\nShe knew well what her mother wanted. Her mother thought that a quarrel with Montague would force her into a marriage with Roger Carbury. But her mother would find out that she was mistaken. Hetta would never marry her cousin, though she would always acknowledge his worth. She was sure now that she would never marry any man.\nWith what slow fingers, with what heartbroken tenderness did she take out from its case the brooch which Paul had given her! It had been his only present to her. Now it must be sent back; and, no doubt, it would go to that abominable woman! But her fingers lingered as she touched it, and she would fain have kissed it, had she not told herself that she would have been disgraced by such a demonstration of affection. As she would have no further personal correspondence with Paul Montague, she took the brooch to her mother with a request that it might be returned.\n\"Of course, my dear, I will send it back to him. Is there nothing else?\"\n\"No, mamma; nothing else. I have no letters, and no other present. You always knew everything that took place. If you will just send that back to him - without a word.\"\n\"He has behaved very, very badly, from the beginning,\" said Lady Carbury.\nBut Hetta certainly did not wish to be told of his misbehaviour. No doubt she thought that the young man had behaved very well in falling in love with her - only that he had behaved so badly in taking Mrs. Hurtle to Lowestoft afterwards!\n\"It's no good talking about that, mamma. I hope you will never talk of him any more.\"\n\"He is quite unworthy,\" said Lady Carbury.\n\"I can't bear to - have him - abused,\" said Hetta, sobbing.\n\"My dear Hetta, I have no doubt this has made you for the time unhappy. But you should endeavour not to be so sensitive about it. You have to look out for the future, and you can best do so by resolving that Paul Montague shall be forgotten at once.\"\n\"Oh, mamma, don't.\"\n\"But, my dear, there is more that I must say. Your future life is before you, and I must think of it. Of course you must be married.\"\n\"There is no of course at all.\"\n\"Of course you must be married,\" continued Lady Carbury, \"and of course it is your duty to think of the way in which this may be best done. My income is becoming less and less every day. I already owe money to your cousin, and I owe money to Mr. Broune.\"\n\"Money to Mr. Broune!\"\n\"Yes; I had to pay a sum for Felix. And I owe money to tradesmen. I fear that I shall not be able to keep this house. And they tell me - your cousin and Mr. Broune - that it is my duty to take Felix out of London, probably abroad.\"\n\"Of course I shall go with you.\"\n\"Perhaps that may not be necessary. What pleasure could you have in it? Think what my life must be with Felix in some French or German town!\"\n\"Mamma, why don't you let me be a comfort to you? Why do you speak of me always as though I were a burden?\"\n\"Everybody is a burden to other people. It is the way of life. But you - if you will only yield in ever so little - you may go where you will be no burden, where you will be accepted as a blessing. You have the opportunity of securing comfort for your whole life, not only for yourself, but for me and your brother.\"\n\"Mamma, you cannot really mean to talk about that now?\"\n\"Why not? Make up your mind to be the wife of your cousin Roger.\"\n\"This is horrid,\" said Hetta, bursting out in her agony. \"Cannot you understand that I am broken-hearted about Paul, that I love him from my very soul, that parting from him is like tearing my heart in pieces? I know that I must, because he has behaved so very badly - and because of that wicked woman! And so I have. But I did not think that in the very next hour you would bid me give myself to somebody else! I will never marry Roger Carbury. I shall never marry anyone. If you won't take me with you, I must stay behind and earn my bread. I suppose I could go out as a nurse.\" Without waiting for a reply she left the room.\nLady Carbury did not even understand her daughter. She could not conceive that she had in any way acted unkindly. She was simply anxious to get a husband for her child, so that she might live comfortably. But she felt that whenever she spoke common sense to Hetta, her daughter took it as an offence, and flew into tantrums. If there was anything that she could not forgive in life it was romance. And yet she believed that she delighted in romantic poetry!\nAt present she was very wretched; and was certainly unselfish in her wish to see her daughter comfortably settled before she commenced those miserable roamings with her son which seemed to be her destiny.\nIn these days she thought a good deal of Mr. Broune's offer, and of her own refusal. It was odd that since that refusal she had seen more of him than she ever had before. Previously their intimacy had been fictitious; they had played at being friends, knowing little of each other. But now, during the last five or six weeks since she had refused his offer, they had really learned to know each other. In her troubles, she had told him the truth about herself and her son, and he had responded, not by compliments, but by real aid and true counsel. His whole tone was altered to her, as was hers to him. There was no longer any flattery between them.\nIn consequence she almost regretted that she had allowed him to escape. But she certainly made no effort to recover the lost prize.\nIt was on that afternoon, after her disagreement with her daughter, that Marie Melmotte came to her. And, on that same evening, closeted with Mr. Broune, she told him of both occurrences.\n\"If the girl has got the money-\" she began.\n\"I don't believe it,\" said Broune. \"I don't think that there is any money. And if there is, you may be sure that Melmotte would not let it slip through his fingers. I would not have anything to do with it.\"\n\"You think it is all over with the Melmottes?\"\n\"He will have to stand trial for forgery, without a doubt, and I imagine that it will be found that not a shilling will be saved out of the property.\"\n\"What an extraordinary career it has been!\"\n\"Yes, the strangest thing that has come up in our days. He thought that he could conquer the world, and obtain universal credit. He very nearly succeeded too.\"\n\"You think he has committed forgery?\"\n\"I think so.\"\n\"Then I suppose it is better that Felix should not have married her.\"\n\"Certainly. I don't think you should regret the loss of such money as his.\"\nLady Carbury shook her head. Then she told him her grief about Hetta.\n\"Ah, there,\" said he, \"I feel less able to express an opinion.\"\n\"He doesn't owe a shilling,\" said Lady Carbury, \"and he is really a fine gentleman.\"\n\"But if she doesn't like him?\"\n\"Oh, but she does. She thinks him to be the finest person in the world. She would obey him a great deal sooner than she would me. But she has her mind stuffed with nonsense about love.\"\n\"A great many people, Lady Carbury, have their minds stuffed with that nonsense.\"\n\"Yes; and ruin themselves with it, as she will do. Love is like any other luxury. You have no right to it unless you can afford it.\"\nOn the following morning, very early, while Melmotte was still lying undiscovered on the floor of Mr. Longestaffe's room, a letter was brought up to Hetta by the maid-servant, who told her that Mr. Montague had delivered it.\nShe put it aside with assumed indifference. But as soon as the girl had left the room she seized her treasure. She opened it, and ran through its contents without allowing herself a moment for thinking whether the excuses made by her lover were such as she ought to accept.\nDearest Hetta,\nI think you have been most unjust to me. I have never deceived you in anything, not by a word, or for a moment. Unless you mean to throw me over because I did once love another woman, I do not know what cause of anger you have. I could not tell you about Mrs. Hurtle till you had accepted me, and then I had no opportunity to tell you till the story had reached your ears. I hardly know what I said the other day, I was so miserable at your accusation. But I suppose I said then, and I again declare now, that I had made up my mind that I could not marry her before I had ever seen you, and that I have never wavered in my determination. I can refer to Roger as to this, because I was with him when I so decided, and made up my mind very much at his instance. This was before I had ever even met you.\nIf I understand it right you are angry because I have associated with Mrs. Hurtle since then. I am not going back to my first acquaintance with her now. But, after what had occurred, was I to refuse to see her when she came to England to see me? I think that would have been cowardly. Of course I went to her. And when she was all alone here, without a single other friend, and telling me that she was unwell, and asking me to take her down to the seaside, was I to refuse? It was a dreadful trouble to me. But of course I did it.\nShe asked me to renew my engagement. I declined, telling her that I intended to ask another woman to be my wife. Of course there has been anger and sorrow - anger on her part and sorrow on mine. But there has been no doubt. And at last she yielded.\nOf course you do not know all the story, for I cannot tell you all without telling her history. But you know everything that concerns yourself, and I do say that you have no cause whatever for anger. I am writing at night. This evening your brooch was brought to me with three or four cutting words from your mother. But I cannot understand that if you really love me, you should wish to separate yourself from me - or that, if you ever loved me, you should cease to love me now because of Mrs. Hurtle.\nI am so absolutely confused by the blow that I hardly know what I am writing. My love for you is so thorough and so intense that I cannot bring myself to look forward to living without you. I cannot think it possible that your love could be made to cease all at a moment. Mine can't.\nIf you want corroboration of my story go yourself to Mrs. Hurtle. Anything is better than that we should both be broken-hearted.\nYours most affectionately,\nPaul Montague.",
        "paragraph_chars": [
            [
                0,
                604
            ],
            [
                604,
                1356
            ],
            [
                1356,
                1683
            ],
            [
                1683,
                2250
            ],
            [
                2250,
                2323
            ],
            [
                2323,
                2492
            ],
            [
                2492,
                2566
            ],
            [
                2566,
                2804
            ],
            [
                2804,
                2890
            ],
            [
                2890,
                2933
            ],
            [
                2933,
                2993
            ],
            [
                2993,
                3244
            ],
            [
                3244,
                3264
            ],
            [
                3264,
                3398
            ],
            [
                3398,
                3430
            ],
            [
                3430,
                3685
            ],
            [
                3685,
                3708
            ],
            [
                3708,
                3940
            ],
            [
                3940,
                3973
            ],
            [
                3973,
                4115
            ],
            [
                4115,
                4223
            ],
            [
                4223,
                4540
            ],
            [
                4540,
                4596
            ],
            [
                4596,
                4662
            ],
            [
                4662,
                5290
            ],
            [
                5290,
                5748
            ],
            [
                5748,
                5953
            ],
            [
                5953,
                6604
            ],
            [
                6604,
                6736
            ],
            [
                6736,
                6924
            ],
            [
                6924,
                6968
            ],
            [
                6968,
                7175
            ],
            [
                7175,
                7222
            ],
            [
                7222,
                7373
            ],
            [
                7373,
                7417
            ],
            [
                7417,
                7577
            ],
            [
                7577,
                7615
            ],
            [
                7615,
                7629
            ],
            [
                7629,
                7699
            ],
            [
                7699,
                7775
            ],
            [
                7775,
                7845
            ],
            [
                7845,
                7909
            ],
            [
                7909,
                7994
            ],
            [
                7994,
                8025
            ],
            [
                8025,
                8211
            ],
            [
                8211,
                8293
            ],
            [
                8293,
                8426
            ],
            [
                8426,
                8651
            ],
            [
                8651,
                8925
            ],
            [
                8925,
                8940
            ],
            [
                8940,
                9741
            ],
            [
                9741,
                10272
            ],
            [
                10272,
                10521
            ],
            [
                10521,
                11024
            ],
            [
                11024,
                11308
            ],
            [
                11308,
                11437
            ],
            [
                11437,
                11464
            ],
            [
                11464,
                11478
            ]
        ],
        "segment_chars": [
            [
                0,
                113
            ],
            [
                113,
                245
            ],
            [
                245,
                399
            ],
            [
                399,
                604
            ],
            [
                604,
                715
            ],
            [
                715,
                794
            ],
            [
                794,
                915
            ],
            [
                915,
                1072
            ],
            [
                1072,
                1256
            ],
            [
                1256,
                1292
            ],
            [
                1292,
                1321
            ],
            [
                1321,
                1356
            ],
            [
                1356,
                1394
            ],
            [
                1394,
                1494
            ],
            [
                1494,
                1547
            ],
            [
                1547,
                1630
            ],
            [
                1630,
                1683
            ],
            [
                1683,
                1808
            ],
            [
                1808,
                1845
            ],
            [
                1845,
                1924
            ],
            [
                1924,
                2101
            ],
            [
                2101,
                2250
            ],
            [
                2250,
                2299
            ],
            [
                2299,
                2323
            ],
            [
                2323,
                2349
            ],
            [
                2349,
                2390
            ],
            [
                2390,
                2434
            ],
            [
                2434,
                2492
            ],
            [
                2492,
                2566
            ],
            [
                2566,
                2631
            ],
            [
                2631,
                2804
            ],
            [
                2804,
                2845
            ],
            [
                2845,
                2890
            ],
            [
                2890,
                2933
            ],
            [
                2933,
                2993
            ],
            [
                2993,
                3065
            ],
            [
                3065,
                3123
            ],
            [
                3123,
                3244
            ],
            [
                3244,
                3264
            ],
            [
                3264,
                3310
            ],
            [
                3310,
                3366
            ],
            [
                3366,
                3398
            ],
            [
                3398,
                3430
            ],
            [
                3430,
                3570
            ],
            [
                3570,
                3617
            ],
            [
                3617,
                3685
            ],
            [
                3685,
                3708
            ],
            [
                3708,
                3744
            ],
            [
                3744,
                3774
            ],
            [
                3774,
                3826
            ],
            [
                3826,
                3940
            ],
            [
                3940,
                3973
            ],
            [
                3973,
                4009
            ],
            [
                4009,
                4045
            ],
            [
                4045,
                4115
            ],
            [
                4115,
                4165
            ],
            [
                4165,
                4223
            ],
            [
                4223,
                4263
            ],
            [
                4263,
                4286
            ],
            [
                4286,
                4421
            ],
            [
                4421,
                4540
            ],
            [
                4540,
                4596
            ],
            [
                4596,
                4606
            ],
            [
                4606,
                4662
            ],
            [
                4662,
                4719
            ],
            [
                4719,
                4872
            ],
            [
                4872,
                4965
            ],
            [
                4965,
                4980
            ],
            [
                4980,
                5074
            ],
            [
                5074,
                5108
            ],
            [
                5108,
                5136
            ],
            [
                5136,
                5205
            ],
            [
                5205,
                5243
            ],
            [
                5243,
                5290
            ],
            [
                5290,
                5341
            ],
            [
                5341,
                5404
            ],
            [
                5404,
                5495
            ],
            [
                5495,
                5615
            ],
            [
                5615,
                5688
            ],
            [
                5688,
                5748
            ],
            [
                5748,
                5953
            ],
            [
                5953,
                6038
            ],
            [
                6038,
                6124
            ],
            [
                6124,
                6235
            ],
            [
                6235,
                6355
            ],
            [
                6355,
                6502
            ],
            [
                6502,
                6557
            ],
            [
                6557,
                6604
            ],
            [
                6604,
                6676
            ],
            [
                6676,
                6736
            ],
            [
                6736,
                6837
            ],
            [
                6837,
                6924
            ],
            [
                6924,
                6968
            ],
            [
                6968,
                7003
            ],
            [
                7003,
                7043
            ],
            [
                7043,
                7133
            ],
            [
                7133,
                7175
            ],
            [
                7175,
                7222
            ],
            [
                7222,
                7373
            ],
            [
                7373,
                7417
            ],
            [
                7417,
                7473
            ],
            [
                7473,
                7546
            ],
            [
                7546,
                7577
            ],
            [
                7577,
                7615
            ],
            [
                7615,
                7629
            ],
            [
                7629,
                7699
            ],
            [
                7699,
                7711
            ],
            [
                7711,
                7775
            ],
            [
                7775,
                7804
            ],
            [
                7804,
                7845
            ],
            [
                7845,
                7909
            ],
            [
                7909,
                7994
            ],
            [
                7994,
                8025
            ],
            [
                8025,
                8044
            ],
            [
                8044,
                8097
            ],
            [
                8097,
                8155
            ],
            [
                8155,
                8211
            ],
            [
                8211,
                8293
            ],
            [
                8293,
                8344
            ],
            [
                8344,
                8375
            ],
            [
                8375,
                8426
            ],
            [
                8426,
                8651
            ],
            [
                8651,
                8695
            ],
            [
                8695,
                8762
            ],
            [
                8762,
                8925
            ],
            [
                8925,
                8940
            ],
            [
                8940,
                8981
            ],
            [
                8981,
                9052
            ],
            [
                9052,
                9168
            ],
            [
                9168,
                9313
            ],
            [
                9313,
                9393
            ],
            [
                9393,
                9578
            ],
            [
                9578,
                9700
            ],
            [
                9700,
                9741
            ],
            [
                9741,
                9835
            ],
            [
                9835,
                9894
            ],
            [
                9894,
                9987
            ],
            [
                9987,
                10026
            ],
            [
                10026,
                10051
            ],
            [
                10051,
                10215
            ],
            [
                10215,
                10248
            ],
            [
                10248,
                10272
            ],
            [
                10272,
                10309
            ],
            [
                10309,
                10385
            ],
            [
                10385,
                10467
            ],
            [
                10467,
                10496
            ],
            [
                10496,
                10521
            ],
            [
                10521,
                10617
            ],
            [
                10617,
                10721
            ],
            [
                10721,
                10744
            ],
            [
                10744,
                10838
            ],
            [
                10838,
                11024
            ],
            [
                11024,
                11102
            ],
            [
                11102,
                11214
            ],
            [
                11214,
                11296
            ],
            [
                11296,
                11308
            ],
            [
                11308,
                11374
            ],
            [
                11374,
                11437
            ],
            [
                11437,
                11464
            ],
            [
                11464,
                11478
            ]
        ],
        "overlap_chars": [
            [
                4,
                5
            ],
            [
                6,
                17
            ],
            [
                18,
                32
            ],
            [
                39,
                55
            ],
            [
                64,
                113
            ],
            [
                113,
                191
            ],
            [
                192,
                195
            ],
            [
                196,
                214
            ],
            [
                215,
                245
            ],
            [
                245,
                280
            ],
            [
                281,
                382
            ],
            [
                391,
                399
            ],
            [
                402,
                404
            ],
            [
                405,
                408
            ],
            [
                409,
                421
            ],
            [
                422,
                549
            ],
            [
                552,
                567
            ],
            [
                568,
                572
            ],
            [
                577,
                596
            ],
            [
                602,
                603
            ],
            [
                608,
                610
            ],
            [
                611,
                614
            ],
            [
                615,
                619
            ],
            [
                620,
                626
            ],
            [
                627,
                649
            ],
            [
                650,
                669
            ],
            [
                670,
                694
            ],
            [
                699,
                713
            ],
            [
                713,
                715
            ],
            [
                715,
                792
            ],
            [
                792,
                794
            ],
            [
                794,
                868
            ],
            [
                869,
                915
            ],
            [
                915,
                987
            ],
            [
                987,
                992
            ],
            [
                1003,
                1011
            ],
            [
                1012,
                1023
            ],
            [
                1024,
                1031
            ],
            [
                1032,
                1043
            ],
            [
                1058,
                1062
            ],
            [
                1067,
                1072
            ],
            [
                1072,
                1079
            ],
            [
                1080,
                1092
            ],
            [
                1093,
                1143
            ],
            [
                1147,
                1169
            ],
            [
                1170,
                1256
            ],
            [
                1256,
                1292
            ],
            [
                1292,
                1321
            ],
            [
                1321,
                1355
            ],
            [
                1356,
                1374
            ],
            [
                1375,
                1394
            ],
            [
                1394,
                1417
            ],
            [
                1418,
                1441
            ],
            [
                1442,
                1457
            ],
            [
                1458,
                1494
            ],
            [
                1494,
                1528
            ],
            [
                1529,
                1547
            ],
            [
                1553,
                1599
            ],
            [
                1600,
                1606
            ],
            [
                1607,
                1630
            ],
            [
                1630,
                1682
            ],
            [
                1683,
                1697
            ],
            [
                1698,
                1765
            ],
            [
                1766,
                1808
            ],
            [
                1808,
                1814
            ],
            [
                1815,
                1819
            ],
            [
                1824,
                1836
            ],
            [
                1837,
                1843
            ],
            [
                1843,
                1845
            ],
            [
                1845,
                1870
            ],
            [
                1871,
                1924
            ],
            [
                1924,
                1948
            ],
            [
                1949,
                2062
            ],
            [
                2063,
                2101
            ],
            [
                2101,
                2158
            ],
            [
                2159,
                2172
            ],
            [
                2172,
                2250
            ],
            [
                2250,
                2299
            ],
            [
                2299,
                2323
            ],
            [
                2323,
                2334
            ],
            [
                2335,
                2349
            ],
            [
                2349,
                2390
            ],
            [
                2390,
                2434
            ],
            [
                2434,
                2472
            ],
            [
                2475,
                2489
            ],
            [
                2492,
                2525
            ],
            [
                2526,
                2566
            ],
            [
                2566,
                2575
            ],
            [
                2576,
                2631
            ],
            [
                2631,
                2720
            ],
            [
                2723,
                2803
            ],
            [
                2804,
                2845
            ],
            [
                2845,
                2890
            ],
            [
                2890,
                2933
            ],
            [
                2933,
                2949
            ],
            [
                2952,
                2960
            ],
            [
                2969,
                2982
            ],
            [
                2984,
                2993
            ],
            [
                2993,
                3065
            ],
            [
                3065,
                3068
            ],
            [
                3069,
                3123
            ],
            [
                3123,
                3244
            ],
            [
                3244,
                3261
            ],
            [
                3264,
                3310
            ],
            [
                3310,
                3364
            ],
            [
                3364,
                3366
            ],
            [
                3366,
                3398
            ],
            [
                3398,
                3430
            ],
            [
                3430,
                3570
            ],
            [
                3570,
                3617
            ],
            [
                3617,
                3685
            ],
            [
                3685,
                3708
            ],
            [
                3708,
                3712
            ],
            [
                3714,
                3742
            ],
            [
                3742,
                3744
            ],
            [
                3744,
                3774
            ],
            [
                3774,
                3813
            ],
            [
                3814,
                3826
            ],
            [
                3826,
                3842
            ],
            [
                3845,
                3871
            ],
            [
                3874,
                3921
            ],
            [
                3922,
                3940
            ],
            [
                3940,
                3973
            ],
            [
                3973,
                3974
            ],
            [
                3974,
                3981
            ],
            [
                3982,
                4009
            ],
            [
                4009,
                4045
            ],
            [
                4045,
                4115
            ],
            [
                4115,
                4165
            ],
            [
                4165,
                4223
            ],
            [
                4223,
                4263
            ],
            [
                4263,
                4286
            ],
            [
                4286,
                4293
            ],
            [
                4296,
                4336
            ],
            [
                4339,
                4405
            ],
            [
                4406,
                4421
            ],
            [
                4421,
                4486
            ],
            [
                4487,
                4537
            ],
            [
                4537,
                4540
            ],
            [
                4540,
                4596
            ],
            [
                4596,
                4600
            ],
            [
                4601,
                4604
            ],
            [
                4604,
                4606
            ],
            [
                4606,
                4662
            ],
            [
                4662,
                4719
            ],
            [
                4719,
                4872
            ],
            [
                4872,
                4928
            ],
            [
                4931,
                4965
            ],
            [
                4965,
                4980
            ],
            [
                4980,
                5074
            ],
            [
                5074,
                5108
            ],
            [
                5108,
                5127
            ],
            [
                5134,
                5136
            ],
            [
                5136,
                5165
            ],
            [
                5165,
                5189
            ],
            [
                5190,
                5205
            ],
            [
                5205,
                5243
            ],
            [
                5243,
                5288
            ],
            [
                5288,
                5290
            ],
            [
                5290,
                5341
            ],
            [
                5341,
                5402
            ],
            [
                5402,
                5404
            ],
            [
                5404,
                5451
            ],
            [
                5452,
                5457
            ],
            [
                5457,
                5458
            ],
            [
                5462,
                5466
            ],
            [
                5467,
                5470
            ],
            [
                5471,
                5495
            ],
            [
                5495,
                5613
            ],
            [
                5613,
                5615
            ],
            [
                5615,
                5688
            ],
            [
                5688,
                5699
            ],
            [
                5700,
                5747
            ],
            [
                5748,
                5750
            ],
            [
                5751,
                5758
            ],
            [
                5759,
                5943
            ],
            [
                5944,
                5953
            ],
            [
                5953,
                6038
            ],
            [
                6038,
                6097
            ],
            [
                6098,
                6106
            ],
            [
                6107,
                6111
            ],
            [
                6112,
                6115
            ],
            [
                6116,
                6124
            ],
            [
                6124,
                6127
            ],
            [
                6135,
                6158
            ],
            [
                6159,
                6169
            ],
            [
                6171,
                6212
            ],
            [
                6213,
                6235
            ],
            [
                6235,
                6277
            ],
            [
                6278,
                6310
            ],
            [
                6311,
                6355
            ],
            [
                6355,
                6357
            ],
            [
                6358,
                6502
            ],
            [
                6502,
                6557
            ],
            [
                6557,
                6580
            ],
            [
                6581,
                6602
            ],
            [
                6602,
                6603
            ],
            [
                6607,
                6618
            ],
            [
                6619,
                6676
            ],
            [
                6676,
                6734
            ],
            [
                6734,
                6735
            ],
            [
                6736,
                6837
            ],
            [
                6837,
                6888
            ],
            [
                6888,
                6923
            ],
            [
                6924,
                6954
            ],
            [
                6957,
                6966
            ],
            [
                6966,
                6968
            ],
            [
                6968,
                6984
            ],
            [
                6985,
                7003
            ],
            [
                7003,
                7004
            ],
            [
                7004,
                7043
            ],
            [
                7043,
                7131
            ],
            [
                7131,
                7133
            ],
            [
                7133,
                7175
            ],
            [
                7175,
                7222
            ],
            [
                7223,
                7244
            ],
            [
                7245,
                7263
            ],
            [
                7272,
                7373
            ],
            [
                7373,
                7378
            ],
            [
                7396,
                7417
            ],
            [
                7417,
                7422
            ],
            [
                7423,
                7473
            ],
            [
                7473,
                7515
            ],
            [
                7515,
                7546
            ],
            [
                7546,
                7574
            ],
            [
                7577,
                7615
            ],
            [
                7615,
                7616
            ],
            [
                7616,
                7626
            ],
            [
                7629,
                7699
            ],
            [
                7699,
                7709
            ],
            [
                7709,
                7711
            ],
            [
                7711,
                7774
            ],
            [
                7775,
                7802
            ],
            [
                7802,
                7804
            ],
            [
                7804,
                7844
            ],
            [
                7845,
                7874
            ],
            [
                7875,
                7898
            ],
            [
                7899,
                7909
            ],
            [
                7909,
                7994
            ],
            [
                7994,
                8025
            ],
            [
                8025,
                8044
            ],
            [
                8044,
                8097
            ],
            [
                8097,
                8155
            ],
            [
                8155,
                8211
            ],
            [
                8211,
                8293
            ],
            [
                8293,
                8298
            ],
            [
                8299,
                8344
            ],
            [
                8344,
                8375
            ],
            [
                8375,
                8423
            ],
            [
                8426,
                8494
            ],
            [
                8495,
                8507
            ],
            [
                8508,
                8649
            ],
            [
                8649,
                8650
            ],
            [
                8651,
                8654
            ],
            [
                8655,
                8661
            ],
            [
                8668,
                8672
            ],
            [
                8673,
                8680
            ],
            [
                8681,
                8693
            ],
            [
                8693,
                8695
            ],
            [
                8695,
                8740
            ],
            [
                8741,
                8762
            ],
            [
                8762,
                8780
            ],
            [
                8781,
                8852
            ],
            [
                8853,
                8895
            ],
            [
                8896,
                8925
            ],
            [
                8925,
                8940
            ],
            [
                8940,
                8979
            ],
            [
                8979,
                8981
            ],
            [
                8981,
                9052
            ],
            [
                9052,
                9168
            ],
            [
                9168,
                9236
            ],
            [
                9242,
                9243
            ],
            [
                9244,
                9274
            ],
            [
                9275,
                9313
            ],
            [
                9313,
                9393
            ],
            [
                9393,
                9476
            ],
            [
                9477,
                9478
            ],
            [
                9485,
                9488
            ],
            [
                9495,
                9498
            ],
            [
                9499,
                9542
            ],
            [
                9543,
                9576
            ],
            [
                9576,
                9578
            ],
            [
                9578,
                9583
            ],
            [
                9584,
                9643
            ],
            [
                9651,
                9700
            ],
            [
                9700,
                9741
            ],
            [
                9741,
                9759
            ],
            [
                9760,
                9828
            ],
            [
                9833,
                9835
            ],
            [
                9835,
                9894
            ],
            [
                9894,
                9987
            ],
            [
                9987,
                10026
            ],
            [
                10026,
                10051
            ],
            [
                10051,
                10215
            ],
            [
                10215,
                10248
            ],
            [
                10248,
                10272
            ],
            [
                10272,
                10309
            ],
            [
                10309,
                10337
            ],
            [
                10349,
                10385
            ],
            [
                10385,
                10426
            ],
            [
                10429,
                10467
            ],
            [
                10467,
                10496
            ],
            [
                10496,
                10520
            ],
            [
                10521,
                10546
            ],
            [
                10547,
                10550
            ],
            [
                10551,
                10560
            ],
            [
                10560,
                10617
            ],
            [
                10617,
                10645
            ],
            [
                10646,
                10721
            ],
            [
                10721,
                10744
            ],
            [
                10744,
                10838
            ],
            [
                10838,
                10934
            ],
            [
                10937,
                11024
            ],
            [
                11024,
                11100
            ],
            [
                11100,
                11102
            ],
            [
                11102,
                11212
            ],
            [
                11212,
                11214
            ],
            [
                11214,
                11245
            ],
            [
                11251,
                11255
            ],
            [
                11256,
                11296
            ],
            [
                11296,
                11307
            ],
            [
                11308,
                11374
            ],
            [
                11374,
                11405
            ],
            [
                11406,
                11412
            ],
            [
                11413,
                11417
            ],
            [
                11418,
                11437
            ],
            [
                11437,
                11464
            ],
            [
                11464,
                11478
            ]
        ],
        "row_chars": [
            [
                0,
                113
            ],
            [
                113,
                245
            ],
            [
                245,
                399
            ],
            [
                399,
                604
            ],
            [
                604,
                604
            ],
            [
                604,
                715
            ],
            [
                715,
                794
            ],
            [
                794,
                915
            ],
            [
                915,
                1072
            ],
            [
                1072,
                1072
            ],
            [
                1072,
                1072
            ],
            [
                1072,
                1256
            ],
            [
                1256,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1321
            ],
            [
                1321,
                1356
            ],
            [
                1356,
                1356
            ],
            [
                1356,
                1394
            ],
            [
                1394,
                1494
            ],
            [
                1494,
                1547
            ],
            [
                1547,
                1630
            ],
            [
                1630,
                1683
            ],
            [
                1683,
                1683
            ],
            [
                1683,
                1808
            ],
            [
                1808,
                1845
            ],
            [
                1845,
                1924
            ],
            [
                1924,
                2101
            ],
            [
                2101,
                2250
            ],
            [
                2250,
                2299
            ],
            [
                2299,
                2323
            ],
            [
                2323,
                2349
            ],
            [
                2349,
                2390
            ],
            [
                2390,
                2434
            ],
            [
                2434,
                2492
            ],
            [
                2492,
                2492
            ],
            [
                2492,
                2492
            ],
            [
                2492,
                2492
            ],
            [
                2492,
                2492
            ],
            [
                2492,
                2566
            ],
            [
                2566,
                2631
            ],
            [
                2631,
                2804
            ],
            [
                2804,
                2845
            ],
            [
                2845,
                2890
            ],
            [
                2890,
                2933
            ],
            [
                2933,
                2993
            ],
            [
                2993,
                3065
            ],
            [
                3065,
                3065
            ],
            [
                3065,
                3123
            ],
            [
                3123,
                3123
            ],
            [
                3123,
                3244
            ],
            [
                3244,
                3264
            ],
            [
                3264,
                3264
            ],
            [
                3264,
                3264
            ],
            [
                3264,
                3310
            ],
            [
                3310,
                3366
            ],
            [
                3366,
                3398
            ],
            [
                3398,
                3430
            ],
            [
                3430,
                3570
            ],
            [
                3570,
                3617
            ],
            [
                3617,
                3685
            ],
            [
                3685,
                3708
            ],
            [
                3708,
                3744
            ],
            [
                3744,
                3774
            ],
            [
                3774,
                3826
            ],
            [
                3826,
                3940
            ],
            [
                3940,
                3973
            ],
            [
                3973,
                4009
            ],
            [
                4009,
                4009
            ],
            [
                4009,
                4045
            ],
            [
                4045,
                4115
            ],
            [
                4115,
                4165
            ],
            [
                4165,
                4223
            ],
            [
                4223,
                4263
            ],
            [
                4263,
                4286
            ],
            [
                4286,
                4421
            ],
            [
                4421,
                4540
            ],
            [
                4540,
                4596
            ],
            [
                4596,
                4606
            ],
            [
                4606,
                4606
            ],
            [
                4606,
                4662
            ],
            [
                4662,
                4719
            ],
            [
                4719,
                4872
            ],
            [
                4872,
                4965
            ],
            [
                4965,
                4980
            ],
            [
                4980,
                5074
            ],
            [
                5074,
                5108
            ],
            [
                5108,
                5136
            ],
            [
                5136,
                5205
            ],
            [
                5205,
                5243
            ],
            [
                5243,
                5290
            ],
            [
                5290,
                5341
            ],
            [
                5341,
                5404
            ],
            [
                5404,
                5495
            ],
            [
                5495,
                5615
            ],
            [
                5615,
                5615
            ],
            [
                5615,
                5688
            ],
            [
                5688,
                5748
            ],
            [
                5748,
                5953
            ],
            [
                5953,
                6038
            ],
            [
                6038,
                6124
            ],
            [
                6124,
                6235
            ],
            [
                6235,
                6355
            ],
            [
                6355,
                6502
            ],
            [
                6502,
                6557
            ],
            [
                6557,
                6604
            ],
            [
                6604,
                6604
            ],
            [
                6604,
                6676
            ],
            [
                6676,
                6736
            ],
            [
                6736,
                6837
            ],
            [
                6837,
                6924
            ],
            [
                6924,
                6968
            ],
            [
                6968,
                7003
            ],
            [
                7003,
                7043
            ],
            [
                7043,
                7133
            ],
            [
                7133,
                7175
            ],
            [
                7175,
                7222
            ],
            [
                7222,
                7222
            ],
            [
                7222,
                7222
            ],
            [
                7222,
                7222
            ],
            [
                7222,
                7373
            ],
            [
                7373,
                7417
            ],
            [
                7417,
                7473
            ],
            [
                7473,
                7473
            ],
            [
                7473,
                7473
            ],
            [
                7473,
                7546
            ],
            [
                7546,
                7577
            ],
            [
                7577,
                7577
            ],
            [
                7577,
                7615
            ],
            [
                7615,
                7629
            ],
            [
                7629,
                7629
            ],
            [
                7629,
                7699
            ],
            [
                7699,
                7711
            ],
            [
                7711,
                7775
            ],
            [
                7775,
                7804
            ],
            [
                7804,
                7804
            ],
            [
                7804,
                7845
            ],
            [
                7845,
                7909
            ],
            [
                7909,
                7994
            ],
            [
                7994,
                8025
            ],
            [
                8025,
                8044
            ],
            [
                8044,
                8097
            ],
            [
                8097,
                8155
            ],
            [
                8155,
                8211
            ],
            [
                8211,
                8293
            ],
            [
                8293,
                8344
            ],
            [
                8344,
                8375
            ],
            [
                8375,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8651
            ],
            [
                8651,
                8695
            ],
            [
                8695,
                8762
            ],
            [
                8762,
                8762
            ],
            [
                8762,
                8762
            ],
            [
                8762,
                8762
            ],
            [
                8762,
                8762
            ],
            [
                8762,
                8925
            ],
            [
                8925,
                8940
            ],
            [
                8940,
                8981
            ],
            [
                8981,
                9052
            ],
            [
                9052,
                9168
            ],
            [
                9168,
                9313
            ],
            [
                9313,
                9393
            ],
            [
                9393,
                9578
            ],
            [
                9578,
                9700
            ],
            [
                9700,
                9741
            ],
            [
                9741,
                9835
            ],
            [
                9835,
                9894
            ],
            [
                9894,
                9894
            ],
            [
                9894,
                9987
            ],
            [
                9987,
                10026
            ],
            [
                10026,
                10051
            ],
            [
                10051,
                10215
            ],
            [
                10215,
                10215
            ],
            [
                10215,
                10248
            ],
            [
                10248,
                10272
            ],
            [
                10272,
                10309
            ],
            [
                10309,
                10309
            ],
            [
                10309,
                10385
            ],
            [
                10385,
                10467
            ],
            [
                10467,
                10496
            ],
            [
                10496,
                10521
            ],
            [
                10521,
                10617
            ],
            [
                10617,
                10721
            ],
            [
                10721,
                10744
            ],
            [
                10744,
                10838
            ],
            [
                10838,
                11024
            ],
            [
                11024,
                11102
            ],
            [
                11102,
                11214
            ],
            [
                11214,
                11296
            ],
            [
                11296,
                11308
            ],
            [
                11308,
                11308
            ],
            [
                11308,
                11374
            ],
            [
                11374,
                11437
            ],
            [
                11437,
                11464
            ],
            [
                11464,
                11478
            ]
        ]
    }
}