{
    "original": {
        "text": "When Roger Carbury returned to Suffolk, after seeing his cousins in Welbeck Street, he was by no means contented with himself. That he should be discontented generally with the circumstances of his life was a matter of course. He knew that he was farther removed than ever from the object on which his whole mind was set. Had Hetta Carbury learned all the circumstances of Paul's engagement with Mrs. Hurtle before she had confessed her love to Paul,--so that her heart might have been turned against the man before she had made her confession,--then, he thought, she might at last have listened to him. Even though she had loved the other man, she might have at last done so, as her love would have been buried in her own bosom. But the tale had been told after the fashion which was most antagonistic to his own interests. Hetta had never heard Mrs. Hurtle's name till she had given herself away, and had declared to all her friends that she had given herself away to this man, who was so unworthy of her. The more Roger thought of this, the more angry he was with Paul Montague, and the more convinced that that man had done him an injury which he could never forgive.\nBut his grief extended even beyond that. Though he was never tired of swearing to himself that he would not forgive Paul Montague, yet there was present to him a feeling that an injury was being done to the man, and that he was in some sort responsible for that injury. He had declined to tell Hetta any part of the story about Mrs. Hurtle,--actuated by a feeling that he ought not to betray the trust put in him by a man who was at the time his friend; and he had told nothing. But no one knew so well as he did the fact that all the attention latterly given by Paul to the American woman had by no means been the effect of love, but had come from a feeling on Paul's part that he could not desert the woman he had once loved, when she asked him for his kindness. If Hetta could know everything exactly,--if she could look back and read the state of Paul's mind as he, Roger, could read it,--then she would probably forgive the man, or perhaps tell herself that there was nothing for her to forgive. Roger was anxious that Hetta's anger should burn hot,--because of the injury done to himself. He thought that there were ample reasons why Paul Montague should be punished,--why Paul should be utterly expelled from among them, and allowed to go his own course. But it was not right that the man should be punished on false grounds. It seemed to Roger now that he was doing an injustice to his enemy by refraining from telling all that he knew.\nAs to the girl's misery in losing her lover, much as he loved her, true as it was that he was willing to devote himself and all that he had to her happiness, I do not think that at the present moment he was disturbed in that direction. It is hardly natural, perhaps, that a man should love a woman with such devotion as to wish to make her happy by giving her to another man. Roger told himself that Paul would be an unsafe husband, a fickle husband,--one who might be carried hither and thither both in his circumstances and his feelings,--and that it would be better for Hetta that she should not marry him; but at the same time he was unhappy as he reflected that he himself was a party to a certain amount of deceit.\nAnd yet he had said not a word. He had referred Hetta to the man himself. He thought that he knew, and he did indeed accurately know, the state of Hetta's mind. She was wretched because she thought that while her lover was winning her love, while she herself was willingly allowing him to win her love, he was dallying with another woman, and making to that other woman promises the same as those he made to her. This was not true. Roger knew that it was not true. But when he tried to quiet his conscience by saying that they must fight it out among themselves, he felt himself to be uneasy under that assurance.\nHis life at Carbury, at this time, was very desolate. He had become tired of the priest, who, in spite of various repulses, had never for a moment relaxed his efforts to convert his friend. Roger had told him once that he must beg that religion might not be made the subject of further conversation between them. In answer to this, Father Barham had declared that he would never consent to remain as an intimate associate with any man on those terms. Roger had persisted in his stipulation, and the priest had then suggested that it was his host's intention to banish him from Carbury Hall. Roger had made no reply, and the priest had of course been banished. But even this added to his misery. Father Barham was a gentleman, was a good man, and in great penury. To ill-treat such a one, to expel such a one from his house, seemed to Roger to be an abominable cruelty. He was unhappy with himself about the priest, and yet he could not bid the man come back to him. It was already being said of him among his neighbours, at Eardly, at Caversham, and at the Bishop's palace, that he either had become or was becoming a Roman Catholic, under the priest's influence. Mrs. Yeld had even taken upon herself to write to him a most affectionate letter, in which she said very little as to any evidence that had reached her as to Roger's defection, but dilated at very great length on the abominations of a certain lady who is supposed to indulge in gorgeous colours.\nHe was troubled, too, about old Daniel Ruggles, the farmer at Sheep's Acre, who had been so angry because his niece would not marry John Crumb. Old Ruggles, when abandoned by Ruby and accused by his neighbours of personal cruelty to the girl, had taken freely to that source of consolation which he found to be most easily within his reach. Since Ruby had gone he had been drunk every day, and was making himself generally a scandal and a nuisance. His landlord had interfered with his usual kindness, and the old man had always declared that his niece and John Crumb were the cause of it all; for now, in his maudlin misery, he attributed as much blame to the lover as he did to the girl. John Crumb wasn't in earnest. If he had been in earnest he would have gone after her to London at once. No;--he wouldn't invite Ruby to come back. If Ruby would come back, repentant, full of sorrow,--and hadn't been and made a fool of herself in the meantime,--then he'd think of taking her back. In the meantime, with circumstances in their present condition, he evidently thought that he could best face the difficulties of the world by an unfaltering adhesion to gin, early in the day and all day long. This, too, was a grievance to Roger Carbury.\nBut he did not neglect his work, the chief of which at the present moment was the care of the farm which he kept in his own hands. He was making hay at this time in certain meadows down by the river side; and was standing by while the men were loading a cart, when he saw John Crumb approaching across the field. He had not seen John since the eventful journey to London; nor had he seen him in London; but he knew well all that had occurred,--how the dealer in pollard had thrashed his cousin, Sir Felix, how he had been locked up by the police and then liberated,--and how he was now regarded in Bungay as a hero, as far as arms were concerned, but as being very \"soft\" in the matter of love. The reader need hardly be told that Roger was not at all disposed to quarrel with Mr. Crumb, because the victim of Crumb's heroism had been his own cousin. Crumb had acted well, and had never said a word about Sir Felix since his return to the country. No doubt he had now come to talk about his love,--and in order that his confessions might not be made before all the assembled haymakers, Roger Carbury hurried to meet him. There was soon evident on Crumb's broad face a whole sunshine of delight. As Roger approached him he began to laugh aloud, and to wave a bit of paper that he had in his hands. \"She's a coomin; she's a coomin,\" were the first words he uttered. Roger knew very well that in his friend's mind there was but one \"she\" in the world, and that the name of that she was Ruby Ruggles.\n[Illustration: \"She's a coomin; she's a coomin.\"]\n\"I am delighted to hear it,\" said Roger. \"She has made it up with her grandfather?\"\n\"Don't know now't about grandfeyther. She have made it up wi' me. Know'd she would when I'd polish'd t'other un off a bit;--know'd she would.\"\n\"Has she written to you, then?\"\n\"Well, squoire,--she ain't; not just herself. I do suppose that isn't the way they does it. But it's all as one.\" And then Mr. Crumb thrust Mrs. Hurtle's note into Roger Carbury's hand.\nRoger certainly was not predisposed to think well or kindly of Mrs. Hurtle. Since he had first known Mrs. Hurtle's name, when Paul Montague had told the story of his engagement on his return from America, Roger had regarded her as a wicked, intriguing, bad woman. It may, perhaps, be confessed that he was prejudiced against all Americans, looking upon Washington much as he did upon Jack Cade or Wat Tyler; and he pictured to himself all American women as being loud, masculine, and atheistical. But it certainly did seem that in this instance Mrs. Hurtle was endeavouring to do a good turn from pure charity. \"She is a lady,\" Crumb began to explain, \"who do be living with Mrs. Pipkin; and she is a lady as is a lady.\"\nRoger could not fully admit the truth of this assertion; but he explained that he, too, knew something of Mrs. Hurtle, and that he thought it probable that what she said of Ruby might be true. \"True, squoire!\" said Crumb, laughing with his whole face. \"I ha' nae a doubt it's true. What's again its being true? When I had dropped into t'other fellow, of course she made her choice. It was me as was to blame, because I didn't do it before. I ought to ha' dropped into him when I first heard as he was arter her. It's that as girls like. So, squoire, I'm just going again to Lon'on right away.\"\nRoger suggested that old Ruggles would, of course, receive his niece; but as to this John expressed his supreme indifference. The old man was nothing to him. Of course he would like to have the old man's money; but the old man couldn't live for ever, and he supposed that things would come right in time. But this he knew,--that he wasn't going to cringe to the old man about his money. When Roger observed that it would be better that Ruby should have some home to which she might at once return, John adverted with a renewed grin to all the substantial comforts of his own house. It seemed to be his idea, that on arriving in London he would at once take Ruby away to church and be married to her out of hand. He had thrashed his rival, and what cause could there now be for delay?\nBut before he left the field he made one other speech to the squire. \"You ain't a'taken it amiss, squoire, 'cause he was coosin to yourself?\"\n\"Not in the least, Mr. Crumb.\"\n\"That's koind now. I ain't a done the yong man a ha'porth o' harm, and I don't feel no grudge again him, and when me and Ruby's once spliced, I'm darned if I don't give 'un a bottle of wine the first day as he'll come to Bungay.\"\nRoger did not feel himself justified in accepting this invitation on the part of Sir Felix; but he renewed his assurance that he, on his own part, thought that Crumb had behaved well in that matter of the street encounter, and he expressed a strong wish for the immediate and continued happiness of Mr. and Mrs. John Crumb.\n\"Oh, ay, we'll be 'appy, squoire,\" said Crumb as he went exulting out of the field.\nOn the day after this Roger Carbury received a letter which disturbed him very much, and to which he hardly knew whether to return any answer, or what answer. It was from Paul Montague, and was written by him but a few hours after he had left his letter for Hetta with his own hands, at the door of her mother's house. Paul's letter to Roger was as follows:--\nMY DEAR ROGER,--\nThough I know that you have cast me off from you I cannot write to you in any other way, as any other way would be untrue. You can answer me, of course, as you please, but I do think that you will owe me an answer, as I appeal to you in the name of justice.\nYou know what has taken place between Hetta and myself. She had accepted me, and therefore I am justified in feeling sure that she must have loved me. But she has now quarrelled with me altogether, and has told me that I am never to see her again. Of course I don't mean to put up with this. Who would? You will say that it is no business of yours. But I think that you would not wish that she should be left under a false impression, if you could put her right.\nSomebody has told her the story of Mrs. Hurtle. I suppose it was Felix, and that he had learned it from those people at Islington. But she has been told that which is untrue. Nobody knows and nobody can know the truth as you do. She supposes that I have willingly been passing my time with Mrs. Hurtle during the last two months, although during that very time I have asked for and have received the assurance of her love. Now, whether or no I have been to blame about Mrs. Hurtle,--as to which nothing at present need be said,--it is certainly the truth that her coming to England was not only not desired by me, but was felt by me to be the greatest possible misfortune. But after all that had passed I certainly owed it to her not to neglect her;--and this duty was the more incumbent on me as she was a foreigner and unknown to any one. I went down to Lowestoft with her at her request, having named the place to her as one known to myself, and because I could not refuse her so small a favour. You know that it was so, and you know also, as no one else does, that whatever courtesy I have shown to Mrs. Hurtle in England, I have been constrained to show her.\nI appeal to you to let Hetta know that this is true. She had made me understand that not only her mother and brother, but you also, are well acquainted with the story of my acquaintance with Mrs. Hurtle. Neither Lady Carbury nor Sir Felix has ever known anything about it. You, and you only, have known the truth. And now, though at the present you are angry with me, I call upon you to tell Hetta the truth as you know it. You will understand me when I say that I feel that I am being destroyed by a false representation. I think that you, who abhor a falsehood, will see the justice of setting me right, at any rate as far as the truth can do so. I do not want you to say a word for me beyond that.\nYours always,\nPAUL MONTAGUE.\nWhat business is all that of mine? This, of course, was the first feeling produced in Roger's mind by Montague's letter. If Hetta had received any false impression, it had not come from him. He had told no stories against his rival, whether true or false. He had been so scrupulous that he had refused to say a word at all. And if any false impression had been made on Hetta's mind, either by circumstances or by untrue words, had not Montague deserved any evil that might fall upon him? Though every word in Montague's letter might be true, nevertheless, in the end, no more than justice would be done him, even should he be robbed at last of his mistress under erroneous impressions. The fact that he had once disgraced himself by offering to make Mrs. Hurtle his wife, rendered him unworthy of Hetta Carbury. Such, at least, was Roger Carbury's verdict as he thought over all the circumstances. At any rate, it was no business of his to correct these wrong impressions.\nAnd yet he was ill at ease as he thought of it all. He did believe that every word in Montague's letter was true. Though he had been very indignant when he met Paul and Mrs. Hurtle together on the sands at Lowestoft, he was perfectly convinced that the cause of their coming there had been precisely that which Montague had stated. It took him two days to think over all this, two days of great discomfort and unhappiness. After all, why should he be a dog in the manger? The girl did not care for him,--looked upon him as an old man to be regarded in a fashion altogether different from that in which she regarded Paul Montague. He had let his time for love-making go by, and now it behoved him, as a man, to take the world as he found it, and not to lose himself in regrets for a kind of happiness which he could never attain. In such an emergency as this he should do what was fair and honest, without reference to his own feelings. And yet the passion which dominated John Crumb altogether, which made the mealman so intent on the attainment of his object as to render all other things indifferent to him for the time, was equally strong with Roger Carbury. Unfortunately for Roger, strong as his passion was, it was embarrassed by other feelings. It never occurred to Crumb to think whether he was a fit husband for Ruby, or whether Ruby, having a decided preference for another man, could be a fit wife for him. But with Roger there were a thousand surrounding difficulties to hamper him. John Crumb never doubted for a moment what he should do. He had to get the girl, if possible, and he meant to get her whatever she might cost him. He was always confident though sometimes perplexed. But Roger had no confidence. He knew that he should never win the game. In his sadder moments he felt that he ought not to win it. The people around him, from old fashion, still called him the young squire! Why;--he felt himself at times to be eighty years old,--so old that he was unfitted for intercourse with such juvenile spirits as those of his neighbour the bishop, and of his friend Hepworth. Could he, by any training, bring himself to take her happiness in hand, altogether sacrificing his own?\nIn such a mood as this he did at last answer his enemy's letter,--and he answered it as follows:--\nI do not know that I am concerned to meddle in your affairs at all. I have told no tale against you, and I do not know that I have any that I wish to tell in your favour, or that I could so tell if I did wish. I think that you have behaved badly to me, cruelly to Mrs. Hurtle, and disrespectfully to my cousin. Nevertheless, as you appeal to me on a certain point for evidence which I can give, and which you say no one else can give, I do acknowledge that, in my opinion, Mrs. Hurtle's presence in England has not been in accordance with your wishes, and that you accompanied her to Lowestoft, not as her lover but as an old friend whom you could not neglect.\nROGER CARBURY.\nPaul Montague, Esq.\nYou are at liberty to show this letter to Miss Carbury, if you please; but if she reads part she should read the whole!\nThere was more perhaps of hostility in this letter than of that spirit of self-sacrifice to which Roger intended to train himself; and so he himself felt after the letter had been dispatched.",
        "paragraph_chars": [
            [
                0,
                1172
            ],
            [
                1172,
                2617
            ],
            [
                2617,
                3338
            ],
            [
                3338,
                3952
            ],
            [
                3952,
                5412
            ],
            [
                5412,
                6653
            ],
            [
                6653,
                8150
            ],
            [
                8150,
                8200
            ],
            [
                8200,
                8284
            ],
            [
                8284,
                8427
            ],
            [
                8427,
                8459
            ],
            [
                8459,
                8645
            ],
            [
                8645,
                9366
            ],
            [
                9366,
                9960
            ],
            [
                9960,
                10744
            ],
            [
                10744,
                10886
            ],
            [
                10886,
                10917
            ],
            [
                10917,
                11147
            ],
            [
                11147,
                11471
            ],
            [
                11471,
                11555
            ],
            [
                11555,
                11915
            ],
            [
                11915,
                11932
            ],
            [
                11932,
                12190
            ],
            [
                12190,
                12653
            ],
            [
                12653,
                13817
            ],
            [
                13817,
                14518
            ],
            [
                14518,
                14532
            ],
            [
                14532,
                14547
            ],
            [
                14547,
                15520
            ],
            [
                15520,
                17718
            ],
            [
                17718,
                17817
            ],
            [
                17817,
                18478
            ],
            [
                18478,
                18493
            ],
            [
                18493,
                18513
            ],
            [
                18513,
                18633
            ],
            [
                18633,
                18824
            ]
        ],
        "segment_chars": [
            [
                0,
                127
            ],
            [
                127,
                227
            ],
            [
                227,
                322
            ],
            [
                322,
                604
            ],
            [
                604,
                730
            ],
            [
                730,
                825
            ],
            [
                825,
                1008
            ],
            [
                1008,
                1172
            ],
            [
                1172,
                1213
            ],
            [
                1213,
                1442
            ],
            [
                1442,
                1651
            ],
            [
                1651,
                1937
            ],
            [
                1937,
                2173
            ],
            [
                2173,
                2267
            ],
            [
                2267,
                2434
            ],
            [
                2434,
                2505
            ],
            [
                2505,
                2617
            ],
            [
                2617,
                2853
            ],
            [
                2853,
                2993
            ],
            [
                2993,
                3338
            ],
            [
                3338,
                3370
            ],
            [
                3370,
                3412
            ],
            [
                3412,
                3499
            ],
            [
                3499,
                3751
            ],
            [
                3751,
                3770
            ],
            [
                3770,
                3803
            ],
            [
                3803,
                3952
            ],
            [
                3952,
                4006
            ],
            [
                4006,
                4142
            ],
            [
                4142,
                4265
            ],
            [
                4265,
                4403
            ],
            [
                4403,
                4543
            ],
            [
                4543,
                4612
            ],
            [
                4612,
                4647
            ],
            [
                4647,
                4715
            ],
            [
                4715,
                4821
            ],
            [
                4821,
                4918
            ],
            [
                4918,
                5116
            ],
            [
                5116,
                5412
            ],
            [
                5412,
                5556
            ],
            [
                5556,
                5753
            ],
            [
                5753,
                5861
            ],
            [
                5861,
                6102
            ],
            [
                6102,
                6132
            ],
            [
                6132,
                6206
            ],
            [
                6206,
                6249
            ],
            [
                6249,
                6399
            ],
            [
                6399,
                6608
            ],
            [
                6608,
                6653
            ],
            [
                6653,
                6784
            ],
            [
                6784,
                6966
            ],
            [
                6966,
                7348
            ],
            [
                7348,
                7504
            ],
            [
                7504,
                7601
            ],
            [
                7601,
                7774
            ],
            [
                7774,
                7848
            ],
            [
                7848,
                7950
            ],
            [
                7950,
                8017
            ],
            [
                8017,
                8150
            ],
            [
                8150,
                8200
            ],
            [
                8200,
                8241
            ],
            [
                8241,
                8284
            ],
            [
                8284,
                8322
            ],
            [
                8322,
                8350
            ],
            [
                8350,
                8427
            ],
            [
                8427,
                8459
            ],
            [
                8459,
                8505
            ],
            [
                8505,
                8551
            ],
            [
                8551,
                8573
            ],
            [
                8573,
                8645
            ],
            [
                8645,
                8721
            ],
            [
                8721,
                8909
            ],
            [
                8909,
                9142
            ],
            [
                9142,
                9256
            ],
            [
                9256,
                9366
            ],
            [
                9366,
                9559
            ],
            [
                9559,
                9576
            ],
            [
                9576,
                9618
            ],
            [
                9618,
                9648
            ],
            [
                9648,
                9677
            ],
            [
                9677,
                9748
            ],
            [
                9748,
                9806
            ],
            [
                9806,
                9878
            ],
            [
                9878,
                9903
            ],
            [
                9903,
                9960
            ],
            [
                9960,
                10086
            ],
            [
                10086,
                10118
            ],
            [
                10118,
                10265
            ],
            [
                10265,
                10347
            ],
            [
                10347,
                10542
            ],
            [
                10542,
                10672
            ],
            [
                10672,
                10744
            ],
            [
                10744,
                10813
            ],
            [
                10813,
                10886
            ],
            [
                10886,
                10917
            ],
            [
                10917,
                10936
            ],
            [
                10936,
                11147
            ],
            [
                11147,
                11471
            ],
            [
                11471,
                11555
            ],
            [
                11555,
                11714
            ],
            [
                11714,
                11874
            ],
            [
                11874,
                11915
            ],
            [
                11915,
                11932
            ],
            [
                11932,
                12055
            ],
            [
                12055,
                12190
            ],
            [
                12190,
                12246
            ],
            [
                12246,
                12341
            ],
            [
                12341,
                12438
            ],
            [
                12438,
                12482
            ],
            [
                12482,
                12493
            ],
            [
                12493,
                12539
            ],
            [
                12539,
                12653
            ],
            [
                12653,
                12701
            ],
            [
                12701,
                12784
            ],
            [
                12784,
                12828
            ],
            [
                12828,
                12882
            ],
            [
                12882,
                13076
            ],
            [
                13076,
                13326
            ],
            [
                13326,
                13494
            ],
            [
                13494,
                13652
            ],
            [
                13652,
                13817
            ],
            [
                13817,
                13870
            ],
            [
                13870,
                14021
            ],
            [
                14021,
                14090
            ],
            [
                14090,
                14131
            ],
            [
                14131,
                14241
            ],
            [
                14241,
                14340
            ],
            [
                14340,
                14466
            ],
            [
                14466,
                14518
            ],
            [
                14518,
                14532
            ],
            [
                14532,
                14547
            ],
            [
                14547,
                14582
            ],
            [
                14582,
                14668
            ],
            [
                14668,
                14738
            ],
            [
                14738,
                14803
            ],
            [
                14803,
                14871
            ],
            [
                14871,
                15035
            ],
            [
                15035,
                15233
            ],
            [
                15233,
                15359
            ],
            [
                15359,
                15445
            ],
            [
                15445,
                15520
            ],
            [
                15520,
                15572
            ],
            [
                15572,
                15634
            ],
            [
                15634,
                15852
            ],
            [
                15852,
                15943
            ],
            [
                15943,
                15992
            ],
            [
                15992,
                16150
            ],
            [
                16150,
                16349
            ],
            [
                16349,
                16456
            ],
            [
                16456,
                16682
            ],
            [
                16682,
                16772
            ],
            [
                16772,
                16938
            ],
            [
                16938,
                17015
            ],
            [
                17015,
                17072
            ],
            [
                17072,
                17162
            ],
            [
                17162,
                17214
            ],
            [
                17214,
                17243
            ],
            [
                17243,
                17286
            ],
            [
                17286,
                17345
            ],
            [
                17345,
                17421
            ],
            [
                17421,
                17614
            ],
            [
                17614,
                17718
            ],
            [
                17718,
                17817
            ],
            [
                17817,
                17885
            ],
            [
                17885,
                18027
            ],
            [
                18027,
                18128
            ],
            [
                18128,
                18478
            ],
            [
                18478,
                18493
            ],
            [
                18493,
                18513
            ],
            [
                18513,
                18633
            ],
            [
                18633,
                18824
            ]
        ],
        "overlap_chars": [
            [
                0,
                38
            ],
            [
                40,
                90
            ],
            [
                113,
                127
            ],
            [
                227,
                322
            ],
            [
                326,
                339
            ],
            [
                322,
                325
            ],
            [
                340,
                347
            ],
            [
                373,
                450
            ],
            [
                516,
                519
            ],
            [
                689,
                699
            ],
            [
                705,
                711
            ],
            [
                680,
                688
            ],
            [
                543,
                544
            ],
            [
                470,
                480
            ],
            [
                596,
                598
            ],
            [
                599,
                602
            ],
            [
                550,
                551
            ],
            [
                728,
                730
            ],
            [
                831,
                897
            ],
            [
                1006,
                1008
            ],
            [
                1008,
                1109
            ],
            [
                1115,
                1172
            ],
            [
                1172,
                1194
            ],
            [
                1200,
                1213
            ],
            [
                1220,
                1222
            ],
            [
                1342,
                1442
            ],
            [
                1442,
                1511
            ],
            [
                1649,
                1651
            ],
            [
                1678,
                1680
            ],
            [
                1662,
                1666
            ],
            [
                1670,
                1674
            ],
            [
                1694,
                1698
            ],
            [
                1834,
                1840
            ],
            [
                1707,
                1716
            ],
            [
                1740,
                1765
            ],
            [
                1778,
                1782
            ],
            [
                1794,
                1806
            ],
            [
                1735,
                1739
            ],
            [
                1807,
                1810
            ],
            [
                1846,
                1870
            ],
            [
                1900,
                1922
            ],
            [
                1927,
                1937
            ],
            [
                1937,
                1951
            ],
            [
                2005,
                2063
            ],
            [
                2065,
                2104
            ],
            [
                2171,
                2173
            ],
            [
                2173,
                2226
            ],
            [
                2228,
                2265
            ],
            [
                2398,
                2403
            ],
            [
                2267,
                2282
            ],
            [
                2312,
                2344
            ],
            [
                2434,
                2437
            ],
            [
                2445,
                2448
            ],
            [
                2487,
                2504
            ],
            [
                2617,
                2660
            ],
            [
                2695,
                2698
            ],
            [
                2757,
                2794
            ],
            [
                2817,
                2833
            ],
            [
                2699,
                2703
            ],
            [
                2851,
                2853
            ],
            [
                2999,
                3040
            ],
            [
                3048,
                3049
            ],
            [
                3052,
                3067
            ],
            [
                3158,
                3195
            ],
            [
                3212,
                3215
            ],
            [
                3216,
                3225
            ],
            [
                3231,
                3338
            ],
            [
                3338,
                3352
            ],
            [
                3358,
                3361
            ],
            [
                3353,
                3357
            ],
            [
                3362,
                3370
            ],
            [
                3370,
                3394
            ],
            [
                3410,
                3412
            ],
            [
                3812,
                3829
            ],
            [
                3830,
                3882
            ],
            [
                3889,
                3900
            ],
            [
                3803,
                3806
            ],
            [
                3901,
                3903
            ],
            [
                3923,
                3929
            ],
            [
                3950,
                3952
            ],
            [
                3952,
                4006
            ],
            [
                4006,
                4044
            ],
            [
                4119,
                4129
            ],
            [
                4140,
                4142
            ],
            [
                4142,
                4160
            ],
            [
                4166,
                4173
            ],
            [
                4203,
                4206
            ],
            [
                4275,
                4277
            ],
            [
                4188,
                4196
            ],
            [
                4284,
                4318
            ],
            [
                4325,
                4330
            ],
            [
                4342,
                4351
            ],
            [
                4374,
                4403
            ],
            [
                4403,
                4422
            ],
            [
                4441,
                4442
            ],
            [
                4447,
                4461
            ],
            [
                4467,
                4481
            ],
            [
                4489,
                4497
            ],
            [
                4510,
                4543
            ],
            [
                4543,
                4582
            ],
            [
                4602,
                4612
            ],
            [
                4612,
                4647
            ],
            [
                4821,
                4823
            ],
            [
                4715,
                4717
            ],
            [
                4855,
                4866
            ],
            [
                4871,
                4891
            ],
            [
                4913,
                4916
            ],
            [
                4900,
                4909
            ],
            [
                4916,
                4918
            ],
            [
                4957,
                4971
            ],
            [
                4925,
                4932
            ],
            [
                5026,
                5033
            ],
            [
                4921,
                4924
            ],
            [
                5045,
                5051
            ],
            [
                5068,
                5084
            ],
            [
                5114,
                5115
            ],
            [
                5412,
                5443
            ],
            [
                5451,
                5459
            ],
            [
                5471,
                5495
            ],
            [
                5659,
                5664
            ],
            [
                5642,
                5644
            ],
            [
                5800,
                5824
            ],
            [
                5835,
                5861
            ],
            [
                5941,
                5994
            ],
            [
                6004,
                6068
            ],
            [
                6079,
                6102
            ],
            [
                6608,
                6653
            ],
            [
                6653,
                6684
            ],
            [
                6782,
                6784
            ],
            [
                6784,
                6817
            ],
            [
                6826,
                6851
            ],
            [
                6856,
                6966
            ],
            [
                6966,
                7023
            ],
            [
                7298,
                7303
            ],
            [
                7163,
                7169
            ],
            [
                7073,
                7085
            ],
            [
                7231,
                7268
            ],
            [
                7313,
                7347
            ],
            [
                7739,
                7744
            ],
            [
                7753,
                7774
            ],
            [
                7800,
                7818
            ],
            [
                7819,
                7848
            ],
            [
                7848,
                7856
            ],
            [
                7872,
                7889
            ],
            [
                7895,
                7923
            ],
            [
                7948,
                7949
            ],
            [
                7950,
                8016
            ],
            [
                8200,
                8241
            ],
            [
                8241,
                8284
            ],
            [
                8284,
                8322
            ],
            [
                8322,
                8348
            ],
            [
                8427,
                8459
            ],
            [
                8459,
                8474
            ],
            [
                8476,
                8485
            ],
            [
                8496,
                8505
            ],
            [
                8551,
                8573
            ],
            [
                8573,
                8576
            ],
            [
                8582,
                8628
            ],
            [
                8636,
                8645
            ],
            [
                8645,
                8650
            ],
            [
                8661,
                8668
            ],
            [
                8681,
                8689
            ],
            [
                8698,
                8721
            ],
            [
                8721,
                8739
            ],
            [
                8760,
                8764
            ],
            [
                8836,
                8840
            ],
            [
                8771,
                8775
            ],
            [
                8764,
                8765
            ],
            [
                8856,
                8896
            ],
            [
                8902,
                8909
            ],
            [
                9142,
                9180
            ],
            [
                9190,
                9205
            ],
            [
                9219,
                9236
            ],
            [
                9254,
                9256
            ],
            [
                9366,
                9371
            ],
            [
                9489,
                9504
            ],
            [
                9517,
                9558
            ],
            [
                9559,
                9576
            ],
            [
                9581,
                9586
            ],
            [
                9616,
                9618
            ],
            [
                9618,
                9648
            ],
            [
                9677,
                9683
            ],
            [
                9688,
                9748
            ],
            [
                9903,
                9919
            ],
            [
                9925,
                9960
            ],
            [
                10347,
                10462
            ],
            [
                10472,
                10491
            ],
            [
                10495,
                10502
            ],
            [
                10515,
                10542
            ],
            [
                10542,
                10566
            ],
            [
                10568,
                10621
            ],
            [
                10627,
                10651
            ],
            [
                10659,
                10671
            ],
            [
                10744,
                10784
            ],
            [
                10791,
                10797
            ],
            [
                10811,
                10813
            ],
            [
                10813,
                10864
            ],
            [
                10865,
                10871
            ],
            [
                10883,
                10886
            ],
            [
                10886,
                10917
            ],
            [
                10917,
                10936
            ],
            [
                10936,
                10963
            ],
            [
                10978,
                11020
            ],
            [
                11144,
                11147
            ],
            [
                11147,
                11152
            ],
            [
                11268,
                11275
            ],
            [
                11294,
                11337
            ],
            [
                11359,
                11408
            ],
            [
                11433,
                11471
            ],
            [
                11471,
                11516
            ],
            [
                11517,
                11555
            ],
            [
                11555,
                11638
            ],
            [
                11712,
                11714
            ],
            [
                11714,
                11740
            ],
            [
                11749,
                11756
            ],
            [
                11768,
                11818
            ],
            [
                11872,
                11874
            ],
            [
                11874,
                11912
            ],
            [
                11915,
                11929
            ],
            [
                11932,
                11971
            ],
            [
                11981,
                12019
            ],
            [
                12053,
                12055
            ],
            [
                12055,
                12190
            ],
            [
                12190,
                12246
            ],
            [
                12246,
                12282
            ],
            [
                12307,
                12341
            ],
            [
                12341,
                12438
            ],
            [
                12438,
                12482
            ],
            [
                12482,
                12493
            ],
            [
                12493,
                12539
            ],
            [
                12539,
                12653
            ],
            [
                12653,
                12701
            ],
            [
                12701,
                12723
            ],
            [
                12782,
                12784
            ],
            [
                12784,
                12795
            ],
            [
                12796,
                12805
            ],
            [
                12826,
                12828
            ],
            [
                12828,
                12840
            ],
            [
                12861,
                12882
            ],
            [
                12882,
                12981
            ],
            [
                13074,
                13076
            ],
            [
                13076,
                13134
            ],
            [
                13213,
                13242
            ],
            [
                13252,
                13265
            ],
            [
                13275,
                13279
            ],
            [
                13182,
                13184
            ],
            [
                13286,
                13326
            ],
            [
                13326,
                13329
            ],
            [
                13356,
                13357
            ],
            [
                13368,
                13401
            ],
            [
                13447,
                13469
            ],
            [
                13474,
                13484
            ],
            [
                13492,
                13494
            ],
            [
                13494,
                13500
            ],
            [
                13506,
                13543
            ],
            [
                13602,
                13652
            ],
            [
                13652,
                13694
            ],
            [
                13717,
                13791
            ],
            [
                13804,
                13817
            ],
            [
                14140,
                14146
            ],
            [
                14162,
                14186
            ],
            [
                14197,
                14241
            ],
            [
                14340,
                14404
            ],
            [
                14445,
                14454
            ],
            [
                14464,
                14466
            ],
            [
                14466,
                14518
            ],
            [
                14518,
                14532
            ],
            [
                14532,
                14547
            ],
            [
                14547,
                14563
            ],
            [
                14573,
                14582
            ],
            [
                14582,
                14586
            ],
            [
                14599,
                14602
            ],
            [
                14633,
                14640
            ],
            [
                14607,
                14620
            ],
            [
                14666,
                14668
            ],
            [
                14668,
                14738
            ],
            [
                14738,
                14779
            ],
            [
                14788,
                14803
            ],
            [
                14803,
                14871
            ],
            [
                14871,
                14874
            ],
            [
                14974,
                15035
            ],
            [
                15136,
                15144
            ],
            [
                15115,
                15135
            ],
            [
                15167,
                15169
            ],
            [
                15173,
                15194
            ],
            [
                15231,
                15233
            ],
            [
                15233,
                15317
            ],
            [
                15319,
                15359
            ],
            [
                15359,
                15384
            ],
            [
                15392,
                15402
            ],
            [
                15443,
                15444
            ],
            [
                15520,
                15546
            ],
            [
                15570,
                15572
            ],
            [
                15943,
                15992
            ],
            [
                15992,
                16021
            ],
            [
                16122,
                16125
            ],
            [
                16031,
                16053
            ],
            [
                16148,
                16150
            ],
            [
                16150,
                16196
            ],
            [
                16248,
                16250
            ],
            [
                16265,
                16301
            ],
            [
                16310,
                16349
            ],
            [
                16349,
                16455
            ],
            [
                16456,
                16502
            ],
            [
                16643,
                16682
            ],
            [
                16682,
                16706
            ],
            [
                17015,
                17025
            ],
            [
                16732,
                16733
            ],
            [
                17243,
                17258
            ],
            [
                17266,
                17286
            ],
            [
                17286,
                17345
            ],
            [
                17421,
                17424
            ],
            [
                17474,
                17475
            ],
            [
                17427,
                17474
            ],
            [
                17612,
                17614
            ],
            [
                17614,
                17622
            ],
            [
                17641,
                17718
            ],
            [
                17718,
                17732
            ],
            [
                17741,
                17782
            ],
            [
                17803,
                17814
            ],
            [
                17817,
                17885
            ],
            [
                17885,
                17930
            ],
            [
                17943,
                17986
            ],
            [
                18025,
                18027
            ],
            [
                18027,
                18128
            ],
            [
                18128,
                18201
            ],
            [
                18242,
                18478
            ],
            [
                18478,
                18493
            ],
            [
                18513,
                18633
            ],
            [
                18633,
                18642
            ],
            [
                18648,
                18655
            ],
            [
                18643,
                18647
            ],
            [
                18659,
                18688
            ],
            [
                18707,
                18721
            ],
            [
                18731,
                18736
            ],
            [
                18737,
                18745
            ],
            [
                18762,
                18773
            ],
            [
                18782,
                18812
            ],
            [
                18823,
                18824
            ]
        ],
        "row_chars": [
            [
                0,
                127
            ],
            [
                127,
                227
            ],
            [
                227,
                322
            ],
            [
                322,
                730
            ],
            [
                730,
                825
            ],
            [
                825,
                1008
            ],
            [
                1008,
                1172
            ],
            [
                1172,
                1213
            ],
            [
                1213,
                1442
            ],
            [
                1442,
                1651
            ],
            [
                1651,
                1937
            ],
            [
                1937,
                2173
            ],
            [
                2173,
                2505
            ],
            [
                2505,
                2617
            ],
            [
                2617,
                2853
            ],
            [
                2853,
                2993
            ],
            [
                2993,
                3338
            ],
            [
                3338,
                3370
            ],
            [
                3370,
                3412
            ],
            [
                3412,
                3499
            ],
            [
                3499,
                3751
            ],
            [
                3751,
                3770
            ],
            [
                3770,
                3803
            ],
            [
                3803,
                3952
            ],
            [
                3952,
                4006
            ],
            [
                4006,
                4142
            ],
            [
                4142,
                4403
            ],
            [
                4403,
                4543
            ],
            [
                4543,
                4612
            ],
            [
                4612,
                4647
            ],
            [
                4647,
                4715
            ],
            [
                4715,
                4918
            ],
            [
                4918,
                5116
            ],
            [
                5116,
                5412
            ],
            [
                5412,
                5861
            ],
            [
                5861,
                6102
            ],
            [
                6102,
                6132
            ],
            [
                6132,
                6206
            ],
            [
                6206,
                6249
            ],
            [
                6249,
                6399
            ],
            [
                6399,
                6608
            ],
            [
                6608,
                6653
            ],
            [
                6653,
                6784
            ],
            [
                6784,
                6966
            ],
            [
                6966,
                7348
            ],
            [
                7348,
                7504
            ],
            [
                7504,
                7601
            ],
            [
                7601,
                7774
            ],
            [
                7774,
                7848
            ],
            [
                7848,
                7950
            ],
            [
                7950,
                8017
            ],
            [
                8017,
                8150
            ],
            [
                8150,
                8200
            ],
            [
                8200,
                8241
            ],
            [
                8241,
                8284
            ],
            [
                8284,
                8322
            ],
            [
                8322,
                8350
            ],
            [
                8350,
                8427
            ],
            [
                8427,
                8459
            ],
            [
                8459,
                8505
            ],
            [
                8505,
                8551
            ],
            [
                8551,
                8573
            ],
            [
                8573,
                8645
            ],
            [
                8645,
                8721
            ],
            [
                8721,
                8909
            ],
            [
                8909,
                9142
            ],
            [
                9142,
                9256
            ],
            [
                9256,
                9366
            ],
            [
                9366,
                9559
            ],
            [
                9559,
                9576
            ],
            [
                9576,
                9618
            ],
            [
                9618,
                9648
            ],
            [
                9648,
                9677
            ],
            [
                9677,
                9748
            ],
            [
                9748,
                9806
            ],
            [
                9806,
                9878
            ],
            [
                9878,
                9903
            ],
            [
                9903,
                9960
            ],
            [
                9960,
                10086
            ],
            [
                10086,
                10118
            ],
            [
                10118,
                10265
            ],
            [
                10265,
                10347
            ],
            [
                10347,
                10542
            ],
            [
                10542,
                10672
            ],
            [
                10672,
                10744
            ],
            [
                10744,
                10813
            ],
            [
                10813,
                10886
            ],
            [
                10886,
                10917
            ],
            [
                10917,
                10936
            ],
            [
                10936,
                11147
            ],
            [
                11147,
                11471
            ],
            [
                11471,
                11555
            ],
            [
                11555,
                11714
            ],
            [
                11714,
                11874
            ],
            [
                11874,
                11915
            ],
            [
                11915,
                11932
            ],
            [
                11932,
                12055
            ],
            [
                12055,
                12190
            ],
            [
                12190,
                12246
            ],
            [
                12246,
                12341
            ],
            [
                12341,
                12438
            ],
            [
                12438,
                12482
            ],
            [
                12482,
                12493
            ],
            [
                12493,
                12539
            ],
            [
                12539,
                12653
            ],
            [
                12653,
                12701
            ],
            [
                12701,
                12784
            ],
            [
                12784,
                12828
            ],
            [
                12828,
                12882
            ],
            [
                12882,
                13076
            ],
            [
                13076,
                13326
            ],
            [
                13326,
                13494
            ],
            [
                13494,
                13652
            ],
            [
                13652,
                13817
            ],
            [
                13817,
                13870
            ],
            [
                13870,
                14021
            ],
            [
                14021,
                14090
            ],
            [
                14090,
                14131
            ],
            [
                14131,
                14241
            ],
            [
                14241,
                14340
            ],
            [
                14340,
                14466
            ],
            [
                14466,
                14518
            ],
            [
                14518,
                14532
            ],
            [
                14532,
                14547
            ],
            [
                14547,
                14582
            ],
            [
                14582,
                14668
            ],
            [
                14668,
                14738
            ],
            [
                14738,
                14803
            ],
            [
                14803,
                14871
            ],
            [
                14871,
                15035
            ],
            [
                15035,
                15233
            ],
            [
                15233,
                15359
            ],
            [
                15359,
                15445
            ],
            [
                15445,
                15520
            ],
            [
                15520,
                15572
            ],
            [
                15572,
                15634
            ],
            [
                15634,
                15852
            ],
            [
                15852,
                15943
            ],
            [
                15943,
                15992
            ],
            [
                15992,
                16150
            ],
            [
                16150,
                16349
            ],
            [
                16349,
                16456
            ],
            [
                16456,
                16682
            ],
            [
                16682,
                17286
            ],
            [
                17286,
                17345
            ],
            [
                17345,
                17421
            ],
            [
                17421,
                17614
            ],
            [
                17614,
                17718
            ],
            [
                17718,
                17817
            ],
            [
                17817,
                17885
            ],
            [
                17885,
                18027
            ],
            [
                18027,
                18128
            ],
            [
                18128,
                18478
            ],
            [
                18478,
                18493
            ],
            [
                18493,
                18513
            ],
            [
                18513,
                18633
            ],
            [
                18633,
                18824
            ]
        ]
    },
    "abridged": {
        "text": "When Roger Carbury returned to Suffolk after seeing his cousins in Welbeck Street, he was discontented with himself. He knew that he was farther removed than ever from the object on which his whole mind was set. If Hetta Carbury had learned about Paul's engagement with Mrs. Hurtle before she had confessed her love to Paul, she would have buried her love, and might have come to love him, Roger. But Hetta had never heard Mrs. Hurtle's name till she had given herself away. The more Roger thought of this, the more angry he was with Paul Montague, and the more convinced that the man had done him an injury which he could never forgive.\nBut his grief extended beyond that. He also felt that an injury was being done to the man, and that he was in some sort responsible for that injury. He had declined to tell Hetta any part of the story about Mrs. Hurtle. Yet he knew well that Paul's attention to the American woman had not been because of love, but because Paul had felt that he could not desert her when she asked him for kindness. If Hetta could read the state of Paul's mind as he, Roger, could read it, then she would probably forgive the man. Roger was anxious that Hetta's anger should burn hot, because of the injury done to himself, and he thought that Paul Montague should be punished; but not on false grounds.\nAs to the girl's misery in losing her lover - even though Roger was devoted to her happiness, I do not think that he was disturbed about that. He told himself that Paul would be an unsafe, fickle husband, and that it would be better for Hetta not to marry him. At the same time he was unhappy as he reflected that he himself was a party to a certain amount of deceit.\nAnd yet he had not said a word. He had referred Hetta to Paul. He tried to quieten his conscience by saying that they must fight it out between themselves, but he was uneasy.\nHis life at Carbury, at this time, was very desolate. He had become tired of the priest, who kept trying to convert him. Roger had told him that he did not wish to discuss religion with him any more; Father Barham had declared that he could never remain as a friend with any man on those terms. When Roger had persisted, the priest had suggested that his host wished to banish him from Carbury Hall. Roger had made no reply, and the priest was banished. But even this added to his misery. He felt he had been cruel to the priest, yet he could not bid him come back. His neighbours were already saying that he was about to become a Roman Catholic.\nHe was troubled, too, about old Ruggles, at Sheep's Acre, who had taken to drink, and was making himself a scandal and a nuisance. He declared that his niece and John Crumb were the cause; for now, in his maudlin misery, he attributed as much blame to John Crumb as he did to the girl. This, too, was a grievance to Roger Carbury.\nBut he did not neglect his work. He was making hay at this time in some meadows down by the river; and was standing by while the men were loading a cart, when he saw John Crumb approaching across the field. He had not seen John since the eventful journey to London, but he had heard all that had happened. John was now regarded in Bungay as a hero, though very \"soft\" in the matter of love.\nRoger hurried to meet him. Crumb's broad face beamed with a whole sunshine of delight. As Roger came closer he began to laugh, and to wave a bit of paper.\n\"She's a coomin; she's a coomin,\" were the first words he uttered.\n\"I am delighted to hear it,\" said Roger. \"She has made it up with her grandfather?\"\n\"Don't know now't about grandfeyther. She have made it up wi' me.\"\n\"Has she written to you, then?\"\n\"Well, squoire, she ain't, herself. But it's all as one.\" And Mr. Crumb thrust Mrs. Hurtle's note into Roger's hand.\nRoger was not disposed to think kindly of Mrs. Hurtle. Since he had first heard her name from Paul, he had regarded her as a wicked, intriguing woman. But it certainly did seem that in this case Mrs. Hurtle was trying to do a good turn. Roger said that he thought that what she said of Ruby might be true.\n\"True, squoire!\" laughed Crumb. \"I ha' nae a doubt it's true. When I dropped into t'other fellow, of course she made her choice. So, squoire, I'm going again to Lon'on right away.\"\nWhen Roger observed that it would be better that Ruby should have some home to which she might at once return, John listed with a renewed grin all the comforts of his own house. It seemed to be his idea that on arriving in London he would at once take Ruby to church and be married out of hand.\nBut before he left the field he made one speech about Sir Felix. \"You ain't a'taken it amiss, squoire, 'cause he was your coosin?\"\n\"Not in the least, Mr. Crumb.\"\n\"That's koind now. I ain't a done the yong man no harm, and I don't feel no grudge again him.\"\nRoger assured him that he thought that Crumb had behaved well in that encounter, and he expressed a strong wish for the happiness of Mr. and Mrs. John Crumb.\n\"Oh, ay, we'll be 'appy, squoire,\" said Crumb, as he went exulting out of the field.\nOn the day after this Roger Carbury received a letter which disturbed him very much. It was from Paul Montague, written a few hours after he had left his letter for Hetta. Paul's letter to Roger was as follows:\nMy dear Roger,\nThough I know that you have cast me off I cannot write to you in any other way. You can answer me, of course, as you please, but I do think that you will owe me an answer, as I appeal to you in the name of justice.\nYou know what has taken place between Hetta and myself. She had accepted me, and therefore I feel sure that she must have loved me. But she has now quarrelled with me altogether, and has told me that I am never to see her again. Of course I don't mean to put up with this. Who would? You will say that it is no business of yours. But I think that you would not wish that she should be left under a false impression, if you could put her right.\nSomebody has told her the story of Mrs. Hurtle. I suppose it was Felix. But she has not been told the truth. Nobody knows the truth as you do. She supposes that I have willingly been passing my time with Mrs. Hurtle during the last two months. Now, whether or no I have been to blame about Mrs. Hurtle, her coming to England was not desired by me; I felt it to be the greatest possible misfortune. But I owed it to her not to neglect her, as she was a foreigner unknown to anyone. I went to Lowestoft with her at her request, because I could not refuse her so small a favour. You know that it was so, and you know also that whatever courtesy I have shown to Mrs. Hurtle in England, I have been forced to show her.\nThough you are angry with me, I appeal to you to tell Hetta the truth as you know it. I think that you, who abhor a falsehood, will see the justice of telling her the truth. I do not want you to say a word for me beyond that.\nYours always,\nPaul Montague.\nWhat business is it of mine? This was Roger's first feeling. If Hetta had received any false impression, it had not come from him. He had told no stories against his rival, true or false. He had been so scrupulous that he had refused to say a word at all. And had not Montague deserved any evil that might fall upon him? It would be no more than justice if he were robbed at last of his love. The fact that he had once disgraced himself by offering to make Mrs. Hurtle his wife rendered him unworthy of Hetta Carbury. Such, at least, was Roger's verdict.\nAnd yet he was ill at ease. After all, why should he be a dog in the manger? The girl did not care for him; she looked upon him as an old man. He had let his time for love-making go by, and he ought not to lose himself in regrets for a happiness which he could never attain. In such an emergency as this he should do what was fair and honest, without reference to his own feelings.\nAnd yet the passion which dominated John Crumb was equally strong with Roger Carbury. Unfortunately for Roger, unlike John Crumb, he knew that he would never win the game. In his sadder moments he felt that he ought not to win it. Why, he felt himself at times to be eighty years old. Could he bring himself to take her happiness in hand, altogether sacrificing his own?\nIn such a mood he did at last answer his enemy's letter, as follows:\nI do not know that I am concerned to meddle in your affairs at all. I have told no tale against you, and I do not have any that I wish to tell in your favour. I think that you have behaved badly to me, cruelly to Mrs. Hurtle, and disrespectfully to my cousin. Nevertheless, as you appeal to me on a certain point for evidence which I can give, I do acknowledge that, in my opinion, Mrs. Hurtle's presence in England has not been in accordance with your wishes, and that you accompanied her to Lowestoft, not as her lover but as an old friend whom you could not neglect.\nRoger Carbury.\nYou are at liberty to show this letter to Miss Carbury, if you please; but if she reads part she should read the whole!\nThere was perhaps more hostility in this letter than the self-sacrifice Roger had intended; and so he felt after the letter had been sent.",
        "paragraph_chars": [
            [
                0,
                638
            ],
            [
                638,
                1325
            ],
            [
                1325,
                1693
            ],
            [
                1693,
                1868
            ],
            [
                1868,
                2515
            ],
            [
                2515,
                2846
            ],
            [
                2846,
                3237
            ],
            [
                3237,
                3392
            ],
            [
                3392,
                3459
            ],
            [
                3459,
                3543
            ],
            [
                3543,
                3610
            ],
            [
                3610,
                3642
            ],
            [
                3642,
                3759
            ],
            [
                3759,
                4065
            ],
            [
                4065,
                4246
            ],
            [
                4246,
                4541
            ],
            [
                4541,
                4672
            ],
            [
                4672,
                4703
            ],
            [
                4703,
                4798
            ],
            [
                4798,
                4956
            ],
            [
                4956,
                5041
            ],
            [
                5041,
                5252
            ],
            [
                5252,
                5267
            ],
            [
                5267,
                5482
            ],
            [
                5482,
                5926
            ],
            [
                5926,
                6640
            ],
            [
                6640,
                6866
            ],
            [
                6866,
                6880
            ],
            [
                6880,
                6895
            ],
            [
                6895,
                7450
            ],
            [
                7450,
                7832
            ],
            [
                7832,
                8203
            ],
            [
                8203,
                8272
            ],
            [
                8272,
                8842
            ],
            [
                8842,
                8857
            ],
            [
                8857,
                8977
            ],
            [
                8977,
                9115
            ]
        ],
        "segment_chars": [
            [
                0,
                117
            ],
            [
                117,
                212
            ],
            [
                212,
                397
            ],
            [
                397,
                475
            ],
            [
                475,
                638
            ],
            [
                638,
                674
            ],
            [
                674,
                787
            ],
            [
                787,
                858
            ],
            [
                858,
                1037
            ],
            [
                1037,
                1152
            ],
            [
                1152,
                1325
            ],
            [
                1325,
                1468
            ],
            [
                1468,
                1586
            ],
            [
                1586,
                1693
            ],
            [
                1693,
                1725
            ],
            [
                1725,
                1756
            ],
            [
                1756,
                1868
            ],
            [
                1868,
                1922
            ],
            [
                1922,
                1989
            ],
            [
                1989,
                2163
            ],
            [
                2163,
                2268
            ],
            [
                2268,
                2322
            ],
            [
                2322,
                2357
            ],
            [
                2357,
                2434
            ],
            [
                2434,
                2515
            ],
            [
                2515,
                2646
            ],
            [
                2646,
                2801
            ],
            [
                2801,
                2846
            ],
            [
                2846,
                2879
            ],
            [
                2879,
                3053
            ],
            [
                3053,
                3152
            ],
            [
                3152,
                3237
            ],
            [
                3237,
                3264
            ],
            [
                3264,
                3324
            ],
            [
                3324,
                3392
            ],
            [
                3392,
                3459
            ],
            [
                3459,
                3500
            ],
            [
                3500,
                3543
            ],
            [
                3543,
                3581
            ],
            [
                3581,
                3610
            ],
            [
                3610,
                3642
            ],
            [
                3642,
                3678
            ],
            [
                3678,
                3700
            ],
            [
                3700,
                3759
            ],
            [
                3759,
                3814
            ],
            [
                3814,
                3910
            ],
            [
                3910,
                3996
            ],
            [
                3996,
                4065
            ],
            [
                4065,
                4082
            ],
            [
                4082,
                4097
            ],
            [
                4097,
                4127
            ],
            [
                4127,
                4194
            ],
            [
                4194,
                4246
            ],
            [
                4246,
                4424
            ],
            [
                4424,
                4541
            ],
            [
                4541,
                4606
            ],
            [
                4606,
                4672
            ],
            [
                4672,
                4703
            ],
            [
                4703,
                4722
            ],
            [
                4722,
                4798
            ],
            [
                4798,
                4956
            ],
            [
                4956,
                5041
            ],
            [
                5041,
                5126
            ],
            [
                5126,
                5213
            ],
            [
                5213,
                5252
            ],
            [
                5252,
                5267
            ],
            [
                5267,
                5347
            ],
            [
                5347,
                5482
            ],
            [
                5482,
                5538
            ],
            [
                5538,
                5614
            ],
            [
                5614,
                5711
            ],
            [
                5711,
                5755
            ],
            [
                5755,
                5766
            ],
            [
                5766,
                5812
            ],
            [
                5812,
                5926
            ],
            [
                5926,
                5974
            ],
            [
                5974,
                5998
            ],
            [
                5998,
                6035
            ],
            [
                6035,
                6069
            ],
            [
                6069,
                6170
            ],
            [
                6170,
                6324
            ],
            [
                6324,
                6407
            ],
            [
                6407,
                6502
            ],
            [
                6502,
                6640
            ],
            [
                6640,
                6726
            ],
            [
                6726,
                6814
            ],
            [
                6814,
                6866
            ],
            [
                6866,
                6880
            ],
            [
                6880,
                6895
            ],
            [
                6895,
                6924
            ],
            [
                6924,
                6956
            ],
            [
                6956,
                7026
            ],
            [
                7026,
                7083
            ],
            [
                7083,
                7151
            ],
            [
                7151,
                7216
            ],
            [
                7216,
                7288
            ],
            [
                7288,
                7413
            ],
            [
                7413,
                7450
            ],
            [
                7450,
                7478
            ],
            [
                7478,
                7527
            ],
            [
                7527,
                7593
            ],
            [
                7593,
                7725
            ],
            [
                7725,
                7832
            ],
            [
                7832,
                7918
            ],
            [
                7918,
                8004
            ],
            [
                8004,
                8063
            ],
            [
                8063,
                8117
            ],
            [
                8117,
                8203
            ],
            [
                8203,
                8272
            ],
            [
                8272,
                8340
            ],
            [
                8340,
                8431
            ],
            [
                8431,
                8532
            ],
            [
                8532,
                8842
            ],
            [
                8842,
                8857
            ],
            [
                8857,
                8977
            ],
            [
                8977,
                9115
            ]
        ],
        "overlap_chars": [
            [
                0,
                38
            ],
            [
                39,
                89
            ],
            [
                103,
                117
            ],
            [
                117,
                212
            ],
            [
                215,
                228
            ],
            [
                229,
                232
            ],
            [
                233,
                240
            ],
            [
                247,
                324
            ],
            [
                325,
                328
            ],
            [
                329,
                339
            ],
            [
                340,
                346
            ],
            [
                347,
                355
            ],
            [
                355,
                356
            ],
            [
                361,
                371
            ],
            [
                377,
                379
            ],
            [
                385,
                388
            ],
            [
                388,
                389
            ],
            [
                395,
                397
            ],
            [
                407,
                473
            ],
            [
                473,
                475
            ],
            [
                475,
                576
            ],
            [
                581,
                638
            ],
            [
                638,
                660
            ],
            [
                661,
                674
            ],
            [
                674,
                676
            ],
            [
                687,
                787
            ],
            [
                787,
                856
            ],
            [
                856,
                858
            ],
            [
                862,
                864
            ],
            [
                865,
                869
            ],
            [
                870,
                874
            ],
            [
                875,
                879
            ],
            [
                880,
                886
            ],
            [
                887,
                896
            ],
            [
                897,
                922
            ],
            [
                927,
                931
            ],
            [
                940,
                952
            ],
            [
                961,
                965
            ],
            [
                966,
                969
            ],
            [
                975,
                999
            ],
            [
                1004,
                1026
            ],
            [
                1027,
                1037
            ],
            [
                1037,
                1051
            ],
            [
                1052,
                1110
            ],
            [
                1111,
                1150
            ],
            [
                1150,
                1152
            ],
            [
                1152,
                1205
            ],
            [
                1206,
                1243
            ],
            [
                1243,
                1248
            ],
            [
                1249,
                1264
            ],
            [
                1265,
                1297
            ],
            [
                1299,
                1302
            ],
            [
                1303,
                1306
            ],
            [
                1307,
                1324
            ],
            [
                1325,
                1368
            ],
            [
                1389,
                1392
            ],
            [
                1401,
                1438
            ],
            [
                1439,
                1455
            ],
            [
                1462,
                1466
            ],
            [
                1466,
                1468
            ],
            [
                1471,
                1512
            ],
            [
                1512,
                1513
            ],
            [
                1514,
                1529
            ],
            [
                1530,
                1567
            ],
            [
                1568,
                1571
            ],
            [
                1575,
                1584
            ],
            [
                1586,
                1693
            ],
            [
                1693,
                1707
            ],
            [
                1708,
                1711
            ],
            [
                1712,
                1716
            ],
            [
                1717,
                1725
            ],
            [
                1725,
                1749
            ],
            [
                1754,
                1756
            ],
            [
                1756,
                1773
            ],
            [
                1776,
                1828
            ],
            [
                1837,
                1848
            ],
            [
                1849,
                1852
            ],
            [
                1853,
                1855
            ],
            [
                1860,
                1866
            ],
            [
                1866,
                1868
            ],
            [
                1868,
                1922
            ],
            [
                1922,
                1960
            ],
            [
                1973,
                1983
            ],
            [
                1987,
                1989
            ],
            [
                1989,
                2007
            ],
            [
                2008,
                2015
            ],
            [
                2020,
                2023
            ],
            [
                2029,
                2031
            ],
            [
                2040,
                2048
            ],
            [
                2068,
                2102
            ],
            [
                2109,
                2114
            ],
            [
                2115,
                2124
            ],
            [
                2134,
                2163
            ],
            [
                2168,
                2187
            ],
            [
                2187,
                2188
            ],
            [
                2189,
                2203
            ],
            [
                2204,
                2218
            ],
            [
                2219,
                2227
            ],
            [
                2235,
                2268
            ],
            [
                2268,
                2307
            ],
            [
                2312,
                2322
            ],
            [
                2322,
                2357
            ],
            [
                2357,
                2359
            ],
            [
                2383,
                2385
            ],
            [
                2386,
                2397
            ],
            [
                2398,
                2418
            ],
            [
                2419,
                2422
            ],
            [
                2423,
                2432
            ],
            [
                2432,
                2434
            ],
            [
                2434,
                2448
            ],
            [
                2454,
                2461
            ],
            [
                2469,
                2476
            ],
            [
                2477,
                2480
            ],
            [
                2490,
                2496
            ],
            [
                2497,
                2513
            ],
            [
                2513,
                2514
            ],
            [
                2515,
                2546
            ],
            [
                2547,
                2555
            ],
            [
                2556,
                2580
            ],
            [
                2581,
                2586
            ],
            [
                2587,
                2589
            ],
            [
                2595,
                2619
            ],
            [
                2620,
                2646
            ],
            [
                2649,
                2702
            ],
            [
                2702,
                2766
            ],
            [
                2778,
                2801
            ],
            [
                2801,
                2846
            ],
            [
                2846,
                2877
            ],
            [
                2877,
                2879
            ],
            [
                2879,
                2912
            ],
            [
                2918,
                2943
            ],
            [
                2943,
                3053
            ],
            [
                3053,
                3110
            ],
            [
                3110,
                3115
            ],
            [
                3116,
                3122
            ],
            [
                3129,
                3141
            ],
            [
                3157,
                3194
            ],
            [
                3202,
                3236
            ],
            [
                3237,
                3242
            ],
            [
                3243,
                3264
            ],
            [
                3264,
                3282
            ],
            [
                3295,
                3324
            ],
            [
                3324,
                3332
            ],
            [
                3345,
                3362
            ],
            [
                3362,
                3390
            ],
            [
                3390,
                3391
            ],
            [
                3392,
                3458
            ],
            [
                3459,
                3500
            ],
            [
                3500,
                3543
            ],
            [
                3543,
                3581
            ],
            [
                3581,
                3607
            ],
            [
                3610,
                3642
            ],
            [
                3642,
                3657
            ],
            [
                3658,
                3667
            ],
            [
                3669,
                3678
            ],
            [
                3678,
                3700
            ],
            [
                3700,
                3703
            ],
            [
                3704,
                3750
            ],
            [
                3750,
                3759
            ],
            [
                3759,
                3764
            ],
            [
                3765,
                3772
            ],
            [
                3782,
                3790
            ],
            [
                3791,
                3814
            ],
            [
                3814,
                3832
            ],
            [
                3843,
                3847
            ],
            [
                3848,
                3852
            ],
            [
                3853,
                3857
            ],
            [
                3857,
                3858
            ],
            [
                3862,
                3902
            ],
            [
                3903,
                3910
            ],
            [
                3910,
                3948
            ],
            [
                3954,
                3969
            ],
            [
                3977,
                3994
            ],
            [
                3994,
                3996
            ],
            [
                3996,
                4001
            ],
            [
                4007,
                4022
            ],
            [
                4023,
                4064
            ],
            [
                4065,
                4082
            ],
            [
                4090,
                4095
            ],
            [
                4095,
                4097
            ],
            [
                4097,
                4127
            ],
            [
                4127,
                4133
            ],
            [
                4134,
                4194
            ],
            [
                4194,
                4210
            ],
            [
                4211,
                4246
            ],
            [
                4246,
                4361
            ],
            [
                4369,
                4388
            ],
            [
                4389,
                4396
            ],
            [
                4397,
                4424
            ],
            [
                4424,
                4448
            ],
            [
                4449,
                4502
            ],
            [
                4503,
                4527
            ],
            [
                4528,
                4540
            ],
            [
                4541,
                4581
            ],
            [
                4582,
                4588
            ],
            [
                4604,
                4606
            ],
            [
                4606,
                4657
            ],
            [
                4663,
                4669
            ],
            [
                4669,
                4672
            ],
            [
                4672,
                4703
            ],
            [
                4703,
                4722
            ],
            [
                4722,
                4749
            ],
            [
                4753,
                4795
            ],
            [
                4795,
                4798
            ],
            [
                4798,
                4803
            ],
            [
                4816,
                4823
            ],
            [
                4824,
                4867
            ],
            [
                4868,
                4917
            ],
            [
                4918,
                4956
            ],
            [
                4956,
                5001
            ],
            [
                5003,
                5041
            ],
            [
                5041,
                5124
            ],
            [
                5124,
                5126
            ],
            [
                5126,
                5152
            ],
            [
                5153,
                5160
            ],
            [
                5161,
                5211
            ],
            [
                5211,
                5213
            ],
            [
                5213,
                5251
            ],
            [
                5252,
                5266
            ],
            [
                5267,
                5306
            ],
            [
                5307,
                5345
            ],
            [
                5345,
                5347
            ],
            [
                5347,
                5482
            ],
            [
                5482,
                5538
            ],
            [
                5538,
                5574
            ],
            [
                5580,
                5614
            ],
            [
                5614,
                5711
            ],
            [
                5711,
                5755
            ],
            [
                5755,
                5766
            ],
            [
                5766,
                5812
            ],
            [
                5812,
                5926
            ],
            [
                5926,
                5974
            ],
            [
                5974,
                5996
            ],
            [
                5996,
                5998
            ],
            [
                5998,
                6009
            ],
            [
                6014,
                6023
            ],
            [
                6033,
                6035
            ],
            [
                6035,
                6047
            ],
            [
                6048,
                6069
            ],
            [
                6069,
                6168
            ],
            [
                6168,
                6170
            ],
            [
                6170,
                6228
            ],
            [
                6229,
                6258
            ],
            [
                6259,
                6272
            ],
            [
                6276,
                6280
            ],
            [
                6281,
                6283
            ],
            [
                6284,
                6324
            ],
            [
                6324,
                6327
            ],
            [
                6328,
                6329
            ],
            [
                6330,
                6363
            ],
            [
                6365,
                6387
            ],
            [
                6388,
                6398
            ],
            [
                6405,
                6407
            ],
            [
                6407,
                6413
            ],
            [
                6414,
                6451
            ],
            [
                6452,
                6502
            ],
            [
                6502,
                6544
            ],
            [
                6545,
                6619
            ],
            [
                6627,
                6640
            ],
            [
                6640,
                6646
            ],
            [
                6647,
                6671
            ],
            [
                6682,
                6726
            ],
            [
                6726,
                6790
            ],
            [
                6803,
                6812
            ],
            [
                6812,
                6814
            ],
            [
                6814,
                6866
            ],
            [
                6866,
                6880
            ],
            [
                6880,
                6895
            ],
            [
                6895,
                6911
            ],
            [
                6915,
                6924
            ],
            [
                6924,
                6928
            ],
            [
                6929,
                6932
            ],
            [
                6933,
                6940
            ],
            [
                6941,
                6954
            ],
            [
                6954,
                6956
            ],
            [
                6956,
                7026
            ],
            [
                7026,
                7067
            ],
            [
                7068,
                7083
            ],
            [
                7083,
                7151
            ],
            [
                7151,
                7154
            ],
            [
                7155,
                7216
            ],
            [
                7219,
                7227
            ],
            [
                7228,
                7248
            ],
            [
                7252,
                7254
            ],
            [
                7260,
                7281
            ],
            [
                7286,
                7288
            ],
            [
                7288,
                7372
            ],
            [
                7373,
                7413
            ],
            [
                7413,
                7438
            ],
            [
                7438,
                7448
            ],
            [
                7448,
                7449
            ],
            [
                7450,
                7476
            ],
            [
                7476,
                7478
            ],
            [
                7478,
                7527
            ],
            [
                7527,
                7556
            ],
            [
                7558,
                7561
            ],
            [
                7569,
                7591
            ],
            [
                7591,
                7593
            ],
            [
                7593,
                7639
            ],
            [
                7640,
                7642
            ],
            [
                7649,
                7685
            ],
            [
                7686,
                7725
            ],
            [
                7725,
                7831
            ],
            [
                7832,
                7878
            ],
            [
                7879,
                7918
            ],
            [
                7918,
                7942
            ],
            [
                7950,
                7960
            ],
            [
                7960,
                7961
            ],
            [
                7962,
                7977
            ],
            [
                7984,
                8004
            ],
            [
                8004,
                8063
            ],
            [
                8063,
                8066
            ],
            [
                8066,
                8067
            ],
            [
                8068,
                8115
            ],
            [
                8115,
                8117
            ],
            [
                8117,
                8125
            ],
            [
                8126,
                8203
            ],
            [
                8203,
                8217
            ],
            [
                8218,
                8259
            ],
            [
                8260,
                8271
            ],
            [
                8272,
                8340
            ],
            [
                8340,
                8385
            ],
            [
                8386,
                8429
            ],
            [
                8429,
                8431
            ],
            [
                8431,
                8532
            ],
            [
                8532,
                8605
            ],
            [
                8606,
                8842
            ],
            [
                8842,
                8857
            ],
            [
                8857,
                8977
            ],
            [
                8977,
                8986
            ],
            [
                8987,
                8994
            ],
            [
                8995,
                8999
            ],
            [
                9000,
                9029
            ],
            [
                9034,
                9048
            ],
            [
                9049,
                9054
            ],
            [
                9059,
                9067
            ],
            [
                9067,
                9078
            ],
            [
                9079,
                9109
            ],
            [
                9114,
                9115
            ]
        ],
        "row_chars": [
            [
                0,
                117
            ],
            [
                117,
                117
            ],
            [
                117,
                212
            ],
            [
                212,
                397
            ],
            [
                397,
                397
            ],
            [
                397,
                475
            ],
            [
                475,
                638
            ],
            [
                638,
                674
            ],
            [
                674,
                787
            ],
            [
                787,
                858
            ],
            [
                858,
                1037
            ],
            [
                1037,
                1152
            ],
            [
                1152,
                1325
            ],
            [
                1325,
                1325
            ],
            [
                1325,
                1468
            ],
            [
                1468,
                1468
            ],
            [
                1468,
                1693
            ],
            [
                1693,
                1725
            ],
            [
                1725,
                1756
            ],
            [
                1756,
                1756
            ],
            [
                1756,
                1756
            ],
            [
                1756,
                1756
            ],
            [
                1756,
                1756
            ],
            [
                1756,
                1868
            ],
            [
                1868,
                1922
            ],
            [
                1922,
                1989
            ],
            [
                1989,
                2163
            ],
            [
                2163,
                2268
            ],
            [
                2268,
                2322
            ],
            [
                2322,
                2357
            ],
            [
                2357,
                2357
            ],
            [
                2357,
                2434
            ],
            [
                2434,
                2515
            ],
            [
                2515,
                2515
            ],
            [
                2515,
                2646
            ],
            [
                2646,
                2801
            ],
            [
                2801,
                2801
            ],
            [
                2801,
                2801
            ],
            [
                2801,
                2801
            ],
            [
                2801,
                2801
            ],
            [
                2801,
                2801
            ],
            [
                2801,
                2846
            ],
            [
                2846,
                2879
            ],
            [
                2879,
                3053
            ],
            [
                3053,
                3237
            ],
            [
                3237,
                3237
            ],
            [
                3237,
                3237
            ],
            [
                3237,
                3264
            ],
            [
                3264,
                3324
            ],
            [
                3324,
                3392
            ],
            [
                3392,
                3459
            ],
            [
                3459,
                3459
            ],
            [
                3459,
                3459
            ],
            [
                3459,
                3500
            ],
            [
                3500,
                3543
            ],
            [
                3543,
                3581
            ],
            [
                3581,
                3610
            ],
            [
                3610,
                3610
            ],
            [
                3610,
                3642
            ],
            [
                3642,
                3678
            ],
            [
                3678,
                3678
            ],
            [
                3678,
                3700
            ],
            [
                3700,
                3759
            ],
            [
                3759,
                3814
            ],
            [
                3814,
                3910
            ],
            [
                3910,
                3910
            ],
            [
                3910,
                3996
            ],
            [
                3996,
                3996
            ],
            [
                3996,
                4065
            ],
            [
                4065,
                4082
            ],
            [
                4082,
                4097
            ],
            [
                4097,
                4127
            ],
            [
                4127,
                4127
            ],
            [
                4127,
                4194
            ],
            [
                4194,
                4194
            ],
            [
                4194,
                4194
            ],
            [
                4194,
                4194
            ],
            [
                4194,
                4246
            ],
            [
                4246,
                4246
            ],
            [
                4246,
                4246
            ],
            [
                4246,
                4246
            ],
            [
                4246,
                4246
            ],
            [
                4246,
                4424
            ],
            [
                4424,
                4541
            ],
            [
                4541,
                4541
            ],
            [
                4541,
                4606
            ],
            [
                4606,
                4672
            ],
            [
                4672,
                4703
            ],
            [
                4703,
                4722
            ],
            [
                4722,
                4798
            ],
            [
                4798,
                4956
            ],
            [
                4956,
                5041
            ],
            [
                5041,
                5126
            ],
            [
                5126,
                5213
            ],
            [
                5213,
                5252
            ],
            [
                5252,
                5267
            ],
            [
                5267,
                5347
            ],
            [
                5347,
                5482
            ],
            [
                5482,
                5538
            ],
            [
                5538,
                5614
            ],
            [
                5614,
                5711
            ],
            [
                5711,
                5755
            ],
            [
                5755,
                5766
            ],
            [
                5766,
                5812
            ],
            [
                5812,
                5926
            ],
            [
                5926,
                5974
            ],
            [
                5974,
                5998
            ],
            [
                5998,
                6035
            ],
            [
                6035,
                6069
            ],
            [
                6069,
                6170
            ],
            [
                6170,
                6324
            ],
            [
                6324,
                6407
            ],
            [
                6407,
                6502
            ],
            [
                6502,
                6640
            ],
            [
                6640,
                6640
            ],
            [
                6640,
                6640
            ],
            [
                6640,
                6640
            ],
            [
                6640,
                6640
            ],
            [
                6640,
                6726
            ],
            [
                6726,
                6726
            ],
            [
                6726,
                6814
            ],
            [
                6814,
                6866
            ],
            [
                6866,
                6880
            ],
            [
                6880,
                6895
            ],
            [
                6895,
                6924
            ],
            [
                6924,
                6956
            ],
            [
                6956,
                7026
            ],
            [
                7026,
                7083
            ],
            [
                7083,
                7151
            ],
            [
                7151,
                7216
            ],
            [
                7216,
                7288
            ],
            [
                7288,
                7413
            ],
            [
                7413,
                7450
            ],
            [
                7450,
                7450
            ],
            [
                7450,
                7478
            ],
            [
                7478,
                7478
            ],
            [
                7478,
                7478
            ],
            [
                7478,
                7478
            ],
            [
                7478,
                7527
            ],
            [
                7527,
                7593
            ],
            [
                7593,
                7725
            ],
            [
                7725,
                7832
            ],
            [
                7832,
                7918
            ],
            [
                7918,
                8004
            ],
            [
                8004,
                8063
            ],
            [
                8063,
                8063
            ],
            [
                8063,
                8117
            ],
            [
                8117,
                8203
            ],
            [
                8203,
                8272
            ],
            [
                8272,
                8340
            ],
            [
                8340,
                8431
            ],
            [
                8431,
                8532
            ],
            [
                8532,
                8842
            ],
            [
                8842,
                8857
            ],
            [
                8857,
                8857
            ],
            [
                8857,
                8977
            ],
            [
                8977,
                9115
            ]
        ]
    }
}