{
    "original": {
        "text": "Melmotte had been found dead on Friday morning, and late on the evening of the same day Madame Melmotte and Marie were removed to lodgings far away from the scene of the tragedy, up at Hampstead. Herr Croll had known of the place, and at Lord Nidderdale's instance had busied himself in the matter, and had seen that the rooms were made instantly ready for the widow of his late employer. Nidderdale himself had assisted them in their departure; and the German, with the poor woman's maid, with the jewels also, which had been packed according to Melmotte's last orders to his wife, followed the carriage which took the mother and the daughter. They did not start till nine o'clock in the evening, and Madame Melmotte at the moment would fain have been allowed to rest one other night in Bruton Street. But Lord Nidderdale, with one hardly uttered word, made Marie understand that the inquest would be held early on the following morning, and Marie was imperious with her mother and carried her point. So the poor woman was taken away from Mr. Longestaffe's residence, and never again saw the grandeur of her own house in Grosvenor Square, which she had not visited since the night on which she had helped to entertain the Emperor of China.\nOn Saturday morning the inquest was held. There was not the slightest doubt as to any one of the incidents of the catastrophe. The servants, the doctor, and the inspector of police between them, learned that he had come home alone, that nobody had been near him during the night, that he had been found dead, and that he had undoubtedly been poisoned by prussic acid. It was also proved that he had been drunk in the House of Commons, a fact to which one of the clerks of the House, very much against his will, was called upon to testify. That he had destroyed himself there was no doubt,--nor was there any doubt as to the cause.\nIn such cases as this it is for the jury to say whether the unfortunate one who has found his life too hard for endurance, and has rushed away to see whether he could not find an improved condition of things elsewhere, has or has not been mad at the moment. Surviving friends are of course anxious for a verdict of insanity, as in that case no further punishment is exacted. The body can be buried like any other body, and it can always be said afterwards that the poor man was mad. Perhaps it would be well that all suicides should be said to have been mad, for certainly the jurymen are not generally guided in their verdicts by any accurately ascertained facts. If the poor wretch has, up to his last days, been apparently living a decent life; if he be not hated, or has not in his last moments made himself specially obnoxious to the world at large, then he is declared to have been mad. Who would be heavy on a poor clergyman who has been at last driven by horrid doubts to rid himself of a difficulty from which he saw no escape in any other way? Who would not give the benefit of the doubt to the poor woman whose lover and lord had deserted her? Who would remit to unhallowed earth the body of the once beneficent philosopher who has simply thought that he might as well go now, finding himself powerless to do further good upon earth? Such, and such like, have of course been temporarily insane, though no touch even of strangeness may have marked their conduct up to their last known dealings with their fellow-mortals. But let a Melmotte be found dead, with a bottle of prussic acid by his side--a man who has become horrid to the world because of his late iniquities, a man who has so well pretended to be rich that he has been able to buy and to sell properties without paying for them, a wretch who has made himself odious by his ruin to friends who had taken him up as a pillar of strength in regard to wealth, a brute who had got into the House of Commons by false pretences, and had disgraced the House by being drunk there,--and, of course, he will not be saved by a verdict of insanity from the cross roads, or whatever scornful grave may be allowed to those who have killed themselves, with their wits about them. Just at this moment there was a very strong feeling against Melmotte, owing perhaps as much to his having tumbled over poor Mr. Beauclerk in the House of Commons as to the stories of the forgeries he had committed, and the virtue of the day vindicated itself by declaring him to have been responsible for his actions when he took the poison. He was _felo de se_, and therefore carried away to the cross roads--or elsewhere. But it may be imagined, I think, that during that night he may have become as mad as any other wretch, have been driven as far beyond his powers of endurance as any other poor creature who ever at any time felt himself constrained to go. He had not been so drunk but that he knew all that happened, and could foresee pretty well what would happen. The summons to attend upon the Lord Mayor had been served upon him. There were some, among them Croll and Mr. Brehgert, who absolutely knew that he had committed forgery. He had no money for the Longestaffes, and he was well aware what Squercum would do at once. He had assured himself long ago,--he had assured himself indeed not very long ago,--that he would brave it all like a man. But we none of us know what load we can bear, and what would break our backs. Melmotte's back had been so utterly crushed that I almost think that he was mad enough to have justified a verdict of temporary insanity.\nBut he was carried away, no one knew whither, and for a week his name was hateful. But after that, a certain amount of whitewashing took place, and, in some degree, a restitution of fame was made to the manes of the departed. In Westminster he was always odious. Westminster, which had adopted him, never forgave him. But in other districts it came to be said of him that he had been more sinned against than sinning; and that, but for the jealousy of the old stagers in the mercantile world, he would have done very wonderful things. Marylebone, which is always merciful, took him up quite with affection, and would have returned his ghost to Parliament could his ghost have paid for committee rooms. Finsbury delighted for a while to talk of the great Financier, and even Chelsea thought that he had been done to death by ungenerous tongues. It was, however, Marylebone alone that spoke of a monument.\nMr. Longestaffe came back to his house, taking formal possession of it a few days after the verdict. Of course he was alone. There had been no further question of bringing the ladies of the family up to town; and Dolly altogether declined to share with his father the honour of encountering the dead man's spirit. But there was very much for Mr. Longestaffe to do, and very much also for his son. It was becoming a question with both of them how far they had been ruined by their connection with the horrible man. It was clear that they could not get back the title-deeds of the Pickering property without paying the amount which had been advanced upon them, and it was equally clear that they could not pay that sum unless they were enabled to do so by funds coming out of the Melmotte estate. Dolly, as he sat smoking upon the stool in Mr. Squercum's office, where he now passed a considerable portion of his time, looked upon himself as a miracle of ill-usage.\n\"By George, you know, I shall have to go to law with the governor. There's nothing else for it; is there, Squercum?\"\nSquercum suggested that they had better wait till they found what pickings there might be out of the Melmotte estate. He had made inquiries too about that, and had been assured that there must be property, but property so involved and tied up as to make it impossible to lay hands upon it suddenly. \"They say that the things in the square, and the plate, and the carriages and horses, and all that, ought to fetch between twenty and thirty thousand. There were a lot of jewels, but the women have taken them,\" said Squercum.\n\"By George, they ought to be made to give up everything. Did you ever hear of such a thing;--the very house pulled down;--my house; and all done without a word from me in the matter? I don't suppose such a thing was ever known before, since properties were properties.\" Then he uttered sundry threats against the Bideawhiles, in reference to whom he declared his intention of \"making it very hot for them.\"\nIt was an annoyance added to the elder Mr. Longestaffe that the management of Melmotte's affairs fell at last almost exclusively into the hands of Mr. Brehgert. Now Brehgert, in spite of his many dealings with Melmotte, was an honest man, and, which was perhaps of as much immediate consequence, both an energetic and a patient man. But then he was the man who had wanted to marry Georgiana Longestaffe, and he was the man to whom Mr. Longestaffe had been particularly uncivil. Then there arose necessities for the presence of Mr. Brehgert in the house in which Melmotte had lately lived and had died. The dead man's papers were still there,--deeds, documents, and such letters as he had not chosen to destroy;--and these could not be removed quite at once. \"Mr. Brehgert must of course have access to my private room, as long as it is necessary,--absolutely necessary,\" said Mr. Longestaffe in answer to a message which was brought to him; \"but he will of course see the expediency of relieving me from such intrusion as soon as possible.\" But he soon found it preferable to come to terms with the rejected suitor, especially as the man was singularly good-natured and forbearing after the injuries he had received.\nAll minor debts were to be paid at once; an arrangement to which Mr. Longestaffe cordially agreed, as it included a sum of 300 due to him for the rent of his house in Bruton Street. Then by degrees it became known that there would certainly be a dividend of not less than fifty per cent. payable on debts which could be proved to have been owing by Melmotte, and perhaps of more;--an arrangement which was very comfortable to Dolly, as it had been already agreed between all the parties interested that the debt due to him should be satisfied before the father took anything. Mr. Longestaffe resolved during these weeks that he remained in town that, as regarded himself and his own family, the house in London should not only not be kept up, but that it should be absolutely sold, with all its belongings, and that the servants at Caversham should be reduced in number, and should cease to wear powder. All this was communicated to Lady Pomona in a very long letter, which she was instructed to read to her daughters. \"I have suffered great wrongs,\" said Mr. Longestaffe, \"but I must submit to them, and as I submit so must my wife and children. If our son were different from what he is the sacrifice might probably be made lighter. His nature I cannot alter, but from my daughters I expect cheerful obedience.\" From what incidents of his past life he was led to expect cheerfulness at Caversham it might be difficult to say; but the obedience was there. Georgey was for the time broken down; Sophia was satisfied with her nuptial prospects, and Lady Pomona had certainly no spirits left for a combat. I think the loss of the hair-powder afflicted her most; but she said not a word even about that.\nBut in all this the details necessary for the telling of our story are anticipated. Mr. Longestaffe had remained in London actually over the 1st of September, which in Suffolk is the one great festival of the year, before the letter was written to which allusion has been made. In the meantime he saw much of Mr. Brehgert, and absolutely formed a kind of friendship for that gentleman, in spite of the abomination of his religion,--so that on one occasion he even condescended to ask Mr. Brehgert to dine alone with him in Bruton Street. This, too, was in the early days of the arrangement of the Melmotte affairs, when Mr. Longestaffe's heart had been softened by that arrangement with reference to the rent. Mr. Brehgert came, and there arose a somewhat singular conversation between the two gentlemen as they sat together over a bottle of Mr. Longestaffe's old port wine. Hitherto not a word had passed between them respecting the connection which had once been proposed, since the day on which the young lady's father had said so many bitter things to the expectant bridegroom. But in this evening Mr. Brehgert, who was by no means a coward in such matters and whose feelings were not perhaps painfully fine, spoke his mind in a way that at first startled Mr. Longestaffe. The subject was introduced by a reference which Brehgert had made to his own affairs. His loss would be, at any rate, double that which Mr. Longestaffe would have to bear;--but he spoke of it in an easy way, as though it did not sit very near his heart. \"Of course there's a difference between me and you,\" he said. Mr. Longestaffe bowed his head graciously, as much as to say that there was of course a very wide difference. \"In our affairs,\" continued Brehgert, \"we expect gains, and of course look for occasional losses. When a gentleman in your position sells a property he expects to get the purchase-money.\"\n\"Of course he does, Mr. Brehgert. That's what made it so hard.\"\n\"I can't even yet quite understand how it was with him, or why he took upon himself to spend such an enormous deal of money here in London. His business was quite irregular, but there was very much of it, and some of it immensely profitable. He took us in completely.\"\n\"I suppose so.\"\n\"It was old Mr. Todd that first took to him;--but I was deceived as much as Todd, and then I ventured on a speculation with him outside of our house. The long and the short of it is that I shall lose something about sixty thousand pounds.\"\n\"That's a large sum of money.\"\n\"Very large;--so large as to affect my daily mode of life. In my correspondence with your daughter, I considered it to be my duty to point out to her that it would be so. I do not know whether she told you.\"\nThis reference to his daughter for the moment altogether upset Mr. Longestaffe. The reference was certainly most indelicate, most deserving of censure; but Mr. Longestaffe did not know how to pronounce his censure on the spur of the moment, and was moreover at the present time so very anxious for Brehgert's assistance in the arrangement of his affairs that, so to say, he could not afford to quarrel with the man. But he assumed something more than his normal dignity as he asserted that his daughter had never mentioned the fact.\n\"It was so,\" said Brehgert.\n\"No doubt;\"--and Mr. Longestaffe assumed a great deal of dignity.\n\"Yes; it was so. I had promised your daughter when she was good enough to listen to the proposition which I made to her, that I would maintain a second house when we should be married.\"\n\"It was impossible,\" said Mr. Longestaffe,--meaning to assert that such hymeneals were altogether unnatural and out of the question.\n\"It would have been quite possible as things were when that proposition was made. But looking forward to the loss which I afterwards anticipated from the affairs of our deceased friend, I found it to be prudent to relinquish my intention for the present, and I thought myself bound to inform Miss Longestaffe.\"\n\"There were other reasons,\" muttered Mr. Longestaffe, in a suppressed voice, almost in a whisper,--in a whisper which was intended to convey a sense of present horror and a desire for future reticence.\n\"There may have been; but in the last letter which Miss Longestaffe did me the honour to write to me,--a letter with which I have not the slightest right to find any fault,--she seemed to me to confine herself almost exclusively to that reason.\"\n\"Why mention this now, Mr. Brehgert; why mention this now? The subject is painful.\"\n\"Just because it is not painful to me, Mr. Longestaffe; and because I wish that all they who have heard of the matter should know that it is not painful. I think that throughout I behaved like a gentleman.\" Mr. Longestaffe, in an agony, first shook his head twice, and then bowed it three times, leaving the Jew to take what answer he could from so dubious an oracle. \"I am sure,\" continued Brehgert, \"that I behaved like an honest man; and I didn't quite like that the matter should be passed over as if I was in any way ashamed of myself.\"\n\"Perhaps on so delicate a subject the less said the soonest mended.\"\n\"I've nothing more to say, and I've nothing at all to mend.\" Finishing the conversation with this little speech Brehgert arose to take his leave, making some promise at the time that he would use all the expedition in his power to complete the arrangement of the Melmotte affairs.\nAs soon as he was gone Mr. Longestaffe opened the door and walked about the room and blew out long puffs of breath, as though to cleanse himself from the impurities of his late contact. He told himself that he could not touch pitch and not be defiled! How vulgar had the man been, how indelicate, how regardless of all feeling, how little grateful for the honour which Mr. Longestaffe had conferred upon him by asking him to dinner! Yes;--yes! A horrid Jew! Were not all Jews necessarily an abomination? Yet Mr. Longestaffe was aware that in the present crisis of his fortunes he could not afford to quarrel with Mr. Brehgert.",
        "paragraph_chars": [
            [
                0,
                1241
            ],
            [
                1241,
                1872
            ],
            [
                1872,
                5481
            ],
            [
                5481,
                6385
            ],
            [
                6385,
                7349
            ],
            [
                7349,
                7466
            ],
            [
                7466,
                7991
            ],
            [
                7991,
                8398
            ],
            [
                8398,
                9615
            ],
            [
                9615,
                11316
            ],
            [
                11316,
                13207
            ],
            [
                13207,
                13271
            ],
            [
                13271,
                13540
            ],
            [
                13540,
                13556
            ],
            [
                13556,
                13796
            ],
            [
                13796,
                13827
            ],
            [
                13827,
                14035
            ],
            [
                14035,
                14568
            ],
            [
                14568,
                14596
            ],
            [
                14596,
                14662
            ],
            [
                14662,
                14848
            ],
            [
                14848,
                14981
            ],
            [
                14981,
                15292
            ],
            [
                15292,
                15494
            ],
            [
                15494,
                15740
            ],
            [
                15740,
                15824
            ],
            [
                15824,
                16366
            ],
            [
                16366,
                16435
            ],
            [
                16435,
                16716
            ],
            [
                16716,
                17342
            ]
        ],
        "segment_chars": [
            [
                0,
                196
            ],
            [
                196,
                389
            ],
            [
                389,
                645
            ],
            [
                645,
                803
            ],
            [
                803,
                1002
            ],
            [
                1002,
                1241
            ],
            [
                1241,
                1283
            ],
            [
                1283,
                1368
            ],
            [
                1368,
                1609
            ],
            [
                1609,
                1780
            ],
            [
                1780,
                1872
            ],
            [
                1872,
                2130
            ],
            [
                2130,
                2247
            ],
            [
                2247,
                2355
            ],
            [
                2355,
                2537
            ],
            [
                2537,
                2765
            ],
            [
                2765,
                2926
            ],
            [
                2926,
                3027
            ],
            [
                3027,
                3217
            ],
            [
                3217,
                3403
            ],
            [
                3403,
                4107
            ],
            [
                4107,
                4449
            ],
            [
                4449,
                4531
            ],
            [
                4531,
                4769
            ],
            [
                4769,
                4879
            ],
            [
                4879,
                4947
            ],
            [
                4947,
                5050
            ],
            [
                5050,
                5142
            ],
            [
                5142,
                5265
            ],
            [
                5265,
                5343
            ],
            [
                5343,
                5481
            ],
            [
                5481,
                5564
            ],
            [
                5564,
                5707
            ],
            [
                5707,
                5744
            ],
            [
                5744,
                5799
            ],
            [
                5799,
                6016
            ],
            [
                6016,
                6183
            ],
            [
                6183,
                6325
            ],
            [
                6325,
                6385
            ],
            [
                6385,
                6486
            ],
            [
                6486,
                6510
            ],
            [
                6510,
                6699
            ],
            [
                6699,
                6782
            ],
            [
                6782,
                6899
            ],
            [
                6899,
                7180
            ],
            [
                7180,
                7349
            ],
            [
                7349,
                7416
            ],
            [
                7416,
                7466
            ],
            [
                7466,
                7584
            ],
            [
                7584,
                7765
            ],
            [
                7765,
                7916
            ],
            [
                7916,
                7991
            ],
            [
                7991,
                8048
            ],
            [
                8048,
                8174
            ],
            [
                8174,
                8261
            ],
            [
                8261,
                8398
            ],
            [
                8398,
                8559
            ],
            [
                8559,
                8731
            ],
            [
                8731,
                8876
            ],
            [
                8876,
                9000
            ],
            [
                9000,
                9156
            ],
            [
                9156,
                9439
            ],
            [
                9439,
                9615
            ],
            [
                9615,
                9797
            ],
            [
                9797,
                9903
            ],
            [
                9903,
                10191
            ],
            [
                10191,
                10519
            ],
            [
                10519,
                10634
            ],
            [
                10634,
                10762
            ],
            [
                10762,
                10850
            ],
            [
                10850,
                10929
            ],
            [
                10929,
                11072
            ],
            [
                11072,
                11219
            ],
            [
                11219,
                11316
            ],
            [
                11316,
                11400
            ],
            [
                11400,
                11594
            ],
            [
                11594,
                11854
            ],
            [
                11854,
                12026
            ],
            [
                12026,
                12191
            ],
            [
                12191,
                12398
            ],
            [
                12398,
                12593
            ],
            [
                12593,
                12679
            ],
            [
                12679,
                12847
            ],
            [
                12847,
                12909
            ],
            [
                12909,
                13019
            ],
            [
                13019,
                13117
            ],
            [
                13117,
                13207
            ],
            [
                13207,
                13241
            ],
            [
                13241,
                13271
            ],
            [
                13271,
                13411
            ],
            [
                13411,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13556
            ],
            [
                13556,
                13706
            ],
            [
                13706,
                13796
            ],
            [
                13796,
                13827
            ],
            [
                13827,
                13886
            ],
            [
                13886,
                13998
            ],
            [
                13998,
                14035
            ],
            [
                14035,
                14115
            ],
            [
                14115,
                14451
            ],
            [
                14451,
                14568
            ],
            [
                14568,
                14596
            ],
            [
                14596,
                14662
            ],
            [
                14662,
                14679
            ],
            [
                14679,
                14848
            ],
            [
                14848,
                14981
            ],
            [
                14981,
                15063
            ],
            [
                15063,
                15292
            ],
            [
                15292,
                15494
            ],
            [
                15494,
                15740
            ],
            [
                15740,
                15799
            ],
            [
                15799,
                15824
            ],
            [
                15824,
                15978
            ],
            [
                15978,
                16031
            ],
            [
                16031,
                16192
            ],
            [
                16192,
                16366
            ],
            [
                16366,
                16435
            ],
            [
                16435,
                16496
            ],
            [
                16496,
                16716
            ],
            [
                16716,
                16902
            ],
            [
                16902,
                16968
            ],
            [
                16968,
                17149
            ],
            [
                17149,
                17160
            ],
            [
                17160,
                17174
            ],
            [
                17174,
                17220
            ],
            [
                17220,
                17342
            ]
        ],
        "overlap_chars": [
            [
                0,
                56
            ],
            [
                64,
                71
            ],
            [
                88,
                118
            ],
            [
                127,
                147
            ],
            [
                179,
                196
            ],
            [
                196,
                255
            ],
            [
                303,
                331
            ],
            [
                337,
                346
            ],
            [
                332,
                336
            ],
            [
                347,
                352
            ],
            [
                387,
                389
            ],
            [
                389,
                411
            ],
            [
                421,
                425
            ],
            [
                643,
                645
            ],
            [
                645,
                657
            ],
            [
                664,
                717
            ],
            [
                732,
                747
            ],
            [
                769,
                772
            ],
            [
                779,
                803
            ],
            [
                803,
                806
            ],
            [
                943,
                978
            ],
            [
                1002,
                1034
            ],
            [
                1239,
                1241
            ],
            [
                1241,
                1283
            ],
            [
                1368,
                1401
            ],
            [
                1415,
                1421
            ],
            [
                1402,
                1411
            ],
            [
                1444,
                1448
            ],
            [
                1452,
                1520
            ],
            [
                1550,
                1553
            ],
            [
                1521,
                1549
            ],
            [
                1583,
                1609
            ],
            [
                1810,
                1828
            ],
            [
                1780,
                1809
            ],
            [
                1831,
                1834
            ],
            [
                1855,
                1872
            ],
            [
                1872,
                1885
            ],
            [
                1894,
                1947
            ],
            [
                1952,
                1955
            ],
            [
                2106,
                2121
            ],
            [
                2128,
                2130
            ],
            [
                2130,
                2196
            ],
            [
                2203,
                2207
            ],
            [
                2247,
                2354
            ],
            [
                3403,
                3435
            ],
            [
                3480,
                3520
            ],
            [
                3551,
                3566
            ],
            [
                3575,
                3595
            ],
            [
                3797,
                3810
            ],
            [
                3604,
                3607
            ],
            [
                3815,
                3868
            ],
            [
                3686,
                3689
            ],
            [
                3873,
                3913
            ],
            [
                3932,
                3977
            ],
            [
                4105,
                4107
            ],
            [
                4127,
                4176
            ],
            [
                4322,
                4325
            ],
            [
                4304,
                4306
            ],
            [
                4383,
                4448
            ],
            [
                4553,
                4562
            ],
            [
                4564,
                4632
            ],
            [
                4644,
                4650
            ],
            [
                4658,
                4688
            ],
            [
                4767,
                4769
            ],
            [
                4769,
                4771
            ],
            [
                4834,
                4879
            ],
            [
                5024,
                5048
            ],
            [
                5050,
                5091
            ],
            [
                5095,
                5132
            ],
            [
                5140,
                5142
            ],
            [
                5142,
                5164
            ],
            [
                5226,
                5239
            ],
            [
                5246,
                5263
            ],
            [
                5173,
                5174
            ],
            [
                5269,
                5342
            ],
            [
                5488,
                5504
            ],
            [
                5525,
                5564
            ],
            [
                5564,
                5579
            ],
            [
                5668,
                5671
            ],
            [
                5580,
                5612
            ],
            [
                5705,
                5707
            ],
            [
                5707,
                5742
            ],
            [
                5897,
                5898
            ],
            [
                5799,
                5802
            ],
            [
                6016,
                6026
            ],
            [
                6054,
                6087
            ],
            [
                6208,
                6213
            ],
            [
                6183,
                6201
            ],
            [
                6214,
                6307
            ],
            [
                6316,
                6324
            ],
            [
                6385,
                6423
            ],
            [
                6484,
                6486
            ],
            [
                6703,
                6712
            ],
            [
                6718,
                6726
            ],
            [
                6814,
                6818
            ],
            [
                6750,
                6753
            ],
            [
                6743,
                6749
            ],
            [
                6827,
                6855
            ],
            [
                6897,
                6899
            ],
            [
                6917,
                7047
            ],
            [
                7074,
                7179
            ],
            [
                7180,
                7204
            ],
            [
                7220,
                7245
            ],
            [
                7300,
                7301
            ],
            [
                7349,
                7416
            ],
            [
                7416,
                7466
            ],
            [
                7466,
                7555
            ],
            [
                7563,
                7584
            ],
            [
                7765,
                7783
            ],
            [
                7804,
                7813
            ],
            [
                7814,
                7824
            ],
            [
                7829,
                7916
            ],
            [
                7916,
                7973
            ],
            [
                7991,
                8046
            ],
            [
                8261,
                8265
            ],
            [
                8269,
                8276
            ],
            [
                8284,
                8316
            ],
            [
                8266,
                8268
            ],
            [
                8367,
                8368
            ],
            [
                8375,
                8398
            ],
            [
                8398,
                8407
            ],
            [
                8418,
                8423
            ],
            [
                8408,
                8417
            ],
            [
                8424,
                8486
            ],
            [
                8495,
                8507
            ],
            [
                8527,
                8559
            ],
            [
                8559,
                8640
            ],
            [
                8702,
                8715
            ],
            [
                8718,
                8725
            ],
            [
                8729,
                8731
            ],
            [
                8731,
                8734
            ],
            [
                8740,
                8805
            ],
            [
                8821,
                8876
            ],
            [
                8927,
                8937
            ],
            [
                9097,
                9099
            ],
            [
                8938,
                8950
            ],
            [
                9038,
                9039
            ],
            [
                8905,
                8908
            ],
            [
                9000,
                9038
            ],
            [
                9079,
                9089
            ],
            [
                8986,
                8989
            ],
            [
                9120,
                9129
            ],
            [
                9130,
                9140
            ],
            [
                8998,
                8999
            ],
            [
                9156,
                9216
            ],
            [
                9228,
                9233
            ],
            [
                9246,
                9289
            ],
            [
                9337,
                9351
            ],
            [
                9394,
                9439
            ],
            [
                9443,
                9563
            ],
            [
                9579,
                9615
            ],
            [
                9615,
                9695
            ],
            [
                9706,
                9768
            ],
            [
                9773,
                9797
            ],
            [
                9797,
                9801
            ],
            [
                9813,
                9872
            ],
            [
                9887,
                9901
            ],
            [
                9903,
                9925
            ],
            [
                10054,
                10057
            ],
            [
                9950,
                9972
            ],
            [
                9993,
                9994
            ],
            [
                9996,
                10046
            ],
            [
                10189,
                10191
            ],
            [
                10191,
                10239
            ],
            [
                10290,
                10293
            ],
            [
                10310,
                10332
            ],
            [
                10346,
                10348
            ],
            [
                10391,
                10484
            ],
            [
                10517,
                10518
            ],
            [
                10519,
                10633
            ],
            [
                10634,
                10665
            ],
            [
                10671,
                10762
            ],
            [
                10881,
                10929
            ],
            [
                10934,
                10938
            ],
            [
                10973,
                10976
            ],
            [
                10977,
                11015
            ],
            [
                11025,
                11072
            ],
            [
                11072,
                11108
            ],
            [
                11157,
                11158
            ],
            [
                11110,
                11157
            ],
            [
                11217,
                11218
            ],
            [
                11402,
                11415
            ],
            [
                11420,
                11438
            ],
            [
                11473,
                11474
            ],
            [
                11610,
                11642
            ],
            [
                11654,
                11681
            ],
            [
                11686,
                11745
            ],
            [
                11592,
                11593
            ],
            [
                11772,
                11774
            ],
            [
                11775,
                11779
            ],
            [
                11800,
                11820
            ],
            [
                11827,
                11854
            ],
            [
                12026,
                12054
            ],
            [
                12061,
                12190
            ],
            [
                12200,
                12234
            ],
            [
                12246,
                12249
            ],
            [
                12289,
                12313
            ],
            [
                12331,
                12398
            ],
            [
                12398,
                12401
            ],
            [
                12405,
                12430
            ],
            [
                12529,
                12592
            ],
            [
                12593,
                12649
            ],
            [
                12654,
                12679
            ],
            [
                12679,
                12696
            ],
            [
                12711,
                12717
            ],
            [
                12729,
                12744
            ],
            [
                12763,
                12764
            ],
            [
                12766,
                12846
            ],
            [
                12847,
                12909
            ],
            [
                12909,
                12950
            ],
            [
                13017,
                13019
            ],
            [
                13019,
                13117
            ],
            [
                13117,
                13207
            ],
            [
                13207,
                13241
            ],
            [
                13241,
                13271
            ],
            [
                13271,
                13305
            ],
            [
                13330,
                13336
            ],
            [
                13355,
                13411
            ],
            [
                13411,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13556
            ],
            [
                13556,
                13557
            ],
            [
                13647,
                13683
            ],
            [
                13599,
                13600
            ],
            [
                13638,
                13641
            ],
            [
                13706,
                13755
            ],
            [
                13766,
                13796
            ],
            [
                13796,
                13827
            ],
            [
                13827,
                13839
            ],
            [
                13841,
                13886
            ],
            [
                13886,
                13942
            ],
            [
                13949,
                13998
            ],
            [
                13998,
                14035
            ],
            [
                14035,
                14039
            ],
            [
                14040,
                14065
            ],
            [
                14081,
                14115
            ],
            [
                14129,
                14132
            ],
            [
                14313,
                14315
            ],
            [
                14321,
                14354
            ],
            [
                14389,
                14393
            ],
            [
                14406,
                14451
            ],
            [
                14451,
                14465
            ],
            [
                14476,
                14510
            ],
            [
                14520,
                14568
            ],
            [
                14568,
                14578
            ],
            [
                14594,
                14595
            ],
            [
                14679,
                14707
            ],
            [
                14783,
                14848
            ],
            [
                14848,
                14889
            ],
            [
                14892,
                14899
            ],
            [
                14967,
                14970
            ],
            [
                14979,
                14981
            ],
            [
                14981,
                15035
            ],
            [
                15061,
                15063
            ],
            [
                15063,
                15066
            ],
            [
                15067,
                15102
            ],
            [
                15114,
                15125
            ],
            [
                15165,
                15177
            ],
            [
                15192,
                15292
            ],
            [
                15292,
                15361
            ],
            [
                15381,
                15388
            ],
            [
                15492,
                15494
            ],
            [
                15494,
                15595
            ],
            [
                15668,
                15678
            ],
            [
                15685,
                15740
            ],
            [
                15740,
                15775
            ],
            [
                15797,
                15799
            ],
            [
                15799,
                15824
            ],
            [
                15824,
                15825
            ],
            [
                15830,
                15898
            ],
            [
                15949,
                15978
            ],
            [
                15978,
                16028
            ],
            [
                16028,
                16030
            ],
            [
                16031,
                16097
            ],
            [
                16107,
                16118
            ],
            [
                16190,
                16192
            ],
            [
                16366,
                16374
            ],
            [
                16404,
                16435
            ],
            [
                16435,
                16478
            ],
            [
                16486,
                16496
            ],
            [
                16523,
                16580
            ],
            [
                16631,
                16634
            ],
            [
                16650,
                16716
            ],
            [
                16716,
                16754
            ],
            [
                16775,
                16865
            ],
            [
                16870,
                16880
            ],
            [
                16900,
                16902
            ],
            [
                16968,
                17011
            ],
            [
                17042,
                17104
            ],
            [
                17120,
                17149
            ],
            [
                17160,
                17174
            ],
            [
                17220,
                17276
            ],
            [
                17293,
                17342
            ]
        ],
        "row_chars": [
            [
                0,
                196
            ],
            [
                196,
                389
            ],
            [
                389,
                645
            ],
            [
                645,
                803
            ],
            [
                803,
                1241
            ],
            [
                1241,
                1283
            ],
            [
                1283,
                1368
            ],
            [
                1368,
                1609
            ],
            [
                1609,
                1780
            ],
            [
                1780,
                1872
            ],
            [
                1872,
                2130
            ],
            [
                2130,
                2355
            ],
            [
                2355,
                2537
            ],
            [
                2537,
                2765
            ],
            [
                2765,
                2926
            ],
            [
                2926,
                3027
            ],
            [
                3027,
                3217
            ],
            [
                3217,
                3403
            ],
            [
                3403,
                4107
            ],
            [
                4107,
                4449
            ],
            [
                4449,
                4531
            ],
            [
                4531,
                4769
            ],
            [
                4769,
                4879
            ],
            [
                4879,
                4947
            ],
            [
                4947,
                5142
            ],
            [
                5142,
                5343
            ],
            [
                5343,
                5481
            ],
            [
                5481,
                5564
            ],
            [
                5564,
                5707
            ],
            [
                5707,
                6325
            ],
            [
                6325,
                6385
            ],
            [
                6385,
                6486
            ],
            [
                6486,
                6510
            ],
            [
                6510,
                6699
            ],
            [
                6699,
                6899
            ],
            [
                6899,
                7180
            ],
            [
                7180,
                7416
            ],
            [
                7416,
                7466
            ],
            [
                7466,
                7584
            ],
            [
                7584,
                7765
            ],
            [
                7765,
                7916
            ],
            [
                7916,
                7991
            ],
            [
                7991,
                8048
            ],
            [
                8048,
                8174
            ],
            [
                8174,
                8261
            ],
            [
                8261,
                8398
            ],
            [
                8398,
                8559
            ],
            [
                8559,
                8731
            ],
            [
                8731,
                8876
            ],
            [
                8876,
                9156
            ],
            [
                9156,
                9439
            ],
            [
                9439,
                9615
            ],
            [
                9615,
                9797
            ],
            [
                9797,
                10191
            ],
            [
                10191,
                10519
            ],
            [
                10519,
                10634
            ],
            [
                10634,
                10762
            ],
            [
                10762,
                10850
            ],
            [
                10850,
                10929
            ],
            [
                10929,
                11072
            ],
            [
                11072,
                11219
            ],
            [
                11219,
                11316
            ],
            [
                11316,
                11400
            ],
            [
                11400,
                11854
            ],
            [
                11854,
                12026
            ],
            [
                12026,
                12191
            ],
            [
                12191,
                12398
            ],
            [
                12398,
                12593
            ],
            [
                12593,
                12679
            ],
            [
                12679,
                12847
            ],
            [
                12847,
                12909
            ],
            [
                12909,
                13019
            ],
            [
                13019,
                13117
            ],
            [
                13117,
                13207
            ],
            [
                13207,
                13241
            ],
            [
                13241,
                13271
            ],
            [
                13271,
                13411
            ],
            [
                13411,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13556
            ],
            [
                13556,
                13796
            ],
            [
                13796,
                13827
            ],
            [
                13827,
                13886
            ],
            [
                13886,
                13998
            ],
            [
                13998,
                14035
            ],
            [
                14035,
                14115
            ],
            [
                14115,
                14451
            ],
            [
                14451,
                14568
            ],
            [
                14568,
                14596
            ],
            [
                14596,
                14662
            ],
            [
                14662,
                14679
            ],
            [
                14679,
                14848
            ],
            [
                14848,
                14981
            ],
            [
                14981,
                15063
            ],
            [
                15063,
                15292
            ],
            [
                15292,
                15494
            ],
            [
                15494,
                15740
            ],
            [
                15740,
                15799
            ],
            [
                15799,
                15824
            ],
            [
                15824,
                15978
            ],
            [
                15978,
                16031
            ],
            [
                16031,
                16192
            ],
            [
                16192,
                16366
            ],
            [
                16366,
                16435
            ],
            [
                16435,
                16496
            ],
            [
                16496,
                16716
            ],
            [
                16716,
                16902
            ],
            [
                16902,
                16968
            ],
            [
                16968,
                17149
            ],
            [
                17149,
                17160
            ],
            [
                17160,
                17174
            ],
            [
                17174,
                17220
            ],
            [
                17220,
                17342
            ]
        ]
    },
    "abridged": {
        "text": "Melmotte had been found dead on Friday morning, and late that evening Madame Melmotte and Marie were moved to lodgings far away up at Hampstead. Herr Croll had known of the place, and at Lord Nidderdale's request had seen that the rooms were instantly made ready. Nidderdale himself had helped them depart. They did not go till nine o'clock in the evening, and Madame Melmotte would fain have stayed one more night in Bruton Street. But Marie was imperious with her mother; so the poor woman was taken away.\nOn Saturday morning the inquest was held. The servants, the doctor, and the police inspector agreed that Melmotte had come home alone, that nobody had been near him during the night, and that he had been found dead, poisoned by prussic acid. There was no doubt that he had destroyed himself - nor as to the cause.\nIn such cases it is for the jury to say whether the unfortunate one has been mad at the time. Surviving friends are of course anxious for a verdict of insanity, so that the body can be buried like any other body, and it can always be said afterwards that the poor man was mad.\nBut let a Melmotte be found dead - a man who has become horrid to the world, a man who has pretended to be rich, a brute who has got into the House of Commons by false pretences, and has disgraced the House by being drunk there - he will not be saved by a verdict of insanity. There was a very strong feeling against Melmotte, and he was declared to have been responsible for his actions when he took the poison.\nAll the same, I think that during that night he may have become as mad as any other wretch driven beyond his powers of endurance. He could foresee pretty well what would happen. He had committed forgery; he had no money for the Longestaffes, and was well aware what Squercum would do. Although he had assured himself that he would bear it all like a man, we none of us know what load we can bear, and what would break our backs.\nHis body was carried away, and for a week his name was hateful. But after that, there was a certain amount of whitewashing. In Westminster he was always odious; but Marylebone took him up quite with affection, while Finsbury delighted to talk of the great Financier, and even Chelsea thought that he had been done to death by unkind tongues.\nMr. Longestaffe came back to his house alone. There was much for both him and Dolly to do, in working out how far they had been ruined. They could not get back the title-deeds of the Pickering property without paying the amount which had been advanced upon them, and they could not pay that sum unless they were enabled to do so by funds coming out of the Melmotte estate.\nDolly, as he sat smoking in Mr. Squercum's office, said, \"By George, you know, I shall have to go to law with the governor. There's nothing else for it; is there, Squercum?\"\nSquercum suggested that they had better wait till they found what pickings there might be from the Melmotte estate. \"They say that the furnishings, and the silver plate, and carriages and horses, and all that, ought to fetch between twenty and thirty thousand. There were a lot of jewels, but the women have taken them.\"\n\"By George, they ought to be made to give up everything.\" Then Dolly uttered threats against the Bideawhiles, declaring he would \"make it very hot for them.\"\nIt was an added annoyance to the elder Mr. Longestaffe that the management of Melmotte's estate fell at last into the hands of Mr. Brehgert. Now Brehgert, in spite of his many dealings with Melmotte, was an honest man, and also energetic and patient. But he was the man who had wanted to marry Georgiana Longestaffe, and to whom Mr. Longestaffe had been particularly uncivil. Mr. Brehgert needed to be in the house, for the dead man's papers were still there - those that he had not destroyed - and could not yet be removed.\n\"Mr. Brehgert must of course have access to my private room, if it is absolutely necessary,\" said Mr. Longestaffe; \"but he will relieve me from such intrusion as soon as possible.\" However, he soon found it preferable to come to terms with the rejected suitor, especially as the man was singularly good-natured after the injuries he had received.\nAll minor debts were to be paid at once; an arrangement to which Mr. Longestaffe agreed, as it included a sum of 300 due to him for the rent of the house in Bruton Street. Then it became known that there would certainly be a dividend of at least fifty per cent payable on debts which had been owing by Melmotte; an arrangement which was very comfortable to Dolly. Mr. Longestaffe resolved during these weeks that his house in London should be sold, with all its belongings, and that the servants at Caversham should be reduced in number.\nAll this was communicated to Lady Pomona in a very long letter, which she was instructed to read to her daughters.\n\"I have suffered great wrongs,\" wrote Mr. Longestaffe, \"but I must submit to them, and as I submit so must my wife and children. From my daughters I expect cheerful obedience.\" Exactly what led him to expect cheerfulness at Caversham it is difficult to say; but the obedience was there. Georgey was for the time broken down, while Sophia was satisfied with her nuptial prospects.\nWhile Mr. Longestaffe remained in London, he saw much of Mr. Brehgert, and formed a kind of friendship with that gentleman, in spite of the abomination of his religion. He once even asked Mr. Brehgert to dine with him in Bruton Street. Mr. Brehgert came, and there was a somewhat singular conversation between the two gentlemen as they sat together over a bottle of Mr. Longestaffe's old port wine.\nUntil then not a word had passed between them about the engagement with Georgiana, since the day on which her father had said so many bitter things to the expectant bridegroom. But this evening Mr. Brehgert spoke his mind in a way that at first startled Mr. Longestaffe.\nThe subject was introduced by a reference which Brehgert made to his own affairs. His loss would be double Mr. Longestaffe's; but he spoke of it in an easy way, as though it did not sit very near his heart.\n\"Of course there's a difference between me and you,\" he said. Mr. Longestaffe bowed his head graciously. \"In our affairs,\" continued Brehgert, \"we expect gains, and of course look for occasional losses. When a gentleman in your position sells a property he expects to get the purchase-money.\"\n\"Of course he does, Mr. Brehgert. That's what made it so hard.\"\n\"I can't even yet quite understand why he decided to spend such an enormous deal of money here in London. His business was quite irregular, but there was very much of it, and some of it immensely profitable. He took us in completely.\"\n\"I suppose so.\"\n\"I ventured on a speculation with him; and the long and the short of it is that I shall lose about sixty thousand pounds.\"\n\"That's a large sum of money.\"\n\"Very large; so large as to affect my daily mode of life. In my correspondence with your daughter, I considered it my duty to point out to her that it would be so. I do not know whether she told you.\"\nThis indelicate reference to his daughter altogether upset Mr. Longestaffe. He was so anxious for Brehgert's assistance that he could not afford to quarrel with the man. But he assumed more than his normal dignity as he said that his daughter had never mentioned the fact.\n\"It was so. I had promised your daughter that I would maintain a second house when we should be married.\"\n\"It was impossible,\" said Mr. Longestaffe - meaning the marriage.\n\"It would have been quite possible as things were when I proposed. But on looking forward to the loss which I anticipated, I found it best to relinquish my intention for the present, and I thought myself bound to inform Miss Longestaffe.\"\n\"There were other reasons,\" muttered Mr. Longestaffe, in a suppressed whisper.\n\"There may have been; but in the last letter which Miss Longestaffe did me the honour to write to me, she seemed to confine herself almost exclusively to that reason.\"\n\"Why mention this now, Mr. Brehgert? The subject is painful.\"\n\"Because it is not painful to me, Mr. Longestaffe; and because I wish everyone to know that it is not painful. I think that throughout I behaved like a gentleman and an honest man.\"\nMr. Longestaffe, in an agony, first shook his head twice, and then nodded three times. \"Perhaps less said the soonest mended.\"\n\"I've nothing more to say, and I've nothing to mend.\" With this little speech Brehgert arose to take his leave, promising to do all in his power to complete the arrangement of the Melmotte affairs.\nAs soon as he was gone Mr. Longestaffe walked about the room and blew out long puffs of breath, as though to cleanse himself from impurities. How vulgar had the man been, how indelicate, how little grateful for the honour which Mr. Longestaffe had shown him by asking him to dinner! A horrid Jew! Yet Mr. Longestaffe was aware that in the present crisis he could not afford to quarrel with Mr. Brehgert.",
        "paragraph_chars": [
            [
                0,
                508
            ],
            [
                508,
                822
            ],
            [
                822,
                1099
            ],
            [
                1099,
                1512
            ],
            [
                1512,
                1941
            ],
            [
                1941,
                2283
            ],
            [
                2283,
                2656
            ],
            [
                2656,
                2830
            ],
            [
                2830,
                3151
            ],
            [
                3151,
                3309
            ],
            [
                3309,
                3834
            ],
            [
                3834,
                4181
            ],
            [
                4181,
                4719
            ],
            [
                4719,
                4834
            ],
            [
                4834,
                5214
            ],
            [
                5214,
                5613
            ],
            [
                5613,
                5884
            ],
            [
                5884,
                6091
            ],
            [
                6091,
                6384
            ],
            [
                6384,
                6448
            ],
            [
                6448,
                6683
            ],
            [
                6683,
                6699
            ],
            [
                6699,
                6822
            ],
            [
                6822,
                6853
            ],
            [
                6853,
                7054
            ],
            [
                7054,
                7327
            ],
            [
                7327,
                7433
            ],
            [
                7433,
                7499
            ],
            [
                7499,
                7738
            ],
            [
                7738,
                7817
            ],
            [
                7817,
                7985
            ],
            [
                7985,
                8047
            ],
            [
                8047,
                8229
            ],
            [
                8229,
                8356
            ],
            [
                8356,
                8554
            ],
            [
                8554,
                8957
            ]
        ],
        "segment_chars": [
            [
                0,
                145
            ],
            [
                145,
                264
            ],
            [
                264,
                307
            ],
            [
                307,
                433
            ],
            [
                433,
                508
            ],
            [
                508,
                550
            ],
            [
                550,
                750
            ],
            [
                750,
                822
            ],
            [
                822,
                916
            ],
            [
                916,
                1099
            ],
            [
                1099,
                1376
            ],
            [
                1376,
                1512
            ],
            [
                1512,
                1642
            ],
            [
                1642,
                1690
            ],
            [
                1690,
                1797
            ],
            [
                1797,
                1941
            ],
            [
                1941,
                2005
            ],
            [
                2005,
                2065
            ],
            [
                2065,
                2283
            ],
            [
                2283,
                2329
            ],
            [
                2329,
                2419
            ],
            [
                2419,
                2656
            ],
            [
                2656,
                2780
            ],
            [
                2780,
                2830
            ],
            [
                2830,
                2946
            ],
            [
                2946,
                3091
            ],
            [
                3091,
                3151
            ],
            [
                3151,
                3209
            ],
            [
                3209,
                3309
            ],
            [
                3309,
                3450
            ],
            [
                3450,
                3560
            ],
            [
                3560,
                3685
            ],
            [
                3685,
                3834
            ],
            [
                3834,
                4015
            ],
            [
                4015,
                4181
            ],
            [
                4181,
                4353
            ],
            [
                4353,
                4545
            ],
            [
                4545,
                4719
            ],
            [
                4719,
                4834
            ],
            [
                4834,
                4963
            ],
            [
                4963,
                5011
            ],
            [
                5011,
                5121
            ],
            [
                5121,
                5214
            ],
            [
                5214,
                5383
            ],
            [
                5383,
                5450
            ],
            [
                5450,
                5613
            ],
            [
                5613,
                5790
            ],
            [
                5790,
                5884
            ],
            [
                5884,
                5966
            ],
            [
                5966,
                6091
            ],
            [
                6091,
                6153
            ],
            [
                6153,
                6196
            ],
            [
                6196,
                6294
            ],
            [
                6294,
                6384
            ],
            [
                6384,
                6418
            ],
            [
                6418,
                6448
            ],
            [
                6448,
                6554
            ],
            [
                6554,
                6656
            ],
            [
                6656,
                6683
            ],
            [
                6683,
                6699
            ],
            [
                6699,
                6822
            ],
            [
                6822,
                6853
            ],
            [
                6853,
                6911
            ],
            [
                6911,
                7017
            ],
            [
                7017,
                7054
            ],
            [
                7054,
                7130
            ],
            [
                7130,
                7224
            ],
            [
                7224,
                7327
            ],
            [
                7327,
                7339
            ],
            [
                7339,
                7433
            ],
            [
                7433,
                7499
            ],
            [
                7499,
                7566
            ],
            [
                7566,
                7738
            ],
            [
                7738,
                7817
            ],
            [
                7817,
                7985
            ],
            [
                7985,
                8022
            ],
            [
                8022,
                8047
            ],
            [
                8047,
                8158
            ],
            [
                8158,
                8229
            ],
            [
                8229,
                8316
            ],
            [
                8316,
                8356
            ],
            [
                8356,
                8410
            ],
            [
                8410,
                8554
            ],
            [
                8554,
                8696
            ],
            [
                8696,
                8837
            ],
            [
                8837,
                8851
            ],
            [
                8851,
                8957
            ]
        ],
        "overlap_chars": [
            [
                0,
                56
            ],
            [
                62,
                69
            ],
            [
                70,
                100
            ],
            [
                107,
                127
            ],
            [
                128,
                145
            ],
            [
                145,
                204
            ],
            [
                213,
                241
            ],
            [
                242,
                251
            ],
            [
                252,
                256
            ],
            [
                257,
                262
            ],
            [
                262,
                264
            ],
            [
                264,
                286
            ],
            [
                294,
                298
            ],
            [
                305,
                307
            ],
            [
                307,
                319
            ],
            [
                323,
                376
            ],
            [
                377,
                392
            ],
            [
                400,
                403
            ],
            [
                409,
                433
            ],
            [
                433,
                436
            ],
            [
                437,
                472
            ],
            [
                474,
                506
            ],
            [
                506,
                508
            ],
            [
                508,
                550
            ],
            [
                550,
                583
            ],
            [
                584,
                590
            ],
            [
                591,
                600
            ],
            [
                608,
                612
            ],
            [
                622,
                690
            ],
            [
                691,
                694
            ],
            [
                695,
                723
            ],
            [
                724,
                750
            ],
            [
                750,
                768
            ],
            [
                769,
                798
            ],
            [
                801,
                804
            ],
            [
                805,
                822
            ],
            [
                822,
                835
            ],
            [
                836,
                889
            ],
            [
                890,
                893
            ],
            [
                894,
                909
            ],
            [
                914,
                916
            ],
            [
                916,
                982
            ],
            [
                986,
                990
            ],
            [
                991,
                1098
            ],
            [
                1099,
                1131
            ],
            [
                1134,
                1174
            ],
            [
                1174,
                1189
            ],
            [
                1190,
                1210
            ],
            [
                1210,
                1223
            ],
            [
                1224,
                1227
            ],
            [
                1228,
                1281
            ],
            [
                1282,
                1285
            ],
            [
                1286,
                1326
            ],
            [
                1329,
                1374
            ],
            [
                1374,
                1376
            ],
            [
                1376,
                1425
            ],
            [
                1426,
                1429
            ],
            [
                1430,
                1432
            ],
            [
                1446,
                1511
            ],
            [
                1524,
                1533
            ],
            [
                1534,
                1602
            ],
            [
                1603,
                1609
            ],
            [
                1610,
                1640
            ],
            [
                1640,
                1642
            ],
            [
                1642,
                1644
            ],
            [
                1645,
                1690
            ],
            [
                1690,
                1714
            ],
            [
                1716,
                1757
            ],
            [
                1758,
                1795
            ],
            [
                1795,
                1797
            ],
            [
                1806,
                1828
            ],
            [
                1829,
                1842
            ],
            [
                1848,
                1865
            ],
            [
                1865,
                1866
            ],
            [
                1867,
                1940
            ],
            [
                1950,
                1966
            ],
            [
                1966,
                2005
            ],
            [
                2005,
                2020
            ],
            [
                2027,
                2030
            ],
            [
                2031,
                2063
            ],
            [
                2063,
                2065
            ],
            [
                2065,
                2100
            ],
            [
                2100,
                2101
            ],
            [
                2102,
                2105
            ],
            [
                2106,
                2116
            ],
            [
                2117,
                2150
            ],
            [
                2151,
                2156
            ],
            [
                2157,
                2175
            ],
            [
                2176,
                2269
            ],
            [
                2274,
                2282
            ],
            [
                2283,
                2321
            ],
            [
                2327,
                2329
            ],
            [
                2329,
                2338
            ],
            [
                2339,
                2347
            ],
            [
                2348,
                2352
            ],
            [
                2357,
                2360
            ],
            [
                2367,
                2373
            ],
            [
                2389,
                2417
            ],
            [
                2417,
                2419
            ],
            [
                2419,
                2549
            ],
            [
                2550,
                2655
            ],
            [
                2656,
                2680
            ],
            [
                2681,
                2706
            ],
            [
                2711,
                2712
            ],
            [
                2713,
                2780
            ],
            [
                2780,
                2830
            ],
            [
                2830,
                2919
            ],
            [
                2925,
                2946
            ],
            [
                2946,
                2964
            ],
            [
                2976,
                2985
            ],
            [
                2993,
                3003
            ],
            [
                3004,
                3091
            ],
            [
                3091,
                3148
            ],
            [
                3151,
                3206
            ],
            [
                3209,
                3213
            ],
            [
                3220,
                3227
            ],
            [
                3228,
                3260
            ],
            [
                3271,
                3273
            ],
            [
                3280,
                3281
            ],
            [
                3286,
                3309
            ],
            [
                3309,
                3318
            ],
            [
                3319,
                3324
            ],
            [
                3325,
                3334
            ],
            [
                3335,
                3397
            ],
            [
                3405,
                3417
            ],
            [
                3418,
                3450
            ],
            [
                3450,
                3531
            ],
            [
                3537,
                3550
            ],
            [
                3551,
                3558
            ],
            [
                3558,
                3560
            ],
            [
                3560,
                3563
            ],
            [
                3564,
                3629
            ],
            [
                3630,
                3685
            ],
            [
                3687,
                3697
            ],
            [
                3705,
                3707
            ],
            [
                3711,
                3723
            ],
            [
                3723,
                3724
            ],
            [
                3725,
                3728
            ],
            [
                3729,
                3767
            ],
            [
                3781,
                3791
            ],
            [
                3804,
                3807
            ],
            [
                3808,
                3817
            ],
            [
                3822,
                3832
            ],
            [
                3832,
                3833
            ],
            [
                3834,
                3894
            ],
            [
                3898,
                3903
            ],
            [
                3904,
                3947
            ],
            [
                3947,
                3961
            ],
            [
                3970,
                4015
            ],
            [
                4024,
                4144
            ],
            [
                4145,
                4181
            ],
            [
                4181,
                4261
            ],
            [
                4262,
                4324
            ],
            [
                4329,
                4353
            ],
            [
                4353,
                4357
            ],
            [
                4358,
                4417
            ],
            [
                4427,
                4441
            ],
            [
                4442,
                4464
            ],
            [
                4465,
                4468
            ],
            [
                4469,
                4491
            ],
            [
                4491,
                4492
            ],
            [
                4493,
                4543
            ],
            [
                4543,
                4545
            ],
            [
                4545,
                4593
            ],
            [
                4594,
                4597
            ],
            [
                4598,
                4620
            ],
            [
                4621,
                4623
            ],
            [
                4624,
                4717
            ],
            [
                4717,
                4718
            ],
            [
                4719,
                4833
            ],
            [
                4834,
                4865
            ],
            [
                4872,
                4963
            ],
            [
                4963,
                5011
            ],
            [
                5019,
                5023
            ],
            [
                5024,
                5027
            ],
            [
                5032,
                5070
            ],
            [
                5074,
                5121
            ],
            [
                5121,
                5157
            ],
            [
                5157,
                5158
            ],
            [
                5165,
                5212
            ],
            [
                5212,
                5213
            ],
            [
                5222,
                5235
            ],
            [
                5236,
                5254
            ],
            [
                5254,
                5255
            ],
            [
                5256,
                5288
            ],
            [
                5289,
                5316
            ],
            [
                5322,
                5381
            ],
            [
                5381,
                5382
            ],
            [
                5383,
                5385
            ],
            [
                5391,
                5395
            ],
            [
                5402,
                5422
            ],
            [
                5423,
                5450
            ],
            [
                5450,
                5478
            ],
            [
                5483,
                5612
            ],
            [
                5624,
                5658
            ],
            [
                5665,
                5668
            ],
            [
                5694,
                5718
            ],
            [
                5723,
                5790
            ],
            [
                5790,
                5793
            ],
            [
                5794,
                5819
            ],
            [
                5820,
                5883
            ],
            [
                5884,
                5940
            ],
            [
                5941,
                5966
            ],
            [
                5966,
                5983
            ],
            [
                5984,
                5990
            ],
            [
                5991,
                6006
            ],
            [
                6008,
                6009
            ],
            [
                6010,
                6090
            ],
            [
                6091,
                6153
            ],
            [
                6153,
                6194
            ],
            [
                6194,
                6196
            ],
            [
                6196,
                6294
            ],
            [
                6294,
                6384
            ],
            [
                6384,
                6418
            ],
            [
                6418,
                6448
            ],
            [
                6448,
                6482
            ],
            [
                6483,
                6489
            ],
            [
                6498,
                6554
            ],
            [
                6554,
                6656
            ],
            [
                6656,
                6683
            ],
            [
                6683,
                6699
            ],
            [
                6699,
                6700
            ],
            [
                6700,
                6736
            ],
            [
                6736,
                6737
            ],
            [
                6738,
                6741
            ],
            [
                6742,
                6791
            ],
            [
                6792,
                6822
            ],
            [
                6822,
                6853
            ],
            [
                6853,
                6865
            ],
            [
                6866,
                6911
            ],
            [
                6911,
                6967
            ],
            [
                6968,
                7017
            ],
            [
                7017,
                7054
            ],
            [
                7054,
                7058
            ],
            [
                7070,
                7095
            ],
            [
                7096,
                7130
            ],
            [
                7133,
                7136
            ],
            [
                7137,
                7139
            ],
            [
                7140,
                7173
            ],
            [
                7174,
                7178
            ],
            [
                7179,
                7224
            ],
            [
                7224,
                7238
            ],
            [
                7239,
                7273
            ],
            [
                7279,
                7327
            ],
            [
                7327,
                7337
            ],
            [
                7337,
                7338
            ],
            [
                7339,
                7367
            ],
            [
                7368,
                7433
            ],
            [
                7433,
                7474
            ],
            [
                7477,
                7484
            ],
            [
                7485,
                7488
            ],
            [
                7497,
                7499
            ],
            [
                7499,
                7553
            ],
            [
                7564,
                7566
            ],
            [
                7566,
                7569
            ],
            [
                7573,
                7608
            ],
            [
                7609,
                7620
            ],
            [
                7620,
                7632
            ],
            [
                7638,
                7738
            ],
            [
                7738,
                7807
            ],
            [
                7808,
                7815
            ],
            [
                7815,
                7817
            ],
            [
                7817,
                7918
            ],
            [
                7919,
                7929
            ],
            [
                7930,
                7985
            ],
            [
                7985,
                8020
            ],
            [
                8020,
                8022
            ],
            [
                8022,
                8047
            ],
            [
                8047,
                8048
            ],
            [
                8048,
                8116
            ],
            [
                8129,
                8158
            ],
            [
                8158,
                8208
            ],
            [
                8226,
                8228
            ],
            [
                8229,
                8295
            ],
            [
                8303,
                8314
            ],
            [
                8314,
                8316
            ],
            [
                8316,
                8324
            ],
            [
                8325,
                8356
            ],
            [
                8356,
                8399
            ],
            [
                8400,
                8410
            ],
            [
                8410,
                8467
            ],
            [
                8484,
                8487
            ],
            [
                8488,
                8554
            ],
            [
                8554,
                8592
            ],
            [
                8593,
                8683
            ],
            [
                8684,
                8694
            ],
            [
                8694,
                8696
            ],
            [
                8696,
                8739
            ],
            [
                8739,
                8801
            ],
            [
                8808,
                8837
            ],
            [
                8837,
                8851
            ],
            [
                8851,
                8907
            ],
            [
                8908,
                8957
            ]
        ],
        "row_chars": [
            [
                0,
                145
            ],
            [
                145,
                264
            ],
            [
                264,
                307
            ],
            [
                307,
                433
            ],
            [
                433,
                508
            ],
            [
                508,
                550
            ],
            [
                550,
                550
            ],
            [
                550,
                750
            ],
            [
                750,
                750
            ],
            [
                750,
                822
            ],
            [
                822,
                916
            ],
            [
                916,
                1099
            ],
            [
                1099,
                1099
            ],
            [
                1099,
                1099
            ],
            [
                1099,
                1099
            ],
            [
                1099,
                1099
            ],
            [
                1099,
                1099
            ],
            [
                1099,
                1099
            ],
            [
                1099,
                1376
            ],
            [
                1376,
                1512
            ],
            [
                1512,
                1512
            ],
            [
                1512,
                1642
            ],
            [
                1642,
                1690
            ],
            [
                1690,
                1690
            ],
            [
                1690,
                1797
            ],
            [
                1797,
                1941
            ],
            [
                1941,
                1941
            ],
            [
                1941,
                2005
            ],
            [
                2005,
                2065
            ],
            [
                2065,
                2283
            ],
            [
                2283,
                2283
            ],
            [
                2283,
                2329
            ],
            [
                2329,
                2329
            ],
            [
                2329,
                2329
            ],
            [
                2329,
                2419
            ],
            [
                2419,
                2656
            ],
            [
                2656,
                2780
            ],
            [
                2780,
                2830
            ],
            [
                2830,
                2946
            ],
            [
                2946,
                2946
            ],
            [
                2946,
                3091
            ],
            [
                3091,
                3151
            ],
            [
                3151,
                3209
            ],
            [
                3209,
                3209
            ],
            [
                3209,
                3209
            ],
            [
                3209,
                3309
            ],
            [
                3309,
                3450
            ],
            [
                3450,
                3560
            ],
            [
                3560,
                3685
            ],
            [
                3685,
                3834
            ],
            [
                3834,
                4015
            ],
            [
                4015,
                4181
            ],
            [
                4181,
                4353
            ],
            [
                4353,
                4545
            ],
            [
                4545,
                4719
            ],
            [
                4719,
                4834
            ],
            [
                4834,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                5011
            ],
            [
                5011,
                5121
            ],
            [
                5121,
                5214
            ],
            [
                5214,
                5214
            ],
            [
                5214,
                5214
            ],
            [
                5214,
                5450
            ],
            [
                5450,
                5450
            ],
            [
                5450,
                5613
            ],
            [
                5613,
                5790
            ],
            [
                5790,
                5884
            ],
            [
                5884,
                5966
            ],
            [
                5966,
                6091
            ],
            [
                6091,
                6153
            ],
            [
                6153,
                6196
            ],
            [
                6196,
                6294
            ],
            [
                6294,
                6384
            ],
            [
                6384,
                6418
            ],
            [
                6418,
                6448
            ],
            [
                6448,
                6554
            ],
            [
                6554,
                6656
            ],
            [
                6656,
                6683
            ],
            [
                6683,
                6699
            ],
            [
                6699,
                6822
            ],
            [
                6822,
                6853
            ],
            [
                6853,
                6911
            ],
            [
                6911,
                7017
            ],
            [
                7017,
                7054
            ],
            [
                7054,
                7130
            ],
            [
                7130,
                7224
            ],
            [
                7224,
                7327
            ],
            [
                7327,
                7339
            ],
            [
                7339,
                7339
            ],
            [
                7339,
                7339
            ],
            [
                7339,
                7433
            ],
            [
                7433,
                7499
            ],
            [
                7499,
                7566
            ],
            [
                7566,
                7738
            ],
            [
                7738,
                7817
            ],
            [
                7817,
                7985
            ],
            [
                7985,
                8022
            ],
            [
                8022,
                8047
            ],
            [
                8047,
                8158
            ],
            [
                8158,
                8229
            ],
            [
                8229,
                8316
            ],
            [
                8316,
                8316
            ],
            [
                8316,
                8356
            ],
            [
                8356,
                8410
            ],
            [
                8410,
                8554
            ],
            [
                8554,
                8696
            ],
            [
                8696,
                8696
            ],
            [
                8696,
                8837
            ],
            [
                8837,
                8837
            ],
            [
                8837,
                8851
            ],
            [
                8851,
                8851
            ],
            [
                8851,
                8957
            ]
        ]
    }
}