{
    "original": {
        "text": "When Hetta Carbury received that letter from her lover which was given to the reader some chapters back, it certainly did not tend in any way to alleviate her misery. Even when she had read it over half-a-dozen times, she could not bring herself to think it possible that she could be reconciled to the man. It was not only that he had sinned against her by giving his society to another woman to whom he had at any rate been engaged not long since, at the very time at which he was becoming engaged to her,--but also that he had done this in such a manner as to make his offence known to all her friends. Perhaps she had been too quick;--but there was the fact that with her own consent she had acceded to her mother's demand that the man should be rejected. The man had been rejected, and even Roger Carbury knew that it was so. After this it was, she thought, impossible that she should recall him. But they should all know that her heart was unchanged. Roger Carbury should certainly know that, if he ever asked her further question on the matter. She would never deny it; and though she knew that the man had behaved badly,--having entangled himself with a nasty American woman,--yet she would be true to him as far as her own heart was concerned.\nAnd now he told her that she had been most unjust to him. He said that he could not understand her injustice. He did not fill his letter with entreaties, but with reproaches. And certainly his reproaches moved her more than any prayer would have done. It was too late now to remedy the evil; but she was not quite sure within her own bosom that she had not been unjust to him. The more she thought of it the more puzzled her mind became. Had she quarrelled with him because he had once been in love with Mrs. Hurtle, or because she had grounds for regarding Mrs. Hurtle as her present rival? She hated Mrs. Hurtle, and she was very angry with him in that he had ever been on affectionate terms with a woman she hated;--but that had not been the reason put forward by her for quarrelling with him. Perhaps it was true that he, too, had of late loved Mrs. Hurtle hardly better than she did herself. It might be that he had been indeed constrained by hard circumstances to go with the woman to Lowestoft. Having so gone with her, it was no doubt right that he should be rejected;--for how can it be that a man who is engaged shall be allowed to travel about the country with another woman to whom also he was engaged a few months back? But still there might be hardship in it. To her, to Hetta herself, the circumstances were very hard. She loved the man with all her heart. She could look forward to no happiness in life without him. But yet it must be so.\nAt the end of his letter he had told her to go to Mrs. Hurtle herself if she wanted corroboration of the story as told by him. Of course he had known when he wrote it that she could not and would not go to Mrs. Hurtle. But when the letter had been in her possession three or four days,--unanswered, for, as a matter of course, no answer to it from herself was possible,--and had been read and re-read till she knew every word of it by heart, she began to think that if she could hear the story as it might be told by Mrs. Hurtle, a good deal that was now dark might become light to her. As she continued to read the letter, and to brood over it all, by degrees her anger was turned from her lover to her mother, her brother, and to her cousin Roger. Paul had of course behaved badly, very badly,--but had it not been for them she might have had an opportunity of forgiving him. They had driven her on to the declaration of a purpose from which she could now see no escape. There had been a plot against her, and she was a victim. In the first dismay and agony occasioned by that awful story of the American woman,--which had, at the moment, struck her with a horror which was now becoming less and less every hour,--she had fallen head foremost into the trap laid for her. She acknowledged to herself that it was too late to recover her ground. She was, at any rate, almost sure that it must be too late. But yet she was disposed to do battle with her mother and her cousin in the matter--if only with the object of showing that she would not submit her own feelings to their control. She was savage to the point of rebellion against all authority. Roger Carbury would of course think that any communication between herself and Mrs. Hurtle must be most improper,--altogether indelicate. Two or three days ago she thought so herself. But the world was going so hard with her, that she was beginning to feel herself capable of throwing propriety and delicacy to the winds. This man whom she had once accepted, whom she altogether loved, and who, in spite of all his faults, certainly still loved her,--of that she was beginning to have no further doubt,--accused her of dishonesty, and referred her to her rival for a corroboration of his story. She would appeal to Mrs. Hurtle. The woman was odious, abominable, a nasty intriguing American female. But her lover desired that she should hear the woman's story; and she would hear the story,--if the woman would tell it.\nSo resolving, she wrote as follows to Mrs. Hurtle, finding great difficulty in the composition of a letter which should tell neither too little nor too much, and determined that she would be restrained by no mock modesty, by no girlish fear of declaring the truth about herself. The letter at last was stiff and hard, but it sufficed for its purpose.\nMADAM,--\nMr. Paul Montague has referred me to you as to certain circumstances which have taken place between him and you. It is right that I should tell you that I was a short time since engaged to marry him, but that I have found myself obliged to break off that engagement in consequence of what I have been told as to his acquaintance with you. I make this proposition to you, not thinking that anything you will say to me can change my mind, but because he has asked me to do so, and has, at the same time, accused me of injustice towards him. I do not wish to rest under an accusation of injustice from one to whom I was once warmly attached. If you will receive me, I will make it my business to call any afternoon you may name.\nYours truly,\nHENRIETTA CARBURY.\nWhen the letter was written she was not only ashamed of it, but very much afraid of it also. What if the American woman should put it in a newspaper! She had heard that everything was put into newspapers in America. What if this Mrs. Hurtle should send back to her some horribly insolent answer;--or should send such answer to her mother, instead of herself! And then, again, if the American woman consented to receive her, would not the American woman, as a matter of course, trample upon her with rough words? Once or twice she put the letter aside, and almost determined that it should not be sent;--but at last, with desperate fortitude, she took it out with her and posted it herself. She told no word of it to any one. Her mother, she thought, had been cruel to her, had disregarded her feelings, and made her wretched for ever. She could not ask her mother for sympathy in her present distress. There was no friend who would sympathise with her. She must do everything alone.\nMrs. Hurtle, it will be remembered, had at last determined that she would retire from the contest and own herself to have been worsted. It is, I fear, impossible to describe adequately the various half resolutions which she formed, and the changing phases of her mind before she brought herself to this conclusion. And soon after she had assured herself that this should be the conclusion,--after she had told Paul Montague that it should be so,--there came back upon her at times other half resolutions to a contrary effect. She had written a letter to the man threatening desperate revenge, and had then abstained from sending it, and had then shown it to the man,--not intending to give it to him as a letter upon which he would have to act, but only that she might ask him whether, had he received it, he would have said that he had not deserved it. Then she had parted with him, refusing either to hear or to say a word of farewell, and had told Mrs. Pipkin that she was no longer engaged to be married. At that moment everything was done that could be done. The game had been played and the stakes lost,--and she had schooled herself into such restraint as to have abandoned all idea of vengeance. But from time to time there arose in her heart a feeling that such softness was unworthy of her. Who had ever been soft to her? Who had spared her? Had she not long since found out that she must fight with her very nails and teeth for every inch of ground, if she did not mean to be trodden into the dust? Had she not held her own among rough people after a very rough fashion, and should she now simply retire that she might weep in a corner like a love-sick schoolgirl? And she had been so stoutly determined that she would at any rate avenge her own wrongs, if she could not turn those wrongs into triumph! There were moments in which she thought that she could still seize the man by the throat, where all the world might see her, and dare him to deny that he was false, perjured, and mean.\nThen she received a long passionate letter from Paul Montague, written at the same time as those other letters to Roger Carbury and Hetta, in which he told her all the circumstances of his engagement to Hetta Carbury, and implored her to substantiate the truth of his own story. It was certainly marvellous to her that the man who had so long been her own lover and who had parted with her after such a fashion should write such a letter to her. But it had no tendency to increase either her anger or her sorrow. Of course she had known that it was so, and at certain times she had told herself that it was only natural,--had almost told herself that it was right. She and this young Englishman were not fit to be mated. He was to her thinking a tame, sleek household animal, whereas she knew herself to be wild,--fitter for the woods than for polished cities. It had been one of the faults of her life that she had allowed herself to be bound by tenderness of feeling to this soft over-civilised man. The result had been disastrous, as might have been expected. She was angry with him,--almost to the extent of tearing him to pieces,--but she did not become more angry because he wrote to her of her rival.\nHer only present friend was Mrs. Pipkin, who treated her with the greatest deference, but who was never tired of asking questions about the lost lover. \"That letter was from Mr. Montague?\" said Mrs. Pipkin on the morning after it had been received.\n\"How can you know that?\"\n\"I'm sure it was. One does get to know handwritings when letters come frequent.\"\n\"It was from him. And why not?\"\n\"Oh dear no;--why not certainly? I wish he'd write every day of his life, so that things would come round again. Nothing ever troubles me so much as broken love. Why don't he come again himself, Mrs. Hurtle?\"\n\"It is not at all likely that he should come again. It is all over, and there is no good in talking of it. I shall return to New York on Saturday week.\"\n\"Oh, Mrs. Hurtle!\"\n\"I can't remain here, you know, all my life doing nothing. I came over here for a certain purpose, and that has--gone by. Now I may just go back again.\"\n\"I know he has ill-treated you. I know he has.\"\n\"I am not disposed to talk about it, Mrs. Pipkin.\"\n\"I should have thought it would have done you good to speak your mind out free. I know it would me if I'd been served in that way.\"\n\"If I had anything to say at all after that fashion it would be to the gentleman, and not to any other else. As it is I shall never speak of it again to any one. You have been very kind to me, Mrs. Pipkin, and I shall be sorry to leave you.\"\n\"Oh, Mrs. Hurtle, you can't understand what it is to me. It isn't only my feelings. The likes of me can't stand by their feelings only, as their betters do. I've never been above telling you what a godsend you've been to me this summer;--have I? I've paid everything, butcher, baker, rates and all, just like clockwork. And now you're going away!\" Then Mrs. Pipkin began to sob.\n\"I suppose I shall see Mr. Crumb before I go,\" said Mrs. Hurtle.\n\"She don't deserve it; do she? And even now she never says a word about him that I call respectful. She looks on him as just being better than Mrs. Buggins's children. That's all.\"\n\"She'll be all right when he has once got her home.\"\n\"And I shall be all alone by myself,\" said Mrs. Pipkin, with her apron up to her eyes.\nIt was after this that Mrs. Hurtle received Hetta's letter. She had as yet returned no answer to Paul Montague,--nor had she intended to send any written answer. Were she to comply with his request she could do so best by writing to the girl who was concerned rather than to him. And though she wrote no such letter she thought of it,--of the words she would use were she to write it, and of the tale which she would have to tell. She sat for hours thinking of it, trying to resolve whether she would tell the tale,--if she told it at all,--in a manner to suit Paul's purpose, or so as to bring that purpose utterly to shipwreck. She did not doubt that she could cause the shipwreck were she so minded. She could certainly have her revenge after that fashion. But it was a woman's fashion, and, as such, did not recommend itself to Mrs. Hurtle's feelings. A pistol or a horsewhip, a violent seizing by the neck, with sharp taunts and bitter-ringing words, would have made the fitting revenge. If she abandoned that she could do herself no good by telling a story of her wrongs to another woman.\nThen came Hetta's note, so stiff, so cold, so true,--so like the letter of an Englishwoman, as Mrs. Hurtle said to herself. Mrs. Hurtle smiled as she read the letter. \"I make this proposition not thinking that anything you can say to me can change my mind.\" Of course the girl's mind would be changed. The girl's mind, indeed, required no change. Mrs. Hurtle could see well enough that the girl's heart was set upon the man. Nevertheless she did not doubt but that she could tell the story after such a fashion as to make it impossible that the girl should marry him,--if she chose to do so.\nAt first she thought that she would not answer the letter at all. What was it to her? Let them fight their own lovers' battles out after their own childish fashion. If the man meant at last to be honest, there could be no doubt, Mrs. Hurtle thought, that the girl would go to him. It would require no interference of hers. But after a while she thought that she might as well see this English chit who had superseded herself in the affections of the Englishman she had condescended to love. And if it were the case that all revenge was to be abandoned, that no punishment was to be exacted in return for all the injury that had been done, why should she not say a kind word so as to smooth away the existing difficulties? Wild cat as she was, kindness was more congenial to her nature than cruelty. So she wrote to Hetta making an appointment.\nDEAR MISS CARBURY,--\nIf you could make it convenient to yourself to call here either Thursday or Friday at any hour between two and four, I shall be very happy to see you.\nYours sincerely,\nWINIFRID HURTLE.",
        "paragraph_chars": [
            [
                0,
                1253
            ],
            [
                1253,
                2708
            ],
            [
                2708,
                5176
            ],
            [
                5176,
                5527
            ],
            [
                5527,
                5536
            ],
            [
                5536,
                6262
            ],
            [
                6262,
                6275
            ],
            [
                6275,
                6294
            ],
            [
                6294,
                7277
            ],
            [
                7277,
                9276
            ],
            [
                9276,
                10484
            ],
            [
                10484,
                10733
            ],
            [
                10733,
                10758
            ],
            [
                10758,
                10839
            ],
            [
                10839,
                10871
            ],
            [
                10871,
                11080
            ],
            [
                11080,
                11233
            ],
            [
                11233,
                11252
            ],
            [
                11252,
                11405
            ],
            [
                11405,
                11453
            ],
            [
                11453,
                11504
            ],
            [
                11504,
                11636
            ],
            [
                11636,
                11878
            ],
            [
                11878,
                12257
            ],
            [
                12257,
                12322
            ],
            [
                12322,
                12503
            ],
            [
                12503,
                12556
            ],
            [
                12556,
                12643
            ],
            [
                12643,
                13738
            ],
            [
                13738,
                14330
            ],
            [
                14330,
                15174
            ],
            [
                15174,
                15195
            ],
            [
                15195,
                15346
            ],
            [
                15346,
                15363
            ],
            [
                15363,
                15379
            ]
        ],
        "segment_chars": [
            [
                0,
                167
            ],
            [
                167,
                308
            ],
            [
                308,
                606
            ],
            [
                606,
                760
            ],
            [
                760,
                831
            ],
            [
                831,
                902
            ],
            [
                902,
                957
            ],
            [
                957,
                1052
            ],
            [
                1052,
                1253
            ],
            [
                1253,
                1311
            ],
            [
                1311,
                1363
            ],
            [
                1363,
                1428
            ],
            [
                1428,
                1505
            ],
            [
                1505,
                1630
            ],
            [
                1630,
                1691
            ],
            [
                1691,
                1845
            ],
            [
                1845,
                2050
            ],
            [
                2050,
                2150
            ],
            [
                2150,
                2255
            ],
            [
                2255,
                2486
            ],
            [
                2486,
                2527
            ],
            [
                2527,
                2587
            ],
            [
                2587,
                2625
            ],
            [
                2625,
                2685
            ],
            [
                2685,
                2708
            ],
            [
                2708,
                2835
            ],
            [
                2835,
                2927
            ],
            [
                2927,
                3295
            ],
            [
                3295,
                3458
            ],
            [
                3458,
                3586
            ],
            [
                3586,
                3681
            ],
            [
                3681,
                3738
            ],
            [
                3738,
                3981
            ],
            [
                3981,
                4053
            ],
            [
                4053,
                4113
            ],
            [
                4113,
                4293
            ],
            [
                4293,
                4357
            ],
            [
                4357,
                4495
            ],
            [
                4495,
                4541
            ],
            [
                4541,
                4679
            ],
            [
                4679,
                4952
            ],
            [
                4952,
                4985
            ],
            [
                4985,
                5055
            ],
            [
                5055,
                5176
            ],
            [
                5176,
                5455
            ],
            [
                5455,
                5527
            ],
            [
                5527,
                5536
            ],
            [
                5536,
                5649
            ],
            [
                5649,
                5875
            ],
            [
                5875,
                6075
            ],
            [
                6075,
                6175
            ],
            [
                6175,
                6262
            ],
            [
                6262,
                6275
            ],
            [
                6275,
                6294
            ],
            [
                6294,
                6387
            ],
            [
                6387,
                6444
            ],
            [
                6444,
                6510
            ],
            [
                6510,
                6653
            ],
            [
                6653,
                6806
            ],
            [
                6806,
                6984
            ],
            [
                6984,
                7019
            ],
            [
                7019,
                7129
            ],
            [
                7129,
                7196
            ],
            [
                7196,
                7247
            ],
            [
                7247,
                7277
            ],
            [
                7277,
                7413
            ],
            [
                7413,
                7592
            ],
            [
                7592,
                7803
            ],
            [
                7803,
                8131
            ],
            [
                8131,
                8286
            ],
            [
                8286,
                8341
            ],
            [
                8341,
                8481
            ],
            [
                8481,
                8578
            ],
            [
                8578,
                8609
            ],
            [
                8609,
                8629
            ],
            [
                8629,
                8787
            ],
            [
                8787,
                8953
            ],
            [
                8953,
                9091
            ],
            [
                9091,
                9276
            ],
            [
                9276,
                9555
            ],
            [
                9555,
                9722
            ],
            [
                9722,
                9789
            ],
            [
                9789,
                9941
            ],
            [
                9941,
                9997
            ],
            [
                9997,
                10137
            ],
            [
                10137,
                10278
            ],
            [
                10278,
                10339
            ],
            [
                10339,
                10484
            ],
            [
                10484,
                10636
            ],
            [
                10636,
                10673
            ],
            [
                10673,
                10733
            ],
            [
                10733,
                10758
            ],
            [
                10758,
                10776
            ],
            [
                10776,
                10839
            ],
            [
                10839,
                10857
            ],
            [
                10857,
                10871
            ],
            [
                10871,
                10904
            ],
            [
                10904,
                10984
            ],
            [
                10984,
                11033
            ],
            [
                11033,
                11080
            ],
            [
                11080,
                11132
            ],
            [
                11132,
                11187
            ],
            [
                11187,
                11233
            ],
            [
                11233,
                11252
            ],
            [
                11252,
                11311
            ],
            [
                11311,
                11374
            ],
            [
                11374,
                11405
            ],
            [
                11405,
                11437
            ],
            [
                11437,
                11453
            ],
            [
                11453,
                11504
            ],
            [
                11504,
                11584
            ],
            [
                11584,
                11636
            ],
            [
                11636,
                11745
            ],
            [
                11745,
                11798
            ],
            [
                11798,
                11878
            ],
            [
                11878,
                11935
            ],
            [
                11935,
                11962
            ],
            [
                11962,
                12035
            ],
            [
                12035,
                12124
            ],
            [
                12124,
                12198
            ],
            [
                12198,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12257,
                12322
            ],
            [
                12322,
                12353
            ],
            [
                12353,
                12422
            ],
            [
                12422,
                12490
            ],
            [
                12490,
                12503
            ],
            [
                12503,
                12556
            ],
            [
                12556,
                12643
            ],
            [
                12643,
                12703
            ],
            [
                12703,
                12805
            ],
            [
                12805,
                12923
            ],
            [
                12923,
                13074
            ],
            [
                13074,
                13273
            ],
            [
                13273,
                13346
            ],
            [
                13346,
                13403
            ],
            [
                13403,
                13499
            ],
            [
                13499,
                13636
            ],
            [
                13636,
                13738
            ],
            [
                13738,
                13862
            ],
            [
                13862,
                13905
            ],
            [
                13905,
                13996
            ],
            [
                13996,
                14040
            ],
            [
                14040,
                14085
            ],
            [
                14085,
                14163
            ],
            [
                14163,
                14330
            ],
            [
                14330,
                14396
            ],
            [
                14396,
                14416
            ],
            [
                14416,
                14495
            ],
            [
                14495,
                14611
            ],
            [
                14611,
                14653
            ],
            [
                14653,
                14821
            ],
            [
                14821,
                15052
            ],
            [
                15052,
                15129
            ],
            [
                15129,
                15174
            ],
            [
                15174,
                15195
            ],
            [
                15195,
                15346
            ],
            [
                15346,
                15363
            ],
            [
                15363,
                15379
            ]
        ],
        "overlap_chars": [
            [
                0,
                10
            ],
            [
                19,
                27
            ],
            [
                74,
                77
            ],
            [
                33,
                44
            ],
            [
                103,
                107
            ],
            [
                118,
                125
            ],
            [
                145,
                167
            ],
            [
                167,
                192
            ],
            [
                198,
                231
            ],
            [
                272,
                298
            ],
            [
                306,
                307
            ],
            [
                308,
                357
            ],
            [
                380,
                393
            ],
            [
                448,
                506
            ],
            [
                509,
                549
            ],
            [
                557,
                588
            ],
            [
                593,
                606
            ],
            [
                768,
                790
            ],
            [
                850,
                861
            ],
            [
                820,
                826
            ],
            [
                863,
                902
            ],
            [
                902,
                957
            ],
            [
                957,
                992
            ],
            [
                997,
                1019
            ],
            [
                1050,
                1052
            ],
            [
                1081,
                1101
            ],
            [
                1110,
                1128
            ],
            [
                1185,
                1253
            ],
            [
                1253,
                1290
            ],
            [
                1296,
                1311
            ],
            [
                1363,
                1428
            ],
            [
                1428,
                1505
            ],
            [
                1505,
                1552
            ],
            [
                1598,
                1605
            ],
            [
                1610,
                1621
            ],
            [
                1628,
                1630
            ],
            [
                1630,
                1673
            ],
            [
                1683,
                1691
            ],
            [
                1691,
                1825
            ],
            [
                1830,
                1845
            ],
            [
                2167,
                2173
            ],
            [
                2179,
                2185
            ],
            [
                2174,
                2178
            ],
            [
                2198,
                2200
            ],
            [
                2206,
                2230
            ],
            [
                2241,
                2255
            ],
            [
                2255,
                2261
            ],
            [
                2262,
                2264
            ],
            [
                2278,
                2329
            ],
            [
                2486,
                2526
            ],
            [
                2535,
                2552
            ],
            [
                2576,
                2587
            ],
            [
                2587,
                2625
            ],
            [
                2625,
                2685
            ],
            [
                2685,
                2708
            ],
            [
                2708,
                2808
            ],
            [
                2813,
                2818
            ],
            [
                2833,
                2835
            ],
            [
                2835,
                2847
            ],
            [
                2875,
                2889
            ],
            [
                2904,
                2927
            ],
            [
                2927,
                2992
            ],
            [
                2992,
                2993
            ],
            [
                3101,
                3108
            ],
            [
                3150,
                3191
            ],
            [
                3225,
                3236
            ],
            [
                3196,
                3201
            ],
            [
                3236,
                3294
            ],
            [
                3295,
                3314
            ],
            [
                3339,
                3349
            ],
            [
                3320,
                3330
            ],
            [
                3356,
                3378
            ],
            [
                3383,
                3458
            ],
            [
                3458,
                3484
            ],
            [
                3492,
                3502
            ],
            [
                3505,
                3533
            ],
            [
                3490,
                3491
            ],
            [
                3534,
                3586
            ],
            [
                3586,
                3611
            ],
            [
                3631,
                3632
            ],
            [
                3641,
                3681
            ],
            [
                3738,
                3750
            ],
            [
                3762,
                3767
            ],
            [
                3779,
                3821
            ],
            [
                3924,
                3980
            ],
            [
                4053,
                4060
            ],
            [
                4075,
                4086
            ],
            [
                4009,
                4052
            ],
            [
                4113,
                4116
            ],
            [
                4121,
                4124
            ],
            [
                4141,
                4181
            ],
            [
                4197,
                4204
            ],
            [
                4138,
                4140
            ],
            [
                4232,
                4261
            ],
            [
                4266,
                4293
            ],
            [
                4293,
                4307
            ],
            [
                4334,
                4357
            ],
            [
                4357,
                4469
            ],
            [
                4483,
                4495
            ],
            [
                4541,
                4544
            ],
            [
                4588,
                4678
            ],
            [
                4952,
                4985
            ],
            [
                4985,
                5006
            ],
            [
                5019,
                5026
            ],
            [
                5038,
                5055
            ],
            [
                5055,
                5058
            ],
            [
                5069,
                5115
            ],
            [
                5174,
                5176
            ],
            [
                5176,
                5178
            ],
            [
                5190,
                5254
            ],
            [
                5274,
                5275
            ],
            [
                5276,
                5282
            ],
            [
                5453,
                5455
            ],
            [
                5474,
                5483
            ],
            [
                5492,
                5527
            ],
            [
                5527,
                5533
            ],
            [
                5536,
                5649
            ],
            [
                5649,
                5707
            ],
            [
                5714,
                5751
            ],
            [
                5765,
                5841
            ],
            [
                5848,
                5875
            ],
            [
                5875,
                5876
            ],
            [
                5899,
                5946
            ],
            [
                5953,
                6075
            ],
            [
                6075,
                6175
            ],
            [
                6175,
                6205
            ],
            [
                6229,
                6262
            ],
            [
                6262,
                6275
            ],
            [
                6275,
                6294
            ],
            [
                6294,
                6321
            ],
            [
                6322,
                6357
            ],
            [
                6368,
                6387
            ],
            [
                6510,
                6551
            ],
            [
                6559,
                6588
            ],
            [
                6591,
                6593
            ],
            [
                6601,
                6653
            ],
            [
                6984,
                7003
            ],
            [
                7007,
                7009
            ],
            [
                7017,
                7019
            ],
            [
                7129,
                7170
            ],
            [
                7194,
                7196
            ],
            [
                7196,
                7247
            ],
            [
                7247,
                7277
            ],
            [
                7277,
                7324
            ],
            [
                7391,
                7393
            ],
            [
                7351,
                7374
            ],
            [
                7418,
                7419
            ],
            [
                7517,
                7544
            ],
            [
                7590,
                7592
            ],
            [
                8136,
                8155
            ],
            [
                8213,
                8286
            ],
            [
                8341,
                8385
            ],
            [
                8576,
                8577
            ],
            [
                8481,
                8529
            ],
            [
                8470,
                8480
            ],
            [
                8609,
                8629
            ],
            [
                8863,
                8891
            ],
            [
                8907,
                8953
            ],
            [
                9091,
                9109
            ],
            [
                9119,
                9179
            ],
            [
                9214,
                9276
            ],
            [
                9276,
                9555
            ],
            [
                9558,
                9561
            ],
            [
                9590,
                9594
            ],
            [
                9687,
                9713
            ],
            [
                9722,
                9728
            ],
            [
                9748,
                9789
            ],
            [
                9799,
                9802
            ],
            [
                9858,
                9875
            ],
            [
                9941,
                9997
            ],
            [
                9997,
                10003
            ],
            [
                10020,
                10087
            ],
            [
                10090,
                10119
            ],
            [
                10129,
                10137
            ],
            [
                10137,
                10219
            ],
            [
                10245,
                10247
            ],
            [
                10220,
                10233
            ],
            [
                10278,
                10338
            ],
            [
                10512,
                10528
            ],
            [
                10714,
                10722
            ],
            [
                10484,
                10487
            ],
            [
                10508,
                10511
            ],
            [
                10568,
                10569
            ],
            [
                10537,
                10540
            ],
            [
                10636,
                10670
            ],
            [
                10776,
                10779
            ],
            [
                10789,
                10839
            ],
            [
                10839,
                10857
            ],
            [
                10857,
                10871
            ],
            [
                10871,
                10872
            ],
            [
                10885,
                10904
            ],
            [
                10904,
                10931
            ],
            [
                10943,
                10984
            ],
            [
                10984,
                11031
            ],
            [
                11132,
                11187
            ],
            [
                11187,
                11233
            ],
            [
                11233,
                11249
            ],
            [
                11406,
                11437
            ],
            [
                11437,
                11453
            ],
            [
                11453,
                11501
            ],
            [
                11637,
                11661
            ],
            [
                11688,
                11721
            ],
            [
                11739,
                11745
            ],
            [
                11798,
                11878
            ],
            [
                11878,
                11899
            ],
            [
                12087,
                12095
            ],
            [
                12074,
                12083
            ],
            [
                12096,
                12113
            ],
            [
                12124,
                12198
            ],
            [
                12198,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12643,
                12703
            ],
            [
                12703,
                12754
            ],
            [
                12764,
                12767
            ],
            [
                12760,
                12763
            ],
            [
                12963,
                12973
            ],
            [
                12865,
                12884
            ],
            [
                13026,
                13031
            ],
            [
                12982,
                12991
            ],
            [
                13238,
                13242
            ],
            [
                12992,
                13005
            ],
            [
                13126,
                13157
            ],
            [
                13184,
                13237
            ],
            [
                12918,
                12921
            ],
            [
                13251,
                13273
            ],
            [
                13273,
                13325
            ],
            [
                13331,
                13334
            ],
            [
                13344,
                13346
            ],
            [
                13403,
                13406
            ],
            [
                13441,
                13445
            ],
            [
                13414,
                13415
            ],
            [
                13375,
                13382
            ],
            [
                13447,
                13486
            ],
            [
                13497,
                13499
            ],
            [
                13599,
                13609
            ],
            [
                13499,
                13522
            ],
            [
                13634,
                13635
            ],
            [
                13738,
                13788
            ],
            [
                13791,
                13829
            ],
            [
                13833,
                13844
            ],
            [
                13788,
                13789
            ],
            [
                13881,
                13892
            ],
            [
                13903,
                13905
            ],
            [
                14097,
                14144
            ],
            [
                14145,
                14163
            ],
            [
                14163,
                14193
            ],
            [
                14198,
                14227
            ],
            [
                14249,
                14273
            ],
            [
                14279,
                14287
            ],
            [
                14295,
                14304
            ],
            [
                14307,
                14330
            ],
            [
                14330,
                14396
            ],
            [
                14396,
                14416
            ],
            [
                14653,
                14746
            ],
            [
                14755,
                14757
            ],
            [
                14762,
                14772
            ],
            [
                14819,
                14821
            ],
            [
                14821,
                14827
            ],
            [
                14850,
                14881
            ],
            [
                14967,
                15024
            ],
            [
                15038,
                15052
            ],
            [
                15052,
                15129
            ],
            [
                15129,
                15150
            ],
            [
                15172,
                15174
            ],
            [
                15174,
                15192
            ],
            [
                15195,
                15207
            ],
            [
                15242,
                15346
            ],
            [
                15346,
                15363
            ],
            [
                15363,
                15368
            ],
            [
                15372,
                15379
            ]
        ],
        "row_chars": [
            [
                0,
                167
            ],
            [
                167,
                308
            ],
            [
                308,
                606
            ],
            [
                606,
                760
            ],
            [
                760,
                902
            ],
            [
                902,
                957
            ],
            [
                957,
                1052
            ],
            [
                1052,
                1253
            ],
            [
                1253,
                1311
            ],
            [
                1311,
                1363
            ],
            [
                1363,
                1428
            ],
            [
                1428,
                1505
            ],
            [
                1505,
                1630
            ],
            [
                1630,
                1691
            ],
            [
                1691,
                1845
            ],
            [
                1845,
                2050
            ],
            [
                2050,
                2150
            ],
            [
                2150,
                2255
            ],
            [
                2255,
                2527
            ],
            [
                2527,
                2587
            ],
            [
                2587,
                2625
            ],
            [
                2625,
                2685
            ],
            [
                2685,
                2708
            ],
            [
                2708,
                2835
            ],
            [
                2835,
                2927
            ],
            [
                2927,
                3295
            ],
            [
                3295,
                3458
            ],
            [
                3458,
                3586
            ],
            [
                3586,
                3681
            ],
            [
                3681,
                3738
            ],
            [
                3738,
                3981
            ],
            [
                3981,
                4113
            ],
            [
                4113,
                4293
            ],
            [
                4293,
                4357
            ],
            [
                4357,
                4495
            ],
            [
                4495,
                4541
            ],
            [
                4541,
                4679
            ],
            [
                4679,
                4952
            ],
            [
                4952,
                4985
            ],
            [
                4985,
                5055
            ],
            [
                5055,
                5176
            ],
            [
                5176,
                5455
            ],
            [
                5455,
                5527
            ],
            [
                5527,
                5536
            ],
            [
                5536,
                5649
            ],
            [
                5649,
                5875
            ],
            [
                5875,
                6075
            ],
            [
                6075,
                6175
            ],
            [
                6175,
                6262
            ],
            [
                6262,
                6275
            ],
            [
                6275,
                6294
            ],
            [
                6294,
                6387
            ],
            [
                6387,
                6444
            ],
            [
                6444,
                6510
            ],
            [
                6510,
                6653
            ],
            [
                6653,
                6806
            ],
            [
                6806,
                6984
            ],
            [
                6984,
                7019
            ],
            [
                7019,
                7129
            ],
            [
                7129,
                7196
            ],
            [
                7196,
                7247
            ],
            [
                7247,
                7277
            ],
            [
                7277,
                7592
            ],
            [
                7592,
                7803
            ],
            [
                7803,
                8131
            ],
            [
                8131,
                8286
            ],
            [
                8286,
                8341
            ],
            [
                8341,
                8578
            ],
            [
                8578,
                8609
            ],
            [
                8609,
                8629
            ],
            [
                8629,
                8787
            ],
            [
                8787,
                8953
            ],
            [
                8953,
                9091
            ],
            [
                9091,
                9276
            ],
            [
                9276,
                9555
            ],
            [
                9555,
                9789
            ],
            [
                9789,
                9997
            ],
            [
                9997,
                10137
            ],
            [
                10137,
                10339
            ],
            [
                10339,
                10484
            ],
            [
                10484,
                10733
            ],
            [
                10733,
                10758
            ],
            [
                10758,
                10776
            ],
            [
                10776,
                10839
            ],
            [
                10839,
                10857
            ],
            [
                10857,
                10871
            ],
            [
                10871,
                10904
            ],
            [
                10904,
                10984
            ],
            [
                10984,
                11033
            ],
            [
                11033,
                11080
            ],
            [
                11080,
                11132
            ],
            [
                11132,
                11187
            ],
            [
                11187,
                11233
            ],
            [
                11233,
                11252
            ],
            [
                11252,
                11311
            ],
            [
                11311,
                11374
            ],
            [
                11374,
                11405
            ],
            [
                11405,
                11437
            ],
            [
                11437,
                11453
            ],
            [
                11453,
                11504
            ],
            [
                11504,
                11584
            ],
            [
                11584,
                11636
            ],
            [
                11636,
                11745
            ],
            [
                11745,
                11798
            ],
            [
                11798,
                11878
            ],
            [
                11878,
                12198
            ],
            [
                12198,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12257,
                12322
            ],
            [
                12322,
                12353
            ],
            [
                12353,
                12422
            ],
            [
                12422,
                12490
            ],
            [
                12490,
                12503
            ],
            [
                12503,
                12556
            ],
            [
                12556,
                12643
            ],
            [
                12643,
                12703
            ],
            [
                12703,
                13273
            ],
            [
                13273,
                13346
            ],
            [
                13346,
                13499
            ],
            [
                13499,
                13636
            ],
            [
                13636,
                13738
            ],
            [
                13738,
                13905
            ],
            [
                13905,
                13996
            ],
            [
                13996,
                14040
            ],
            [
                14040,
                14085
            ],
            [
                14085,
                14163
            ],
            [
                14163,
                14330
            ],
            [
                14330,
                14396
            ],
            [
                14396,
                14416
            ],
            [
                14416,
                14495
            ],
            [
                14495,
                14611
            ],
            [
                14611,
                14653
            ],
            [
                14653,
                14821
            ],
            [
                14821,
                15052
            ],
            [
                15052,
                15129
            ],
            [
                15129,
                15174
            ],
            [
                15174,
                15195
            ],
            [
                15195,
                15346
            ],
            [
                15346,
                15363
            ],
            [
                15363,
                15379
            ]
        ]
    },
    "abridged": {
        "text": "When Hetta received the letter from Paul Montague, it did not alleviate her misery. Even when she had read it half-a-dozen times, she could not see how she could be reconciled to him.\nIt was not only that he had sinned against her by associating with another woman, at the very time at which he was becoming engaged to her - but also that he had done this in such a way as to make his offence known to her friends. He had been rejected, and she thought it was impossible that she should recall him. But they should all know that her heart was unchanged. Roger Carbury should certainly know it, if he ever asked her. Though she knew that Paul had behaved badly, yet she would be true to him as far as her own heart was concerned.\nAnd now he told her that she had been unjust to him. He did not fill his letter with entreaties, but with reproaches. And certainly his reproaches moved her more than any prayer would have done. It was too late now to remedy the evil; but she wondered if she had been unjust. The more she thought of it the more puzzled she became. Had she quarrelled with him because he had once been in love with Mrs. Hurtle, or because she had grounds for regarding Mrs. Hurtle as a present rival? Maybe he had indeed been forced by circumstances to go with her to Lowestoft. Having done so, it was no doubt right that he should be rejected; but still there might be hardship in it.\nTo Hetta herself, it was very hard. She loved the man with all her heart. She could look forward to no happiness in life without him. But yet it must be so.\nAt the end of his letter he had told her to go to Mrs. Hurtle herself if she wanted corroboration of his story. Of course he knew that she could not go to Mrs. Hurtle. But when the letter had been in her possession three or four days - unanswered, but constantly re-read - she began to think that if she could hear Mrs. Hurtle's story, a good deal that was now dark might become light to her.\nAs she continued to brood over the letter, by degrees her anger turned from her lover to her mother, her brother, and to her cousin Roger. Paul had of course behaved very badly - but had it not been for them, she might have had an opportunity of forgiving him. They had driven her on to a rejection from which she could now see no escape. In the first agony caused by that awful story of the American woman, she had fallen head foremost into the trap laid for her.\nShe was almost sure that it was too late to recover her ground. But she could still do battle with her mother and her cousin - if only to show that she would not submit her feelings to their control. She was savage against all authority. Roger Carbury would of course think that any communication between herself and Mrs. Hurtle must be most improper and indelicate. But she was beginning to feel herself capable of throwing propriety and delicacy to the winds.\nShe would appeal to Mrs. Hurtle. The woman was odious, a nasty scheming American female. But Paul desired that she should hear the woman's story.\nSo she wrote as follows to Mrs. Hurtle, finding great difficulty in composing a suitable letter. It was stiff, but it sufficed for its purpose.\nMadam,\nMr. Paul Montague has referred me to you as to certain circumstances which have taken place between him and you. It is right that I should tell you that I was a short time ago engaged to marry him, but that I have been obliged to break off that engagement in consequence of what I have been told about his acquaintance with you. I write to you, not thinking that anything you will say can change my mind, but because he has asked me to do so, and has, at the same time, accused me of injustice towards him. I do not wish to rest under an accusation of injustice from one to whom I was once warmly attached. If you will receive me, I will call any afternoon you may name.\nYours truly,\nHenrietta Carbury.\nWhen the letter was written and posted she was not only ashamed of it, but afraid of it also. What if this Mrs. Hurtle should send back some horribly insolent answer - or send such answer to her mother, instead of herself! She told no word of the letter to anyone. She could not ask her mother for sympathy. There was no friend who would sympathise with her. She must do everything alone.\nMrs. Hurtle, it will be remembered, had at last decided to retire from the contest, though not without many changing phases of her mind. But she had parted with Paul, and had told Mrs. Pipkin that she was no longer engaged to be married. The game had been played and the stakes lost.\nBut from time to time there arose in her heart a wish for vengeance. Who had spared her? Should she now simply retire to weep in a corner like a love-sick schoolgirl? There were moments when she thought that she could still seize the man by the throat, and dare him to deny that he was false, perjured, and mean.\nThen she received a long passionate letter from Paul Montague, written at the same time as those other letters to Roger Carbury and Hetta, in which he told her all the circumstances of his engagement to Hetta Carbury, and implored her to substantiate the truth of his own story. She was amazed that he should write such a letter; but it did not increase either her anger or her sorrow. She told herself that she and this young Englishman were not fit to be mated. He was a tame, sleek household animal, whereas she knew herself to be wild - fitter for the woods than for cities. It had been one of the faults of her life that she had allowed herself to be bound to him by tenderness; and the result had been disastrous, as might have been expected.\nMrs. Pipkin, who had been told her engagement was ended, asked her, \"That letter was from Mr. Montague? One gets to know handwritings when letters come frequent.\"\n\"It was from him. And why not?\"\n\"Why not certainly? I wish he'd write every day, so that things would come round again. Nothing ever troubles me so much as broken love.\"\n\"It is all over, and there is no good in talking of it. I shall return to New York on Saturday week.\"\n\"Oh, Mrs. Hurtle! I know he has ill-treated you. I know he has.\"\n\"I am not disposed to talk about it, Mrs. Pipkin. If I had anything to say it would be to the gentleman, and no one else. You have been very kind to me, Mrs. Pipkin, and I shall be sorry to leave you.\"\n\"Oh, Mrs. Hurtle, you've been a Godsend to me this summer - I've paid everything, butcher, baker, rates and all, just like clockwork. And now you're going away!\" Then Mrs. Pipkin began to sob.\nIt was after this that Mrs. Hurtle received Hetta's letter. She had as yet returned no answer to Paul Montague, although she had thought of writing to the girl, and had pondered the words that she would use - whether she would tell the tale in a manner to suit Paul's purpose, or so as to bring him utterly to shipwreck. She did not doubt that she could cause the shipwreck if she wished. But such a revenge did not recommend itself to Mrs. Hurtle. She would have preferred a pistol or a horsewhip.\nThen came Hetta's note, so stiff, so cold, so true - so like the letter of an Englishwoman, thought Mrs. Hurtle, smiling as she read it. She could see well enough that the girl's heart was still set upon the man. Nevertheless she did not doubt that she could tell the story so as to make it impossible for the girl to marry him - if she chose to do so.\nAt first she thought that she would not answer the letter at all. What was it to her? But after a while she thought that she might as well see this English chit who had superseded her in Montague's affections. And if all revenge was to be abandoned, why should she not say a kind word so as to smooth away difficulties? Wild cat as she was, kindness was more congenial to her nature than cruelty. So she wrote to Hetta.\nDear Miss Carbury,\nIf you could call here either Thursday or Friday at any hour between two and four, I shall be very happy to see you.\nYours sincerely,\nWinifred Hurtle.",
        "paragraph_chars": [
            [
                0,
                184
            ],
            [
                184,
                729
            ],
            [
                729,
                1398
            ],
            [
                1398,
                1555
            ],
            [
                1555,
                1948
            ],
            [
                1948,
                2413
            ],
            [
                2413,
                2875
            ],
            [
                2875,
                3021
            ],
            [
                3021,
                3165
            ],
            [
                3165,
                3172
            ],
            [
                3172,
                3843
            ],
            [
                3843,
                3856
            ],
            [
                3856,
                3875
            ],
            [
                3875,
                4264
            ],
            [
                4264,
                4548
            ],
            [
                4548,
                4861
            ],
            [
                4861,
                5610
            ],
            [
                5610,
                5773
            ],
            [
                5773,
                5805
            ],
            [
                5805,
                5943
            ],
            [
                5943,
                6045
            ],
            [
                6045,
                6110
            ],
            [
                6110,
                6312
            ],
            [
                6312,
                6505
            ],
            [
                6505,
                7004
            ],
            [
                7004,
                7357
            ],
            [
                7357,
                7777
            ],
            [
                7777,
                7796
            ],
            [
                7796,
                7913
            ],
            [
                7913,
                7930
            ],
            [
                7930,
                7946
            ]
        ],
        "segment_chars": [
            [
                0,
                84
            ],
            [
                84,
                184
            ],
            [
                184,
                415
            ],
            [
                415,
                499
            ],
            [
                499,
                554
            ],
            [
                554,
                616
            ],
            [
                616,
                729
            ],
            [
                729,
                782
            ],
            [
                782,
                847
            ],
            [
                847,
                924
            ],
            [
                924,
                1005
            ],
            [
                1005,
                1061
            ],
            [
                1061,
                1213
            ],
            [
                1213,
                1291
            ],
            [
                1291,
                1398
            ],
            [
                1398,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1532
            ],
            [
                1532,
                1555
            ],
            [
                1555,
                1667
            ],
            [
                1667,
                1723
            ],
            [
                1723,
                1948
            ],
            [
                1948,
                2087
            ],
            [
                2087,
                2209
            ],
            [
                2209,
                2287
            ],
            [
                2287,
                2413
            ],
            [
                2413,
                2477
            ],
            [
                2477,
                2613
            ],
            [
                2613,
                2651
            ],
            [
                2651,
                2780
            ],
            [
                2780,
                2875
            ],
            [
                2875,
                2908
            ],
            [
                2908,
                2964
            ],
            [
                2964,
                3021
            ],
            [
                3021,
                3118
            ],
            [
                3118,
                3165
            ],
            [
                3165,
                3172
            ],
            [
                3172,
                3285
            ],
            [
                3285,
                3501
            ],
            [
                3501,
                3679
            ],
            [
                3679,
                3779
            ],
            [
                3779,
                3843
            ],
            [
                3843,
                3856
            ],
            [
                3856,
                3875
            ],
            [
                3875,
                3969
            ],
            [
                3969,
                4098
            ],
            [
                4098,
                4140
            ],
            [
                4140,
                4183
            ],
            [
                4183,
                4234
            ],
            [
                4234,
                4264
            ],
            [
                4264,
                4401
            ],
            [
                4401,
                4502
            ],
            [
                4502,
                4548
            ],
            [
                4548,
                4617
            ],
            [
                4617,
                4637
            ],
            [
                4637,
                4715
            ],
            [
                4715,
                4861
            ],
            [
                4861,
                5140
            ],
            [
                5140,
                5247
            ],
            [
                5247,
                5325
            ],
            [
                5325,
                5440
            ],
            [
                5440,
                5610
            ],
            [
                5610,
                5714
            ],
            [
                5714,
                5773
            ],
            [
                5773,
                5791
            ],
            [
                5791,
                5805
            ],
            [
                5805,
                5825
            ],
            [
                5825,
                5893
            ],
            [
                5893,
                5943
            ],
            [
                5943,
                5999
            ],
            [
                5999,
                6045
            ],
            [
                6045,
                6063
            ],
            [
                6063,
                6094
            ],
            [
                6094,
                6110
            ],
            [
                6110,
                6160
            ],
            [
                6160,
                6232
            ],
            [
                6232,
                6312
            ],
            [
                6312,
                6446
            ],
            [
                6446,
                6474
            ],
            [
                6474,
                6505
            ],
            [
                6505,
                6565
            ],
            [
                6565,
                6826
            ],
            [
                6826,
                6894
            ],
            [
                6894,
                6954
            ],
            [
                6954,
                7004
            ],
            [
                7004,
                7141
            ],
            [
                7141,
                7217
            ],
            [
                7217,
                7357
            ],
            [
                7357,
                7423
            ],
            [
                7423,
                7443
            ],
            [
                7443,
                7567
            ],
            [
                7567,
                7677
            ],
            [
                7677,
                7754
            ],
            [
                7754,
                7777
            ],
            [
                7777,
                7796
            ],
            [
                7796,
                7913
            ],
            [
                7913,
                7930
            ],
            [
                7930,
                7946
            ]
        ],
        "overlap_chars": [
            [
                0,
                10
            ],
            [
                11,
                19
            ],
            [
                20,
                23
            ],
            [
                24,
                35
            ],
            [
                49,
                53
            ],
            [
                54,
                61
            ],
            [
                62,
                84
            ],
            [
                84,
                109
            ],
            [
                110,
                143
            ],
            [
                152,
                178
            ],
            [
                182,
                183
            ],
            [
                184,
                233
            ],
            [
                251,
                264
            ],
            [
                264,
                322
            ],
            [
                325,
                365
            ],
            [
                370,
                401
            ],
            [
                402,
                415
            ],
            [
                418,
                440
            ],
            [
                441,
                452
            ],
            [
                453,
                459
            ],
            [
                460,
                499
            ],
            [
                499,
                554
            ],
            [
                554,
                589
            ],
            [
                592,
                614
            ],
            [
                614,
                616
            ],
            [
                616,
                636
            ],
            [
                642,
                660
            ],
            [
                661,
                729
            ],
            [
                729,
                766
            ],
            [
                767,
                782
            ],
            [
                782,
                847
            ],
            [
                847,
                924
            ],
            [
                924,
                971
            ],
            [
                984,
                991
            ],
            [
                992,
                1003
            ],
            [
                1003,
                1005
            ],
            [
                1005,
                1048
            ],
            [
                1053,
                1061
            ],
            [
                1061,
                1195
            ],
            [
                1198,
                1213
            ],
            [
                1219,
                1225
            ],
            [
                1226,
                1232
            ],
            [
                1233,
                1237
            ],
            [
                1245,
                1247
            ],
            [
                1248,
                1272
            ],
            [
                1277,
                1291
            ],
            [
                1291,
                1297
            ],
            [
                1303,
                1305
            ],
            [
                1305,
                1356
            ],
            [
                1357,
                1397
            ],
            [
                1398,
                1415
            ],
            [
                1423,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1532
            ],
            [
                1532,
                1555
            ],
            [
                1555,
                1655
            ],
            [
                1660,
                1665
            ],
            [
                1665,
                1667
            ],
            [
                1667,
                1679
            ],
            [
                1685,
                1699
            ],
            [
                1700,
                1723
            ],
            [
                1723,
                1788
            ],
            [
                1801,
                1802
            ],
            [
                1818,
                1825
            ],
            [
                1828,
                1869
            ],
            [
                1870,
                1881
            ],
            [
                1884,
                1889
            ],
            [
                1889,
                1947
            ],
            [
                1948,
                1967
            ],
            [
                1968,
                1978
            ],
            [
                1979,
                1989
            ],
            [
                1989,
                2011
            ],
            [
                2012,
                2087
            ],
            [
                2087,
                2113
            ],
            [
                2114,
                2124
            ],
            [
                2127,
                2155
            ],
            [
                2155,
                2156
            ],
            [
                2157,
                2209
            ],
            [
                2209,
                2234
            ],
            [
                2235,
                2236
            ],
            [
                2247,
                2287
            ],
            [
                2287,
                2299
            ],
            [
                2300,
                2305
            ],
            [
                2313,
                2355
            ],
            [
                2356,
                2412
            ],
            [
                2413,
                2420
            ],
            [
                2421,
                2432
            ],
            [
                2433,
                2476
            ],
            [
                2477,
                2480
            ],
            [
                2481,
                2484
            ],
            [
                2497,
                2537
            ],
            [
                2540,
                2547
            ],
            [
                2548,
                2550
            ],
            [
                2556,
                2585
            ],
            [
                2586,
                2613
            ],
            [
                2613,
                2627
            ],
            [
                2628,
                2651
            ],
            [
                2651,
                2763
            ],
            [
                2768,
                2780
            ],
            [
                2780,
                2783
            ],
            [
                2784,
                2874
            ],
            [
                2875,
                2908
            ],
            [
                2908,
                2929
            ],
            [
                2930,
                2937
            ],
            [
                2947,
                2964
            ],
            [
                2964,
                2967
            ],
            [
                2973,
                3019
            ],
            [
                3019,
                3021
            ],
            [
                3021,
                3023
            ],
            [
                3024,
                3088
            ],
            [
                3099,
                3100
            ],
            [
                3110,
                3116
            ],
            [
                3116,
                3118
            ],
            [
                3121,
                3130
            ],
            [
                3130,
                3165
            ],
            [
                3165,
                3171
            ],
            [
                3172,
                3285
            ],
            [
                3285,
                3343
            ],
            [
                3348,
                3385
            ],
            [
                3391,
                3467
            ],
            [
                3474,
                3501
            ],
            [
                3501,
                3502
            ],
            [
                3509,
                3556
            ],
            [
                3557,
                3679
            ],
            [
                3679,
                3779
            ],
            [
                3779,
                3809
            ],
            [
                3810,
                3843
            ],
            [
                3843,
                3856
            ],
            [
                3856,
                3875
            ],
            [
                3875,
                3902
            ],
            [
                3914,
                3949
            ],
            [
                3950,
                3969
            ],
            [
                3969,
                4010
            ],
            [
                4011,
                4040
            ],
            [
                4043,
                4045
            ],
            [
                4046,
                4098
            ],
            [
                4098,
                4117
            ],
            [
                4129,
                4131
            ],
            [
                4138,
                4140
            ],
            [
                4140,
                4181
            ],
            [
                4181,
                4183
            ],
            [
                4183,
                4234
            ],
            [
                4234,
                4264
            ],
            [
                4264,
                4311
            ],
            [
                4320,
                4322
            ],
            [
                4323,
                4346
            ],
            [
                4346,
                4347
            ],
            [
                4372,
                4399
            ],
            [
                4399,
                4401
            ],
            [
                4405,
                4424
            ],
            [
                4429,
                4502
            ],
            [
                4502,
                4546
            ],
            [
                4546,
                4547
            ],
            [
                4548,
                4596
            ],
            [
                4606,
                4616
            ],
            [
                4617,
                4637
            ],
            [
                4637,
                4665
            ],
            [
                4669,
                4715
            ],
            [
                4715,
                4733
            ],
            [
                4739,
                4799
            ],
            [
                4799,
                4861
            ],
            [
                4861,
                5140
            ],
            [
                5144,
                5147
            ],
            [
                5155,
                5159
            ],
            [
                5163,
                5189
            ],
            [
                5191,
                5197
            ],
            [
                5206,
                5247
            ],
            [
                5247,
                5250
            ],
            [
                5251,
                5268
            ],
            [
                5269,
                5325
            ],
            [
                5325,
                5331
            ],
            [
                5332,
                5399
            ],
            [
                5402,
                5431
            ],
            [
                5432,
                5440
            ],
            [
                5440,
                5522
            ],
            [
                5523,
                5525
            ],
            [
                5530,
                5543
            ],
            [
                5549,
                5609
            ],
            [
                5610,
                5626
            ],
            [
                5627,
                5635
            ],
            [
                5641,
                5644
            ],
            [
                5656,
                5659
            ],
            [
                5665,
                5666
            ],
            [
                5673,
                5676
            ],
            [
                5678,
                5712
            ],
            [
                5714,
                5717
            ],
            [
                5723,
                5773
            ],
            [
                5773,
                5791
            ],
            [
                5791,
                5805
            ],
            [
                5805,
                5806
            ],
            [
                5806,
                5825
            ],
            [
                5825,
                5852
            ],
            [
                5852,
                5893
            ],
            [
                5893,
                5940
            ],
            [
                5944,
                5999
            ],
            [
                5999,
                6045
            ],
            [
                6045,
                6061
            ],
            [
                6063,
                6094
            ],
            [
                6094,
                6110
            ],
            [
                6110,
                6158
            ],
            [
                6160,
                6184
            ],
            [
                6185,
                6218
            ],
            [
                6226,
                6232
            ],
            [
                6232,
                6312
            ],
            [
                6312,
                6333
            ],
            [
                6333,
                6341
            ],
            [
                6342,
                6351
            ],
            [
                6352,
                6369
            ],
            [
                6372,
                6446
            ],
            [
                6446,
                6474
            ],
            [
                6474,
                6505
            ],
            [
                6505,
                6565
            ],
            [
                6565,
                6616
            ],
            [
                6626,
                6629
            ],
            [
                6630,
                6633
            ],
            [
                6634,
                6644
            ],
            [
                6645,
                6664
            ],
            [
                6664,
                6669
            ],
            [
                6683,
                6692
            ],
            [
                6693,
                6697
            ],
            [
                6698,
                6711
            ],
            [
                6714,
                6745
            ],
            [
                6746,
                6799
            ],
            [
                6800,
                6803
            ],
            [
                6804,
                6826
            ],
            [
                6826,
                6878
            ],
            [
                6882,
                6885
            ],
            [
                6892,
                6894
            ],
            [
                6894,
                6897
            ],
            [
                6898,
                6902
            ],
            [
                6903,
                6904
            ],
            [
                6905,
                6912
            ],
            [
                6913,
                6952
            ],
            [
                6952,
                6954
            ],
            [
                6958,
                6968
            ],
            [
                6979,
                7002
            ],
            [
                7002,
                7003
            ],
            [
                7004,
                7054
            ],
            [
                7057,
                7095
            ],
            [
                7104,
                7115
            ],
            [
                7115,
                7116
            ],
            [
                7125,
                7136
            ],
            [
                7139,
                7141
            ],
            [
                7145,
                7192
            ],
            [
                7199,
                7217
            ],
            [
                7217,
                7247
            ],
            [
                7248,
                7277
            ],
            [
                7281,
                7305
            ],
            [
                7310,
                7318
            ],
            [
                7322,
                7331
            ],
            [
                7334,
                7357
            ],
            [
                7357,
                7423
            ],
            [
                7423,
                7443
            ],
            [
                7443,
                7536
            ],
            [
                7541,
                7543
            ],
            [
                7555,
                7565
            ],
            [
                7565,
                7567
            ],
            [
                7567,
                7573
            ],
            [
                7574,
                7605
            ],
            [
                7605,
                7662
            ],
            [
                7663,
                7677
            ],
            [
                7677,
                7754
            ],
            [
                7754,
                7775
            ],
            [
                7775,
                7777
            ],
            [
                7777,
                7795
            ],
            [
                7796,
                7808
            ],
            [
                7809,
                7913
            ],
            [
                7913,
                7930
            ],
            [
                7930,
                7935
            ],
            [
                7939,
                7946
            ]
        ],
        "row_chars": [
            [
                0,
                84
            ],
            [
                84,
                184
            ],
            [
                184,
                415
            ],
            [
                415,
                415
            ],
            [
                415,
                499
            ],
            [
                499,
                554
            ],
            [
                554,
                616
            ],
            [
                616,
                729
            ],
            [
                729,
                782
            ],
            [
                782,
                782
            ],
            [
                782,
                847
            ],
            [
                847,
                924
            ],
            [
                924,
                1005
            ],
            [
                1005,
                1061
            ],
            [
                1061,
                1213
            ],
            [
                1213,
                1213
            ],
            [
                1213,
                1213
            ],
            [
                1213,
                1291
            ],
            [
                1291,
                1398
            ],
            [
                1398,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1532
            ],
            [
                1532,
                1555
            ],
            [
                1555,
                1667
            ],
            [
                1667,
                1723
            ],
            [
                1723,
                1948
            ],
            [
                1948,
                2087
            ],
            [
                2087,
                2209
            ],
            [
                2209,
                2287
            ],
            [
                2287,
                2287
            ],
            [
                2287,
                2413
            ],
            [
                2413,
                2477
            ],
            [
                2477,
                2613
            ],
            [
                2613,
                2651
            ],
            [
                2651,
                2780
            ],
            [
                2780,
                2780
            ],
            [
                2780,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2908
            ],
            [
                2908,
                2964
            ],
            [
                2964,
                3021
            ],
            [
                3021,
                3118
            ],
            [
                3118,
                3165
            ],
            [
                3165,
                3172
            ],
            [
                3172,
                3285
            ],
            [
                3285,
                3501
            ],
            [
                3501,
                3679
            ],
            [
                3679,
                3779
            ],
            [
                3779,
                3843
            ],
            [
                3843,
                3856
            ],
            [
                3856,
                3875
            ],
            [
                3875,
                3969
            ],
            [
                3969,
                3969
            ],
            [
                3969,
                3969
            ],
            [
                3969,
                4098
            ],
            [
                4098,
                4098
            ],
            [
                4098,
                4098
            ],
            [
                4098,
                4140
            ],
            [
                4140,
                4140
            ],
            [
                4140,
                4183
            ],
            [
                4183,
                4234
            ],
            [
                4234,
                4264
            ],
            [
                4264,
                4401
            ],
            [
                4401,
                4401
            ],
            [
                4401,
                4401
            ],
            [
                4401,
                4502
            ],
            [
                4502,
                4502
            ],
            [
                4502,
                4617
            ],
            [
                4617,
                4617
            ],
            [
                4617,
                4637
            ],
            [
                4637,
                4637
            ],
            [
                4637,
                4715
            ],
            [
                4715,
                4715
            ],
            [
                4715,
                4861
            ],
            [
                4861,
                5140
            ],
            [
                5140,
                5247
            ],
            [
                5247,
                5325
            ],
            [
                5325,
                5440
            ],
            [
                5440,
                5610
            ],
            [
                5610,
                5610
            ],
            [
                5610,
                5714
            ],
            [
                5714,
                5714
            ],
            [
                5714,
                5714
            ],
            [
                5714,
                5773
            ],
            [
                5773,
                5791
            ],
            [
                5791,
                5805
            ],
            [
                5805,
                5825
            ],
            [
                5825,
                5893
            ],
            [
                5893,
                5943
            ],
            [
                5943,
                5943
            ],
            [
                5943,
                5943
            ],
            [
                5943,
                5999
            ],
            [
                5999,
                6045
            ],
            [
                6045,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6094
            ],
            [
                6094,
                6110
            ],
            [
                6110,
                6160
            ],
            [
                6160,
                6160
            ],
            [
                6160,
                6160
            ],
            [
                6160,
                6232
            ],
            [
                6232,
                6232
            ],
            [
                6232,
                6312
            ],
            [
                6312,
                6446
            ],
            [
                6446,
                6474
            ],
            [
                6474,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6565
            ],
            [
                6565,
                6826
            ],
            [
                6826,
                6894
            ],
            [
                6894,
                6954
            ],
            [
                6954,
                7004
            ],
            [
                7004,
                7004
            ],
            [
                7004,
                7141
            ],
            [
                7141,
                7141
            ],
            [
                7141,
                7141
            ],
            [
                7141,
                7141
            ],
            [
                7141,
                7217
            ],
            [
                7217,
                7357
            ],
            [
                7357,
                7423
            ],
            [
                7423,
                7443
            ],
            [
                7443,
                7443
            ],
            [
                7443,
                7443
            ],
            [
                7443,
                7443
            ],
            [
                7443,
                7567
            ],
            [
                7567,
                7677
            ],
            [
                7677,
                7754
            ],
            [
                7754,
                7777
            ],
            [
                7777,
                7796
            ],
            [
                7796,
                7913
            ],
            [
                7913,
                7930
            ],
            [
                7930,
                7946
            ]
        ]
    }
}