{
    "original": {
        "text": "Ten days had passed since the meeting narrated in the last chapter,--ten days, during which Hetta's letter had been sent to her lover, but in which she had received no reply,--when two gentlemen met each other in a certain room in Liverpool, who were seen together in the same room in the early part of this chronicle. These were our young friend Paul Montague, and our not much older friend Hamilton K. Fisker. Melmotte had died on the 18th of July, and tidings of the event had been at once sent by telegraph to San Francisco. Some weeks before this Montague had written to his partner, giving his account of the South Central Pacific and Mexican Railway Company,--describing its condition in England as he then believed it to be,--and urging Fisker to come over to London. On receipt of a message from his American correspondent he had gone down to Liverpool, and had there awaited Fisker's arrival, taking counsel with his friend Mr. Ramsbottom. In the mean time Hetta's letter was lying at the Beargarden, Paul having written from his club and having omitted to desire that the answer should be sent to his lodgings. Just at this moment things at the Beargarden were not well managed. They were indeed so ill managed that Paul never received that letter,--which would have had for him charms greater than those of any letter ever before written.\n\"This is a terrible business,\" said Fisker, immediately on entering the room in which Montague was waiting him. \"He was the last man I'd have thought would be cut up in that way.\"\n\"He was utterly ruined.\"\n\"He wouldn't have been ruined,--and couldn't have thought so if he'd known all he ought to have known. The South Central would have pulled him through a'most anything if he'd have understood how to play it.\"\n\"We don't think much of the South Central here now,\" said Paul.\n\"Ah;--that's because you've never above half spirit enough for a big thing. You nibble at it instead of swallowing it whole,--and then, of course, folks see that you're only nibbling. I thought that Melmotte would have had spirit.\"\n\"There is, I fear, no doubt that he had committed forgery. It was the dread of detection as to that which drove him to destroy himself.\"\n\"I call it dam clumsy from beginning to end;--dam clumsy. I took him to be a different man, and I feel more than half ashamed of myself because I trusted such a fellow. That chap Cohenlupe has got off with a lot of swag. Only think of Melmotte allowing Cohenlupe to get the better of him!\"\n\"I suppose the thing will be broken up now at San Francisco,\" suggested Paul.\n\"Bu'st up at Frisco! Not if I know it. Why should it be bu'st up? D'you think we're all going to smash there because a fool like Melmotte blows his brains out in London?\"\n\"He took poison.\"\n\"Or p'ison either. That's not just our way. I'll tell you what I'm going to do; and why I'm over here so uncommon sharp. These shares are at a'most nothing now in London. I'll buy every share in the market. I wired for as many as I dar'd, so as not to spoil our own game, and I'll make a clean sweep of every one of them. Bu'st up! I'm sorry for him because I thought him a biggish man;--but what he's done 'll just be the making of us over there. Will you get out of it, or will you come back to Frisco with me?\"\nIn answer to this Paul asserted most strenuously that he would not return to San Francisco, and, perhaps too ingenuously, gave his partner to understand that he was altogether sick of the great railway, and would under no circumstances have anything more to do with it. Fisker shrugged his shoulders, and was not displeased at the proposed rupture. He was prepared to deal fairly,--nay, generously,--by his partner, having recognised the wisdom of that great commercial rule which teaches us that honour should prevail among associates of a certain class; but he had fully convinced himself that Paul Montague was not a fit partner for Hamilton K. Fisker. Fisker was not only unscrupulous himself, but he had a thorough contempt for scruples in others. According to his theory of life, nine hundred and ninety-nine men were obscure because of their scruples, whilst the thousandth man predominated and cropped up into the splendour of commercial wealth because he was free from such bondage. He had his own theories, too, as to commercial honesty. That which he had promised to do he would do, if it was within his power. He was anxious that his bond should be good, and his word equally so. But the work of robbing mankind in gross by magnificently false representations, was not only the duty, but also the delight and the ambition of his life. How could a man so great endure a partnership with one so small as Paul Montague? \"And now what about Winifrid Hurtle?\" asked Fisker.\n\"What makes you ask? She's in London.\"\n\"Oh yes, I know she's in London, and Hurtle's at Frisco, swearing that he'll come after her. He would, only he hasn't got the dollars.\"\n\"He's not dead then?\" muttered Paul.\n\"Dead!--no, nor likely to die. She'll have a bad time of it with him yet.\"\n\"But she divorced him.\"\n\"She got a Kansas lawyer to say so, and he's got a Frisco lawyer to say that there's nothing of the kind. She hasn't played her game badly neither, for she's had the handling of her own money, and has put it so that he can't get hold of a dollar. Even if it suited other ways, you know, I wouldn't marry her myself till I saw my way clearer out of the wood.\"\n\"I'm not thinking of marrying her,--if you mean that.\"\n\"There was a talk about it in Frisco;--that's all. And I have heard Hurtle say when he was a little farther gone than usual that she was here with you, and that he meant to drop in on you some of these days.\" To this Paul made no answer, thinking that he had now both heard enough and said enough about Mrs. Hurtle.\nOn the following day the two men, who were still partners, went together to London, and Fisker immediately became immersed in the arrangement of Melmotte's affairs. He put himself into communication with Mr. Brehgert, went in and out of the offices in Abchurch Lane and the rooms which had belonged to the Railway Company, cross-examined Croll, mastered the books of the Company as far as they were to be mastered, and actually summoned both the Grendalls, father and son, up to London. Lord Alfred, and Miles with him, had left London a day or two before Melmotte's death,--having probably perceived that there was no further occasion for their services. To Fisker's appeal Lord Alfred was proudly indifferent. Who was this American that he should call upon a director of the London Company to appear? Does not every one know that a director of a company need not direct unless he pleases? Lord Alfred, therefore, did not even condescend to answer Fisker's letter;--but he advised his son to run up to town. \"I should just go, because I'd taken a salary from the d---- Company,\" said the careful father, \"but when there I wouldn't say a word.\" So Miles Grendall, obeying his parent, reappeared upon the scene.\nBut Fisker's attention was perhaps most usefully and most sedulously paid to Madame Melmotte and her daughter. Till Fisker arrived no one had visited them in their solitude at Hampstead, except Croll, the clerk. Mr. Brehgert had abstained, thinking that a widow, who had become a widow under such terrible circumstances, would prefer to be alone. Lord Nidderdale had made his adieux, and felt that he could do no more. It need hardly be said that Lord Alfred had too much good taste to interfere at such a time, although for some months he had been domestically intimate with the poor woman, or that Sir Felix would not be prompted by the father's death to renew his suit to the daughter. But Fisker had not been two days in London before he went out to Hampstead, and was admitted to Madame Melmotte's presence;--and he had not been there four days before he was aware that in spite of all misfortunes, Marie Melmotte was still the undoubted possessor of a large fortune.\nIn regard to Melmotte's effects generally the Crown had been induced to abstain from interfering,--giving up the right to all the man's plate and chairs and tables which it had acquired by the finding of the coroner's verdict,--not from tenderness to Madame Melmotte, for whom no great commiseration was felt, but on behalf of such creditors as poor Mr. Longestaffe and his son. But Marie's money was quite distinct from this. She had been right in her own belief as to this property, and had been right, too, in refusing to sign those papers,--unless it may be that that refusal led to her father's act. She herself was sure that it was not so, because she had withdrawn her refusal, and had offered to sign the papers before her father's death. What might have been the ultimate result had she done so when he first made the request, no one could now say. That the money would have gone there could be no doubt. The money was now hers,--a fact which Fisker soon learned with that peculiar cleverness which belonged to him.\nPoor Madame Melmotte felt the visits of the American to be a relief to her in her misery. The world makes great mistakes as to that which is and is not beneficial to those whom Death has bereaved of a companion. It may be, no doubt sometimes it is the case, that grief shall be so heavy, so absolutely crushing, as to make any interference with it an additional trouble, and this is felt also in acute bodily pain, and in periods of terrible mental suffering. It may also be, and, no doubt, often is the case, that the bereaved one chooses to affect such overbearing sorrow, and that friends abstain, because even such affectation has its own rights and privileges. But Madame Melmotte was neither crushed by grief nor did she affect to be so crushed. She had been numbed by the suddenness and by the awe of the catastrophe. The man who had been her merciless tyrant for years, who had seemed to her to be a very incarnation of cruel power, had succumbed, and shown himself to be powerless against his own misfortunes. She was a woman of very few words, and had spoken almost none on this occasion even to her own daughter; but when Fisker came to her, and told her more than she had ever known before of her husband's affairs, and spoke to her of her future life, and mixed for her a small glass of brandy-and-water warm, and told her that Frisco would be the fittest place for her future residence, she certainly did not find him to be intrusive.\nAnd even Marie liked Fisker, though she had been wooed and almost won both by a lord and a baronet, and had understood, if not much, at least more than her mother, of the life to which she had been introduced. There was something of real sorrow in her heart for her father. She was prone to love,--though, perhaps, not prone to deep affection. Melmotte had certainly been often cruel to her, but he had also been very indulgent. And as she had never been specially grateful for the one, so neither had she ever specially resented the other. Tenderness, care, real solicitude for her well-being, she had never known, and had come to regard the unevenness of her life, vacillating between knocks and knick-knacks, with a blow one day and a jewel the next, as the condition of things which was natural to her. When her father was dead she remembered for a while the jewels and the knick-knacks, and forgot the knocks and blows. But she was not beyond consolation, and she also found consolation in Mr. Fisker's visits.\n\"I used to sign a paper every quarter,\" she said to Fisker, as they were walking together one evening in the lanes round Hampstead.\n\"You'll have to do the same now, only instead of giving the paper to any one you'll have to leave it in a banker's hands to draw the money for yourself.\"\n\"And can that be done over in California?\"\n\"Just the same as here. Your bankers will manage it all for you without the slightest trouble. For the matter of that I'll do it, if you'll trust me. There's only one thing against it all, Miss Melmotte.\"\n\"And what's that?\"\n\"After the sort of society you've been used to here, I don't know how you'll get on among us Americans. We're a pretty rough lot, I guess. Though, perhaps, what you lose in the look of the fruit, you'll make up in the flavour.\" This Fisker said in a somewhat plaintive tone, as though fearing that the manifest substantial advantages of Frisco would not suffice to atone for the loss of that fashion to which Miss Melmotte had been used.\n\"I hate swells,\" said Marie, flashing round upon him.\n\"Do you now?\"\n\"Like poison. What's the use of 'em? They never mean a word that they say,--and they don't say so many words either. They're never more than half awake, and don't care the least about anybody. I hate London.\"\n\"Do you now?\"\n\"Oh, don't I?\"\n\"I wonder whether you'd hate Frisco?\"\n\"I rather think it would be a jolly sort of place.\"\n\"Very jolly I find it. And I wonder whether you'd hate--me?\"\n\"Mr. Fisker, that's nonsense. Why should I hate anybody?\"\n\"But you do. I've found out one or two that you don't love. If you do come to Frisco, I hope you won't just hate me, you know.\" Then he took her gently by the arm;--but she, whisking herself away rapidly, bade him behave himself. Then they returned to their lodgings, and Mr. Fisker, before he went back to London, mixed a little warm brandy-and-water for Madame Melmotte. I think that upon the whole Madame Melmotte was more comfortable at Hampstead than she had been either in Grosvenor Square or Bruton Street, although she was certainly not a thing beautiful to look at in her widow's weeds.\n\"I don't think much of you as a book-keeper, you know,\" Fisker said to Miles Grendall in the now almost deserted Board-room of the South Central Pacific and Mexican Railway. Miles, remembering his father's advice, answered not a word, but merely looked with assumed amazement at the impertinent stranger who dared thus to censure his performances. Fisker had made three or four remarks previous to this, and had appealed both to Paul Montague and to Croll, who were present. He had invited also the attendance of Sir Felix Carbury, Lord Nidderdale, and Mr. Longestaffe, who were all Directors;--but none of them had come. Sir Felix had paid no attention to Fisker's letter. Lord Nidderdale had written a short but characteristic reply. \"Dear Mr. Fisker,--I really don't know anything about it. Yours, Nidderdale.\" Mr. Longestaffe, with laborious zeal, had closely covered four pages with his reasons for non-attendance, with which the reader shall not be troubled, and which it may be doubted whether even Fisker perused to the end. \"Upon my word,\" continued Fisker, \"it's astonishing to me that Melmotte should have put up with this kind of thing. I suppose you understand something of business, Mr. Croll?\"\n\"It vas not my department, Mr. Fisker,\" said the German.\n\"Nor anybody else's either,\" said the domineering American. \"Of course it's on the cards, Mr. Grendall, that we shall have to put you into a witness-box, because there are certain things we must get at.\" Miles was silent as the grave, but at once made up his mind that he would pass his autumn at some pleasant but economical German retreat, and that his autumnal retirement should be commenced within a very few days;--or perhaps hours might suffice.\nBut Fisker was not in earnest in his threat. In truth the greater the confusion in the London office, the better, he thought, were the prospects of the Company at San Francisco. Miles underwent purgatory on this occasion for three or four hours, and when dismissed had certainly revealed none of Melmotte's secrets. He did, however, go to Germany, finding that a temporary absence from England would be comfortable to him in more respects than one,--and need not be heard of again in these pages.\nWhen Melmotte's affairs were ultimately wound up there was found to be nearly enough of property to satisfy all his proved liabilities. Very many men started up with huge claims, asserting that they had been robbed, and in the confusion it was hard to ascertain who had been robbed, or who had simply been unsuccessful in their attempts to rob others. Some, no doubt, as was the case with poor Mr. Brehgert, had speculated in dependence on Melmotte's sagacity, and had lost heavily without dishonesty. But of those who, like the Longestaffes, were able to prove direct debts, the condition at last was not very sad. Our excellent friend Dolly got his money early in the day, and was able, under Mr. Squercum's guidance, to start himself on a new career. Having paid his debts, and with still a large balance at his bankers', he assured his friend Nidderdale that he meant to turn over an entirely new leaf. \"I shall just make Squercum allow me so much a month, and I shall have all the bills and that kind of thing sent to him, and he will do everything, and pull me up if I'm getting wrong. I like Squercum.\"\n\"Won't he rob you, old fellow?\" suggested Nidderdale.\n\"Of course he will;--but he won't let any one else do it. One has to be plucked, but it's everything to have it done on a system. If he'll only let me have ten shillings out of every sovereign I think I can get along.\" Let us hope that Mr. Squercum was merciful, and that Dolly was enabled to live in accordance with his virtuous resolutions.\nBut these things did not arrange themselves till late in the winter,--long after Mr. Fisker's departure for California. That, however, was protracted till a day much later than he had anticipated before he had become intimate with Madame Melmotte and Marie. Madame Melmotte's affairs occupied him for a while almost exclusively. The furniture and plate were of course sold for the creditors, but Madame Melmotte was allowed to take whatever she declared to be specially her own property;--and, though much was said about the jewels, no attempt was made to recover them. Marie advised Madame Melmotte to give them up, assuring the old woman that she should have whatever she wanted for her maintenance. But it was not likely that Melmotte's widow would willingly abandon any property, and she did not abandon her jewels. It was agreed between her and Fisker that they were to be taken to New York. \"You'll get as much there as in London, if you like to part with them; and nobody 'll say anything about it there. You couldn't sell a locket or a chain here without all the world talking about it.\"\nIn all these things Madame Melmotte put herself into Fisker's hands with the most absolute confidence,--and, indeed, with a confidence that was justified by its results. It was not by robbing an old woman that Fisker intended to make himself great. To Madame Melmotte's thinking, Fisker was the finest gentleman she had ever met,--so infinitely pleasanter in his manner than Lord Alfred even when Lord Alfred had been most gracious, with so much more to say for himself than Miles Grendall, understanding her so much better than any man had ever done,--especially when he supplied her with those small warm beakers of sweet brandy-and-water. \"I shall do whatever he tells me,\" she said to Marie. \"I'm sure I've nothing to keep me here in this country.\"\n\"I'm willing to go,\" said Marie. \"I don't want to stay in London.\"\n\"I suppose you'll take him if he asks you?\"\n\"I don't know anything about that,\" said Marie. \"A man may be very well without one's wanting to marry him. I don't think I'll marry anybody. What's the use? It's only money. Nobody cares for anything else. Fisker's all very well; but he only wants the money. Do you think Fisker'd ask me to marry him if I hadn't got anything? Not he! He ain't slow enough for that.\"\n\"I think he's a very nice young man,\" said Madame Melmotte.",
        "paragraph_chars": [
            [
                0,
                1351
            ],
            [
                1351,
                1531
            ],
            [
                1531,
                1556
            ],
            [
                1556,
                1764
            ],
            [
                1764,
                1828
            ],
            [
                1828,
                2060
            ],
            [
                2060,
                2197
            ],
            [
                2197,
                2487
            ],
            [
                2487,
                2565
            ],
            [
                2565,
                2736
            ],
            [
                2736,
                2754
            ],
            [
                2754,
                3268
            ],
            [
                3268,
                4749
            ],
            [
                4749,
                4788
            ],
            [
                4788,
                4924
            ],
            [
                4924,
                4961
            ],
            [
                4961,
                5036
            ],
            [
                5036,
                5060
            ],
            [
                5060,
                5419
            ],
            [
                5419,
                5474
            ],
            [
                5474,
                5790
            ],
            [
                5790,
                7001
            ],
            [
                7001,
                7974
            ],
            [
                7974,
                8999
            ],
            [
                8999,
                10448
            ],
            [
                10448,
                11464
            ],
            [
                11464,
                11596
            ],
            [
                11596,
                11750
            ],
            [
                11750,
                11793
            ],
            [
                11793,
                11998
            ],
            [
                11998,
                12017
            ],
            [
                12017,
                12455
            ],
            [
                12455,
                12509
            ],
            [
                12509,
                12523
            ],
            [
                12523,
                12732
            ],
            [
                12732,
                12746
            ],
            [
                12746,
                12761
            ],
            [
                12761,
                12799
            ],
            [
                12799,
                12851
            ],
            [
                12851,
                12912
            ],
            [
                12912,
                12970
            ],
            [
                12970,
                13566
            ],
            [
                13566,
                14775
            ],
            [
                14775,
                14832
            ],
            [
                14832,
                15284
            ],
            [
                15284,
                15781
            ],
            [
                15781,
                16891
            ],
            [
                16891,
                16945
            ],
            [
                16945,
                17288
            ],
            [
                17288,
                18384
            ],
            [
                18384,
                19137
            ],
            [
                19137,
                19204
            ],
            [
                19204,
                19248
            ],
            [
                19248,
                19616
            ],
            [
                19616,
                19675
            ]
        ],
        "segment_chars": [
            [
                0,
                319
            ],
            [
                319,
                412
            ],
            [
                412,
                529
            ],
            [
                529,
                776
            ],
            [
                776,
                950
            ],
            [
                950,
                1122
            ],
            [
                1122,
                1190
            ],
            [
                1190,
                1351
            ],
            [
                1351,
                1463
            ],
            [
                1463,
                1531
            ],
            [
                1531,
                1556
            ],
            [
                1556,
                1659
            ],
            [
                1659,
                1764
            ],
            [
                1764,
                1828
            ],
            [
                1828,
                1904
            ],
            [
                1904,
                2012
            ],
            [
                2012,
                2060
            ],
            [
                2060,
                2119
            ],
            [
                2119,
                2197
            ],
            [
                2197,
                2255
            ],
            [
                2255,
                2366
            ],
            [
                2366,
                2418
            ],
            [
                2418,
                2487
            ],
            [
                2487,
                2565
            ],
            [
                2565,
                2586
            ],
            [
                2586,
                2604
            ],
            [
                2604,
                2631
            ],
            [
                2631,
                2736
            ],
            [
                2736,
                2754
            ],
            [
                2754,
                2773
            ],
            [
                2773,
                2798
            ],
            [
                2798,
                2875
            ],
            [
                2875,
                2925
            ],
            [
                2925,
                2961
            ],
            [
                2961,
                3076
            ],
            [
                3076,
                3086
            ],
            [
                3086,
                3202
            ],
            [
                3202,
                3268
            ],
            [
                3268,
                3538
            ],
            [
                3538,
                3617
            ],
            [
                3617,
                3924
            ],
            [
                3924,
                4021
            ],
            [
                4021,
                4260
            ],
            [
                4260,
                4316
            ],
            [
                4316,
                4390
            ],
            [
                4390,
                4460
            ],
            [
                4460,
                4615
            ],
            [
                4615,
                4697
            ],
            [
                4697,
                4735
            ],
            [
                4735,
                4749
            ],
            [
                4749,
                4770
            ],
            [
                4770,
                4788
            ],
            [
                4788,
                4881
            ],
            [
                4881,
                4924
            ],
            [
                4924,
                4946
            ],
            [
                4946,
                4961
            ],
            [
                4961,
                4992
            ],
            [
                4992,
                5036
            ],
            [
                5036,
                5060
            ],
            [
                5060,
                5166
            ],
            [
                5166,
                5307
            ],
            [
                5307,
                5419
            ],
            [
                5419,
                5474
            ],
            [
                5474,
                5525
            ],
            [
                5525,
                5683
            ],
            [
                5683,
                5790
            ],
            [
                5790,
                5955
            ],
            [
                5955,
                6277
            ],
            [
                6277,
                6446
            ],
            [
                6446,
                6502
            ],
            [
                6502,
                6593
            ],
            [
                6593,
                6681
            ],
            [
                6681,
                6799
            ],
            [
                6799,
                6935
            ],
            [
                6935,
                7001
            ],
            [
                7001,
                7112
            ],
            [
                7112,
                7213
            ],
            [
                7213,
                7348
            ],
            [
                7348,
                7420
            ],
            [
                7420,
                7690
            ],
            [
                7690,
                7974
            ],
            [
                7974,
                8353
            ],
            [
                8353,
                8401
            ],
            [
                8401,
                8579
            ],
            [
                8579,
                8721
            ],
            [
                8721,
                8832
            ],
            [
                8832,
                8888
            ],
            [
                8888,
                8999
            ],
            [
                8999,
                9089
            ],
            [
                9089,
                9211
            ],
            [
                9211,
                9459
            ],
            [
                9459,
                9665
            ],
            [
                9665,
                9751
            ],
            [
                9751,
                9824
            ],
            [
                9824,
                10018
            ],
            [
                10018,
                10448
            ],
            [
                10448,
                10658
            ],
            [
                10658,
                10722
            ],
            [
                10722,
                10792
            ],
            [
                10792,
                10877
            ],
            [
                10877,
                10989
            ],
            [
                10989,
                11255
            ],
            [
                11255,
                11373
            ],
            [
                11373,
                11464
            ],
            [
                11464,
                11596
            ],
            [
                11596,
                11750
            ],
            [
                11750,
                11793
            ],
            [
                11793,
                11817
            ],
            [
                11817,
                11888
            ],
            [
                11888,
                11943
            ],
            [
                11943,
                11998
            ],
            [
                11998,
                12017
            ],
            [
                12017,
                12121
            ],
            [
                12121,
                12156
            ],
            [
                12156,
                12245
            ],
            [
                12245,
                12455
            ],
            [
                12455,
                12509
            ],
            [
                12509,
                12523
            ],
            [
                12523,
                12537
            ],
            [
                12537,
                12560
            ],
            [
                12560,
                12640
            ],
            [
                12640,
                12716
            ],
            [
                12716,
                12732
            ],
            [
                12732,
                12746
            ],
            [
                12746,
                12761
            ],
            [
                12761,
                12799
            ],
            [
                12799,
                12851
            ],
            [
                12851,
                12874
            ],
            [
                12874,
                12912
            ],
            [
                12912,
                12942
            ],
            [
                12942,
                12970
            ],
            [
                12970,
                12983
            ],
            [
                12983,
                13030
            ],
            [
                13030,
                13098
            ],
            [
                13098,
                13200
            ],
            [
                13200,
                13343
            ],
            [
                13343,
                13566
            ],
            [
                13566,
                13740
            ],
            [
                13740,
                13914
            ],
            [
                13914,
                14041
            ],
            [
                14041,
                14188
            ],
            [
                14188,
                14240
            ],
            [
                14240,
                14302
            ],
            [
                14302,
                14360
            ],
            [
                14360,
                14380
            ],
            [
                14380,
                14599
            ],
            [
                14599,
                14715
            ],
            [
                14715,
                14775
            ],
            [
                14775,
                14832
            ],
            [
                14832,
                14892
            ],
            [
                14892,
                15036
            ],
            [
                15036,
                15284
            ],
            [
                15284,
                15329
            ],
            [
                15329,
                15462
            ],
            [
                15462,
                15600
            ],
            [
                15600,
                15781
            ],
            [
                15781,
                15917
            ],
            [
                15917,
                16133
            ],
            [
                16133,
                16283
            ],
            [
                16283,
                16397
            ],
            [
                16397,
                16535
            ],
            [
                16535,
                16688
            ],
            [
                16688,
                16873
            ],
            [
                16873,
                16891
            ],
            [
                16891,
                16923
            ],
            [
                16923,
                16945
            ],
            [
                16945,
                17003
            ],
            [
                17003,
                17075
            ],
            [
                17075,
                17164
            ],
            [
                17164,
                17288
            ],
            [
                17288,
                17408
            ],
            [
                17408,
                17546
            ],
            [
                17546,
                17617
            ],
            [
                17617,
                17858
            ],
            [
                17858,
                17990
            ],
            [
                17990,
                18108
            ],
            [
                18108,
                18185
            ],
            [
                18185,
                18300
            ],
            [
                18300,
                18384
            ],
            [
                18384,
                18554
            ],
            [
                18554,
                18633
            ],
            [
                18633,
                19026
            ],
            [
                19026,
                19080
            ],
            [
                19080,
                19137
            ],
            [
                19137,
                19170
            ],
            [
                19170,
                19204
            ],
            [
                19204,
                19248
            ],
            [
                19248,
                19296
            ],
            [
                19296,
                19356
            ],
            [
                19356,
                19390
            ],
            [
                19390,
                19406
            ],
            [
                19406,
                19423
            ],
            [
                19423,
                19455
            ],
            [
                19455,
                19508
            ],
            [
                19508,
                19576
            ],
            [
                19576,
                19584
            ],
            [
                19584,
                19616
            ],
            [
                19616,
                19675
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                69,
                138
            ],
            [
                142,
                173
            ],
            [
                176,
                212
            ],
            [
                231,
                240
            ],
            [
                317,
                319
            ],
            [
                319,
                412
            ],
            [
                442,
                444
            ],
            [
                412,
                420
            ],
            [
                476,
                484
            ],
            [
                493,
                529
            ],
            [
                529,
                539
            ],
            [
                587,
                588
            ],
            [
                552,
                575
            ],
            [
                745,
                751
            ],
            [
                682,
                691
            ],
            [
                608,
                614
            ],
            [
                649,
                664
            ],
            [
                692,
                702
            ],
            [
                664,
                665
            ],
            [
                738,
                744
            ],
            [
                752,
                759
            ],
            [
                765,
                775
            ],
            [
                776,
                778
            ],
            [
                790,
                791
            ],
            [
                832,
                843
            ],
            [
                849,
                861
            ],
            [
                901,
                948
            ],
            [
                861,
                870
            ],
            [
                877,
                901
            ],
            [
                948,
                950
            ],
            [
                950,
                956
            ],
            [
                967,
                1009
            ],
            [
                1120,
                1122
            ],
            [
                1122,
                1190
            ],
            [
                1190,
                1258
            ],
            [
                1349,
                1351
            ],
            [
                1351,
                1427
            ],
            [
                1461,
                1463
            ],
            [
                1463,
                1531
            ],
            [
                1531,
                1556
            ],
            [
                1659,
                1730
            ],
            [
                1736,
                1764
            ],
            [
                1764,
                1828
            ],
            [
                1828,
                1832
            ],
            [
                1834,
                1852
            ],
            [
                1873,
                1904
            ],
            [
                1904,
                1951
            ],
            [
                2010,
                2012
            ],
            [
                2012,
                2060
            ],
            [
                2060,
                2061
            ],
            [
                2093,
                2119
            ],
            [
                2119,
                2148
            ],
            [
                2160,
                2178
            ],
            [
                2187,
                2197
            ],
            [
                2197,
                2207
            ],
            [
                2212,
                2240
            ],
            [
                2253,
                2255
            ],
            [
                2418,
                2487
            ],
            [
                2487,
                2565
            ],
            [
                2586,
                2604
            ],
            [
                2604,
                2620
            ],
            [
                2629,
                2631
            ],
            [
                2798,
                2832
            ],
            [
                2873,
                2875
            ],
            [
                2875,
                2925
            ],
            [
                2925,
                2961
            ],
            [
                3086,
                3103
            ],
            [
                3139,
                3140
            ],
            [
                3142,
                3160
            ],
            [
                3165,
                3202
            ],
            [
                3202,
                3268
            ],
            [
                3286,
                3299
            ],
            [
                3317,
                3359
            ],
            [
                3421,
                3480
            ],
            [
                3504,
                3508
            ],
            [
                3518,
                3537
            ],
            [
                3538,
                3591
            ],
            [
                3615,
                3617
            ],
            [
                3828,
                3834
            ],
            [
                3841,
                3899
            ],
            [
                3922,
                3924
            ],
            [
                3924,
                3930
            ],
            [
                3973,
                4021
            ],
            [
                4464,
                4491
            ],
            [
                4541,
                4615
            ],
            [
                4697,
                4701
            ],
            [
                4706,
                4735
            ],
            [
                4747,
                4749
            ],
            [
                4749,
                4770
            ],
            [
                4770,
                4788
            ],
            [
                4788,
                4789
            ],
            [
                4792,
                4803
            ],
            [
                4821,
                4879
            ],
            [
                4889,
                4913
            ],
            [
                4921,
                4924
            ],
            [
                4924,
                4946
            ],
            [
                4946,
                4961
            ],
            [
                4961,
                4966
            ],
            [
                4969,
                4971
            ],
            [
                4990,
                4992
            ],
            [
                4992,
                5036
            ],
            [
                5036,
                5060
            ],
            [
                5060,
                5166
            ],
            [
                5166,
                5198
            ],
            [
                5206,
                5217
            ],
            [
                5261,
                5307
            ],
            [
                5347,
                5419
            ],
            [
                5419,
                5452
            ],
            [
                5471,
                5474
            ],
            [
                5474,
                5484
            ],
            [
                5487,
                5511
            ],
            [
                5513,
                5525
            ],
            [
                5525,
                5530
            ],
            [
                5536,
                5552
            ],
            [
                5630,
                5661
            ],
            [
                5667,
                5682
            ],
            [
                5790,
                5822
            ],
            [
                5849,
                5955
            ],
            [
                5955,
                5957
            ],
            [
                6089,
                6091
            ],
            [
                5994,
                6055
            ],
            [
                6111,
                6277
            ],
            [
                6465,
                6476
            ],
            [
                6563,
                6566
            ],
            [
                6458,
                6464
            ],
            [
                6692,
                6693
            ],
            [
                6757,
                6760
            ],
            [
                6764,
                6798
            ],
            [
                6799,
                6800
            ],
            [
                6802,
                6808
            ],
            [
                6814,
                6825
            ],
            [
                6836,
                6853
            ],
            [
                6860,
                6899
            ],
            [
                6919,
                6935
            ],
            [
                6935,
                6952
            ],
            [
                6974,
                7001
            ],
            [
                7001,
                7049
            ],
            [
                7070,
                7112
            ],
            [
                7132,
                7213
            ],
            [
                7213,
                7254
            ],
            [
                7257,
                7262
            ],
            [
                7322,
                7348
            ],
            [
                7348,
                7383
            ],
            [
                7418,
                7420
            ],
            [
                7690,
                7742
            ],
            [
                7770,
                7813
            ],
            [
                7815,
                7933
            ],
            [
                7944,
                7974
            ],
            [
                8357,
                8370
            ],
            [
                8026,
                8034
            ],
            [
                7984,
                7986
            ],
            [
                8375,
                8394
            ],
            [
                7987,
                7997
            ],
            [
                8399,
                8401
            ],
            [
                8401,
                8419
            ],
            [
                8484,
                8516
            ],
            [
                8519,
                8525
            ],
            [
                8541,
                8579
            ],
            [
                8579,
                8582
            ],
            [
                8591,
                8631
            ],
            [
                8663,
                8721
            ],
            [
                8888,
                8910
            ],
            [
                8997,
                8999
            ],
            [
                8999,
                9066
            ],
            [
                9074,
                9089
            ],
            [
                9722,
                9725
            ],
            [
                9685,
                9688
            ],
            [
                9697,
                9713
            ],
            [
                9665,
                9668
            ],
            [
                9764,
                9792
            ],
            [
                9800,
                9824
            ],
            [
                9824,
                9875
            ],
            [
                9881,
                9884
            ],
            [
                9979,
                10018
            ],
            [
                10018,
                10051
            ],
            [
                10121,
                10138
            ],
            [
                10231,
                10243
            ],
            [
                10201,
                10230
            ],
            [
                10247,
                10273
            ],
            [
                10278,
                10315
            ],
            [
                10320,
                10403
            ],
            [
                10414,
                10448
            ],
            [
                10448,
                10546
            ],
            [
                10656,
                10658
            ],
            [
                10658,
                10667
            ],
            [
                10681,
                10722
            ],
            [
                10722,
                10744
            ],
            [
                10746,
                10792
            ],
            [
                10792,
                10804
            ],
            [
                10815,
                10877
            ],
            [
                11043,
                11062
            ],
            [
                11007,
                11011
            ],
            [
                10995,
                10999
            ],
            [
                11142,
                11145
            ],
            [
                11001,
                11005
            ],
            [
                11062,
                11086
            ],
            [
                11165,
                11200
            ],
            [
                11202,
                11208
            ],
            [
                11239,
                11246
            ],
            [
                11209,
                11228
            ],
            [
                11253,
                11255
            ],
            [
                11255,
                11317
            ],
            [
                11338,
                11354
            ],
            [
                11366,
                11373
            ],
            [
                11373,
                11376
            ],
            [
                11413,
                11464
            ],
            [
                11464,
                11596
            ],
            [
                11596,
                11633
            ],
            [
                11688,
                11750
            ],
            [
                11750,
                11793
            ],
            [
                11793,
                11817
            ],
            [
                11817,
                11844
            ],
            [
                11849,
                11888
            ],
            [
                11943,
                11998
            ],
            [
                11998,
                12017
            ],
            [
                12017,
                12121
            ],
            [
                12121,
                12154
            ],
            [
                12455,
                12508
            ],
            [
                12560,
                12596
            ],
            [
                12638,
                12640
            ],
            [
                12640,
                12716
            ],
            [
                12716,
                12732
            ],
            [
                12732,
                12743
            ],
            [
                12762,
                12799
            ],
            [
                12799,
                12801
            ],
            [
                12809,
                12851
            ],
            [
                12851,
                12874
            ],
            [
                12874,
                12905
            ],
            [
                12907,
                12912
            ],
            [
                12912,
                12942
            ],
            [
                12942,
                12970
            ],
            [
                13030,
                13036
            ],
            [
                13040,
                13072
            ],
            [
                13078,
                13098
            ],
            [
                13103,
                13133
            ],
            [
                13135,
                13142
            ],
            [
                13175,
                13200
            ],
            [
                13200,
                13236
            ],
            [
                13244,
                13245
            ],
            [
                13566,
                13588
            ],
            [
                13598,
                13603
            ],
            [
                13619,
                13658
            ],
            [
                13670,
                13696
            ],
            [
                13723,
                13740
            ],
            [
                13740,
                13869
            ],
            [
                13912,
                13913
            ],
            [
                13914,
                13951
            ],
            [
                13964,
                13986
            ],
            [
                13992,
                14012
            ],
            [
                14016,
                14041
            ],
            [
                14041,
                14047
            ],
            [
                14056,
                14060
            ],
            [
                14048,
                14055
            ],
            [
                14079,
                14135
            ],
            [
                14149,
                14159
            ],
            [
                14161,
                14187
            ],
            [
                14599,
                14650
            ],
            [
                14657,
                14715
            ],
            [
                14715,
                14775
            ],
            [
                14775,
                14832
            ],
            [
                14832,
                14869
            ],
            [
                14882,
                14892
            ],
            [
                14892,
                15036
            ],
            [
                15036,
                15182
            ],
            [
                15196,
                15213
            ],
            [
                15227,
                15250
            ],
            [
                15252,
                15268
            ],
            [
                15282,
                15284
            ],
            [
                15284,
                15313
            ],
            [
                15327,
                15329
            ],
            [
                15338,
                15385
            ],
            [
                15398,
                15409
            ],
            [
                15386,
                15396
            ],
            [
                15410,
                15461
            ],
            [
                15781,
                15865
            ],
            [
                15869,
                15880
            ],
            [
                15889,
                15896
            ],
            [
                15915,
                15917
            ],
            [
                16018,
                16032
            ],
            [
                16043,
                16133
            ],
            [
                16133,
                16138
            ],
            [
                16170,
                16192
            ],
            [
                16250,
                16283
            ],
            [
                16283,
                16286
            ],
            [
                16290,
                16342
            ],
            [
                16350,
                16356
            ],
            [
                16395,
                16397
            ],
            [
                16424,
                16437
            ],
            [
                16454,
                16459
            ],
            [
                16609,
                16665
            ],
            [
                16521,
                16522
            ],
            [
                16678,
                16687
            ],
            [
                16688,
                16772
            ],
            [
                16796,
                16873
            ],
            [
                16873,
                16891
            ],
            [
                16891,
                16923
            ],
            [
                16923,
                16945
            ],
            [
                16945,
                16964
            ],
            [
                16966,
                16982
            ],
            [
                16991,
                17001
            ],
            [
                17288,
                17336
            ],
            [
                17358,
                17408
            ],
            [
                17408,
                17412
            ],
            [
                17423,
                17426
            ],
            [
                17591,
                17596
            ],
            [
                17546,
                17584
            ],
            [
                17615,
                17617
            ],
            [
                17617,
                17645
            ],
            [
                17656,
                17660
            ],
            [
                17678,
                17747
            ],
            [
                17758,
                17775
            ],
            [
                17777,
                17780
            ],
            [
                17821,
                17851
            ],
            [
                17809,
                17819
            ],
            [
                17856,
                17858
            ],
            [
                18108,
                18121
            ],
            [
                18138,
                18185
            ],
            [
                18185,
                18204
            ],
            [
                18205,
                18254
            ],
            [
                18298,
                18299
            ],
            [
                18384,
                18386
            ],
            [
                18404,
                18456
            ],
            [
                18466,
                18485
            ],
            [
                18488,
                18491
            ],
            [
                18508,
                18518
            ],
            [
                18524,
                18537
            ],
            [
                18552,
                18554
            ],
            [
                18554,
                18633
            ],
            [
                18636,
                18651
            ],
            [
                18953,
                18955
            ],
            [
                18671,
                18712
            ],
            [
                19024,
                19025
            ],
            [
                19026,
                19080
            ],
            [
                19080,
                19113
            ],
            [
                19119,
                19137
            ],
            [
                19137,
                19170
            ],
            [
                19170,
                19204
            ],
            [
                19204,
                19221
            ],
            [
                19227,
                19248
            ],
            [
                19248,
                19261
            ],
            [
                19271,
                19296
            ],
            [
                19356,
                19390
            ],
            [
                19390,
                19406
            ],
            [
                19406,
                19423
            ],
            [
                19423,
                19455
            ],
            [
                19455,
                19506
            ],
            [
                19616,
                19675
            ]
        ],
        "row_chars": [
            [
                0,
                319
            ],
            [
                319,
                412
            ],
            [
                412,
                529
            ],
            [
                529,
                776
            ],
            [
                776,
                950
            ],
            [
                950,
                1122
            ],
            [
                1122,
                1190
            ],
            [
                1190,
                1351
            ],
            [
                1351,
                1463
            ],
            [
                1463,
                1531
            ],
            [
                1531,
                1556
            ],
            [
                1556,
                1659
            ],
            [
                1659,
                1764
            ],
            [
                1764,
                1828
            ],
            [
                1828,
                1904
            ],
            [
                1904,
                2012
            ],
            [
                2012,
                2060
            ],
            [
                2060,
                2119
            ],
            [
                2119,
                2197
            ],
            [
                2197,
                2255
            ],
            [
                2255,
                2366
            ],
            [
                2366,
                2418
            ],
            [
                2418,
                2487
            ],
            [
                2487,
                2565
            ],
            [
                2565,
                2586
            ],
            [
                2586,
                2604
            ],
            [
                2604,
                2631
            ],
            [
                2631,
                2736
            ],
            [
                2736,
                2754
            ],
            [
                2754,
                2773
            ],
            [
                2773,
                2798
            ],
            [
                2798,
                2875
            ],
            [
                2875,
                2925
            ],
            [
                2925,
                2961
            ],
            [
                2961,
                3076
            ],
            [
                3076,
                3086
            ],
            [
                3086,
                3202
            ],
            [
                3202,
                3268
            ],
            [
                3268,
                3538
            ],
            [
                3538,
                3617
            ],
            [
                3617,
                3924
            ],
            [
                3924,
                4021
            ],
            [
                4021,
                4260
            ],
            [
                4260,
                4316
            ],
            [
                4316,
                4390
            ],
            [
                4390,
                4460
            ],
            [
                4460,
                4615
            ],
            [
                4615,
                4697
            ],
            [
                4697,
                4735
            ],
            [
                4735,
                4749
            ],
            [
                4749,
                4770
            ],
            [
                4770,
                4788
            ],
            [
                4788,
                4924
            ],
            [
                4924,
                4946
            ],
            [
                4946,
                4961
            ],
            [
                4961,
                4992
            ],
            [
                4992,
                5036
            ],
            [
                5036,
                5060
            ],
            [
                5060,
                5166
            ],
            [
                5166,
                5307
            ],
            [
                5307,
                5419
            ],
            [
                5419,
                5474
            ],
            [
                5474,
                5525
            ],
            [
                5525,
                5683
            ],
            [
                5683,
                5790
            ],
            [
                5790,
                5955
            ],
            [
                5955,
                6277
            ],
            [
                6277,
                6446
            ],
            [
                6446,
                6799
            ],
            [
                6799,
                6935
            ],
            [
                6935,
                7001
            ],
            [
                7001,
                7112
            ],
            [
                7112,
                7213
            ],
            [
                7213,
                7348
            ],
            [
                7348,
                7420
            ],
            [
                7420,
                7690
            ],
            [
                7690,
                7974
            ],
            [
                7974,
                8401
            ],
            [
                8401,
                8579
            ],
            [
                8579,
                8721
            ],
            [
                8721,
                8832
            ],
            [
                8832,
                8888
            ],
            [
                8888,
                8999
            ],
            [
                8999,
                9089
            ],
            [
                9089,
                9211
            ],
            [
                9211,
                9459
            ],
            [
                9459,
                9665
            ],
            [
                9665,
                9824
            ],
            [
                9824,
                10018
            ],
            [
                10018,
                10448
            ],
            [
                10448,
                10658
            ],
            [
                10658,
                10722
            ],
            [
                10722,
                10792
            ],
            [
                10792,
                10877
            ],
            [
                10877,
                10989
            ],
            [
                10989,
                11255
            ],
            [
                11255,
                11373
            ],
            [
                11373,
                11464
            ],
            [
                11464,
                11596
            ],
            [
                11596,
                11750
            ],
            [
                11750,
                11793
            ],
            [
                11793,
                11817
            ],
            [
                11817,
                11888
            ],
            [
                11888,
                11943
            ],
            [
                11943,
                11998
            ],
            [
                11998,
                12017
            ],
            [
                12017,
                12121
            ],
            [
                12121,
                12156
            ],
            [
                12156,
                12245
            ],
            [
                12245,
                12455
            ],
            [
                12455,
                12509
            ],
            [
                12509,
                12523
            ],
            [
                12523,
                12537
            ],
            [
                12537,
                12560
            ],
            [
                12560,
                12640
            ],
            [
                12640,
                12716
            ],
            [
                12716,
                12732
            ],
            [
                12732,
                12746
            ],
            [
                12746,
                12761
            ],
            [
                12761,
                12799
            ],
            [
                12799,
                12851
            ],
            [
                12851,
                12874
            ],
            [
                12874,
                12912
            ],
            [
                12912,
                12942
            ],
            [
                12942,
                12970
            ],
            [
                12970,
                12983
            ],
            [
                12983,
                13030
            ],
            [
                13030,
                13098
            ],
            [
                13098,
                13200
            ],
            [
                13200,
                13343
            ],
            [
                13343,
                13566
            ],
            [
                13566,
                13740
            ],
            [
                13740,
                13914
            ],
            [
                13914,
                14041
            ],
            [
                14041,
                14188
            ],
            [
                14188,
                14240
            ],
            [
                14240,
                14302
            ],
            [
                14302,
                14360
            ],
            [
                14360,
                14380
            ],
            [
                14380,
                14599
            ],
            [
                14599,
                14715
            ],
            [
                14715,
                14775
            ],
            [
                14775,
                14832
            ],
            [
                14832,
                14892
            ],
            [
                14892,
                15036
            ],
            [
                15036,
                15284
            ],
            [
                15284,
                15329
            ],
            [
                15329,
                15462
            ],
            [
                15462,
                15600
            ],
            [
                15600,
                15781
            ],
            [
                15781,
                15917
            ],
            [
                15917,
                16133
            ],
            [
                16133,
                16283
            ],
            [
                16283,
                16397
            ],
            [
                16397,
                16688
            ],
            [
                16688,
                16873
            ],
            [
                16873,
                16891
            ],
            [
                16891,
                16923
            ],
            [
                16923,
                16945
            ],
            [
                16945,
                17003
            ],
            [
                17003,
                17075
            ],
            [
                17075,
                17164
            ],
            [
                17164,
                17288
            ],
            [
                17288,
                17408
            ],
            [
                17408,
                17617
            ],
            [
                17617,
                17858
            ],
            [
                17858,
                17990
            ],
            [
                17990,
                18108
            ],
            [
                18108,
                18185
            ],
            [
                18185,
                18300
            ],
            [
                18300,
                18384
            ],
            [
                18384,
                18554
            ],
            [
                18554,
                18633
            ],
            [
                18633,
                19026
            ],
            [
                19026,
                19080
            ],
            [
                19080,
                19137
            ],
            [
                19137,
                19170
            ],
            [
                19170,
                19204
            ],
            [
                19204,
                19248
            ],
            [
                19248,
                19296
            ],
            [
                19296,
                19356
            ],
            [
                19356,
                19390
            ],
            [
                19390,
                19406
            ],
            [
                19406,
                19423
            ],
            [
                19423,
                19455
            ],
            [
                19455,
                19508
            ],
            [
                19508,
                19576
            ],
            [
                19576,
                19584
            ],
            [
                19584,
                19616
            ],
            [
                19616,
                19675
            ]
        ]
    },
    "abridged": {
        "text": "Ten days had passed since the meeting narrated in the last chapter - ten days, during which Hetta's letter had been sent to her lover, but to which she had received no reply - when two gentlemen met each other in Liverpool. These were our young friend Paul Montague, and our not much older friend Hamilton K. Fisker. News of Melmotte's death had been sent by telegraph to San Francisco. Some weeks earlier, Montague had written to Fisker about the condition of the Railway Company in England, urging him to come to London.\nOn receiving a reply he had gone to Liverpool, taking counsel with his friend Mr. Ramsbottom, and had awaited Fisker's arrival. In the meantime Hetta's letter was lying at the Beargarden. Just at this moment things at the Beargarden were not well managed. They were indeed so ill managed that Paul never received that letter.\n\"This is a terrible business,\" said Fisker, immediately on entering the room. \"He was the last man I'd have thought would be cut up in that way.\"\n\"He was utterly ruined.\"\n\"The South Central would have pulled him through a'most anything if he'd understood how to play it.\"\n\"We don't think much of the South Central here now,\" said Paul.\n\"Ah; that's because you don't have spirit enough for a big thing. You nibble at it instead of swallowing it whole. I thought that Melmotte would have had spirit.\"\n\"He had committed forgery. It was the dread of detection which drove him to kill himself.\"\n\"I call it damn clumsy from beginning to end. Only think of Melmotte allowing Cohenlupe to get the better of him!\"\n\"I suppose the thing will be broken up now at San Francisco,\" suggested Paul.\n\"Not if I know it. Why should it be? I'll tell you what I'm going to do. These shares are at a'most nothing now in London. I'll buy every share in the market. I'm sorry for him; but what he's done'll just be the making of us over there. Will you get out of it, or will you come back to Frisco with me?\"\nPaul asserted that he would not return to San Francisco, that he was altogether sick of the great railway, and would have nothing more to do with it.\nFisker shrugged his shoulders, and was not displeased. He had convinced himself that Paul Montague was not a fit partner. Fisker had a thorough contempt for scruples in others. The work of robbing mankind was not only the duty, but also the delight and the ambition of his life. \"And what about Winifrid Hurtle?\" he asked.\n\"What makes you ask? She's in London.\"\n\"Yes, I know; and Hurtle's at Frisco, swearing that he'll come after her, only he hasn't got the money.\"\n\"He's not dead then?\" muttered Paul.\n\"Dead! no. She'll have a bad time of it with him yet.\"\n\"But she divorced him.\"\n\"She got a Kansas lawyer to say so, and he's got a Frisco lawyer to say that there's nothing of the kind. She hasn't played her game badly, for she's put it so that he can't get hold of a dollar. But I wouldn't marry her myself till I saw my way clearer out of the wood.\"\n\"I'm not thinking of marrying her.\"\n\"There was talk about it in Frisco; that's all. And I heard Hurtle say that he meant to drop in on you one of these days.\"\nOn the following day the two men went together to London, and Fisker immediately became immersed in the arrangement of Melmotte's affairs. He talked to Mr. Brehgert, went in and out of the offices in Abchurch Lane, cross-examined Croll, mastered the books of the Company as far as they were to be mastered, and actually summoned both the Grendalls, father and son, up to London. Lord Alfred ignored the appeal, but advised his son to run up to town.\n\"You should go, because you took a salary from the Company,\" said the careful father, \"but don't say a word.\" So Miles Grendall reappeared upon the scene.\nBut Fisker's attention was perhaps most usefully paid to Madame Melmotte and her daughter. No one had visited them in their solitude at Hampstead, except Croll, the clerk. Mr. Brehgert had abstained, thinking that the widow would prefer to be alone. Lord Nidderdale had made his adieux. But Fisker had not been two days in London before he was admitted to Madame Melmotte's presence; and he had not been there four days before he was aware that in spite of all misfortunes, Marie Melmotte was still the possessor of a large fortune.\nMarie's money had been found to be quite distinct from Melmotte's. She had been right in refusing to sign those papers - unless that refusal led to her father's act. She was sure that it was not so, because she had offered to sign the papers before her father's death. But the money was now hers.\nPoor Madame Melmotte felt the visits of the American to be a relief in her misery. She was not crushed by grief, but numbed by the suddenness and awe of the catastrophe. The man who had been her merciless tyrant for years had proved powerless against his own misfortunes. She was a woman of very few words; but when Fisker spoke to her of her husband's affairs, and her future life, and mixed her a small glass of brandy-and-water, and told her that Frisco would be the fittest place for her future residence, she did not find him to be intrusive.\nAnd even Marie liked Fisker, though she had been wooed and almost won both by a lord and a baronet. There was real sorrow in her heart for her father. She was prone to love, though, perhaps, not prone to deep affection. Melmotte had been often cruel to her, but he had also been very indulgent. She had never known real tenderness and care, and had come to regard a blow one day and a jewel the next as the natural condition of things. When her father was dead she remembered for a while the jewels, and forgot the blows. But she also found consolation in Mr. Fisker's visits.\n\"I used to sign a paper every quarter,\" she said to Fisker, as they were walking together one evening in the lanes round Hampstead.\n\"You'll have to do the same now, only leave it in a banker's hands to draw the money for yourself.\"\n\"And can that be done over in California?\"\n\"Just the same as here. Your bankers will manage it for you without the slightest trouble. There's only one thing against it all, Miss Melmotte.\"\n\"And what's that?\"\n\"After the sort of society you've been used to here, I don't know how you'll get on among us Americans. We're a pretty rough lot, I guess.\"\n\"I hate swells,\" said Marie, flashing round upon him. \"They never mean a word that they say. They're never more than half awake, and don't care the least about anybody. I hate London.\"\n\"Do you now? I wonder whether you'd hate Frisco?\"\n\"I think it would be a jolly sort of place.\"\n\"Very jolly I find it. And I wonder whether you'd hate - me?\"\n\"Mr. Fisker, that's nonsense. Why should I hate anybody?\"\n\"But if you come to Frisco, I hope you won't hate me, you know.\" He took her gently by the arm; but she bade him behave himself. Then they returned to their lodgings.\n\"I don't think much of your book-keeping,\" Fisker said to Miles Grendall in the deserted Board-room of the Mexican Railway. Miles, remembering his father's advice, answered not a word, but merely looked with assumed amazement at the impertinent stranger.\nFisker had made three or four remarks before this, and had appealed to Paul Montague and Croll, who were present. He had also invited Sir Felix Carbury, Lord Nidderdale, and Mr. Longestaffe, as Directors; but none of them had come.\n\"Upon my word,\" continued Fisker, \"it's astonishing that Melmotte should have put up with this kind of thing. I suppose you understand something of business, Mr. Croll?\"\n\"It vas not my department, Mr. Fisker,\" said the German.\n\"Nor anybody else's either,\" said the American. \"Of course it's on the cards, Mr. Grendall, that we shall have to put you into a witness-box, because there are certain things we must get at.\" Miles was silent as the grave, but at once made up his mind that he would pass his autumn at some pleasant but economical German retreat, and that this retirement should begin within a very few days; or perhaps hours.\nBut Fisker was not in earnest. The greater the confusion in the London office, he thought, the better were the prospects of the Company at San Francisco.\nWhen Melmotte's affairs were ultimately wound up there was found to be nearly enough property to pay all his debts. It was hard to work out who had been robbed, or who had simply been unsuccessful in their attempts to rob others. Some, like poor Mr. Brehgert, had lost heavily without dishonesty. But those who, like the Longestaffes, were able to prove debts, were better off. Dolly got his money, and assured his friend Nidderdale that he meant to turn over a new leaf.\n\"I shall just make Squercum allow me so much a month, and I shall have all the bills sent to him, and he will do everything, and pull me up if I'm getting wrong. I like Squercum.\"\n\"Won't he rob you, old fellow?\" suggested Nidderdale.\n\"Of course he will; but he won't let anyone else do it.\"\nBut these things did not arrange themselves till long after Mr. Fisker's departure for California. That was delayed while Madame Melmotte's affairs occupied him. The furniture and plate were sold, but Madame Melmotte was allowed to take whatever she declared to be her own property; and no attempt was made to recover the jewels. It was agreed with Fisker that they were to be taken to New York. \"You'll get as much for them there as in London, if you like to part with them,\" he told her.\nIn fact Madame Melmotte put herself into Fisker's hands with absolute confidence; and her confidence was justified. It was not by robbing an old woman that Fisker intended to make himself great. Madame Melmotte thought he was the finest gentleman she had ever met.\n\"I shall do whatever he tells me,\" she said to Marie. \"I'm sure I've nothing to keep me in this country.\"\n\"I'm willing to go,\" said Marie. \"I don't want to stay in London.\"\n\"I suppose you'll marry him if he asks you?\"\n\"I don't know about that,\" said Marie. \"I don't think I'll marry anybody. What's the use? It's only money. Nobody cares for anything else. Fisker's all very well; but he only wants the money.\"\n\"I think he's a very nice young man,\" said Madame Melmotte.",
        "paragraph_chars": [
            [
                0,
                523
            ],
            [
                523,
                849
            ],
            [
                849,
                995
            ],
            [
                995,
                1020
            ],
            [
                1020,
                1121
            ],
            [
                1121,
                1185
            ],
            [
                1185,
                1348
            ],
            [
                1348,
                1439
            ],
            [
                1439,
                1554
            ],
            [
                1554,
                1632
            ],
            [
                1632,
                1935
            ],
            [
                1935,
                2085
            ],
            [
                2085,
                2408
            ],
            [
                2408,
                2447
            ],
            [
                2447,
                2552
            ],
            [
                2552,
                2589
            ],
            [
                2589,
                2644
            ],
            [
                2644,
                2668
            ],
            [
                2668,
                2940
            ],
            [
                2940,
                2976
            ],
            [
                2976,
                3099
            ],
            [
                3099,
                3549
            ],
            [
                3549,
                3704
            ],
            [
                3704,
                4237
            ],
            [
                4237,
                4534
            ],
            [
                4534,
                5082
            ],
            [
                5082,
                5659
            ],
            [
                5659,
                5791
            ],
            [
                5791,
                5891
            ],
            [
                5891,
                5934
            ],
            [
                5934,
                6080
            ],
            [
                6080,
                6099
            ],
            [
                6099,
                6239
            ],
            [
                6239,
                6424
            ],
            [
                6424,
                6474
            ],
            [
                6474,
                6519
            ],
            [
                6519,
                6581
            ],
            [
                6581,
                6639
            ],
            [
                6639,
                6806
            ],
            [
                6806,
                7061
            ],
            [
                7061,
                7293
            ],
            [
                7293,
                7463
            ],
            [
                7463,
                7520
            ],
            [
                7520,
                7930
            ],
            [
                7930,
                8084
            ],
            [
                8084,
                8556
            ],
            [
                8556,
                8736
            ],
            [
                8736,
                8790
            ],
            [
                8790,
                8847
            ],
            [
                8847,
                9337
            ],
            [
                9337,
                9602
            ],
            [
                9602,
                9708
            ],
            [
                9708,
                9775
            ],
            [
                9775,
                9820
            ],
            [
                9820,
                10013
            ],
            [
                10013,
                10072
            ]
        ],
        "segment_chars": [
            [
                0,
                224
            ],
            [
                224,
                317
            ],
            [
                317,
                387
            ],
            [
                387,
                523
            ],
            [
                523,
                651
            ],
            [
                651,
                711
            ],
            [
                711,
                779
            ],
            [
                779,
                849
            ],
            [
                849,
                927
            ],
            [
                927,
                995
            ],
            [
                995,
                1020
            ],
            [
                1020,
                1121
            ],
            [
                1121,
                1185
            ],
            [
                1185,
                1251
            ],
            [
                1251,
                1300
            ],
            [
                1300,
                1348
            ],
            [
                1348,
                1375
            ],
            [
                1375,
                1439
            ],
            [
                1439,
                1485
            ],
            [
                1485,
                1554
            ],
            [
                1554,
                1632
            ],
            [
                1632,
                1651
            ],
            [
                1651,
                1669
            ],
            [
                1669,
                1705
            ],
            [
                1705,
                1755
            ],
            [
                1755,
                1791
            ],
            [
                1791,
                1869
            ],
            [
                1869,
                1935
            ],
            [
                1935,
                2085
            ],
            [
                2085,
                2140
            ],
            [
                2140,
                2207
            ],
            [
                2207,
                2262
            ],
            [
                2262,
                2364
            ],
            [
                2364,
                2398
            ],
            [
                2398,
                2408
            ],
            [
                2408,
                2429
            ],
            [
                2429,
                2447
            ],
            [
                2447,
                2552
            ],
            [
                2552,
                2574
            ],
            [
                2574,
                2589
            ],
            [
                2589,
                2596
            ],
            [
                2596,
                2600
            ],
            [
                2600,
                2644
            ],
            [
                2644,
                2668
            ],
            [
                2668,
                2774
            ],
            [
                2774,
                2864
            ],
            [
                2864,
                2940
            ],
            [
                2940,
                2976
            ],
            [
                2976,
                3024
            ],
            [
                3024,
                3099
            ],
            [
                3099,
                3238
            ],
            [
                3238,
                3478
            ],
            [
                3478,
                3549
            ],
            [
                3549,
                3659
            ],
            [
                3659,
                3704
            ],
            [
                3704,
                3795
            ],
            [
                3795,
                3876
            ],
            [
                3876,
                3954
            ],
            [
                3954,
                3991
            ],
            [
                3991,
                4237
            ],
            [
                4237,
                4304
            ],
            [
                4304,
                4403
            ],
            [
                4403,
                4506
            ],
            [
                4506,
                4534
            ],
            [
                4534,
                4617
            ],
            [
                4617,
                4704
            ],
            [
                4704,
                4806
            ],
            [
                4806,
                5082
            ],
            [
                5082,
                5182
            ],
            [
                5182,
                5233
            ],
            [
                5233,
                5302
            ],
            [
                5302,
                5377
            ],
            [
                5377,
                5518
            ],
            [
                5518,
                5604
            ],
            [
                5604,
                5659
            ],
            [
                5659,
                5791
            ],
            [
                5791,
                5891
            ],
            [
                5891,
                5934
            ],
            [
                5934,
                5958
            ],
            [
                5958,
                6025
            ],
            [
                6025,
                6080
            ],
            [
                6080,
                6099
            ],
            [
                6099,
                6203
            ],
            [
                6203,
                6239
            ],
            [
                6239,
                6293
            ],
            [
                6293,
                6332
            ],
            [
                6332,
                6408
            ],
            [
                6408,
                6424
            ],
            [
                6424,
                6437
            ],
            [
                6437,
                6474
            ],
            [
                6474,
                6519
            ],
            [
                6519,
                6542
            ],
            [
                6542,
                6581
            ],
            [
                6581,
                6611
            ],
            [
                6611,
                6639
            ],
            [
                6639,
                6704
            ],
            [
                6704,
                6768
            ],
            [
                6768,
                6806
            ],
            [
                6806,
                6930
            ],
            [
                6930,
                7061
            ],
            [
                7061,
                7175
            ],
            [
                7175,
                7293
            ],
            [
                7293,
                7403
            ],
            [
                7403,
                7463
            ],
            [
                7463,
                7520
            ],
            [
                7520,
                7568
            ],
            [
                7568,
                7712
            ],
            [
                7712,
                7930
            ],
            [
                7930,
                7961
            ],
            [
                7961,
                8084
            ],
            [
                8084,
                8200
            ],
            [
                8200,
                8314
            ],
            [
                8314,
                8381
            ],
            [
                8381,
                8462
            ],
            [
                8462,
                8556
            ],
            [
                8556,
                8718
            ],
            [
                8718,
                8736
            ],
            [
                8736,
                8768
            ],
            [
                8768,
                8790
            ],
            [
                8790,
                8847
            ],
            [
                8847,
                8946
            ],
            [
                8946,
                9009
            ],
            [
                9009,
                9177
            ],
            [
                9177,
                9243
            ],
            [
                9243,
                9337
            ],
            [
                9337,
                9453
            ],
            [
                9453,
                9532
            ],
            [
                9532,
                9602
            ],
            [
                9602,
                9656
            ],
            [
                9656,
                9708
            ],
            [
                9708,
                9741
            ],
            [
                9741,
                9775
            ],
            [
                9775,
                9820
            ],
            [
                9820,
                9859
            ],
            [
                9859,
                9894
            ],
            [
                9894,
                9910
            ],
            [
                9910,
                9927
            ],
            [
                9927,
                9959
            ],
            [
                9959,
                10013
            ],
            [
                10013,
                10072
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                69,
                138
            ],
            [
                142,
                173
            ],
            [
                176,
                212
            ],
            [
                213,
                222
            ],
            [
                222,
                224
            ],
            [
                224,
                317
            ],
            [
                322,
                324
            ],
            [
                325,
                333
            ],
            [
                342,
                350
            ],
            [
                351,
                387
            ],
            [
                387,
                397
            ],
            [
                405,
                406
            ],
            [
                407,
                430
            ],
            [
                431,
                437
            ],
            [
                448,
                457
            ],
            [
                458,
                464
            ],
            [
                465,
                480
            ],
            [
                481,
                491
            ],
            [
                491,
                492
            ],
            [
                493,
                499
            ],
            [
                504,
                511
            ],
            [
                512,
                522
            ],
            [
                523,
                525
            ],
            [
                536,
                537
            ],
            [
                544,
                555
            ],
            [
                556,
                568
            ],
            [
                568,
                615
            ],
            [
                615,
                624
            ],
            [
                625,
                649
            ],
            [
                649,
                651
            ],
            [
                651,
                657
            ],
            [
                667,
                709
            ],
            [
                709,
                711
            ],
            [
                711,
                779
            ],
            [
                779,
                847
            ],
            [
                847,
                849
            ],
            [
                849,
                925
            ],
            [
                925,
                927
            ],
            [
                927,
                995
            ],
            [
                995,
                1020
            ],
            [
                1021,
                1092
            ],
            [
                1093,
                1121
            ],
            [
                1121,
                1185
            ],
            [
                1185,
                1189
            ],
            [
                1190,
                1208
            ],
            [
                1220,
                1251
            ],
            [
                1251,
                1298
            ],
            [
                1298,
                1300
            ],
            [
                1300,
                1348
            ],
            [
                1348,
                1349
            ],
            [
                1349,
                1375
            ],
            [
                1375,
                1404
            ],
            [
                1405,
                1423
            ],
            [
                1429,
                1439
            ],
            [
                1439,
                1449
            ],
            [
                1455,
                1483
            ],
            [
                1483,
                1485
            ],
            [
                1485,
                1554
            ],
            [
                1554,
                1632
            ],
            [
                1633,
                1651
            ],
            [
                1651,
                1667
            ],
            [
                1667,
                1669
            ],
            [
                1669,
                1703
            ],
            [
                1703,
                1705
            ],
            [
                1705,
                1755
            ],
            [
                1755,
                1791
            ],
            [
                1791,
                1808
            ],
            [
                1808,
                1809
            ],
            [
                1810,
                1828
            ],
            [
                1832,
                1869
            ],
            [
                1869,
                1935
            ],
            [
                1935,
                1948
            ],
            [
                1949,
                1991
            ],
            [
                1992,
                2051
            ],
            [
                2052,
                2056
            ],
            [
                2065,
                2084
            ],
            [
                2085,
                2138
            ],
            [
                2138,
                2140
            ],
            [
                2140,
                2146
            ],
            [
                2147,
                2205
            ],
            [
                2205,
                2207
            ],
            [
                2207,
                2213
            ],
            [
                2214,
                2262
            ],
            [
                2262,
                2289
            ],
            [
                2290,
                2364
            ],
            [
                2364,
                2368
            ],
            [
                2369,
                2398
            ],
            [
                2406,
                2408
            ],
            [
                2408,
                2429
            ],
            [
                2429,
                2447
            ],
            [
                2447,
                2448
            ],
            [
                2448,
                2459
            ],
            [
                2461,
                2519
            ],
            [
                2519,
                2543
            ],
            [
                2549,
                2552
            ],
            [
                2552,
                2574
            ],
            [
                2574,
                2589
            ],
            [
                2589,
                2594
            ],
            [
                2596,
                2598
            ],
            [
                2598,
                2600
            ],
            [
                2600,
                2644
            ],
            [
                2644,
                2668
            ],
            [
                2668,
                2774
            ],
            [
                2774,
                2806
            ],
            [
                2806,
                2817
            ],
            [
                2818,
                2864
            ],
            [
                2868,
                2940
            ],
            [
                2940,
                2973
            ],
            [
                2973,
                2976
            ],
            [
                2976,
                2986
            ],
            [
                2987,
                3011
            ],
            [
                3012,
                3024
            ],
            [
                3024,
                3029
            ],
            [
                3030,
                3046
            ],
            [
                3047,
                3078
            ],
            [
                3083,
                3098
            ],
            [
                3099,
                3131
            ],
            [
                3132,
                3238
            ],
            [
                3238,
                3240
            ],
            [
                3248,
                3250
            ],
            [
                3251,
                3312
            ],
            [
                3312,
                3478
            ],
            [
                3478,
                3489
            ],
            [
                3498,
                3501
            ],
            [
                3502,
                3508
            ],
            [
                3508,
                3509
            ],
            [
                3510,
                3513
            ],
            [
                3514,
                3548
            ],
            [
                3549,
                3550
            ],
            [
                3554,
                3560
            ],
            [
                3561,
                3572
            ],
            [
                3582,
                3599
            ],
            [
                3600,
                3639
            ],
            [
                3643,
                3659
            ],
            [
                3659,
                3676
            ],
            [
                3677,
                3704
            ],
            [
                3704,
                3752
            ],
            [
                3753,
                3795
            ],
            [
                3795,
                3876
            ],
            [
                3876,
                3917
            ],
            [
                3922,
                3927
            ],
            [
                3928,
                3954
            ],
            [
                3954,
                3989
            ],
            [
                3989,
                3991
            ],
            [
                3991,
                4043
            ],
            [
                4044,
                4087
            ],
            [
                4088,
                4206
            ],
            [
                4207,
                4237
            ],
            [
                4237,
                4250
            ],
            [
                4251,
                4259
            ],
            [
                4266,
                4268
            ],
            [
                4272,
                4291
            ],
            [
                4292,
                4302
            ],
            [
                4302,
                4304
            ],
            [
                4304,
                4322
            ],
            [
                4323,
                4355
            ],
            [
                4358,
                4364
            ],
            [
                4365,
                4403
            ],
            [
                4403,
                4406
            ],
            [
                4407,
                4447
            ],
            [
                4448,
                4506
            ],
            [
                4510,
                4532
            ],
            [
                4532,
                4534
            ],
            [
                4534,
                4601
            ],
            [
                4602,
                4617
            ],
            [
                4617,
                4620
            ],
            [
                4621,
                4624
            ],
            [
                4629,
                4645
            ],
            [
                4647,
                4650
            ],
            [
                4651,
                4679
            ],
            [
                4680,
                4704
            ],
            [
                4704,
                4755
            ],
            [
                4756,
                4759
            ],
            [
                4767,
                4806
            ],
            [
                4806,
                4839
            ],
            [
                4839,
                4856
            ],
            [
                4857,
                4869
            ],
            [
                4870,
                4899
            ],
            [
                4900,
                4926
            ],
            [
                4927,
                4964
            ],
            [
                4964,
                5047
            ],
            [
                5048,
                5082
            ],
            [
                5082,
                5180
            ],
            [
                5180,
                5182
            ],
            [
                5182,
                5191
            ],
            [
                5192,
                5233
            ],
            [
                5233,
                5255
            ],
            [
                5256,
                5302
            ],
            [
                5302,
                5314
            ],
            [
                5315,
                5377
            ],
            [
                5377,
                5396
            ],
            [
                5397,
                5401
            ],
            [
                5408,
                5412
            ],
            [
                5413,
                5416
            ],
            [
                5417,
                5421
            ],
            [
                5421,
                5445
            ],
            [
                5446,
                5481
            ],
            [
                5482,
                5488
            ],
            [
                5489,
                5496
            ],
            [
                5497,
                5516
            ],
            [
                5516,
                5518
            ],
            [
                5518,
                5580
            ],
            [
                5580,
                5596
            ],
            [
                5597,
                5604
            ],
            [
                5604,
                5607
            ],
            [
                5608,
                5659
            ],
            [
                5659,
                5791
            ],
            [
                5791,
                5828
            ],
            [
                5829,
                5891
            ],
            [
                5891,
                5934
            ],
            [
                5934,
                5958
            ],
            [
                5958,
                5985
            ],
            [
                5986,
                6025
            ],
            [
                6025,
                6080
            ],
            [
                6080,
                6099
            ],
            [
                6099,
                6203
            ],
            [
                6203,
                6236
            ],
            [
                6239,
                6292
            ],
            [
                6294,
                6330
            ],
            [
                6330,
                6332
            ],
            [
                6332,
                6408
            ],
            [
                6408,
                6424
            ],
            [
                6424,
                6435
            ],
            [
                6437,
                6474
            ],
            [
                6474,
                6476
            ],
            [
                6477,
                6519
            ],
            [
                6519,
                6542
            ],
            [
                6542,
                6573
            ],
            [
                6576,
                6581
            ],
            [
                6581,
                6611
            ],
            [
                6611,
                6639
            ],
            [
                6644,
                6650
            ],
            [
                6651,
                6683
            ],
            [
                6684,
                6704
            ],
            [
                6704,
                6734
            ],
            [
                6735,
                6742
            ],
            [
                6743,
                6768
            ],
            [
                6768,
                6804
            ],
            [
                6804,
                6805
            ],
            [
                6806,
                6828
            ],
            [
                6834,
                6839
            ],
            [
                6846,
                6885
            ],
            [
                6886,
                6912
            ],
            [
                6913,
                6930
            ],
            [
                6930,
                7059
            ],
            [
                7059,
                7060
            ],
            [
                7061,
                7098
            ],
            [
                7106,
                7128
            ],
            [
                7129,
                7149
            ],
            [
                7150,
                7175
            ],
            [
                7175,
                7181
            ],
            [
                7182,
                7186
            ],
            [
                7187,
                7194
            ],
            [
                7195,
                7251
            ],
            [
                7255,
                7265
            ],
            [
                7266,
                7292
            ],
            [
                7293,
                7344
            ],
            [
                7345,
                7403
            ],
            [
                7403,
                7463
            ],
            [
                7463,
                7520
            ],
            [
                7520,
                7557
            ],
            [
                7558,
                7568
            ],
            [
                7568,
                7712
            ],
            [
                7712,
                7858
            ],
            [
                7864,
                7881
            ],
            [
                7888,
                7911
            ],
            [
                7912,
                7928
            ],
            [
                7928,
                7930
            ],
            [
                7930,
                7959
            ],
            [
                7959,
                7961
            ],
            [
                7961,
                8008
            ],
            [
                8009,
                8020
            ],
            [
                8021,
                8031
            ],
            [
                8032,
                8083
            ],
            [
                8084,
                8168
            ],
            [
                8169,
                8180
            ],
            [
                8185,
                8192
            ],
            [
                8198,
                8200
            ],
            [
                8200,
                8214
            ],
            [
                8224,
                8314
            ],
            [
                8314,
                8319
            ],
            [
                8325,
                8347
            ],
            [
                8348,
                8381
            ],
            [
                8381,
                8384
            ],
            [
                8385,
                8437
            ],
            [
                8438,
                8444
            ],
            [
                8460,
                8462
            ],
            [
                8468,
                8481
            ],
            [
                8481,
                8486
            ],
            [
                8487,
                8543
            ],
            [
                8544,
                8545
            ],
            [
                8546,
                8555
            ],
            [
                8556,
                8640
            ],
            [
                8641,
                8718
            ],
            [
                8718,
                8736
            ],
            [
                8736,
                8768
            ],
            [
                8768,
                8790
            ],
            [
                8790,
                8809
            ],
            [
                8810,
                8826
            ],
            [
                8834,
                8844
            ],
            [
                8847,
                8895
            ],
            [
                8896,
                8946
            ],
            [
                8946,
                8950
            ],
            [
                8951,
                8954
            ],
            [
                8963,
                8968
            ],
            [
                8969,
                9007
            ],
            [
                9007,
                9009
            ],
            [
                9009,
                9037
            ],
            [
                9038,
                9042
            ],
            [
                9042,
                9111
            ],
            [
                9112,
                9129
            ],
            [
                9130,
                9133
            ],
            [
                9134,
                9164
            ],
            [
                9165,
                9175
            ],
            [
                9175,
                9177
            ],
            [
                9177,
                9190
            ],
            [
                9196,
                9243
            ],
            [
                9243,
                9262
            ],
            [
                9272,
                9321
            ],
            [
                9335,
                9336
            ],
            [
                9337,
                9339
            ],
            [
                9345,
                9397
            ],
            [
                9398,
                9417
            ],
            [
                9419,
                9422
            ],
            [
                9427,
                9437
            ],
            [
                9438,
                9451
            ],
            [
                9451,
                9453
            ],
            [
                9453,
                9532
            ],
            [
                9532,
                9547
            ],
            [
                9556,
                9558
            ],
            [
                9559,
                9600
            ],
            [
                9600,
                9601
            ],
            [
                9602,
                9656
            ],
            [
                9656,
                9689
            ],
            [
                9690,
                9708
            ],
            [
                9708,
                9741
            ],
            [
                9741,
                9775
            ],
            [
                9775,
                9792
            ],
            [
                9799,
                9820
            ],
            [
                9820,
                9833
            ],
            [
                9834,
                9859
            ],
            [
                9860,
                9894
            ],
            [
                9894,
                9910
            ],
            [
                9910,
                9927
            ],
            [
                9927,
                9959
            ],
            [
                9959,
                10010
            ],
            [
                10013,
                10072
            ]
        ],
        "row_chars": [
            [
                0,
                224
            ],
            [
                224,
                317
            ],
            [
                317,
                387
            ],
            [
                387,
                523
            ],
            [
                523,
                651
            ],
            [
                651,
                711
            ],
            [
                711,
                779
            ],
            [
                779,
                849
            ],
            [
                849,
                927
            ],
            [
                927,
                995
            ],
            [
                995,
                1020
            ],
            [
                1020,
                1020
            ],
            [
                1020,
                1121
            ],
            [
                1121,
                1185
            ],
            [
                1185,
                1251
            ],
            [
                1251,
                1300
            ],
            [
                1300,
                1348
            ],
            [
                1348,
                1375
            ],
            [
                1375,
                1439
            ],
            [
                1439,
                1485
            ],
            [
                1485,
                1485
            ],
            [
                1485,
                1485
            ],
            [
                1485,
                1554
            ],
            [
                1554,
                1632
            ],
            [
                1632,
                1632
            ],
            [
                1632,
                1651
            ],
            [
                1651,
                1669
            ],
            [
                1669,
                1669
            ],
            [
                1669,
                1669
            ],
            [
                1669,
                1669
            ],
            [
                1669,
                1669
            ],
            [
                1669,
                1705
            ],
            [
                1705,
                1755
            ],
            [
                1755,
                1791
            ],
            [
                1791,
                1791
            ],
            [
                1791,
                1791
            ],
            [
                1791,
                1869
            ],
            [
                1869,
                1935
            ],
            [
                1935,
                2085
            ],
            [
                2085,
                2140
            ],
            [
                2140,
                2207
            ],
            [
                2207,
                2262
            ],
            [
                2262,
                2262
            ],
            [
                2262,
                2262
            ],
            [
                2262,
                2262
            ],
            [
                2262,
                2262
            ],
            [
                2262,
                2364
            ],
            [
                2364,
                2364
            ],
            [
                2364,
                2398
            ],
            [
                2398,
                2408
            ],
            [
                2408,
                2429
            ],
            [
                2429,
                2447
            ],
            [
                2447,
                2552
            ],
            [
                2552,
                2574
            ],
            [
                2574,
                2589
            ],
            [
                2589,
                2600
            ],
            [
                2600,
                2644
            ],
            [
                2644,
                2668
            ],
            [
                2668,
                2774
            ],
            [
                2774,
                2864
            ],
            [
                2864,
                2940
            ],
            [
                2940,
                2976
            ],
            [
                2976,
                3024
            ],
            [
                3024,
                3099
            ],
            [
                3099,
                3099
            ],
            [
                3099,
                3238
            ],
            [
                3238,
                3478
            ],
            [
                3478,
                3478
            ],
            [
                3478,
                3549
            ],
            [
                3549,
                3659
            ],
            [
                3659,
                3704
            ],
            [
                3704,
                3795
            ],
            [
                3795,
                3876
            ],
            [
                3876,
                3954
            ],
            [
                3954,
                3991
            ],
            [
                3991,
                3991
            ],
            [
                3991,
                4237
            ],
            [
                4237,
                4304
            ],
            [
                4304,
                4403
            ],
            [
                4403,
                4506
            ],
            [
                4506,
                4506
            ],
            [
                4506,
                4506
            ],
            [
                4506,
                4534
            ],
            [
                4534,
                4617
            ],
            [
                4617,
                4617
            ],
            [
                4617,
                4617
            ],
            [
                4617,
                4617
            ],
            [
                4617,
                4704
            ],
            [
                4704,
                4806
            ],
            [
                4806,
                5082
            ],
            [
                5082,
                5182
            ],
            [
                5182,
                5233
            ],
            [
                5233,
                5302
            ],
            [
                5302,
                5377
            ],
            [
                5377,
                5377
            ],
            [
                5377,
                5518
            ],
            [
                5518,
                5604
            ],
            [
                5604,
                5659
            ],
            [
                5659,
                5791
            ],
            [
                5791,
                5891
            ],
            [
                5891,
                5934
            ],
            [
                5934,
                5958
            ],
            [
                5958,
                6025
            ],
            [
                6025,
                6025
            ],
            [
                6025,
                6080
            ],
            [
                6080,
                6099
            ],
            [
                6099,
                6203
            ],
            [
                6203,
                6239
            ],
            [
                6239,
                6239
            ],
            [
                6239,
                6239
            ],
            [
                6239,
                6293
            ],
            [
                6293,
                6293
            ],
            [
                6293,
                6293
            ],
            [
                6293,
                6293
            ],
            [
                6293,
                6332
            ],
            [
                6332,
                6408
            ],
            [
                6408,
                6424
            ],
            [
                6424,
                6437
            ],
            [
                6437,
                6437
            ],
            [
                6437,
                6474
            ],
            [
                6474,
                6519
            ],
            [
                6519,
                6542
            ],
            [
                6542,
                6581
            ],
            [
                6581,
                6611
            ],
            [
                6611,
                6639
            ],
            [
                6639,
                6639
            ],
            [
                6639,
                6639
            ],
            [
                6639,
                6704
            ],
            [
                6704,
                6768
            ],
            [
                6768,
                6806
            ],
            [
                6806,
                6806
            ],
            [
                6806,
                6930
            ],
            [
                6930,
                7061
            ],
            [
                7061,
                7175
            ],
            [
                7175,
                7293
            ],
            [
                7293,
                7293
            ],
            [
                7293,
                7293
            ],
            [
                7293,
                7293
            ],
            [
                7293,
                7293
            ],
            [
                7293,
                7293
            ],
            [
                7293,
                7403
            ],
            [
                7403,
                7463
            ],
            [
                7463,
                7520
            ],
            [
                7520,
                7568
            ],
            [
                7568,
                7712
            ],
            [
                7712,
                7930
            ],
            [
                7930,
                7961
            ],
            [
                7961,
                8084
            ],
            [
                8084,
                8084
            ],
            [
                8084,
                8084
            ],
            [
                8084,
                8200
            ],
            [
                8200,
                8314
            ],
            [
                8314,
                8381
            ],
            [
                8381,
                8462
            ],
            [
                8462,
                8556
            ],
            [
                8556,
                8718
            ],
            [
                8718,
                8736
            ],
            [
                8736,
                8768
            ],
            [
                8768,
                8790
            ],
            [
                8790,
                8847
            ],
            [
                8847,
                8847
            ],
            [
                8847,
                8847
            ],
            [
                8847,
                8847
            ],
            [
                8847,
                8946
            ],
            [
                8946,
                9009
            ],
            [
                9009,
                9177
            ],
            [
                9177,
                9177
            ],
            [
                9177,
                9177
            ],
            [
                9177,
                9243
            ],
            [
                9243,
                9337
            ],
            [
                9337,
                9337
            ],
            [
                9337,
                9453
            ],
            [
                9453,
                9532
            ],
            [
                9532,
                9602
            ],
            [
                9602,
                9656
            ],
            [
                9656,
                9708
            ],
            [
                9708,
                9741
            ],
            [
                9741,
                9775
            ],
            [
                9775,
                9820
            ],
            [
                9820,
                9859
            ],
            [
                9859,
                9859
            ],
            [
                9859,
                9894
            ],
            [
                9894,
                9910
            ],
            [
                9910,
                9927
            ],
            [
                9927,
                9959
            ],
            [
                9959,
                10013
            ],
            [
                10013,
                10013
            ],
            [
                10013,
                10013
            ],
            [
                10013,
                10013
            ],
            [
                10013,
                10072
            ]
        ]
    }
}