{
    "original": {
        "text": "Hetta Carbury, out of the fulness of her heart, having made up her mind that she had been unjust to her lover, wrote to him a letter full of penitence, full of love, telling him at great length all the details of her meeting with Mrs. Hurtle, and bidding him come back to her, and bring the brooch with him. But this letter she had unfortunately addressed to the Beargarden, as he had written to her from that club; and partly through his own fault, and partly through the demoralisation of that once perfect establishment, the letter never reached his hands. When, therefore, he returned to London he was justified in supposing that she had refused even to notice his appeal. He was, however, determined that he would still make further struggles. He had, he felt, to contend with many difficulties. Mrs. Hurtle, Roger Carbury, and Hetta's mother were, he thought, all inimical to him. Mrs. Hurtle, though she had declared that she would not rage as a lioness, could hardly be his friend in the matter. Roger had repeatedly declared his determination to regard him as a traitor. And Lady Carbury, as he well knew, had always been and always would be opposed to the match. But Hetta had owned that she loved him, had submitted to his caresses, and had been proud of his admiration. And Paul, though he did not probably analyze very carefully the character of his beloved, still felt instinctively that, having so far prevailed with such a girl, his prospects could not be altogether hopeless. And yet how should he continue the struggle? With what weapons should he carry on the fight? The writing of letters is but a one-sided, troublesome proceeding, when the person to whom they are written will not answer them; and the calling at a door at which the servant has been instructed to refuse a visitor admission, becomes, disagreeable,--if not degrading,--after a time.\nBut Hetta had written a second epistle,--not to her lover, but to one who received his letters with more regularity. When she rashly and with precipitate wrath quarrelled with Paul Montague, she at once communicated the fact to her mother, and through her mother to her cousin Roger. Though she would not recognise Roger as a lover, she did acknowledge him to be the head of her family, and her own special friend, and entitled in some special way to know all that she herself did, and all that was done in regard to her. She therefore wrote to her cousin, telling him that she had made a mistake about Paul, that she was convinced that Paul had always behaved to her with absolute sincerity, and, in short, that Paul was the best, and dearest, and most ill-used of human beings. In her enthusiasm she went on to declare that there could be no other chance of happiness for her in this world than that of becoming Paul's wife, and to beseech her dearest friend and cousin Roger not to turn against her, but to lend her an aiding hand. There are those whom strong words in letters never affect at all,--who, perhaps, hardly read them, and take what they do read as meaning no more than half what is said. But Roger Carbury was certainly not one of these. As he sat on the garden wall at Carbury, with his cousin's letter in his hand, her words had their full weight with him. He did not try to convince himself that all this was the verbiage of an enthusiastic girl, who might soon be turned and trained to another mode of thinking by fitting admonitions. To him now, as he read and re-read Hetta's letter sitting on the wall, there was not at any rate further hope for himself. Though he was altogether unchanged himself, though he was altogether incapable of change,--though he could not rally himself sufficiently to look forward to even a passive enjoyment of life without the girl whom he had loved,--yet he told himself what he believed to be the truth. At last he owned directly and plainly that, whether happy or unhappy, he must do without her. He had let time slip by with him too fast and too far before he had ventured to love. He must now stomach his disappointment, and make the best he could of such a broken, ill-conditioned life as was left to him. But, if he acknowledged this,--and he did acknowledge it,--in what fashion should he in future treat the man and woman who had reduced him so low?\nAt this moment his mind was tuned to high thoughts. If it were possible he would be unselfish. He could not, indeed, bring himself to think with kindness of Paul Montague. He could not say to himself that the man had not been treacherous to him, nor could he forgive the man's supposed treason. But he did tell himself very plainly that in comparison with Hetta the man was nothing to him. It could hardly be worth his while to maintain a quarrel with the man if he were once able to assure Hetta that she, as the wife of another man, should still be dear to him as a friend might be dear. He was well aware that such assurance, such forgiveness, must contain very much. If it were to be so, Hetta's child must take the name of Carbury, and must be to him as his heir,--as near as possible his own child. In her favour he must throw aside that law of primogeniture which to him was so sacred that he had been hitherto minded to make Sir Felix his heir in spite of the absolute unfitness of the wretched young man. All this must be changed, should he be able to persuade himself to give his consent to the marriage. In such case Carbury must be the home of the married couple, as far as he could induce them to make it so. There must be born the future infant to whose existence he was already looking forward with some idea that in his old age he might there find comfort. In such case, though he should never again be able to love Paul Montague in his heart of hearts, he must live with him for her sake on affectionate terms. He must forgive Hetta altogether,--as though there had been no fault; and he must strive to forgive the man's fault as best he might. Struggling as he was to be generous, passionately fond as he was of justice, yet he did not know how to be just himself. He could not see that he in truth had been to no extent ill-used. And ever and again, as he thought of the great prayer as to the forgiveness of trespasses, he could not refrain from asking himself whether it could really be intended that he should forgive such trespass as that committed against him by Paul Montague! Nevertheless, when he rose from the wall he had resolved that Hetta should be pardoned entirely, and that Paul Montague should be treated as though he were pardoned. As for himself,--the chances of the world had been unkind to him, and he would submit to them!\nNevertheless he wrote no answer to Hetta's letter. Perhaps he felt, with some undefined but still existing hope, that the writing of such a letter would deprive him of his last chance. Hetta's letter to himself hardly required an immediate answer,--did not, indeed, demand any answer. She had simply told him that, whereas she had for certain reasons quarrelled with the man she had loved, she had now come to the conclusion that she would quarrel with him no longer. She had asked for her cousin's assent to her own views, but that, as Roger felt, was to be given rather by the discontinuance of opposition than by any positive action. Roger's influence with her mother was the assistance which Hetta really wanted from him, and that influence could hardly be given by the writing of any letter. Thinking of all this, Roger determined that he would again go up to London. He would have the vacant hours of the journey in which to think of it all again, and tell himself whether it was possible for him to bring his heart to agree to the marriage;--and then he would see the people, and perhaps learn something further from their manner and their words, before he finally committed himself to the abandonment of his own hopes and the completion of theirs.\nHe went up to town, and I do not know that those vacant hours served him much. To a man not accustomed to thinking there is nothing in the world so difficult as to think. After some loose fashion we turn over things in our mind and ultimately reach some decision, guided probably by our feelings at the last moment rather than by any process of ratiocination;--and then we think that we have thought. But to follow out one argument to an end, and then to found on the base so reached the commencement of another, is not common to us. Such a process was hardly within the compass of Roger's mind,--who when he was made wretched by the dust, and by a female who had a basket of objectionable provisions opposite to him, almost forswore his charitable resolutions of the day before; but who again, as he walked lonely at night round the square which was near to his hotel, looking up at the bright moon with a full appreciation of the beauty of the heavens, asked himself what was he that he should wish to interfere with the happiness of two human beings much younger than himself, and much fitter to enjoy the world. But he had had a bath, and had got rid of the dust, and had eaten his dinner.\nThe next morning he was in Welbeck Street at an early hour. When he knocked he had not made up his mind whether he would ask for Lady Carbury or her daughter, and did at last inquire whether \"the ladies\" were at home. The ladies were reported as being at home, and he was at once shown into the drawing-room, where Hetta was sitting. She hurried up to him, and he at once took her in his arms and kissed her. He had never done such a thing before. He had never even kissed her hand. Though they were cousins and dear friends, he had never treated her after that fashion. Her instinct told her immediately that such a greeting from him was a sign of affectionate compliance with her wishes. That this man should kiss her as her best and dearest relation, as her most trusted friend, as almost her brother, was certainly to her no offence. She could cling to him in fondest love,--if he would only consent not to be her lover. \"Oh, Roger, I am so glad to see you,\" she said, escaping gently from his arms.\n\"I could not write an answer, and so I came.\"\n\"You always do the kindest thing that can be done.\"\n\"I don't know. I don't know that I can do anything now,--kind or unkind. It is all done without any aid from me. Hetta, you have been all the world to me.\"\n\"Do not reproach me,\" she said.\n\"No;--no. Why should I reproach you? You have committed no fault. I should not have come had I intended to reproach any one.\"\n\"I love you so much for saying that.\"\n\"Let it be as you wish it,--if it must. I have made up my mind to bear it, and there shall be an end of it.\" As he said this he took her by the hand, and she put her head upon his shoulder and began to weep. \"And still you will be all the world to me,\" he continued, with his arm round her waist. \"As you will not be my wife, you shall be my daughter.\"\n\"I will be your sister, Roger.\"\n\"My daughter rather. You shall be all that I have in the world. I will hurry to grow old that I may feel for you as the old feel for the young. And if you have a child, Hetta, he must be my child.\" As he thus spoke her tears were renewed. \"I have planned it all out in my mind, dear. There! If there be anything that I can do to add to your happiness, I will do it. You must believe this of me,--that to make you happy shall be the only enjoyment of my life.\"\nIt had been hardly possible for her to tell him as yet that the man to whom he was thus consenting to surrender her had not even condescended to answer the letter in which she had told him to come back to her. And now, sobbing as she was, overcome by the tenderness of her cousin's affection, anxious to express her intense gratitude, she did not know how first to mention the name of Paul Montague. \"Have you seen him?\" she said in a whisper.\n\"Seen whom?\"\n\"Mr. Montague.\"\n\"No;--why should I have seen him? It is not for his sake that I am here.\"\n\"But you will be his friend?\"\n\"Your husband shall certainly be my friend;--or, if not, the fault shall not be mine. It shall all be forgotten, Hetta,--as nearly as such things may be forgotten. But I had nothing to say to him till I had seen you.\" At that moment the door was opened and Lady Carbury entered the room, and, after her greeting with her cousin, looked first at her daughter and then at Roger. \"I have come up,\" said he, \"to signify my adhesion to this marriage.\" Lady Carbury's face fell very low. \"I need not speak again of what were my own wishes. I have learned at last that it could not have been so.\"\n\"Why should you say so?\" exclaimed Lady Carbury.\n\"Pray, pray, mamma--,\" Hetta began, but was unable to find words with which to go on with her prayer.\n\"I do not know that it need be so at all,\" continued Lady Carbury. \"I think it is very much in your own hands. Of course it is not for me to press such an arrangement, if it be not in accord with your own wishes.\"\n\"I look upon her as engaged to marry Paul Montague,\" said Roger.\n\"Not at all,\" said Lady Carbury.\n\"Yes; mamma,--yes,\" cried Hetta boldly. \"It is so. I am engaged to him.\"\n\"I beg to let your cousin know that it is not so with my consent,--nor, as far as I can understand at present, with the consent of Mr. Montague himself.\"\n\"Mamma!\"\n\"Paul Montague!\" ejaculated Roger Carbury. \"The consent of Paul Montague! I think I may take upon myself to say that there can be no doubt as to that.\"\n\"There has been a quarrel,\" said Lady Carbury.\n\"Surely he has not quarrelled with you, Hetta?\"\n\"I wrote to him,--and he has not answered me,\" said Hetta piteously.\nThen Lady Carbury gave a full and somewhat coloured account of what had taken place, while Roger listened with admirable patience. \"The marriage is on every account objectionable,\" she said at last. \"His means are precarious. His conduct with regard to that woman has been very bad. He has been sadly mixed up with that wretched man who destroyed himself. And now, when Henrietta has written to him without my sanction,--in opposition to my express commands,--he takes no notice of her. She, very properly, sent him back a present that he made her, and no doubt he has resented her doing so. I trust that his resentment may be continued.\"\nHetta was now seated on a sofa hiding her face and weeping. Roger stood perfectly still, listening with respectful silence till Lady Carbury had spoken her last word. And even then he was slow to answer, considering what he might best say. \"I think I had better see him,\" he replied. \"If, as I imagine, he has not received my cousin's letter, that matter will be set at rest. We must not take advantage of such an accident as that. As to his income,--that I think may be managed. His connection with Mr. Melmotte was unfortunate, but was due to no fault of his.\" At this moment he could not but remember Lady Carbury's great anxiety to be closely connected with Melmotte, but he was too generous to say a word on that head. \"I will see him, Lady Carbury, and then I will come to you again.\"\nLady Carbury did not dare to tell him that she did not wish him to see Paul Montague. She knew that if he really threw himself into the scale against her, her opposition would weigh nothing. He was too powerful in his honesty and greatness of character,--and had been too often admitted by herself to be the guardian angel of the family,--for her to stand against him. But she still thought that had he persevered, Hetta would have become his wife.\nIt was late that evening before Roger found Paul Montague, who had only then returned from Liverpool with Fisker,--whose subsequent doings have been recorded somewhat out of their turn.\n\"I don't know what letter you mean,\" said Paul.\n\"You wrote to her?\"\n\"Certainly I wrote to her. I wrote to her twice. My last letter was one which I think she ought to have answered. She had accepted me, and had given me a right to tell my own story when she unfortunately heard from other sources the story of my journey to Lowestoft with Mrs. Hurtle.\" Paul pleaded his own case with indignant heat, not understanding at first that Roger had come to him on a friendly mission.\n\"She did answer your letter.\"\n\"I have not had a line from her;--not a word!\"\n\"She did answer your letter.\"\n\"What did she say to me?\"\n\"Nay,--you must ask her that.\"\n\"But if she will not see me?\"\n\"She will see you. I can tell you that. And I will tell you this also;--that she wrote to you as a girl writes to the lover whom she does wish to see.\"\n\"Is that true?\" exclaimed Paul, jumping up.\n\"I am here especially to tell you that it is true. I should hardly come on such a mission if there were a doubt. You may go to her, and need have nothing to fear,--unless, indeed, it be the opposition of her mother.\"\n\"She is stronger than her mother,\" said Paul.\n\"I think she is. And now I wish you to hear what I have to say.\"\n\"Of course,\" said Paul, sitting down suddenly. Up to this moment Roger Carbury, though he had certainly brought glad tidings, had not communicated them as a joyous, sympathetic messenger. His face had been severe, and the tone of his voice almost harsh; and Paul, remembering well the words of the last letter which his old friend had written him, did not expect personal kindness. Roger would probably say very disagreeable things to him, which he must bear with all the patience which he could summon to his assistance.\n\"You know what my feelings have been,\" Roger began, \"and how deeply I have resented what I thought to be an interference with my affections. But no quarrel between you and me, whatever the rights of it may be--\"\n\"I have never quarrelled with you,\" Paul began.\n\"If you will listen to me for a moment it will be better. No anger between you and me, let it arise as it might, should be allowed to interfere with the happiness of her whom I suppose we both love better than all the rest of the world put together.\"\n\"I do,\" said Paul.\n\"And so do I;--and so I always shall. But she is to be your wife. She shall be my daughter. She shall have my property,--or her child shall be my heir. My house shall be her house,--if you and she will consent to make it so. You will not be afraid of me. You know me, I think, too well for that. You may now count on any assistance you could have from me were I a father giving you a daughter in marriage. I do this because I will make the happiness of her life the chief object of mine. Now good night. Don't say anything about it at present. By-and-by we shall be able to talk about these things with more equable temper.\" Having so spoken he hurried out of the room, leaving Paul Montague bewildered by the tidings which had been announced to him.",
        "paragraph_chars": [
            [
                0,
                1871
            ],
            [
                1871,
                4283
            ],
            [
                4283,
                6646
            ],
            [
                6646,
                7902
            ],
            [
                7902,
                9096
            ],
            [
                9096,
                10100
            ],
            [
                10100,
                10146
            ],
            [
                10146,
                10198
            ],
            [
                10198,
                10354
            ],
            [
                10354,
                10386
            ],
            [
                10386,
                10512
            ],
            [
                10512,
                10550
            ],
            [
                10550,
                10903
            ],
            [
                10903,
                10935
            ],
            [
                10935,
                11395
            ],
            [
                11395,
                11839
            ],
            [
                11839,
                11852
            ],
            [
                11852,
                11868
            ],
            [
                11868,
                11942
            ],
            [
                11942,
                11972
            ],
            [
                11972,
                12562
            ],
            [
                12562,
                12611
            ],
            [
                12611,
                12713
            ],
            [
                12713,
                12927
            ],
            [
                12927,
                12992
            ],
            [
                12992,
                13025
            ],
            [
                13025,
                13098
            ],
            [
                13098,
                13252
            ],
            [
                13252,
                13261
            ],
            [
                13261,
                13413
            ],
            [
                13413,
                13460
            ],
            [
                13460,
                13508
            ],
            [
                13508,
                13577
            ],
            [
                13577,
                14216
            ],
            [
                14216,
                15007
            ],
            [
                15007,
                15456
            ],
            [
                15456,
                15642
            ],
            [
                15642,
                15690
            ],
            [
                15690,
                15710
            ],
            [
                15710,
                16119
            ],
            [
                16119,
                16149
            ],
            [
                16149,
                16196
            ],
            [
                16196,
                16226
            ],
            [
                16226,
                16252
            ],
            [
                16252,
                16283
            ],
            [
                16283,
                16313
            ],
            [
                16313,
                16465
            ],
            [
                16465,
                16509
            ],
            [
                16509,
                16726
            ],
            [
                16726,
                16772
            ],
            [
                16772,
                16837
            ],
            [
                16837,
                17359
            ],
            [
                17359,
                17571
            ],
            [
                17571,
                17619
            ],
            [
                17619,
                17870
            ],
            [
                17870,
                17889
            ],
            [
                17889,
                18639
            ]
        ],
        "segment_chars": [
            [
                0,
                308
            ],
            [
                308,
                560
            ],
            [
                560,
                677
            ],
            [
                677,
                749
            ],
            [
                749,
                801
            ],
            [
                801,
                887
            ],
            [
                887,
                1004
            ],
            [
                1004,
                1080
            ],
            [
                1080,
                1173
            ],
            [
                1173,
                1282
            ],
            [
                1282,
                1493
            ],
            [
                1493,
                1538
            ],
            [
                1538,
                1586
            ],
            [
                1586,
                1871
            ],
            [
                1871,
                1988
            ],
            [
                1988,
                2155
            ],
            [
                2155,
                2393
            ],
            [
                2393,
                2651
            ],
            [
                2651,
                2906
            ],
            [
                2906,
                3075
            ],
            [
                3075,
                3125
            ],
            [
                3125,
                3246
            ],
            [
                3246,
                3426
            ],
            [
                3426,
                3549
            ],
            [
                3549,
                3830
            ],
            [
                3830,
                3924
            ],
            [
                3924,
                4010
            ],
            [
                4010,
                4136
            ],
            [
                4136,
                4283
            ],
            [
                4283,
                4335
            ],
            [
                4335,
                4378
            ],
            [
                4378,
                4455
            ],
            [
                4455,
                4578
            ],
            [
                4578,
                4673
            ],
            [
                4673,
                4873
            ],
            [
                4873,
                4954
            ],
            [
                4954,
                5088
            ],
            [
                5088,
                5297
            ],
            [
                5297,
                5398
            ],
            [
                5398,
                5505
            ],
            [
                5505,
                5656
            ],
            [
                5656,
                5811
            ],
            [
                5811,
                5945
            ],
            [
                5945,
                6066
            ],
            [
                6066,
                6132
            ],
            [
                6132,
                6385
            ],
            [
                6385,
                6551
            ],
            [
                6551,
                6646
            ],
            [
                6646,
                6697
            ],
            [
                6697,
                6831
            ],
            [
                6831,
                6931
            ],
            [
                6931,
                7114
            ],
            [
                7114,
                7283
            ],
            [
                7283,
                7443
            ],
            [
                7443,
                7519
            ],
            [
                7519,
                7902
            ],
            [
                7902,
                7981
            ],
            [
                7981,
                8073
            ],
            [
                8073,
                8303
            ],
            [
                8303,
                8436
            ],
            [
                8436,
                9018
            ],
            [
                9018,
                9096
            ],
            [
                9096,
                9156
            ],
            [
                9156,
                9314
            ],
            [
                9314,
                9430
            ],
            [
                9430,
                9505
            ],
            [
                9505,
                9544
            ],
            [
                9544,
                9579
            ],
            [
                9579,
                9667
            ],
            [
                9667,
                9786
            ],
            [
                9786,
                9934
            ],
            [
                9934,
                10021
            ],
            [
                10021,
                10100
            ],
            [
                10100,
                10146
            ],
            [
                10146,
                10198
            ],
            [
                10198,
                10213
            ],
            [
                10213,
                10271
            ],
            [
                10271,
                10311
            ],
            [
                10311,
                10354
            ],
            [
                10354,
                10386
            ],
            [
                10386,
                10396
            ],
            [
                10396,
                10423
            ],
            [
                10423,
                10452
            ],
            [
                10452,
                10512
            ],
            [
                10512,
                10550
            ],
            [
                10550,
                10590
            ],
            [
                10590,
                10659
            ],
            [
                10659,
                10758
            ],
            [
                10758,
                10847
            ],
            [
                10847,
                10903
            ],
            [
                10903,
                10935
            ],
            [
                10935,
                10956
            ],
            [
                10956,
                10999
            ],
            [
                10999,
                11079
            ],
            [
                11079,
                11133
            ],
            [
                11133,
                11174
            ],
            [
                11174,
                11219
            ],
            [
                11219,
                11226
            ],
            [
                11226,
                11301
            ],
            [
                11301,
                11395
            ],
            [
                11395,
                11605
            ],
            [
                11605,
                11795
            ],
            [
                11795,
                11816
            ],
            [
                11816,
                11839
            ],
            [
                11839,
                11852
            ],
            [
                11852,
                11857
            ],
            [
                11857,
                11868
            ],
            [
                11868,
                11902
            ],
            [
                11902,
                11942
            ],
            [
                11942,
                11972
            ],
            [
                11972,
                12058
            ],
            [
                12058,
                12136
            ],
            [
                12136,
                12190
            ],
            [
                12190,
                12349
            ],
            [
                12349,
                12419
            ],
            [
                12419,
                12454
            ],
            [
                12454,
                12506
            ],
            [
                12506,
                12562
            ],
            [
                12562,
                12587
            ],
            [
                12587,
                12611
            ],
            [
                12611,
                12713
            ],
            [
                12713,
                12780
            ],
            [
                12780,
                12824
            ],
            [
                12824,
                12927
            ],
            [
                12927,
                12992
            ],
            [
                12992,
                13025
            ],
            [
                13025,
                13065
            ],
            [
                13065,
                13076
            ],
            [
                13076,
                13098
            ],
            [
                13098,
                13252
            ],
            [
                13252,
                13261
            ],
            [
                13261,
                13278
            ],
            [
                13278,
                13304
            ],
            [
                13304,
                13335
            ],
            [
                13335,
                13413
            ],
            [
                13413,
                13460
            ],
            [
                13460,
                13508
            ],
            [
                13508,
                13577
            ],
            [
                13577,
                13708
            ],
            [
                13708,
                13776
            ],
            [
                13776,
                13803
            ],
            [
                13803,
                13860
            ],
            [
                13860,
                13933
            ],
            [
                13933,
                14064
            ],
            [
                14064,
                14169
            ],
            [
                14169,
                14216
            ],
            [
                14216,
                14276
            ],
            [
                14276,
                14383
            ],
            [
                14383,
                14456
            ],
            [
                14456,
                14500
            ],
            [
                14500,
                14592
            ],
            [
                14592,
                14648
            ],
            [
                14648,
                14696
            ],
            [
                14696,
                14779
            ],
            [
                14779,
                14940
            ],
            [
                14940,
                15007
            ],
            [
                15007,
                15093
            ],
            [
                15093,
                15198
            ],
            [
                15198,
                15376
            ],
            [
                15376,
                15456
            ],
            [
                15456,
                15642
            ],
            [
                15642,
                15690
            ],
            [
                15690,
                15710
            ],
            [
                15710,
                15737
            ],
            [
                15737,
                15759
            ],
            [
                15759,
                15824
            ],
            [
                15824,
                15995
            ],
            [
                15995,
                16119
            ],
            [
                16119,
                16149
            ],
            [
                16149,
                16196
            ],
            [
                16196,
                16226
            ],
            [
                16226,
                16252
            ],
            [
                16252,
                16283
            ],
            [
                16283,
                16313
            ],
            [
                16313,
                16332
            ],
            [
                16332,
                16353
            ],
            [
                16353,
                16465
            ],
            [
                16465,
                16481
            ],
            [
                16481,
                16509
            ],
            [
                16509,
                16560
            ],
            [
                16560,
                16622
            ],
            [
                16622,
                16726
            ],
            [
                16726,
                16772
            ],
            [
                16772,
                16789
            ],
            [
                16789,
                16837
            ],
            [
                16837,
                16884
            ],
            [
                16884,
                17025
            ],
            [
                17025,
                17219
            ],
            [
                17219,
                17359
            ],
            [
                17359,
                17500
            ],
            [
                17500,
                17571
            ],
            [
                17571,
                17619
            ],
            [
                17619,
                17677
            ],
            [
                17677,
                17870
            ],
            [
                17870,
                17889
            ],
            [
                17889,
                17927
            ],
            [
                17927,
                17955
            ],
            [
                17955,
                17981
            ],
            [
                17981,
                18041
            ],
            [
                18041,
                18114
            ],
            [
                18114,
                18144
            ],
            [
                18144,
                18185
            ],
            [
                18185,
                18295
            ],
            [
                18295,
                18377
            ],
            [
                18377,
                18393
            ],
            [
                18393,
                18433
            ],
            [
                18433,
                18514
            ],
            [
                18514,
                18639
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                46,
                150
            ],
            [
                243,
                246
            ],
            [
                160,
                165
            ],
            [
                247,
                275
            ],
            [
                306,
                308
            ],
            [
                308,
                311
            ],
            [
                332,
                345
            ],
            [
                324,
                327
            ],
            [
                346,
                355
            ],
            [
                356,
                419
            ],
            [
                524,
                548
            ],
            [
                558,
                560
            ],
            [
                560,
                564
            ],
            [
                577,
                601
            ],
            [
                629,
                676
            ],
            [
                677,
                747
            ],
            [
                755,
                756
            ],
            [
                801,
                869
            ],
            [
                879,
                887
            ],
            [
                1173,
                1212
            ],
            [
                1282,
                1290
            ],
            [
                1372,
                1401
            ],
            [
                1445,
                1493
            ],
            [
                1497,
                1504
            ],
            [
                1556,
                1586
            ],
            [
                1586,
                1611
            ],
            [
                1616,
                1709
            ],
            [
                1869,
                1871
            ],
            [
                1871,
                1901
            ],
            [
                1909,
                1910
            ],
            [
                1912,
                1928
            ],
            [
                1986,
                1988
            ],
            [
                2192,
                2194
            ],
            [
                2186,
                2191
            ],
            [
                2366,
                2369
            ],
            [
                2234,
                2265
            ],
            [
                2278,
                2339
            ],
            [
                2348,
                2352
            ],
            [
                2162,
                2165
            ],
            [
                2407,
                2415
            ],
            [
                2224,
                2227
            ],
            [
                2391,
                2392
            ],
            [
                2204,
                2207
            ],
            [
                2436,
                2596
            ],
            [
                2607,
                2614
            ],
            [
                2616,
                2651
            ],
            [
                2651,
                2672
            ],
            [
                2692,
                2748
            ],
            [
                2763,
                2801
            ],
            [
                2813,
                2831
            ],
            [
                2843,
                2889
            ],
            [
                2904,
                2905
            ],
            [
                3125,
                3127
            ],
            [
                3079,
                3084
            ],
            [
                3131,
                3213
            ],
            [
                3241,
                3244
            ],
            [
                3244,
                3246
            ],
            [
                3497,
                3506
            ],
            [
                3531,
                3549
            ],
            [
                3549,
                3562
            ],
            [
                3618,
                3637
            ],
            [
                3640,
                3659
            ],
            [
                3690,
                3763
            ],
            [
                3768,
                3773
            ],
            [
                3776,
                3795
            ],
            [
                3847,
                3872
            ],
            [
                3900,
                3924
            ],
            [
                3924,
                3947
            ],
            [
                3957,
                4008
            ],
            [
                4048,
                4053
            ],
            [
                4013,
                4021
            ],
            [
                4054,
                4093
            ],
            [
                4111,
                4136
            ],
            [
                4136,
                4139
            ],
            [
                4211,
                4220
            ],
            [
                4231,
                4283
            ],
            [
                4335,
                4337
            ],
            [
                4346,
                4378
            ],
            [
                4378,
                4399
            ],
            [
                4417,
                4422
            ],
            [
                4437,
                4453
            ],
            [
                4455,
                4467
            ],
            [
                4542,
                4578
            ],
            [
                4578,
                4601
            ],
            [
                4615,
                4673
            ],
            [
                4746,
                4748
            ],
            [
                4708,
                4710
            ],
            [
                4689,
                4691
            ],
            [
                4759,
                4788
            ],
            [
                4818,
                4857
            ],
            [
                4871,
                4873
            ],
            [
                4980,
                5031
            ],
            [
                5042,
                5050
            ],
            [
                5053,
                5086
            ],
            [
                4973,
                4974
            ],
            [
                5088,
                5090
            ],
            [
                5270,
                5285
            ],
            [
                5220,
                5225
            ],
            [
                5050,
                5051
            ],
            [
                5398,
                5405
            ],
            [
                5406,
                5458
            ],
            [
                5469,
                5505
            ],
            [
                5670,
                5728
            ],
            [
                5751,
                5811
            ],
            [
                5811,
                5844
            ],
            [
                5846,
                5884
            ],
            [
                5893,
                5944
            ],
            [
                5995,
                6066
            ],
            [
                6066,
                6087
            ],
            [
                6091,
                6099
            ],
            [
                6088,
                6090
            ],
            [
                6100,
                6103
            ],
            [
                6104,
                6108
            ],
            [
                6130,
                6132
            ],
            [
                6385,
                6441
            ],
            [
                6486,
                6550
            ],
            [
                6712,
                6713
            ],
            [
                6659,
                6695
            ],
            [
                6697,
                6704
            ],
            [
                6759,
                6763
            ],
            [
                6793,
                6831
            ],
            [
                6839,
                6845
            ],
            [
                6895,
                6902
            ],
            [
                6873,
                6892
            ],
            [
                6931,
                6954
            ],
            [
                7044,
                7047
            ],
            [
                7112,
                7114
            ],
            [
                7283,
                7361
            ],
            [
                7370,
                7380
            ],
            [
                7391,
                7406
            ],
            [
                7413,
                7415
            ],
            [
                7420,
                7427
            ],
            [
                7441,
                7443
            ],
            [
                7465,
                7519
            ],
            [
                7519,
                7527
            ],
            [
                7577,
                7582
            ],
            [
                7586,
                7592
            ],
            [
                7553,
                7564
            ],
            [
                7598,
                7603
            ],
            [
                7699,
                7703
            ],
            [
                7713,
                7727
            ],
            [
                7798,
                7871
            ],
            [
                7900,
                7902
            ],
            [
                7902,
                7944
            ],
            [
                7958,
                7963
            ],
            [
                7971,
                7981
            ],
            [
                8307,
                8316
            ],
            [
                8325,
                8343
            ],
            [
                8415,
                8421
            ],
            [
                8422,
                8428
            ],
            [
                8343,
                8348
            ],
            [
                8451,
                8468
            ],
            [
                8484,
                8491
            ],
            [
                8434,
                8435
            ],
            [
                8697,
                8709
            ],
            [
                8883,
                8887
            ],
            [
                8720,
                8742
            ],
            [
                8753,
                8757
            ],
            [
                8761,
                8801
            ],
            [
                8413,
                8414
            ],
            [
                8508,
                8510
            ],
            [
                8857,
                8870
            ],
            [
                8888,
                8941
            ],
            [
                8955,
                8967
            ],
            [
                8942,
                8954
            ],
            [
                9016,
                9018
            ],
            [
                9018,
                9039
            ],
            [
                9068,
                9096
            ],
            [
                9096,
                9137
            ],
            [
                9144,
                9149
            ],
            [
                9154,
                9156
            ],
            [
                9361,
                9430
            ],
            [
                9430,
                9459
            ],
            [
                9468,
                9505
            ],
            [
                9505,
                9544
            ],
            [
                9544,
                9578
            ],
            [
                9667,
                9721
            ],
            [
                9731,
                9785
            ],
            [
                10021,
                10100
            ],
            [
                10100,
                10129
            ],
            [
                10134,
                10146
            ],
            [
                10146,
                10178
            ],
            [
                10195,
                10198
            ],
            [
                10213,
                10252
            ],
            [
                10269,
                10271
            ],
            [
                10271,
                10285
            ],
            [
                10309,
                10311
            ],
            [
                10311,
                10354
            ],
            [
                10354,
                10386
            ],
            [
                10386,
                10387
            ],
            [
                10392,
                10396
            ],
            [
                10396,
                10423
            ],
            [
                10423,
                10452
            ],
            [
                10452,
                10501
            ],
            [
                10509,
                10512
            ],
            [
                10512,
                10550
            ],
            [
                10550,
                10572
            ],
            [
                10575,
                10576
            ],
            [
                10578,
                10590
            ],
            [
                10590,
                10659
            ],
            [
                10659,
                10686
            ],
            [
                10694,
                10758
            ],
            [
                10758,
                10847
            ],
            [
                10847,
                10903
            ],
            [
                10903,
                10935
            ],
            [
                10935,
                10956
            ],
            [
                10999,
                11023
            ],
            [
                11024,
                11079
            ],
            [
                11079,
                11121
            ],
            [
                11122,
                11130
            ],
            [
                11219,
                11226
            ],
            [
                11226,
                11234
            ],
            [
                11238,
                11301
            ],
            [
                11301,
                11317
            ],
            [
                11331,
                11395
            ],
            [
                11395,
                11442
            ],
            [
                11450,
                11477
            ],
            [
                11497,
                11506
            ],
            [
                11490,
                11493
            ],
            [
                11507,
                11546
            ],
            [
                11600,
                11603
            ],
            [
                11551,
                11557
            ],
            [
                11603,
                11605
            ],
            [
                11605,
                11612
            ],
            [
                11632,
                11687
            ],
            [
                11730,
                11750
            ],
            [
                11757,
                11767
            ],
            [
                11780,
                11784
            ],
            [
                11772,
                11776
            ],
            [
                11793,
                11794
            ],
            [
                11795,
                11816
            ],
            [
                11816,
                11819
            ],
            [
                11837,
                11839
            ],
            [
                11902,
                11942
            ],
            [
                11942,
                11972
            ],
            [
                11972,
                12014
            ],
            [
                12190,
                12224
            ],
            [
                12229,
                12249
            ],
            [
                12225,
                12228
            ],
            [
                12301,
                12348
            ],
            [
                12349,
                12361
            ],
            [
                12364,
                12390
            ],
            [
                12400,
                12419
            ],
            [
                12419,
                12454
            ],
            [
                12454,
                12506
            ],
            [
                12506,
                12562
            ],
            [
                12562,
                12587
            ],
            [
                12587,
                12611
            ],
            [
                12611,
                12617
            ],
            [
                12624,
                12629
            ],
            [
                12631,
                12645
            ],
            [
                12711,
                12713
            ],
            [
                12713,
                12779
            ],
            [
                12927,
                12992
            ],
            [
                12992,
                13025
            ],
            [
                13025,
                13037
            ],
            [
                13039,
                13065
            ],
            [
                13065,
                13076
            ],
            [
                13076,
                13098
            ],
            [
                13098,
                13099
            ],
            [
                13134,
                13162
            ],
            [
                13165,
                13252
            ],
            [
                13252,
                13261
            ],
            [
                13304,
                13333
            ],
            [
                13289,
                13294
            ],
            [
                13302,
                13303
            ],
            [
                13335,
                13342
            ],
            [
                13378,
                13413
            ],
            [
                13413,
                13460
            ],
            [
                13460,
                13508
            ],
            [
                13508,
                13523
            ],
            [
                13526,
                13577
            ],
            [
                13577,
                13707
            ],
            [
                13708,
                13776
            ],
            [
                13803,
                13860
            ],
            [
                13860,
                13913
            ],
            [
                13924,
                13933
            ],
            [
                13933,
                13975
            ],
            [
                13998,
                14035
            ],
            [
                14037,
                14062
            ],
            [
                14216,
                14276
            ],
            [
                14276,
                14360
            ],
            [
                14381,
                14383
            ],
            [
                14392,
                14418
            ],
            [
                14454,
                14455
            ],
            [
                14456,
                14500
            ],
            [
                14500,
                14592
            ],
            [
                14648,
                14665
            ],
            [
                14667,
                14696
            ],
            [
                14696,
                14779
            ],
            [
                14892,
                14925
            ],
            [
                14878,
                14886
            ],
            [
                14938,
                14940
            ],
            [
                14940,
                15007
            ],
            [
                15456,
                15522
            ],
            [
                15533,
                15556
            ],
            [
                15640,
                15642
            ],
            [
                15642,
                15690
            ],
            [
                15690,
                15710
            ],
            [
                15710,
                15720
            ],
            [
                15735,
                15737
            ],
            [
                15737,
                15759
            ],
            [
                15759,
                15824
            ],
            [
                16150,
                16180
            ],
            [
                16183,
                16196
            ],
            [
                16196,
                16226
            ],
            [
                16226,
                16252
            ],
            [
                16252,
                16253
            ],
            [
                16259,
                16280
            ],
            [
                16357,
                16358
            ],
            [
                16364,
                16377
            ],
            [
                16382,
                16383
            ],
            [
                16385,
                16445
            ],
            [
                16456,
                16465
            ],
            [
                16465,
                16481
            ],
            [
                16481,
                16509
            ],
            [
                16509,
                16519
            ],
            [
                16531,
                16560
            ],
            [
                16622,
                16670
            ],
            [
                16789,
                16837
            ],
            [
                16837,
                16884
            ],
            [
                16884,
                16907
            ],
            [
                16963,
                16970
            ],
            [
                16989,
                17025
            ],
            [
                17025,
                17089
            ],
            [
                17217,
                17219
            ],
            [
                17225,
                17295
            ],
            [
                17324,
                17332
            ],
            [
                17357,
                17359
            ],
            [
                17359,
                17500
            ],
            [
                17500,
                17522
            ],
            [
                17571,
                17604
            ],
            [
                17619,
                17620
            ],
            [
                17639,
                17657
            ],
            [
                17675,
                17677
            ],
            [
                17677,
                17693
            ],
            [
                17732,
                17870
            ],
            [
                17870,
                17889
            ],
            [
                17889,
                17902
            ],
            [
                17904,
                17907
            ],
            [
                17911,
                17927
            ],
            [
                17927,
                17955
            ],
            [
                17955,
                17981
            ],
            [
                18013,
                18041
            ],
            [
                18041,
                18069
            ],
            [
                18071,
                18085
            ],
            [
                18112,
                18114
            ],
            [
                18185,
                18205
            ],
            [
                18210,
                18220
            ],
            [
                18249,
                18250
            ],
            [
                18244,
                18248
            ],
            [
                18251,
                18295
            ],
            [
                18295,
                18377
            ],
            [
                18377,
                18393
            ],
            [
                18393,
                18411
            ],
            [
                18514,
                18598
            ],
            [
                18638,
                18639
            ]
        ],
        "row_chars": [
            [
                0,
                308
            ],
            [
                308,
                560
            ],
            [
                560,
                677
            ],
            [
                677,
                887
            ],
            [
                887,
                1004
            ],
            [
                1004,
                1080
            ],
            [
                1080,
                1173
            ],
            [
                1173,
                1493
            ],
            [
                1493,
                1586
            ],
            [
                1586,
                1871
            ],
            [
                1871,
                1988
            ],
            [
                1988,
                2155
            ],
            [
                2155,
                2651
            ],
            [
                2651,
                2906
            ],
            [
                2906,
                3075
            ],
            [
                3075,
                3246
            ],
            [
                3246,
                3426
            ],
            [
                3426,
                3549
            ],
            [
                3549,
                3924
            ],
            [
                3924,
                4136
            ],
            [
                4136,
                4283
            ],
            [
                4283,
                4335
            ],
            [
                4335,
                4378
            ],
            [
                4378,
                4578
            ],
            [
                4578,
                4673
            ],
            [
                4673,
                4873
            ],
            [
                4873,
                4954
            ],
            [
                4954,
                5297
            ],
            [
                5297,
                5398
            ],
            [
                5398,
                5505
            ],
            [
                5505,
                5656
            ],
            [
                5656,
                5811
            ],
            [
                5811,
                5945
            ],
            [
                5945,
                6066
            ],
            [
                6066,
                6132
            ],
            [
                6132,
                6385
            ],
            [
                6385,
                6551
            ],
            [
                6551,
                6646
            ],
            [
                6646,
                6831
            ],
            [
                6831,
                7114
            ],
            [
                7114,
                7283
            ],
            [
                7283,
                7443
            ],
            [
                7443,
                7519
            ],
            [
                7519,
                7902
            ],
            [
                7902,
                7981
            ],
            [
                7981,
                8073
            ],
            [
                8073,
                8303
            ],
            [
                8303,
                9018
            ],
            [
                9018,
                9096
            ],
            [
                9096,
                9156
            ],
            [
                9156,
                9314
            ],
            [
                9314,
                9430
            ],
            [
                9430,
                9505
            ],
            [
                9505,
                9544
            ],
            [
                9544,
                9579
            ],
            [
                9579,
                9667
            ],
            [
                9667,
                9786
            ],
            [
                9786,
                9934
            ],
            [
                9934,
                10021
            ],
            [
                10021,
                10100
            ],
            [
                10100,
                10146
            ],
            [
                10146,
                10198
            ],
            [
                10198,
                10213
            ],
            [
                10213,
                10271
            ],
            [
                10271,
                10311
            ],
            [
                10311,
                10354
            ],
            [
                10354,
                10386
            ],
            [
                10386,
                10396
            ],
            [
                10396,
                10423
            ],
            [
                10423,
                10452
            ],
            [
                10452,
                10512
            ],
            [
                10512,
                10550
            ],
            [
                10550,
                10590
            ],
            [
                10590,
                10659
            ],
            [
                10659,
                10758
            ],
            [
                10758,
                10847
            ],
            [
                10847,
                10903
            ],
            [
                10903,
                10935
            ],
            [
                10935,
                10956
            ],
            [
                10956,
                10999
            ],
            [
                10999,
                11079
            ],
            [
                11079,
                11133
            ],
            [
                11133,
                11174
            ],
            [
                11174,
                11219
            ],
            [
                11219,
                11226
            ],
            [
                11226,
                11301
            ],
            [
                11301,
                11395
            ],
            [
                11395,
                11605
            ],
            [
                11605,
                11795
            ],
            [
                11795,
                11816
            ],
            [
                11816,
                11839
            ],
            [
                11839,
                11852
            ],
            [
                11852,
                11857
            ],
            [
                11857,
                11868
            ],
            [
                11868,
                11902
            ],
            [
                11902,
                11942
            ],
            [
                11942,
                11972
            ],
            [
                11972,
                12058
            ],
            [
                12058,
                12136
            ],
            [
                12136,
                12190
            ],
            [
                12190,
                12349
            ],
            [
                12349,
                12419
            ],
            [
                12419,
                12454
            ],
            [
                12454,
                12506
            ],
            [
                12506,
                12562
            ],
            [
                12562,
                12587
            ],
            [
                12587,
                12611
            ],
            [
                12611,
                12713
            ],
            [
                12713,
                12780
            ],
            [
                12780,
                12824
            ],
            [
                12824,
                12927
            ],
            [
                12927,
                12992
            ],
            [
                12992,
                13025
            ],
            [
                13025,
                13065
            ],
            [
                13065,
                13076
            ],
            [
                13076,
                13098
            ],
            [
                13098,
                13252
            ],
            [
                13252,
                13261
            ],
            [
                13261,
                13278
            ],
            [
                13278,
                13335
            ],
            [
                13335,
                13413
            ],
            [
                13413,
                13460
            ],
            [
                13460,
                13508
            ],
            [
                13508,
                13577
            ],
            [
                13577,
                13708
            ],
            [
                13708,
                13776
            ],
            [
                13776,
                13803
            ],
            [
                13803,
                13860
            ],
            [
                13860,
                13933
            ],
            [
                13933,
                14064
            ],
            [
                14064,
                14169
            ],
            [
                14169,
                14216
            ],
            [
                14216,
                14276
            ],
            [
                14276,
                14383
            ],
            [
                14383,
                14456
            ],
            [
                14456,
                14500
            ],
            [
                14500,
                14592
            ],
            [
                14592,
                14648
            ],
            [
                14648,
                14696
            ],
            [
                14696,
                14779
            ],
            [
                14779,
                14940
            ],
            [
                14940,
                15007
            ],
            [
                15007,
                15093
            ],
            [
                15093,
                15198
            ],
            [
                15198,
                15376
            ],
            [
                15376,
                15456
            ],
            [
                15456,
                15642
            ],
            [
                15642,
                15690
            ],
            [
                15690,
                15710
            ],
            [
                15710,
                15737
            ],
            [
                15737,
                15759
            ],
            [
                15759,
                15824
            ],
            [
                15824,
                15995
            ],
            [
                15995,
                16119
            ],
            [
                16119,
                16149
            ],
            [
                16149,
                16196
            ],
            [
                16196,
                16226
            ],
            [
                16226,
                16252
            ],
            [
                16252,
                16283
            ],
            [
                16283,
                16313
            ],
            [
                16313,
                16332
            ],
            [
                16332,
                16353
            ],
            [
                16353,
                16465
            ],
            [
                16465,
                16481
            ],
            [
                16481,
                16509
            ],
            [
                16509,
                16560
            ],
            [
                16560,
                16622
            ],
            [
                16622,
                16726
            ],
            [
                16726,
                16772
            ],
            [
                16772,
                16789
            ],
            [
                16789,
                16837
            ],
            [
                16837,
                16884
            ],
            [
                16884,
                17025
            ],
            [
                17025,
                17219
            ],
            [
                17219,
                17359
            ],
            [
                17359,
                17500
            ],
            [
                17500,
                17571
            ],
            [
                17571,
                17619
            ],
            [
                17619,
                17677
            ],
            [
                17677,
                17870
            ],
            [
                17870,
                17889
            ],
            [
                17889,
                17927
            ],
            [
                17927,
                17955
            ],
            [
                17955,
                17981
            ],
            [
                17981,
                18041
            ],
            [
                18041,
                18114
            ],
            [
                18114,
                18144
            ],
            [
                18144,
                18185
            ],
            [
                18185,
                18295
            ],
            [
                18295,
                18377
            ],
            [
                18377,
                18393
            ],
            [
                18393,
                18433
            ],
            [
                18433,
                18514
            ],
            [
                18514,
                18639
            ]
        ]
    },
    "abridged": {
        "text": "Hetta Carbury, having made up her mind that she had been unjust to her lover, wrote to him a letter full of penitence and love, bidding him come back to her. But unfortunately she addressed it to the Beargarden, as he had written to her from that club; and the letter never reached him. When he returned to London he supposed that she had refused even to notice his appeal.\nHe was, however, determined that he would still make further struggles, even though Mrs. Hurtle, Roger Carbury, and Hetta's mother were, he thought, all hostile to him. But Hetta had owned that she loved him, and Paul still felt instinctively that his prospects could not be altogether hopeless. Yet how should he carry on the fight? The writing of letters is a one-sided, troublesome proceeding, when the person to whom they are written will not answer.\nBut Hetta had written a second letter, not to her lover. As Roger was the head of her family, and her friend, and entitled in some special way to know all that she did, she wrote to him. She told him that she had made a mistake about Paul, that she was convinced that Paul had always behaved to her with absolute sincerity, and, in short, that Paul was the dearest and most ill-used of human beings. In her enthusiasm she declared that there could be no other chance of happiness for her than that of becoming Paul's wife, and beseeched her dearest friend Roger not to turn against her, but to lend her aid.\nAs Roger sat on the garden wall at Carbury, with his cousin's letter in his hand, her words affected him heavily. There was no hope for himself. Though he was incapable of change - though he could not look forward to even a passive enjoyment of life without the girl whom he loved - yet he told himself directly and plainly that he must do without her. He had let time slip by too fast and too far before he had ventured to love, and must now make the best he could of such a broken life as was left to him. But how should he treat the man and woman who had reduced him so low?\nIf possible he would be unselfish. He could not, indeed, think kindly of Paul Montague; he could not forgive the man's supposed treason. But he did tell himself that in comparison with Hetta the man was nothing to him. He wanted to be able to assure Hetta that she should still be dear to him as a friend. Hetta's child must take the name of Carbury, and must be his heir - as near as possible his own child, in place of the wretched Felix,\nIn such a case Carbury must be the home of the married couple, if he could induce them to make it so. Though he should never again be able to love Paul Montague, he must live with him for her sake on affectionate terms. He must forgive Hetta altogether, as though there had been no fault; and strive to forgive the man's fault as best he might.\nPassionately fond as he was of justice, yet he did not know how to be just himself. He could not see that in truth he had not been betrayed. Nevertheless, when he rose from the wall he had resolved that Paul Montague should be treated as though he were pardoned.\nHowever, he wrote no answer to Hetta's letter - perhaps feeling that it would deprive him of his last chance. Her letter did not require an immediate answer; she had simply told him how things now stood. Roger's influence with her mother was the assistance which Hetta really wanted, and that could hardly be done by writing. Roger determined that he would again go up to London. He would think it all over on the journey, and then see the people themselves, before he finally committed himself to the abandonment of his own hopes.\nHe went up to town, and I do not know that hours of thinking helped him much. To follow an argument to an end is not easy or common, and it was hardly within Roger's capabilities. As he walked that night round the square near his hotel, looking up at the bright moon, he asked himself why he should wish to interfere with the happiness of two much younger human beings. But he had had a bath by then, and had eaten his dinner.\nThe next morning he was in Welbeck Street early. He was at once shown into the drawing-room, where Hetta was sitting. She hurried up to him, and he took her in his arms and kissed her. He had never done such a thing before. He had never even kissed her hand.\nHer instinct told her immediately that such a greeting was a sign of affectionate compliance with her wishes.\n\"Oh, Roger, I am so glad to see you,\" she said, escaping gently from his arms.\n\"I could not write an answer, so I came.\"\n\"You always do the kindest thing.\"\n\"I don't know that I can do anything now. It is all done. Hetta, you have been all the world to me.\"\n\"Do not reproach me,\" she said.\n\"No. Why should I reproach you? You have committed no fault. I should not have come had I intended to reproach anyone.\"\n\"I love you so much for saying that.\"\n\"Let it be as you wish, if it must. I have made up my mind to bear it, and there shall be an end of it.\" As he said this he took her hand, and she put her head upon his shoulder and began to weep. \"And still you will be all the world to me,\" he continued, with his arm round her waist. \"As you will not be my wife, you shall be my daughter.\"\n\"I will be your sister, Roger.\"\n\"My daughter rather. I will hurry to grow old so that I may feel for you as the old feel for the young. And if you have a child, Hetta, he must be as my child. There! If there is anything that I can do to add to your happiness, I will do it. You must believe that to make you happy shall be the only enjoyment of my life.\"\nIt had been hardly possible for her to tell him that the man to whom he was surrendering her had not even condescended to answer her letter. And now, overcome by the tenderness of her cousin's affection, she did not know how to mention Paul's name.\n\"Have you seen him?\" she whispered.\n\"No; it is not for his sake that I am here.\"\n\"But you will be his friend?\"\n\"Your husband shall certainly be my friend.\" At that moment the door was opened. Lady Carbury entered and looked first at her daughter and then at Roger.\n\"I have come,\" said he, \"to signify my agreement to this marriage.\" Lady Carbury's face fell very low. \"I need not speak again of what were my own wishes. I have learned at last that it could not have been so.\"\n\"Why should you say so?\" exclaimed Lady Carbury.\n\"Pray, mamma-,\" Hetta began.\n\"I do not know that it need be so at all,\" continued Lady Carbury.\n\"I look upon her as engaged to marry Paul Montague,\" said Roger.\n\"Not at all,\" said Lady Carbury.\n\"Yes; mamma, yes,\" cried Hetta boldly. \"It is so. I am engaged to him.\"\n\"It is not so with my consent - nor, as far as I can understand at present, with the consent of Mr. Montague himself.\"\n\"Mamma!\"\n\"The consent of Paul Montague!\" exclaimed Roger. \"I think there can be no doubt as to that.\"\n\"There has been a quarrel,\" said Lady Carbury.\n\"Surely he has not quarrelled with you, Hetta?\"\n\"I wrote to him - and he has not answered me,\" said Hetta piteously.\nThen Lady Carbury gave a full and somewhat coloured account of what had taken place, while Roger listened with admirable patience.\n\"The marriage is on every account objectionable,\" she said at last. \"His conduct with regard to that woman has been very bad. He has been sadly mixed up with that wretched man who killed himself. And now, when Henrietta has written to him in opposition to my express commands, he takes no notice of her.\"\nHetta was now seated on a sofa hiding her face and weeping. Roger stood perfectly still, listening with respectful silence till Lady Carbury had finished. Then he was slow to answer.\n\"I think I had better see him,\" he replied. \"If, as I imagine, he has not received my cousin's letter, that matter will be set at rest. As to his income, that I think may be managed. His connection with Mr. Melmotte was unfortunate, but was due to no fault of his.\" He was too generous to say a word about Felix and Marie Melmotte. \"I will see him, Lady Carbury, and then I will come to you again.\"\nIt was late that evening before Roger found Paul Montague, who had just returned from Liverpool.\n\"I don't know what letter you mean,\" said Paul.\n\"You wrote to her?\"\n\"Certainly. I wrote to her twice. My last letter was one which I think she ought to have answered. But I have not had a line from her - not a word!\"\n\"She did answer your letter.\"\n\"What did she say to me?\"\n\"You must ask her that. But I can tell you this; that she wrote to you as a girl writes to the lover whom she wishes to see.\"\n\"Is that true?\" exclaimed Paul, jumping up.\n\"I am here to tell you that it is true. You may go to her, and need have nothing to fear. And now I wish you to hear what I have to say.\"\n\"Of course,\" said Paul, sitting down suddenly. Up to this moment Roger had not appeared as a joyous, sympathetic messenger. His face had been severe, and the tone of his voice almost harsh. Paul thought he would probably say very disagreeable things to him, which he must bear as patiently as he could.\n\"You know what my feelings have been,\" Roger began, \"and how deeply I have resented what I thought to be an interference with my affections. But no quarrel between us-\"\n\"I have never quarrelled with you.\"\n\"Listen to me for a moment. No anger between us should be allowed to interfere with the happiness of her whom I suppose we both love better than all the rest of the world put together.\"\n\"I do,\" said Paul.\n\"And so do I; and I always shall. But she is to be your wife. She shall be my daughter. Her child shall be my heir. My house shall be her house, if you and she agree. You may now count on my assistance as if I were a father giving you a daughter in marriage. I do this because I will make the happiness of her life the chief object of mine. Now good night. Don't say anything just now.\"\nHaving so spoken he hurried out of the room, leaving Paul Montague bewildered by the news.",
        "paragraph_chars": [
            [
                0,
                374
            ],
            [
                374,
                829
            ],
            [
                829,
                1437
            ],
            [
                1437,
                2015
            ],
            [
                2015,
                2456
            ],
            [
                2456,
                2801
            ],
            [
                2801,
                3064
            ],
            [
                3064,
                3596
            ],
            [
                3596,
                4023
            ],
            [
                4023,
                4282
            ],
            [
                4282,
                4392
            ],
            [
                4392,
                4471
            ],
            [
                4471,
                4513
            ],
            [
                4513,
                4548
            ],
            [
                4548,
                4649
            ],
            [
                4649,
                4681
            ],
            [
                4681,
                4801
            ],
            [
                4801,
                4839
            ],
            [
                4839,
                5181
            ],
            [
                5181,
                5213
            ],
            [
                5213,
                5536
            ],
            [
                5536,
                5785
            ],
            [
                5785,
                5821
            ],
            [
                5821,
                5866
            ],
            [
                5866,
                5896
            ],
            [
                5896,
                6050
            ],
            [
                6050,
                6261
            ],
            [
                6261,
                6310
            ],
            [
                6310,
                6339
            ],
            [
                6339,
                6406
            ],
            [
                6406,
                6471
            ],
            [
                6471,
                6504
            ],
            [
                6504,
                6576
            ],
            [
                6576,
                6695
            ],
            [
                6695,
                6704
            ],
            [
                6704,
                6797
            ],
            [
                6797,
                6844
            ],
            [
                6844,
                6892
            ],
            [
                6892,
                6961
            ],
            [
                6961,
                7092
            ],
            [
                7092,
                7397
            ],
            [
                7397,
                7580
            ],
            [
                7580,
                7979
            ],
            [
                7979,
                8076
            ],
            [
                8076,
                8124
            ],
            [
                8124,
                8144
            ],
            [
                8144,
                8293
            ],
            [
                8293,
                8323
            ],
            [
                8323,
                8349
            ],
            [
                8349,
                8475
            ],
            [
                8475,
                8519
            ],
            [
                8519,
                8657
            ],
            [
                8657,
                8960
            ],
            [
                8960,
                9129
            ],
            [
                9129,
                9165
            ],
            [
                9165,
                9351
            ],
            [
                9351,
                9370
            ],
            [
                9370,
                9757
            ],
            [
                9757,
                9847
            ]
        ],
        "segment_chars": [
            [
                0,
                158
            ],
            [
                158,
                287
            ],
            [
                287,
                374
            ],
            [
                374,
                543
            ],
            [
                543,
                670
            ],
            [
                670,
                708
            ],
            [
                708,
                829
            ],
            [
                829,
                886
            ],
            [
                886,
                1016
            ],
            [
                1016,
                1229
            ],
            [
                1229,
                1437
            ],
            [
                1437,
                1551
            ],
            [
                1551,
                1582
            ],
            [
                1582,
                1790
            ],
            [
                1790,
                1945
            ],
            [
                1945,
                2015
            ],
            [
                2015,
                2050
            ],
            [
                2050,
                2152
            ],
            [
                2152,
                2234
            ],
            [
                2234,
                2321
            ],
            [
                2321,
                2456
            ],
            [
                2456,
                2558
            ],
            [
                2558,
                2676
            ],
            [
                2676,
                2801
            ],
            [
                2801,
                2885
            ],
            [
                2885,
                2942
            ],
            [
                2942,
                3064
            ],
            [
                3064,
                3174
            ],
            [
                3174,
                3268
            ],
            [
                3268,
                3390
            ],
            [
                3390,
                3444
            ],
            [
                3444,
                3596
            ],
            [
                3596,
                3674
            ],
            [
                3674,
                3776
            ],
            [
                3776,
                3966
            ],
            [
                3966,
                4023
            ],
            [
                4023,
                4072
            ],
            [
                4072,
                4141
            ],
            [
                4141,
                4208
            ],
            [
                4208,
                4247
            ],
            [
                4247,
                4282
            ],
            [
                4282,
                4392
            ],
            [
                4392,
                4471
            ],
            [
                4471,
                4513
            ],
            [
                4513,
                4548
            ],
            [
                4548,
                4590
            ],
            [
                4590,
                4606
            ],
            [
                4606,
                4649
            ],
            [
                4649,
                4681
            ],
            [
                4681,
                4686
            ],
            [
                4686,
                4713
            ],
            [
                4713,
                4742
            ],
            [
                4742,
                4801
            ],
            [
                4801,
                4839
            ],
            [
                4839,
                4875
            ],
            [
                4875,
                4944
            ],
            [
                4944,
                5036
            ],
            [
                5036,
                5125
            ],
            [
                5125,
                5181
            ],
            [
                5181,
                5213
            ],
            [
                5213,
                5234
            ],
            [
                5234,
                5317
            ],
            [
                5317,
                5373
            ],
            [
                5373,
                5380
            ],
            [
                5380,
                5455
            ],
            [
                5455,
                5536
            ],
            [
                5536,
                5677
            ],
            [
                5677,
                5785
            ],
            [
                5785,
                5806
            ],
            [
                5806,
                5821
            ],
            [
                5821,
                5866
            ],
            [
                5866,
                5896
            ],
            [
                5896,
                5941
            ],
            [
                5941,
                5977
            ],
            [
                5977,
                6050
            ],
            [
                6050,
                6118
            ],
            [
                6118,
                6153
            ],
            [
                6153,
                6205
            ],
            [
                6205,
                6261
            ],
            [
                6261,
                6286
            ],
            [
                6286,
                6310
            ],
            [
                6310,
                6339
            ],
            [
                6339,
                6406
            ],
            [
                6406,
                6471
            ],
            [
                6471,
                6504
            ],
            [
                6504,
                6543
            ],
            [
                6543,
                6554
            ],
            [
                6554,
                6576
            ],
            [
                6576,
                6695
            ],
            [
                6695,
                6704
            ],
            [
                6704,
                6736
            ],
            [
                6736,
                6753
            ],
            [
                6753,
                6797
            ],
            [
                6797,
                6844
            ],
            [
                6844,
                6892
            ],
            [
                6892,
                6961
            ],
            [
                6961,
                7092
            ],
            [
                7092,
                7160
            ],
            [
                7160,
                7218
            ],
            [
                7218,
                7288
            ],
            [
                7288,
                7397
            ],
            [
                7397,
                7457
            ],
            [
                7457,
                7552
            ],
            [
                7552,
                7580
            ],
            [
                7580,
                7624
            ],
            [
                7624,
                7716
            ],
            [
                7716,
                7763
            ],
            [
                7763,
                7846
            ],
            [
                7846,
                7912
            ],
            [
                7912,
                7979
            ],
            [
                7979,
                8076
            ],
            [
                8076,
                8124
            ],
            [
                8124,
                8144
            ],
            [
                8144,
                8156
            ],
            [
                8156,
                8178
            ],
            [
                8178,
                8243
            ],
            [
                8243,
                8293
            ],
            [
                8293,
                8323
            ],
            [
                8323,
                8349
            ],
            [
                8349,
                8373
            ],
            [
                8373,
                8475
            ],
            [
                8475,
                8491
            ],
            [
                8491,
                8519
            ],
            [
                8519,
                8559
            ],
            [
                8559,
                8609
            ],
            [
                8609,
                8657
            ],
            [
                8657,
                8704
            ],
            [
                8704,
                8781
            ],
            [
                8781,
                8847
            ],
            [
                8847,
                8960
            ],
            [
                8960,
                9101
            ],
            [
                9101,
                9129
            ],
            [
                9129,
                9165
            ],
            [
                9165,
                9193
            ],
            [
                9193,
                9351
            ],
            [
                9351,
                9370
            ],
            [
                9370,
                9404
            ],
            [
                9404,
                9432
            ],
            [
                9432,
                9458
            ],
            [
                9458,
                9486
            ],
            [
                9486,
                9537
            ],
            [
                9537,
                9629
            ],
            [
                9629,
                9711
            ],
            [
                9711,
                9727
            ],
            [
                9727,
                9757
            ],
            [
                9757,
                9847
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                13,
                117
            ],
            [
                118,
                121
            ],
            [
                122,
                127
            ],
            [
                128,
                156
            ],
            [
                156,
                158
            ],
            [
                158,
                161
            ],
            [
                162,
                175
            ],
            [
                176,
                179
            ],
            [
                180,
                189
            ],
            [
                193,
                256
            ],
            [
                257,
                281
            ],
            [
                285,
                287
            ],
            [
                287,
                291
            ],
            [
                292,
                316
            ],
            [
                326,
                373
            ],
            [
                374,
                444
            ],
            [
                444,
                445
            ],
            [
                458,
                526
            ],
            [
                535,
                543
            ],
            [
                543,
                582
            ],
            [
                583,
                591
            ],
            [
                592,
                621
            ],
            [
                622,
                670
            ],
            [
                670,
                677
            ],
            [
                678,
                708
            ],
            [
                708,
                733
            ],
            [
                734,
                827
            ],
            [
                827,
                829
            ],
            [
                829,
                859
            ],
            [
                866,
                867
            ],
            [
                868,
                884
            ],
            [
                884,
                886
            ],
            [
                886,
                888
            ],
            [
                889,
                894
            ],
            [
                895,
                898
            ],
            [
                899,
                930
            ],
            [
                931,
                992
            ],
            [
                993,
                997
            ],
            [
                998,
                1001
            ],
            [
                1002,
                1010
            ],
            [
                1011,
                1014
            ],
            [
                1014,
                1015
            ],
            [
                1016,
                1019
            ],
            [
                1025,
                1185
            ],
            [
                1186,
                1193
            ],
            [
                1194,
                1229
            ],
            [
                1229,
                1250
            ],
            [
                1260,
                1316
            ],
            [
                1317,
                1355
            ],
            [
                1366,
                1384
            ],
            [
                1385,
                1431
            ],
            [
                1435,
                1436
            ],
            [
                1437,
                1439
            ],
            [
                1440,
                1445
            ],
            [
                1446,
                1528
            ],
            [
                1538,
                1541
            ],
            [
                1549,
                1551
            ],
            [
                1551,
                1560
            ],
            [
                1564,
                1582
            ],
            [
                1582,
                1595
            ],
            [
                1596,
                1615
            ],
            [
                1618,
                1637
            ],
            [
                1638,
                1711
            ],
            [
                1712,
                1717
            ],
            [
                1720,
                1739
            ],
            [
                1740,
                1765
            ],
            [
                1766,
                1790
            ],
            [
                1790,
                1813
            ],
            [
                1814,
                1865
            ],
            [
                1865,
                1870
            ],
            [
                1871,
                1879
            ],
            [
                1880,
                1919
            ],
            [
                1920,
                1945
            ],
            [
                1945,
                1948
            ],
            [
                1953,
                1962
            ],
            [
                1963,
                2015
            ],
            [
                2015,
                2017
            ],
            [
                2018,
                2050
            ],
            [
                2050,
                2071
            ],
            [
                2072,
                2077
            ],
            [
                2085,
                2101
            ],
            [
                2103,
                2115
            ],
            [
                2116,
                2152
            ],
            [
                2152,
                2175
            ],
            [
                2176,
                2234
            ],
            [
                2234,
                2236
            ],
            [
                2244,
                2246
            ],
            [
                2247,
                2249
            ],
            [
                2250,
                2279
            ],
            [
                2280,
                2319
            ],
            [
                2319,
                2321
            ],
            [
                2326,
                2377
            ],
            [
                2378,
                2386
            ],
            [
                2389,
                2422
            ],
            [
                2422,
                2423
            ],
            [
                2424,
                2426
            ],
            [
                2433,
                2448
            ],
            [
                2449,
                2454
            ],
            [
                2454,
                2455
            ],
            [
                2456,
                2463
            ],
            [
                2466,
                2518
            ],
            [
                2522,
                2558
            ],
            [
                2558,
                2616
            ],
            [
                2616,
                2676
            ],
            [
                2676,
                2709
            ],
            [
                2710,
                2748
            ],
            [
                2749,
                2800
            ],
            [
                2814,
                2885
            ],
            [
                2885,
                2906
            ],
            [
                2907,
                2915
            ],
            [
                2916,
                2918
            ],
            [
                2919,
                2922
            ],
            [
                2927,
                2931
            ],
            [
                2940,
                2942
            ],
            [
                2942,
                2998
            ],
            [
                2999,
                3063
            ],
            [
                3071,
                3072
            ],
            [
                3073,
                3109
            ],
            [
                3112,
                3119
            ],
            [
                3128,
                3132
            ],
            [
                3136,
                3174
            ],
            [
                3178,
                3184
            ],
            [
                3185,
                3192
            ],
            [
                3201,
                3220
            ],
            [
                3222,
                3245
            ],
            [
                3257,
                3260
            ],
            [
                3266,
                3268
            ],
            [
                3268,
                3346
            ],
            [
                3346,
                3356
            ],
            [
                3357,
                3372
            ],
            [
                3378,
                3380
            ],
            [
                3381,
                3388
            ],
            [
                3388,
                3390
            ],
            [
                3390,
                3444
            ],
            [
                3444,
                3452
            ],
            [
                3453,
                3458
            ],
            [
                3459,
                3465
            ],
            [
                3474,
                3485
            ],
            [
                3485,
                3490
            ],
            [
                3491,
                3495
            ],
            [
                3496,
                3510
            ],
            [
                3521,
                3594
            ],
            [
                3594,
                3596
            ],
            [
                3596,
                3638
            ],
            [
                3639,
                3644
            ],
            [
                3664,
                3674
            ],
            [
                3674,
                3683
            ],
            [
                3687,
                3705
            ],
            [
                3706,
                3712
            ],
            [
                3721,
                3727
            ],
            [
                3727,
                3732
            ],
            [
                3736,
                3753
            ],
            [
                3754,
                3761
            ],
            [
                3774,
                3775
            ],
            [
                3776,
                3788
            ],
            [
                3789,
                3793
            ],
            [
                3794,
                3816
            ],
            [
                3817,
                3821
            ],
            [
                3822,
                3862
            ],
            [
                3862,
                3863
            ],
            [
                3864,
                3866
            ],
            [
                3867,
                3880
            ],
            [
                3885,
                3938
            ],
            [
                3939,
                3951
            ],
            [
                3952,
                3964
            ],
            [
                3964,
                3966
            ],
            [
                3966,
                3987
            ],
            [
                3995,
                4023
            ],
            [
                4023,
                4064
            ],
            [
                4065,
                4070
            ],
            [
                4070,
                4072
            ],
            [
                4072,
                4141
            ],
            [
                4141,
                4170
            ],
            [
                4171,
                4208
            ],
            [
                4208,
                4247
            ],
            [
                4247,
                4281
            ],
            [
                4282,
                4336
            ],
            [
                4337,
                4391
            ],
            [
                4392,
                4471
            ],
            [
                4471,
                4500
            ],
            [
                4501,
                4513
            ],
            [
                4513,
                4545
            ],
            [
                4545,
                4548
            ],
            [
                4549,
                4588
            ],
            [
                4588,
                4590
            ],
            [
                4590,
                4604
            ],
            [
                4604,
                4606
            ],
            [
                4606,
                4649
            ],
            [
                4649,
                4681
            ],
            [
                4681,
                4682
            ],
            [
                4682,
                4686
            ],
            [
                4686,
                4713
            ],
            [
                4713,
                4742
            ],
            [
                4742,
                4791
            ],
            [
                4798,
                4801
            ],
            [
                4801,
                4839
            ],
            [
                4839,
                4861
            ],
            [
                4861,
                4862
            ],
            [
                4863,
                4875
            ],
            [
                4875,
                4944
            ],
            [
                4944,
                4971
            ],
            [
                4972,
                5036
            ],
            [
                5036,
                5125
            ],
            [
                5125,
                5181
            ],
            [
                5181,
                5213
            ],
            [
                5213,
                5234
            ],
            [
                5234,
                5258
            ],
            [
                5262,
                5317
            ],
            [
                5317,
                5359
            ],
            [
                5363,
                5371
            ],
            [
                5373,
                5380
            ],
            [
                5380,
                5388
            ],
            [
                5392,
                5455
            ],
            [
                5455,
                5471
            ],
            [
                5472,
                5536
            ],
            [
                5536,
                5583
            ],
            [
                5584,
                5611
            ],
            [
                5612,
                5621
            ],
            [
                5621,
                5624
            ],
            [
                5625,
                5664
            ],
            [
                5665,
                5668
            ],
            [
                5669,
                5675
            ],
            [
                5675,
                5677
            ],
            [
                5677,
                5684
            ],
            [
                5684,
                5739
            ],
            [
                5740,
                5760
            ],
            [
                5761,
                5771
            ],
            [
                5772,
                5776
            ],
            [
                5779,
                5783
            ],
            [
                5783,
                5784
            ],
            [
                5785,
                5806
            ],
            [
                5806,
                5809
            ],
            [
                5819,
                5821
            ],
            [
                5826,
                5866
            ],
            [
                5866,
                5896
            ],
            [
                5896,
                5938
            ],
            [
                5941,
                5975
            ],
            [
                5977,
                5997
            ],
            [
                5998,
                6001
            ],
            [
                6002,
                6049
            ],
            [
                6050,
                6062
            ],
            [
                6062,
                6088
            ],
            [
                6099,
                6118
            ],
            [
                6118,
                6153
            ],
            [
                6153,
                6205
            ],
            [
                6205,
                6261
            ],
            [
                6261,
                6286
            ],
            [
                6286,
                6310
            ],
            [
                6310,
                6316
            ],
            [
                6317,
                6322
            ],
            [
                6323,
                6337
            ],
            [
                6337,
                6339
            ],
            [
                6339,
                6405
            ],
            [
                6406,
                6471
            ],
            [
                6471,
                6504
            ],
            [
                6504,
                6516
            ],
            [
                6517,
                6543
            ],
            [
                6543,
                6554
            ],
            [
                6554,
                6576
            ],
            [
                6576,
                6577
            ],
            [
                6577,
                6605
            ],
            [
                6608,
                6695
            ],
            [
                6695,
                6704
            ],
            [
                6704,
                6733
            ],
            [
                6746,
                6751
            ],
            [
                6751,
                6752
            ],
            [
                6754,
                6761
            ],
            [
                6762,
                6797
            ],
            [
                6797,
                6844
            ],
            [
                6844,
                6892
            ],
            [
                6892,
                6907
            ],
            [
                6910,
                6961
            ],
            [
                6961,
                7091
            ],
            [
                7092,
                7160
            ],
            [
                7161,
                7218
            ],
            [
                7218,
                7271
            ],
            [
                7279,
                7288
            ],
            [
                7288,
                7330
            ],
            [
                7331,
                7368
            ],
            [
                7369,
                7394
            ],
            [
                7397,
                7457
            ],
            [
                7457,
                7541
            ],
            [
                7550,
                7552
            ],
            [
                7552,
                7578
            ],
            [
                7578,
                7579
            ],
            [
                7580,
                7624
            ],
            [
                7624,
                7716
            ],
            [
                7716,
                7733
            ],
            [
                7734,
                7763
            ],
            [
                7763,
                7846
            ],
            [
                7846,
                7879
            ],
            [
                7902,
                7910
            ],
            [
                7910,
                7912
            ],
            [
                7912,
                7979
            ],
            [
                7979,
                8045
            ],
            [
                8051,
                8074
            ],
            [
                8074,
                8076
            ],
            [
                8076,
                8124
            ],
            [
                8124,
                8144
            ],
            [
                8144,
                8154
            ],
            [
                8154,
                8156
            ],
            [
                8156,
                8178
            ],
            [
                8178,
                8243
            ],
            [
                8247,
                8277
            ],
            [
                8280,
                8293
            ],
            [
                8293,
                8323
            ],
            [
                8323,
                8349
            ],
            [
                8349,
                8350
            ],
            [
                8350,
                8371
            ],
            [
                8377,
                8378
            ],
            [
                8383,
                8396
            ],
            [
                8396,
                8397
            ],
            [
                8398,
                8458
            ],
            [
                8466,
                8475
            ],
            [
                8475,
                8491
            ],
            [
                8491,
                8519
            ],
            [
                8519,
                8529
            ],
            [
                8530,
                8559
            ],
            [
                8559,
                8607
            ],
            [
                8609,
                8657
            ],
            [
                8657,
                8704
            ],
            [
                8704,
                8727
            ],
            [
                8728,
                8735
            ],
            [
                8745,
                8781
            ],
            [
                8781,
                8845
            ],
            [
                8845,
                8847
            ],
            [
                8863,
                8933
            ],
            [
                8950,
                8958
            ],
            [
                8958,
                8960
            ],
            [
                8960,
                9101
            ],
            [
                9101,
                9123
            ],
            [
                9129,
                9162
            ],
            [
                9165,
                9166
            ],
            [
                9173,
                9191
            ],
            [
                9191,
                9193
            ],
            [
                9193,
                9209
            ],
            [
                9213,
                9351
            ],
            [
                9351,
                9370
            ],
            [
                9370,
                9383
            ],
            [
                9384,
                9387
            ],
            [
                9388,
                9404
            ],
            [
                9404,
                9432
            ],
            [
                9432,
                9458
            ],
            [
                9458,
                9486
            ],
            [
                9486,
                9514
            ],
            [
                9515,
                9529
            ],
            [
                9535,
                9537
            ],
            [
                9537,
                9557
            ],
            [
                9561,
                9571
            ],
            [
                9578,
                9579
            ],
            [
                9580,
                9584
            ],
            [
                9585,
                9629
            ],
            [
                9629,
                9711
            ],
            [
                9711,
                9727
            ],
            [
                9727,
                9745
            ],
            [
                9757,
                9841
            ],
            [
                9846,
                9847
            ]
        ],
        "row_chars": [
            [
                0,
                158
            ],
            [
                158,
                287
            ],
            [
                287,
                374
            ],
            [
                374,
                543
            ],
            [
                543,
                543
            ],
            [
                543,
                543
            ],
            [
                543,
                543
            ],
            [
                543,
                670
            ],
            [
                670,
                708
            ],
            [
                708,
                829
            ],
            [
                829,
                886
            ],
            [
                886,
                886
            ],
            [
                886,
                1229
            ],
            [
                1229,
                1437
            ],
            [
                1437,
                1437
            ],
            [
                1437,
                1551
            ],
            [
                1551,
                1551
            ],
            [
                1551,
                1582
            ],
            [
                1582,
                1790
            ],
            [
                1790,
                1945
            ],
            [
                1945,
                2015
            ],
            [
                2015,
                2015
            ],
            [
                2015,
                2050
            ],
            [
                2050,
                2152
            ],
            [
                2152,
                2234
            ],
            [
                2234,
                2321
            ],
            [
                2321,
                2321
            ],
            [
                2321,
                2456
            ],
            [
                2456,
                2456
            ],
            [
                2456,
                2558
            ],
            [
                2558,
                2558
            ],
            [
                2558,
                2676
            ],
            [
                2676,
                2801
            ],
            [
                2801,
                2885
            ],
            [
                2885,
                2942
            ],
            [
                2942,
                2942
            ],
            [
                2942,
                3064
            ],
            [
                3064,
                3064
            ],
            [
                3064,
                3174
            ],
            [
                3174,
                3268
            ],
            [
                3268,
                3268
            ],
            [
                3268,
                3390
            ],
            [
                3390,
                3444
            ],
            [
                3444,
                3596
            ],
            [
                3596,
                3674
            ],
            [
                3674,
                3674
            ],
            [
                3674,
                3674
            ],
            [
                3674,
                3966
            ],
            [
                3966,
                4023
            ],
            [
                4023,
                4072
            ],
            [
                4072,
                4072
            ],
            [
                4072,
                4141
            ],
            [
                4141,
                4208
            ],
            [
                4208,
                4247
            ],
            [
                4247,
                4282
            ],
            [
                4282,
                4282
            ],
            [
                4282,
                4392
            ],
            [
                4392,
                4392
            ],
            [
                4392,
                4392
            ],
            [
                4392,
                4471
            ],
            [
                4471,
                4513
            ],
            [
                4513,
                4548
            ],
            [
                4548,
                4548
            ],
            [
                4548,
                4590
            ],
            [
                4590,
                4606
            ],
            [
                4606,
                4649
            ],
            [
                4649,
                4681
            ],
            [
                4681,
                4686
            ],
            [
                4686,
                4713
            ],
            [
                4713,
                4742
            ],
            [
                4742,
                4801
            ],
            [
                4801,
                4839
            ],
            [
                4839,
                4875
            ],
            [
                4875,
                4944
            ],
            [
                4944,
                5036
            ],
            [
                5036,
                5125
            ],
            [
                5125,
                5181
            ],
            [
                5181,
                5213
            ],
            [
                5213,
                5234
            ],
            [
                5234,
                5234
            ],
            [
                5234,
                5317
            ],
            [
                5317,
                5373
            ],
            [
                5373,
                5373
            ],
            [
                5373,
                5373
            ],
            [
                5373,
                5380
            ],
            [
                5380,
                5455
            ],
            [
                5455,
                5536
            ],
            [
                5536,
                5677
            ],
            [
                5677,
                5785
            ],
            [
                5785,
                5806
            ],
            [
                5806,
                5821
            ],
            [
                5821,
                5821
            ],
            [
                5821,
                5821
            ],
            [
                5821,
                5821
            ],
            [
                5821,
                5821
            ],
            [
                5821,
                5866
            ],
            [
                5866,
                5896
            ],
            [
                5896,
                5941
            ],
            [
                5941,
                5941
            ],
            [
                5941,
                5941
            ],
            [
                5941,
                6050
            ],
            [
                6050,
                6118
            ],
            [
                6118,
                6153
            ],
            [
                6153,
                6205
            ],
            [
                6205,
                6261
            ],
            [
                6261,
                6286
            ],
            [
                6286,
                6310
            ],
            [
                6310,
                6339
            ],
            [
                6339,
                6406
            ],
            [
                6406,
                6406
            ],
            [
                6406,
                6406
            ],
            [
                6406,
                6471
            ],
            [
                6471,
                6504
            ],
            [
                6504,
                6543
            ],
            [
                6543,
                6554
            ],
            [
                6554,
                6576
            ],
            [
                6576,
                6695
            ],
            [
                6695,
                6704
            ],
            [
                6704,
                6704
            ],
            [
                6704,
                6753
            ],
            [
                6753,
                6797
            ],
            [
                6797,
                6844
            ],
            [
                6844,
                6892
            ],
            [
                6892,
                6961
            ],
            [
                6961,
                7092
            ],
            [
                7092,
                7160
            ],
            [
                7160,
                7160
            ],
            [
                7160,
                7218
            ],
            [
                7218,
                7288
            ],
            [
                7288,
                7397
            ],
            [
                7397,
                7397
            ],
            [
                7397,
                7397
            ],
            [
                7397,
                7457
            ],
            [
                7457,
                7552
            ],
            [
                7552,
                7580
            ],
            [
                7580,
                7624
            ],
            [
                7624,
                7716
            ],
            [
                7716,
                7716
            ],
            [
                7716,
                7763
            ],
            [
                7763,
                7846
            ],
            [
                7846,
                7912
            ],
            [
                7912,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                8076
            ],
            [
                8076,
                8124
            ],
            [
                8124,
                8144
            ],
            [
                8144,
                8156
            ],
            [
                8156,
                8178
            ],
            [
                8178,
                8243
            ],
            [
                8243,
                8243
            ],
            [
                8243,
                8243
            ],
            [
                8243,
                8243
            ],
            [
                8243,
                8293
            ],
            [
                8293,
                8323
            ],
            [
                8323,
                8349
            ],
            [
                8349,
                8373
            ],
            [
                8373,
                8373
            ],
            [
                8373,
                8373
            ],
            [
                8373,
                8373
            ],
            [
                8373,
                8475
            ],
            [
                8475,
                8491
            ],
            [
                8491,
                8519
            ],
            [
                8519,
                8559
            ],
            [
                8559,
                8559
            ],
            [
                8559,
                8609
            ],
            [
                8609,
                8609
            ],
            [
                8609,
                8609
            ],
            [
                8609,
                8657
            ],
            [
                8657,
                8704
            ],
            [
                8704,
                8781
            ],
            [
                8781,
                8847
            ],
            [
                8847,
                8960
            ],
            [
                8960,
                9101
            ],
            [
                9101,
                9129
            ],
            [
                9129,
                9165
            ],
            [
                9165,
                9193
            ],
            [
                9193,
                9351
            ],
            [
                9351,
                9370
            ],
            [
                9370,
                9404
            ],
            [
                9404,
                9432
            ],
            [
                9432,
                9458
            ],
            [
                9458,
                9486
            ],
            [
                9486,
                9537
            ],
            [
                9537,
                9537
            ],
            [
                9537,
                9537
            ],
            [
                9537,
                9629
            ],
            [
                9629,
                9711
            ],
            [
                9711,
                9727
            ],
            [
                9727,
                9757
            ],
            [
                9757,
                9757
            ],
            [
                9757,
                9847
            ]
        ]
    }
}