{
    "original": {
        "text": "We must now go back a little in our story,--about three weeks,--in order that the reader may be told how affairs were progressing at the Beargarden. That establishment had received a terrible blow in the defection of Herr Vossner. It was not only that he had robbed the club, and robbed every member of the club who had ventured to have personal dealings with him. Although a bad feeling in regard to him was no doubt engendered in the minds of those who had suffered deeply, it was not that alone which cast an almost funereal gloom over the club. The sorrow was in this,--that with Herr Vossner all their comforts had gone. Of course Herr Vossner had been a thief. That no doubt had been known to them from the beginning. A man does not consent to be called out of bed at all hours in the morning to arrange the gambling accounts of young gentlemen without being a thief. No one concerned with Herr Vossner had supposed him to be an honest man. But then as a thief he had been so comfortable that his absence was regretted with a tenderness almost amounting to love even by those who had suffered most severely from his rapacity. Dolly Longestaffe had been robbed more outrageously than any other member of the club, and yet Dolly Longestaffe had said since the departure of the purveyor that London was not worth living in now that Herr Vossner was gone. In a week the Beargarden collapsed,--as Germany would collapse for a period if Herr Vossner's great compatriot were suddenly to remove himself from the scene; but as Germany would strive to live even without Bismarck, so did the club make its new efforts. But here the parallel must cease. Germany no doubt would at last succeed, but the Beargarden had received a blow from which it seemed that there was no recovery. At first it was proposed that three men should be appointed as trustees,--trustees for paying Vossner's debts, trustees for borrowing more money, trustees for the satisfaction of the landlord who was beginning to be anxious as to his future rent. At a certain very triumphant general meeting of the club it was determined that such a plan should be arranged, and the members assembled were unanimous. It was at first thought that there might be a little jealousy as to the trusteeship. The club was so popular and the authority conveyed by the position would be so great, that A, B, and C might feel aggrieved at seeing so much power conferred on D, E, and F. When at the meeting above mentioned one or two names were suggested, the final choice was postponed, as a matter of detail to be arranged privately, rather from this consideration than with any idea that there might be a difficulty in finding adequate persons. But even the leading members of the Beargarden hesitated when the proposition was submitted to them with all its honours and all its responsibilities. Lord Nidderdale declared from the beginning that he would have nothing to do with it,--pleading his poverty openly. Beauchamp Beauclerk was of opinion that he himself did not frequent the club often enough. Mr. Lupton professed his inability as a man of business. Lord Grasslough pleaded his father. The club from the first had been sure of Dolly Longestaffe's services;--for were not Dolly's pecuniary affairs now in process of satisfactory arrangement, and was it not known by all men that his courage never failed him in regard to money? But even he declined. \"I have spoken to Squercum,\" he said to the Committee, \"and Squercum won't hear of it. Squercum has made inquiries and he thinks the club very shaky.\" When one of the Committee made a remark as to Mr. Squercum which was not complimentary,--insinuated indeed that Squercum without injustice might be consigned to the infernal deities,--Dolly took the matter up warmly. \"That's all very well for you, Grasslough; but if you knew the comfort of having a fellow who could keep you straight without preaching sermons at you you wouldn't despise Squercum. I've tried to go alone and I find that does not answer. Squercum's my coach, and I mean to stick pretty close to him.\" Then it came to pass that the triumphant project as to the trustees fell to the ground, although Squercum himself advised that the difficulty might be lessened if three gentlemen could be selected who lived well before the world and yet had nothing to lose. Whereupon Dolly suggested Miles Grendall. But the Committee shook its heads, not thinking it possible that the club could be re-established on a basis of three Miles Grendalls.\nThen dreadful rumours were heard. The Beargarden must surely be abandoned. \"It is such a pity,\" said Nidderdale, \"because there never has been anything like it.\"\n\"Smoke all over the house!\" said Dolly.\n\"No horrid nonsense about closing,\" said Grasslough, \"and no infernal old fogies wearing out the carpets and paying for nothing.\"\n\"Not a vestige of propriety, or any beastly rules to be kept! That's what I liked,\" said Nidderdale.\n\"It's an old story,\" said Mr. Lupton, \"that if you put a man into Paradise he'll make it too hot to hold him. That's what you've done here.\"\n\"What we ought to do,\" said Dolly, who was pervaded by a sense of his own good fortune in regard to Squercum, \"is to get some fellow like Vossner, and make him tell us how much he wants to steal above his regular pay. Then we could subscribe that among us. I really think that might be done. Squercum would find a fellow, no doubt.\" But Mr. Lupton was of opinion that the new Vossner might perhaps not know, when thus consulted, the extent of his own cupidity.\nOne day, before the Whitstable marriage, when it was understood that the club would actually be closed on the 12th August unless some new heaven-inspired idea might be forthcoming for its salvation, Nidderdale, Grasslough, and Dolly were hanging about the hall and the steps, and drinking sherry and bitters preparatory to dinner, when Sir Felix Carbury came round the neighbouring corner and, in a creeping, hesitating fashion, entered the hall door. He had nearly recovered from his wounds, though he still wore a bit of court plaster on his upper lip, and had not yet learned to look or to speak as though he had not had two of his front teeth knocked out. He had heard little or nothing of what had been done at the Beargarden since Vossner's defection. It was now a month since he had been seen at the club. His thrashing had been the wonder of perhaps half nine days, but latterly his existence had been almost forgotten. Now, with difficulty, he had summoned courage to go down to his old haunt, so completely had he been cowed by the latter circumstances of his life; but he had determined that he would pluck up his courage, and talk to his old associates as though no evil thing had befallen him. He had still money enough to pay for his dinner and to begin a small rubber of whist. If fortune should go against him he might glide into I. O. U.'s;--as others had done before, so much to his cost. \"By George, here's Carbury!\" said Dolly. Lord Grasslough whistled, turned his back, and walked up-stairs; but Nidderdale and Dolly consented to have their hands shaken by the stranger.\n\"Thought you were out of town,\" said Nidderdale. \"Haven't seen you for the last ever so long.\"\n\"I have been out of town,\" said Felix,--lying; \"down in Suffolk. But I'm back now. How are things going on here?\"\n\"They're not going at all;--they're gone,\" said Dolly.\n\"Everything is smashed,\" said Nidderdale. \"We shall all have to pay, I don't know how much.\"\n\"Wasn't Vossner ever caught?\" asked the baronet.\n\"Caught!\" ejaculated Dolly. \"No;--but he has caught us. I don't know that there has ever been much idea of catching Vossner. We close altogether next Monday, and the furniture is to be gone to law for. Flatfleece says it belongs to him under what he calls a deed of sale. Indeed, everything that everybody has seems to belong to Flatfleece. He's always in and out of the club, and has got the key of the cellar.\"\n\"That don't matter,\" said Nidderdale, \"as Vossner took care that there shouldn't be any wine.\"\n\"He's got most of the forks and spoons, and only lets us use what we have as a favour.\"\n\"I suppose one can get a dinner here?\"\n\"Yes; to-day you can, and perhaps to-morrow.\"\n\"Isn't there any playing?\" asked Felix with dismay.\n\"I haven't seen a card this fortnight,\" said Dolly. \"There hasn't been anybody to play. Everything has gone to the dogs. There has been the affair of Melmotte, you know;--though, I suppose, you do know all about that.\"\n\"Of course I know he poisoned himself.\"\n\"Of course that had effect,\" said Dolly, continuing his history. \"Though why fellows shouldn't play cards because another fellow like that takes poison, I can't understand. Last year the only day I managed to get down in February, the hounds didn't come because some old cove had died. What harm could our hunting have done him? I call that rot.\"\n\"Melmotte's death was rather awful,\" said Nidderdale.\n\"Not half so awful as having nothing to amuse one. And now they say the girl is going to be married to Fisker. I don't know how you and Nidderdale like that. I never went in for her myself. Squercum never seemed to see it.\"\n\"Poor dear!\" said Nidderdale. \"She's welcome for me, and I dare say she couldn't do better with herself. I was very fond of her;--I'll be shot if I wasn't.\"\n\"And Carbury too, I suppose,\" said Dolly.\n\"No; I wasn't. If I'd really been fond of her I suppose it would have come off. I should have had her safe enough to America, if I'd cared about it.\" This was Sir Felix's view of the matter.\n\"Come into the smoking-room, Dolly,\" said Nidderdale. \"I can stand most things, and I try to stand everything; but, by George, that fellow is such a cad that I cannot stand him. You and I are bad enough,--but I don't think we're so heartless as Carbury.\"\n\"I don't think I'm heartless at all,\" said Dolly. \"I'm good-natured to everybody that is good-natured to me,--and to a great many people who ain't. I'm going all the way down to Caversham next week to see my sister married, though I hate the place and hate marriages, and if I was to be hung for it I couldn't say a word to the fellow who is going to be my brother-in-law. But I do agree about Carbury. It's very hard to be good-natured to him.\"\nBut, in the teeth of these adverse opinions Sir Felix managed to get his dinner-table close to theirs and to tell them at dinner something of his future prospects. He was going to travel and see the world. He had, according to his own account, completely run through London life and found that it was all barren.\n\"In life I've rung all changes through, Run every pleasure down, 'Midst each excess of folly too, And lived with half the town.\"\nSir Felix did not exactly quote the old song, probably having never heard the words. But that was the burden of his present story. It was his determination to seek new scenes, and in search of them to travel over the greater part of the known world.\n\"How jolly for you!\" said Dolly.\n\"It will be a change, you know.\"\n\"No end of a change. Is any one going with you?\"\n\"Well;--yes. I've got a travelling companion;--a very pleasant fellow, who knows a lot, and will be able to coach me up in things. There's a deal to be learned by going abroad, you know.\"\n\"A sort of a tutor,\" said Nidderdale.\n\"A parson, I suppose,\" said Dolly.\n\"Well;--he is a clergyman. Who told you?\"\n\"It's only my inventive genius. Well;--yes; I should say that would be nice,--travelling about Europe with a clergyman. I shouldn't get enough advantage out of it to make it pay, but I fancy it will just suit you.\"\n\"It's an expensive sort of thing;--isn't it?\" asked Nidderdale.\n\"Well;--it does cost something. But I've got so sick of this kind of life;--and then that railway Board coming to an end, and the club smashing up, and--\"\n\"Marie Melmotte marrying Fisker,\" suggested Dolly.\n\"That too, if you will. But I want a change, and a change I mean to have. I've seen this side of things, and now I'll have a look at the other.\"\n\"Didn't you have a row in the street with some one the other day?\" This question was asked very abruptly by Lord Grasslough, who, though he was sitting near them, had not yet joined in the conversation, and who had not before addressed a word to Sir Felix. \"We heard something about it, but we never got the right story.\" Nidderdale glanced across the table at Dolly, and Dolly whistled. Grasslough looked at the man he addressed as one does look when one expects an answer. Mr. Lupton, with whom Grasslough was dining, also sat expectant. Dolly and Nidderdale were both silent.\nIt was the fear of this that had kept Sir Felix away from the club. Grasslough, as he had told himself, was just the fellow to ask such a question,--ill-natured, insolent, and obtrusive. But the question demanded an answer of some kind. \"Yes,\" said he; \"a fellow attacked me in the street, coming behind me when I had a girl with me. He didn't get much the best of it though.\"\n\"Oh;--didn't he?\" said Grasslough. \"I think, upon the whole, you know, you're right about going abroad.\"\n\"What business is it of yours?\" asked the baronet.\n\"Well;--as the club is being broken up, I don't know that it is very much the business of any of us.\"\n\"I was speaking to my friends, Lord Nidderdale and Mr. Longestaffe, and not to you.\"\n\"I quite appreciate the advantage of the distinction,\" said Lord Grasslough, \"and am sorry for Lord Nidderdale and Mr. Longestaffe.\"\n\"What do you mean by that?\" said Sir Felix, rising from his chair. His present opponent was not horrible to him as had been John Crumb, as men in clubs do not now often knock each others' heads or draw swords one upon another.\n\"Don't let's have a quarrel here,\" said Mr. Lupton. \"I shall leave the room if you do.\"\n\"If we must break up, let us break up in peace and quietness,\" said Nidderdale.\n\"Of course, if there is to be a fight, I'm good to go out with anybody,\" said Dolly. \"When there's any beastly thing to be done, I've always got to do it. But don't you think that kind of thing is a little slow?\"\n\"Who began it?\" said Sir Felix, sitting down again. Whereupon Lord Grasslough, who had finished his dinner, walked out of the room. \"That fellow is always wanting to quarrel.\"\n\"There's one comfort, you know,\" said Dolly. \"It wants two men to make a quarrel.\"\n\"Yes; it does,\" said Sir Felix, taking this as a friendly observation; \"and I'm not going to be fool enough to be one of them.\"\n\"Oh, yes, I meant it fast enough,\" said Grasslough afterwards up in the card-room. The other men who had been together had quickly followed him, leaving Sir Felix alone, and they had collected themselves there not with the hope of play, but thinking that they would be less interrupted than in the smoking-room. \"I don't suppose we shall ever any of us be here again, and as he did come in I thought I would tell him my mind.\"\n\"What's the use of taking such a lot of trouble?\" said Dolly. \"Of course he's a bad fellow. Most fellows are bad fellows in one way or another.\"\n\"But he's bad all round,\" said the bitter enemy.\n\"And so this is to be the end of the Beargarden,\" said Lord Nidderdale with a peculiar melancholy. \"Dear old place! I always felt it was too good to last. I fancy it doesn't do to make things too easy;--one has to pay so uncommon dear for them! And then, you know, when you've got things easy, then they get rowdy;--and, by George, before you know where you are, you find yourself among a lot of blackguards. If one wants to keep one's self straight, one has to work hard at it, one way or the other. I suppose it all comes from the fall of Adam.\"\n\"If Solomon, Solon, and the Archbishop of Canterbury were rolled into one, they couldn't have spoken with more wisdom,\" said Mr. Lupton.\n\"Live and learn,\" continued the young lord. \"I don't think anybody has liked the Beargarden so much as I have, but I shall never try this kind of thing again. I shall begin reading blue books to-morrow, and shall dine at the Carlton. Next session I shan't miss a day in the House, and I'll bet anybody a fiver that I make a speech before Easter. I shall take to claret at 20_s._ a dozen, and shall go about London on the top of an omnibus.\"\n\"How about getting married?\" asked Dolly.\n\"Oh;--that must be as it comes. That's the governor's affair. None of you fellows will believe me, but, upon my word, I liked that girl; and I'd 've stuck to her at last,--only that there are some things a fellow can't do. He was such a thundering scoundrel!\"\nAfter a while Sir Felix followed them up-stairs, and entered the room as though nothing unpleasant had happened below. \"We can make up a rubber;--can't we?\" said he.\n\"I should say not,\" said Nidderdale.\n\"I shall not play,\" said Mr. Lupton.\n\"There isn't a pack of cards in the house,\" said Dolly. Lord Grasslough didn't condescend to say a word. Sir Felix sat down with his cigar in his mouth, and the others continued to smoke in silence.\n\"I wonder what has become of Miles Grendall,\" asked Sir Felix. But no one made any answer, and they smoked on in silence. \"He hasn't paid me a shilling yet of the money he owes me.\" Still there was not a word. \"And I don't suppose he ever will.\" There was another pause. \"He is the biggest scoundrel I ever met,\" said Sir Felix.\n\"I know one as big,\" said Lord Grasslough,--\"or, at any rate, as little.\"\nThere was another pause of a minute, and then Sir Felix left the room muttering something as to the stupidity of having no cards;--and so brought to an end his connection with his associates of the Beargarden. From that time forth he was never more seen by them,--or, if seen, was never known.\nThe other men remained there till well on into the night, although there was not the excitement of any special amusement to attract them. It was felt by them all that this was the end of the Beargarden, and, with a melancholy seriousness befitting the occasion, they whispered sad things in low voices, consoling themselves simply with tobacco. \"I never felt so much like crying in my life,\" said Dolly, as he asked for a glass of brandy-and-water at about midnight. \"Good-night, old fellows; good-bye. I'm going down to Caversham, and I shouldn't wonder if I didn't drown myself.\"\nHow Mr. Flatfleece went to law, and tried to sell the furniture, and threatened everybody, and at last singled out poor Dolly Longestaffe as his special victim; and how Dolly Longestaffe, by the aid of Mr. Squercum, utterly confounded Mr. Flatfleece, and brought that ingenious but unfortunate man, with his wife and small family, to absolute ruin, the reader will hardly expect to have told to him in detail in this chronicle.",
        "paragraph_chars": [
            [
                0,
                4515
            ],
            [
                4515,
                4677
            ],
            [
                4677,
                4717
            ],
            [
                4717,
                4847
            ],
            [
                4847,
                4948
            ],
            [
                4948,
                5089
            ],
            [
                5089,
                5550
            ],
            [
                5550,
                7142
            ],
            [
                7142,
                7237
            ],
            [
                7237,
                7351
            ],
            [
                7351,
                7406
            ],
            [
                7406,
                7499
            ],
            [
                7499,
                7548
            ],
            [
                7548,
                7961
            ],
            [
                7961,
                8056
            ],
            [
                8056,
                8144
            ],
            [
                8144,
                8183
            ],
            [
                8183,
                8229
            ],
            [
                8229,
                8281
            ],
            [
                8281,
                8500
            ],
            [
                8500,
                8540
            ],
            [
                8540,
                8887
            ],
            [
                8887,
                8941
            ],
            [
                8941,
                9165
            ],
            [
                9165,
                9322
            ],
            [
                9322,
                9364
            ],
            [
                9364,
                9555
            ],
            [
                9555,
                9810
            ],
            [
                9810,
                10256
            ],
            [
                10256,
                10569
            ],
            [
                10569,
                10698
            ],
            [
                10698,
                10948
            ],
            [
                10948,
                10981
            ],
            [
                10981,
                11014
            ],
            [
                11014,
                11063
            ],
            [
                11063,
                11251
            ],
            [
                11251,
                11289
            ],
            [
                11289,
                11324
            ],
            [
                11324,
                11366
            ],
            [
                11366,
                11581
            ],
            [
                11581,
                11645
            ],
            [
                11645,
                11800
            ],
            [
                11800,
                11851
            ],
            [
                11851,
                11996
            ],
            [
                11996,
                12575
            ],
            [
                12575,
                12952
            ],
            [
                12952,
                13057
            ],
            [
                13057,
                13108
            ],
            [
                13108,
                13210
            ],
            [
                13210,
                13295
            ],
            [
                13295,
                13428
            ],
            [
                13428,
                13655
            ],
            [
                13655,
                13743
            ],
            [
                13743,
                13823
            ],
            [
                13823,
                14036
            ],
            [
                14036,
                14212
            ],
            [
                14212,
                14295
            ],
            [
                14295,
                14423
            ],
            [
                14423,
                14850
            ],
            [
                14850,
                14995
            ],
            [
                14995,
                15044
            ],
            [
                15044,
                15592
            ],
            [
                15592,
                15729
            ],
            [
                15729,
                16170
            ],
            [
                16170,
                16212
            ],
            [
                16212,
                16472
            ],
            [
                16472,
                16638
            ],
            [
                16638,
                16675
            ],
            [
                16675,
                16712
            ],
            [
                16712,
                16911
            ],
            [
                16911,
                17240
            ],
            [
                17240,
                17314
            ],
            [
                17314,
                17608
            ],
            [
                17608,
                18190
            ],
            [
                18190,
                18617
            ]
        ],
        "segment_chars": [
            [
                0,
                149
            ],
            [
                149,
                231
            ],
            [
                231,
                365
            ],
            [
                365,
                549
            ],
            [
                549,
                626
            ],
            [
                626,
                667
            ],
            [
                667,
                724
            ],
            [
                724,
                874
            ],
            [
                874,
                947
            ],
            [
                947,
                1132
            ],
            [
                1132,
                1358
            ],
            [
                1358,
                1614
            ],
            [
                1614,
                1648
            ],
            [
                1648,
                1776
            ],
            [
                1776,
                2023
            ],
            [
                2023,
                2177
            ],
            [
                2177,
                2262
            ],
            [
                2262,
                2697
            ],
            [
                2697,
                2848
            ],
            [
                2848,
                2964
            ],
            [
                2964,
                3055
            ],
            [
                3055,
                3112
            ],
            [
                3112,
                3148
            ],
            [
                3148,
                3389
            ],
            [
                3389,
                3411
            ],
            [
                3411,
                3498
            ],
            [
                3498,
                3562
            ],
            [
                3562,
                3779
            ],
            [
                3779,
                3961
            ],
            [
                3961,
                4017
            ],
            [
                4017,
                4080
            ],
            [
                4080,
                4338
            ],
            [
                4338,
                4380
            ],
            [
                4380,
                4515
            ],
            [
                4515,
                4549
            ],
            [
                4549,
                4590
            ],
            [
                4590,
                4677
            ],
            [
                4677,
                4705
            ],
            [
                4705,
                4717
            ],
            [
                4717,
                4847
            ],
            [
                4847,
                4909
            ],
            [
                4909,
                4948
            ],
            [
                4948,
                5058
            ],
            [
                5058,
                5089
            ],
            [
                5089,
                5307
            ],
            [
                5307,
                5346
            ],
            [
                5346,
                5381
            ],
            [
                5381,
                5422
            ],
            [
                5422,
                5550
            ],
            [
                5550,
                6002
            ],
            [
                6002,
                6210
            ],
            [
                6210,
                6308
            ],
            [
                6308,
                6363
            ],
            [
                6363,
                6478
            ],
            [
                6478,
                6757
            ],
            [
                6757,
                6843
            ],
            [
                6843,
                6902
            ],
            [
                6902,
                6904
            ],
            [
                6904,
                6957
            ],
            [
                6957,
                6986
            ],
            [
                6986,
                6998
            ],
            [
                6998,
                7142
            ],
            [
                7142,
                7191
            ],
            [
                7191,
                7237
            ],
            [
                7237,
                7302
            ],
            [
                7302,
                7320
            ],
            [
                7320,
                7351
            ],
            [
                7351,
                7406
            ],
            [
                7406,
                7448
            ],
            [
                7448,
                7499
            ],
            [
                7499,
                7529
            ],
            [
                7529,
                7548
            ],
            [
                7548,
                7558
            ],
            [
                7558,
                7576
            ],
            [
                7576,
                7604
            ],
            [
                7604,
                7673
            ],
            [
                7673,
                7750
            ],
            [
                7750,
                7820
            ],
            [
                7820,
                7889
            ],
            [
                7889,
                7961
            ],
            [
                7961,
                8056
            ],
            [
                8056,
                8144
            ],
            [
                8144,
                8183
            ],
            [
                8183,
                8229
            ],
            [
                8229,
                8256
            ],
            [
                8256,
                8281
            ],
            [
                8281,
                8333
            ],
            [
                8333,
                8369
            ],
            [
                8369,
                8402
            ],
            [
                8402,
                8500
            ],
            [
                8500,
                8540
            ],
            [
                8540,
                8605
            ],
            [
                8605,
                8713
            ],
            [
                8713,
                8826
            ],
            [
                8826,
                8869
            ],
            [
                8869,
                8887
            ],
            [
                8887,
                8941
            ],
            [
                8941,
                8992
            ],
            [
                8992,
                9052
            ],
            [
                9052,
                9099
            ],
            [
                9099,
                9131
            ],
            [
                9131,
                9165
            ],
            [
                9165,
                9178
            ],
            [
                9178,
                9195
            ],
            [
                9195,
                9270
            ],
            [
                9270,
                9322
            ],
            [
                9322,
                9364
            ],
            [
                9364,
                9379
            ],
            [
                9379,
                9444
            ],
            [
                9444,
                9514
            ],
            [
                9514,
                9555
            ],
            [
                9555,
                9609
            ],
            [
                9609,
                9733
            ],
            [
                9733,
                9810
            ],
            [
                9810,
                9860
            ],
            [
                9860,
                9958
            ],
            [
                9958,
                10183
            ],
            [
                10183,
                10213
            ],
            [
                10213,
                10256
            ],
            [
                10256,
                10420
            ],
            [
                10420,
                10462
            ],
            [
                10462,
                10569
            ],
            [
                10569,
                10698
            ],
            [
                10698,
                10783
            ],
            [
                10783,
                10829
            ],
            [
                10829,
                10948
            ],
            [
                10948,
                10969
            ],
            [
                10969,
                10981
            ],
            [
                10981,
                11014
            ],
            [
                11014,
                11035
            ],
            [
                11035,
                11063
            ],
            [
                11063,
                11076
            ],
            [
                11076,
                11194
            ],
            [
                11194,
                11251
            ],
            [
                11251,
                11289
            ],
            [
                11289,
                11324
            ],
            [
                11324,
                11351
            ],
            [
                11351,
                11366
            ],
            [
                11366,
                11398
            ],
            [
                11398,
                11486
            ],
            [
                11486,
                11581
            ],
            [
                11581,
                11627
            ],
            [
                11627,
                11645
            ],
            [
                11645,
                11677
            ],
            [
                11677,
                11800
            ],
            [
                11800,
                11851
            ],
            [
                11851,
                11875
            ],
            [
                11875,
                11925
            ],
            [
                11925,
                11996
            ],
            [
                11996,
                12063
            ],
            [
                12063,
                12253
            ],
            [
                12253,
                12318
            ],
            [
                12318,
                12384
            ],
            [
                12384,
                12471
            ],
            [
                12471,
                12536
            ],
            [
                12536,
                12575
            ],
            [
                12575,
                12643
            ],
            [
                12643,
                12762
            ],
            [
                12762,
                12812
            ],
            [
                12812,
                12909
            ],
            [
                12909,
                12952
            ],
            [
                12952,
                12970
            ],
            [
                12970,
                12987
            ],
            [
                12987,
                13057
            ],
            [
                13057,
                13089
            ],
            [
                13089,
                13108
            ],
            [
                13108,
                13210
            ],
            [
                13210,
                13295
            ],
            [
                13295,
                13428
            ],
            [
                13428,
                13456
            ],
            [
                13456,
                13495
            ],
            [
                13495,
                13655
            ],
            [
                13655,
                13707
            ],
            [
                13707,
                13743
            ],
            [
                13743,
                13823
            ],
            [
                13823,
                13908
            ],
            [
                13908,
                13978
            ],
            [
                13978,
                14036
            ],
            [
                14036,
                14052
            ],
            [
                14052,
                14088
            ],
            [
                14088,
                14168
            ],
            [
                14168,
                14212
            ],
            [
                14212,
                14257
            ],
            [
                14257,
                14295
            ],
            [
                14295,
                14423
            ],
            [
                14423,
                14506
            ],
            [
                14506,
                14735
            ],
            [
                14735,
                14850
            ],
            [
                14850,
                14900
            ],
            [
                14900,
                14912
            ],
            [
                14912,
                14942
            ],
            [
                14942,
                14995
            ],
            [
                14995,
                15044
            ],
            [
                15044,
                15143
            ],
            [
                15143,
                15160
            ],
            [
                15160,
                15199
            ],
            [
                15199,
                15289
            ],
            [
                15289,
                15453
            ],
            [
                15453,
                15545
            ],
            [
                15545,
                15592
            ],
            [
                15592,
                15729
            ],
            [
                15729,
                15773
            ],
            [
                15773,
                15888
            ],
            [
                15888,
                15963
            ],
            [
                15963,
                16075
            ],
            [
                16075,
                16170
            ],
            [
                16170,
                16199
            ],
            [
                16199,
                16212
            ],
            [
                16212,
                16244
            ],
            [
                16244,
                16274
            ],
            [
                16274,
                16435
            ],
            [
                16435,
                16472
            ],
            [
                16472,
                16591
            ],
            [
                16591,
                16629
            ],
            [
                16629,
                16638
            ],
            [
                16638,
                16675
            ],
            [
                16675,
                16712
            ],
            [
                16712,
                16768
            ],
            [
                16768,
                16817
            ],
            [
                16817,
                16911
            ],
            [
                16911,
                16974
            ],
            [
                16974,
                17033
            ],
            [
                17033,
                17093
            ],
            [
                17093,
                17121
            ],
            [
                17121,
                17157
            ],
            [
                17157,
                17182
            ],
            [
                17182,
                17240
            ],
            [
                17240,
                17314
            ],
            [
                17314,
                17524
            ],
            [
                17524,
                17608
            ],
            [
                17608,
                17746
            ],
            [
                17746,
                17953
            ],
            [
                17953,
                18075
            ],
            [
                18075,
                18111
            ],
            [
                18111,
                18190
            ],
            [
                18190,
                18617
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                44,
                61
            ],
            [
                29,
                42
            ],
            [
                73,
                149
            ],
            [
                149,
                231
            ],
            [
                231,
                319
            ],
            [
                337,
                365
            ],
            [
                549,
                563
            ],
            [
                564,
                571
            ],
            [
                574,
                626
            ],
            [
                626,
                667
            ],
            [
                874,
                880
            ],
            [
                909,
                947
            ],
            [
                947,
                950
            ],
            [
                956,
                1067
            ],
            [
                1130,
                1132
            ],
            [
                1132,
                1232
            ],
            [
                1249,
                1253
            ],
            [
                1290,
                1357
            ],
            [
                1692,
                1776
            ],
            [
                1776,
                1805
            ],
            [
                1839,
                1847
            ],
            [
                1816,
                1835
            ],
            [
                1986,
                1988
            ],
            [
                1870,
                1885
            ],
            [
                1910,
                1920
            ],
            [
                2021,
                2023
            ],
            [
                2697,
                2700
            ],
            [
                2706,
                2709
            ],
            [
                2718,
                2753
            ],
            [
                2810,
                2821
            ],
            [
                2830,
                2848
            ],
            [
                2848,
                2872
            ],
            [
                2892,
                2932
            ],
            [
                2962,
                2964
            ],
            [
                3055,
                3112
            ],
            [
                3112,
                3148
            ],
            [
                3393,
                3397
            ],
            [
                3189,
                3206
            ],
            [
                3401,
                3410
            ],
            [
                3411,
                3498
            ],
            [
                5090,
                5109
            ],
            [
                5200,
                5307
            ],
            [
                5307,
                5344
            ],
            [
                5422,
                5443
            ],
            [
                5444,
                5550
            ],
            [
                5619,
                5633
            ],
            [
                5643,
                5747
            ],
            [
                5550,
                5557
            ],
            [
                5747,
                5805
            ],
            [
                5819,
                5825
            ],
            [
                5830,
                5857
            ],
            [
                5559,
                5565
            ],
            [
                5873,
                5908
            ],
            [
                5949,
                5957
            ],
            [
                5909,
                5918
            ],
            [
                5932,
                5948
            ],
            [
                5959,
                5969
            ],
            [
                5977,
                5990
            ],
            [
                5996,
                6002
            ],
            [
                6002,
                6052
            ],
            [
                6109,
                6139
            ],
            [
                6143,
                6210
            ],
            [
                6210,
                6229
            ],
            [
                6241,
                6243
            ],
            [
                6266,
                6280
            ],
            [
                6308,
                6314
            ],
            [
                6319,
                6363
            ],
            [
                6363,
                6399
            ],
            [
                6418,
                6423
            ],
            [
                6451,
                6477
            ],
            [
                6478,
                6551
            ],
            [
                6684,
                6699
            ],
            [
                6704,
                6724
            ],
            [
                6567,
                6570
            ],
            [
                6752,
                6756
            ],
            [
                6957,
                6986
            ],
            [
                6986,
                6998
            ],
            [
                6998,
                7051
            ],
            [
                7061,
                7087
            ],
            [
                7112,
                7117
            ],
            [
                7140,
                7142
            ],
            [
                7142,
                7191
            ],
            [
                7191,
                7212
            ],
            [
                7222,
                7237
            ],
            [
                7237,
                7249
            ],
            [
                7285,
                7300
            ],
            [
                7261,
                7263
            ],
            [
                7269,
                7274
            ],
            [
                7300,
                7302
            ],
            [
                7320,
                7351
            ],
            [
                7351,
                7377
            ],
            [
                7379,
                7406
            ],
            [
                7406,
                7448
            ],
            [
                7448,
                7499
            ],
            [
                7499,
                7529
            ],
            [
                7529,
                7548
            ],
            [
                7548,
                7558
            ],
            [
                7569,
                7576
            ],
            [
                7576,
                7579
            ],
            [
                7602,
                7604
            ],
            [
                7673,
                7704
            ],
            [
                7748,
                7750
            ],
            [
                7750,
                7765
            ],
            [
                7769,
                7820
            ],
            [
                7820,
                7838
            ],
            [
                7858,
                7889
            ],
            [
                7889,
                7961
            ],
            [
                7961,
                8056
            ],
            [
                8144,
                8166
            ],
            [
                8169,
                8183
            ],
            [
                8183,
                8188
            ],
            [
                8196,
                8216
            ],
            [
                8226,
                8229
            ],
            [
                8229,
                8256
            ],
            [
                8256,
                8281
            ],
            [
                8281,
                8333
            ],
            [
                8333,
                8369
            ],
            [
                8369,
                8402
            ],
            [
                8402,
                8450
            ],
            [
                8606,
                8668
            ],
            [
                8679,
                8711
            ],
            [
                8497,
                8500
            ],
            [
                8887,
                8941
            ],
            [
                8941,
                8992
            ],
            [
                8992,
                9050
            ],
            [
                9165,
                9178
            ],
            [
                9178,
                9195
            ],
            [
                9270,
                9292
            ],
            [
                9319,
                9322
            ],
            [
                9322,
                9364
            ],
            [
                9364,
                9379
            ],
            [
                9379,
                9411
            ],
            [
                9446,
                9470
            ],
            [
                9478,
                9488
            ],
            [
                9523,
                9532
            ],
            [
                9553,
                9555
            ],
            [
                9555,
                9609
            ],
            [
                9609,
                9634
            ],
            [
                9666,
                9733
            ],
            [
                9733,
                9758
            ],
            [
                9760,
                9810
            ],
            [
                9810,
                9860
            ],
            [
                9860,
                9917
            ],
            [
                9956,
                9958
            ],
            [
                10183,
                10213
            ],
            [
                10213,
                10256
            ],
            [
                10259,
                10260
            ],
            [
                10300,
                10374
            ],
            [
                10385,
                10420
            ],
            [
                10420,
                10462
            ],
            [
                10462,
                10544
            ],
            [
                10550,
                10552
            ],
            [
                10561,
                10568
            ],
            [
                10857,
                10872
            ],
            [
                10946,
                10948
            ],
            [
                10948,
                10969
            ],
            [
                10969,
                10980
            ],
            [
                11035,
                11037
            ],
            [
                11046,
                11063
            ],
            [
                11063,
                11069
            ],
            [
                11071,
                11076
            ],
            [
                11076,
                11108
            ],
            [
                11110,
                11194
            ],
            [
                11194,
                11251
            ],
            [
                11289,
                11324
            ],
            [
                11324,
                11330
            ],
            [
                11332,
                11351
            ],
            [
                11351,
                11366
            ],
            [
                11366,
                11367
            ],
            [
                11396,
                11398
            ],
            [
                11423,
                11427
            ],
            [
                11412,
                11418
            ],
            [
                11434,
                11441
            ],
            [
                11455,
                11486
            ],
            [
                11486,
                11497
            ],
            [
                11526,
                11528
            ],
            [
                11543,
                11581
            ],
            [
                11581,
                11613
            ],
            [
                11619,
                11627
            ],
            [
                11627,
                11645
            ],
            [
                11645,
                11650
            ],
            [
                11653,
                11677
            ],
            [
                11875,
                11894
            ],
            [
                11996,
                12037
            ],
            [
                12047,
                12063
            ],
            [
                12063,
                12124
            ],
            [
                12136,
                12157
            ],
            [
                12251,
                12253
            ],
            [
                12318,
                12363
            ],
            [
                12374,
                12382
            ],
            [
                12481,
                12482
            ],
            [
                12364,
                12367
            ],
            [
                12504,
                12507
            ],
            [
                12567,
                12574
            ],
            [
                12384,
                12401
            ],
            [
                12426,
                12428
            ],
            [
                12413,
                12415
            ],
            [
                12460,
                12470
            ],
            [
                12575,
                12642
            ],
            [
                12812,
                12871
            ],
            [
                12872,
                12909
            ],
            [
                12909,
                12922
            ],
            [
                12928,
                12952
            ],
            [
                12952,
                12956
            ],
            [
                12958,
                12970
            ],
            [
                12970,
                12987
            ],
            [
                12987,
                13016
            ],
            [
                13026,
                13035
            ],
            [
                13048,
                13057
            ],
            [
                13057,
                13089
            ],
            [
                13089,
                13107
            ],
            [
                13210,
                13240
            ],
            [
                13278,
                13295
            ],
            [
                13295,
                13314
            ],
            [
                13332,
                13428
            ],
            [
                13428,
                13456
            ],
            [
                13456,
                13495
            ],
            [
                13495,
                13523
            ],
            [
                13524,
                13542
            ],
            [
                13552,
                13562
            ],
            [
                13543,
                13551
            ],
            [
                13562,
                13586
            ],
            [
                13591,
                13621
            ],
            [
                13653,
                13655
            ],
            [
                13655,
                13706
            ],
            [
                13743,
                13823
            ],
            [
                14036,
                14052
            ],
            [
                14052,
                14088
            ],
            [
                14088,
                14113
            ],
            [
                14144,
                14168
            ],
            [
                14168,
                14212
            ],
            [
                14257,
                14260
            ],
            [
                14267,
                14292
            ],
            [
                14242,
                14256
            ],
            [
                14295,
                14378
            ],
            [
                14391,
                14423
            ],
            [
                14423,
                14443
            ],
            [
                14455,
                14506
            ],
            [
                14506,
                14519
            ],
            [
                14542,
                14591
            ],
            [
                14733,
                14735
            ],
            [
                14735,
                14751
            ],
            [
                14766,
                14775
            ],
            [
                14755,
                14765
            ],
            [
                14776,
                14790
            ],
            [
                14813,
                14850
            ],
            [
                14850,
                14865
            ],
            [
                14897,
                14900
            ],
            [
                14900,
                14912
            ],
            [
                14912,
                14942
            ],
            [
                14942,
                14962
            ],
            [
                14971,
                14995
            ],
            [
                14995,
                15018
            ],
            [
                15044,
                15143
            ],
            [
                15143,
                15160
            ],
            [
                15160,
                15199
            ],
            [
                15774,
                15888
            ],
            [
                15888,
                15889
            ],
            [
                15936,
                15963
            ],
            [
                15963,
                16075
            ],
            [
                16075,
                16103
            ],
            [
                16108,
                16120
            ],
            [
                16127,
                16170
            ],
            [
                16170,
                16199
            ],
            [
                16199,
                16212
            ],
            [
                16212,
                16216
            ],
            [
                16244,
                16274
            ],
            [
                16274,
                16356
            ],
            [
                16361,
                16373
            ],
            [
                16384,
                16388
            ],
            [
                16394,
                16433
            ],
            [
                16472,
                16509
            ],
            [
                16519,
                16520
            ],
            [
                16542,
                16591
            ],
            [
                16591,
                16615
            ],
            [
                16618,
                16629
            ],
            [
                16629,
                16638
            ],
            [
                16638,
                16675
            ],
            [
                16675,
                16712
            ],
            [
                16712,
                16768
            ],
            [
                16768,
                16790
            ],
            [
                16805,
                16817
            ],
            [
                16817,
                16911
            ],
            [
                16911,
                16954
            ],
            [
                16957,
                16974
            ],
            [
                17033,
                17062
            ],
            [
                17067,
                17093
            ],
            [
                17119,
                17121
            ],
            [
                17121,
                17154
            ],
            [
                17183,
                17240
            ],
            [
                17240,
                17282
            ],
            [
                17284,
                17314
            ],
            [
                17314,
                17337
            ],
            [
                17349,
                17442
            ],
            [
                17522,
                17524
            ],
            [
                17524,
                17570
            ],
            [
                17606,
                17608
            ],
            [
                17608,
                17646
            ],
            [
                17650,
                17664
            ],
            [
                17744,
                17746
            ],
            [
                17746,
                17814
            ],
            [
                17870,
                17909
            ],
            [
                17951,
                17952
            ],
            [
                17953,
                18010
            ],
            [
                18073,
                18075
            ],
            [
                18075,
                18111
            ],
            [
                18111,
                18190
            ],
            [
                18190,
                18225
            ],
            [
                18259,
                18284
            ],
            [
                18293,
                18487
            ],
            [
                18232,
                18234
            ],
            [
                18533,
                18598
            ],
            [
                18616,
                18617
            ]
        ],
        "row_chars": [
            [
                0,
                149
            ],
            [
                149,
                231
            ],
            [
                231,
                365
            ],
            [
                365,
                549
            ],
            [
                549,
                626
            ],
            [
                626,
                667
            ],
            [
                667,
                724
            ],
            [
                724,
                874
            ],
            [
                874,
                947
            ],
            [
                947,
                1132
            ],
            [
                1132,
                1358
            ],
            [
                1358,
                1614
            ],
            [
                1614,
                1648
            ],
            [
                1648,
                1776
            ],
            [
                1776,
                2023
            ],
            [
                2023,
                2177
            ],
            [
                2177,
                2262
            ],
            [
                2262,
                2697
            ],
            [
                2697,
                2848
            ],
            [
                2848,
                2964
            ],
            [
                2964,
                3055
            ],
            [
                3055,
                3112
            ],
            [
                3112,
                3148
            ],
            [
                3148,
                3411
            ],
            [
                3411,
                3498
            ],
            [
                3498,
                3562
            ],
            [
                3562,
                3779
            ],
            [
                3779,
                3961
            ],
            [
                3961,
                4017
            ],
            [
                4017,
                4080
            ],
            [
                4080,
                4338
            ],
            [
                4338,
                4380
            ],
            [
                4380,
                4515
            ],
            [
                4515,
                4549
            ],
            [
                4549,
                4590
            ],
            [
                4590,
                4677
            ],
            [
                4677,
                4705
            ],
            [
                4705,
                4717
            ],
            [
                4717,
                4847
            ],
            [
                4847,
                4909
            ],
            [
                4909,
                4948
            ],
            [
                4948,
                5058
            ],
            [
                5058,
                5089
            ],
            [
                5089,
                5307
            ],
            [
                5307,
                5346
            ],
            [
                5346,
                5381
            ],
            [
                5381,
                5422
            ],
            [
                5422,
                5550
            ],
            [
                5550,
                6002
            ],
            [
                6002,
                6210
            ],
            [
                6210,
                6363
            ],
            [
                6363,
                6478
            ],
            [
                6478,
                6757
            ],
            [
                6757,
                6843
            ],
            [
                6843,
                6957
            ],
            [
                6957,
                6986
            ],
            [
                6986,
                6998
            ],
            [
                6998,
                7142
            ],
            [
                7142,
                7191
            ],
            [
                7191,
                7237
            ],
            [
                7237,
                7302
            ],
            [
                7302,
                7320
            ],
            [
                7320,
                7351
            ],
            [
                7351,
                7406
            ],
            [
                7406,
                7448
            ],
            [
                7448,
                7499
            ],
            [
                7499,
                7529
            ],
            [
                7529,
                7548
            ],
            [
                7548,
                7558
            ],
            [
                7558,
                7576
            ],
            [
                7576,
                7604
            ],
            [
                7604,
                7673
            ],
            [
                7673,
                7750
            ],
            [
                7750,
                7820
            ],
            [
                7820,
                7889
            ],
            [
                7889,
                7961
            ],
            [
                7961,
                8056
            ],
            [
                8056,
                8144
            ],
            [
                8144,
                8183
            ],
            [
                8183,
                8229
            ],
            [
                8229,
                8256
            ],
            [
                8256,
                8281
            ],
            [
                8281,
                8333
            ],
            [
                8333,
                8369
            ],
            [
                8369,
                8402
            ],
            [
                8402,
                8713
            ],
            [
                8713,
                8826
            ],
            [
                8826,
                8869
            ],
            [
                8869,
                8887
            ],
            [
                8887,
                8941
            ],
            [
                8941,
                8992
            ],
            [
                8992,
                9052
            ],
            [
                9052,
                9099
            ],
            [
                9099,
                9131
            ],
            [
                9131,
                9165
            ],
            [
                9165,
                9178
            ],
            [
                9178,
                9195
            ],
            [
                9195,
                9270
            ],
            [
                9270,
                9322
            ],
            [
                9322,
                9364
            ],
            [
                9364,
                9379
            ],
            [
                9379,
                9555
            ],
            [
                9555,
                9609
            ],
            [
                9609,
                9733
            ],
            [
                9733,
                9810
            ],
            [
                9810,
                9860
            ],
            [
                9860,
                9958
            ],
            [
                9958,
                10183
            ],
            [
                10183,
                10213
            ],
            [
                10213,
                10256
            ],
            [
                10256,
                10420
            ],
            [
                10420,
                10462
            ],
            [
                10462,
                10569
            ],
            [
                10569,
                10698
            ],
            [
                10698,
                10783
            ],
            [
                10783,
                10829
            ],
            [
                10829,
                10948
            ],
            [
                10948,
                10969
            ],
            [
                10969,
                10981
            ],
            [
                10981,
                11014
            ],
            [
                11014,
                11035
            ],
            [
                11035,
                11063
            ],
            [
                11063,
                11076
            ],
            [
                11076,
                11194
            ],
            [
                11194,
                11251
            ],
            [
                11251,
                11289
            ],
            [
                11289,
                11324
            ],
            [
                11324,
                11351
            ],
            [
                11351,
                11366
            ],
            [
                11366,
                11398
            ],
            [
                11398,
                11486
            ],
            [
                11486,
                11581
            ],
            [
                11581,
                11627
            ],
            [
                11627,
                11645
            ],
            [
                11645,
                11677
            ],
            [
                11677,
                11800
            ],
            [
                11800,
                11851
            ],
            [
                11851,
                11875
            ],
            [
                11875,
                11925
            ],
            [
                11925,
                11996
            ],
            [
                11996,
                12063
            ],
            [
                12063,
                12253
            ],
            [
                12253,
                12318
            ],
            [
                12318,
                12575
            ],
            [
                12575,
                12643
            ],
            [
                12643,
                12762
            ],
            [
                12762,
                12812
            ],
            [
                12812,
                12909
            ],
            [
                12909,
                12952
            ],
            [
                12952,
                12970
            ],
            [
                12970,
                12987
            ],
            [
                12987,
                13057
            ],
            [
                13057,
                13089
            ],
            [
                13089,
                13108
            ],
            [
                13108,
                13210
            ],
            [
                13210,
                13295
            ],
            [
                13295,
                13428
            ],
            [
                13428,
                13456
            ],
            [
                13456,
                13495
            ],
            [
                13495,
                13655
            ],
            [
                13655,
                13707
            ],
            [
                13707,
                13743
            ],
            [
                13743,
                13823
            ],
            [
                13823,
                13908
            ],
            [
                13908,
                13978
            ],
            [
                13978,
                14036
            ],
            [
                14036,
                14052
            ],
            [
                14052,
                14088
            ],
            [
                14088,
                14168
            ],
            [
                14168,
                14212
            ],
            [
                14212,
                14295
            ],
            [
                14295,
                14423
            ],
            [
                14423,
                14506
            ],
            [
                14506,
                14735
            ],
            [
                14735,
                14850
            ],
            [
                14850,
                14900
            ],
            [
                14900,
                14912
            ],
            [
                14912,
                14942
            ],
            [
                14942,
                14995
            ],
            [
                14995,
                15044
            ],
            [
                15044,
                15143
            ],
            [
                15143,
                15160
            ],
            [
                15160,
                15199
            ],
            [
                15199,
                15289
            ],
            [
                15289,
                15453
            ],
            [
                15453,
                15545
            ],
            [
                15545,
                15592
            ],
            [
                15592,
                15729
            ],
            [
                15729,
                15773
            ],
            [
                15773,
                15888
            ],
            [
                15888,
                15963
            ],
            [
                15963,
                16075
            ],
            [
                16075,
                16170
            ],
            [
                16170,
                16199
            ],
            [
                16199,
                16212
            ],
            [
                16212,
                16274
            ],
            [
                16274,
                16435
            ],
            [
                16435,
                16472
            ],
            [
                16472,
                16591
            ],
            [
                16591,
                16629
            ],
            [
                16629,
                16638
            ],
            [
                16638,
                16675
            ],
            [
                16675,
                16712
            ],
            [
                16712,
                16768
            ],
            [
                16768,
                16817
            ],
            [
                16817,
                16911
            ],
            [
                16911,
                16974
            ],
            [
                16974,
                17033
            ],
            [
                17033,
                17093
            ],
            [
                17093,
                17121
            ],
            [
                17121,
                17157
            ],
            [
                17157,
                17182
            ],
            [
                17182,
                17240
            ],
            [
                17240,
                17314
            ],
            [
                17314,
                17524
            ],
            [
                17524,
                17608
            ],
            [
                17608,
                17746
            ],
            [
                17746,
                17953
            ],
            [
                17953,
                18075
            ],
            [
                18075,
                18111
            ],
            [
                18111,
                18190
            ],
            [
                18190,
                18617
            ]
        ]
    },
    "abridged": {
        "text": "We must now go back about three weeks in our story, so that the reader may be told how affairs were progressing at the Beargarden. That establishment had received a terrible blow in the defection of Herr Vossner. It was not only that he had robbed the club, and robbed every member of the club who had had personal dealings with him. The sorrow was also in this - that with Herr Vossner all their comforts had gone. Of course Herr Vossner had been a thief. No one had supposed him to be an honest man. But as a thief he had been so comfortable that his absence was regretted with a tenderness almost amounting to love. Dolly Longestaffe had been robbed more outrageously than any other member of the club, and yet Dolly said that London was not worth living in now that Herr Vossner was gone.\nThe Beargarden had received a blow from which it seemed that there was no recovery. At first it was proposed that trustees should be appointed to pay Vossner's debts and borrow more money. But the members of the Beargarden hesitated at these honours and responsibilities. Lord Nidderdale declared that he would have nothing to do with it. Mr. Lupton professed his inability as a man of business. Lord Grasslough pleaded his father. Even Dolly Longestaffe declined.\n\"I have spoken to Squercum,\" he said to the Committee, \"and Squercum won't hear of it. What we ought to do is to get some fellow like Vossner, and make him tell us how much he wants to steal above his regular pay. Then we could subscribe that among us.\" But Mr. Lupton was of the opinion that the new Vossner might perhaps not know, when thus consulted, the extent of his own cupidity.\nThe club would therefore be closed on the 12th August unless some new heaven-inspired idea might be forthcoming for its salvation. One day, Nidderdale, Grasslough, and Dolly were hanging about the steps, drinking sherry and bitters before dinner, when Sir Felix Carbury came creeping round the corner and, in a hesitating manner, entered the door. He had nearly recovered from his wounds, though he had not yet learned to look or speak as though he had not had two of his front teeth knocked out. He had heard little of the Beargarden lately; it was a month since he had been seen at the club. His thrashing had been the wonder of a few days, and then he had been almost forgotten.\nNow, with difficulty, he had summoned courage to go down to his old haunt and talk to his associates as though nothing had happened to him.\n\"By George, here's Carbury!\" said Dolly. Lord Grasslough whistled, turned his back, and walked upstairs; but Nidderdale and Dolly shook hands with him.\n\"Thought you were out of town,\" said Nidderdale. \"Haven't seen you for ever so long.\"\n\"I have been down in Suffolk,\" lied Felix. \"How are things going on here?\"\n\"They're not going at all; they're gone,\" said Dolly.\n\"Everything is smashed,\" said Nidderdale. \"We shall all have to pay, I don't know how much.\"\n\"Wasn't Vossner ever caught?\" asked the baronet.\n\"Caught!\" said Dolly. \"No. We close altogether next Monday. Flatfleece says the furniture belongs to him under what he calls a deed of sale. Indeed, everything seems to belong to Flatfleece. He's always in and out of the club, and has got the key of the cellar.\"\n\"That don't matter,\" said Nidderdale, \"as Vossner took care that there shouldn't be any wine.\"\n\"I suppose one can get dinner here?\"\n\"Yes; today you can, and perhaps tomorrow.\"\n\"Isn't there any playing?\" asked Felix with dismay.\n\"I haven't seen a card this fortnight,\" said Dolly. \"There hasn't been anybody to play. Everything has gone to the dogs. There has been the affair of Melmotte, you know; though why fellows shouldn't play cards because another fellow takes poison, I can't understand.\"\n\"Melmotte's death was rather awful,\" said Nidderdale.\n\"Not half so awful as having nothing to amuse one. And now they say the girl is going to be married to Fisker.\"\n\"Poor dear!\" said Nidderdale. \"I was very fond of her.\"\n\"And Carbury too, I suppose,\" said Dolly.\n\"No; I wasn't. If I'd really been fond of her I should have had her safe to America,\" said Sir Felix.\n\"Come into the smoking-room, Dolly,\" said Nidderdale. \"I can stand most things, but, by George, that fellow is such a cad that I cannot stand him. You and I are bad enough, but I don't think we're so heartless as Carbury.\"\n\"I don't think I'm heartless at all,\" said Dolly. \"I'm good-natured to everybody that is good-natured to me. But I do agree about Carbury. It's very hard to be good-natured to him.\"\nEven so, Sir Felix managed to get his dinner-table close to theirs and to tell them something of his future prospects. He was going to travel and see the world. He had, according to his own account, completely run through London life and found it barren. He would seek new scenes.\n\"How jolly for you!\" said Dolly. \"Is anyone going with you?\"\n\"Well; yes. I've got a travelling companion; a very pleasant fellow, who knows a lot, and will be able to coach me up in things. There's a deal to be learned by going abroad, you know.\"\n\"A parson, I suppose,\" said Dolly.\n\"Well; he is a clergyman. Who told you?\"\n\"I guessed. That should be nice - travelling about Europe with a clergyman. I shouldn't care for it, but I fancy it will just suit you.\"\n\"It's an expensive sort of thing, isn't it?\" asked Nidderdale.\n\"Well - it does cost something. But I want a change.\"\n\"Didn't you have a row in the street with someone the other day?\" This question was asked very abruptly by Lord Grasslough, who was sitting near them. Nidderdale glanced across the table at Dolly, who whistled, and then was silent. Grasslough looked as if he expected an answer.\nIt was the fear of this that had kept Sir Felix away from the club.\n\"Yes,\" said he; \"a fellow attacked me in the street, coming up behind me when I had a girl with me. He didn't get the best of it though.\"\n\"Oh; didn't he?\" said Grasslough. \"I think, upon the whole, you're right to go abroad.\"\n\"What business is it of yours?\" asked the baronet. \"I was speaking to my friends, and not to you.\"\n\"I quite appreciate the distinction,\" said Lord Grasslough, \"and am sorry for Lord Nidderdale and Mr. Longestaffe.\"\n\"What do you mean by that?\" said Sir Felix, rising from his chair. His present opponent was not as horrible to him as John Crumb had been, as men in clubs do not often knock each others' heads.\n\"Don't let's have a quarrel here,\" said Mr. Lupton.\n\"If we must break up, let us break up in peace and quietness,\" said Nidderdale.\n\"Who began it?\" said Sir Felix, sitting down again. Whereupon Lord Grasslough walked out of the room. \"That fellow is always wanting to quarrel.\"\n\"It takes two men to make a quarrel,\" said Dolly.\n\"Yes; it does,\" said Sir Felix, taking this as a friendly observation; \"and I'm not fool enough to be one of them.\"\n\"Oh, yes, I meant it,\" said Grasslough afterwards up in the card-room. The other men had quickly followed him, leaving Sir Felix alone. \"I don't suppose any of us shall ever be here again, so I thought I would tell him my mind.\"\n\"What's the use?\" said Dolly. \"Of course he's a bad fellow. Most fellows are bad in one way or another.\"\n\"But he's bad all round.\"\n\"And so this is to be the end of the Beargarden,\" said Lord Nidderdale with a peculiar melancholy. \"Dear old place! I always felt it was too good to last. I don't think anybody has liked the Beargarden so much as I have, but I shall never try this kind of thing again. Tomorrow I shall dine at the Carlton. Next session I shan't miss a day in the House, and I'll bet anybody a fiver that I make a speech before Easter. I shall take to claret at 20 shillings a dozen, and go about London on the top of an omnibus.\"\n\"How about getting married?\" asked Dolly.\n\"Oh; that's the governor's affair. None of you fellows will believe me, but, upon my word, I liked that girl; and I'd have stuck to her - only there are some things a fellow can't do.\"\nAfter a while Sir Felix followed them upstairs, as though nothing unpleasant had happened below. \"We can make up a rubber, can't we?\" said he.\n\"I should say not,\" said Nidderdale.\n\"I shall not play,\" said Mr. Lupton.\n\"There isn't a pack of cards in the house,\" said Dolly. Lord Grasslough didn't say a word. Sir Felix sat down with his cigar in his mouth, and the others continued to smoke in silence.\n\"I wonder what has become of Miles Grendall?\" asked Sir Felix. \"He hasn't paid me a shilling of the money he owes me.\" No one spoke. \"And I don't suppose he ever will. He is the biggest scoundrel I ever met,\" said Sir Felix.\n\"I know one as big,\" said Lord Grasslough, \"or, at any rate, as little.\"\nThere was another pause, and then Sir Felix left the room muttering something as to the stupidity of having no cards. From that time forth he was never more seen by his associates at the Beargarden.\nThe other men remained there till well into the night. It was felt by them all that this was the end of the Beargarden, and they whispered sad things in low voices.\n\"I never felt so much like crying in my life,\" said Dolly. \"Good-night, old fellows; good-bye. I'm going down to Caversham, and I shouldn't wonder if I didn't drown myself.\"\nHow Mr. Flatfleece went to law, and threatened everybody, and singled out poor Dolly Longestaffe as his special victim; and how Dolly Longestaffe, by the aid of Mr. Squercum, utterly confounded Mr. Flatfleece, and brought that ingenious but unfortunate man to ruin, the reader will hardly expect to have told to him in detail.",
        "paragraph_chars": [
            [
                0,
                793
            ],
            [
                793,
                1258
            ],
            [
                1258,
                1644
            ],
            [
                1644,
                2326
            ],
            [
                2326,
                2466
            ],
            [
                2466,
                2618
            ],
            [
                2618,
                2704
            ],
            [
                2704,
                2779
            ],
            [
                2779,
                2833
            ],
            [
                2833,
                2926
            ],
            [
                2926,
                2975
            ],
            [
                2975,
                3238
            ],
            [
                3238,
                3333
            ],
            [
                3333,
                3370
            ],
            [
                3370,
                3414
            ],
            [
                3414,
                3466
            ],
            [
                3466,
                3734
            ],
            [
                3734,
                3788
            ],
            [
                3788,
                3900
            ],
            [
                3900,
                3956
            ],
            [
                3956,
                3998
            ],
            [
                3998,
                4100
            ],
            [
                4100,
                4323
            ],
            [
                4323,
                4505
            ],
            [
                4505,
                4786
            ],
            [
                4786,
                4847
            ],
            [
                4847,
                5033
            ],
            [
                5033,
                5068
            ],
            [
                5068,
                5109
            ],
            [
                5109,
                5246
            ],
            [
                5246,
                5309
            ],
            [
                5309,
                5363
            ],
            [
                5363,
                5642
            ],
            [
                5642,
                5710
            ],
            [
                5710,
                5848
            ],
            [
                5848,
                5936
            ],
            [
                5936,
                6035
            ],
            [
                6035,
                6151
            ],
            [
                6151,
                6345
            ],
            [
                6345,
                6397
            ],
            [
                6397,
                6477
            ],
            [
                6477,
                6623
            ],
            [
                6623,
                6673
            ],
            [
                6673,
                6789
            ],
            [
                6789,
                7018
            ],
            [
                7018,
                7123
            ],
            [
                7123,
                7149
            ],
            [
                7149,
                7663
            ],
            [
                7663,
                7705
            ],
            [
                7705,
                7890
            ],
            [
                7890,
                8033
            ],
            [
                8033,
                8070
            ],
            [
                8070,
                8107
            ],
            [
                8107,
                8292
            ],
            [
                8292,
                8517
            ],
            [
                8517,
                8590
            ],
            [
                8590,
                8789
            ],
            [
                8789,
                8954
            ],
            [
                8954,
                9128
            ],
            [
                9128,
                9454
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                213
            ],
            [
                213,
                334
            ],
            [
                334,
                416
            ],
            [
                416,
                457
            ],
            [
                457,
                502
            ],
            [
                502,
                619
            ],
            [
                619,
                793
            ],
            [
                793,
                877
            ],
            [
                877,
                982
            ],
            [
                982,
                1065
            ],
            [
                1065,
                1132
            ],
            [
                1132,
                1189
            ],
            [
                1189,
                1225
            ],
            [
                1225,
                1258
            ],
            [
                1258,
                1345
            ],
            [
                1345,
                1472
            ],
            [
                1472,
                1512
            ],
            [
                1512,
                1644
            ],
            [
                1644,
                1775
            ],
            [
                1775,
                1992
            ],
            [
                1992,
                2141
            ],
            [
                2141,
                2238
            ],
            [
                2238,
                2326
            ],
            [
                2326,
                2466
            ],
            [
                2466,
                2495
            ],
            [
                2495,
                2507
            ],
            [
                2507,
                2618
            ],
            [
                2618,
                2667
            ],
            [
                2667,
                2704
            ],
            [
                2704,
                2747
            ],
            [
                2747,
                2779
            ],
            [
                2779,
                2833
            ],
            [
                2833,
                2875
            ],
            [
                2875,
                2926
            ],
            [
                2926,
                2956
            ],
            [
                2956,
                2975
            ],
            [
                2975,
                2985
            ],
            [
                2985,
                2997
            ],
            [
                2997,
                3002
            ],
            [
                3002,
                3035
            ],
            [
                3035,
                3116
            ],
            [
                3116,
                3166
            ],
            [
                3166,
                3238
            ],
            [
                3238,
                3333
            ],
            [
                3333,
                3370
            ],
            [
                3370,
                3414
            ],
            [
                3414,
                3441
            ],
            [
                3441,
                3466
            ],
            [
                3466,
                3518
            ],
            [
                3518,
                3554
            ],
            [
                3554,
                3587
            ],
            [
                3587,
                3734
            ],
            [
                3734,
                3788
            ],
            [
                3788,
                3839
            ],
            [
                3839,
                3900
            ],
            [
                3900,
                3913
            ],
            [
                3913,
                3930
            ],
            [
                3930,
                3956
            ],
            [
                3956,
                3998
            ],
            [
                3998,
                4013
            ],
            [
                4013,
                4100
            ],
            [
                4100,
                4154
            ],
            [
                4154,
                4247
            ],
            [
                4247,
                4323
            ],
            [
                4323,
                4373
            ],
            [
                4373,
                4432
            ],
            [
                4432,
                4462
            ],
            [
                4462,
                4505
            ],
            [
                4505,
                4624
            ],
            [
                4624,
                4666
            ],
            [
                4666,
                4760
            ],
            [
                4760,
                4786
            ],
            [
                4786,
                4807
            ],
            [
                4807,
                4819
            ],
            [
                4819,
                4847
            ],
            [
                4847,
                4859
            ],
            [
                4859,
                4976
            ],
            [
                4976,
                5033
            ],
            [
                5033,
                5068
            ],
            [
                5068,
                5094
            ],
            [
                5094,
                5109
            ],
            [
                5109,
                5121
            ],
            [
                5121,
                5185
            ],
            [
                5185,
                5246
            ],
            [
                5246,
                5291
            ],
            [
                5291,
                5309
            ],
            [
                5309,
                5341
            ],
            [
                5341,
                5363
            ],
            [
                5363,
                5429
            ],
            [
                5429,
                5514
            ],
            [
                5514,
                5595
            ],
            [
                5595,
                5642
            ],
            [
                5642,
                5710
            ],
            [
                5710,
                5810
            ],
            [
                5810,
                5848
            ],
            [
                5848,
                5865
            ],
            [
                5865,
                5882
            ],
            [
                5882,
                5936
            ],
            [
                5936,
                5968
            ],
            [
                5968,
                5987
            ],
            [
                5987,
                6035
            ],
            [
                6035,
                6151
            ],
            [
                6151,
                6179
            ],
            [
                6179,
                6218
            ],
            [
                6218,
                6345
            ],
            [
                6345,
                6397
            ],
            [
                6397,
                6477
            ],
            [
                6477,
                6493
            ],
            [
                6493,
                6529
            ],
            [
                6529,
                6579
            ],
            [
                6579,
                6623
            ],
            [
                6623,
                6673
            ],
            [
                6673,
                6789
            ],
            [
                6789,
                6860
            ],
            [
                6860,
                6925
            ],
            [
                6925,
                7018
            ],
            [
                7018,
                7036
            ],
            [
                7036,
                7048
            ],
            [
                7048,
                7078
            ],
            [
                7078,
                7123
            ],
            [
                7123,
                7149
            ],
            [
                7149,
                7248
            ],
            [
                7248,
                7265
            ],
            [
                7265,
                7304
            ],
            [
                7304,
                7418
            ],
            [
                7418,
                7456
            ],
            [
                7456,
                7568
            ],
            [
                7568,
                7663
            ],
            [
                7663,
                7692
            ],
            [
                7692,
                7705
            ],
            [
                7705,
                7740
            ],
            [
                7740,
                7890
            ],
            [
                7890,
                7987
            ],
            [
                7987,
                8024
            ],
            [
                8024,
                8033
            ],
            [
                8033,
                8070
            ],
            [
                8070,
                8107
            ],
            [
                8107,
                8163
            ],
            [
                8163,
                8198
            ],
            [
                8198,
                8292
            ],
            [
                8292,
                8338
            ],
            [
                8338,
                8355
            ],
            [
                8355,
                8411
            ],
            [
                8411,
                8425
            ],
            [
                8425,
                8460
            ],
            [
                8460,
                8517
            ],
            [
                8517,
                8590
            ],
            [
                8590,
                8708
            ],
            [
                8708,
                8789
            ],
            [
                8789,
                8844
            ],
            [
                8844,
                8954
            ],
            [
                8954,
                9013
            ],
            [
                9013,
                9049
            ],
            [
                9049,
                9128
            ],
            [
                9128,
                9454
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                20,
                37
            ],
            [
                38,
                51
            ],
            [
                55,
                131
            ],
            [
                131,
                213
            ],
            [
                213,
                301
            ],
            [
                306,
                334
            ],
            [
                334,
                348
            ],
            [
                354,
                361
            ],
            [
                364,
                416
            ],
            [
                416,
                457
            ],
            [
                457,
                463
            ],
            [
                464,
                502
            ],
            [
                502,
                505
            ],
            [
                506,
                617
            ],
            [
                617,
                619
            ],
            [
                619,
                719
            ],
            [
                720,
                724
            ],
            [
                725,
                792
            ],
            [
                793,
                877
            ],
            [
                877,
                906
            ],
            [
                907,
                915
            ],
            [
                916,
                935
            ],
            [
                936,
                938
            ],
            [
                943,
                958
            ],
            [
                970,
                980
            ],
            [
                980,
                982
            ],
            [
                982,
                985
            ],
            [
                986,
                989
            ],
            [
                990,
                1025
            ],
            [
                1035,
                1046
            ],
            [
                1047,
                1065
            ],
            [
                1065,
                1089
            ],
            [
                1090,
                1130
            ],
            [
                1130,
                1132
            ],
            [
                1132,
                1189
            ],
            [
                1189,
                1225
            ],
            [
                1225,
                1229
            ],
            [
                1230,
                1247
            ],
            [
                1248,
                1257
            ],
            [
                1258,
                1345
            ],
            [
                1345,
                1364
            ],
            [
                1365,
                1472
            ],
            [
                1472,
                1509
            ],
            [
                1512,
                1533
            ],
            [
                1538,
                1644
            ],
            [
                1644,
                1658
            ],
            [
                1669,
                1773
            ],
            [
                1775,
                1782
            ],
            [
                1782,
                1840
            ],
            [
                1841,
                1847
            ],
            [
                1848,
                1875
            ],
            [
                1876,
                1882
            ],
            [
                1883,
                1918
            ],
            [
                1919,
                1927
            ],
            [
                1928,
                1937
            ],
            [
                1938,
                1954
            ],
            [
                1955,
                1965
            ],
            [
                1972,
                1985
            ],
            [
                1986,
                1992
            ],
            [
                1992,
                2042
            ],
            [
                2043,
                2073
            ],
            [
                2074,
                2141
            ],
            [
                2141,
                2160
            ],
            [
                2161,
                2163
            ],
            [
                2164,
                2178
            ],
            [
                2187,
                2193
            ],
            [
                2194,
                2238
            ],
            [
                2238,
                2274
            ],
            [
                2281,
                2286
            ],
            [
                2299,
                2325
            ],
            [
                2326,
                2399
            ],
            [
                2400,
                2415
            ],
            [
                2416,
                2436
            ],
            [
                2445,
                2448
            ],
            [
                2461,
                2465
            ],
            [
                2466,
                2495
            ],
            [
                2495,
                2507
            ],
            [
                2507,
                2560
            ],
            [
                2569,
                2595
            ],
            [
                2602,
                2607
            ],
            [
                2616,
                2618
            ],
            [
                2618,
                2667
            ],
            [
                2667,
                2688
            ],
            [
                2689,
                2704
            ],
            [
                2704,
                2716
            ],
            [
                2717,
                2732
            ],
            [
                2732,
                2734
            ],
            [
                2740,
                2745
            ],
            [
                2745,
                2747
            ],
            [
                2748,
                2779
            ],
            [
                2779,
                2805
            ],
            [
                2806,
                2833
            ],
            [
                2833,
                2875
            ],
            [
                2875,
                2926
            ],
            [
                2926,
                2956
            ],
            [
                2956,
                2975
            ],
            [
                2975,
                2985
            ],
            [
                2990,
                2997
            ],
            [
                2997,
                3000
            ],
            [
                3000,
                3002
            ],
            [
                3002,
                3033
            ],
            [
                3033,
                3035
            ],
            [
                3035,
                3050
            ],
            [
                3065,
                3116
            ],
            [
                3116,
                3134
            ],
            [
                3135,
                3166
            ],
            [
                3166,
                3238
            ],
            [
                3238,
                3333
            ],
            [
                3333,
                3355
            ],
            [
                3356,
                3370
            ],
            [
                3370,
                3375
            ],
            [
                3382,
                3402
            ],
            [
                3411,
                3414
            ],
            [
                3414,
                3441
            ],
            [
                3441,
                3466
            ],
            [
                3466,
                3518
            ],
            [
                3518,
                3554
            ],
            [
                3554,
                3587
            ],
            [
                3587,
                3635
            ],
            [
                3636,
                3698
            ],
            [
                3699,
                3731
            ],
            [
                3731,
                3734
            ],
            [
                3734,
                3788
            ],
            [
                3788,
                3839
            ],
            [
                3839,
                3897
            ],
            [
                3900,
                3913
            ],
            [
                3913,
                3930
            ],
            [
                3931,
                3953
            ],
            [
                3953,
                3956
            ],
            [
                3956,
                3998
            ],
            [
                3998,
                4013
            ],
            [
                4013,
                4045
            ],
            [
                4046,
                4070
            ],
            [
                4071,
                4081
            ],
            [
                4089,
                4098
            ],
            [
                4098,
                4100
            ],
            [
                4100,
                4154
            ],
            [
                4154,
                4179
            ],
            [
                4180,
                4247
            ],
            [
                4247,
                4272
            ],
            [
                4273,
                4323
            ],
            [
                4323,
                4373
            ],
            [
                4373,
                4430
            ],
            [
                4430,
                4432
            ],
            [
                4432,
                4462
            ],
            [
                4462,
                4505
            ],
            [
                4512,
                4513
            ],
            [
                4514,
                4588
            ],
            [
                4589,
                4624
            ],
            [
                4624,
                4666
            ],
            [
                4666,
                4748
            ],
            [
                4749,
                4751
            ],
            [
                4752,
                4759
            ],
            [
                4769,
                4784
            ],
            [
                4784,
                4786
            ],
            [
                4786,
                4807
            ],
            [
                4807,
                4818
            ],
            [
                4820,
                4822
            ],
            [
                4830,
                4847
            ],
            [
                4847,
                4853
            ],
            [
                4854,
                4859
            ],
            [
                4859,
                4891
            ],
            [
                4892,
                4976
            ],
            [
                4976,
                5033
            ],
            [
                5033,
                5068
            ],
            [
                5068,
                5074
            ],
            [
                5075,
                5094
            ],
            [
                5094,
                5109
            ],
            [
                5109,
                5110
            ],
            [
                5119,
                5121
            ],
            [
                5121,
                5125
            ],
            [
                5126,
                5132
            ],
            [
                5133,
                5140
            ],
            [
                5154,
                5185
            ],
            [
                5185,
                5196
            ],
            [
                5206,
                5208
            ],
            [
                5208,
                5246
            ],
            [
                5246,
                5278
            ],
            [
                5283,
                5291
            ],
            [
                5291,
                5309
            ],
            [
                5309,
                5314
            ],
            [
                5317,
                5341
            ],
            [
                5341,
                5360
            ],
            [
                5363,
                5404
            ],
            [
                5413,
                5429
            ],
            [
                5429,
                5490
            ],
            [
                5491,
                5512
            ],
            [
                5512,
                5514
            ],
            [
                5514,
                5559
            ],
            [
                5564,
                5572
            ],
            [
                5572,
                5573
            ],
            [
                5574,
                5577
            ],
            [
                5583,
                5586
            ],
            [
                5587,
                5594
            ],
            [
                5595,
                5612
            ],
            [
                5613,
                5615
            ],
            [
                5619,
                5621
            ],
            [
                5631,
                5641
            ],
            [
                5642,
                5709
            ],
            [
                5710,
                5769
            ],
            [
                5773,
                5810
            ],
            [
                5810,
                5823
            ],
            [
                5824,
                5848
            ],
            [
                5848,
                5852
            ],
            [
                5853,
                5865
            ],
            [
                5865,
                5882
            ],
            [
                5882,
                5911
            ],
            [
                5911,
                5920
            ],
            [
                5927,
                5936
            ],
            [
                5936,
                5968
            ],
            [
                5968,
                5986
            ],
            [
                5987,
                6017
            ],
            [
                6018,
                6035
            ],
            [
                6035,
                6054
            ],
            [
                6055,
                6151
            ],
            [
                6151,
                6179
            ],
            [
                6179,
                6218
            ],
            [
                6218,
                6246
            ],
            [
                6250,
                6268
            ],
            [
                6269,
                6279
            ],
            [
                6280,
                6288
            ],
            [
                6288,
                6312
            ],
            [
                6313,
                6343
            ],
            [
                6343,
                6345
            ],
            [
                6345,
                6396
            ],
            [
                6397,
                6477
            ],
            [
                6477,
                6493
            ],
            [
                6493,
                6529
            ],
            [
                6529,
                6554
            ],
            [
                6555,
                6579
            ],
            [
                6579,
                6623
            ],
            [
                6623,
                6626
            ],
            [
                6633,
                6658
            ],
            [
                6658,
                6672
            ],
            [
                6673,
                6756
            ],
            [
                6757,
                6789
            ],
            [
                6789,
                6809
            ],
            [
                6809,
                6860
            ],
            [
                6860,
                6873
            ],
            [
                6874,
                6923
            ],
            [
                6923,
                6925
            ],
            [
                6925,
                6941
            ],
            [
                6942,
                6951
            ],
            [
                6952,
                6962
            ],
            [
                6963,
                6977
            ],
            [
                6981,
                7018
            ],
            [
                7018,
                7033
            ],
            [
                7033,
                7036
            ],
            [
                7036,
                7048
            ],
            [
                7048,
                7078
            ],
            [
                7078,
                7098
            ],
            [
                7099,
                7123
            ],
            [
                7123,
                7146
            ],
            [
                7149,
                7248
            ],
            [
                7248,
                7265
            ],
            [
                7265,
                7304
            ],
            [
                7304,
                7418
            ],
            [
                7427,
                7428
            ],
            [
                7429,
                7456
            ],
            [
                7456,
                7568
            ],
            [
                7568,
                7596
            ],
            [
                7607,
                7619
            ],
            [
                7620,
                7663
            ],
            [
                7663,
                7692
            ],
            [
                7692,
                7705
            ],
            [
                7705,
                7709
            ],
            [
                7710,
                7740
            ],
            [
                7740,
                7822
            ],
            [
                7828,
                7840
            ],
            [
                7843,
                7847
            ],
            [
                7848,
                7887
            ],
            [
                7890,
                7927
            ],
            [
                7936,
                7937
            ],
            [
                7938,
                7987
            ],
            [
                7987,
                8011
            ],
            [
                8013,
                8024
            ],
            [
                8024,
                8033
            ],
            [
                8033,
                8070
            ],
            [
                8070,
                8107
            ],
            [
                8107,
                8163
            ],
            [
                8163,
                8185
            ],
            [
                8186,
                8198
            ],
            [
                8198,
                8292
            ],
            [
                8292,
                8335
            ],
            [
                8338,
                8355
            ],
            [
                8355,
                8384
            ],
            [
                8385,
                8411
            ],
            [
                8423,
                8425
            ],
            [
                8425,
                8458
            ],
            [
                8460,
                8517
            ],
            [
                8517,
                8559
            ],
            [
                8560,
                8590
            ],
            [
                8590,
                8613
            ],
            [
                8613,
                8706
            ],
            [
                8706,
                8708
            ],
            [
                8708,
                8754
            ],
            [
                8787,
                8789
            ],
            [
                8789,
                8827
            ],
            [
                8828,
                8842
            ],
            [
                8842,
                8844
            ],
            [
                8844,
                8912
            ],
            [
                8913,
                8952
            ],
            [
                8952,
                8953
            ],
            [
                8954,
                9011
            ],
            [
                9011,
                9013
            ],
            [
                9013,
                9049
            ],
            [
                9049,
                9128
            ],
            [
                9128,
                9163
            ],
            [
                9164,
                9189
            ],
            [
                9190,
                9384
            ],
            [
                9385,
                9387
            ],
            [
                9388,
                9453
            ],
            [
                9453,
                9454
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                213
            ],
            [
                213,
                334
            ],
            [
                334,
                334
            ],
            [
                334,
                416
            ],
            [
                416,
                457
            ],
            [
                457,
                457
            ],
            [
                457,
                457
            ],
            [
                457,
                502
            ],
            [
                502,
                619
            ],
            [
                619,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                877
            ],
            [
                877,
                982
            ],
            [
                982,
                982
            ],
            [
                982,
                982
            ],
            [
                982,
                982
            ],
            [
                982,
                1065
            ],
            [
                1065,
                1132
            ],
            [
                1132,
                1132
            ],
            [
                1132,
                1189
            ],
            [
                1189,
                1225
            ],
            [
                1225,
                1258
            ],
            [
                1258,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1345
            ],
            [
                1345,
                1472
            ],
            [
                1472,
                1512
            ],
            [
                1512,
                1512
            ],
            [
                1512,
                1512
            ],
            [
                1512,
                1644
            ],
            [
                1644,
                1992
            ],
            [
                1992,
                2141
            ],
            [
                2141,
                2238
            ],
            [
                2238,
                2326
            ],
            [
                2326,
                2466
            ],
            [
                2466,
                2466
            ],
            [
                2466,
                2466
            ],
            [
                2466,
                2495
            ],
            [
                2495,
                2507
            ],
            [
                2507,
                2618
            ],
            [
                2618,
                2667
            ],
            [
                2667,
                2704
            ],
            [
                2704,
                2747
            ],
            [
                2747,
                2747
            ],
            [
                2747,
                2779
            ],
            [
                2779,
                2833
            ],
            [
                2833,
                2875
            ],
            [
                2875,
                2926
            ],
            [
                2926,
                2956
            ],
            [
                2956,
                2975
            ],
            [
                2975,
                2985
            ],
            [
                2985,
                2997
            ],
            [
                2997,
                3002
            ],
            [
                3002,
                3002
            ],
            [
                3002,
                3035
            ],
            [
                3035,
                3116
            ],
            [
                3116,
                3166
            ],
            [
                3166,
                3238
            ],
            [
                3238,
                3333
            ],
            [
                3333,
                3333
            ],
            [
                3333,
                3370
            ],
            [
                3370,
                3414
            ],
            [
                3414,
                3441
            ],
            [
                3441,
                3466
            ],
            [
                3466,
                3518
            ],
            [
                3518,
                3554
            ],
            [
                3554,
                3587
            ],
            [
                3587,
                3734
            ],
            [
                3734,
                3734
            ],
            [
                3734,
                3734
            ],
            [
                3734,
                3734
            ],
            [
                3734,
                3788
            ],
            [
                3788,
                3839
            ],
            [
                3839,
                3900
            ],
            [
                3900,
                3900
            ],
            [
                3900,
                3900
            ],
            [
                3900,
                3900
            ],
            [
                3900,
                3913
            ],
            [
                3913,
                3930
            ],
            [
                3930,
                3930
            ],
            [
                3930,
                3956
            ],
            [
                3956,
                3998
            ],
            [
                3998,
                4013
            ],
            [
                4013,
                4100
            ],
            [
                4100,
                4154
            ],
            [
                4154,
                4247
            ],
            [
                4247,
                4323
            ],
            [
                4323,
                4373
            ],
            [
                4373,
                4432
            ],
            [
                4432,
                4432
            ],
            [
                4432,
                4462
            ],
            [
                4462,
                4505
            ],
            [
                4505,
                4624
            ],
            [
                4624,
                4666
            ],
            [
                4666,
                4760
            ],
            [
                4760,
                4760
            ],
            [
                4760,
                4760
            ],
            [
                4760,
                4760
            ],
            [
                4760,
                4786
            ],
            [
                4786,
                4807
            ],
            [
                4807,
                4819
            ],
            [
                4819,
                4819
            ],
            [
                4819,
                4819
            ],
            [
                4819,
                4847
            ],
            [
                4847,
                4859
            ],
            [
                4859,
                4976
            ],
            [
                4976,
                5033
            ],
            [
                5033,
                5033
            ],
            [
                5033,
                5068
            ],
            [
                5068,
                5094
            ],
            [
                5094,
                5109
            ],
            [
                5109,
                5121
            ],
            [
                5121,
                5185
            ],
            [
                5185,
                5246
            ],
            [
                5246,
                5291
            ],
            [
                5291,
                5309
            ],
            [
                5309,
                5341
            ],
            [
                5341,
                5341
            ],
            [
                5341,
                5341
            ],
            [
                5341,
                5341
            ],
            [
                5341,
                5363
            ],
            [
                5363,
                5363
            ],
            [
                5363,
                5429
            ],
            [
                5429,
                5514
            ],
            [
                5514,
                5514
            ],
            [
                5514,
                5642
            ],
            [
                5642,
                5710
            ],
            [
                5710,
                5710
            ],
            [
                5710,
                5710
            ],
            [
                5710,
                5810
            ],
            [
                5810,
                5848
            ],
            [
                5848,
                5865
            ],
            [
                5865,
                5882
            ],
            [
                5882,
                5936
            ],
            [
                5936,
                5968
            ],
            [
                5968,
                5987
            ],
            [
                5987,
                5987
            ],
            [
                5987,
                6035
            ],
            [
                6035,
                6151
            ],
            [
                6151,
                6179
            ],
            [
                6179,
                6218
            ],
            [
                6218,
                6345
            ],
            [
                6345,
                6397
            ],
            [
                6397,
                6397
            ],
            [
                6397,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6477
            ],
            [
                6477,
                6493
            ],
            [
                6493,
                6529
            ],
            [
                6529,
                6579
            ],
            [
                6579,
                6623
            ],
            [
                6623,
                6673
            ],
            [
                6673,
                6789
            ],
            [
                6789,
                6860
            ],
            [
                6860,
                6925
            ],
            [
                6925,
                7018
            ],
            [
                7018,
                7036
            ],
            [
                7036,
                7048
            ],
            [
                7048,
                7078
            ],
            [
                7078,
                7123
            ],
            [
                7123,
                7149
            ],
            [
                7149,
                7248
            ],
            [
                7248,
                7265
            ],
            [
                7265,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7418
            ],
            [
                7418,
                7456
            ],
            [
                7456,
                7568
            ],
            [
                7568,
                7663
            ],
            [
                7663,
                7692
            ],
            [
                7692,
                7705
            ],
            [
                7705,
                7740
            ],
            [
                7740,
                7890
            ],
            [
                7890,
                7890
            ],
            [
                7890,
                7987
            ],
            [
                7987,
                8024
            ],
            [
                8024,
                8033
            ],
            [
                8033,
                8070
            ],
            [
                8070,
                8107
            ],
            [
                8107,
                8163
            ],
            [
                8163,
                8198
            ],
            [
                8198,
                8292
            ],
            [
                8292,
                8355
            ],
            [
                8355,
                8355
            ],
            [
                8355,
                8411
            ],
            [
                8411,
                8425
            ],
            [
                8425,
                8460
            ],
            [
                8460,
                8460
            ],
            [
                8460,
                8517
            ],
            [
                8517,
                8590
            ],
            [
                8590,
                8708
            ],
            [
                8708,
                8789
            ],
            [
                8789,
                8844
            ],
            [
                8844,
                8954
            ],
            [
                8954,
                9013
            ],
            [
                9013,
                9049
            ],
            [
                9049,
                9128
            ],
            [
                9128,
                9454
            ]
        ]
    }
}