{
    "original": {
        "text": "Mrs. Hurtle had consented at the joint request of Mrs. Pipkin and John Crumb to postpone her journey to New York and to go down to Bungay and grace the marriage of Ruby Ruggles, not so much from any love for the persons concerned, not so much even from any desire to witness a phase of English life, as from an irresistible tenderness towards Paul Montague. She not only longed to see him once again, but she could with difficulty bring herself to leave the land in which he was living. There was no hope for her. She was sure of that. She had consented to relinquish him. She had condoned his treachery to her,--and for his sake had even been kind to the rival who had taken her place. But still she lingered near him. And then, though, in all her very restricted intercourse with such English people as she met, she never ceased to ridicule things English, yet she dreaded a return to her own country. In her heart of hearts she liked the somewhat stupid tranquillity of the life she saw, comparing it with the rough tempests of her past days. Mrs. Pipkin, she thought, was less intellectual than any American woman she had ever known; and she was quite sure that no human being so heavy, so slow, and so incapable of two concurrent ideas as John Crumb had ever been produced in the United States;--but, nevertheless, she liked Mrs. Pipkin, and almost loved John Crumb. How different would her life have been could she have met a man who would have been as true to her as John Crumb was to his Ruby!\nShe loved Paul Montague with all her heart, and she despised herself for loving him. How weak he was;--how inefficient; how unable to seize glorious opportunities; how swathed and swaddled by scruples and prejudices;--how unlike her own countrymen in quickness of apprehension and readiness of action! But yet she loved him for his very faults, telling herself that there was something sweeter in his English manners than in all the smart intelligence of her own land. The man had been false to her,--false as hell; had sworn to her and had broken his oath; had ruined her whole life; had made everything blank before her by his treachery! But then she also had not been quite true with him. She had not at first meant to deceive;--nor had he. They had played a game against each other; and he, with all the inferiority of his intellect to weigh him down, had won,--because he was a man. She had much time for thinking, and she thought much about these things. He could change his love as often as he pleased, and be as good a lover at the end as ever;--whereas she was ruined by his defection. He could look about for a fresh flower and boldly seek his honey; whereas she could only sit and mourn for the sweets of which she had been rifled. She was not quite sure that such mourning would not be more bitter to her in California than in Mrs. Pipkin's solitary lodgings at Islington.\n\"So he was Mr. Montague's partner,--was he now?\" asked Mrs. Pipkin a day or two after their return from the Crumb marriage. For Mr. Fisker had called on Mrs. Hurtle, and Mrs. Hurtle had told Mrs. Pipkin so much. \"To my thinking now he's a nicer man than Mr. Montague.\" Mrs. Pipkin perhaps thought that as her lodger had lost one partner she might be anxious to secure the other;--perhaps felt, too, that it might be well to praise an American at the expense of an Englishman.\n\"There's no accounting for tastes, Mrs. Pipkin.\"\n\"And that's true, too, Mrs. Hurtle.\"\n\"Mr. Montague is a gentleman.\"\n\"I always did say that of him, Mrs. Hurtle.\"\n\"And Mr. Fisker is--an American citizen.\" Mrs. Hurtle when she said this was very far gone in tenderness.\n\"Indeed now!\" said Mrs. Pipkin, who did not in the least understand the meaning of her friend's last remark.\n\"Mr. Fisker came to me with tidings from San Francisco which I had not heard before, and has offered to take me back with him.\" Mrs. Pipkin's apron was immediately at her eyes. \"I must go some day, you know.\"\n\"I suppose you must. I couldn't hope as you'd stay here always. I wish I could. I never shall forget the comfort it's been. There hasn't been a week without everything settled; and most ladylike,--most ladylike! You seem to me, Mrs. Hurtle, just as though you had the bank in your pocket.\" All this the poor woman said, moved by her sorrow to speak the absolute truth.\n\"Mr. Fisker isn't in any way a special friend of mine. But I hear that he will be taking other ladies with him, and I fancy I might as well join the party. It will be less dull for me, and I shall prefer company just at present for many reasons. We shall start on the first of September.\" As this was said about the middle of August there was still some remnant of comfort for poor Mrs. Pipkin. A fortnight gained was something; and as Mr. Fisker had come to England on business, and as business is always uncertain, there might possibly be further delay. Then Mrs. Hurtle made a further communication to Mrs. Pipkin, which, though not spoken till the latter lady had her hand on the door, was, perhaps, the one thing which Mrs. Hurtle had desired to say. \"By-the-bye, Mrs. Pipkin, I expect Mr. Montague to call to-morrow at eleven. Just show him up when he comes.\" She had feared that unless some such instructions were given, there might be a little scene at the door when the gentleman came.\n\"Mr. Montague;--oh! Of course, Mrs. Hurtle,--of course. I'll see to it myself.\" Then Mrs. Pipkin went away abashed,--feeling that she had made a great mistake in preferring any other man to Mr. Montague, if, after all, recent difficulties were to be adjusted.\nOn the following morning Mrs. Hurtle dressed herself with almost more than her usual simplicity, but certainly with not less than her usual care, and immediately after breakfast seated herself at her desk, nursing an idea that she would work as steadily for the next hour as though she expected no special visitor. Of course she did not write a word of the task which she had prescribed to herself. Of course she was disturbed in her mind, though she had dictated to herself absolute quiescence.\nShe almost knew that she had been wrong even to desire to see him. She had forgiven him, and what more was there to be said? She had seen the girl, and had in some fashion approved of her. Her curiosity had been satisfied, and her love of revenge had been sacrificed. She had no plan arranged as to what she would now say to him, nor did she at this moment attempt to make a plan. She could tell him that she was about to return to San Francisco with Fisker, but she did not know that she had anything else to say. Then came the knock at the door. Her heart leaped within her, and she made a last great effort to be tranquil. She heard the steps on the stairs, and then the door was opened and Mr. Montague was announced by Mrs. Pipkin herself. Mrs. Pipkin, however, quite conquered by a feeling of gratitude to her lodger, did not once look in through the door, nor did she pause a moment to listen at the keyhole. \"I thought you would come and see me once again before I went,\" said Mrs. Hurtle, not rising from her sofa, but putting out her hand to greet him. \"Sit there opposite, so that we can look at one another. I hope it has not been a trouble to you.\"\n\"Of course I came when you left word for me to do so.\"\n\"I certainly should not have expected it from any wish of your own.\"\n\"I should not have dared to come, had you not bade me. You know that.\"\n\"I know nothing of the kind;--but as you are here we will not quarrel as to your motives. Has Miss Carbury pardoned you as yet? Has she forgiven your sins?\"\n\"We are friends,--if you mean that.\"\n\"Of course you are friends. She only wanted to have somebody to tell her that somebody had maligned you. It mattered not much who it was. She was ready to believe any one who would say a good word for you. Perhaps I wasn't just the person to do it, but I believe even I was sufficient to serve the turn.\"\n\"Did you say a good word for me?\"\n\"Well; no;\" replied Mrs. Hurtle. \"I will not boast that I did. I do not want to tell you fibs at our last meeting. I said nothing good of you. What could I say of good? But I told her what was quite as serviceable to you as though I had sung your virtues by the hour without ceasing. I explained to her how very badly you had behaved to me. I let her know that from the moment you had seen her, you had thrown me to the winds.\"\n\"It was not so, my friend.\"\n\"What did that matter? One does not scruple a lie for a friend, you know! I could not go into all the little details of your perfidies. I could not make her understand during one short and rather agonizing interview how you had allowed yourself to be talked out of your love for me by English propriety even before you had seen her beautiful eyes. There was no reason why I should tell her all my disgrace,--anxious as I was to be of service. Besides, as I put it, she was sure to be better pleased. But I did tell her how unwillingly you had spared me an hour of your company;--what a trouble I had been to you;--how you would have shirked me if you could!\"\n\"Winifrid, that is untrue.\"\n\"That wretched journey to Lowestoft was the great crime. Mr. Roger Carbury, who I own is poison to me--\"\n\"You do not know him.\"\n\"Knowing him or not I choose to have my own opinion, sir. I say that he is poison to me, and I say that he had so stuffed her mind with the flagrant sin of that journey, with the peculiar wickedness of our having lived for two nights under the same roof, with the awful fact that we had travelled together in the same carriage, till that had become the one stumbling block on your path to happiness.\"\n\"He never said a word to her of our being there.\"\n\"Who did then? But what matters? She knew it;--and, as the only means of whitewashing you in her eyes, I did tell her how cruel and how heartless you had been to me. I did explain how the return of friendship which you had begun to show me, had been frozen, harder than Wenham ice, by the appearance of Mr. Carbury on the sands. Perhaps I went a little farther and hinted that the meeting had been arranged as affording you the easiest means of escape from me.\"\n\"You do not believe that.\"\n\"You see I had your welfare to look after; and the baser your conduct had been to me, the truer you were in her eyes. Do I not deserve some thanks for what I did? Surely you would not have had me tell her that your conduct to me had been that of a loyal, loving gentleman. I confessed to her my utter despair;--I abased myself in the dust, as a woman is abased who has been treacherously ill-used, and has failed to avenge herself. I knew that when she was sure that I was prostrate and hopeless she would be triumphant and contented. I told her on your behalf how I had been ground to pieces under your chariot wheels. And now you have not a word of thanks to give me!\"\n\"Every word you say is a dagger.\"\n\"You know where to go for salve for such skin-deep scratches as I make. Where am I to find a surgeon who can put together my crushed bones? Daggers, indeed! Do you not suppose that in thinking of you I have often thought of daggers? Why have I not thrust one into your heart, so that I might rescue you from the arms of this puny, spiritless English girl?\" All this time she was still seated, looking at him, leaning forward towards him with her hands upon her brow. \"But, Paul, I spit out my words to you, like any common woman, not because they will hurt you, but because I know I may take that comfort, such as it is, without hurting you. You are uneasy for a moment while you are here, and I have a cruel pleasure in thinking that you cannot answer me. But you will go from me to her, and then will you not be happy? When you are sitting with your arm round her waist, and when she is playing with your smiles, will the memory of my words interfere with your joy then? Ask yourself whether the prick will last longer than the moment. But where am I to go for happiness and joy? Can you understand what it is to have to live only on retrospects?\"\n\"I wish I could say a word to comfort you.\"\n\"You cannot say a word to comfort me, unless you will unsay all that you have said since I have been in England. I never expect comfort again. But, Paul, I will not be cruel to the end. I will tell you all that I know of my concerns, even though my doing so should justify your treatment of me. He is not dead.\"\n\"You mean Mr. Hurtle.\"\n\"Whom else should I mean? And he himself says that the divorce which was declared between us was no divorce. Mr. Fisker came here to me with tidings. Though he is not a man whom I specially love,--though I know that he has been my enemy with you,--I shall return with him to San Francisco.\"\n\"I am told that he is taking Madame Melmotte with him, and Melmotte's daughter.\"\n\"So I understand. They are adventurers,--as I am, and I do not see why we should not suit each other.\"\n\"They say also that Fisker will marry Miss Melmotte.\"\n\"Why should I object to that? I shall not be jealous of Mr. Fisker's attentions to the young lady. But it will suit me to have some one to whom I can speak on friendly terms when I am back in California. I may have a job of work to do there which will require the backing of some friends. I shall be hand-and-glove with these people before I have travelled half across the ocean with them.\"\n\"I hope they will be kind to you,\" said Paul.\n\"No;--but I will be kind to them. I have conquered others by being kind, but I have never had much kindness myself. Did I not conquer you, sir, by being gentle and gracious to you? Ah, how kind I was to that poor wretch, till he lost himself in drink! And then, Paul, I used to think of better people, perhaps of softer people, of things that should be clean and sweet and gentle,--of things that should smell of lavender instead of wild garlic. I would dream of fair, feminine women,--of women who would be scared by seeing what I saw, who would die rather than do what I did. And then I met you, Paul, and I said that my dreams should come true. I ought to have known that it could not be so. I did not dare quite to tell you all the truth. I know I was wrong, and now the punishment has come upon me. Well;--I suppose you had better say good-bye to me. What is the good of putting it off?\" Then she rose from her chair and stood before him with her arms hanging listlessly by her side.\n\"God bless you, Winifrid!\" he said, putting out his hand to her.\n\"But he won't. Why should he,--if we are right in supposing that they who do good will be blessed for their good, and those who do evil cursed for their evil? I cannot do good. I cannot bring myself now not to wish that you would return to me. If you would come I should care nothing for the misery of that girl,--nothing, at least nothing now, for the misery I should certainly bring upon you. Look here;--will you have this back?\" As she asked this she took from out her bosom a small miniature portrait of himself which he had given her in New York, and held it towards him.\n\"If you wish it I will,--of course,\" he said.\n\"I would not part with it for all the gold in California. Nothing on earth shall ever part me from it. Should I ever marry another man,--as I may do,--he must take me and this together. While I live it shall be next my heart. As you know, I have but little respect for the proprieties of life. I do not see why I am to abandon the picture of the man I love because he becomes the husband of another woman. Having once said that I love you I shall not contradict myself because you have deserted me. Paul, I have loved you, and do love you,--oh, with my very heart of hearts.\" So speaking she threw herself into his arms and covered his face with kisses. \"For one moment you shall not banish me. For one short minute I will be here. Oh, Paul, my love;--my love!\"\nAll this to him was simply agony,--though as she had truly said it was an agony he would soon forget. But to be told by a woman of her love,--without being able even to promise love in return,--to be so told while you are in the very act of acknowledging your love for another woman,--carries with it but little of the joy of triumph. He did not want to see her raging like a tigress, as he had once thought might be his fate; but he would have preferred the continuance of moderate resentment to this flood of tenderness. Of course he stood with his arm round her waist, and of course he returned her caresses; but he did it with such stiff constraint that she at once felt how chill they were. \"There,\" she said, smiling through her bitter tears,--\"there; you are released now, and not even my fingers shall ever be laid upon you again. If I have annoyed you, at this our last meeting, you must forgive me.\"\n\"No;--but you cut me to the heart.\"\n\"That we can hardly help;--can we? When two persons have made fools of themselves as we have, there must I suppose be some punishment. Yours will never be heavy after I am gone. I do not start till the first of next month because that is the day fixed by our friend, Mr. Fisker, and I shall remain here till then because my presence is convenient to Mrs. Pipkin; but I need not trouble you to come to me again. Indeed it will be better that you should not. Good-bye.\"\nHe took her by the hand, and stood for a moment looking at her, while she smiled and gently nodded her head at him. Then he essayed to pull her towards him as though he would again kiss her. But she repulsed him, still smiling the while. \"No, sir; no; not again; never again, never,--never,--never again.\" By that time she had recovered her hand and stood apart from him. \"Good-bye, Paul;--and now go.\" Then he turned round and left the room without uttering a word.\nShe stood still, without moving a limb, as she listened to his step down the stairs and to the opening and the closing of the door. Then hiding herself at the window with the scanty drapery of the curtain she watched him as he went along the street. When he had turned the corner she came back to the centre of the room, stood for a moment with her arms stretched out towards the walls, and then fell prone upon the floor. She had spoken the very truth when she said that she had loved him with all her heart.\n[Illlustration: Mrs. Hurtle at the window.]\nBut that evening she bade Mrs. Pipkin drink tea with her and was more gracious to the poor woman than ever. When the obsequious but still curious landlady asked some question about Mr. Montague, Mrs. Hurtle seemed to speak very freely on the subject of her late lover,--and to speak without any great pain. They had put their heads together, she said, and had found that the marriage would not be suitable. Each of them preferred their own country, and so they had agreed to part. On that evening Mrs. Hurtle made herself more than usually pleasant, having the children up into her room, and giving them jam and bread-and-butter. During the whole of the next fortnight she seemed to take a delight in doing all in her power for Mrs. Pipkin and her family. She gave toys to the children, and absolutely bestowed upon Mrs. Pipkin a new carpet for the drawing-room. Then Mr. Fisker came and took her away with him to America; and Mrs. Pipkin was left,--a desolate but grateful woman.\n\"They do tell bad things about them Americans,\" she said to a friend in the street, \"and I don't pretend to know. But for a lodger, I only wish Providence would send me another just like the one I have lost. She had that good nature about her she liked to see the bairns eating pudding just as if they was her own.\"\nI think Mrs. Pipkin was right, and that Mrs. Hurtle, with all her faults, was a good-natured woman.",
        "paragraph_chars": [
            [
                0,
                1502
            ],
            [
                1502,
                2887
            ],
            [
                2887,
                3363
            ],
            [
                3363,
                3412
            ],
            [
                3412,
                3449
            ],
            [
                3449,
                3480
            ],
            [
                3480,
                3525
            ],
            [
                3525,
                3631
            ],
            [
                3631,
                3740
            ],
            [
                3740,
                3949
            ],
            [
                3949,
                4318
            ],
            [
                4318,
                5313
            ],
            [
                5313,
                5573
            ],
            [
                5573,
                6069
            ],
            [
                6069,
                7231
            ],
            [
                7231,
                7286
            ],
            [
                7286,
                7355
            ],
            [
                7355,
                7426
            ],
            [
                7426,
                7583
            ],
            [
                7583,
                7620
            ],
            [
                7620,
                7925
            ],
            [
                7925,
                7959
            ],
            [
                7959,
                8387
            ],
            [
                8387,
                8415
            ],
            [
                8415,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9207
            ],
            [
                9207,
                9230
            ],
            [
                9230,
                9631
            ],
            [
                9631,
                9681
            ],
            [
                9681,
                10143
            ],
            [
                10143,
                10170
            ],
            [
                10170,
                10841
            ],
            [
                10841,
                10875
            ],
            [
                10875,
                12025
            ],
            [
                12025,
                12069
            ],
            [
                12069,
                12381
            ],
            [
                12381,
                12404
            ],
            [
                12404,
                12695
            ],
            [
                12695,
                12776
            ],
            [
                12776,
                12879
            ],
            [
                12879,
                12933
            ],
            [
                12933,
                13324
            ],
            [
                13324,
                13370
            ],
            [
                13370,
                14359
            ],
            [
                14359,
                14424
            ],
            [
                14424,
                15002
            ],
            [
                15002,
                15048
            ],
            [
                15048,
                15810
            ],
            [
                15810,
                16720
            ],
            [
                16720,
                16756
            ],
            [
                16756,
                17224
            ],
            [
                17224,
                17691
            ],
            [
                17691,
                18201
            ],
            [
                18201,
                18245
            ],
            [
                18245,
                19226
            ],
            [
                19226,
                19542
            ],
            [
                19542,
                19641
            ]
        ],
        "segment_chars": [
            [
                0,
                358
            ],
            [
                358,
                487
            ],
            [
                487,
                514
            ],
            [
                514,
                536
            ],
            [
                536,
                573
            ],
            [
                573,
                687
            ],
            [
                687,
                720
            ],
            [
                720,
                904
            ],
            [
                904,
                1046
            ],
            [
                1046,
                1372
            ],
            [
                1372,
                1502
            ],
            [
                1502,
                1587
            ],
            [
                1587,
                1804
            ],
            [
                1804,
                1971
            ],
            [
                1971,
                2142
            ],
            [
                2142,
                2194
            ],
            [
                2194,
                2246
            ],
            [
                2246,
                2390
            ],
            [
                2390,
                2463
            ],
            [
                2463,
                2597
            ],
            [
                2597,
                2745
            ],
            [
                2745,
                2887
            ],
            [
                2887,
                2936
            ],
            [
                2936,
                3011
            ],
            [
                3011,
                3099
            ],
            [
                3099,
                3156
            ],
            [
                3156,
                3363
            ],
            [
                3363,
                3412
            ],
            [
                3412,
                3449
            ],
            [
                3449,
                3480
            ],
            [
                3480,
                3525
            ],
            [
                3525,
                3567
            ],
            [
                3567,
                3631
            ],
            [
                3631,
                3645
            ],
            [
                3645,
                3740
            ],
            [
                3740,
                3868
            ],
            [
                3868,
                3917
            ],
            [
                3917,
                3949
            ],
            [
                3949,
                3970
            ],
            [
                3970,
                4013
            ],
            [
                4013,
                4029
            ],
            [
                4029,
                4073
            ],
            [
                4073,
                4161
            ],
            [
                4161,
                4239
            ],
            [
                4239,
                4318
            ],
            [
                4318,
                4373
            ],
            [
                4373,
                4474
            ],
            [
                4474,
                4564
            ],
            [
                4564,
                4607
            ],
            [
                4607,
                4713
            ],
            [
                4713,
                4874
            ],
            [
                4874,
                5074
            ],
            [
                5074,
                5151
            ],
            [
                5151,
                5184
            ],
            [
                5184,
                5313
            ],
            [
                5313,
                5333
            ],
            [
                5333,
                5369
            ],
            [
                5369,
                5393
            ],
            [
                5393,
                5573
            ],
            [
                5573,
                5888
            ],
            [
                5888,
                5972
            ],
            [
                5972,
                6069
            ],
            [
                6069,
                6136
            ],
            [
                6136,
                6194
            ],
            [
                6194,
                6258
            ],
            [
                6258,
                6337
            ],
            [
                6337,
                6450
            ],
            [
                6450,
                6584
            ],
            [
                6584,
                6617
            ],
            [
                6617,
                6695
            ],
            [
                6695,
                6814
            ],
            [
                6814,
                6985
            ],
            [
                6985,
                7132
            ],
            [
                7132,
                7189
            ],
            [
                7189,
                7231
            ],
            [
                7231,
                7286
            ],
            [
                7286,
                7355
            ],
            [
                7355,
                7410
            ],
            [
                7410,
                7426
            ],
            [
                7426,
                7516
            ],
            [
                7516,
                7554
            ],
            [
                7554,
                7583
            ],
            [
                7583,
                7620
            ],
            [
                7620,
                7648
            ],
            [
                7648,
                7725
            ],
            [
                7725,
                7758
            ],
            [
                7758,
                7826
            ],
            [
                7826,
                7925
            ],
            [
                7925,
                7959
            ],
            [
                7959,
                7992
            ],
            [
                7992,
                8022
            ],
            [
                8022,
                8074
            ],
            [
                8074,
                8102
            ],
            [
                8102,
                8128
            ],
            [
                8128,
                8243
            ],
            [
                8243,
                8300
            ],
            [
                8300,
                8387
            ],
            [
                8387,
                8415
            ],
            [
                8415,
                8438
            ],
            [
                8438,
                8489
            ],
            [
                8489,
                8551
            ],
            [
                8551,
                8763
            ],
            [
                8763,
                8858
            ],
            [
                8858,
                8915
            ],
            [
                8915,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9159
            ],
            [
                9159,
                9207
            ],
            [
                9207,
                9230
            ],
            [
                9230,
                9288
            ],
            [
                9288,
                9631
            ],
            [
                9631,
                9681
            ],
            [
                9681,
                9696
            ],
            [
                9696,
                9714
            ],
            [
                9714,
                9847
            ],
            [
                9847,
                10010
            ],
            [
                10010,
                10143
            ],
            [
                10143,
                10170
            ],
            [
                10170,
                10288
            ],
            [
                10288,
                10333
            ],
            [
                10333,
                10443
            ],
            [
                10443,
                10602
            ],
            [
                10602,
                10705
            ],
            [
                10705,
                10790
            ],
            [
                10790,
                10841
            ],
            [
                10841,
                10875
            ],
            [
                10875,
                10947
            ],
            [
                10947,
                11015
            ],
            [
                11015,
                11032
            ],
            [
                11032,
                11108
            ],
            [
                11108,
                11232
            ],
            [
                11232,
                11342
            ],
            [
                11342,
                11517
            ],
            [
                11517,
                11632
            ],
            [
                11632,
                11696
            ],
            [
                11696,
                11848
            ],
            [
                11848,
                11913
            ],
            [
                11913,
                11957
            ],
            [
                11957,
                12025
            ],
            [
                12025,
                12069
            ],
            [
                12069,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12255
            ],
            [
                12255,
                12364
            ],
            [
                12364,
                12381
            ],
            [
                12381,
                12404
            ],
            [
                12404,
                12430
            ],
            [
                12430,
                12513
            ],
            [
                12513,
                12554
            ],
            [
                12554,
                12695
            ],
            [
                12695,
                12776
            ],
            [
                12776,
                12794
            ],
            [
                12794,
                12879
            ],
            [
                12879,
                12933
            ],
            [
                12933,
                12963
            ],
            [
                12963,
                13032
            ],
            [
                13032,
                13137
            ],
            [
                13137,
                13222
            ],
            [
                13222,
                13324
            ],
            [
                13324,
                13370
            ],
            [
                13370,
                13404
            ],
            [
                13404,
                13486
            ],
            [
                13486,
                13551
            ],
            [
                13551,
                13622
            ],
            [
                13622,
                13816
            ],
            [
                13816,
                13948
            ],
            [
                13948,
                14018
            ],
            [
                14018,
                14065
            ],
            [
                14065,
                14113
            ],
            [
                14113,
                14174
            ],
            [
                14174,
                14226
            ],
            [
                14226,
                14263
            ],
            [
                14263,
                14359
            ],
            [
                14359,
                14386
            ],
            [
                14386,
                14424
            ],
            [
                14424,
                14439
            ],
            [
                14439,
                14583
            ],
            [
                14583,
                14601
            ],
            [
                14601,
                14668
            ],
            [
                14668,
                14819
            ],
            [
                14819,
                14857
            ],
            [
                14857,
                15002
            ],
            [
                15002,
                15048
            ],
            [
                15048,
                15106
            ],
            [
                15106,
                15151
            ],
            [
                15151,
                15234
            ],
            [
                15234,
                15274
            ],
            [
                15274,
                15342
            ],
            [
                15342,
                15454
            ],
            [
                15454,
                15547
            ],
            [
                15547,
                15624
            ],
            [
                15624,
                15702
            ],
            [
                15702,
                15743
            ],
            [
                15743,
                15780
            ],
            [
                15780,
                15810
            ],
            [
                15810,
                15912
            ],
            [
                15912,
                16145
            ],
            [
                16145,
                16333
            ],
            [
                16333,
                16506
            ],
            [
                16506,
                16649
            ],
            [
                16649,
                16720
            ],
            [
                16720,
                16756
            ],
            [
                16756,
                16791
            ],
            [
                16791,
                16891
            ],
            [
                16891,
                16934
            ],
            [
                16934,
                17167
            ],
            [
                17167,
                17213
            ],
            [
                17213,
                17224
            ],
            [
                17224,
                17340
            ],
            [
                17340,
                17415
            ],
            [
                17415,
                17462
            ],
            [
                17462,
                17530
            ],
            [
                17530,
                17596
            ],
            [
                17596,
                17627
            ],
            [
                17627,
                17691
            ],
            [
                17691,
                17823
            ],
            [
                17823,
                17941
            ],
            [
                17941,
                18114
            ],
            [
                18114,
                18201
            ],
            [
                18201,
                18245
            ],
            [
                18245,
                18353
            ],
            [
                18353,
                18552
            ],
            [
                18552,
                18652
            ],
            [
                18652,
                18726
            ],
            [
                18726,
                18875
            ],
            [
                18875,
                19001
            ],
            [
                19001,
                19108
            ],
            [
                19108,
                19226
            ],
            [
                19226,
                19340
            ],
            [
                19340,
                19434
            ],
            [
                19434,
                19542
            ],
            [
                19542,
                19641
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                89,
                112
            ],
            [
                117,
                122
            ],
            [
                128,
                137
            ],
            [
                148,
                230
            ],
            [
                300,
                358
            ],
            [
                358,
                361
            ],
            [
                371,
                400
            ],
            [
                445,
                487
            ],
            [
                514,
                517
            ],
            [
                487,
                513
            ],
            [
                536,
                543
            ],
            [
                557,
                564
            ],
            [
                568,
                573
            ],
            [
                687,
                720
            ],
            [
                720,
                723
            ],
            [
                904,
                972
            ],
            [
                977,
                981
            ],
            [
                738,
                740
            ],
            [
                831,
                833
            ],
            [
                1009,
                1046
            ],
            [
                1059,
                1062
            ],
            [
                1324,
                1372
            ],
            [
                1372,
                1410
            ],
            [
                1417,
                1420
            ],
            [
                1426,
                1435
            ],
            [
                1456,
                1463
            ],
            [
                1471,
                1484
            ],
            [
                1500,
                1502
            ],
            [
                1502,
                1587
            ],
            [
                1587,
                1603
            ],
            [
                1605,
                1625
            ],
            [
                1670,
                1677
            ],
            [
                1750,
                1752
            ],
            [
                1694,
                1717
            ],
            [
                1802,
                1804
            ],
            [
                1808,
                1846
            ],
            [
                1878,
                1887
            ],
            [
                1896,
                1918
            ],
            [
                1969,
                1971
            ],
            [
                1971,
                2000
            ],
            [
                2016,
                2017
            ],
            [
                2142,
                2154
            ],
            [
                2160,
                2194
            ],
            [
                2198,
                2201
            ],
            [
                2215,
                2231
            ],
            [
                2244,
                2246
            ],
            [
                2246,
                2295
            ],
            [
                2358,
                2365
            ],
            [
                2368,
                2389
            ],
            [
                2426,
                2463
            ],
            [
                2463,
                2511
            ],
            [
                2564,
                2597
            ],
            [
                2597,
                2736
            ],
            [
                2743,
                2744
            ],
            [
                2887,
                2890
            ],
            [
                2894,
                2921
            ],
            [
                2923,
                2929
            ],
            [
                2933,
                2936
            ],
            [
                2936,
                3011
            ],
            [
                3011,
                3051
            ],
            [
                3097,
                3099
            ],
            [
                3099,
                3100
            ],
            [
                3119,
                3155
            ],
            [
                3449,
                3480
            ],
            [
                3480,
                3525
            ],
            [
                3525,
                3543
            ],
            [
                3545,
                3564
            ],
            [
                3752,
                3767
            ],
            [
                3776,
                3794
            ],
            [
                3823,
                3865
            ],
            [
                3743,
                3744
            ],
            [
                3918,
                3949
            ],
            [
                3949,
                3969
            ],
            [
                3970,
                4011
            ],
            [
                3915,
                3916
            ],
            [
                3868,
                3879
            ],
            [
                4011,
                4012
            ],
            [
                4318,
                4329
            ],
            [
                4392,
                4435
            ],
            [
                4444,
                4474
            ],
            [
                4564,
                4607
            ],
            [
                4607,
                4713
            ],
            [
                4713,
                4745
            ],
            [
                4872,
                4874
            ],
            [
                4879,
                4890
            ],
            [
                4934,
                4935
            ],
            [
                4986,
                5007
            ],
            [
                5074,
                5129
            ],
            [
                5140,
                5151
            ],
            [
                5151,
                5183
            ],
            [
                5313,
                5326
            ],
            [
                5329,
                5333
            ],
            [
                5333,
                5355
            ],
            [
                5573,
                5630
            ],
            [
                5638,
                5683
            ],
            [
                5868,
                5870
            ],
            [
                5693,
                5722
            ],
            [
                5766,
                5778
            ],
            [
                5982,
                5989
            ],
            [
                5990,
                6011
            ],
            [
                5960,
                5962
            ],
            [
                5810,
                5814
            ],
            [
                6067,
                6069
            ],
            [
                6069,
                6072
            ],
            [
                6080,
                6136
            ],
            [
                6136,
                6161
            ],
            [
                6198,
                6220
            ],
            [
                6162,
                6175
            ],
            [
                6182,
                6193
            ],
            [
                6337,
                6344
            ],
            [
                6368,
                6397
            ],
            [
                6448,
                6449
            ],
            [
                6584,
                6617
            ],
            [
                6617,
                6695
            ],
            [
                6695,
                6789
            ],
            [
                6796,
                6797
            ],
            [
                6985,
                7066
            ],
            [
                7097,
                7132
            ],
            [
                7189,
                7231
            ],
            [
                7355,
                7400
            ],
            [
                7406,
                7410
            ],
            [
                7410,
                7426
            ],
            [
                7426,
                7454
            ],
            [
                7456,
                7495
            ],
            [
                7514,
                7516
            ],
            [
                7516,
                7545
            ],
            [
                7549,
                7552
            ],
            [
                7583,
                7599
            ],
            [
                7601,
                7620
            ],
            [
                7620,
                7648
            ],
            [
                7648,
                7697
            ],
            [
                7720,
                7723
            ],
            [
                7707,
                7710
            ],
            [
                7711,
                7719
            ],
            [
                7723,
                7725
            ],
            [
                7758,
                7782
            ],
            [
                7791,
                7824
            ],
            [
                7925,
                7959
            ],
            [
                7959,
                7968
            ],
            [
                7971,
                7992
            ],
            [
                8102,
                8118
            ],
            [
                8122,
                8128
            ],
            [
                8243,
                8300
            ],
            [
                8300,
                8387
            ],
            [
                8387,
                8415
            ],
            [
                8415,
                8438
            ],
            [
                8551,
                8763
            ],
            [
                8915,
                8933
            ],
            [
                8994,
                9027
            ],
            [
                9029,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9159
            ],
            [
                9159,
                9181
            ],
            [
                9188,
                9203
            ],
            [
                9207,
                9227
            ],
            [
                9632,
                9681
            ],
            [
                9681,
                9696
            ],
            [
                9696,
                9714
            ],
            [
                9714,
                9726
            ],
            [
                9728,
                9785
            ],
            [
                9795,
                9812
            ],
            [
                9817,
                9847
            ],
            [
                10217,
                10288
            ],
            [
                10288,
                10316
            ],
            [
                10331,
                10333
            ],
            [
                10481,
                10508
            ],
            [
                10600,
                10602
            ],
            [
                10602,
                10613
            ],
            [
                10666,
                10705
            ],
            [
                10705,
                10790
            ],
            [
                10790,
                10841
            ],
            [
                10841,
                10875
            ],
            [
                10875,
                10876
            ],
            [
                10926,
                10935
            ],
            [
                10939,
                10947
            ],
            [
                10947,
                11015
            ],
            [
                11015,
                11032
            ],
            [
                11108,
                11149
            ],
            [
                11229,
                11232
            ],
            [
                11246,
                11249
            ],
            [
                11276,
                11282
            ],
            [
                11340,
                11342
            ],
            [
                11342,
                11343
            ],
            [
                11348,
                11353
            ],
            [
                11377,
                11380
            ],
            [
                11645,
                11663
            ],
            [
                11636,
                11644
            ],
            [
                11686,
                11694
            ],
            [
                11515,
                11516
            ],
            [
                11913,
                11955
            ],
            [
                12025,
                12069
            ],
            [
                12069,
                12080
            ],
            [
                12180,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12255
            ],
            [
                12255,
                12314
            ],
            [
                12334,
                12364
            ],
            [
                12364,
                12381
            ],
            [
                12381,
                12404
            ],
            [
                12404,
                12430
            ],
            [
                12430,
                12436
            ],
            [
                12445,
                12454
            ],
            [
                12459,
                12466
            ],
            [
                12497,
                12513
            ],
            [
                12513,
                12544
            ],
            [
                12552,
                12554
            ],
            [
                12554,
                12599
            ],
            [
                12652,
                12692
            ],
            [
                12711,
                12776
            ],
            [
                12879,
                12888
            ],
            [
                12894,
                12933
            ],
            [
                12933,
                12963
            ],
            [
                13032,
                13059
            ],
            [
                13107,
                13135
            ],
            [
                13324,
                13370
            ],
            [
                13370,
                13374
            ],
            [
                13376,
                13404
            ],
            [
                13404,
                13486
            ],
            [
                13486,
                13542
            ],
            [
                13549,
                13551
            ],
            [
                13551,
                13582
            ],
            [
                13589,
                13622
            ],
            [
                13622,
                13663
            ],
            [
                13670,
                13671
            ],
            [
                13683,
                13696
            ],
            [
                13729,
                13732
            ],
            [
                13957,
                13967
            ],
            [
                13978,
                14018
            ],
            [
                14065,
                14079
            ],
            [
                14086,
                14113
            ],
            [
                14113,
                14131
            ],
            [
                14172,
                14174
            ],
            [
                14174,
                14179
            ],
            [
                14181,
                14224
            ],
            [
                14359,
                14386
            ],
            [
                14386,
                14415
            ],
            [
                14422,
                14424
            ],
            [
                14424,
                14439
            ],
            [
                14439,
                14452
            ],
            [
                14581,
                14583
            ],
            [
                14583,
                14601
            ],
            [
                14668,
                14685
            ],
            [
                14661,
                14666
            ],
            [
                14686,
                14711
            ],
            [
                14726,
                14735
            ],
            [
                14716,
                14722
            ],
            [
                14817,
                14819
            ],
            [
                14819,
                14829
            ],
            [
                14831,
                14857
            ],
            [
                14875,
                14883
            ],
            [
                14889,
                14892
            ],
            [
                14903,
                14975
            ],
            [
                15000,
                15002
            ],
            [
                15002,
                15024
            ],
            [
                15048,
                15106
            ],
            [
                15234,
                15274
            ],
            [
                15454,
                15486
            ],
            [
                15487,
                15547
            ],
            [
                15547,
                15586
            ],
            [
                15589,
                15624
            ],
            [
                15624,
                15702
            ],
            [
                15702,
                15743
            ],
            [
                15780,
                15797
            ],
            [
                15800,
                15810
            ],
            [
                15810,
                15842
            ],
            [
                15910,
                15912
            ],
            [
                16145,
                16204
            ],
            [
                16210,
                16217
            ],
            [
                16218,
                16223
            ],
            [
                16235,
                16264
            ],
            [
                16284,
                16333
            ],
            [
                16333,
                16471
            ],
            [
                16480,
                16505
            ],
            [
                16506,
                16557
            ],
            [
                16566,
                16567
            ],
            [
                16560,
                16561
            ],
            [
                16568,
                16588
            ],
            [
                16647,
                16649
            ],
            [
                16649,
                16670
            ],
            [
                16696,
                16720
            ],
            [
                16720,
                16724
            ],
            [
                16726,
                16756
            ],
            [
                16791,
                16891
            ],
            [
                17174,
                17176
            ],
            [
                16991,
                16993
            ],
            [
                17185,
                17211
            ],
            [
                17149,
                17166
            ],
            [
                17213,
                17224
            ],
            [
                17224,
                17235
            ],
            [
                17243,
                17286
            ],
            [
                17338,
                17340
            ],
            [
                17340,
                17347
            ],
            [
                17356,
                17415
            ],
            [
                17415,
                17436
            ],
            [
                17443,
                17461
            ],
            [
                17462,
                17475
            ],
            [
                17516,
                17530
            ],
            [
                17543,
                17546
            ],
            [
                17551,
                17596
            ],
            [
                17596,
                17612
            ],
            [
                17614,
                17627
            ],
            [
                17632,
                17634
            ],
            [
                17652,
                17673
            ],
            [
                17683,
                17691
            ],
            [
                17691,
                17706
            ],
            [
                17731,
                17778
            ],
            [
                17782,
                17797
            ],
            [
                17802,
                17823
            ],
            [
                17971,
                17974
            ],
            [
                18012,
                18058
            ],
            [
                18076,
                18114
            ],
            [
                18114,
                18132
            ],
            [
                18138,
                18201
            ],
            [
                18245,
                18301
            ],
            [
                18302,
                18323
            ],
            [
                18342,
                18353
            ],
            [
                18353,
                18361
            ],
            [
                18383,
                18405
            ],
            [
                18420,
                18467
            ],
            [
                18528,
                18552
            ],
            [
                18552,
                18652
            ],
            [
                18652,
                18725
            ],
            [
                18875,
                18881
            ],
            [
                18895,
                18913
            ],
            [
                18918,
                18932
            ],
            [
                18935,
                19001
            ],
            [
                19001,
                19035
            ],
            [
                19047,
                19108
            ],
            [
                19108,
                19192
            ],
            [
                19197,
                19218
            ],
            [
                19224,
                19226
            ],
            [
                19226,
                19231
            ],
            [
                19235,
                19294
            ],
            [
                19338,
                19340
            ],
            [
                19340,
                19343
            ],
            [
                19358,
                19402
            ],
            [
                19350,
                19356
            ],
            [
                19408,
                19434
            ],
            [
                19434,
                19542
            ],
            [
                19542,
                19641
            ]
        ],
        "row_chars": [
            [
                0,
                358
            ],
            [
                358,
                487
            ],
            [
                487,
                536
            ],
            [
                536,
                573
            ],
            [
                573,
                687
            ],
            [
                687,
                720
            ],
            [
                720,
                1046
            ],
            [
                1046,
                1372
            ],
            [
                1372,
                1502
            ],
            [
                1502,
                1587
            ],
            [
                1587,
                1804
            ],
            [
                1804,
                1971
            ],
            [
                1971,
                2194
            ],
            [
                2194,
                2246
            ],
            [
                2246,
                2390
            ],
            [
                2390,
                2463
            ],
            [
                2463,
                2597
            ],
            [
                2597,
                2745
            ],
            [
                2745,
                2887
            ],
            [
                2887,
                2936
            ],
            [
                2936,
                3011
            ],
            [
                3011,
                3099
            ],
            [
                3099,
                3156
            ],
            [
                3156,
                3363
            ],
            [
                3363,
                3412
            ],
            [
                3412,
                3449
            ],
            [
                3449,
                3480
            ],
            [
                3480,
                3525
            ],
            [
                3525,
                3567
            ],
            [
                3567,
                3631
            ],
            [
                3631,
                3645
            ],
            [
                3645,
                3740
            ],
            [
                3740,
                3868
            ],
            [
                3868,
                4013
            ],
            [
                4013,
                4029
            ],
            [
                4029,
                4073
            ],
            [
                4073,
                4161
            ],
            [
                4161,
                4239
            ],
            [
                4239,
                4318
            ],
            [
                4318,
                4474
            ],
            [
                4474,
                4564
            ],
            [
                4564,
                4607
            ],
            [
                4607,
                4713
            ],
            [
                4713,
                4874
            ],
            [
                4874,
                5151
            ],
            [
                5151,
                5184
            ],
            [
                5184,
                5313
            ],
            [
                5313,
                5333
            ],
            [
                5333,
                5369
            ],
            [
                5369,
                5393
            ],
            [
                5393,
                5573
            ],
            [
                5573,
                6069
            ],
            [
                6069,
                6136
            ],
            [
                6136,
                6258
            ],
            [
                6258,
                6337
            ],
            [
                6337,
                6450
            ],
            [
                6450,
                6584
            ],
            [
                6584,
                6617
            ],
            [
                6617,
                6695
            ],
            [
                6695,
                6814
            ],
            [
                6814,
                6985
            ],
            [
                6985,
                7132
            ],
            [
                7132,
                7189
            ],
            [
                7189,
                7231
            ],
            [
                7231,
                7286
            ],
            [
                7286,
                7355
            ],
            [
                7355,
                7410
            ],
            [
                7410,
                7426
            ],
            [
                7426,
                7516
            ],
            [
                7516,
                7554
            ],
            [
                7554,
                7583
            ],
            [
                7583,
                7620
            ],
            [
                7620,
                7648
            ],
            [
                7648,
                7725
            ],
            [
                7725,
                7758
            ],
            [
                7758,
                7826
            ],
            [
                7826,
                7925
            ],
            [
                7925,
                7959
            ],
            [
                7959,
                7992
            ],
            [
                7992,
                8022
            ],
            [
                8022,
                8074
            ],
            [
                8074,
                8102
            ],
            [
                8102,
                8128
            ],
            [
                8128,
                8243
            ],
            [
                8243,
                8300
            ],
            [
                8300,
                8387
            ],
            [
                8387,
                8415
            ],
            [
                8415,
                8438
            ],
            [
                8438,
                8489
            ],
            [
                8489,
                8551
            ],
            [
                8551,
                8763
            ],
            [
                8763,
                8858
            ],
            [
                8858,
                8915
            ],
            [
                8915,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9159
            ],
            [
                9159,
                9207
            ],
            [
                9207,
                9230
            ],
            [
                9230,
                9288
            ],
            [
                9288,
                9631
            ],
            [
                9631,
                9681
            ],
            [
                9681,
                9696
            ],
            [
                9696,
                9714
            ],
            [
                9714,
                9847
            ],
            [
                9847,
                10010
            ],
            [
                10010,
                10143
            ],
            [
                10143,
                10170
            ],
            [
                10170,
                10288
            ],
            [
                10288,
                10333
            ],
            [
                10333,
                10443
            ],
            [
                10443,
                10602
            ],
            [
                10602,
                10705
            ],
            [
                10705,
                10790
            ],
            [
                10790,
                10841
            ],
            [
                10841,
                10875
            ],
            [
                10875,
                10947
            ],
            [
                10947,
                11015
            ],
            [
                11015,
                11032
            ],
            [
                11032,
                11108
            ],
            [
                11108,
                11232
            ],
            [
                11232,
                11342
            ],
            [
                11342,
                11696
            ],
            [
                11696,
                11848
            ],
            [
                11848,
                11913
            ],
            [
                11913,
                11957
            ],
            [
                11957,
                12025
            ],
            [
                12025,
                12069
            ],
            [
                12069,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12212,
                12255
            ],
            [
                12255,
                12364
            ],
            [
                12364,
                12381
            ],
            [
                12381,
                12404
            ],
            [
                12404,
                12430
            ],
            [
                12430,
                12513
            ],
            [
                12513,
                12554
            ],
            [
                12554,
                12695
            ],
            [
                12695,
                12776
            ],
            [
                12776,
                12794
            ],
            [
                12794,
                12879
            ],
            [
                12879,
                12933
            ],
            [
                12933,
                12963
            ],
            [
                12963,
                13032
            ],
            [
                13032,
                13137
            ],
            [
                13137,
                13222
            ],
            [
                13222,
                13324
            ],
            [
                13324,
                13370
            ],
            [
                13370,
                13404
            ],
            [
                13404,
                13486
            ],
            [
                13486,
                13551
            ],
            [
                13551,
                13622
            ],
            [
                13622,
                14018
            ],
            [
                14018,
                14065
            ],
            [
                14065,
                14113
            ],
            [
                14113,
                14174
            ],
            [
                14174,
                14226
            ],
            [
                14226,
                14263
            ],
            [
                14263,
                14359
            ],
            [
                14359,
                14386
            ],
            [
                14386,
                14424
            ],
            [
                14424,
                14439
            ],
            [
                14439,
                14583
            ],
            [
                14583,
                14601
            ],
            [
                14601,
                14819
            ],
            [
                14819,
                14857
            ],
            [
                14857,
                15002
            ],
            [
                15002,
                15048
            ],
            [
                15048,
                15106
            ],
            [
                15106,
                15151
            ],
            [
                15151,
                15234
            ],
            [
                15234,
                15274
            ],
            [
                15274,
                15342
            ],
            [
                15342,
                15454
            ],
            [
                15454,
                15547
            ],
            [
                15547,
                15624
            ],
            [
                15624,
                15702
            ],
            [
                15702,
                15743
            ],
            [
                15743,
                15780
            ],
            [
                15780,
                15810
            ],
            [
                15810,
                15912
            ],
            [
                15912,
                16145
            ],
            [
                16145,
                16333
            ],
            [
                16333,
                16506
            ],
            [
                16506,
                16649
            ],
            [
                16649,
                16720
            ],
            [
                16720,
                16756
            ],
            [
                16756,
                16791
            ],
            [
                16791,
                16891
            ],
            [
                16891,
                16934
            ],
            [
                16934,
                17213
            ],
            [
                17213,
                17224
            ],
            [
                17224,
                17340
            ],
            [
                17340,
                17415
            ],
            [
                17415,
                17462
            ],
            [
                17462,
                17530
            ],
            [
                17530,
                17596
            ],
            [
                17596,
                17627
            ],
            [
                17627,
                17691
            ],
            [
                17691,
                17823
            ],
            [
                17823,
                17941
            ],
            [
                17941,
                18114
            ],
            [
                18114,
                18201
            ],
            [
                18201,
                18245
            ],
            [
                18245,
                18353
            ],
            [
                18353,
                18552
            ],
            [
                18552,
                18652
            ],
            [
                18652,
                18726
            ],
            [
                18726,
                18875
            ],
            [
                18875,
                19001
            ],
            [
                19001,
                19108
            ],
            [
                19108,
                19226
            ],
            [
                19226,
                19340
            ],
            [
                19340,
                19434
            ],
            [
                19434,
                19542
            ],
            [
                19542,
                19641
            ]
        ]
    },
    "abridged": {
        "text": "Mrs. Hurtle had postponed her journey to New York to go to Bungay for the marriage of Ruby Ruggles, not so much from any love for the persons concerned, as from an irresistible tenderness towards Paul Montague. She longed to see him once again, and found it difficult to leave the land in which he was living. She knew there was no hope for her. She had relinquished him. But still she lingered near him. And in her heart of hearts she liked the somewhat stupid tranquillity of life in England compared to the rough tempests of her past days. She even liked Mrs. Pipkin, and almost loved John Crumb. How different would her life have been if she had met a man as true as John Crumb!\nShe loved Paul Montague with all her heart, and she despised herself for loving him. How weak he was; how inefficient; how swathed in scruples and prejudices! Yet she loved him for his very faults, finding something sweet in his English manners. The man had been false to her; but then she had not been quite true with him. Neither had meant to deceive. They had played a game against each other; and he had won - because he was a man.\nShe thought much about these things. He could change his love as often as he pleased, whereas she was ruined by his defection. He could look about for a fresh flower and boldly seek his honey; whereas she could only sit and mourn for the sweets of which she had been robbed.\n\"So Mr. Fisker was Mr. Montague's partner, was he?\" asked Mrs. Pipkin a day or two after their return from the Crumb marriage. For Mr. Fisker had called on Mrs. Hurtle. \"I think he's a nicer man than Mr. Montague.\"\n\"Mr. Montague is a gentleman.\"\n\"I always did say that of him, Mrs. Hurtle.\"\n\"And Mr. Fisker is - an American citizen. He came to me with news from San Francisco, and has offered to take me back with him. I must go some day, you know.\"\n\"I suppose you must. I couldn't hope as you'd stay here always, Mrs. Hurtle,\" said Mrs. Pipkin, starting to weep.\n\"Mr. Fisker will be taking other ladies with him, and I might as well join the party. We shall start on the first of September.\" As this was said about the middle of August there was still some remnant of comfort for poor Mrs. Pipkin. A fortnight gained was something. Mrs. Hurtle added, with her hand on the door, \"By-the-bye, Mrs. Pipkin, I expect Mr. Montague to call tomorrow at eleven. Just show him up when he comes.\"\n\"Mr. Montague - oh! Of course, Mrs. Hurtle.\"\nOn the following morning Mrs. Hurtle dressed herself with more than her usual simplicity, but certainly no less than her usual care, and sat at her desk, although she was too disturbed in her mind to work.\nShe knew that she had been wrong even to desire to see him. She had forgiven him, and had seen the girl, and what more was to be said? She had not planned what she would now say to him.\nThen came the knock at the door. Her heart leaped within her, and she made a last great effort to be tranquil. She heard the steps on the stairs, and then the door was opened and Mr. Montague was announced.\n\"I thought you would come and see me once again before I went,\" said Mrs. Hurtle, putting out her hand to greet him. \"I hope it has not been a trouble to you.\"\n\"I should not have dared to come, had you not asked me. You know that.\"\n\"I know nothing of the kind; but as you are here we will not quarrel about it. Has Miss Carbury pardoned you yet?\"\n\"We are friends, if you mean that.\"\n\"Of course you are friends. She only wanted to have somebody to tell her that you had been maligned. She was ready to believe anyone who would say a good word for you.\"\n\"Did you say a good word for me?\"\n\"Well; no,\" replied Mrs. Hurtle. \"What could I say that was good? I explained to her how very badly you had behaved to me. I let her know that from the moment you had seen her, you had thrown me to the winds.\"\n\"It was not so, my friend.\"\n\"What did that matter? I could not make her understand during one short and rather agonizing interview how you had allowed yourself to be talked out of your love for me by English propriety even before you had seen her beautiful eyes. But I did tell her what a trouble I had been to you; how you would have shirked me if you could!\"\n\"Winifrid, that is untrue.\"\n\"That wretched journey to Lowestoft was the great crime. Mr. Roger Carbury, who is poison to me-\"\n\"You do not know him. He never said a word to her of our being there.\"\n\"Who did then? But what matters? She knew it; and, as the only means of whitewashing you in her eyes, I told her how cruel and heartless you had been to me. The baser your conduct had been to me, the truer you were in her eyes. Do I not deserve some thanks? I abased myself in the dust. I knew that she would be triumphant and contented. I told her on your behalf how I had been ground to pieces under your chariot wheels. And now you have not a word of thanks to give me!\"\n\"Every word you say is a dagger.\"\n\"Those are mere scratches that I make. Where am I to find a surgeon who can put together my crushed bones? Daggers, indeed! Why have I not thrust one into your heart?\" She gazed at him. \"Paul, when you go from me to her, you will be happy. But where am I to go for happiness and joy?\"\n\"I wish I could say a word to comfort you.\"\n\"You cannot. I never expect comfort again. But, Paul, I will not be cruel to the end. I will tell you all that I know of my concerns, even though it may justify your treatment of me. He is not dead.\"\n\"You mean Mr. Hurtle.\"\n\"Whom else should I mean? And he says that our divorce was no divorce. Mr. Fisker came here to me with the news. Though he is not a man whom I specially love, I shall return with him to San Francisco. He is taking Madame Melmotte with him, and Melmotte's daughter.\"\n\"They say that Fisker will marry Miss Melmotte.\"\n\"Why should I object to that? But it will suit me to have friends when I am back in California.\"\n\"I hope they will be kind to you,\" said Paul.\n\"No; but I will be kind to them. I have conquered others by being kind, but I have never had much kindness myself. Did I not conquer you, sir, by being gentle and gracious? Ah, how kind I was to that poor Hurtle, till he lost himself in drink! And then, Paul, I used to think of better, softer people; and when I met you, I said that my dreams should come true. I did not dare to tell you all the truth. I know I was wrong. Well; I suppose you had better say good-bye to me.\"\n\"God bless you, Winifrid!\" he said, putting out his hand.\n\"But he won't. Why should he? I cannot do good. If you would come back to me I should care nothing for that girl's misery. Look here; will you have this back?\" She took out a small miniature portrait of himself which he had given her in New York.\n\"If you wish it I will.\"\n\"I would not part with it for all the gold in California. While I live it shall be next my heart. Having once said that I love you, I shall not contradict myself because you have deserted me. Paul, I have loved you, and do love you - oh, with my very heart of hearts.\" So speaking she threw herself into his arms and covered his face with kisses. \"For one moment you shall not banish me. Oh, Paul, my love - my love!\"\nAll this to him was simply agony. He did not want to see her raging like a tigress, as he had thought she might; but he would have preferred a moderate resentment to this flood of tenderness. Of course he stood with his arm round her waist, and of course he returned her caresses; but he did it with such stiff constraint that she felt how chill they were.\n\"There,\" she said, smiling through her bitter tears; \"you are released now. If I have annoyed you, you must forgive me.\"\n\"No; but you cut me to the heart.\"\n\"When two persons have made fools of themselves as we have, there must I suppose be some punishment. It is better that you should not come to me again. Good-bye.\"\nHe took her hand, and stood for a moment looking at her. Then he tried to pull her towards him as though he would again kiss her. But she repulsed him, smiling the while.\n\"No, sir; no; never again.\" She recovered her hand and stood apart from him. \"Good-bye, Paul; and now go.\" He left the room without a word.\nShe stood still as she listened to his step down the stairs and the opening and closing of the door. She stood for a moment with her arms stretched out, and then fell prone upon the floor. She had spoken the truth when she said that she had loved him with all her heart.\nBut that evening she bade Mrs. Pipkin drink tea with her, and was more gracious than ever. When the curious landlady asked about Mr. Montague, Mrs. Hurtle seemed to speak without any great pain. They had put their heads together, she said, and had found that the marriage would not be suitable. Each of them preferred their own country, and so they had agreed to part.\nDuring the next fortnight Mrs. Hurtle seemed to take delight in doing all in her power for Mrs. Pipkin and her family. She gave toys to the children, and bestowed upon Mrs. Pipkin a new carpet for the drawing-room. Then Mr. Fisker came and took her away with him to America; and Mrs. Pipkin was left desolate but grateful.\n\"They tell bad things about them Americans,\" she said to a friend. \"But I only wish Providence would send me another lodger like the one I have lost. She had that good nature about her she liked to see the bairns eating pudding just as if they was her own.\"\nI think Mrs. Pipkin was right, and that Mrs. Hurtle, with all her faults, was a good-natured woman.",
        "paragraph_chars": [
            [
                0,
                683
            ],
            [
                683,
                1119
            ],
            [
                1119,
                1394
            ],
            [
                1394,
                1609
            ],
            [
                1609,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1844
            ],
            [
                1844,
                1958
            ],
            [
                1958,
                2382
            ],
            [
                2382,
                2427
            ],
            [
                2427,
                2633
            ],
            [
                2633,
                2819
            ],
            [
                2819,
                3026
            ],
            [
                3026,
                3186
            ],
            [
                3186,
                3258
            ],
            [
                3258,
                3373
            ],
            [
                3373,
                3409
            ],
            [
                3409,
                3578
            ],
            [
                3578,
                3612
            ],
            [
                3612,
                3822
            ],
            [
                3822,
                3850
            ],
            [
                3850,
                4183
            ],
            [
                4183,
                4211
            ],
            [
                4211,
                4309
            ],
            [
                4309,
                4380
            ],
            [
                4380,
                4854
            ],
            [
                4854,
                4888
            ],
            [
                4888,
                5173
            ],
            [
                5173,
                5217
            ],
            [
                5217,
                5417
            ],
            [
                5417,
                5440
            ],
            [
                5440,
                5706
            ],
            [
                5706,
                5755
            ],
            [
                5755,
                5852
            ],
            [
                5852,
                5898
            ],
            [
                5898,
                6374
            ],
            [
                6374,
                6432
            ],
            [
                6432,
                6679
            ],
            [
                6679,
                6704
            ],
            [
                6704,
                7122
            ],
            [
                7122,
                7479
            ],
            [
                7479,
                7600
            ],
            [
                7600,
                7635
            ],
            [
                7635,
                7798
            ],
            [
                7798,
                7969
            ],
            [
                7969,
                8109
            ],
            [
                8109,
                8380
            ],
            [
                8380,
                8749
            ],
            [
                8749,
                9072
            ],
            [
                9072,
                9330
            ],
            [
                9330,
                9429
            ]
        ],
        "segment_chars": [
            [
                0,
                211
            ],
            [
                211,
                310
            ],
            [
                310,
                346
            ],
            [
                346,
                372
            ],
            [
                372,
                405
            ],
            [
                405,
                543
            ],
            [
                543,
                600
            ],
            [
                600,
                683
            ],
            [
                683,
                768
            ],
            [
                768,
                842
            ],
            [
                842,
                929
            ],
            [
                929,
                1007
            ],
            [
                1007,
                1037
            ],
            [
                1037,
                1119
            ],
            [
                1119,
                1156
            ],
            [
                1156,
                1246
            ],
            [
                1246,
                1394
            ],
            [
                1394,
                1446
            ],
            [
                1446,
                1521
            ],
            [
                1521,
                1563
            ],
            [
                1563,
                1609
            ],
            [
                1609,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1727
            ],
            [
                1727,
                1813
            ],
            [
                1813,
                1844
            ],
            [
                1844,
                1865
            ],
            [
                1865,
                1958
            ],
            [
                1958,
                2044
            ],
            [
                2044,
                2087
            ],
            [
                2087,
                2193
            ],
            [
                2193,
                2227
            ],
            [
                2227,
                2349
            ],
            [
                2349,
                2382
            ],
            [
                2382,
                2402
            ],
            [
                2402,
                2427
            ],
            [
                2427,
                2633
            ],
            [
                2633,
                2693
            ],
            [
                2693,
                2768
            ],
            [
                2768,
                2819
            ],
            [
                2819,
                2852
            ],
            [
                2852,
                2930
            ],
            [
                2930,
                3026
            ],
            [
                3026,
                3143
            ],
            [
                3143,
                3186
            ],
            [
                3186,
                3242
            ],
            [
                3242,
                3258
            ],
            [
                3258,
                3337
            ],
            [
                3337,
                3373
            ],
            [
                3373,
                3409
            ],
            [
                3409,
                3437
            ],
            [
                3437,
                3510
            ],
            [
                3510,
                3578
            ],
            [
                3578,
                3612
            ],
            [
                3612,
                3645
            ],
            [
                3645,
                3678
            ],
            [
                3678,
                3735
            ],
            [
                3735,
                3822
            ],
            [
                3822,
                3850
            ],
            [
                3850,
                3873
            ],
            [
                3873,
                4085
            ],
            [
                4085,
                4183
            ],
            [
                4183,
                4211
            ],
            [
                4211,
                4268
            ],
            [
                4268,
                4309
            ],
            [
                4309,
                4331
            ],
            [
                4331,
                4380
            ],
            [
                4380,
                4395
            ],
            [
                4395,
                4413
            ],
            [
                4413,
                4537
            ],
            [
                4537,
                4608
            ],
            [
                4608,
                4638
            ],
            [
                4638,
                4667
            ],
            [
                4667,
                4718
            ],
            [
                4718,
                4803
            ],
            [
                4803,
                4854
            ],
            [
                4854,
                4888
            ],
            [
                4888,
                4927
            ],
            [
                4927,
                4995
            ],
            [
                4995,
                5012
            ],
            [
                5012,
                5056
            ],
            [
                5056,
                5074
            ],
            [
                5074,
                5128
            ],
            [
                5128,
                5173
            ],
            [
                5173,
                5217
            ],
            [
                5217,
                5230
            ],
            [
                5230,
                5260
            ],
            [
                5260,
                5303
            ],
            [
                5303,
                5400
            ],
            [
                5400,
                5417
            ],
            [
                5417,
                5440
            ],
            [
                5440,
                5466
            ],
            [
                5466,
                5511
            ],
            [
                5511,
                5553
            ],
            [
                5553,
                5641
            ],
            [
                5641,
                5706
            ],
            [
                5706,
                5755
            ],
            [
                5755,
                5785
            ],
            [
                5785,
                5852
            ],
            [
                5852,
                5898
            ],
            [
                5898,
                5931
            ],
            [
                5931,
                6013
            ],
            [
                6013,
                6071
            ],
            [
                6071,
                6142
            ],
            [
                6142,
                6260
            ],
            [
                6260,
                6302
            ],
            [
                6302,
                6322
            ],
            [
                6322,
                6374
            ],
            [
                6374,
                6401
            ],
            [
                6401,
                6432
            ],
            [
                6432,
                6447
            ],
            [
                6447,
                6462
            ],
            [
                6462,
                6480
            ],
            [
                6480,
                6555
            ],
            [
                6555,
                6592
            ],
            [
                6592,
                6679
            ],
            [
                6679,
                6704
            ],
            [
                6704,
                6762
            ],
            [
                6762,
                6802
            ],
            [
                6802,
                6896
            ],
            [
                6896,
                6973
            ],
            [
                6973,
                7051
            ],
            [
                7051,
                7092
            ],
            [
                7092,
                7122
            ],
            [
                7122,
                7156
            ],
            [
                7156,
                7314
            ],
            [
                7314,
                7479
            ],
            [
                7479,
                7555
            ],
            [
                7555,
                7600
            ],
            [
                7600,
                7635
            ],
            [
                7635,
                7736
            ],
            [
                7736,
                7787
            ],
            [
                7787,
                7798
            ],
            [
                7798,
                7855
            ],
            [
                7855,
                7928
            ],
            [
                7928,
                7969
            ],
            [
                7969,
                7997
            ],
            [
                7997,
                8046
            ],
            [
                8046,
                8076
            ],
            [
                8076,
                8109
            ],
            [
                8109,
                8210
            ],
            [
                8210,
                8298
            ],
            [
                8298,
                8380
            ],
            [
                8380,
                8471
            ],
            [
                8471,
                8575
            ],
            [
                8575,
                8675
            ],
            [
                8675,
                8749
            ],
            [
                8749,
                8868
            ],
            [
                8868,
                8964
            ],
            [
                8964,
                9072
            ],
            [
                9072,
                9139
            ],
            [
                9139,
                9222
            ],
            [
                9222,
                9330
            ],
            [
                9330,
                9429
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                26,
                49
            ],
            [
                50,
                55
            ],
            [
                56,
                65
            ],
            [
                70,
                152
            ],
            [
                153,
                211
            ],
            [
                211,
                214
            ],
            [
                215,
                244
            ],
            [
                268,
                310
            ],
            [
                310,
                313
            ],
            [
                319,
                345
            ],
            [
                346,
                353
            ],
            [
                354,
                361
            ],
            [
                367,
                372
            ],
            [
                372,
                405
            ],
            [
                405,
                408
            ],
            [
                409,
                477
            ],
            [
                478,
                482
            ],
            [
                483,
                485
            ],
            [
                503,
                505
            ],
            [
                506,
                543
            ],
            [
                543,
                546
            ],
            [
                552,
                600
            ],
            [
                600,
                638
            ],
            [
                642,
                645
            ],
            [
                650,
                659
            ],
            [
                660,
                667
            ],
            [
                668,
                681
            ],
            [
                681,
                683
            ],
            [
                683,
                768
            ],
            [
                768,
                784
            ],
            [
                785,
                805
            ],
            [
                806,
                813
            ],
            [
                814,
                816
            ],
            [
                817,
                840
            ],
            [
                840,
                842
            ],
            [
                842,
                880
            ],
            [
                889,
                898
            ],
            [
                905,
                927
            ],
            [
                927,
                929
            ],
            [
                929,
                958
            ],
            [
                958,
                959
            ],
            [
                960,
                972
            ],
            [
                973,
                1007
            ],
            [
                1015,
                1018
            ],
            [
                1019,
                1035
            ],
            [
                1035,
                1037
            ],
            [
                1037,
                1086
            ],
            [
                1087,
                1094
            ],
            [
                1097,
                1118
            ],
            [
                1119,
                1156
            ],
            [
                1156,
                1204
            ],
            [
                1213,
                1246
            ],
            [
                1246,
                1385
            ],
            [
                1392,
                1393
            ],
            [
                1394,
                1397
            ],
            [
                1409,
                1436
            ],
            [
                1437,
                1443
            ],
            [
                1443,
                1446
            ],
            [
                1446,
                1521
            ],
            [
                1521,
                1561
            ],
            [
                1561,
                1563
            ],
            [
                1563,
                1564
            ],
            [
                1572,
                1608
            ],
            [
                1609,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1703
            ],
            [
                1706,
                1725
            ],
            [
                1730,
                1745
            ],
            [
                1751,
                1769
            ],
            [
                1769,
                1811
            ],
            [
                1811,
                1812
            ],
            [
                1813,
                1844
            ],
            [
                1844,
                1864
            ],
            [
                1865,
                1906
            ],
            [
                1911,
                1912
            ],
            [
                1927,
                1938
            ],
            [
                1956,
                1957
            ],
            [
                1958,
                1969
            ],
            [
                1970,
                2013
            ],
            [
                2014,
                2044
            ],
            [
                2044,
                2087
            ],
            [
                2087,
                2193
            ],
            [
                2193,
                2225
            ],
            [
                2225,
                2227
            ],
            [
                2227,
                2238
            ],
            [
                2244,
                2245
            ],
            [
                2251,
                2272
            ],
            [
                2273,
                2328
            ],
            [
                2338,
                2349
            ],
            [
                2349,
                2381
            ],
            [
                2382,
                2395
            ],
            [
                2398,
                2402
            ],
            [
                2402,
                2424
            ],
            [
                2427,
                2484
            ],
            [
                2485,
                2530
            ],
            [
                2531,
                2533
            ],
            [
                2534,
                2563
            ],
            [
                2568,
                2580
            ],
            [
                2590,
                2597
            ],
            [
                2602,
                2623
            ],
            [
                2624,
                2626
            ],
            [
                2627,
                2631
            ],
            [
                2631,
                2633
            ],
            [
                2633,
                2636
            ],
            [
                2637,
                2693
            ],
            [
                2693,
                2718
            ],
            [
                2719,
                2741
            ],
            [
                2742,
                2755
            ],
            [
                2756,
                2767
            ],
            [
                2768,
                2775
            ],
            [
                2788,
                2817
            ],
            [
                2817,
                2818
            ],
            [
                2819,
                2852
            ],
            [
                2852,
                2930
            ],
            [
                2930,
                3024
            ],
            [
                3024,
                3025
            ],
            [
                3026,
                3107
            ],
            [
                3108,
                3143
            ],
            [
                3144,
                3186
            ],
            [
                3186,
                3231
            ],
            [
                3238,
                3242
            ],
            [
                3242,
                3258
            ],
            [
                3258,
                3286
            ],
            [
                3287,
                3326
            ],
            [
                3335,
                3337
            ],
            [
                3337,
                3366
            ],
            [
                3367,
                3370
            ],
            [
                3373,
                3389
            ],
            [
                3390,
                3409
            ],
            [
                3409,
                3437
            ],
            [
                3437,
                3486
            ],
            [
                3487,
                3490
            ],
            [
                3491,
                3494
            ],
            [
                3500,
                3508
            ],
            [
                3508,
                3510
            ],
            [
                3510,
                3534
            ],
            [
                3542,
                3575
            ],
            [
                3578,
                3612
            ],
            [
                3612,
                3621
            ],
            [
                3624,
                3645
            ],
            [
                3646,
                3662
            ],
            [
                3672,
                3678
            ],
            [
                3678,
                3735
            ],
            [
                3735,
                3822
            ],
            [
                3822,
                3850
            ],
            [
                3850,
                3873
            ],
            [
                3873,
                4085
            ],
            [
                4085,
                4103
            ],
            [
                4104,
                4137
            ],
            [
                4138,
                4183
            ],
            [
                4183,
                4211
            ],
            [
                4211,
                4268
            ],
            [
                4268,
                4290
            ],
            [
                4291,
                4306
            ],
            [
                4309,
                4329
            ],
            [
                4331,
                4380
            ],
            [
                4380,
                4395
            ],
            [
                4395,
                4413
            ],
            [
                4413,
                4425
            ],
            [
                4426,
                4483
            ],
            [
                4489,
                4506
            ],
            [
                4507,
                4537
            ],
            [
                4537,
                4608
            ],
            [
                4608,
                4636
            ],
            [
                4636,
                4638
            ],
            [
                4638,
                4665
            ],
            [
                4665,
                4667
            ],
            [
                4667,
                4678
            ],
            [
                4679,
                4718
            ],
            [
                4718,
                4803
            ],
            [
                4803,
                4854
            ],
            [
                4854,
                4888
            ],
            [
                4888,
                4889
            ],
            [
                4904,
                4913
            ],
            [
                4919,
                4927
            ],
            [
                4927,
                4995
            ],
            [
                4995,
                5012
            ],
            [
                5012,
                5053
            ],
            [
                5053,
                5056
            ],
            [
                5056,
                5059
            ],
            [
                5066,
                5072
            ],
            [
                5072,
                5074
            ],
            [
                5074,
                5075
            ],
            [
                5075,
                5080
            ],
            [
                5086,
                5089
            ],
            [
                5090,
                5108
            ],
            [
                5109,
                5117
            ],
            [
                5118,
                5126
            ],
            [
                5126,
                5127
            ],
            [
                5128,
                5170
            ],
            [
                5173,
                5217
            ],
            [
                5217,
                5228
            ],
            [
                5228,
                5230
            ],
            [
                5230,
                5260
            ],
            [
                5260,
                5303
            ],
            [
                5303,
                5362
            ],
            [
                5370,
                5400
            ],
            [
                5400,
                5417
            ],
            [
                5417,
                5440
            ],
            [
                5440,
                5466
            ],
            [
                5466,
                5472
            ],
            [
                5473,
                5482
            ],
            [
                5487,
                5494
            ],
            [
                5495,
                5511
            ],
            [
                5511,
                5542
            ],
            [
                5551,
                5553
            ],
            [
                5553,
                5598
            ],
            [
                5599,
                5639
            ],
            [
                5641,
                5706
            ],
            [
                5706,
                5715
            ],
            [
                5716,
                5755
            ],
            [
                5755,
                5785
            ],
            [
                5785,
                5812
            ],
            [
                5821,
                5849
            ],
            [
                5852,
                5898
            ],
            [
                5898,
                5902
            ],
            [
                5903,
                5931
            ],
            [
                5931,
                6013
            ],
            [
                6013,
                6069
            ],
            [
                6069,
                6071
            ],
            [
                6071,
                6102
            ],
            [
                6109,
                6142
            ],
            [
                6142,
                6183
            ],
            [
                6183,
                6184
            ],
            [
                6185,
                6198
            ],
            [
                6200,
                6203
            ],
            [
                6209,
                6219
            ],
            [
                6220,
                6260
            ],
            [
                6260,
                6274
            ],
            [
                6275,
                6302
            ],
            [
                6302,
                6320
            ],
            [
                6320,
                6322
            ],
            [
                6322,
                6327
            ],
            [
                6328,
                6371
            ],
            [
                6374,
                6401
            ],
            [
                6401,
                6430
            ],
            [
                6430,
                6432
            ],
            [
                6432,
                6447
            ],
            [
                6447,
                6460
            ],
            [
                6460,
                6462
            ],
            [
                6462,
                6480
            ],
            [
                6480,
                6497
            ],
            [
                6503,
                6508
            ],
            [
                6509,
                6534
            ],
            [
                6535,
                6544
            ],
            [
                6547,
                6553
            ],
            [
                6553,
                6555
            ],
            [
                6555,
                6565
            ],
            [
                6566,
                6592
            ],
            [
                6592,
                6600
            ],
            [
                6601,
                6604
            ],
            [
                6605,
                6677
            ],
            [
                6677,
                6679
            ],
            [
                6679,
                6701
            ],
            [
                6704,
                6762
            ],
            [
                6762,
                6802
            ],
            [
                6802,
                6834
            ],
            [
                6836,
                6896
            ],
            [
                6896,
                6935
            ],
            [
                6938,
                6973
            ],
            [
                6973,
                7051
            ],
            [
                7051,
                7092
            ],
            [
                7092,
                7109
            ],
            [
                7112,
                7122
            ],
            [
                7122,
                7154
            ],
            [
                7154,
                7156
            ],
            [
                7156,
                7215
            ],
            [
                7216,
                7223
            ],
            [
                7228,
                7233
            ],
            [
                7233,
                7262
            ],
            [
                7265,
                7314
            ],
            [
                7314,
                7452
            ],
            [
                7453,
                7478
            ],
            [
                7479,
                7530
            ],
            [
                7530,
                7531
            ],
            [
                7532,
                7533
            ],
            [
                7533,
                7553
            ],
            [
                7553,
                7555
            ],
            [
                7555,
                7576
            ],
            [
                7576,
                7600
            ],
            [
                7600,
                7604
            ],
            [
                7605,
                7635
            ],
            [
                7636,
                7736
            ],
            [
                7736,
                7738
            ],
            [
                7739,
                7741
            ],
            [
                7742,
                7768
            ],
            [
                7769,
                7786
            ],
            [
                7787,
                7798
            ],
            [
                7798,
                7809
            ],
            [
                7810,
                7853
            ],
            [
                7853,
                7855
            ],
            [
                7855,
                7862
            ],
            [
                7869,
                7928
            ],
            [
                7928,
                7949
            ],
            [
                7950,
                7968
            ],
            [
                7969,
                7982
            ],
            [
                7983,
                7997
            ],
            [
                7997,
                8000
            ],
            [
                8001,
                8046
            ],
            [
                8046,
                8062
            ],
            [
                8063,
                8076
            ],
            [
                8076,
                8078
            ],
            [
                8079,
                8100
            ],
            [
                8101,
                8109
            ],
            [
                8109,
                8124
            ],
            [
                8125,
                8172
            ],
            [
                8173,
                8188
            ],
            [
                8189,
                8210
            ],
            [
                8210,
                8213
            ],
            [
                8214,
                8260
            ],
            [
                8260,
                8298
            ],
            [
                8298,
                8316
            ],
            [
                8317,
                8380
            ],
            [
                8380,
                8436
            ],
            [
                8438,
                8459
            ],
            [
                8460,
                8471
            ],
            [
                8471,
                8479
            ],
            [
                8480,
                8502
            ],
            [
                8503,
                8550
            ],
            [
                8551,
                8575
            ],
            [
                8575,
                8675
            ],
            [
                8675,
                8748
            ],
            [
                8749,
                8755
            ],
            [
                8756,
                8774
            ],
            [
                8787,
                8801
            ],
            [
                8802,
                8868
            ],
            [
                8868,
                8902
            ],
            [
                8903,
                8964
            ],
            [
                8964,
                9048
            ],
            [
                9049,
                9070
            ],
            [
                9070,
                9072
            ],
            [
                9072,
                9077
            ],
            [
                9078,
                9137
            ],
            [
                9137,
                9139
            ],
            [
                9140,
                9143
            ],
            [
                9144,
                9188
            ],
            [
                9189,
                9195
            ],
            [
                9196,
                9222
            ],
            [
                9222,
                9330
            ],
            [
                9330,
                9429
            ]
        ],
        "row_chars": [
            [
                0,
                211
            ],
            [
                211,
                310
            ],
            [
                310,
                346
            ],
            [
                346,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                405
            ],
            [
                405,
                543
            ],
            [
                543,
                600
            ],
            [
                600,
                683
            ],
            [
                683,
                768
            ],
            [
                768,
                842
            ],
            [
                842,
                929
            ],
            [
                929,
                1007
            ],
            [
                1007,
                1037
            ],
            [
                1037,
                1119
            ],
            [
                1119,
                1156
            ],
            [
                1156,
                1246
            ],
            [
                1246,
                1394
            ],
            [
                1394,
                1394
            ],
            [
                1394,
                1446
            ],
            [
                1446,
                1521
            ],
            [
                1521,
                1563
            ],
            [
                1563,
                1609
            ],
            [
                1609,
                1609
            ],
            [
                1609,
                1609
            ],
            [
                1609,
                1609
            ],
            [
                1609,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1813
            ],
            [
                1813,
                1958
            ],
            [
                1958,
                1958
            ],
            [
                1958,
                1958
            ],
            [
                1958,
                1958
            ],
            [
                1958,
                1958
            ],
            [
                1958,
                1958
            ],
            [
                1958,
                2044
            ],
            [
                2044,
                2044
            ],
            [
                2044,
                2087
            ],
            [
                2087,
                2193
            ],
            [
                2193,
                2227
            ],
            [
                2227,
                2349
            ],
            [
                2349,
                2382
            ],
            [
                2382,
                2382
            ],
            [
                2382,
                2402
            ],
            [
                2402,
                2427
            ],
            [
                2427,
                2427
            ],
            [
                2427,
                2427
            ],
            [
                2427,
                2633
            ],
            [
                2633,
                2693
            ],
            [
                2693,
                2768
            ],
            [
                2768,
                2768
            ],
            [
                2768,
                2819
            ],
            [
                2819,
                2819
            ],
            [
                2819,
                2852
            ],
            [
                2852,
                2930
            ],
            [
                2930,
                3026
            ],
            [
                3026,
                3026
            ],
            [
                3026,
                3143
            ],
            [
                3143,
                3143
            ],
            [
                3143,
                3186
            ],
            [
                3186,
                3186
            ],
            [
                3186,
                3186
            ],
            [
                3186,
                3242
            ],
            [
                3242,
                3258
            ],
            [
                3258,
                3337
            ],
            [
                3337,
                3373
            ],
            [
                3373,
                3373
            ],
            [
                3373,
                3409
            ],
            [
                3409,
                3437
            ],
            [
                3437,
                3510
            ],
            [
                3510,
                3510
            ],
            [
                3510,
                3578
            ],
            [
                3578,
                3578
            ],
            [
                3578,
                3612
            ],
            [
                3612,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3678
            ],
            [
                3678,
                3678
            ],
            [
                3678,
                3735
            ],
            [
                3735,
                3822
            ],
            [
                3822,
                3850
            ],
            [
                3850,
                3873
            ],
            [
                3873,
                3873
            ],
            [
                3873,
                3873
            ],
            [
                3873,
                4085
            ],
            [
                4085,
                4085
            ],
            [
                4085,
                4085
            ],
            [
                4085,
                4183
            ],
            [
                4183,
                4211
            ],
            [
                4211,
                4268
            ],
            [
                4268,
                4309
            ],
            [
                4309,
                4331
            ],
            [
                4331,
                4331
            ],
            [
                4331,
                4331
            ],
            [
                4331,
                4380
            ],
            [
                4380,
                4395
            ],
            [
                4395,
                4413
            ],
            [
                4413,
                4537
            ],
            [
                4537,
                4537
            ],
            [
                4537,
                4537
            ],
            [
                4537,
                4537
            ],
            [
                4537,
                4608
            ],
            [
                4608,
                4638
            ],
            [
                4638,
                4638
            ],
            [
                4638,
                4667
            ],
            [
                4667,
                4718
            ],
            [
                4718,
                4803
            ],
            [
                4803,
                4854
            ],
            [
                4854,
                4888
            ],
            [
                4888,
                4927
            ],
            [
                4927,
                4995
            ],
            [
                4995,
                5012
            ],
            [
                5012,
                5012
            ],
            [
                5012,
                5056
            ],
            [
                5056,
                5074
            ],
            [
                5074,
                5128
            ],
            [
                5128,
                5128
            ],
            [
                5128,
                5128
            ],
            [
                5128,
                5173
            ],
            [
                5173,
                5173
            ],
            [
                5173,
                5217
            ],
            [
                5217,
                5230
            ],
            [
                5230,
                5260
            ],
            [
                5260,
                5303
            ],
            [
                5303,
                5400
            ],
            [
                5400,
                5417
            ],
            [
                5417,
                5440
            ],
            [
                5440,
                5466
            ],
            [
                5466,
                5511
            ],
            [
                5511,
                5553
            ],
            [
                5553,
                5641
            ],
            [
                5641,
                5706
            ],
            [
                5706,
                5706
            ],
            [
                5706,
                5706
            ],
            [
                5706,
                5755
            ],
            [
                5755,
                5785
            ],
            [
                5785,
                5785
            ],
            [
                5785,
                5852
            ],
            [
                5852,
                5852
            ],
            [
                5852,
                5852
            ],
            [
                5852,
                5898
            ],
            [
                5898,
                5931
            ],
            [
                5931,
                6013
            ],
            [
                6013,
                6071
            ],
            [
                6071,
                6142
            ],
            [
                6142,
                6260
            ],
            [
                6260,
                6260
            ],
            [
                6260,
                6302
            ],
            [
                6302,
                6322
            ],
            [
                6322,
                6374
            ],
            [
                6374,
                6374
            ],
            [
                6374,
                6374
            ],
            [
                6374,
                6401
            ],
            [
                6401,
                6432
            ],
            [
                6432,
                6447
            ],
            [
                6447,
                6462
            ],
            [
                6462,
                6480
            ],
            [
                6480,
                6555
            ],
            [
                6555,
                6592
            ],
            [
                6592,
                6679
            ],
            [
                6679,
                6704
            ],
            [
                6704,
                6762
            ],
            [
                6762,
                6762
            ],
            [
                6762,
                6762
            ],
            [
                6762,
                6802
            ],
            [
                6802,
                6802
            ],
            [
                6802,
                6802
            ],
            [
                6802,
                6896
            ],
            [
                6896,
                6973
            ],
            [
                6973,
                7051
            ],
            [
                7051,
                7092
            ],
            [
                7092,
                7092
            ],
            [
                7092,
                7122
            ],
            [
                7122,
                7156
            ],
            [
                7156,
                7156
            ],
            [
                7156,
                7314
            ],
            [
                7314,
                7479
            ],
            [
                7479,
                7555
            ],
            [
                7555,
                7600
            ],
            [
                7600,
                7635
            ],
            [
                7635,
                7635
            ],
            [
                7635,
                7736
            ],
            [
                7736,
                7736
            ],
            [
                7736,
                7787
            ],
            [
                7787,
                7798
            ],
            [
                7798,
                7855
            ],
            [
                7855,
                7928
            ],
            [
                7928,
                7969
            ],
            [
                7969,
                7997
            ],
            [
                7997,
                8046
            ],
            [
                8046,
                8076
            ],
            [
                8076,
                8109
            ],
            [
                8109,
                8210
            ],
            [
                8210,
                8210
            ],
            [
                8210,
                8298
            ],
            [
                8298,
                8380
            ],
            [
                8380,
                8380
            ],
            [
                8380,
                8471
            ],
            [
                8471,
                8575
            ],
            [
                8575,
                8675
            ],
            [
                8675,
                8749
            ],
            [
                8749,
                8749
            ],
            [
                8749,
                8868
            ],
            [
                8868,
                8964
            ],
            [
                8964,
                9072
            ],
            [
                9072,
                9139
            ],
            [
                9139,
                9222
            ],
            [
                9222,
                9330
            ],
            [
                9330,
                9429
            ]
        ]
    }
}