{
    "original": {
        "text": "When Sir Felix Carbury declared to his friends at the Beargarden that he intended to devote the next few months of his life to foreign travel, and that it was his purpose to take with him a Protestant divine,--as was much the habit with young men of rank and fortune some years since,--he was not altogether lying. There was indeed a sounder basis of truth than was usually to be found attached to his statements. That he should have intended to produce a false impression was a matter of course,--and nearly equally so that he should have made his attempt by asserting things which he must have known that no one would believe. He was going to Germany, and he was going in company with a clergyman, and it had been decided that he should remain there for the next twelve months. A representation had lately been made to the Bishop of London that the English Protestants settled in a certain commercial town in the north-eastern district of Prussia were without pastoral aid, and the bishop had stirred himself in the matter. A clergyman was found willing to expatriate himself, but the income suggested was very small. The Protestant English population of the commercial town in question, though pious, was not liberal. It had come to pass that the \"Morning Breakfast Table\" had interested itself in the matter, having appealed for subscriptions after a manner not unusual with that paper. The bishop and all those concerned in the matter had fully understood that if the \"Morning Breakfast Table\" could be got to take the matter up heartily, the thing would be done. The heartiness had been so complete that it had at last devolved upon Mr. Broune to appoint the clergyman; and, as with all the aid that could be found, the income was still small, the Rev. Septimus Blake,--a brand snatched from the burning of Rome,--had been induced to undertake the maintenance and total charge of Sir Felix Carbury for a consideration. Mr. Broune imparted to Mr. Blake all that there was to know about the baronet, giving much counsel as to the management of the young man, and specially enjoining on the clergyman that he should on no account give Sir Felix the means of returning home. It was evidently Mr. Broune's anxious wish that Sir Felix should see as much as possible of German life, at a comparatively moderate expenditure, and under circumstances that should be externally respectable if not absolutely those which a young gentleman might choose for his own comfort or profit;--but especially that those circumstances should not admit of the speedy return to England of the young gentleman himself.\nLady Carbury had at first opposed the scheme. Terribly difficult as was to her the burden of maintaining her son, she could not endure the idea of driving him into exile. But Mr. Broune was very obstinate, very reasonable, and, as she thought, somewhat hard of heart. \"What is to be the end of it then?\" he said to her, almost in anger. For in those days the great editor, when in presence of Lady Carbury, differed very much from that Mr. Broune who used to squeeze her hand and look into her eyes. His manner with her had become so different that she regarded him as quite another person. She hardly dared to contradict him, and found herself almost compelled to tell him what she really felt and thought. \"Do you mean to let him eat up everything you have to your last shilling, and then go to the workhouse with him?\"\n\"Oh, my friend, you know how I am struggling! Do not say such horrid things.\"\n\"It is because I know how you are struggling that I find myself compelled to say anything on the subject. What hardship will there be in his living for twelve months with a clergyman in Prussia? What can he do better? What better chance can he have of being weaned from the life he is leading?\"\n\"If he could only be married!\"\n\"Married! Who is to marry him? Why should any girl with money throw herself away upon him?\"\n\"He is so handsome.\"\n\"What has his beauty brought him to? Lady Carbury, you must let me tell you that all that is not only foolish but wrong. If you keep him here you will help to ruin him, and will certainly ruin yourself. He has agreed to go;--let him go.\"\nShe was forced to yield. Indeed, as Sir Felix had himself assented, it was almost impossible that she should not do so. Perhaps Mr. Broune's greatest triumph was due to the talent and firmness with which he persuaded Sir Felix to start upon his travels. \"Your mother,\" said Mr. Broune, \"has made up her mind that she will not absolutely beggar your sister and herself in order that your indulgence may be prolonged for a few months. She cannot make you go to Germany of course. But she can turn you out of her house, and, unless you go, she will do so.\"\n\"I don't think she ever said that, Mr. Broune.\"\n\"No;--she has not said so. But I have said it for her in her presence; and she has acknowledged that it must necessarily be so. You may take my word as a gentleman that it will be so. If you take her advice 175 a year will be paid for your maintenance;--but if you remain in England not a shilling further will be paid.\" He had no money. His last sovereign was all but gone. Not a tradesman would give him credit for a coat or a pair of boots. The key of the door had been taken away from him. The very page treated him with contumely. His clothes were becoming rusty. There was no prospect of amusement for him during the coming autumn or winter. He did not anticipate much excitement in Eastern Prussia, but he thought that any change must be a change for the better. He assented, therefore, to the proposition made by Mr. Broune, was duly introduced to the Rev. Septimus Blake, and, as he spent his last sovereign on a last dinner at the Beargarden, explained his intentions for the immediate future to those friends at his club who would no doubt mourn his departure.\nMr. Blake and Mr. Broune between them did not allow the grass to grow under their feet. Before the end of August Sir Felix, with Mr. and Mrs. Blake and the young Blakes, had embarked from Hull for Hamburgh,--having extracted at the very hour of parting a last five-pound note from his foolish mother. \"It will be just enough to bring him home,\" said Mr. Broune with angry energy when he was told of this. But Lady Carbury, who knew her son well, assured him that Felix would be restrained in his expenditure by no such prudence as such a purpose would indicate. \"It will be gone,\" she said, \"long before they reach their destination.\"\n\"Then why the deuce should you give it him?\" said Mr. Broune.\nMr. Broune's anxiety had been so intense that he had paid half a year's allowance in advance to Mr. Blake out of his own pocket. Indeed, he had paid various sums for Lady Carbury,--so that that unfortunate woman would often tell herself that she was becoming subject to the great editor, almost like a slave. He came to her, three or four times a week, at about nine o'clock in the evening, and gave her instructions as to all that she should do. \"I wouldn't write another novel if I were you,\" he said. This was hard, as the writing of novels was her great ambition, and she had flattered herself that the one novel which she had written was good. Mr. Broune's own critic had declared it to be very good in glowing language. The \"Evening Pulpit\" had of course abused it,--because it is the nature of the \"Evening Pulpit\" to abuse. So she had argued with herself, telling herself that the praise was all true, whereas the censure had come from malice. After that article in the \"Breakfast Table,\" it did seem hard that Mr. Broune should tell her to write no more novels. She looked up at him piteously but said nothing. \"I don't think you'd find it answer. Of course you can do it as well as a great many others. But then that is saying so little!\"\n\"I thought I could make some money.\"\n\"I don't think Mr. Leadham would hold out to you very high hopes;--I don't, indeed. I think I would turn to something else.\"\n\"It is so very hard to get paid for what one does.\"\nTo this Mr. Broune made no immediate answer; but, after sitting for a while, almost in silence, he took his leave. On that very morning Lady Carbury had parted from her son. She was soon about to part from her daughter, and she was very sad. She felt that she could hardly keep up that house in Welbeck Street for herself, even if her means permitted it. What should she do with herself? Whither should she take herself? Perhaps the bitterest drop in her cup had come from those words of Mr. Broune forbidding her to write more novels. After all, then, she was not a clever woman,--not more clever than other women around her! That very morning she had prided herself on her coming success as a novelist, basing all her hopes on that review in the \"Breakfast Table.\" Now, with that reaction of spirits which is so common to all of us, she was more than equally despondent. He would not thus have crushed her without a reason. Though he was hard to her now,--he who used to be so soft,--he was very good. It did not occur to her to rebel against him. After what he had said, of course there would be no more praise in the \"Breakfast Table,\"--and, equally of course, no novel of hers could succeed without that. The more she thought of him, the more omnipotent he seemed to be. The more she thought of herself, the more absolutely prostrate she seemed to have fallen from those high hopes with which she had begun her literary career not much more than twelve months ago.\nOn the next day he did not come to her at all, and she sat idle, wretched, and alone. She could not interest herself in Hetta's coming marriage, as that marriage was in direct opposition to one of her broken schemes. She had not ventured to confess so much to Mr. Broune, but she had in truth written the first pages of the first chapter of a second novel. It was impossible now that she should even look at what she had written. All this made her very sad. She spent the evening quite alone; for Hetta was staying down in Suffolk, with her cousin's friend, Mrs. Yeld, the bishop's wife; and as she thought of her life past and her life to come, she did, perhaps, with a broken light, see something of the error of her ways, and did, after a fashion, repent. It was all \"leather or prunello,\" as she said to herself;--it was all vanity,--and vanity,--and vanity! What real enjoyment had she found in anything? She had only taught herself to believe that some day something would come which she would like;--but she had never as yet in truth found anything to like. It had all been in anticipation,--but now even her anticipations were at an end. Mr. Broune had sent her son away, had forbidden her to write any more novels,--and had been refused when he had asked her to marry him!\nThe next day he came to her as usual, and found her still very wretched. \"I shall give up this house,\" she said. \"I can't afford to keep it; and in truth I shall not want it. I don't in the least know where to go, but I don't think that it much signifies. Any place will be the same to me now.\"\n\"I don't see why you should say that.\"\n\"What does it matter?\"\n\"You wouldn't think of going out of London.\"\n\"Why not? I suppose I had better go wherever I can live cheapest.\"\n\"I should be sorry that you should be settled where I could not see you,\" said Mr. Broune plaintively.\n\"So shall I,--very. You have been more kind to me than anybody. But what am I to do? If I stay in London I can live only in some miserable lodgings. I know you will laugh at me, and tell me that I am wrong; but my idea is that I shall follow Felix wherever he goes, so that I may be near him and help him when he needs help. Hetta doesn't want me. There is nobody else that I can do any good to.\"\n\"I want you,\" said Mr. Broune, very quietly.\n\"Ah,--that is so kind of you. There is nothing makes one so good as goodness;--nothing binds your friend to you so firmly as the acceptance from him of friendly actions. You say you want me, because I have so sadly wanted you. When I go you will simply miss an almost daily trouble, but where shall I find a friend?\"\n\"When I said I wanted you, I meant more than that, Lady Carbury. Two or three months ago I asked you to be my wife. You declined, chiefly, if I understood you rightly, because of your son's position. That has been altered, and therefore I ask you again. I have quite convinced myself,--not without some doubts, for you shall know all; but, still, I have quite convinced myself,--that such a marriage will best contribute to my own happiness. I do not think, dearest, that it would mar yours.\"\nThis was said with so quiet a voice and so placid a demeanour, that the words, though they were too plain to be misunderstood, hardly at first brought themselves home to her. Of course he had renewed his offer of marriage, but he had done so in a tone which almost made her feel that the proposition could not be an earnest one. It was not that she believed that he was joking with her or paying her a poor insipid compliment. When she thought about it at all, she knew that it could not be so. But the thing was so improbable! Her opinion of herself was so poor, she had become so sick of her own vanities and littlenesses and pretences, that she could not understand that such a man as this should in truth want to make her his wife. At this moment she thought less of herself and more of Mr. Broune than either perhaps deserved. She sat silent, quite unable to look him in the face, while he kept his place in his arm-chair, lounging back, with his eyes intent on her countenance. \"Well,\" he said; \"what do you think of it? I never loved you better than I did for refusing me before, because I thought that you did so because it was not right that I should be embarrassed by your son.\"\n\"That was the reason,\" she said, almost in a whisper.\n\"But I shall love you better still for accepting me now,--if you will accept me.\"\nThe long vista of her past life appeared before her eyes. The ambition of her youth which had been taught to look only to a handsome maintenance, the cruelty of her husband which had driven her to run from him, the further cruelty of his forgiveness when she returned to him; the calumny which had made her miserable, though she had never confessed her misery; then her attempts at life in London, her literary successes and failures, and the wretchedness of her son's career;--there had never been happiness, or even comfort, in any of it. Even when her smiles had been sweetest her heart had been heaviest. Could it be that now at last real peace should be within her reach, and that tranquillity which comes from an anchor holding to a firm bottom? Then she remembered that first kiss,--or attempted kiss,--when, with a sort of pride in her own superiority, she had told herself that the man was a susceptible old goose. She certainly had not thought then that his susceptibility was of this nature. Nor could she quite understand now whether she had been right then, and that the man's feelings, and almost his nature, had since changed,--or whether he had really loved her from first to last. As he remained silent it was necessary that she should answer him. \"You can hardly have thought of it enough,\" she said.\n\"I have thought of it a good deal too. I have been thinking of it for six months at least.\"\n\"There is so much against me.\"\n\"What is there against you?\"\n\"They say bad things of me in India.\"\n\"I know all about that,\" replied Mr. Broune.\n\"And Felix!\"\n\"I think I may say that I know all about that also.\"\n\"And then I have become so poor!\"\n\"I am not proposing to myself to marry you for your money. Luckily for me,--I hope luckily for both of us,--it is not necessary that I should do so.\"\n\"And then I seem so to have fallen through in everything. I don't know what I've got to give to a man in return for all that you offer to give to me.\"\n\"Yourself,\" he said, stretching out his right hand to her. And there he sat with it stretched out,--so that she found herself compelled to put her own into it, or to refuse to do so with very absolute words. Very slowly she put out her own, and gave it to him without looking at him. Then he drew her towards him, and in a moment she was kneeling at his feet, with her face buried on his knees. Considering their ages perhaps we must say that their attitude was awkward. They would certainly have thought so themselves had they imagined that any one could have seen them. But how many absurdities of the kind are not only held to be pleasant, but almost holy,--as long as they remain mysteries inspected by no profane eyes! It is not that Age is ashamed of feeling passion and acknowledging it,--but that the display of it is, without the graces of which Youth is proud, and which Age regrets.\nOn that occasion there was very little more said between them. He had certainly been in earnest, and she had now accepted him. As he went down to his office he told himself now that he had done the best, not only for her but for himself also. And yet I think that she had won him more thoroughly by her former refusal than by any other virtue.\nShe, as she sat alone, late into the night, became subject to a thorough reaction of spirit. That morning the world had been a perfect blank to her. There was no single object of interest before her. Now everything was rose-coloured. This man who had thus bound her to him, who had given her such assured proofs of his affection and truth, was one of the considerable ones of the world; a man than whom few,--so she now told herself,--were greater or more powerful. Was it not a career enough for any woman to be the wife of such a man, to receive his friends, and to shine with his reflected glory?\nWhether her hopes were realised, or,--as human hopes never are realised,--how far her content was assured, these pages cannot tell; but they must tell that, before the coming winter was over, Lady Carbury became the wife of Mr. Broune, and, in furtherance of her own resolve, took her husband's name. The house in Welbeck Street was kept, and Mrs. Broune's Tuesday evenings were much more regarded by the literary world than had been those of Lady Carbury.",
        "paragraph_chars": [
            [
                0,
                2599
            ],
            [
                2599,
                3421
            ],
            [
                3421,
                3499
            ],
            [
                3499,
                3794
            ],
            [
                3794,
                3825
            ],
            [
                3825,
                3917
            ],
            [
                3917,
                3938
            ],
            [
                3938,
                4176
            ],
            [
                4176,
                4730
            ],
            [
                4730,
                4778
            ],
            [
                4778,
                5850
            ],
            [
                5850,
                6485
            ],
            [
                6485,
                6547
            ],
            [
                6547,
                7796
            ],
            [
                7796,
                7833
            ],
            [
                7833,
                7958
            ],
            [
                7958,
                8010
            ],
            [
                8010,
                9480
            ],
            [
                9480,
                10762
            ],
            [
                10762,
                11057
            ],
            [
                11057,
                11096
            ],
            [
                11096,
                11119
            ],
            [
                11119,
                11164
            ],
            [
                11164,
                11231
            ],
            [
                11231,
                11334
            ],
            [
                11334,
                11731
            ],
            [
                11731,
                11776
            ],
            [
                11776,
                12093
            ],
            [
                12093,
                12586
            ],
            [
                12586,
                13775
            ],
            [
                13775,
                13829
            ],
            [
                13829,
                13911
            ],
            [
                13911,
                15230
            ],
            [
                15230,
                15322
            ],
            [
                15322,
                15353
            ],
            [
                15353,
                15382
            ],
            [
                15382,
                15420
            ],
            [
                15420,
                15465
            ],
            [
                15465,
                15478
            ],
            [
                15478,
                15531
            ],
            [
                15531,
                15565
            ],
            [
                15565,
                15715
            ],
            [
                15715,
                15866
            ],
            [
                15866,
                16760
            ],
            [
                16760,
                17104
            ],
            [
                17104,
                17704
            ],
            [
                17704,
                18160
            ]
        ],
        "segment_chars": [
            [
                0,
                315
            ],
            [
                315,
                414
            ],
            [
                414,
                629
            ],
            [
                629,
                780
            ],
            [
                780,
                1026
            ],
            [
                1026,
                1120
            ],
            [
                1120,
                1221
            ],
            [
                1221,
                1391
            ],
            [
                1391,
                1569
            ],
            [
                1569,
                1925
            ],
            [
                1925,
                2177
            ],
            [
                2177,
                2599
            ],
            [
                2599,
                2645
            ],
            [
                2645,
                2770
            ],
            [
                2770,
                2867
            ],
            [
                2867,
                2903
            ],
            [
                2903,
                2936
            ],
            [
                2936,
                3099
            ],
            [
                3099,
                3190
            ],
            [
                3190,
                3307
            ],
            [
                3307,
                3421
            ],
            [
                3421,
                3467
            ],
            [
                3467,
                3499
            ],
            [
                3499,
                3605
            ],
            [
                3605,
                3694
            ],
            [
                3694,
                3717
            ],
            [
                3717,
                3794
            ],
            [
                3794,
                3825
            ],
            [
                3825,
                3835
            ],
            [
                3835,
                3856
            ],
            [
                3856,
                3917
            ],
            [
                3917,
                3938
            ],
            [
                3938,
                3975
            ],
            [
                3975,
                4059
            ],
            [
                4059,
                4141
            ],
            [
                4141,
                4176
            ],
            [
                4176,
                4201
            ],
            [
                4201,
                4296
            ],
            [
                4296,
                4430
            ],
            [
                4430,
                4609
            ],
            [
                4609,
                4654
            ],
            [
                4654,
                4730
            ],
            [
                4730,
                4778
            ],
            [
                4778,
                4805
            ],
            [
                4805,
                4906
            ],
            [
                4906,
                4962
            ],
            [
                4962,
                5099
            ],
            [
                5099,
                5116
            ],
            [
                5116,
                5153
            ],
            [
                5153,
                5222
            ],
            [
                5222,
                5272
            ],
            [
                5272,
                5314
            ],
            [
                5314,
                5347
            ],
            [
                5347,
                5426
            ],
            [
                5426,
                5548
            ],
            [
                5548,
                5850
            ],
            [
                5850,
                5938
            ],
            [
                5938,
                6151
            ],
            [
                6151,
                6255
            ],
            [
                6255,
                6412
            ],
            [
                6412,
                6485
            ],
            [
                6485,
                6530
            ],
            [
                6530,
                6547
            ],
            [
                6547,
                6676
            ],
            [
                6676,
                6856
            ],
            [
                6856,
                6994
            ],
            [
                6994,
                7051
            ],
            [
                7051,
                7196
            ],
            [
                7196,
                7273
            ],
            [
                7273,
                7379
            ],
            [
                7379,
                7499
            ],
            [
                7499,
                7618
            ],
            [
                7618,
                7667
            ],
            [
                7667,
                7704
            ],
            [
                7704,
                7760
            ],
            [
                7760,
                7796
            ],
            [
                7796,
                7833
            ],
            [
                7833,
                7917
            ],
            [
                7917,
                7958
            ],
            [
                7958,
                8010
            ],
            [
                8010,
                8125
            ],
            [
                8125,
                8184
            ],
            [
                8184,
                8252
            ],
            [
                8252,
                8365
            ],
            [
                8365,
                8398
            ],
            [
                8398,
                8431
            ],
            [
                8431,
                8546
            ],
            [
                8546,
                8637
            ],
            [
                8637,
                8777
            ],
            [
                8777,
                8883
            ],
            [
                8883,
                8936
            ],
            [
                8936,
                9014
            ],
            [
                9014,
                9060
            ],
            [
                9060,
                9220
            ],
            [
                9220,
                9286
            ],
            [
                9286,
                9480
            ],
            [
                9480,
                9566
            ],
            [
                9566,
                9697
            ],
            [
                9697,
                9837
            ],
            [
                9837,
                9910
            ],
            [
                9910,
                9938
            ],
            [
                9938,
                10239
            ],
            [
                10239,
                10343
            ],
            [
                10343,
                10390
            ],
            [
                10390,
                10545
            ],
            [
                10545,
                10626
            ],
            [
                10626,
                10762
            ],
            [
                10762,
                10835
            ],
            [
                10835,
                10875
            ],
            [
                10875,
                10937
            ],
            [
                10937,
                11018
            ],
            [
                11018,
                11057
            ],
            [
                11057,
                11096
            ],
            [
                11096,
                11119
            ],
            [
                11119,
                11164
            ],
            [
                11164,
                11174
            ],
            [
                11174,
                11231
            ],
            [
                11231,
                11334
            ],
            [
                11334,
                11354
            ],
            [
                11354,
                11398
            ],
            [
                11398,
                11419
            ],
            [
                11419,
                11483
            ],
            [
                11483,
                11659
            ],
            [
                11659,
                11682
            ],
            [
                11682,
                11731
            ],
            [
                11731,
                11776
            ],
            [
                11776,
                11806
            ],
            [
                11806,
                11946
            ],
            [
                11946,
                12003
            ],
            [
                12003,
                12093
            ],
            [
                12093,
                12158
            ],
            [
                12158,
                12209
            ],
            [
                12209,
                12293
            ],
            [
                12293,
                12347
            ],
            [
                12347,
                12535
            ],
            [
                12535,
                12586
            ],
            [
                12586,
                12761
            ],
            [
                12761,
                12915
            ],
            [
                12915,
                13013
            ],
            [
                13013,
                13081
            ],
            [
                13081,
                13114
            ],
            [
                13114,
                13322
            ],
            [
                13322,
                13418
            ],
            [
                13418,
                13570
            ],
            [
                13570,
                13613
            ],
            [
                13613,
                13775
            ],
            [
                13775,
                13829
            ],
            [
                13829,
                13911
            ],
            [
                13911,
                13969
            ],
            [
                13969,
                14452
            ],
            [
                14452,
                14520
            ],
            [
                14520,
                14663
            ],
            [
                14663,
                14835
            ],
            [
                14835,
                14914
            ],
            [
                14914,
                15109
            ],
            [
                15109,
                15176
            ],
            [
                15176,
                15230
            ],
            [
                15230,
                15269
            ],
            [
                15269,
                15322
            ],
            [
                15322,
                15353
            ],
            [
                15353,
                15382
            ],
            [
                15382,
                15420
            ],
            [
                15420,
                15465
            ],
            [
                15465,
                15478
            ],
            [
                15478,
                15531
            ],
            [
                15531,
                15565
            ],
            [
                15565,
                15624
            ],
            [
                15624,
                15715
            ],
            [
                15715,
                15773
            ],
            [
                15773,
                15866
            ],
            [
                15866,
                15925
            ],
            [
                15925,
                16074
            ],
            [
                16074,
                16150
            ],
            [
                16150,
                16261
            ],
            [
                16261,
                16337
            ],
            [
                16337,
                16438
            ],
            [
                16438,
                16590
            ],
            [
                16590,
                16760
            ],
            [
                16760,
                16823
            ],
            [
                16823,
                16887
            ],
            [
                16887,
                17003
            ],
            [
                17003,
                17104
            ],
            [
                17104,
                17197
            ],
            [
                17197,
                17253
            ],
            [
                17253,
                17304
            ],
            [
                17304,
                17338
            ],
            [
                17338,
                17570
            ],
            [
                17570,
                17704
            ],
            [
                17704,
                18005
            ],
            [
                18005,
                18160
            ]
        ],
        "overlap_chars": [
            [
                0,
                84
            ],
            [
                135,
                141
            ],
            [
                179,
                183
            ],
            [
                188,
                189
            ],
            [
                141,
                142
            ],
            [
                286,
                292
            ],
            [
                207,
                208
            ],
            [
                283,
                284
            ],
            [
                293,
                296
            ],
            [
                308,
                315
            ],
            [
                629,
                635
            ],
            [
                636,
                652
            ],
            [
                752,
                780
            ],
            [
                821,
                841
            ],
            [
                797,
                800
            ],
            [
                842,
                846
            ],
            [
                780,
                781
            ],
            [
                892,
                910
            ],
            [
                915,
                928
            ],
            [
                941,
                948
            ],
            [
                879,
                881
            ],
            [
                938,
                940
            ],
            [
                882,
                883
            ],
            [
                1024,
                1026
            ],
            [
                1083,
                1118
            ],
            [
                1674,
                1675
            ],
            [
                1079,
                1082
            ],
            [
                1120,
                1123
            ],
            [
                1251,
                1274
            ],
            [
                1280,
                1312
            ],
            [
                1402,
                1405
            ],
            [
                1320,
                1346
            ],
            [
                1593,
                1595
            ],
            [
                1605,
                1612
            ],
            [
                1617,
                1674
            ],
            [
                1118,
                1119
            ],
            [
                1676,
                1679
            ],
            [
                1750,
                1774
            ],
            [
                1157,
                1160
            ],
            [
                1202,
                1207
            ],
            [
                1829,
                1853
            ],
            [
                1876,
                1909
            ],
            [
                1923,
                1925
            ],
            [
                1925,
                1935
            ],
            [
                1948,
                1957
            ],
            [
                2011,
                2023
            ],
            [
                1985,
                1990
            ],
            [
                2030,
                2051
            ],
            [
                1995,
                2003
            ],
            [
                2235,
                2280
            ],
            [
                2282,
                2284
            ],
            [
                2475,
                2476
            ],
            [
                2063,
                2066
            ],
            [
                2194,
                2204
            ],
            [
                1962,
                1966
            ],
            [
                2090,
                2103
            ],
            [
                2112,
                2175
            ],
            [
                2597,
                2599
            ],
            [
                2599,
                2645
            ],
            [
                2713,
                2753
            ],
            [
                2704,
                2711
            ],
            [
                2758,
                2770
            ],
            [
                2770,
                2804
            ],
            [
                2822,
                2826
            ],
            [
                2830,
                2842
            ],
            [
                2852,
                2856
            ],
            [
                2865,
                2866
            ],
            [
                2867,
                2903
            ],
            [
                2903,
                2936
            ],
            [
                2936,
                2953
            ],
            [
                3035,
                3045
            ],
            [
                3066,
                3078
            ],
            [
                3084,
                3099
            ],
            [
                3099,
                3109
            ],
            [
                3119,
                3190
            ],
            [
                3307,
                3379
            ],
            [
                3418,
                3421
            ],
            [
                3421,
                3436
            ],
            [
                3467,
                3499
            ],
            [
                3499,
                3500
            ],
            [
                3514,
                3515
            ],
            [
                3573,
                3575
            ],
            [
                3603,
                3605
            ],
            [
                3605,
                3694
            ],
            [
                3694,
                3715
            ],
            [
                3794,
                3825
            ],
            [
                3825,
                3835
            ],
            [
                3856,
                3914
            ],
            [
                3975,
                3988
            ],
            [
                4059,
                4141
            ],
            [
                4163,
                4176
            ],
            [
                4176,
                4201
            ],
            [
                4356,
                4359
            ],
            [
                4304,
                4314
            ],
            [
                4334,
                4337
            ],
            [
                4360,
                4364
            ],
            [
                4393,
                4429
            ],
            [
                4430,
                4463
            ],
            [
                4493,
                4501
            ],
            [
                4513,
                4519
            ],
            [
                4536,
                4543
            ],
            [
                4607,
                4609
            ],
            [
                4609,
                4642
            ],
            [
                4643,
                4654
            ],
            [
                4654,
                4727
            ],
            [
                4962,
                4968
            ],
            [
                4985,
                5030
            ],
            [
                5032,
                5060
            ],
            [
                5084,
                5088
            ],
            [
                5061,
                5064
            ],
            [
                5065,
                5075
            ],
            [
                5096,
                5098
            ],
            [
                5102,
                5116
            ],
            [
                5159,
                5190
            ],
            [
                5314,
                5347
            ],
            [
                5347,
                5381
            ],
            [
                5390,
                5407
            ],
            [
                5488,
                5522
            ],
            [
                5532,
                5547
            ],
            [
                5548,
                5571
            ],
            [
                5659,
                5662
            ],
            [
                5611,
                5657
            ],
            [
                5601,
                5602
            ],
            [
                5938,
                6051
            ],
            [
                6058,
                6150
            ],
            [
                6151,
                6255
            ],
            [
                6255,
                6271
            ],
            [
                6296,
                6324
            ],
            [
                6442,
                6458
            ],
            [
                6465,
                6482
            ],
            [
                6410,
                6411
            ],
            [
                6485,
                6530
            ],
            [
                6549,
                6557
            ],
            [
                6560,
                6675
            ],
            [
                6676,
                6725
            ],
            [
                6856,
                6863
            ],
            [
                6872,
                6885
            ],
            [
                6892,
                6898
            ],
            [
                6936,
                6993
            ],
            [
                6994,
                7051
            ],
            [
                7051,
                7068
            ],
            [
                7119,
                7196
            ],
            [
                7196,
                7223
            ],
            [
                7233,
                7235
            ],
            [
                7252,
                7271
            ],
            [
                7317,
                7318
            ],
            [
                7273,
                7276
            ],
            [
                7286,
                7292
            ],
            [
                7294,
                7317
            ],
            [
                7377,
                7379
            ],
            [
                7618,
                7666
            ],
            [
                7667,
                7695
            ],
            [
                7696,
                7702
            ],
            [
                7702,
                7704
            ],
            [
                7917,
                7958
            ],
            [
                7958,
                8010
            ],
            [
                8010,
                8036
            ],
            [
                8053,
                8085
            ],
            [
                8094,
                8125
            ],
            [
                8125,
                8184
            ],
            [
                8184,
                8252
            ],
            [
                8252,
                8331
            ],
            [
                8363,
                8365
            ],
            [
                8365,
                8383
            ],
            [
                8396,
                8398
            ],
            [
                8637,
                8721
            ],
            [
                8726,
                8738
            ],
            [
                8744,
                8757
            ],
            [
                8769,
                8774
            ],
            [
                8777,
                8780
            ],
            [
                8845,
                8852
            ],
            [
                8863,
                8883
            ],
            [
                9060,
                9083
            ],
            [
                9094,
                9130
            ],
            [
                9142,
                9147
            ],
            [
                9154,
                9155
            ],
            [
                9151,
                9154
            ],
            [
                9175,
                9219
            ],
            [
                9480,
                9511
            ],
            [
                9525,
                9543
            ],
            [
                9555,
                9558
            ],
            [
                9545,
                9553
            ],
            [
                9564,
                9566
            ],
            [
                9566,
                9623
            ],
            [
                9695,
                9697
            ],
            [
                9697,
                9799
            ],
            [
                9821,
                9837
            ],
            [
                9837,
                9858
            ],
            [
                9875,
                9910
            ],
            [
                9938,
                10016
            ],
            [
                10049,
                10143
            ],
            [
                10165,
                10238
            ],
            [
                10298,
                10315
            ],
            [
                10341,
                10343
            ],
            [
                10343,
                10390
            ],
            [
                10390,
                10397
            ],
            [
                10403,
                10485
            ],
            [
                10487,
                10504
            ],
            [
                10508,
                10545
            ],
            [
                10545,
                10577
            ],
            [
                10579,
                10625
            ],
            [
                10762,
                10774
            ],
            [
                10628,
                10636
            ],
            [
                10778,
                10782
            ],
            [
                10798,
                10834
            ],
            [
                10835,
                10875
            ],
            [
                10875,
                10901
            ],
            [
                10935,
                10937
            ],
            [
                10937,
                10944
            ],
            [
                10958,
                11018
            ],
            [
                11018,
                11057
            ],
            [
                11119,
                11132
            ],
            [
                11148,
                11164
            ],
            [
                11164,
                11174
            ],
            [
                11184,
                11231
            ],
            [
                11231,
                11334
            ],
            [
                11334,
                11345
            ],
            [
                11348,
                11354
            ],
            [
                11354,
                11398
            ],
            [
                11398,
                11419
            ],
            [
                11419,
                11483
            ],
            [
                11483,
                11493
            ],
            [
                11516,
                11523
            ],
            [
                11529,
                11613
            ],
            [
                11630,
                11659
            ],
            [
                11659,
                11682
            ],
            [
                11682,
                11731
            ],
            [
                11731,
                11776
            ],
            [
                11776,
                11779
            ],
            [
                11782,
                11806
            ],
            [
                11946,
                11990
            ],
            [
                11998,
                12003
            ],
            [
                12003,
                12093
            ],
            [
                12093,
                12158
            ],
            [
                12158,
                12209
            ],
            [
                12209,
                12231
            ],
            [
                12235,
                12247
            ],
            [
                12259,
                12293
            ],
            [
                12293,
                12347
            ],
            [
                12347,
                12353
            ],
            [
                12360,
                12376
            ],
            [
                12379,
                12446
            ],
            [
                12453,
                12469
            ],
            [
                12472,
                12497
            ],
            [
                12376,
                12377
            ],
            [
                12535,
                12536
            ],
            [
                12544,
                12559
            ],
            [
                12583,
                12586
            ],
            [
                12586,
                12599
            ],
            [
                12605,
                12607
            ],
            [
                12622,
                12625
            ],
            [
                12629,
                12635
            ],
            [
                12649,
                12663
            ],
            [
                12713,
                12761
            ],
            [
                12886,
                12895
            ],
            [
                12860,
                12864
            ],
            [
                12786,
                12795
            ],
            [
                12828,
                12830
            ],
            [
                12902,
                12909
            ],
            [
                12913,
                12915
            ],
            [
                13095,
                13114
            ],
            [
                13114,
                13196
            ],
            [
                13214,
                13259
            ],
            [
                13279,
                13321
            ],
            [
                13322,
                13418
            ],
            [
                13418,
                13470
            ],
            [
                13568,
                13569
            ],
            [
                13570,
                13605
            ],
            [
                13911,
                13969
            ],
            [
                13969,
                14029
            ],
            [
                14055,
                14178
            ],
            [
                14185,
                14227
            ],
            [
                14270,
                14386
            ],
            [
                14389,
                14452
            ],
            [
                14452,
                14520
            ],
            [
                14520,
                14586
            ],
            [
                14661,
                14662
            ],
            [
                14663,
                14693
            ],
            [
                14704,
                14719
            ],
            [
                14721,
                14725
            ],
            [
                14772,
                14835
            ],
            [
                14924,
                14927
            ],
            [
                14918,
                14923
            ],
            [
                14928,
                14944
            ],
            [
                14949,
                15014
            ],
            [
                15026,
                15032
            ],
            [
                15034,
                15051
            ],
            [
                15054,
                15108
            ],
            [
                15322,
                15350
            ],
            [
                15217,
                15229
            ],
            [
                15531,
                15535
            ],
            [
                15541,
                15565
            ],
            [
                15565,
                15584
            ],
            [
                15595,
                15624
            ],
            [
                15624,
                15631
            ],
            [
                15673,
                15715
            ],
            [
                15715,
                15731
            ],
            [
                15735,
                15773
            ],
            [
                15773,
                15807
            ],
            [
                15817,
                15849
            ],
            [
                15861,
                15866
            ],
            [
                15866,
                15925
            ],
            [
                15974,
                16016
            ],
            [
                15963,
                15964
            ],
            [
                16074,
                16085
            ],
            [
                16024,
                16025
            ],
            [
                16017,
                16024
            ],
            [
                16148,
                16150
            ],
            [
                16150,
                16261
            ],
            [
                16261,
                16337
            ],
            [
                16662,
                16665
            ],
            [
                16605,
                16611
            ],
            [
                16596,
                16599
            ],
            [
                16612,
                16638
            ],
            [
                16590,
                16595
            ],
            [
                16671,
                16674
            ],
            [
                16675,
                16688
            ],
            [
                16741,
                16760
            ],
            [
                16792,
                16803
            ],
            [
                16783,
                16786
            ],
            [
                16804,
                16823
            ],
            [
                16887,
                16932
            ],
            [
                16937,
                17003
            ],
            [
                17003,
                17104
            ],
            [
                17104,
                17125
            ],
            [
                17127,
                17147
            ],
            [
                17166,
                17167
            ],
            [
                17186,
                17197
            ],
            [
                17197,
                17253
            ],
            [
                17304,
                17338
            ],
            [
                17338,
                17346
            ],
            [
                17376,
                17400
            ],
            [
                17409,
                17489
            ],
            [
                17568,
                17570
            ],
            [
                17570,
                17640
            ],
            [
                17665,
                17704
            ],
            [
                17704,
                17735
            ],
            [
                17809,
                17839
            ],
            [
                17861,
                17867
            ],
            [
                17879,
                17915
            ],
            [
                17928,
                17929
            ],
            [
                17930,
                17938
            ],
            [
                18003,
                18005
            ],
            [
                18005,
                18160
            ]
        ],
        "row_chars": [
            [
                0,
                315
            ],
            [
                315,
                414
            ],
            [
                414,
                629
            ],
            [
                629,
                780
            ],
            [
                780,
                1026
            ],
            [
                1026,
                1925
            ],
            [
                1925,
                2599
            ],
            [
                2599,
                2645
            ],
            [
                2645,
                2770
            ],
            [
                2770,
                2867
            ],
            [
                2867,
                2903
            ],
            [
                2903,
                2936
            ],
            [
                2936,
                3099
            ],
            [
                3099,
                3190
            ],
            [
                3190,
                3307
            ],
            [
                3307,
                3421
            ],
            [
                3421,
                3499
            ],
            [
                3499,
                3605
            ],
            [
                3605,
                3694
            ],
            [
                3694,
                3717
            ],
            [
                3717,
                3794
            ],
            [
                3794,
                3825
            ],
            [
                3825,
                3835
            ],
            [
                3835,
                3856
            ],
            [
                3856,
                3917
            ],
            [
                3917,
                3938
            ],
            [
                3938,
                3975
            ],
            [
                3975,
                4141
            ],
            [
                4141,
                4176
            ],
            [
                4176,
                4201
            ],
            [
                4201,
                4296
            ],
            [
                4296,
                4430
            ],
            [
                4430,
                4609
            ],
            [
                4609,
                4654
            ],
            [
                4654,
                4730
            ],
            [
                4730,
                4778
            ],
            [
                4778,
                4805
            ],
            [
                4805,
                4906
            ],
            [
                4906,
                4962
            ],
            [
                4962,
                5099
            ],
            [
                5099,
                5116
            ],
            [
                5116,
                5153
            ],
            [
                5153,
                5347
            ],
            [
                5347,
                5548
            ],
            [
                5548,
                5850
            ],
            [
                5850,
                5938
            ],
            [
                5938,
                6151
            ],
            [
                6151,
                6255
            ],
            [
                6255,
                6485
            ],
            [
                6485,
                6530
            ],
            [
                6530,
                6547
            ],
            [
                6547,
                6676
            ],
            [
                6676,
                6994
            ],
            [
                6994,
                7051
            ],
            [
                7051,
                7196
            ],
            [
                7196,
                7379
            ],
            [
                7379,
                7499
            ],
            [
                7499,
                7618
            ],
            [
                7618,
                7667
            ],
            [
                7667,
                7704
            ],
            [
                7704,
                7760
            ],
            [
                7760,
                7796
            ],
            [
                7796,
                7833
            ],
            [
                7833,
                7917
            ],
            [
                7917,
                7958
            ],
            [
                7958,
                8010
            ],
            [
                8010,
                8125
            ],
            [
                8125,
                8184
            ],
            [
                8184,
                8252
            ],
            [
                8252,
                8365
            ],
            [
                8365,
                8398
            ],
            [
                8398,
                8431
            ],
            [
                8431,
                8546
            ],
            [
                8546,
                8637
            ],
            [
                8637,
                8777
            ],
            [
                8777,
                8883
            ],
            [
                8883,
                8936
            ],
            [
                8936,
                9014
            ],
            [
                9014,
                9060
            ],
            [
                9060,
                9220
            ],
            [
                9220,
                9286
            ],
            [
                9286,
                9480
            ],
            [
                9480,
                9566
            ],
            [
                9566,
                9697
            ],
            [
                9697,
                9837
            ],
            [
                9837,
                9910
            ],
            [
                9910,
                9938
            ],
            [
                9938,
                10239
            ],
            [
                10239,
                10343
            ],
            [
                10343,
                10390
            ],
            [
                10390,
                10545
            ],
            [
                10545,
                10626
            ],
            [
                10626,
                10835
            ],
            [
                10835,
                10875
            ],
            [
                10875,
                10937
            ],
            [
                10937,
                11018
            ],
            [
                11018,
                11057
            ],
            [
                11057,
                11096
            ],
            [
                11096,
                11119
            ],
            [
                11119,
                11164
            ],
            [
                11164,
                11174
            ],
            [
                11174,
                11231
            ],
            [
                11231,
                11334
            ],
            [
                11334,
                11354
            ],
            [
                11354,
                11398
            ],
            [
                11398,
                11419
            ],
            [
                11419,
                11483
            ],
            [
                11483,
                11659
            ],
            [
                11659,
                11682
            ],
            [
                11682,
                11731
            ],
            [
                11731,
                11776
            ],
            [
                11776,
                11806
            ],
            [
                11806,
                11946
            ],
            [
                11946,
                12003
            ],
            [
                12003,
                12093
            ],
            [
                12093,
                12158
            ],
            [
                12158,
                12209
            ],
            [
                12209,
                12293
            ],
            [
                12293,
                12347
            ],
            [
                12347,
                12586
            ],
            [
                12586,
                12761
            ],
            [
                12761,
                12915
            ],
            [
                12915,
                13013
            ],
            [
                13013,
                13081
            ],
            [
                13081,
                13114
            ],
            [
                13114,
                13322
            ],
            [
                13322,
                13418
            ],
            [
                13418,
                13570
            ],
            [
                13570,
                13613
            ],
            [
                13613,
                13775
            ],
            [
                13775,
                13829
            ],
            [
                13829,
                13911
            ],
            [
                13911,
                13969
            ],
            [
                13969,
                14452
            ],
            [
                14452,
                14520
            ],
            [
                14520,
                14663
            ],
            [
                14663,
                14835
            ],
            [
                14835,
                14914
            ],
            [
                14914,
                15109
            ],
            [
                15109,
                15176
            ],
            [
                15176,
                15353
            ],
            [
                15353,
                15382
            ],
            [
                15382,
                15420
            ],
            [
                15420,
                15465
            ],
            [
                15465,
                15478
            ],
            [
                15478,
                15531
            ],
            [
                15531,
                15565
            ],
            [
                15565,
                15624
            ],
            [
                15624,
                15715
            ],
            [
                15715,
                15773
            ],
            [
                15773,
                15866
            ],
            [
                15866,
                15925
            ],
            [
                15925,
                16150
            ],
            [
                16150,
                16261
            ],
            [
                16261,
                16337
            ],
            [
                16337,
                16438
            ],
            [
                16438,
                16590
            ],
            [
                16590,
                16760
            ],
            [
                16760,
                16823
            ],
            [
                16823,
                16887
            ],
            [
                16887,
                17003
            ],
            [
                17003,
                17104
            ],
            [
                17104,
                17197
            ],
            [
                17197,
                17253
            ],
            [
                17253,
                17304
            ],
            [
                17304,
                17338
            ],
            [
                17338,
                17570
            ],
            [
                17570,
                17704
            ],
            [
                17704,
                18005
            ],
            [
                18005,
                18160
            ]
        ]
    },
    "abridged": {
        "text": "When Sir Felix Carbury declared to his friends at the Beargarden that he intended to travel abroad with a clergyman, he was, for once, not lying. He was indeed going to Germany for the next twelve months. The Bishop of London had recently decided that a small commercial town in north-eastern Prussia was in need of a minister. The income suggested was very small; but the Morning Breakfast Table interested itself in the matter, and appealed for subscriptions so successfully that it at last devolved upon Mr. Broune to appoint the clergyman.\nAnd so the Rev. Septimus Blake, who took the post, was also induced to undertake the charge of Sir Felix Carbury for a further payment. Mr. Broune gave Mr. Blake much counsel about the management of the baronet, who should see as much as possible of German life at modest expense; and Mr. Broune emphasised that the clergyman should on no account give Sir Felix the means of returning home early.\nLady Carbury had at first opposed the scheme. She could not endure the idea of driving her son into exile. But Mr. Broune was very obstinate, and, she thought, hard-hearted.\n\"What is to be the end of it then?\" he said to her, almost in anger. For in those days Mr. Broune no longer squeezed her hand and looked into her eyes. His manner had become so different that she regarded him as quite another person. \"Do you mean to let him eat up everything you have to your last shilling?\"\n\"Oh, my friend, do not say such horrid things.\"\n\"I have to. What hardship will there be in his living for twelve months with a clergyman in Prussia? What can he do better?\"\n\"If he could only be married!\"\n\"Married! Why should any girl with money throw herself away upon him? Lady Carbury, if you keep him here you will help to ruin him, and will certainly ruin yourself. Let him go.\"\nShe was forced to yield. And Mr. Broune was equally firm in persuading Sir Felix to start upon his travels.\n\"Your mother,\" said Mr. Broune, \"will not beggar herself to indulge you. She cannot make you go to Germany, of course. But she can turn you out of her house, and, unless you go, she will do so. If you go, 175 a year will be paid for your maintenance; but if you remain in England you will not get a shilling.\"\nFelix had no money. No tradesman would give him credit, and his clothes were becoming rusty. There was no prospect of amusement during the coming months; and he thought that any change must be for the better.\nHe assented, therefore, and was duly introduced to the Rev. Septimus Blake. Before the end of August Sir Felix, with Mr. and Mrs. Blake and the young Blakes, had embarked from Hull for Hamburg - having extracted at the very hour of parting a last five-pound note from his foolish mother.\n\"It will be just enough to bring him home,\" said Mr. Broune with angry energy when he was told of this. But Lady Carbury assured him that Felix would have spent the sum long before they reached their destination.\n\"Then why the deuce should you give it him?\" said Mr. Broune, whose anxiety had been so intense that he had paid half a year's allowance in advance to Mr. Blake out of his own pocket.\nIndeed, he had paid various sums for Lady Carbury; and he came three or four evenings a week, and gave her instructions as to all that she should do.\n\"I wouldn't write another novel if I were you,\" he said. This was hard, as she had flattered herself that the one novel which she had written was good. Mr. Broune's own critic had reviewed it in glowing language, although the Evening Pulpit had of course abused it. She looked up at him piteously but said nothing.\n\"I don't think you'd find it would answer,\" said Mr. Broune. \"I think I would turn to something else.\"\n\"It is so very hard to get paid for what one does.\"\nTo this Mr. Broune made no reply; but, after sitting for a while in silence, he took his leave. On that very morning Lady Carbury had parted from her son. She was soon about to part from her daughter, and she was very sad. She felt that she could hardly keep up that house in Welbeck Street for herself. What should she do? That very morning she had prided herself on her coming success as a novelist, basing her hopes on the review in the Breakfast Table. Now she was equally despondent. After what he had said, there would be no more praise in the Breakfast Table, - and no novel of hers could succeed without that.\nOn the next day he did not come, and she sat idle and wretched. She could not interest herself in Hetta's coming marriage. She had not ventured to confess so much to Mr. Broune, but she had in truth written the first pages of a second novel. It was impossible now to even look at what she had written. She spent the evening quite alone; for Hetta was staying down in Suffolk, with the bishop's wife; and as she thought of her life past and her life to come, she did, perhaps, see something of the error of her ways, and did, after a fashion, repent.\nIt was all vanity! What real enjoyment had she found in anything? She had taught herself to believe that some day something would come which she would like; but she had never yet in truth found anything to like. It had all been in anticipation, but now even her anticipations were at an end.\nThe next day Mr. Broune came, and found her still very wretched.\n\"I shall give up this house,\" she said. \"I can't afford to keep it. I don't know where to go, but I don't think that it much signifies. Any place will be the same to me now.\"\n\"You wouldn't go out of London.\"\n\"Why not? I had better go wherever I can live cheapest.\"\n\"I should be sorry that you should be settled where I could not see you,\" said Mr. Broune plaintively.\n\"So shall I - very. You have been more kind to me than anybody. But what am I to do? If I stay in London I can live only in some miserable lodgings. I know you tell me I am wrong; but my idea is that I shall follow Felix wherever he goes, so that I may help him when he needs help. Hetta doesn't want me. There is nobody else that I can do any good to.\"\n\"I want you,\" said Mr. Broune, very quietly.\n\"Ah - that is so kind of you. You say you want me, because I have so sadly needed you. When I go you will simply miss an almost daily trouble, but where shall I find a friend?\"\n\"When I said I wanted you, I meant more than that, Lady Carbury. Two or three months ago I asked you to be my wife. You declined, chiefly, I understood, because of your son's position. That has been altered, and therefore I ask you again. I have convinced myself - not without some doubts, for you shall know all; but, still, I have convinced myself that such a marriage will make me happy, and I think, dearest, you too.\"\nThis was said so quietly and placidly that the words hardly at first brought themselves home to her. She could not feel his offer was in earnest. It was so improbable! Her opinion of herself was so poor, she had become so sick of her own vanities and pretences, that she could not understand that he should in truth want to make her his wife.\nAt this moment she thought less of herself and more of Mr. Broune than either perhaps deserved. She sat silent, quite unable to look him in the face.\n\"Well,\" he said; \"what do you think?\"\nThe long vista of her past life appeared before her eyes. The ambition of her youth which had been taught to look only for money, the cruelty of her husband which had driven her to run from him, the further cruelty of his forgiveness when she returned; the calumny which had made her miserable; then her attempts at life in London, her literary successes and failures, and the wretchedness of her son's career - there had never been happiness, or even comfort, in any of it. Even when her smiles had been sweetest her heart had been heaviest. Could it be that now at last real peace should be within her reach?\nThen she remembered that first attempted kiss, when she had told herself that the man was a susceptible old goose. She could not quite understand whether she had been right then, and that the man's feelings, and even nature had since changed - or whether he had really loved her from first to last.\n\"There is so much against me,\" she said. \"And I have become so poor!\"\n\"I am not proposing to marry you for your money. Luckily it is not necessary that I should do so.\"\n\"And then I seem to have fallen through in everything. I don't know what I've got to give in return for all that you offer me.\"\n\"Yourself,\" he said, stretching out his right hand to her. She found herself compelled to put her own, very slowly, into it. Then he drew her towards him, and in a moment she was kneeling at his feet, with her face buried on his knees. Considering their ages perhaps we must say that their attitude was awkward. But Age is not ashamed of feeling passion - it is only the public display of it which Age regrets.\nLittle more was said between them. As he went down to his office he told himself that he had done the best, not only for her but for himself also. And yet I think that she had won him more thoroughly by her former refusal than by any other virtue.\nShe, as she sat alone late into the night, underwent a reversal of spirit. That morning the world had been a perfect blank to her. Now everything was rose-coloured. This man, who had given her such proofs of his affection and truth, was one of the considerable ones of the world. Was it not a career enough for any woman to be the wife of such a man, and to shine with his reflected glory?\nWhether her hopes were realised, these pages cannot tell; but before winter was over, Lady Carbury became Mrs. Broune. The house in Welbeck Street was kept, and Mrs. Broune's Tuesday evenings were much more regarded by the literary world than had been those of Lady Carbury.",
        "paragraph_chars": [
            [
                0,
                544
            ],
            [
                544,
                941
            ],
            [
                941,
                1115
            ],
            [
                1115,
                1424
            ],
            [
                1424,
                1472
            ],
            [
                1472,
                1597
            ],
            [
                1597,
                1628
            ],
            [
                1628,
                1807
            ],
            [
                1807,
                1915
            ],
            [
                1915,
                2225
            ],
            [
                2225,
                2434
            ],
            [
                2434,
                2722
            ],
            [
                2722,
                2935
            ],
            [
                2935,
                3119
            ],
            [
                3119,
                3269
            ],
            [
                3269,
                3584
            ],
            [
                3584,
                3687
            ],
            [
                3687,
                3739
            ],
            [
                3739,
                4357
            ],
            [
                4357,
                4907
            ],
            [
                4907,
                5199
            ],
            [
                5199,
                5264
            ],
            [
                5264,
                5439
            ],
            [
                5439,
                5472
            ],
            [
                5472,
                5529
            ],
            [
                5529,
                5632
            ],
            [
                5632,
                5986
            ],
            [
                5986,
                6031
            ],
            [
                6031,
                6208
            ],
            [
                6208,
                6631
            ],
            [
                6631,
                6974
            ],
            [
                6974,
                7124
            ],
            [
                7124,
                7162
            ],
            [
                7162,
                7773
            ],
            [
                7773,
                8072
            ],
            [
                8072,
                8142
            ],
            [
                8142,
                8241
            ],
            [
                8241,
                8369
            ],
            [
                8369,
                8780
            ],
            [
                8780,
                9028
            ],
            [
                9028,
                9418
            ],
            [
                9418,
                9692
            ]
        ],
        "segment_chars": [
            [
                0,
                146
            ],
            [
                146,
                205
            ],
            [
                205,
                328
            ],
            [
                328,
                544
            ],
            [
                544,
                680
            ],
            [
                680,
                941
            ],
            [
                941,
                987
            ],
            [
                987,
                1048
            ],
            [
                1048,
                1115
            ],
            [
                1115,
                1151
            ],
            [
                1151,
                1184
            ],
            [
                1184,
                1267
            ],
            [
                1267,
                1349
            ],
            [
                1349,
                1424
            ],
            [
                1424,
                1472
            ],
            [
                1472,
                1484
            ],
            [
                1484,
                1573
            ],
            [
                1573,
                1597
            ],
            [
                1597,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1698
            ],
            [
                1698,
                1794
            ],
            [
                1794,
                1807
            ],
            [
                1807,
                1832
            ],
            [
                1832,
                1915
            ],
            [
                1915,
                1988
            ],
            [
                1988,
                2034
            ],
            [
                2034,
                2109
            ],
            [
                2109,
                2225
            ],
            [
                2225,
                2245
            ],
            [
                2245,
                2318
            ],
            [
                2318,
                2434
            ],
            [
                2434,
                2510
            ],
            [
                2510,
                2722
            ],
            [
                2722,
                2826
            ],
            [
                2826,
                2935
            ],
            [
                2935,
                2980
            ],
            [
                2980,
                3119
            ],
            [
                3119,
                3269
            ],
            [
                3269,
                3326
            ],
            [
                3326,
                3421
            ],
            [
                3421,
                3535
            ],
            [
                3535,
                3584
            ],
            [
                3584,
                3645
            ],
            [
                3645,
                3687
            ],
            [
                3687,
                3739
            ],
            [
                3739,
                3835
            ],
            [
                3835,
                3894
            ],
            [
                3894,
                3962
            ],
            [
                3962,
                4043
            ],
            [
                4043,
                4063
            ],
            [
                4063,
                4196
            ],
            [
                4196,
                4228
            ],
            [
                4228,
                4357
            ],
            [
                4357,
                4421
            ],
            [
                4421,
                4480
            ],
            [
                4480,
                4599
            ],
            [
                4599,
                4659
            ],
            [
                4659,
                4907
            ],
            [
                4907,
                4926
            ],
            [
                4926,
                4973
            ],
            [
                4973,
                5119
            ],
            [
                5119,
                5199
            ],
            [
                5199,
                5264
            ],
            [
                5264,
                5304
            ],
            [
                5304,
                5332
            ],
            [
                5332,
                5400
            ],
            [
                5400,
                5439
            ],
            [
                5439,
                5472
            ],
            [
                5472,
                5482
            ],
            [
                5482,
                5529
            ],
            [
                5529,
                5632
            ],
            [
                5632,
                5652
            ],
            [
                5652,
                5696
            ],
            [
                5696,
                5717
            ],
            [
                5717,
                5781
            ],
            [
                5781,
                5914
            ],
            [
                5914,
                5937
            ],
            [
                5937,
                5986
            ],
            [
                5986,
                6031
            ],
            [
                6031,
                6061
            ],
            [
                6061,
                6118
            ],
            [
                6118,
                6208
            ],
            [
                6208,
                6273
            ],
            [
                6273,
                6324
            ],
            [
                6324,
                6393
            ],
            [
                6393,
                6447
            ],
            [
                6447,
                6631
            ],
            [
                6631,
                6732
            ],
            [
                6732,
                6777
            ],
            [
                6777,
                6799
            ],
            [
                6799,
                6974
            ],
            [
                6974,
                7070
            ],
            [
                7070,
                7124
            ],
            [
                7124,
                7162
            ],
            [
                7162,
                7220
            ],
            [
                7220,
                7637
            ],
            [
                7637,
                7705
            ],
            [
                7705,
                7773
            ],
            [
                7773,
                7888
            ],
            [
                7888,
                8072
            ],
            [
                8072,
                8113
            ],
            [
                8113,
                8142
            ],
            [
                8142,
                8191
            ],
            [
                8191,
                8241
            ],
            [
                8241,
                8296
            ],
            [
                8296,
                8369
            ],
            [
                8369,
                8428
            ],
            [
                8428,
                8494
            ],
            [
                8494,
                8605
            ],
            [
                8605,
                8681
            ],
            [
                8681,
                8780
            ],
            [
                8780,
                8815
            ],
            [
                8815,
                8927
            ],
            [
                8927,
                9028
            ],
            [
                9028,
                9103
            ],
            [
                9103,
                9159
            ],
            [
                9159,
                9193
            ],
            [
                9193,
                9308
            ],
            [
                9308,
                9418
            ],
            [
                9418,
                9537
            ],
            [
                9537,
                9692
            ]
        ],
        "overlap_chars": [
            [
                0,
                84
            ],
            [
                85,
                91
            ],
            [
                99,
                103
            ],
            [
                104,
                105
            ],
            [
                115,
                116
            ],
            [
                117,
                123
            ],
            [
                123,
                124
            ],
            [
                133,
                134
            ],
            [
                135,
                138
            ],
            [
                139,
                146
            ],
            [
                146,
                152
            ],
            [
                160,
                176
            ],
            [
                177,
                205
            ],
            [
                205,
                225
            ],
            [
                226,
                229
            ],
            [
                247,
                251
            ],
            [
                252,
                253
            ],
            [
                260,
                278
            ],
            [
                279,
                292
            ],
            [
                293,
                300
            ],
            [
                305,
                307
            ],
            [
                313,
                315
            ],
            [
                316,
                317
            ],
            [
                326,
                328
            ],
            [
                328,
                363
            ],
            [
                363,
                364
            ],
            [
                365,
                368
            ],
            [
                369,
                372
            ],
            [
                373,
                396
            ],
            [
                397,
                429
            ],
            [
                430,
                433
            ],
            [
                434,
                460
            ],
            [
                461,
                463
            ],
            [
                477,
                484
            ],
            [
                485,
                542
            ],
            [
                542,
                543
            ],
            [
                544,
                547
            ],
            [
                551,
                575
            ],
            [
                585,
                588
            ],
            [
                593,
                598
            ],
            [
                604,
                628
            ],
            [
                629,
                662
            ],
            [
                678,
                680
            ],
            [
                680,
                690
            ],
            [
                696,
                705
            ],
            [
                706,
                718
            ],
            [
                719,
                724
            ],
            [
                725,
                746
            ],
            [
                747,
                755
            ],
            [
                760,
                805
            ],
            [
                806,
                808
            ],
            [
                823,
                824
            ],
            [
                825,
                828
            ],
            [
                829,
                839
            ],
            [
                851,
                855
            ],
            [
                856,
                869
            ],
            [
                870,
                933
            ],
            [
                939,
                941
            ],
            [
                941,
                987
            ],
            [
                987,
                1027
            ],
            [
                1028,
                1035
            ],
            [
                1036,
                1048
            ],
            [
                1048,
                1082
            ],
            [
                1083,
                1087
            ],
            [
                1088,
                1100
            ],
            [
                1101,
                1105
            ],
            [
                1113,
                1114
            ],
            [
                1115,
                1151
            ],
            [
                1151,
                1184
            ],
            [
                1184,
                1201
            ],
            [
                1202,
                1212
            ],
            [
                1232,
                1244
            ],
            [
                1252,
                1267
            ],
            [
                1267,
                1277
            ],
            [
                1278,
                1349
            ],
            [
                1349,
                1421
            ],
            [
                1421,
                1424
            ],
            [
                1424,
                1439
            ],
            [
                1440,
                1472
            ],
            [
                1472,
                1473
            ],
            [
                1473,
                1474
            ],
            [
                1480,
                1482
            ],
            [
                1482,
                1484
            ],
            [
                1484,
                1573
            ],
            [
                1573,
                1594
            ],
            [
                1597,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1696
            ],
            [
                1698,
                1711
            ],
            [
                1712,
                1794
            ],
            [
                1794,
                1807
            ],
            [
                1807,
                1832
            ],
            [
                1832,
                1835
            ],
            [
                1836,
                1846
            ],
            [
                1847,
                1850
            ],
            [
                1859,
                1863
            ],
            [
                1878,
                1914
            ],
            [
                1915,
                1948
            ],
            [
                1948,
                1956
            ],
            [
                1957,
                1963
            ],
            [
                1964,
                1971
            ],
            [
                1986,
                1988
            ],
            [
                1988,
                2021
            ],
            [
                2023,
                2034
            ],
            [
                2034,
                2107
            ],
            [
                2109,
                2115
            ],
            [
                2120,
                2165
            ],
            [
                2166,
                2194
            ],
            [
                2199,
                2203
            ],
            [
                2204,
                2207
            ],
            [
                2212,
                2222
            ],
            [
                2222,
                2224
            ],
            [
                2231,
                2245
            ],
            [
                2248,
                2279
            ],
            [
                2285,
                2318
            ],
            [
                2318,
                2352
            ],
            [
                2353,
                2370
            ],
            [
                2383,
                2417
            ],
            [
                2418,
                2433
            ],
            [
                2434,
                2457
            ],
            [
                2458,
                2461
            ],
            [
                2462,
                2508
            ],
            [
                2508,
                2509
            ],
            [
                2510,
                2623
            ],
            [
                2629,
                2721
            ],
            [
                2722,
                2826
            ],
            [
                2826,
                2842
            ],
            [
                2843,
                2871
            ],
            [
                2891,
                2907
            ],
            [
                2916,
                2933
            ],
            [
                2933,
                2934
            ],
            [
                2935,
                2980
            ],
            [
                2987,
                2995
            ],
            [
                3003,
                3118
            ],
            [
                3119,
                3168
            ],
            [
                3174,
                3181
            ],
            [
                3182,
                3195
            ],
            [
                3205,
                3211
            ],
            [
                3211,
                3268
            ],
            [
                3269,
                3326
            ],
            [
                3326,
                3343
            ],
            [
                3344,
                3421
            ],
            [
                3421,
                3448
            ],
            [
                3458,
                3460
            ],
            [
                3461,
                3480
            ],
            [
                3480,
                3481
            ],
            [
                3491,
                3494
            ],
            [
                3503,
                3509
            ],
            [
                3510,
                3533
            ],
            [
                3533,
                3535
            ],
            [
                3535,
                3583
            ],
            [
                3584,
                3612
            ],
            [
                3619,
                3625
            ],
            [
                3643,
                3645
            ],
            [
                3646,
                3687
            ],
            [
                3687,
                3739
            ],
            [
                3739,
                3765
            ],
            [
                3771,
                3803
            ],
            [
                3804,
                3835
            ],
            [
                3835,
                3894
            ],
            [
                3894,
                3962
            ],
            [
                3962,
                4041
            ],
            [
                4041,
                4043
            ],
            [
                4043,
                4061
            ],
            [
                4061,
                4063
            ],
            [
                4063,
                4147
            ],
            [
                4148,
                4160
            ],
            [
                4165,
                4178
            ],
            [
                4189,
                4194
            ],
            [
                4196,
                4199
            ],
            [
                4200,
                4207
            ],
            [
                4208,
                4228
            ],
            [
                4228,
                4251
            ],
            [
                4252,
                4288
            ],
            [
                4299,
                4304
            ],
            [
                4304,
                4305
            ],
            [
                4308,
                4311
            ],
            [
                4312,
                4356
            ],
            [
                4357,
                4388
            ],
            [
                4388,
                4406
            ],
            [
                4407,
                4410
            ],
            [
                4411,
                4419
            ],
            [
                4419,
                4421
            ],
            [
                4421,
                4478
            ],
            [
                4478,
                4480
            ],
            [
                4480,
                4582
            ],
            [
                4583,
                4599
            ],
            [
                4599,
                4620
            ],
            [
                4624,
                4659
            ],
            [
                4659,
                4737
            ],
            [
                4738,
                4832
            ],
            [
                4833,
                4906
            ],
            [
                4907,
                4924
            ],
            [
                4924,
                4926
            ],
            [
                4926,
                4973
            ],
            [
                4973,
                4980
            ],
            [
                4981,
                5063
            ],
            [
                5064,
                5081
            ],
            [
                5082,
                5119
            ],
            [
                5119,
                5151
            ],
            [
                5152,
                5198
            ],
            [
                5199,
                5211
            ],
            [
                5214,
                5222
            ],
            [
                5223,
                5227
            ],
            [
                5227,
                5263
            ],
            [
                5264,
                5304
            ],
            [
                5304,
                5330
            ],
            [
                5330,
                5332
            ],
            [
                5332,
                5339
            ],
            [
                5340,
                5400
            ],
            [
                5400,
                5439
            ],
            [
                5439,
                5452
            ],
            [
                5456,
                5472
            ],
            [
                5472,
                5482
            ],
            [
                5482,
                5529
            ],
            [
                5529,
                5632
            ],
            [
                5632,
                5643
            ],
            [
                5646,
                5652
            ],
            [
                5652,
                5696
            ],
            [
                5696,
                5717
            ],
            [
                5717,
                5781
            ],
            [
                5781,
                5791
            ],
            [
                5792,
                5799
            ],
            [
                5800,
                5884
            ],
            [
                5885,
                5914
            ],
            [
                5914,
                5937
            ],
            [
                5937,
                5986
            ],
            [
                5986,
                6031
            ],
            [
                6031,
                6034
            ],
            [
                6037,
                6061
            ],
            [
                6061,
                6105
            ],
            [
                6113,
                6118
            ],
            [
                6118,
                6208
            ],
            [
                6208,
                6273
            ],
            [
                6273,
                6324
            ],
            [
                6324,
                6346
            ],
            [
                6347,
                6359
            ],
            [
                6359,
                6393
            ],
            [
                6393,
                6447
            ],
            [
                6447,
                6453
            ],
            [
                6454,
                6470
            ],
            [
                6473,
                6540
            ],
            [
                6541,
                6557
            ],
            [
                6558,
                6583
            ],
            [
                6597,
                6598
            ],
            [
                6603,
                6604
            ],
            [
                6605,
                6620
            ],
            [
                6628,
                6631
            ],
            [
                6631,
                6644
            ],
            [
                6645,
                6647
            ],
            [
                6656,
                6659
            ],
            [
                6660,
                6666
            ],
            [
                6669,
                6683
            ],
            [
                6684,
                6732
            ],
            [
                6736,
                6745
            ],
            [
                6746,
                6750
            ],
            [
                6751,
                6760
            ],
            [
                6765,
                6767
            ],
            [
                6768,
                6775
            ],
            [
                6775,
                6777
            ],
            [
                6780,
                6799
            ],
            [
                6799,
                6881
            ],
            [
                6882,
                6927
            ],
            [
                6931,
                6973
            ],
            [
                6974,
                7070
            ],
            [
                7070,
                7122
            ],
            [
                7122,
                7123
            ],
            [
                7124,
                7159
            ],
            [
                7162,
                7220
            ],
            [
                7220,
                7280
            ],
            [
                7290,
                7413
            ],
            [
                7413,
                7455
            ],
            [
                7455,
                7571
            ],
            [
                7574,
                7637
            ],
            [
                7637,
                7705
            ],
            [
                7705,
                7771
            ],
            [
                7771,
                7772
            ],
            [
                7773,
                7803
            ],
            [
                7804,
                7819
            ],
            [
                7820,
                7824
            ],
            [
                7825,
                7888
            ],
            [
                7888,
                7891
            ],
            [
                7892,
                7897
            ],
            [
                7902,
                7918
            ],
            [
                7919,
                7984
            ],
            [
                7990,
                7996
            ],
            [
                7997,
                8014
            ],
            [
                8017,
                8071
            ],
            [
                8072,
                8100
            ],
            [
                8100,
                8112
            ],
            [
                8113,
                8117
            ],
            [
                8118,
                8142
            ],
            [
                8142,
                8161
            ],
            [
                8162,
                8191
            ],
            [
                8191,
                8198
            ],
            [
                8199,
                8241
            ],
            [
                8241,
                8257
            ],
            [
                8258,
                8296
            ],
            [
                8296,
                8330
            ],
            [
                8331,
                8363
            ],
            [
                8364,
                8369
            ],
            [
                8369,
                8428
            ],
            [
                8428,
                8470
            ],
            [
                8470,
                8471
            ],
            [
                8472,
                8483
            ],
            [
                8483,
                8484
            ],
            [
                8485,
                8492
            ],
            [
                8492,
                8494
            ],
            [
                8494,
                8605
            ],
            [
                8605,
                8681
            ],
            [
                8681,
                8684
            ],
            [
                8685,
                8691
            ],
            [
                8692,
                8695
            ],
            [
                8696,
                8722
            ],
            [
                8725,
                8730
            ],
            [
                8736,
                8739
            ],
            [
                8747,
                8760
            ],
            [
                8761,
                8780
            ],
            [
                8780,
                8791
            ],
            [
                8792,
                8795
            ],
            [
                8796,
                8815
            ],
            [
                8815,
                8860
            ],
            [
                8861,
                8927
            ],
            [
                8927,
                9028
            ],
            [
                9028,
                9049
            ],
            [
                9050,
                9070
            ],
            [
                9081,
                9082
            ],
            [
                9092,
                9103
            ],
            [
                9103,
                9159
            ],
            [
                9159,
                9193
            ],
            [
                9193,
                9201
            ],
            [
                9201,
                9225
            ],
            [
                9226,
                9306
            ],
            [
                9306,
                9308
            ],
            [
                9308,
                9378
            ],
            [
                9379,
                9418
            ],
            [
                9418,
                9449
            ],
            [
                9449,
                9479
            ],
            [
                9480,
                9486
            ],
            [
                9487,
                9523
            ],
            [
                9524,
                9525
            ],
            [
                9527,
                9535
            ],
            [
                9535,
                9537
            ],
            [
                9537,
                9692
            ]
        ],
        "row_chars": [
            [
                0,
                146
            ],
            [
                146,
                146
            ],
            [
                146,
                146
            ],
            [
                146,
                205
            ],
            [
                205,
                328
            ],
            [
                328,
                680
            ],
            [
                680,
                941
            ],
            [
                941,
                987
            ],
            [
                987,
                1048
            ],
            [
                1048,
                1115
            ],
            [
                1115,
                1151
            ],
            [
                1151,
                1184
            ],
            [
                1184,
                1267
            ],
            [
                1267,
                1349
            ],
            [
                1349,
                1349
            ],
            [
                1349,
                1424
            ],
            [
                1424,
                1472
            ],
            [
                1472,
                1484
            ],
            [
                1484,
                1573
            ],
            [
                1573,
                1597
            ],
            [
                1597,
                1597
            ],
            [
                1597,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1638
            ],
            [
                1638,
                1698
            ],
            [
                1698,
                1698
            ],
            [
                1698,
                1698
            ],
            [
                1698,
                1794
            ],
            [
                1794,
                1807
            ],
            [
                1807,
                1832
            ],
            [
                1832,
                1832
            ],
            [
                1832,
                1915
            ],
            [
                1915,
                1988
            ],
            [
                1988,
                2034
            ],
            [
                2034,
                2109
            ],
            [
                2109,
                2109
            ],
            [
                2109,
                2109
            ],
            [
                2109,
                2109
            ],
            [
                2109,
                2109
            ],
            [
                2109,
                2225
            ],
            [
                2225,
                2245
            ],
            [
                2245,
                2245
            ],
            [
                2245,
                2318
            ],
            [
                2318,
                2434
            ],
            [
                2434,
                2510
            ],
            [
                2510,
                2510
            ],
            [
                2510,
                2722
            ],
            [
                2722,
                2826
            ],
            [
                2826,
                2935
            ],
            [
                2935,
                2980
            ],
            [
                2980,
                2980
            ],
            [
                2980,
                3119
            ],
            [
                3119,
                3269
            ],
            [
                3269,
                3326
            ],
            [
                3326,
                3421
            ],
            [
                3421,
                3535
            ],
            [
                3535,
                3535
            ],
            [
                3535,
                3535
            ],
            [
                3535,
                3584
            ],
            [
                3584,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3645
            ],
            [
                3645,
                3687
            ],
            [
                3687,
                3739
            ],
            [
                3739,
                3835
            ],
            [
                3835,
                3894
            ],
            [
                3894,
                3962
            ],
            [
                3962,
                4043
            ],
            [
                4043,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4196
            ],
            [
                4196,
                4228
            ],
            [
                4228,
                4228
            ],
            [
                4228,
                4228
            ],
            [
                4228,
                4228
            ],
            [
                4228,
                4357
            ],
            [
                4357,
                4357
            ],
            [
                4357,
                4357
            ],
            [
                4357,
                4421
            ],
            [
                4421,
                4480
            ],
            [
                4480,
                4599
            ],
            [
                4599,
                4659
            ],
            [
                4659,
                4659
            ],
            [
                4659,
                4907
            ],
            [
                4907,
                4926
            ],
            [
                4926,
                4973
            ],
            [
                4973,
                5119
            ],
            [
                5119,
                5199
            ],
            [
                5199,
                5264
            ],
            [
                5264,
                5304
            ],
            [
                5304,
                5332
            ],
            [
                5332,
                5400
            ],
            [
                5400,
                5439
            ],
            [
                5439,
                5439
            ],
            [
                5439,
                5439
            ],
            [
                5439,
                5472
            ],
            [
                5472,
                5482
            ],
            [
                5482,
                5529
            ],
            [
                5529,
                5632
            ],
            [
                5632,
                5652
            ],
            [
                5652,
                5696
            ],
            [
                5696,
                5717
            ],
            [
                5717,
                5781
            ],
            [
                5781,
                5914
            ],
            [
                5914,
                5937
            ],
            [
                5937,
                5986
            ],
            [
                5986,
                6031
            ],
            [
                6031,
                6061
            ],
            [
                6061,
                6061
            ],
            [
                6061,
                6118
            ],
            [
                6118,
                6208
            ],
            [
                6208,
                6273
            ],
            [
                6273,
                6324
            ],
            [
                6324,
                6393
            ],
            [
                6393,
                6447
            ],
            [
                6447,
                6631
            ],
            [
                6631,
                6732
            ],
            [
                6732,
                6777
            ],
            [
                6777,
                6777
            ],
            [
                6777,
                6777
            ],
            [
                6777,
                6799
            ],
            [
                6799,
                6974
            ],
            [
                6974,
                7070
            ],
            [
                7070,
                7124
            ],
            [
                7124,
                7162
            ],
            [
                7162,
                7162
            ],
            [
                7162,
                7162
            ],
            [
                7162,
                7162
            ],
            [
                7162,
                7220
            ],
            [
                7220,
                7637
            ],
            [
                7637,
                7705
            ],
            [
                7705,
                7773
            ],
            [
                7773,
                7888
            ],
            [
                7888,
                7888
            ],
            [
                7888,
                8072
            ],
            [
                8072,
                8072
            ],
            [
                8072,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8142
            ],
            [
                8142,
                8191
            ],
            [
                8191,
                8241
            ],
            [
                8241,
                8296
            ],
            [
                8296,
                8369
            ],
            [
                8369,
                8428
            ],
            [
                8428,
                8494
            ],
            [
                8494,
                8605
            ],
            [
                8605,
                8681
            ],
            [
                8681,
                8681
            ],
            [
                8681,
                8681
            ],
            [
                8681,
                8780
            ],
            [
                8780,
                8815
            ],
            [
                8815,
                8815
            ],
            [
                8815,
                8927
            ],
            [
                8927,
                9028
            ],
            [
                9028,
                9103
            ],
            [
                9103,
                9159
            ],
            [
                9159,
                9159
            ],
            [
                9159,
                9193
            ],
            [
                9193,
                9308
            ],
            [
                9308,
                9418
            ],
            [
                9418,
                9537
            ],
            [
                9537,
                9692
            ]
        ]
    }
}