{
    "original": {
        "text": "London. Michaelmas term lately over, and the Lord Chancellor sitting in Lincoln's Inn Hall. Implacable November weather. As much mud in the streets as if the waters had but newly retired from the face of the earth, and it would not be wonderful to meet a Megalosaurus, forty feet long or so, waddling like an elephantine lizard up Holborn Hill. Smoke lowering down from chimney-pots, making a soft black drizzle, with flakes of soot in it as big as full-grown snowflakes--gone into mourning, one might imagine, for the death of the sun. Dogs, undistinguishable in mire. Horses, scarcely better; splashed to their very blinkers. Foot passengers, jostling one another's umbrellas in a general infection of ill temper, and losing their foot-hold at street-corners, where tens of thousands of other foot passengers have been slipping and sliding since the day broke (if this day ever broke), adding new deposits to the crust upon crust of mud, sticking at those points tenaciously to the pavement, and accumulating at compound interest.\nFog everywhere. Fog up the river, where it flows among green aits and meadows; fog down the river, where it rolls defiled among the tiers of shipping and the waterside pollutions of a great (and dirty) city. Fog on the Essex marshes, fog on the Kentish heights. Fog creeping into the cabooses of collier-brigs; fog lying out on the yards and hovering in the rigging of great ships; fog drooping on the gunwales of barges and small boats. Fog in the eyes and throats of ancient Greenwich pensioners, wheezing by the firesides of their wards; fog in the stem and bowl of the afternoon pipe of the wrathful skipper, down in his close cabin; fog cruelly pinching the toes and fingers of his shivering little 'prentice boy on deck. Chance people on the bridges peeping over the parapets into a nether sky of fog, with fog all round them, as if they were up in a balloon and hanging in the misty clouds.\nGas looming through the fog in divers places in the streets, much as the sun may, from the spongey fields, be seen to loom by husbandman and ploughboy. Most of the shops lighted two hours before their time--as the gas seems to know, for it has a haggard and unwilling look.\nThe raw afternoon is rawest, and the dense fog is densest, and the muddy streets are muddiest near that leaden-headed old obstruction, appropriate ornament for the threshold of a leaden-headed old corporation, Temple Bar. And hard by Temple Bar, in Lincoln's Inn Hall, at the very heart of the fog, sits the Lord High Chancellor in his High Court of Chancery.\nNever can there come fog too thick, never can there come mud and mire too deep, to assort with the groping and floundering condition which this High Court of Chancery, most pestilent of hoary sinners, holds this day in the sight of heaven and earth.\nOn such an afternoon, if ever, the Lord High Chancellor ought to be sitting here--as here he is--with a foggy glory round his head, softly fenced in with crimson cloth and curtains, addressed by a large advocate with great whiskers, a little voice, and an interminable brief, and outwardly directing his contemplation to the lantern in the roof, where he can see nothing but fog. On such an afternoon some score of members of the High Court of Chancery bar ought to be--as here they are--mistily engaged in one of the ten thousand stages of an endless cause, tripping one another up on slippery precedents, groping knee-deep in technicalities, running their goat-hair and horsehair warded heads against walls of words and making a pretence of equity with serious faces, as players might. On such an afternoon the various solicitors in the cause, some two or three of whom have inherited it from their fathers, who made a fortune by it, ought to be--as are they not?--ranged in a line, in a long matted well (but you might look in vain for truth at the bottom of it) between the registrar's red table and the silk gowns, with bills, cross-bills, answers, rejoinders, injunctions, affidavits, issues, references to masters, masters' reports, mountains of costly nonsense, piled before them. Well may the court be dim, with wasting candles here and there; well may the fog hang heavy in it, as if it would never get out; well may the stained-glass windows lose their colour and admit no light of day into the place; well may the uninitiated from the streets, who peep in through the glass panes in the door, be deterred from entrance by its owlish aspect and by the drawl, languidly echoing to the roof from the padded dais where the Lord High Chancellor looks into the lantern that has no light in it and where the attendant wigs are all stuck in a fog-bank! This is the Court of Chancery, which has its decaying houses and its blighted lands in every shire, which has its worn-out lunatic in every madhouse and its dead in every churchyard, which has its ruined suitor with his slipshod heels and threadbare dress borrowing and begging through the round of every man's acquaintance, which gives to monied might the means abundantly of wearying out the right, which so exhausts finances, patience, courage, hope, so overthrows the brain and breaks the heart, that there is not an honourable man among its practitioners who would not give--who does not often give--the warning, \"Suffer any wrong that can be done you rather than come here!\"\nWho happen to be in the Lord Chancellor's court this murky afternoon besides the Lord Chancellor, the counsel in the cause, two or three counsel who are never in any cause, and the well of solicitors before mentioned? There is the registrar below the judge, in wig and gown; and there are two or three maces, or petty-bags, or privy purses, or whatever they may be, in legal court suits. These are all yawning, for no crumb of amusement ever falls from Jarndyce and Jarndyce (the cause in hand), which was squeezed dry years upon years ago. The short-hand writers, the reporters of the court, and the reporters of the newspapers invariably decamp with the rest of the regulars when Jarndyce and Jarndyce comes on. Their places are a blank. Standing on a seat at the side of the hall, the better to peer into the curtained sanctuary, is a little mad old woman in a squeezed bonnet who is always in court, from its sitting to its rising, and always expecting some incomprehensible judgment to be given in her favour. Some say she really is, or was, a party to a suit, but no one knows for certain because no one cares. She carries some small litter in a reticule which she calls her documents, principally consisting of paper matches and dry lavender. A sallow prisoner has come up, in custody, for the half-dozenth time to make a personal application \"to purge himself of his contempt,\" which, being a solitary surviving executor who has fallen into a state of conglomeration about accounts of which it is not pretended that he had ever any knowledge, he is not at all likely ever to do. In the meantime his prospects in life are ended. Another ruined suitor, who periodically appears from Shropshire and breaks out into efforts to address the Chancellor at the close of the day's business and who can by no means be made to understand that the Chancellor is legally ignorant of his existence after making it desolate for a quarter of a century, plants himself in a good place and keeps an eye on the judge, ready to call out \"My Lord!\" in a voice of sonorous complaint on the instant of his rising. A few lawyers' clerks and others who know this suitor by sight linger on the chance of his furnishing some fun and enlivening the dismal weather a little.\nJarndyce and Jarndyce drones on. This scarecrow of a suit has, in course of time, become so complicated that no man alive knows what it means. The parties to it understand it least, but it has been observed that no two Chancery lawyers can talk about it for five minutes without coming to a total disagreement as to all the premises. Innumerable children have been born into the cause; innumerable young people have married into it; innumerable old people have died out of it. Scores of persons have deliriously found themselves made parties in Jarndyce and Jarndyce without knowing how or why; whole families have inherited legendary hatreds with the suit. The little plaintiff or defendant who was promised a new rocking-horse when Jarndyce and Jarndyce should be settled has grown up, possessed himself of a real horse, and trotted away into the other world. Fair wards of court have faded into mothers and grandmothers; a long procession of Chancellors has come in and gone out; the legion of bills in the suit have been transformed into mere bills of mortality; there are not three Jarndyces left upon the earth perhaps since old Tom Jarndyce in despair blew his brains out at a coffee-house in Chancery Lane; but Jarndyce and Jarndyce still drags its dreary length before the court, perennially hopeless.\nJarndyce and Jarndyce has passed into a joke. That is the only good that has ever come of it. It has been death to many, but it is a joke in the profession. Every master in Chancery has had a reference out of it. Every Chancellor was \"in it,\" for somebody or other, when he was counsel at the bar. Good things have been said about it by blue-nosed, bulbous-shoed old benchers in select port-wine committee after dinner in hall. Articled clerks have been in the habit of fleshing their legal wit upon it. The last Lord Chancellor handled it neatly, when, correcting Mr. Blowers, the eminent silk gown who said that such a thing might happen when the sky rained potatoes, he observed, \"or when we get through Jarndyce and Jarndyce, Mr. Blowers\"--a pleasantry that particularly tickled the maces, bags, and purses.\nHow many people out of the suit Jarndyce and Jarndyce has stretched forth its unwholesome hand to spoil and corrupt would be a very wide question. From the master upon whose impaling files reams of dusty warrants in Jarndyce and Jarndyce have grimly writhed into many shapes, down to the copying-clerk in the Six Clerks' Office who has copied his tens of thousands of Chancery folio-pages under that eternal heading, no man's nature has been made better by it. In trickery, evasion, procrastination, spoliation, botheration, under false pretences of all sorts, there are influences that can never come to good. The very solicitors' boys who have kept the wretched suitors at bay, by protesting time out of mind that Mr. Chizzle, Mizzle, or otherwise was particularly engaged and had appointments until dinner, may have got an extra moral twist and shuffle into themselves out of Jarndyce and Jarndyce. The receiver in the cause has acquired a goodly sum of money by it but has acquired too a distrust of his own mother and a contempt for his own kind. Chizzle, Mizzle, and otherwise have lapsed into a habit of vaguely promising themselves that they will look into that outstanding little matter and see what can be done for Drizzle--who was not well used--when Jarndyce and Jarndyce shall be got out of the office. Shirking and sharking in all their many varieties have been sown broadcast by the ill-fated cause; and even those who have contemplated its history from the outermost circle of such evil have been insensibly tempted into a loose way of letting bad things alone to take their own bad course, and a loose belief that if the world go wrong it was in some off-hand manner never meant to go right.\nThus, in the midst of the mud and at the heart of the fog, sits the Lord High Chancellor in his High Court of Chancery.\n\"Mr. Tangle,\" says the Lord High Chancellor, latterly something restless under the eloquence of that learned gentleman.\n\"Mlud,\" says Mr. Tangle. Mr. Tangle knows more of Jarndyce and Jarndyce than anybody. He is famous for it--supposed never to have read anything else since he left school.\n\"Have you nearly concluded your argument?\"\n\"Mlud, no--variety of points--feel it my duty tsubmit--ludship,\" is the reply that slides out of Mr. Tangle.\n\"Several members of the bar are still to be heard, I believe?\" says the Chancellor with a slight smile.\nEighteen of Mr. Tangle's learned friends, each armed with a little summary of eighteen hundred sheets, bob up like eighteen hammers in a pianoforte, make eighteen bows, and drop into their eighteen places of obscurity.\n\"We will proceed with the hearing on Wednesday fortnight,\" says the Chancellor. For the question at issue is only a question of costs, a mere bud on the forest tree of the parent suit, and really will come to a settlement one of these days.\nThe Chancellor rises; the bar rises; the prisoner is brought forward in a hurry; the man from Shropshire cries, \"My lord!\" Maces, bags, and purses indignantly proclaim silence and frown at the man from Shropshire.\n\"In reference,\" proceeds the Chancellor, still on Jarndyce and Jarndyce, \"to the young girl--\"\n\"Begludship's pardon--boy,\" says Mr. Tangle prematurely. \"In reference,\" proceeds the Chancellor with extra distinctness, \"to the young girl and boy, the two young people\"--Mr. Tangle crushed--\"whom I directed to be in attendance to-day and who are now in my private room, I will see them and satisfy myself as to the expediency of making the order for their residing with their uncle.\"\nMr. Tangle on his legs again. \"Begludship's pardon--dead.\"\n\"With their\"--Chancellor looking through his double eye-glass at the papers on his desk--\"grandfather.\"\n\"Begludship's pardon--victim of rash action--brains.\"\nSuddenly a very little counsel with a terrific bass voice arises, fully inflated, in the back settlements of the fog, and says, \"Will your lordship allow me? I appear for him. He is a cousin, several times removed. I am not at the moment prepared to inform the court in what exact remove he is a cousin, but he IS a cousin.\"\nLeaving this address (delivered like a sepulchral message) ringing in the rafters of the roof, the very little counsel drops, and the fog knows him no more. Everybody looks for him. Nobody can see him.\n\"I will speak with both the young people,\" says the Chancellor anew, \"and satisfy myself on the subject of their residing with their cousin. I will mention the matter to-morrow morning when I take my seat.\"\nThe Chancellor is about to bow to the bar when the prisoner is presented. Nothing can possibly come of the prisoner's conglomeration but his being sent back to prison, which is soon done. The man from Shropshire ventures another remonstrative \"My lord!\" but the Chancellor, being aware of him, has dexterously vanished. Everybody else quickly vanishes too. A battery of blue bags is loaded with heavy charges of papers and carried off by clerks; the little mad old woman marches off with her documents; the empty court is locked up. If all the injustice it has committed and all the misery it has caused could only be locked up with it, and the whole burnt away in a great funeral pyre--why so much the better for other parties than the parties in Jarndyce and Jarndyce!",
        "paragraph_chars": [
            [
                0,
                1033
            ],
            [
                1033,
                1931
            ],
            [
                1931,
                2205
            ],
            [
                2205,
                2565
            ],
            [
                2565,
                2815
            ],
            [
                2815,
                5353
            ],
            [
                5353,
                7607
            ],
            [
                7607,
                8918
            ],
            [
                8918,
                9730
            ],
            [
                9730,
                11439
            ],
            [
                11439,
                11559
            ],
            [
                11559,
                11679
            ],
            [
                11679,
                11850
            ],
            [
                11850,
                11893
            ],
            [
                11893,
                12002
            ],
            [
                12002,
                12106
            ],
            [
                12106,
                12325
            ],
            [
                12325,
                12566
            ],
            [
                12566,
                12780
            ],
            [
                12780,
                12875
            ],
            [
                12875,
                13262
            ],
            [
                13262,
                13321
            ],
            [
                13321,
                13425
            ],
            [
                13425,
                13479
            ],
            [
                13479,
                13804
            ],
            [
                13804,
                14006
            ],
            [
                14006,
                14213
            ],
            [
                14213,
                14983
            ]
        ],
        "segment_chars": [
            [
                0,
                8
            ],
            [
                8,
                92
            ],
            [
                92,
                121
            ],
            [
                121,
                345
            ],
            [
                345,
                537
            ],
            [
                537,
                570
            ],
            [
                570,
                628
            ],
            [
                628,
                1033
            ],
            [
                1033,
                1049
            ],
            [
                1049,
                1241
            ],
            [
                1241,
                1295
            ],
            [
                1295,
                1471
            ],
            [
                1471,
                1760
            ],
            [
                1760,
                1931
            ],
            [
                1931,
                2083
            ],
            [
                2083,
                2205
            ],
            [
                2205,
                2427
            ],
            [
                2427,
                2565
            ],
            [
                2565,
                2815
            ],
            [
                2815,
                3195
            ],
            [
                3195,
                3603
            ],
            [
                3603,
                4104
            ],
            [
                4104,
                4672
            ],
            [
                4672,
                5353
            ],
            [
                5353,
                5571
            ],
            [
                5571,
                5741
            ],
            [
                5741,
                5894
            ],
            [
                5894,
                6067
            ],
            [
                6067,
                6093
            ],
            [
                6093,
                6368
            ],
            [
                6368,
                6470
            ],
            [
                6470,
                6603
            ],
            [
                6603,
                6940
            ],
            [
                6940,
                6989
            ],
            [
                6989,
                7389
            ],
            [
                7389,
                7452
            ],
            [
                7452,
                7607
            ],
            [
                7607,
                7640
            ],
            [
                7640,
                7750
            ],
            [
                7750,
                7941
            ],
            [
                7941,
                8084
            ],
            [
                8084,
                8265
            ],
            [
                8265,
                8469
            ],
            [
                8469,
                8918
            ],
            [
                8918,
                8964
            ],
            [
                8964,
                9012
            ],
            [
                9012,
                9075
            ],
            [
                9075,
                9131
            ],
            [
                9131,
                9216
            ],
            [
                9216,
                9346
            ],
            [
                9346,
                9422
            ],
            [
                9422,
                9730
            ],
            [
                9730,
                9877
            ],
            [
                9877,
                10191
            ],
            [
                10191,
                10341
            ],
            [
                10341,
                10632
            ],
            [
                10632,
                10782
            ],
            [
                10782,
                11046
            ],
            [
                11046,
                11439
            ],
            [
                11439,
                11559
            ],
            [
                11559,
                11679
            ],
            [
                11679,
                11704
            ],
            [
                11704,
                11765
            ],
            [
                11765,
                11850
            ],
            [
                11850,
                11893
            ],
            [
                11893,
                12002
            ],
            [
                12002,
                12065
            ],
            [
                12065,
                12106
            ],
            [
                12106,
                12325
            ],
            [
                12325,
                12405
            ],
            [
                12405,
                12566
            ],
            [
                12566,
                12689
            ],
            [
                12689,
                12780
            ],
            [
                12780,
                12875
            ],
            [
                12875,
                12932
            ],
            [
                12932,
                13262
            ],
            [
                13262,
                13292
            ],
            [
                13292,
                13321
            ],
            [
                13321,
                13425
            ],
            [
                13425,
                13479
            ],
            [
                13479,
                13637
            ],
            [
                13637,
                13655
            ],
            [
                13655,
                13694
            ],
            [
                13694,
                13804
            ],
            [
                13804,
                13961
            ],
            [
                13961,
                13986
            ],
            [
                13986,
                14006
            ],
            [
                14006,
                14147
            ],
            [
                14147,
                14213
            ],
            [
                14213,
                14287
            ],
            [
                14287,
                14401
            ],
            [
                14401,
                14467
            ],
            [
                14467,
                14533
            ],
            [
                14533,
                14570
            ],
            [
                14570,
                14746
            ],
            [
                14746,
                14983
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                35,
                40
            ],
            [
                92,
                121
            ],
            [
                121,
                168
            ],
            [
                179,
                234
            ],
            [
                245,
                345
            ],
            [
                345,
                470
            ],
            [
                535,
                537
            ],
            [
                537,
                570
            ],
            [
                570,
                576
            ],
            [
                595,
                628
            ],
            [
                643,
                653
            ],
            [
                789,
                794
            ],
            [
                678,
                719
            ],
            [
                821,
                841
            ],
            [
                743,
                760
            ],
            [
                1031,
                1033
            ],
            [
                1033,
                1049
            ],
            [
                1049,
                1093
            ],
            [
                1103,
                1241
            ],
            [
                1295,
                1307
            ],
            [
                1329,
                1347
            ],
            [
                1375,
                1434
            ],
            [
                1447,
                1453
            ],
            [
                1469,
                1471
            ],
            [
                1471,
                1530
            ],
            [
                1572,
                1584
            ],
            [
                1594,
                1657
            ],
            [
                1664,
                1736
            ],
            [
                1747,
                1760
            ],
            [
                1767,
                1776
            ],
            [
                1781,
                1796
            ],
            [
                1815,
                1821
            ],
            [
                1829,
                1839
            ],
            [
                1860,
                1931
            ],
            [
                1931,
                1934
            ],
            [
                1935,
                1961
            ],
            [
                1969,
                1990
            ],
            [
                2081,
                2083
            ],
            [
                2083,
                2100
            ],
            [
                2109,
                2118
            ],
            [
                2138,
                2205
            ],
            [
                2205,
                2316
            ],
            [
                2379,
                2381
            ],
            [
                2323,
                2338
            ],
            [
                2413,
                2427
            ],
            [
                2427,
                2430
            ],
            [
                2439,
                2565
            ],
            [
                2565,
                2644
            ],
            [
                2660,
                2697
            ],
            [
                2794,
                2796
            ],
            [
                2704,
                2764
            ],
            [
                2813,
                2815
            ],
            [
                2891,
                2895
            ],
            [
                2846,
                2870
            ],
            [
                2912,
                3017
            ],
            [
                3027,
                3046
            ],
            [
                3193,
                3195
            ],
            [
                3216,
                3220
            ],
            [
                3230,
                3271
            ],
            [
                3298,
                3301
            ],
            [
                3288,
                3292
            ],
            [
                3311,
                3458
            ],
            [
                3483,
                3486
            ],
            [
                3195,
                3197
            ],
            [
                3570,
                3587
            ],
            [
                3596,
                3603
            ],
            [
                3603,
                3659
            ],
            [
                3767,
                3770
            ],
            [
                3782,
                3798
            ],
            [
                3933,
                3980
            ],
            [
                3994,
                4013
            ],
            [
                4046,
                4083
            ],
            [
                4085,
                4104
            ],
            [
                4104,
                4129
            ],
            [
                4166,
                4201
            ],
            [
                4231,
                4298
            ],
            [
                4326,
                4340
            ],
            [
                4369,
                4390
            ],
            [
                4410,
                4445
            ],
            [
                4670,
                4671
            ],
            [
                4672,
                4712
            ],
            [
                4737,
                4860
            ],
            [
                5079,
                5203
            ],
            [
                5232,
                5250
            ],
            [
                5277,
                5291
            ],
            [
                5298,
                5307
            ],
            [
                5329,
                5353
            ],
            [
                5353,
                5356
            ],
            [
                5502,
                5505
            ],
            [
                5370,
                5421
            ],
            [
                5569,
                5571
            ],
            [
                5571,
                5654
            ],
            [
                5739,
                5741
            ],
            [
                5747,
                5894
            ],
            [
                5894,
                5916
            ],
            [
                5946,
                5949
            ],
            [
                5939,
                5944
            ],
            [
                5922,
                5931
            ],
            [
                5982,
                5992
            ],
            [
                6030,
                6067
            ],
            [
                6067,
                6083
            ],
            [
                6091,
                6092
            ],
            [
                6093,
                6135
            ],
            [
                6186,
                6211
            ],
            [
                6215,
                6232
            ],
            [
                6233,
                6255
            ],
            [
                6287,
                6368
            ],
            [
                6368,
                6390
            ],
            [
                6400,
                6469
            ],
            [
                6603,
                6671
            ],
            [
                6744,
                6745
            ],
            [
                6828,
                6902
            ],
            [
                6938,
                6940
            ],
            [
                6989,
                7056
            ],
            [
                7081,
                7141
            ],
            [
                7296,
                7389
            ],
            [
                7389,
                7451
            ],
            [
                7607,
                7640
            ],
            [
                7640,
                7659
            ],
            [
                7665,
                7750
            ],
            [
                7819,
                7916
            ],
            [
                7939,
                7941
            ],
            [
                7941,
                8004
            ],
            [
                8052,
                8084
            ],
            [
                8084,
                8265
            ],
            [
                8552,
                8563
            ],
            [
                8489,
                8493
            ],
            [
                8568,
                8572
            ],
            [
                8576,
                8584
            ],
            [
                8672,
                8723
            ],
            [
                8732,
                8895
            ],
            [
                8908,
                8918
            ],
            [
                8918,
                8943
            ],
            [
                8956,
                8964
            ],
            [
                8964,
                9012
            ],
            [
                9075,
                9103
            ],
            [
                9108,
                9119
            ],
            [
                9127,
                9129
            ],
            [
                9324,
                9336
            ],
            [
                9344,
                9346
            ],
            [
                9346,
                9366
            ],
            [
                9397,
                9422
            ],
            [
                9422,
                9446
            ],
            [
                9522,
                9531
            ],
            [
                9617,
                9646
            ],
            [
                9563,
                9570
            ],
            [
                9578,
                9586
            ],
            [
                9662,
                9704
            ],
            [
                9728,
                9730
            ],
            [
                9730,
                9745
            ],
            [
                9762,
                9877
            ],
            [
                9877,
                9892
            ],
            [
                10006,
                10031
            ],
            [
                10145,
                10153
            ],
            [
                10163,
                10171
            ],
            [
                10184,
                10191
            ],
            [
                10194,
                10229
            ],
            [
                10242,
                10254
            ],
            [
                10261,
                10289
            ],
            [
                10339,
                10341
            ],
            [
                11149,
                11159
            ],
            [
                11199,
                11242
            ],
            [
                11254,
                11266
            ],
            [
                11282,
                11300
            ],
            [
                11310,
                11373
            ],
            [
                11377,
                11439
            ],
            [
                11439,
                11559
            ],
            [
                11559,
                11602
            ],
            [
                11677,
                11679
            ],
            [
                11679,
                11704
            ],
            [
                11704,
                11765
            ],
            [
                11765,
                11784
            ],
            [
                11795,
                11850
            ],
            [
                11850,
                11893
            ],
            [
                11893,
                11902
            ],
            [
                11912,
                11921
            ],
            [
                11923,
                11946
            ],
            [
                11948,
                11955
            ],
            [
                12002,
                12065
            ],
            [
                12065,
                12106
            ],
            [
                12106,
                12146
            ],
            [
                12209,
                12254
            ],
            [
                12275,
                12278
            ],
            [
                12255,
                12273
            ],
            [
                12323,
                12325
            ],
            [
                12325,
                12405
            ],
            [
                12405,
                12496
            ],
            [
                12508,
                12566
            ],
            [
                12566,
                12601
            ],
            [
                12645,
                12689
            ],
            [
                12755,
                12758
            ],
            [
                12746,
                12754
            ],
            [
                12713,
                12724
            ],
            [
                12778,
                12780
            ],
            [
                12780,
                12871
            ],
            [
                12875,
                12895
            ],
            [
                12897,
                12918
            ],
            [
                12930,
                12931
            ],
            [
                12932,
                13046
            ],
            [
                13107,
                13108
            ],
            [
                13050,
                13066
            ],
            [
                13068,
                13075
            ],
            [
                13085,
                13087
            ],
            [
                13112,
                13167
            ],
            [
                13207,
                13262
            ],
            [
                13262,
                13292
            ],
            [
                13292,
                13312
            ],
            [
                13314,
                13321
            ],
            [
                13321,
                13333
            ],
            [
                13346,
                13365
            ],
            [
                13373,
                13385
            ],
            [
                13400,
                13403
            ],
            [
                13390,
                13396
            ],
            [
                13410,
                13425
            ],
            [
                13425,
                13445
            ],
            [
                13454,
                13468
            ],
            [
                13476,
                13479
            ],
            [
                13479,
                13501
            ],
            [
                13510,
                13543
            ],
            [
                13561,
                13563
            ],
            [
                13588,
                13608
            ],
            [
                13637,
                13655
            ],
            [
                13655,
                13662
            ],
            [
                13663,
                13669
            ],
            [
                13899,
                13928
            ],
            [
                13934,
                13941
            ],
            [
                13959,
                13961
            ],
            [
                13961,
                13986
            ],
            [
                13986,
                14006
            ],
            [
                14006,
                14068
            ],
            [
                14073,
                14076
            ],
            [
                14095,
                14147
            ],
            [
                14147,
                14172
            ],
            [
                14183,
                14213
            ],
            [
                14401,
                14441
            ],
            [
                14456,
                14467
            ],
            [
                14467,
                14485
            ],
            [
                14507,
                14510
            ],
            [
                14523,
                14533
            ],
            [
                14533,
                14570
            ],
            [
                14659,
                14746
            ],
            [
                14746,
                14898
            ],
            [
                14900,
                14903
            ],
            [
                14904,
                14922
            ],
            [
                14982,
                14983
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                345
            ],
            [
                345,
                537
            ],
            [
                537,
                570
            ],
            [
                570,
                628
            ],
            [
                628,
                1033
            ],
            [
                1033,
                1049
            ],
            [
                1049,
                1241
            ],
            [
                1241,
                1295
            ],
            [
                1295,
                1471
            ],
            [
                1471,
                1760
            ],
            [
                1760,
                1931
            ],
            [
                1931,
                2083
            ],
            [
                2083,
                2205
            ],
            [
                2205,
                2427
            ],
            [
                2427,
                2565
            ],
            [
                2565,
                2815
            ],
            [
                2815,
                3195
            ],
            [
                3195,
                3603
            ],
            [
                3603,
                4104
            ],
            [
                4104,
                4672
            ],
            [
                4672,
                5353
            ],
            [
                5353,
                5571
            ],
            [
                5571,
                5741
            ],
            [
                5741,
                5894
            ],
            [
                5894,
                6067
            ],
            [
                6067,
                6093
            ],
            [
                6093,
                6368
            ],
            [
                6368,
                6470
            ],
            [
                6470,
                6603
            ],
            [
                6603,
                6940
            ],
            [
                6940,
                6989
            ],
            [
                6989,
                7389
            ],
            [
                7389,
                7452
            ],
            [
                7452,
                7607
            ],
            [
                7607,
                7640
            ],
            [
                7640,
                7750
            ],
            [
                7750,
                7941
            ],
            [
                7941,
                8084
            ],
            [
                8084,
                8265
            ],
            [
                8265,
                8469
            ],
            [
                8469,
                8918
            ],
            [
                8918,
                8964
            ],
            [
                8964,
                9012
            ],
            [
                9012,
                9075
            ],
            [
                9075,
                9346
            ],
            [
                9346,
                9422
            ],
            [
                9422,
                9730
            ],
            [
                9730,
                9877
            ],
            [
                9877,
                10191
            ],
            [
                10191,
                10341
            ],
            [
                10341,
                10632
            ],
            [
                10632,
                10782
            ],
            [
                10782,
                11046
            ],
            [
                11046,
                11439
            ],
            [
                11439,
                11559
            ],
            [
                11559,
                11679
            ],
            [
                11679,
                11704
            ],
            [
                11704,
                11765
            ],
            [
                11765,
                11850
            ],
            [
                11850,
                11893
            ],
            [
                11893,
                12002
            ],
            [
                12002,
                12065
            ],
            [
                12065,
                12106
            ],
            [
                12106,
                12325
            ],
            [
                12325,
                12405
            ],
            [
                12405,
                12566
            ],
            [
                12566,
                12689
            ],
            [
                12689,
                12780
            ],
            [
                12780,
                12875
            ],
            [
                12875,
                12932
            ],
            [
                12932,
                13262
            ],
            [
                13262,
                13292
            ],
            [
                13292,
                13321
            ],
            [
                13321,
                13425
            ],
            [
                13425,
                13479
            ],
            [
                13479,
                13655
            ],
            [
                13655,
                13694
            ],
            [
                13694,
                13804
            ],
            [
                13804,
                13961
            ],
            [
                13961,
                13986
            ],
            [
                13986,
                14006
            ],
            [
                14006,
                14147
            ],
            [
                14147,
                14213
            ],
            [
                14213,
                14287
            ],
            [
                14287,
                14401
            ],
            [
                14401,
                14467
            ],
            [
                14467,
                14533
            ],
            [
                14533,
                14570
            ],
            [
                14570,
                14746
            ],
            [
                14746,
                14983
            ]
        ]
    },
    "abridged": {
        "text": "London, and implacable November weather. As much mud in the streets as if the waters had only just retired from the face of the earth, and it would not be extraordinary to meet a Megalosaurus, forty feet long or so, waddling like an elephantine lizard up Holborn Hill. Smoke lowering down from chimney-pots, making a soft black drizzle, with flakes of soot in it as big as full-grown snowflakes. Dogs, undistinguishable in mire. Horses splashed to their very blinkers. Pedestrians, jostling each other in a general infection of ill temper, and slipping and sliding at street-corners.\nFog everywhere. Fog up the river, where it flows among green meadows; fog down the river, where it rolls defiled among the tiers of shipping and the waterside pollutions of a great (and dirty) city. Fog creeping round collier-brigs; fog hovering in the rigging of great ships; fog drooping on the barges. Fog in the eyes and throats of ancient Greenwich pensioners; fog in the bowl of the afternoon pipe of the wrathful skipper, down in his cabin; fog cruelly pinching the toes and fingers of his shivering little apprentice boy on deck. People on bridges peeping into a sky of fog below them, as if they were up in a balloon and hanging in the misty clouds.\nGas-light looming through the fog in various places in the streets. Most of the shops lit up two hours early - as the gas seems to know, for it has a haggard and unwilling look.\nThe raw afternoon is rawest, and the dense fog is densest, and the muddy streets are muddiest near that leaden-roofed old obstruction, Temple Bar. And close to Temple Bar, in Lincoln's Inn Hall, at the very heart of the fog, sits the Lord High Chancellor in his High Court of Chancery.\nNever can there come fog too thick, never can there come mud and mire too deep, for the groping and floundering condition of this High Court of Chancery, most pestilent of hoary sinners.\nHere sits the Lord High Chancellor with a foggy glory round his head, softly fenced in with crimson cloth and curtains, addressed by a large lawyer with great whiskers. Some twenty members of the High Court of Chancery bar are here, engaged in one of the ten thousand stages of an endless cause, tripping one another up on slippery precedents, groping knee-deep in technicalities, and putting on serious faces, as actors might. On such an afternoon the various solicitors in the cause are ranged in a line, with bills, cross-bills, answers, rejoinders, affidavits, issues, reports, mountains of costly nonsense piled before them. Well may the court be dim; well may the fog hang heavy in it; well may the stained-glass windows lose their colour and admit no daylight; well may the public, who peep in through the door, be deterred from entrance!\nThis is the Court of Chancery, which has its blighted lands in every shire, which has its worn-out lunatic in every madhouse and its dead in every churchyard, which so exhausts finances, patience, courage, hope, so overthrows the brain and breaks the heart, that there is not an honourable lawyer who would not give the warning, \"Endure any wrong rather than come here!\"\nWho else are in the Lord Chancellor's court this murky afternoon? There is the registrar below the judge, in wig and gown; and there are two or three juniors. They are all yawning, for no crumb of amusement ever falls from Jarndyce and Jarndyce (the cause in hand), which was squeezed dry years upon years ago. The short-hand writers and court reporters invariably leave when Jarndyce and Jarndyce comes on. Their places are empty.\nStanding on a seat at the side of the hall is a little mad old woman with a squeezed bonnet and a bag of documents who is always in court, and always expecting some incomprehensible judgment to be given in her favour. Some say she really is a party to a suit, but no one knows for certain because no one cares.\nA sallow prisoner has come up, in custody, for the half-dozenth time, in confusion about accounts of which it is not pretended that he had ever any knowledge. Another ruined suitor, who periodically appears from Shropshire and tries vainly to address the Chancellor at the close of the day's business, plants himself in a good place and keeps an eye on the judge, ready to call out \"My Lord!\" in a voice of sonorous complaint on the instant of his rising.\nJarndyce and Jarndyce drones on. This scarecrow of a lawsuit has, in course of time, become so complicated that no man alive knows what it means. No two Chancery lawyers can talk about it for five minutes without coming to a total disagreement. Innumerable children have been born into the cause; innumerable old people have died out of it. Scores of persons have deliriously found themselves made parties in Jarndyce and Jarndyce without knowing how or why; whole families have inherited legendary hatreds with the suit. Chancellors have come and gone; there are not three Jarndyces left upon the earth since old Tom Jarndyce in despair blew his brains out at a coffee-house in Chancery Lane; but Jarndyce and Jarndyce still drags its dreary length before the court, forever hopeless.\nJarndyce and Jarndyce has become a joke. That is the only good that has ever come of it. Every master in Chancery has made a reference to it after dinner. Articled clerks have practised their legal wit upon it. The last Lord Chancellor said that getting through Jarndyce and Jarndyce was as likely as the sky raining potatoes - a pleasantry that particularly tickled the juniors in court.\nHow many people Jarndyce and Jarndyce has stretched forth its unwholesome hand to spoil and corrupt would be a very wide question. From the master down to the copying-clerk, no man has been improved by it. It brings trickery, evasion, procrastination, botheration, and false pretences of all sorts. Even those on the outermost circle of such evil have been tempted into letting bad things take their own bad course, and a loose belief that if the world goes wrong it was in some off-hand manner never meant to go right.\nThus, in the midst of the mud and at the heart of the fog, sits the Lord High Chancellor in his High Court of Chancery.\n\"Mr. Tangle,\" says the Lord High Chancellor.\n\"Mlud,\" says Mr. Tangle. Mr. Tangle knows more of Jarndyce and Jarndyce than anybody. He is famous for it - supposed never to have read anything else since he left school.\n\"Have you nearly concluded your argument?\"\n\"Mlud, no - variety of points - feel it my duty tsubmit - ludship.\"\n\"Several members of the bar are still to be heard, I believe?\" says the Chancellor with a slight smile.\nEighteen of Mr. Tangle's learned friends bob up like eighteen hammers in a pianoforte, and make eighteen bows.\n\"We will proceed with the hearing on Wednesday fortnight,\" says the Chancellor. For the question at issue is only a question of costs, a mere bud on the forest tree of the lawsuit, and really will come to a settlement one of these days.\nThe Chancellor rises; the bar rises; the man from Shropshire cries, \"My lord!\" The junior lawyers frown at him indignantly.\n\"In reference,\" proceeds the Chancellor, still on Jarndyce and Jarndyce, \"to the young girl-\"\n\"Begludship's pardon - boy,\" says Mr. Tangle.\n\"In reference,\" proceeds the Chancellor with extra distinctness, \"to the young girl and boy, the two young people\" - Mr. Tangle crushed - \"whom I told to come today and who are now in my private room, I will see them and consider making the order for their residing with their uncle.\"\nMr. Tangle on his legs again. \"Begludship's pardon - dead.\"\n\"With their\" - Chancellor looking through his eye-glass at his papers - \"grandfather.\"\n\"Begludship's pardon - victim of rash action - brains.\"\nSuddenly a very little lawyer with a terrific bass voice arises in the fog, and says, \"I appear for him. He is a distant cousin.\"\nThe very little counsel drops back into the fog. Everybody looks for him. Nobody can see him.\n\"I will speak with both the young people,\" says the Chancellor, \"on the subject of their residing with their cousin. I will mention the matter tomorrow morning when I take my seat.\"\nThe man from Shropshire ventures another \"My lord!\" but the Chancellor has vanished. Everybody else quickly vanishes too. The little mad old woman marches off with her documents; the empty court is locked up. If all the injustice it has committed and all the misery it has caused could only be locked up with it, and the whole burnt away in a great funeral pyre - why, so much the better it would be!",
        "paragraph_chars": [
            [
                0,
                584
            ],
            [
                584,
                1243
            ],
            [
                1243,
                1421
            ],
            [
                1421,
                1707
            ],
            [
                1707,
                1894
            ],
            [
                1894,
                2740
            ],
            [
                2740,
                3111
            ],
            [
                3111,
                3543
            ],
            [
                3543,
                3854
            ],
            [
                3854,
                4310
            ],
            [
                4310,
                5096
            ],
            [
                5096,
                5485
            ],
            [
                5485,
                6005
            ],
            [
                6005,
                6125
            ],
            [
                6125,
                6170
            ],
            [
                6170,
                6342
            ],
            [
                6342,
                6385
            ],
            [
                6385,
                6453
            ],
            [
                6453,
                6557
            ],
            [
                6557,
                6668
            ],
            [
                6668,
                6905
            ],
            [
                6905,
                7029
            ],
            [
                7029,
                7123
            ],
            [
                7123,
                7169
            ],
            [
                7169,
                7454
            ],
            [
                7454,
                7514
            ],
            [
                7514,
                7601
            ],
            [
                7601,
                7657
            ],
            [
                7657,
                7787
            ],
            [
                7787,
                7881
            ],
            [
                7881,
                8063
            ],
            [
                8063,
                8463
            ]
        ],
        "segment_chars": [
            [
                0,
                41
            ],
            [
                41,
                269
            ],
            [
                269,
                396
            ],
            [
                396,
                429
            ],
            [
                429,
                469
            ],
            [
                469,
                584
            ],
            [
                584,
                600
            ],
            [
                600,
                783
            ],
            [
                783,
                889
            ],
            [
                889,
                1122
            ],
            [
                1122,
                1243
            ],
            [
                1243,
                1311
            ],
            [
                1311,
                1421
            ],
            [
                1421,
                1568
            ],
            [
                1568,
                1707
            ],
            [
                1707,
                1894
            ],
            [
                1894,
                2063
            ],
            [
                2063,
                2322
            ],
            [
                2322,
                2524
            ],
            [
                2524,
                2740
            ],
            [
                2740,
                3111
            ],
            [
                3111,
                3177
            ],
            [
                3177,
                3270
            ],
            [
                3270,
                3422
            ],
            [
                3422,
                3519
            ],
            [
                3519,
                3543
            ],
            [
                3543,
                3761
            ],
            [
                3761,
                3854
            ],
            [
                3854,
                4013
            ],
            [
                4013,
                4247
            ],
            [
                4247,
                4310
            ],
            [
                4310,
                4343
            ],
            [
                4343,
                4456
            ],
            [
                4456,
                4555
            ],
            [
                4555,
                4651
            ],
            [
                4651,
                4832
            ],
            [
                4832,
                5096
            ],
            [
                5096,
                5137
            ],
            [
                5137,
                5185
            ],
            [
                5185,
                5251
            ],
            [
                5251,
                5307
            ],
            [
                5307,
                5485
            ],
            [
                5485,
                5616
            ],
            [
                5616,
                5691
            ],
            [
                5691,
                5784
            ],
            [
                5784,
                6005
            ],
            [
                6005,
                6125
            ],
            [
                6125,
                6170
            ],
            [
                6170,
                6195
            ],
            [
                6195,
                6256
            ],
            [
                6256,
                6342
            ],
            [
                6342,
                6385
            ],
            [
                6385,
                6453
            ],
            [
                6453,
                6516
            ],
            [
                6516,
                6557
            ],
            [
                6557,
                6668
            ],
            [
                6668,
                6748
            ],
            [
                6748,
                6905
            ],
            [
                6905,
                6984
            ],
            [
                6984,
                7029
            ],
            [
                7029,
                7123
            ],
            [
                7123,
                7169
            ],
            [
                7169,
                7454
            ],
            [
                7454,
                7484
            ],
            [
                7484,
                7514
            ],
            [
                7514,
                7601
            ],
            [
                7601,
                7657
            ],
            [
                7657,
                7762
            ],
            [
                7762,
                7787
            ],
            [
                7787,
                7836
            ],
            [
                7836,
                7861
            ],
            [
                7861,
                7881
            ],
            [
                7881,
                7998
            ],
            [
                7998,
                8063
            ],
            [
                8063,
                8115
            ],
            [
                8115,
                8148
            ],
            [
                8148,
                8185
            ],
            [
                8185,
                8272
            ],
            [
                8272,
                8463
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                6,
                11
            ],
            [
                12,
                41
            ],
            [
                41,
                88
            ],
            [
                99,
                154
            ],
            [
                169,
                269
            ],
            [
                269,
                394
            ],
            [
                394,
                396
            ],
            [
                396,
                429
            ],
            [
                429,
                435
            ],
            [
                436,
                469
            ],
            [
                480,
                490
            ],
            [
                496,
                501
            ],
            [
                502,
                543
            ],
            [
                544,
                564
            ],
            [
                565,
                582
            ],
            [
                582,
                584
            ],
            [
                584,
                600
            ],
            [
                600,
                644
            ],
            [
                645,
                783
            ],
            [
                783,
                795
            ],
            [
                802,
                820
            ],
            [
                821,
                880
            ],
            [
                881,
                887
            ],
            [
                887,
                889
            ],
            [
                889,
                948
            ],
            [
                948,
                960
            ],
            [
                961,
                1024
            ],
            [
                1025,
                1097
            ],
            [
                1109,
                1122
            ],
            [
                1122,
                1131
            ],
            [
                1132,
                1147
            ],
            [
                1148,
                1154
            ],
            [
                1155,
                1165
            ],
            [
                1172,
                1243
            ],
            [
                1243,
                1246
            ],
            [
                1253,
                1279
            ],
            [
                1288,
                1309
            ],
            [
                1309,
                1311
            ],
            [
                1311,
                1328
            ],
            [
                1336,
                1345
            ],
            [
                1354,
                1421
            ],
            [
                1421,
                1532
            ],
            [
                1534,
                1536
            ],
            [
                1539,
                1554
            ],
            [
                1554,
                1568
            ],
            [
                1568,
                1571
            ],
            [
                1581,
                1707
            ],
            [
                1707,
                1786
            ],
            [
                1791,
                1828
            ],
            [
                1829,
                1831
            ],
            [
                1832,
                1892
            ],
            [
                1892,
                1894
            ],
            [
                1894,
                1898
            ],
            [
                1904,
                1928
            ],
            [
                1929,
                2034
            ],
            [
                2042,
                2061
            ],
            [
                2061,
                2063
            ],
            [
                2063,
                2067
            ],
            [
                2075,
                2116
            ],
            [
                2117,
                2120
            ],
            [
                2121,
                2125
            ],
            [
                2127,
                2274
            ],
            [
                2275,
                2278
            ],
            [
                2287,
                2289
            ],
            [
                2290,
                2307
            ],
            [
                2315,
                2322
            ],
            [
                2322,
                2378
            ],
            [
                2379,
                2382
            ],
            [
                2383,
                2399
            ],
            [
                2399,
                2446
            ],
            [
                2447,
                2466
            ],
            [
                2467,
                2504
            ],
            [
                2505,
                2524
            ],
            [
                2524,
                2549
            ],
            [
                2549,
                2584
            ],
            [
                2584,
                2651
            ],
            [
                2660,
                2674
            ],
            [
                2681,
                2702
            ],
            [
                2703,
                2738
            ],
            [
                2738,
                2739
            ],
            [
                2740,
                2780
            ],
            [
                2781,
                2904
            ],
            [
                2905,
                3029
            ],
            [
                3037,
                3055
            ],
            [
                3056,
                3070
            ],
            [
                3077,
                3086
            ],
            [
                3087,
                3111
            ],
            [
                3111,
                3114
            ],
            [
                3120,
                3123
            ],
            [
                3124,
                3175
            ],
            [
                3175,
                3177
            ],
            [
                3177,
                3260
            ],
            [
                3268,
                3270
            ],
            [
                3275,
                3422
            ],
            [
                3422,
                3444
            ],
            [
                3445,
                3448
            ],
            [
                3449,
                3454
            ],
            [
                3455,
                3464
            ],
            [
                3465,
                3475
            ],
            [
                3482,
                3519
            ],
            [
                3519,
                3535
            ],
            [
                3541,
                3542
            ],
            [
                3543,
                3585
            ],
            [
                3586,
                3611
            ],
            [
                3617,
                3634
            ],
            [
                3658,
                3680
            ],
            [
                3680,
                3761
            ],
            [
                3761,
                3783
            ],
            [
                3784,
                3853
            ],
            [
                3854,
                3922
            ],
            [
                3922,
                3923
            ],
            [
                3937,
                4011
            ],
            [
                4011,
                4013
            ],
            [
                4013,
                4080
            ],
            [
                4094,
                4154
            ],
            [
                4154,
                4247
            ],
            [
                4247,
                4309
            ],
            [
                4310,
                4343
            ],
            [
                4343,
                4362
            ],
            [
                4371,
                4456
            ],
            [
                4456,
                4553
            ],
            [
                4553,
                4555
            ],
            [
                4555,
                4618
            ],
            [
                4619,
                4651
            ],
            [
                4651,
                4832
            ],
            [
                4832,
                4843
            ],
            [
                4844,
                4848
            ],
            [
                4849,
                4853
            ],
            [
                4854,
                4862
            ],
            [
                4862,
                4913
            ],
            [
                4914,
                5077
            ],
            [
                5086,
                5096
            ],
            [
                5096,
                5121
            ],
            [
                5129,
                5137
            ],
            [
                5137,
                5185
            ],
            [
                5185,
                5213
            ],
            [
                5219,
                5230
            ],
            [
                5234,
                5236
            ],
            [
                5237,
                5249
            ],
            [
                5249,
                5251
            ],
            [
                5251,
                5271
            ],
            [
                5282,
                5307
            ],
            [
                5307,
                5331
            ],
            [
                5332,
                5341
            ],
            [
                5350,
                5379
            ],
            [
                5397,
                5404
            ],
            [
                5413,
                5421
            ],
            [
                5424,
                5466
            ],
            [
                5483,
                5485
            ],
            [
                5485,
                5500
            ],
            [
                5501,
                5616
            ],
            [
                5616,
                5631
            ],
            [
                5632,
                5657
            ],
            [
                5657,
                5665
            ],
            [
                5666,
                5674
            ],
            [
                5684,
                5691
            ],
            [
                5701,
                5736
            ],
            [
                5737,
                5749
            ],
            [
                5754,
                5782
            ],
            [
                5782,
                5784
            ],
            [
                5784,
                5794
            ],
            [
                5798,
                5841
            ],
            [
                5842,
                5854
            ],
            [
                5855,
                5873
            ],
            [
                5874,
                5937
            ],
            [
                5943,
                6005
            ],
            [
                6005,
                6125
            ],
            [
                6125,
                6168
            ],
            [
                6168,
                6170
            ],
            [
                6170,
                6195
            ],
            [
                6195,
                6256
            ],
            [
                6256,
                6275
            ],
            [
                6287,
                6342
            ],
            [
                6342,
                6385
            ],
            [
                6385,
                6394
            ],
            [
                6405,
                6414
            ],
            [
                6417,
                6440
            ],
            [
                6443,
                6450
            ],
            [
                6453,
                6516
            ],
            [
                6516,
                6557
            ],
            [
                6557,
                6597
            ],
            [
                6598,
                6643
            ],
            [
                6644,
                6647
            ],
            [
                6648,
                6666
            ],
            [
                6666,
                6668
            ],
            [
                6668,
                6748
            ],
            [
                6748,
                6839
            ],
            [
                6847,
                6905
            ],
            [
                6905,
                6940
            ],
            [
                6940,
                6984
            ],
            [
                6984,
                6987
            ],
            [
                7003,
                7011
            ],
            [
                7016,
                7027
            ],
            [
                7027,
                7029
            ],
            [
                7029,
                7120
            ],
            [
                7123,
                7143
            ],
            [
                7146,
                7167
            ],
            [
                7167,
                7168
            ],
            [
                7169,
                7283
            ],
            [
                7284,
                7285
            ],
            [
                7288,
                7304
            ],
            [
                7307,
                7314
            ],
            [
                7320,
                7322
            ],
            [
                7334,
                7389
            ],
            [
                7399,
                7454
            ],
            [
                7454,
                7484
            ],
            [
                7484,
                7504
            ],
            [
                7507,
                7514
            ],
            [
                7514,
                7526
            ],
            [
                7540,
                7559
            ],
            [
                7560,
                7572
            ],
            [
                7573,
                7576
            ],
            [
                7577,
                7583
            ],
            [
                7586,
                7601
            ],
            [
                7601,
                7621
            ],
            [
                7631,
                7645
            ],
            [
                7654,
                7657
            ],
            [
                7657,
                7679
            ],
            [
                7687,
                7720
            ],
            [
                7721,
                7723
            ],
            [
                7724,
                7744
            ],
            [
                7744,
                7762
            ],
            [
                7762,
                7769
            ],
            [
                7778,
                7784
            ],
            [
                7787,
                7816
            ],
            [
                7827,
                7834
            ],
            [
                7834,
                7836
            ],
            [
                7836,
                7861
            ],
            [
                7861,
                7881
            ],
            [
                7881,
                7943
            ],
            [
                7943,
                7946
            ],
            [
                7946,
                7998
            ],
            [
                7998,
                8023
            ],
            [
                8033,
                8063
            ],
            [
                8063,
                8103
            ],
            [
                8104,
                8115
            ],
            [
                8115,
                8133
            ],
            [
                8134,
                8137
            ],
            [
                8138,
                8148
            ],
            [
                8148,
                8185
            ],
            [
                8185,
                8272
            ],
            [
                8272,
                8424
            ],
            [
                8427,
                8430
            ],
            [
                8432,
                8450
            ],
            [
                8462,
                8463
            ]
        ],
        "row_chars": [
            [
                0,
                41
            ],
            [
                41,
                269
            ],
            [
                269,
                396
            ],
            [
                396,
                429
            ],
            [
                429,
                469
            ],
            [
                469,
                584
            ],
            [
                584,
                600
            ],
            [
                600,
                783
            ],
            [
                783,
                783
            ],
            [
                783,
                889
            ],
            [
                889,
                1122
            ],
            [
                1122,
                1243
            ],
            [
                1243,
                1311
            ],
            [
                1311,
                1421
            ],
            [
                1421,
                1568
            ],
            [
                1568,
                1707
            ],
            [
                1707,
                1894
            ],
            [
                1894,
                2063
            ],
            [
                2063,
                2322
            ],
            [
                2322,
                2524
            ],
            [
                2524,
                2740
            ],
            [
                2740,
                3111
            ],
            [
                3111,
                3177
            ],
            [
                3177,
                3270
            ],
            [
                3270,
                3422
            ],
            [
                3422,
                3519
            ],
            [
                3519,
                3543
            ],
            [
                3543,
                3761
            ],
            [
                3761,
                3854
            ],
            [
                3854,
                3854
            ],
            [
                3854,
                4013
            ],
            [
                4013,
                4013
            ],
            [
                4013,
                4247
            ],
            [
                4247,
                4310
            ],
            [
                4310,
                4310
            ],
            [
                4310,
                4343
            ],
            [
                4343,
                4456
            ],
            [
                4456,
                4555
            ],
            [
                4555,
                4651
            ],
            [
                4651,
                4832
            ],
            [
                4832,
                4832
            ],
            [
                4832,
                5096
            ],
            [
                5096,
                5137
            ],
            [
                5137,
                5185
            ],
            [
                5185,
                5185
            ],
            [
                5185,
                5251
            ],
            [
                5251,
                5307
            ],
            [
                5307,
                5485
            ],
            [
                5485,
                5616
            ],
            [
                5616,
                5691
            ],
            [
                5691,
                5784
            ],
            [
                5784,
                5784
            ],
            [
                5784,
                5784
            ],
            [
                5784,
                5784
            ],
            [
                5784,
                6005
            ],
            [
                6005,
                6125
            ],
            [
                6125,
                6170
            ],
            [
                6170,
                6195
            ],
            [
                6195,
                6256
            ],
            [
                6256,
                6342
            ],
            [
                6342,
                6385
            ],
            [
                6385,
                6453
            ],
            [
                6453,
                6516
            ],
            [
                6516,
                6557
            ],
            [
                6557,
                6668
            ],
            [
                6668,
                6748
            ],
            [
                6748,
                6905
            ],
            [
                6905,
                6984
            ],
            [
                6984,
                7029
            ],
            [
                7029,
                7123
            ],
            [
                7123,
                7169
            ],
            [
                7169,
                7454
            ],
            [
                7454,
                7484
            ],
            [
                7484,
                7514
            ],
            [
                7514,
                7601
            ],
            [
                7601,
                7657
            ],
            [
                7657,
                7762
            ],
            [
                7762,
                7787
            ],
            [
                7787,
                7787
            ],
            [
                7787,
                7836
            ],
            [
                7836,
                7861
            ],
            [
                7861,
                7881
            ],
            [
                7881,
                7998
            ],
            [
                7998,
                8063
            ],
            [
                8063,
                8063
            ],
            [
                8063,
                8063
            ],
            [
                8063,
                8115
            ],
            [
                8115,
                8148
            ],
            [
                8148,
                8185
            ],
            [
                8185,
                8272
            ],
            [
                8272,
                8463
            ]
        ]
    }
}