{
    "original": {
        "text": "A touch on the lawyer's wrinkled hand as he stands in the dark room, irresolute, makes him start and say, \"What's that?\"\n\"It's me,\" returns the old man of the house, whose breath is in his ear. \"Can't you wake him?\"\n\"No.\"\n\"What have you done with your candle?\"\n\"It's gone out. Here it is.\"\nKrook takes it, goes to the fire, stoops over the red embers, and tries to get a light. The dying ashes have no light to spare, and his endeavours are vain. Muttering, after an ineffectual call to his lodger, that he will go downstairs and bring a lighted candle from the shop, the old man departs. Mr. Tulkinghorn, for some new reason that he has, does not await his return in the room, but on the stairs outside.\nThe welcome light soon shines upon the wall, as Krook comes slowly up with his green-eyed cat following at his heels. \"Does the man generally sleep like this?\" inquired the lawyer in a low voice. \"Hi! I don't know,\" says Krook, shaking his head and lifting his eyebrows. \"I know next to nothing of his habits except that he keeps himself very close.\"\nThus whispering, they both go in together. As the light goes in, the great eyes in the shutters, darkening, seem to close. Not so the eyes upon the bed.\n\"God save us!\" exclaims Mr. Tulkinghorn. \"He is dead!\" Krook drops the heavy hand he has taken up so suddenly that the arm swings over the bedside.\nThey look at one another for a moment.\n\"Send for some doctor! Call for Miss Flite up the stairs, sir. Here's poison by the bed! Call out for Flite, will you?\" says Krook, with his lean hands spread out above the body like a vampire's wings.\nMr. Tulkinghorn hurries to the landing and calls, \"Miss Flite! Flite! Make haste, here, whoever you are! Flite!\" Krook follows him with his eyes, and while he is calling, finds opportunity to steal to the old portmanteau and steal back again.\n\"Run, Flite, run! The nearest doctor! Run!\" So Mr. Krook addresses a crazy little woman who is his female lodger, who appears and vanishes in a breath, who soon returns accompanied by a testy medical man brought from his dinner, with a broad, snuffy upper lip and a broad Scotch tongue.\n\"Ey! Bless the hearts o' ye,\" says the medical man, looking up at them after a moment's examination. \"He's just as dead as Phairy!\"\nMr. Tulkinghorn (standing by the old portmanteau) inquires if he has been dead any time.\n\"Any time, sir?\" says the medical gentleman. \"It's probable he wull have been dead aboot three hours.\"\n\"About that time, I should say,\" observes a dark young man on the other side of the bed.\n\"Air you in the maydickle prayfession yourself, sir?\" inquires the first.\nThe dark young man says yes.\n\"Then I'll just tak' my depairture,\" replies the other, \"for I'm nae gude here!\" With which remark he finishes his brief attendance and returns to finish his dinner.\nThe dark young surgeon passes the candle across and across the face and carefully examines the law-writer, who has established his pretensions to his name by becoming indeed No one.\n\"I knew this person by sight very well,\" says he. \"He has purchased opium of me for the last year and a half. Was anybody present related to him?\" glancing round upon the three bystanders.\n\"I was his landlord,\" grimly answers Krook, taking the candle from the surgeon's outstretched hand. \"He told me once I was the nearest relation he had.\"\n\"He has died,\" says the surgeon, \"of an over-dose of opium, there is no doubt. The room is strongly flavoured with it. There is enough here now,\" taking an old tea-pot from Mr. Krook, \"to kill a dozen people.\"\n\"Do you think he did it on purpose?\" asks Krook.\n\"Took the over-dose?\"\n\"Yes!\" Krook almost smacks his lips with the unction of a horrible interest.\n\"I can't say. I should think it unlikely, as he has been in the habit of taking so much. But nobody can tell. He was very poor, I suppose?\"\n\"I suppose he was. His room--don't look rich,\" says Krook, who might have changed eyes with his cat, as he casts his sharp glance around. \"But I have never been in it since he had it, and he was too close to name his circumstances to me.\"\n\"Did he owe you any rent?\"\n\"Six weeks.\"\n\"He will never pay it!\" says the young man, resuming his examination. \"It is beyond a doubt that he is indeed as dead as Pharaoh; and to judge from his appearance and condition, I should think it a happy release. Yet he must have been a good figure when a youth, and I dare say, good-looking.\" He says this, not unfeelingly, while sitting on the bedstead's edge with his face towards that other face and his hand upon the region of the heart. \"I recollect once thinking there was something in his manner, uncouth as it was, that denoted a fall in life. Was that so?\" he continues, looking round.\nKrook replies, \"You might as well ask me to describe the ladies whose heads of hair I have got in sacks downstairs. Than that he was my lodger for a year and a half and lived--or didn't live--by law-writing, I know no more of him.\"\nDuring this dialogue Mr. Tulkinghorn has stood aloof by the old portmanteau, with his hands behind him, equally removed, to all appearance, from all three kinds of interest exhibited near the bed--from the young surgeon's professional interest in death, noticeable as being quite apart from his remarks on the deceased as an individual; from the old man's unction; and the little crazy woman's awe. His imperturbable face has been as inexpressive as his rusty clothes. One could not even say he has been thinking all this while. He has shown neither patience nor impatience, nor attention nor abstraction. He has shown nothing but his shell. As easily might the tone of a delicate musical instrument be inferred from its case, as the tone of Mr. Tulkinghorn from his case.\nHe now interposes, addressing the young surgeon in his unmoved, professional way.\n\"I looked in here,\" he observes, \"just before you, with the intention of giving this deceased man, whom I never saw alive, some employment at his trade of copying. I had heard of him from my stationer--Snagsby of Cook's Court. Since no one here knows anything about him, it might be as well to send for Snagsby. Ah!\" to the little crazy woman, who has often seen him in court, and whom he has often seen, and who proposes, in frightened dumb-show, to go for the law-stationer. \"Suppose you do!\"\nWhile she is gone, the surgeon abandons his hopeless investigation and covers its subject with the patchwork counterpane. Mr. Krook and he interchange a word or two. Mr. Tulkinghorn says nothing, but stands, ever, near the old portmanteau.\nMr. Snagsby arrives hastily in his grey coat and his black sleeves. \"Dear me, dear me,\" he says; \"and it has come to this, has it! Bless my soul!\"\n\"Can you give the person of the house any information about this unfortunate creature, Snagsby?\" inquires Mr. Tulkinghorn. \"He was in arrears with his rent, it seems. And he must be buried, you know.\"\n\"Well, sir,\" says Mr. Snagsby, coughing his apologetic cough behind his hand, \"I really don't know what advice I could offer, except sending for the beadle.\"\n\"I don't speak of advice,\" returns Mr. Tulkinghorn. \"I could advise--\"\n\"No one better, sir, I am sure,\" says Mr. Snagsby, with his deferential cough.\n\"I speak of affording some clue to his connexions, or to where he came from, or to anything concerning him.\"\n\"I assure you, sir,\" says Mr. Snagsby after prefacing his reply with his cough of general propitiation, \"that I no more know where he came from than I know--\"\n\"Where he has gone to, perhaps,\" suggests the surgeon to help him out.\nA pause. Mr. Tulkinghorn looking at the law-stationer. Mr. Krook, with his mouth open, looking for somebody to speak next.\n\"As to his connexions, sir,\" says Mr. Snagsby, \"if a person was to say to me, 'Snagsby, here's twenty thousand pound down, ready for you in the Bank of England if you'll only name one of 'em,' I couldn't do it, sir! About a year and a half ago--to the best of my belief, at the time when he first came to lodge at the present rag and bottle shop--\"\n\"That was the time!\" says Krook with a nod.\n\"About a year and a half ago,\" says Mr. Snagsby, strengthened, \"he came into our place one morning after breakfast, and finding my little woman (which I name Mrs. Snagsby when I use that appellation) in our shop, produced a specimen of his handwriting and gave her to understand that he was in want of copying work to do and was, not to put too fine a point upon it,\" a favourite apology for plain speaking with Mr. Snagsby, which he always offers with a sort of argumentative frankness, \"hard up! My little woman is not in general partial to strangers, particular--not to put too fine a point upon it--when they want anything. But she was rather took by something about this person, whether by his being unshaved, or by his hair being in want of attention, or by what other ladies' reasons, I leave you to judge; and she accepted of the specimen, and likewise of the address. My little woman hasn't a good ear for names,\" proceeds Mr. Snagsby after consulting his cough of consideration behind his hand, \"and she considered Nemo equally the same as Nimrod. In consequence of which, she got into a habit of saying to me at meals, 'Mr. Snagsby, you haven't found Nimrod any work yet!' or 'Mr. Snagsby, why didn't you give that eight and thirty Chancery folio in Jarndyce to Nimrod?' or such like. And that is the way he gradually fell into job-work at our place; and that is the most I know of him except that he was a quick hand, and a hand not sparing of night-work, and that if you gave him out, say, five and forty folio on the Wednesday night, you would have it brought in on the Thursday morning. All of which--\" Mr. Snagsby concludes by politely motioning with his hat towards the bed, as much as to add, \"I have no doubt my honourable friend would confirm if he were in a condition to do it.\"\n\"Hadn't you better see,\" says Mr. Tulkinghorn to Krook, \"whether he had any papers that may enlighten you? There will be an inquest, and you will be asked the question. You can read?\"\n\"No, I can't,\" returns the old man with a sudden grin.\n\"Snagsby,\" says Mr. Tulkinghorn, \"look over the room for him. He will get into some trouble or difficulty otherwise. Being here, I'll wait if you make haste, and then I can testify on his behalf, if it should ever be necessary, that all was fair and right. If you will hold the candle for Mr. Snagsby, my friend, he'll soon see whether there is anything to help you.\"\n\"In the first place, here's an old portmanteau, sir,\" says Snagsby.\nAh, to be sure, so there is! Mr. Tulkinghorn does not appear to have seen it before, though he is standing so close to it, and though there is very little else, heaven knows.\nThe marine-store merchant holds the light, and the law-stationer conducts the search. The surgeon leans against the corner of the chimney-piece; Miss Flite peeps and trembles just within the door. The apt old scholar of the old school, with his dull black breeches tied with ribbons at the knees, his large black waistcoat, his long-sleeved black coat, and his wisp of limp white neckerchief tied in the bow the peerage knows so well, stands in exactly the same place and attitude.\nThere are some worthless articles of clothing in the old portmanteau; there is a bundle of pawnbrokers' duplicates, those turnpike tickets on the road of poverty; there is a crumpled paper, smelling of opium, on which are scrawled rough memoranda--as, took, such a day, so many grains; took, such another day, so many more--begun some time ago, as if with the intention of being regularly continued, but soon left off. There are a few dirty scraps of newspapers, all referring to coroners' inquests; there is nothing else. They search the cupboard and the drawer of the ink-splashed table. There is not a morsel of an old letter or of any other writing in either. The young surgeon examines the dress on the law-writer. A knife and some odd halfpence are all he finds. Mr. Snagsby's suggestion is the practical suggestion after all, and the beadle must be called in.\nSo the little crazy lodger goes for the beadle, and the rest come out of the room. \"Don't leave the cat there!\" says the surgeon; \"that won't do!\" Mr. Krook therefore drives her out before him, and she goes furtively downstairs, winding her lithe tail and licking her lips.\n\"Good night!\" says Mr. Tulkinghorn, and goes home to Allegory and meditation.\nBy this time the news has got into the court. Groups of its inhabitants assemble to discuss the thing, and the outposts of the army of observation (principally boys) are pushed forward to Mr. Krook's window, which they closely invest. A policeman has already walked up to the room, and walked down again to the door, where he stands like a tower, only condescending to see the boys at his base occasionally; but whenever he does see them, they quail and fall back. Mrs. Perkins, who has not been for some weeks on speaking terms with Mrs. Piper in consequence for an unpleasantness originating in young Perkins' having \"fetched\" young Piper \"a crack,\" renews her friendly intercourse on this auspicious occasion. The potboy at the corner, who is a privileged amateur, as possessing official knowledge of life and having to deal with drunken men occasionally, exchanges confidential communications with the policeman and has the appearance of an impregnable youth, unassailable by truncheons and unconfinable in station-houses. People talk across the court out of window, and bare-headed scouts come hurrying in from Chancery Lane to know what's the matter. The general feeling seems to be that it's a blessing Mr. Krook warn't made away with first, mingled with a little natural disappointment that he was not. In the midst of this sensation, the beadle arrives.\nThe beadle, though generally understood in the neighbourhood to be a ridiculous institution, is not without a certain popularity for the moment, if it were only as a man who is going to see the body. The policeman considers him an imbecile civilian, a remnant of the barbarous watchmen times, but gives him admission as something that must be borne with until government shall abolish him. The sensation is heightened as the tidings spread from mouth to mouth that the beadle is on the ground and has gone in.\nBy and by the beadle comes out, once more intensifying the sensation, which has rather languished in the interval. He is understood to be in want of witnesses for the inquest to-morrow who can tell the coroner and jury anything whatever respecting the deceased. Is immediately referred to innumerable people who can tell nothing whatever. Is made more imbecile by being constantly informed that Mrs. Green's son \"was a law-writer his-self and knowed him better than anybody,\" which son of Mrs. Green's appears, on inquiry, to be at the present time aboard a vessel bound for China, three months out, but considered accessible by telegraph on application to the Lords of the Admiralty. Beadle goes into various shops and parlours, examining the inhabitants, always shutting the door first, and by exclusion, delay, and general idiotcy exasperating the public. Policeman seen to smile to potboy. Public loses interest and undergoes reaction. Taunts the beadle in shrill youthful voices with having boiled a boy, choruses fragments of a popular song to that effect and importing that the boy was made into soup for the workhouse. Policeman at last finds it necessary to support the law and seize a vocalist, who is released upon the flight of the rest on condition of his getting out of this then, come, and cutting it--a condition he immediately observes. So the sensation dies off for the time; and the unmoved policeman (to whom a little opium, more or less, is nothing), with his shining hat, stiff stock, inflexible great-coat, stout belt and bracelet, and all things fitting, pursues his lounging way with a heavy tread, beating the palms of his white gloves one against the other and stopping now and then at a street-corner to look casually about for anything between a lost child and a murder.\nUnder cover of the night, the feeble-minded beadle comes flitting about Chancery Lane with his summonses, in which every juror's name is wrongly spelt, and nothing rightly spelt but the beadle's own name, which nobody can read or wants to know. The summonses served and his witnesses forewarned, the beadle goes to Mr. Krook's to keep a small appointment he has made with certain paupers, who, presently arriving, are conducted upstairs, where they leave the great eyes in the shutter something new to stare at, in that last shape which earthly lodgings take for No one--and for Every one.\nAnd all that night the coffin stands ready by the old portmanteau; and the lonely figure on the bed, whose path in life has lain through five and forty years, lies there with no more track behind him that any one can trace than a deserted infant.\nNext day the court is all alive--is like a fair, as Mrs. Perkins, more than reconciled to Mrs. Piper, says in amicable conversation with that excellent woman. The coroner is to sit in the first-floor room at the Sol's Arms, where the Harmonic Meetings take place twice a week and where the chair is filled by a gentleman of professional celebrity, faced by Little Swills, the comic vocalist, who hopes (according to the bill in the window) that his friends will rally round him and support first-rate talent. The Sol's Arms does a brisk stroke of business all the morning. Even children so require sustaining under the general excitement that a pieman who has established himself for the occasion at the corner of the court says his brandy-balls go off like smoke. What time the beadle, hovering between the door of Mr. Krook's establishment and the door of the Sol's Arms, shows the curiosity in his keeping to a few discreet spirits and accepts the compliment of a glass of ale or so in return.\nAt the appointed hour arrives the coroner, for whom the jurymen are waiting and who is received with a salute of skittles from the good dry skittle-ground attached to the Sol's Arms. The coroner frequents more public-houses than any man alive. The smell of sawdust, beer, tobacco-smoke, and spirits is inseparable in his vocation from death in its most awful shapes. He is conducted by the beadle and the landlord to the Harmonic Meeting Room, where he puts his hat on the piano and takes a Windsor-chair at the head of a long table formed of several short tables put together and ornamented with glutinous rings in endless involutions, made by pots and glasses. As many of the jury as can crowd together at the table sit there. The rest get among the spittoons and pipes or lean against the piano. Over the coroner's head is a small iron garland, the pendant handle of a bell, which rather gives the majesty of the court the appearance of going to be hanged presently.\nCall over and swear the jury! While the ceremony is in progress, sensation is created by the entrance of a chubby little man in a large shirt-collar, with a moist eye and an inflamed nose, who modestly takes a position near the door as one of the general public, but seems familiar with the room too. A whisper circulates that this is Little Swills. It is considered not unlikely that he will get up an imitation of the coroner and make it the principal feature of the Harmonic Meeting in the evening.\n\"Well, gentlemen--\" the coroner begins.\n\"Silence there, will you!\" says the beadle. Not to the coroner, though it might appear so.\n\"Well, gentlemen,\" resumes the coroner. \"You are impanelled here to inquire into the death of a certain man. Evidence will be given before you as to the circumstances attending that death, and you will give your verdict according to the--skittles; they must be stopped, you know, beadle!--evidence, and not according to anything else. The first thing to be done is to view the body.\"\n\"Make way there!\" cries the beadle.\nSo they go out in a loose procession, something after the manner of a straggling funeral, and make their inspection in Mr. Krook's back second floor, from which a few of the jurymen retire pale and precipitately. The beadle is very careful that two gentlemen not very neat about the cuffs and buttons (for whose accommodation he has provided a special little table near the coroner in the Harmonic Meeting Room) should see all that is to be seen. For they are the public chroniclers of such inquiries by the line; and he is not superior to the universal human infirmity, but hopes to read in print what \"Mooney, the active and intelligent beadle of the district,\" said and did and even aspires to see the name of Mooney as familiarly and patronizingly mentioned as the name of the hangman is, according to the latest examples.\nLittle Swills is waiting for the coroner and jury on their return. Mr. Tulkinghorn, also. Mr. Tulkinghorn is received with distinction and seated near the coroner between that high judicial officer, a bagatelle-board, and the coal-box. The inquiry proceeds. The jury learn how the subject of their inquiry died, and learn no more about him. \"A very eminent solicitor is in attendance, gentlemen,\" says the coroner, \"who, I am informed, was accidentally present when discovery of the death was made, but he could only repeat the evidence you have already heard from the surgeon, the landlord, the lodger, and the law-stationer, and it is not necessary to trouble him. Is anybody in attendance who knows anything more?\"\nMrs. Piper pushed forward by Mrs. Perkins. Mrs. Piper sworn.\nAnastasia Piper, gentlemen. Married woman. Now, Mrs. Piper, what have you got to say about this?\nWhy, Mrs. Piper has a good deal to say, chiefly in parentheses and without punctuation, but not much to tell. Mrs. Piper lives in the court (which her husband is a cabinet-maker), and it has long been well beknown among the neighbours (counting from the day next but one before the half-baptizing of Alexander James Piper aged eighteen months and four days old on accounts of not being expected to live such was the sufferings gentlemen of that child in his gums) as the plaintive--so Mrs. Piper insists on calling the deceased--was reported to have sold himself. Thinks it was the plaintive's air in which that report originatinin. See the plaintive often and considered as his air was feariocious and not to be allowed to go about some children being timid (and if doubted hoping Mrs. Perkins may be brought forard for she is here and will do credit to her husband and herself and family). Has seen the plaintive wexed and worrited by the children (for children they will ever be and you cannot expect them specially if of playful dispositions to be Methoozellers which you was not yourself). On accounts of this and his dark looks has often dreamed as she see him take a pick-axe from his pocket and split Johnny's head (which the child knows not fear and has repeatually called after him close at his eels). Never however see the plaintive take a pick-axe or any other wepping far from it. Has seen him hurry away when run and called after as if not partial to children and never see him speak to neither child nor grown person at any time (excepting the boy that sweeps the crossing down the lane over the way round the corner which if he was here would tell you that he has been seen a-speaking to him frequent).\nSays the coroner, is that boy here? Says the beadle, no, sir, he is not here. Says the coroner, go and fetch him then. In the absence of the active and intelligent, the coroner converses with Mr. Tulkinghorn.\nOh! Here's the boy, gentlemen!\nHere he is, very muddy, very hoarse, very ragged. Now, boy! But stop a minute. Caution. This boy must be put through a few preliminary paces.\nName, Jo. Nothing else that he knows on. Don't know that everybody has two names. Never heerd of sich a think. Don't know that Jo is short for a longer name. Thinks it long enough for HIM. HE don't find no fault with it. Spell it? No. HE can't spell it. No father, no mother, no friends. Never been to school. What's home? Knows a broom's a broom, and knows it's wicked to tell a lie. Don't recollect who told him about the broom or about the lie, but knows both. Can't exactly say what'll be done to him arter he's dead if he tells a lie to the gentlemen here, but believes it'll be something wery bad to punish him, and serve him right--and so he'll tell the truth.\n\"This won't do, gentlemen!\" says the coroner with a melancholy shake of the head.\n\"Don't you think you can receive his evidence, sir?\" asks an attentive juryman.\n\"Out of the question,\" says the coroner. \"You have heard the boy. 'Can't exactly say' won't do, you know. We can't take THAT in a court of justice, gentlemen. It's terrible depravity. Put the boy aside.\"\nBoy put aside, to the great edification of the audience, especially of Little Swills, the comic vocalist.\nNow. Is there any other witness? No other witness.\nVery well, gentlemen! Here's a man unknown, proved to have been in the habit of taking opium in large quantities for a year and a half, found dead of too much opium. If you think you have any evidence to lead you to the conclusion that he committed suicide, you will come to that conclusion. If you think it is a case of accidental death, you will find a verdict accordingly.\nVerdict accordingly. Accidental death. No doubt. Gentlemen, you are discharged. Good afternoon.\nWhile the coroner buttons his great-coat, Mr. Tulkinghorn and he give private audience to the rejected witness in a corner.\nThat graceless creature only knows that the dead man (whom he recognized just now by his yellow face and black hair) was sometimes hooted and pursued about the streets. That one cold winter night when he, the boy, was shivering in a doorway near his crossing, the man turned to look at him, and came back, and having questioned him and found that he had not a friend in the world, said, \"Neither have I. Not one!\" and gave him the price of a supper and a night's lodging. That the man had often spoken to him since and asked him whether he slept sound at night, and how he bore cold and hunger, and whether he ever wished to die, and similar strange questions. That when the man had no money, he would say in passing, \"I am as poor as you to-day, Jo,\" but that when he had any, he had always (as the boy most heartily believes) been glad to give him some.\n\"He was wery good to me,\" says the boy, wiping his eyes with his wretched sleeve. \"Wen I see him a-layin' so stritched out just now, I wished he could have heerd me tell him so. He wos wery good to me, he wos!\"\nAs he shuffles downstairs, Mr. Snagsby, lying in wait for him, puts a half-crown in his hand. \"If you ever see me coming past your crossing with my little woman--I mean a lady--\" says Mr. Snagsby with his finger on his nose, \"don't allude to it!\"\nFor some little time the jurymen hang about the Sol's Arms colloquially. In the sequel, half-a-dozen are caught up in a cloud of pipe-smoke that pervades the parlour of the Sol's Arms; two stroll to Hampstead; and four engage to go half-price to the play at night, and top up with oysters. Little Swills is treated on several hands. Being asked what he thinks of the proceedings, characterizes them (his strength lying in a slangular direction) as \"a rummy start.\" The landlord of the Sol's Arms, finding Little Swills so popular, commends him highly to the jurymen and public, observing that for a song in character he don't know his equal and that that man's character-wardrobe would fill a cart.\nThus, gradually the Sol's Arms melts into the shadowy night and then flares out of it strong in gas. The Harmonic Meeting hour arriving, the gentleman of professional celebrity takes the chair, is faced (red-faced) by Little Swills; their friends rally round them and support first-rate talent. In the zenith of the evening, Little Swills says, \"Gentlemen, if you'll permit me, I'll attempt a short description of a scene of real life that came off here to-day.\" Is much applauded and encouraged; goes out of the room as Swills; comes in as the coroner (not the least in the world like him); describes the inquest, with recreative intervals of piano-forte accompaniment, to the refrain: With his (the coroner's) tippy tol li doll, tippy tol lo doll, tippy tol li doll, Dee!\nThe jingling piano at last is silent, and the Harmonic friends rally round their pillows. Then there is rest around the lonely figure, now laid in its last earthly habitation; and it is watched by the gaunt eyes in the shutters through some quiet hours of night. If this forlorn man could have been prophetically seen lying here by the mother at whose breast he nestled, a little child, with eyes upraised to her loving face, and soft hand scarcely knowing how to close upon the neck to which it crept, what an impossibility the vision would have seemed! Oh, if in brighter days the now-extinguished fire within him ever burned for one woman who held him in her heart, where is she, while these ashes are above the ground!\nIt is anything but a night of rest at Mr. Snagsby's, in Cook's Court, where Guster murders sleep by going, as Mr. Snagsby himself allows--not to put too fine a point upon it--out of one fit into twenty. The occasion of this seizure is that Guster has a tender heart and a susceptible something that possibly might have been imagination, but for Tooting and her patron saint. Be it what it may, now, it was so direfully impressed at tea-time by Mr. Snagsby's account of the inquiry at which he had assisted that at supper-time she projected herself into the kitchen, preceded by a flying Dutch cheese, and fell into a fit of unusual duration, which she only came out of to go into another, and another, and so on through a chain of fits, with short intervals between, of which she has pathetically availed herself by consuming them in entreaties to Mrs. Snagsby not to give her warning \"when she quite comes to,\" and also in appeals to the whole establishment to lay her down on the stones and go to bed. Hence, Mr. Snagsby, at last hearing the cock at the little dairy in Cursitor Street go into that disinterested ecstasy of his on the subject of daylight, says, drawing a long breath, though the most patient of men, \"I thought you was dead, I am sure!\"\nWhat question this enthusiastic fowl supposes he settles when he strains himself to such an extent, or why he should thus crow (so men crow on various triumphant public occasions, however) about what cannot be of any moment to him, is his affair. It is enough that daylight comes, morning comes, noon comes.\nThen the active and intelligent, who has got into the morning papers as such, comes with his pauper company to Mr. Krook's and bears off the body of our dear brother here departed to a hemmed-in churchyard, pestiferous and obscene, whence malignant diseases are communicated to the bodies of our dear brothers and sisters who have not departed, while our dear brothers and sisters who hang about official back-stairs--would to heaven they HAD departed!--are very complacent and agreeable. Into a beastly scrap of ground which a Turk would reject as a savage abomination and a Caffre would shudder at, they bring our dear brother here departed to receive Christian burial.\nWith houses looking on, on every side, save where a reeking little tunnel of a court gives access to the iron gate--with every villainy of life in action close on death, and every poisonous element of death in action close on life--here they lower our dear brother down a foot or two, here sow him in corruption, to be raised in corruption: an avenging ghost at many a sick-bedside, a shameful testimony to future ages how civilization and barbarism walked this boastful island together.\nCome night, come darkness, for you cannot come too soon or stay too long by such a place as this! Come, straggling lights into the windows of the ugly houses; and you who do iniquity therein, do it at least with this dread scene shut out! Come, flame of gas, burning so sullenly above the iron gate, on which the poisoned air deposits its witch-ointment slimy to the touch! It is well that you should call to every passerby, \"Look here!\"\nWith the night comes a slouching figure through the tunnel-court to the outside of the iron gate. It holds the gate with its hands and looks in between the bars, stands looking in for a little while.\nIt then, with an old broom it carries, softly sweeps the step and makes the archway clean. It does so very busily and trimly, looks in again a little while, and so departs.\nJo, is it thou? Well, well! Though a rejected witness, who \"can't exactly say\" what will be done to him in greater hands than men's, thou art not quite in outer darkness. There is something like a distant ray of light in thy muttered reason for this: \"He wos wery good to me, he wos!\"",
        "paragraph_chars": [
            [
                0,
                121
            ],
            [
                121,
                216
            ],
            [
                216,
                222
            ],
            [
                222,
                261
            ],
            [
                261,
                290
            ],
            [
                290,
                705
            ],
            [
                705,
                1056
            ],
            [
                1056,
                1209
            ],
            [
                1209,
                1357
            ],
            [
                1357,
                1396
            ],
            [
                1396,
                1598
            ],
            [
                1598,
                1841
            ],
            [
                1841,
                2128
            ],
            [
                2128,
                2260
            ],
            [
                2260,
                2349
            ],
            [
                2349,
                2452
            ],
            [
                2452,
                2541
            ],
            [
                2541,
                2615
            ],
            [
                2615,
                2644
            ],
            [
                2644,
                2810
            ],
            [
                2810,
                2992
            ],
            [
                2992,
                3181
            ],
            [
                3181,
                3334
            ],
            [
                3334,
                3544
            ],
            [
                3544,
                3593
            ],
            [
                3593,
                3615
            ],
            [
                3615,
                3692
            ],
            [
                3692,
                3832
            ],
            [
                3832,
                4071
            ],
            [
                4071,
                4098
            ],
            [
                4098,
                4111
            ],
            [
                4111,
                4707
            ],
            [
                4707,
                4939
            ],
            [
                4939,
                5712
            ],
            [
                5712,
                5794
            ],
            [
                5794,
                6289
            ],
            [
                6289,
                6529
            ],
            [
                6529,
                6676
            ],
            [
                6676,
                6877
            ],
            [
                6877,
                7035
            ],
            [
                7035,
                7106
            ],
            [
                7106,
                7185
            ],
            [
                7185,
                7294
            ],
            [
                7294,
                7453
            ],
            [
                7453,
                7524
            ],
            [
                7524,
                7647
            ],
            [
                7647,
                7996
            ],
            [
                7996,
                8040
            ],
            [
                8040,
                9840
            ],
            [
                9840,
                10024
            ],
            [
                10024,
                10079
            ],
            [
                10079,
                10447
            ],
            [
                10447,
                10515
            ],
            [
                10515,
                10690
            ],
            [
                10690,
                11172
            ],
            [
                11172,
                12039
            ],
            [
                12039,
                12313
            ],
            [
                12313,
                12391
            ],
            [
                12391,
                13754
            ],
            [
                13754,
                14264
            ],
            [
                14264,
                16064
            ],
            [
                16064,
                16654
            ],
            [
                16654,
                16901
            ],
            [
                16901,
                17898
            ],
            [
                17898,
                18868
            ],
            [
                18868,
                19370
            ],
            [
                19370,
                19410
            ],
            [
                19410,
                19501
            ],
            [
                19501,
                19885
            ],
            [
                19885,
                19921
            ],
            [
                19921,
                20748
            ],
            [
                20748,
                21466
            ],
            [
                21466,
                21527
            ],
            [
                21527,
                21624
            ],
            [
                21624,
                23343
            ],
            [
                23343,
                23552
            ],
            [
                23552,
                23583
            ],
            [
                23583,
                23725
            ],
            [
                23725,
                24393
            ],
            [
                24393,
                24475
            ],
            [
                24475,
                24555
            ],
            [
                24555,
                24759
            ],
            [
                24759,
                24865
            ],
            [
                24865,
                24916
            ],
            [
                24916,
                25292
            ],
            [
                25292,
                25388
            ],
            [
                25388,
                25512
            ],
            [
                25512,
                26368
            ],
            [
                26368,
                26579
            ],
            [
                26579,
                26826
            ],
            [
                26826,
                27525
            ],
            [
                27525,
                28299
            ],
            [
                28299,
                29022
            ],
            [
                29022,
                30278
            ],
            [
                30278,
                30586
            ],
            [
                30586,
                31258
            ],
            [
                31258,
                31746
            ],
            [
                31746,
                32184
            ],
            [
                32184,
                32384
            ],
            [
                32384,
                32557
            ],
            [
                32557,
                32841
            ]
        ],
        "segment_chars": [
            [
                0,
                121
            ],
            [
                121,
                194
            ],
            [
                194,
                216
            ],
            [
                216,
                222
            ],
            [
                222,
                261
            ],
            [
                261,
                277
            ],
            [
                277,
                290
            ],
            [
                290,
                378
            ],
            [
                378,
                447
            ],
            [
                447,
                589
            ],
            [
                589,
                705
            ],
            [
                705,
                823
            ],
            [
                823,
                865
            ],
            [
                865,
                901
            ],
            [
                901,
                906
            ],
            [
                906,
                976
            ],
            [
                976,
                1056
            ],
            [
                1056,
                1099
            ],
            [
                1099,
                1179
            ],
            [
                1179,
                1209
            ],
            [
                1209,
                1224
            ],
            [
                1224,
                1250
            ],
            [
                1250,
                1264
            ],
            [
                1264,
                1357
            ],
            [
                1357,
                1396
            ],
            [
                1396,
                1419
            ],
            [
                1419,
                1459
            ],
            [
                1459,
                1485
            ],
            [
                1485,
                1516
            ],
            [
                1516,
                1598
            ],
            [
                1598,
                1661
            ],
            [
                1661,
                1668
            ],
            [
                1668,
                1703
            ],
            [
                1703,
                1711
            ],
            [
                1711,
                1841
            ],
            [
                1841,
                1859
            ],
            [
                1859,
                1879
            ],
            [
                1879,
                1885
            ],
            [
                1885,
                2128
            ],
            [
                2128,
                2133
            ],
            [
                2133,
                2229
            ],
            [
                2229,
                2260
            ],
            [
                2260,
                2349
            ],
            [
                2349,
                2366
            ],
            [
                2366,
                2394
            ],
            [
                2394,
                2452
            ],
            [
                2452,
                2541
            ],
            [
                2541,
                2595
            ],
            [
                2595,
                2615
            ],
            [
                2615,
                2644
            ],
            [
                2644,
                2725
            ],
            [
                2725,
                2810
            ],
            [
                2810,
                2992
            ],
            [
                2992,
                3042
            ],
            [
                3042,
                3102
            ],
            [
                3102,
                3139
            ],
            [
                3139,
                3181
            ],
            [
                3181,
                3281
            ],
            [
                3281,
                3334
            ],
            [
                3334,
                3413
            ],
            [
                3413,
                3453
            ],
            [
                3453,
                3544
            ],
            [
                3544,
                3581
            ],
            [
                3581,
                3593
            ],
            [
                3593,
                3615
            ],
            [
                3615,
                3622
            ],
            [
                3622,
                3692
            ],
            [
                3692,
                3706
            ],
            [
                3706,
                3781
            ],
            [
                3781,
                3802
            ],
            [
                3802,
                3832
            ],
            [
                3832,
                3851
            ],
            [
                3851,
                3970
            ],
            [
                3970,
                4071
            ],
            [
                4071,
                4098
            ],
            [
                4098,
                4111
            ],
            [
                4111,
                4135
            ],
            [
                4135,
                4181
            ],
            [
                4181,
                4324
            ],
            [
                4324,
                4405
            ],
            [
                4405,
                4554
            ],
            [
                4554,
                4664
            ],
            [
                4664,
                4678
            ],
            [
                4678,
                4707
            ],
            [
                4707,
                4823
            ],
            [
                4823,
                4939
            ],
            [
                4939,
                5338
            ],
            [
                5338,
                5408
            ],
            [
                5408,
                5468
            ],
            [
                5468,
                5545
            ],
            [
                5545,
                5581
            ],
            [
                5581,
                5712
            ],
            [
                5712,
                5794
            ],
            [
                5794,
                5958
            ],
            [
                5958,
                6021
            ],
            [
                6021,
                6106
            ],
            [
                6106,
                6111
            ],
            [
                6111,
                6271
            ],
            [
                6271,
                6289
            ],
            [
                6289,
                6411
            ],
            [
                6411,
                6455
            ],
            [
                6455,
                6529
            ],
            [
                6529,
                6597
            ],
            [
                6597,
                6660
            ],
            [
                6660,
                6676
            ],
            [
                6676,
                6773
            ],
            [
                6773,
                6799
            ],
            [
                6799,
                6843
            ],
            [
                6843,
                6877
            ],
            [
                6877,
                7035
            ],
            [
                7035,
                7087
            ],
            [
                7087,
                7106
            ],
            [
                7106,
                7185
            ],
            [
                7185,
                7294
            ],
            [
                7294,
                7453
            ],
            [
                7453,
                7524
            ],
            [
                7524,
                7533
            ],
            [
                7533,
                7579
            ],
            [
                7579,
                7647
            ],
            [
                7647,
                7863
            ],
            [
                7863,
                7996
            ],
            [
                7996,
                8017
            ],
            [
                8017,
                8040
            ],
            [
                8040,
                8538
            ],
            [
                8538,
                8668
            ],
            [
                8668,
                8917
            ],
            [
                8917,
                9098
            ],
            [
                9098,
                9175
            ],
            [
                9175,
                9224
            ],
            [
                9224,
                9232
            ],
            [
                9232,
                9322
            ],
            [
                9322,
                9336
            ],
            [
                9336,
                9642
            ],
            [
                9642,
                9840
            ],
            [
                9840,
                9947
            ],
            [
                9947,
                10009
            ],
            [
                10009,
                10024
            ],
            [
                10024,
                10079
            ],
            [
                10079,
                10141
            ],
            [
                10141,
                10196
            ],
            [
                10196,
                10336
            ],
            [
                10336,
                10447
            ],
            [
                10447,
                10515
            ],
            [
                10515,
                10544
            ],
            [
                10544,
                10690
            ],
            [
                10690,
                10776
            ],
            [
                10776,
                10887
            ],
            [
                10887,
                11172
            ],
            [
                11172,
                11591
            ],
            [
                11591,
                11695
            ],
            [
                11695,
                11762
            ],
            [
                11762,
                11836
            ],
            [
                11836,
                11892
            ],
            [
                11892,
                11941
            ],
            [
                11941,
                12039
            ],
            [
                12039,
                12122
            ],
            [
                12122,
                12151
            ],
            [
                12151,
                12186
            ],
            [
                12186,
                12313
            ],
            [
                12313,
                12327
            ],
            [
                12327,
                12391
            ],
            [
                12391,
                12437
            ],
            [
                12437,
                12626
            ],
            [
                12626,
                12856
            ],
            [
                12856,
                13104
            ],
            [
                13104,
                13418
            ],
            [
                13418,
                13548
            ],
            [
                13548,
                13702
            ],
            [
                13702,
                13754
            ],
            [
                13754,
                13954
            ],
            [
                13954,
                14144
            ],
            [
                14144,
                14264
            ],
            [
                14264,
                14379
            ],
            [
                14379,
                14526
            ],
            [
                14526,
                14603
            ],
            [
                14603,
                14949
            ],
            [
                14949,
                15123
            ],
            [
                15123,
                15158
            ],
            [
                15158,
                15204
            ],
            [
                15204,
                15391
            ],
            [
                15391,
                15618
            ],
            [
                15618,
                16064
            ],
            [
                16064,
                16309
            ],
            [
                16309,
                16654
            ],
            [
                16654,
                16901
            ],
            [
                16901,
                17060
            ],
            [
                17060,
                17410
            ],
            [
                17410,
                17474
            ],
            [
                17474,
                17666
            ],
            [
                17666,
                17898
            ],
            [
                17898,
                18081
            ],
            [
                18081,
                18142
            ],
            [
                18142,
                18265
            ],
            [
                18265,
                18561
            ],
            [
                18561,
                18627
            ],
            [
                18627,
                18697
            ],
            [
                18697,
                18868
            ],
            [
                18868,
                18898
            ],
            [
                18898,
                19169
            ],
            [
                19169,
                19218
            ],
            [
                19218,
                19370
            ],
            [
                19370,
                19410
            ],
            [
                19410,
                19437
            ],
            [
                19437,
                19454
            ],
            [
                19454,
                19501
            ],
            [
                19501,
                19541
            ],
            [
                19541,
                19610
            ],
            [
                19610,
                19836
            ],
            [
                19836,
                19885
            ],
            [
                19885,
                19903
            ],
            [
                19903,
                19921
            ],
            [
                19921,
                20134
            ],
            [
                20134,
                20368
            ],
            [
                20368,
                20748
            ],
            [
                20748,
                20815
            ],
            [
                20815,
                20838
            ],
            [
                20838,
                20984
            ],
            [
                20984,
                21006
            ],
            [
                21006,
                21089
            ],
            [
                21089,
                21415
            ],
            [
                21415,
                21466
            ],
            [
                21466,
                21509
            ],
            [
                21509,
                21527
            ],
            [
                21527,
                21555
            ],
            [
                21555,
                21570
            ],
            [
                21570,
                21624
            ],
            [
                21624,
                21734
            ],
            [
                21734,
                22188
            ],
            [
                22188,
                22257
            ],
            [
                22257,
                22516
            ],
            [
                22516,
                22719
            ],
            [
                22719,
                22936
            ],
            [
                22936,
                23018
            ],
            [
                23018,
                23343
            ],
            [
                23343,
                23379
            ],
            [
                23379,
                23421
            ],
            [
                23421,
                23462
            ],
            [
                23462,
                23552
            ],
            [
                23552,
                23556
            ],
            [
                23556,
                23583
            ],
            [
                23583,
                23633
            ],
            [
                23633,
                23643
            ],
            [
                23643,
                23662
            ],
            [
                23662,
                23671
            ],
            [
                23671,
                23725
            ],
            [
                23725,
                23735
            ],
            [
                23735,
                23766
            ],
            [
                23766,
                23807
            ],
            [
                23807,
                23836
            ],
            [
                23836,
                23883
            ],
            [
                23883,
                23914
            ],
            [
                23914,
                23946
            ],
            [
                23946,
                23956
            ],
            [
                23956,
                23960
            ],
            [
                23960,
                23979
            ],
            [
                23979,
                24013
            ],
            [
                24013,
                24035
            ],
            [
                24035,
                24048
            ],
            [
                24048,
                24110
            ],
            [
                24110,
                24189
            ],
            [
                24189,
                24393
            ],
            [
                24393,
                24421
            ],
            [
                24421,
                24475
            ],
            [
                24475,
                24528
            ],
            [
                24528,
                24555
            ],
            [
                24555,
                24596
            ],
            [
                24596,
                24621
            ],
            [
                24621,
                24661
            ],
            [
                24661,
                24714
            ],
            [
                24714,
                24739
            ],
            [
                24739,
                24759
            ],
            [
                24759,
                24865
            ],
            [
                24865,
                24870
            ],
            [
                24870,
                24898
            ],
            [
                24898,
                24916
            ],
            [
                24916,
                24938
            ],
            [
                24938,
                25082
            ],
            [
                25082,
                25208
            ],
            [
                25208,
                25292
            ],
            [
                25292,
                25313
            ],
            [
                25313,
                25331
            ],
            [
                25331,
                25341
            ],
            [
                25341,
                25372
            ],
            [
                25372,
                25388
            ],
            [
                25388,
                25512
            ],
            [
                25512,
                25681
            ],
            [
                25681,
                25916
            ],
            [
                25916,
                25926
            ],
            [
                25926,
                25984
            ],
            [
                25984,
                26173
            ],
            [
                26173,
                26368
            ],
            [
                26368,
                26450
            ],
            [
                26450,
                26546
            ],
            [
                26546,
                26579
            ],
            [
                26579,
                26673
            ],
            [
                26673,
                26826
            ],
            [
                26826,
                26899
            ],
            [
                26899,
                27116
            ],
            [
                27116,
                27159
            ],
            [
                27159,
                27291
            ],
            [
                27291,
                27525
            ],
            [
                27525,
                27626
            ],
            [
                27626,
                27820
            ],
            [
                27820,
                27988
            ],
            [
                27988,
                28299
            ],
            [
                28299,
                28389
            ],
            [
                28389,
                28562
            ],
            [
                28562,
                28854
            ],
            [
                28854,
                29022
            ],
            [
                29022,
                29225
            ],
            [
                29225,
                29397
            ],
            [
                29397,
                30026
            ],
            [
                30026,
                30278
            ],
            [
                30278,
                30525
            ],
            [
                30525,
                30586
            ],
            [
                30586,
                31075
            ],
            [
                31075,
                31258
            ],
            [
                31258,
                31746
            ],
            [
                31746,
                31844
            ],
            [
                31844,
                31985
            ],
            [
                31985,
                32120
            ],
            [
                32120,
                32184
            ],
            [
                32184,
                32282
            ],
            [
                32282,
                32384
            ],
            [
                32384,
                32475
            ],
            [
                32475,
                32557
            ],
            [
                32557,
                32573
            ],
            [
                32573,
                32585
            ],
            [
                32585,
                32728
            ],
            [
                32728,
                32841
            ]
        ],
        "overlap_chars": [
            [
                0,
                121
            ],
            [
                121,
                164
            ],
            [
                192,
                194
            ],
            [
                194,
                216
            ],
            [
                216,
                222
            ],
            [
                222,
                261
            ],
            [
                261,
                275
            ],
            [
                290,
                376
            ],
            [
                376,
                378
            ],
            [
                447,
                456
            ],
            [
                499,
                589
            ],
            [
                589,
                614
            ],
            [
                619,
                625
            ],
            [
                637,
                705
            ],
            [
                705,
                822
            ],
            [
                823,
                865
            ],
            [
                865,
                869
            ],
            [
                874,
                900
            ],
            [
                901,
                906
            ],
            [
                906,
                949
            ],
            [
                974,
                976
            ],
            [
                976,
                1056
            ],
            [
                1073,
                1077
            ],
            [
                1083,
                1097
            ],
            [
                1097,
                1099
            ],
            [
                1121,
                1151
            ],
            [
                1164,
                1179
            ],
            [
                1179,
                1209
            ],
            [
                1209,
                1224
            ],
            [
                1224,
                1250
            ],
            [
                1250,
                1263
            ],
            [
                1357,
                1396
            ],
            [
                1396,
                1405
            ],
            [
                1411,
                1419
            ],
            [
                1419,
                1459
            ],
            [
                1459,
                1483
            ],
            [
                1516,
                1526
            ],
            [
                1596,
                1598
            ],
            [
                1598,
                1661
            ],
            [
                1668,
                1701
            ],
            [
                1748,
                1768
            ],
            [
                1711,
                1716
            ],
            [
                1796,
                1822
            ],
            [
                1829,
                1841
            ],
            [
                1841,
                1859
            ],
            [
                1859,
                1879
            ],
            [
                1879,
                1885
            ],
            [
                1885,
                1907
            ],
            [
                1910,
                1958
            ],
            [
                1971,
                1992
            ],
            [
                1967,
                1970
            ],
            [
                1997,
                2044
            ],
            [
                2070,
                2074
            ],
            [
                2105,
                2119
            ],
            [
                2126,
                2128
            ],
            [
                2128,
                2133
            ],
            [
                2133,
                2179
            ],
            [
                2199,
                2229
            ],
            [
                2229,
                2260
            ],
            [
                2260,
                2275
            ],
            [
                2322,
                2338
            ],
            [
                2347,
                2349
            ],
            [
                2394,
                2408
            ],
            [
                2432,
                2449
            ],
            [
                2449,
                2452
            ],
            [
                2452,
                2541
            ],
            [
                2541,
                2595
            ],
            [
                2595,
                2615
            ],
            [
                2615,
                2644
            ],
            [
                2644,
                2698
            ],
            [
                2776,
                2779
            ],
            [
                2743,
                2745
            ],
            [
                2808,
                2810
            ],
            [
                2810,
                2832
            ],
            [
                2882,
                2924
            ],
            [
                2977,
                2983
            ],
            [
                2984,
                2992
            ],
            [
                2992,
                3042
            ],
            [
                3042,
                3065
            ],
            [
                3069,
                3102
            ],
            [
                3102,
                3139
            ],
            [
                3139,
                3181
            ],
            [
                3181,
                3223
            ],
            [
                3279,
                3281
            ],
            [
                3281,
                3334
            ],
            [
                3334,
                3413
            ],
            [
                3453,
                3473
            ],
            [
                3477,
                3544
            ],
            [
                3544,
                3581
            ],
            [
                3581,
                3593
            ],
            [
                3692,
                3706
            ],
            [
                3706,
                3781
            ],
            [
                3781,
                3802
            ],
            [
                3802,
                3832
            ],
            [
                3832,
                3849
            ],
            [
                3876,
                3889
            ],
            [
                3968,
                3970
            ],
            [
                3970,
                3974
            ],
            [
                4005,
                4007
            ],
            [
                3982,
                3987
            ],
            [
                4066,
                4071
            ],
            [
                4071,
                4098
            ],
            [
                4098,
                4111
            ],
            [
                4111,
                4135
            ],
            [
                4135,
                4153
            ],
            [
                4179,
                4181
            ],
            [
                4181,
                4182
            ],
            [
                4208,
                4244
            ],
            [
                4289,
                4324
            ],
            [
                4324,
                4405
            ],
            [
                4405,
                4417
            ],
            [
                4419,
                4434
            ],
            [
                4552,
                4554
            ],
            [
                4554,
                4614
            ],
            [
                4635,
                4664
            ],
            [
                4664,
                4677
            ],
            [
                4707,
                4723
            ],
            [
                4791,
                4792
            ],
            [
                4828,
                4881
            ],
            [
                4883,
                4897
            ],
            [
                4899,
                4939
            ],
            [
                4939,
                5042
            ],
            [
                5336,
                5338
            ],
            [
                5338,
                5408
            ],
            [
                5712,
                5718
            ],
            [
                5742,
                5766
            ],
            [
                5776,
                5794
            ],
            [
                5794,
                5891
            ],
            [
                5917,
                5958
            ],
            [
                5958,
                5994
            ],
            [
                5996,
                6021
            ],
            [
                6021,
                6106
            ],
            [
                6106,
                6111
            ],
            [
                6111,
                6169
            ],
            [
                6269,
                6271
            ],
            [
                6271,
                6283
            ],
            [
                6286,
                6289
            ],
            [
                6289,
                6319
            ],
            [
                6360,
                6366
            ],
            [
                6379,
                6411
            ],
            [
                6411,
                6427
            ],
            [
                6440,
                6455
            ],
            [
                6455,
                6495
            ],
            [
                6503,
                6529
            ],
            [
                6529,
                6556
            ],
            [
                6595,
                6597
            ],
            [
                6597,
                6650
            ],
            [
                6658,
                6660
            ],
            [
                6660,
                6676
            ],
            [
                6676,
                6689
            ],
            [
                6714,
                6761
            ],
            [
                6770,
                6773
            ],
            [
                6773,
                6799
            ],
            [
                6799,
                6802
            ],
            [
                6827,
                6843
            ],
            [
                6843,
                6877
            ],
            [
                6877,
                6916
            ],
            [
                6921,
                6927
            ],
            [
                6953,
                7035
            ],
            [
                7035,
                7087
            ],
            [
                7185,
                7187
            ],
            [
                7207,
                7260
            ],
            [
                7291,
                7294
            ],
            [
                7294,
                7331
            ],
            [
                7396,
                7405
            ],
            [
                7414,
                7418
            ],
            [
                8041,
                8068
            ],
            [
                8104,
                8138
            ],
            [
                8154,
                8183
            ],
            [
                8240,
                8295
            ],
            [
                8301,
                8304
            ],
            [
                8319,
                8405
            ],
            [
                8087,
                8088
            ],
            [
                8529,
                8538
            ],
            [
                8538,
                8592
            ],
            [
                8666,
                8668
            ],
            [
                8668,
                8722
            ],
            [
                8852,
                8886
            ],
            [
                8915,
                8917
            ],
            [
                9356,
                9473
            ],
            [
                9592,
                9597
            ],
            [
                9502,
                9506
            ],
            [
                9348,
                9351
            ],
            [
                9496,
                9501
            ],
            [
                9840,
                9947
            ],
            [
                9947,
                10009
            ],
            [
                10009,
                10024
            ],
            [
                10024,
                10079
            ],
            [
                10079,
                10141
            ],
            [
                10141,
                10162
            ],
            [
                10174,
                10196
            ],
            [
                10208,
                10336
            ],
            [
                10336,
                10447
            ],
            [
                10447,
                10448
            ],
            [
                10468,
                10515
            ],
            [
                10515,
                10544
            ],
            [
                10544,
                10636
            ],
            [
                10688,
                10690
            ],
            [
                10737,
                10776
            ],
            [
                10776,
                10886
            ],
            [
                11172,
                11241
            ],
            [
                11251,
                11287
            ],
            [
                11344,
                11380
            ],
            [
                11601,
                11695
            ],
            [
                11695,
                11706
            ],
            [
                11724,
                11762
            ],
            [
                11762,
                11786
            ],
            [
                11807,
                11810
            ],
            [
                11817,
                11824
            ],
            [
                11834,
                11836
            ],
            [
                11836,
                11866
            ],
            [
                11880,
                11890
            ],
            [
                11892,
                11941
            ],
            [
                11941,
                12039
            ],
            [
                12039,
                12120
            ],
            [
                12231,
                12232
            ],
            [
                12135,
                12142
            ],
            [
                12221,
                12227
            ],
            [
                12311,
                12313
            ],
            [
                12313,
                12327
            ],
            [
                12327,
                12391
            ],
            [
                12391,
                12437
            ],
            [
                12437,
                12482
            ],
            [
                12492,
                12497
            ],
            [
                12551,
                12555
            ],
            [
                12557,
                12597
            ],
            [
                12605,
                12609
            ],
            [
                12624,
                12626
            ],
            [
                12626,
                12637
            ],
            [
                12717,
                12736
            ],
            [
                12773,
                12775
            ],
            [
                12698,
                12706
            ],
            [
                12736,
                12772
            ],
            [
                12785,
                12856
            ],
            [
                13418,
                13453
            ],
            [
                13460,
                13465
            ],
            [
                13478,
                13548
            ],
            [
                13702,
                13752
            ],
            [
                13752,
                13754
            ],
            [
                14264,
                14294
            ],
            [
                14377,
                14379
            ],
            [
                14379,
                14398
            ],
            [
                14405,
                14409
            ],
            [
                14413,
                14438
            ],
            [
                14449,
                14473
            ],
            [
                14483,
                14500
            ],
            [
                14512,
                14526
            ],
            [
                14526,
                14603
            ],
            [
                14956,
                15056
            ],
            [
                15098,
                15121
            ],
            [
                15069,
                15070
            ],
            [
                15171,
                15179
            ],
            [
                15202,
                15204
            ],
            [
                15618,
                15624
            ],
            [
                15635,
                15683
            ],
            [
                15843,
                15886
            ],
            [
                16062,
                16064
            ],
            [
                16064,
                16214
            ],
            [
                16307,
                16309
            ],
            [
                16654,
                16831
            ],
            [
                16837,
                16853
            ],
            [
                16899,
                16901
            ],
            [
                16901,
                16932
            ],
            [
                17058,
                17060
            ],
            [
                17060,
                17124
            ],
            [
                17425,
                17429
            ],
            [
                17432,
                17437
            ],
            [
                17448,
                17474
            ],
            [
                17544,
                17552
            ],
            [
                17557,
                17624
            ],
            [
                17743,
                17746
            ],
            [
                17676,
                17696
            ],
            [
                17705,
                17713
            ],
            [
                17773,
                17774
            ],
            [
                17840,
                17847
            ],
            [
                17866,
                17880
            ],
            [
                17896,
                17898
            ],
            [
                17898,
                17973
            ],
            [
                18079,
                18081
            ],
            [
                18265,
                18388
            ],
            [
                18397,
                18510
            ],
            [
                18535,
                18561
            ],
            [
                18561,
                18626
            ],
            [
                19370,
                19386
            ],
            [
                19390,
                19410
            ],
            [
                19410,
                19437
            ],
            [
                19437,
                19453
            ],
            [
                19501,
                19541
            ],
            [
                19541,
                19549
            ],
            [
                19566,
                19610
            ],
            [
                19610,
                19632
            ],
            [
                19644,
                19737
            ],
            [
                19790,
                19798
            ],
            [
                19834,
                19836
            ],
            [
                19836,
                19885
            ],
            [
                19885,
                19903
            ],
            [
                19903,
                19921
            ],
            [
                19921,
                19958
            ],
            [
                19989,
                20133
            ],
            [
                20970,
                20973
            ],
            [
                20945,
                20946
            ],
            [
                20840,
                20856
            ],
            [
                20887,
                20910
            ],
            [
                20982,
                20984
            ],
            [
                20984,
                21006
            ],
            [
                21006,
                21088
            ],
            [
                21089,
                21090
            ],
            [
                21097,
                21114
            ],
            [
                21131,
                21164
            ],
            [
                21184,
                21213
            ],
            [
                21227,
                21240
            ],
            [
                21245,
                21307
            ],
            [
                21413,
                21415
            ],
            [
                21418,
                21425
            ],
            [
                21450,
                21466
            ],
            [
                21466,
                21476
            ],
            [
                21477,
                21491
            ],
            [
                21520,
                21525
            ],
            [
                21525,
                21527
            ],
            [
                21570,
                21622
            ],
            [
                21624,
                21671
            ],
            [
                21691,
                21734
            ],
            [
                21734,
                21763
            ],
            [
                21804,
                21829
            ],
            [
                21832,
                21858
            ],
            [
                22088,
                22104
            ],
            [
                21795,
                21796
            ],
            [
                22106,
                22151
            ],
            [
                21910,
                21911
            ],
            [
                22153,
                22188
            ],
            [
                22445,
                22448
            ],
            [
                22257,
                22382
            ],
            [
                22409,
                22410
            ],
            [
                22516,
                22573
            ],
            [
                23018,
                23041
            ],
            [
                23068,
                23167
            ],
            [
                23169,
                23340
            ],
            [
                23421,
                23451
            ],
            [
                23460,
                23462
            ],
            [
                23506,
                23507
            ],
            [
                23520,
                23552
            ],
            [
                23552,
                23556
            ],
            [
                23556,
                23583
            ],
            [
                23583,
                23633
            ],
            [
                23680,
                23725
            ],
            [
                23725,
                23735
            ],
            [
                23735,
                23766
            ],
            [
                23766,
                23807
            ],
            [
                23836,
                23883
            ],
            [
                23883,
                23914
            ],
            [
                23946,
                23956
            ],
            [
                23956,
                23958
            ],
            [
                23960,
                23979
            ],
            [
                23979,
                24013
            ],
            [
                24013,
                24035
            ],
            [
                24048,
                24110
            ],
            [
                24110,
                24189
            ],
            [
                24189,
                24342
            ],
            [
                24368,
                24393
            ],
            [
                24393,
                24421
            ],
            [
                24421,
                24474
            ],
            [
                24596,
                24621
            ],
            [
                24621,
                24661
            ],
            [
                24714,
                24739
            ],
            [
                24756,
                24759
            ],
            [
                24759,
                24772
            ],
            [
                24863,
                24864
            ],
            [
                24870,
                24898
            ],
            [
                24898,
                24916
            ],
            [
                24916,
                24938
            ],
            [
                24938,
                25082
            ],
            [
                25082,
                25116
            ],
            [
                25147,
                25208
            ],
            [
                25208,
                25292
            ],
            [
                25292,
                25313
            ],
            [
                25313,
                25331
            ],
            [
                25331,
                25341
            ],
            [
                25341,
                25372
            ],
            [
                25372,
                25388
            ],
            [
                25388,
                25429
            ],
            [
                25450,
                25452
            ],
            [
                25446,
                25449
            ],
            [
                25430,
                25445
            ],
            [
                25475,
                25498
            ],
            [
                25499,
                25512
            ],
            [
                25512,
                25564
            ],
            [
                25629,
                25681
            ],
            [
                25681,
                25752
            ],
            [
                25770,
                25916
            ],
            [
                25916,
                25926
            ],
            [
                25926,
                25984
            ],
            [
                25984,
                26173
            ],
            [
                26173,
                26250
            ],
            [
                26257,
                26303
            ],
            [
                26340,
                26368
            ],
            [
                26368,
                26450
            ],
            [
                26546,
                26579
            ],
            [
                26579,
                26673
            ],
            [
                26673,
                26739
            ],
            [
                26741,
                26754
            ],
            [
                26758,
                26826
            ],
            [
                26826,
                26834
            ],
            [
                26842,
                26884
            ],
            [
                26941,
                26965
            ],
            [
                27114,
                27116
            ],
            [
                27589,
                27593
            ],
            [
                27529,
                27540
            ],
            [
                27541,
                27584
            ],
            [
                27624,
                27625
            ],
            [
                28389,
                28534
            ],
            [
                28540,
                28561
            ],
            [
                30636,
                30647
            ],
            [
                30723,
                30731
            ],
            [
                30766,
                30816
            ],
            [
                31073,
                31075
            ],
            [
                31258,
                31372
            ],
            [
                31631,
                31632
            ],
            [
                31490,
                31569
            ],
            [
                31744,
                31746
            ],
            [
                31746,
                31844
            ],
            [
                31844,
                31903
            ],
            [
                31983,
                31984
            ],
            [
                32184,
                32282
            ],
            [
                32282,
                32344
            ],
            [
                32364,
                32384
            ],
            [
                32384,
                32475
            ],
            [
                32475,
                32477
            ],
            [
                32510,
                32524
            ],
            [
                32539,
                32557
            ],
            [
                32557,
                32573
            ],
            [
                32573,
                32585
            ],
            [
                32585,
                32728
            ],
            [
                32728,
                32797
            ],
            [
                32806,
                32841
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                194
            ],
            [
                194,
                216
            ],
            [
                216,
                222
            ],
            [
                222,
                261
            ],
            [
                261,
                277
            ],
            [
                277,
                290
            ],
            [
                290,
                378
            ],
            [
                378,
                447
            ],
            [
                447,
                589
            ],
            [
                589,
                705
            ],
            [
                705,
                823
            ],
            [
                823,
                865
            ],
            [
                865,
                901
            ],
            [
                901,
                906
            ],
            [
                906,
                976
            ],
            [
                976,
                1056
            ],
            [
                1056,
                1099
            ],
            [
                1099,
                1179
            ],
            [
                1179,
                1209
            ],
            [
                1209,
                1224
            ],
            [
                1224,
                1250
            ],
            [
                1250,
                1264
            ],
            [
                1264,
                1357
            ],
            [
                1357,
                1396
            ],
            [
                1396,
                1419
            ],
            [
                1419,
                1459
            ],
            [
                1459,
                1485
            ],
            [
                1485,
                1516
            ],
            [
                1516,
                1598
            ],
            [
                1598,
                1661
            ],
            [
                1661,
                1668
            ],
            [
                1668,
                1703
            ],
            [
                1703,
                1711
            ],
            [
                1711,
                1841
            ],
            [
                1841,
                1859
            ],
            [
                1859,
                1879
            ],
            [
                1879,
                1885
            ],
            [
                1885,
                2128
            ],
            [
                2128,
                2133
            ],
            [
                2133,
                2229
            ],
            [
                2229,
                2260
            ],
            [
                2260,
                2349
            ],
            [
                2349,
                2366
            ],
            [
                2366,
                2394
            ],
            [
                2394,
                2452
            ],
            [
                2452,
                2541
            ],
            [
                2541,
                2595
            ],
            [
                2595,
                2615
            ],
            [
                2615,
                2644
            ],
            [
                2644,
                2810
            ],
            [
                2810,
                2992
            ],
            [
                2992,
                3042
            ],
            [
                3042,
                3102
            ],
            [
                3102,
                3139
            ],
            [
                3139,
                3181
            ],
            [
                3181,
                3281
            ],
            [
                3281,
                3334
            ],
            [
                3334,
                3413
            ],
            [
                3413,
                3453
            ],
            [
                3453,
                3544
            ],
            [
                3544,
                3581
            ],
            [
                3581,
                3593
            ],
            [
                3593,
                3615
            ],
            [
                3615,
                3622
            ],
            [
                3622,
                3692
            ],
            [
                3692,
                3706
            ],
            [
                3706,
                3781
            ],
            [
                3781,
                3802
            ],
            [
                3802,
                3832
            ],
            [
                3832,
                3970
            ],
            [
                3970,
                4071
            ],
            [
                4071,
                4098
            ],
            [
                4098,
                4111
            ],
            [
                4111,
                4135
            ],
            [
                4135,
                4181
            ],
            [
                4181,
                4324
            ],
            [
                4324,
                4405
            ],
            [
                4405,
                4554
            ],
            [
                4554,
                4664
            ],
            [
                4664,
                4678
            ],
            [
                4678,
                4707
            ],
            [
                4707,
                4939
            ],
            [
                4939,
                5338
            ],
            [
                5338,
                5408
            ],
            [
                5408,
                5468
            ],
            [
                5468,
                5545
            ],
            [
                5545,
                5581
            ],
            [
                5581,
                5712
            ],
            [
                5712,
                5794
            ],
            [
                5794,
                5958
            ],
            [
                5958,
                6021
            ],
            [
                6021,
                6106
            ],
            [
                6106,
                6111
            ],
            [
                6111,
                6271
            ],
            [
                6271,
                6289
            ],
            [
                6289,
                6411
            ],
            [
                6411,
                6455
            ],
            [
                6455,
                6529
            ],
            [
                6529,
                6597
            ],
            [
                6597,
                6660
            ],
            [
                6660,
                6676
            ],
            [
                6676,
                6773
            ],
            [
                6773,
                6799
            ],
            [
                6799,
                6843
            ],
            [
                6843,
                6877
            ],
            [
                6877,
                7035
            ],
            [
                7035,
                7087
            ],
            [
                7087,
                7106
            ],
            [
                7106,
                7185
            ],
            [
                7185,
                7294
            ],
            [
                7294,
                7453
            ],
            [
                7453,
                7524
            ],
            [
                7524,
                7533
            ],
            [
                7533,
                7579
            ],
            [
                7579,
                7647
            ],
            [
                7647,
                7863
            ],
            [
                7863,
                7996
            ],
            [
                7996,
                8017
            ],
            [
                8017,
                8040
            ],
            [
                8040,
                8538
            ],
            [
                8538,
                8668
            ],
            [
                8668,
                8917
            ],
            [
                8917,
                9098
            ],
            [
                9098,
                9175
            ],
            [
                9175,
                9224
            ],
            [
                9224,
                9232
            ],
            [
                9232,
                9322
            ],
            [
                9322,
                9336
            ],
            [
                9336,
                9642
            ],
            [
                9642,
                9840
            ],
            [
                9840,
                9947
            ],
            [
                9947,
                10009
            ],
            [
                10009,
                10024
            ],
            [
                10024,
                10079
            ],
            [
                10079,
                10141
            ],
            [
                10141,
                10196
            ],
            [
                10196,
                10336
            ],
            [
                10336,
                10447
            ],
            [
                10447,
                10515
            ],
            [
                10515,
                10544
            ],
            [
                10544,
                10690
            ],
            [
                10690,
                10776
            ],
            [
                10776,
                10887
            ],
            [
                10887,
                11172
            ],
            [
                11172,
                11695
            ],
            [
                11695,
                11762
            ],
            [
                11762,
                11836
            ],
            [
                11836,
                11941
            ],
            [
                11941,
                12039
            ],
            [
                12039,
                12313
            ],
            [
                12313,
                12327
            ],
            [
                12327,
                12391
            ],
            [
                12391,
                12437
            ],
            [
                12437,
                12626
            ],
            [
                12626,
                12856
            ],
            [
                12856,
                13104
            ],
            [
                13104,
                13418
            ],
            [
                13418,
                13548
            ],
            [
                13548,
                13702
            ],
            [
                13702,
                13754
            ],
            [
                13754,
                13954
            ],
            [
                13954,
                14144
            ],
            [
                14144,
                14264
            ],
            [
                14264,
                14379
            ],
            [
                14379,
                14526
            ],
            [
                14526,
                14603
            ],
            [
                14603,
                14949
            ],
            [
                14949,
                15204
            ],
            [
                15204,
                15391
            ],
            [
                15391,
                15618
            ],
            [
                15618,
                16064
            ],
            [
                16064,
                16309
            ],
            [
                16309,
                16654
            ],
            [
                16654,
                16901
            ],
            [
                16901,
                17060
            ],
            [
                17060,
                17474
            ],
            [
                17474,
                17898
            ],
            [
                17898,
                18081
            ],
            [
                18081,
                18142
            ],
            [
                18142,
                18265
            ],
            [
                18265,
                18561
            ],
            [
                18561,
                18627
            ],
            [
                18627,
                18697
            ],
            [
                18697,
                18868
            ],
            [
                18868,
                18898
            ],
            [
                18898,
                19169
            ],
            [
                19169,
                19218
            ],
            [
                19218,
                19370
            ],
            [
                19370,
                19410
            ],
            [
                19410,
                19437
            ],
            [
                19437,
                19454
            ],
            [
                19454,
                19501
            ],
            [
                19501,
                19541
            ],
            [
                19541,
                19610
            ],
            [
                19610,
                19836
            ],
            [
                19836,
                19885
            ],
            [
                19885,
                19903
            ],
            [
                19903,
                19921
            ],
            [
                19921,
                20134
            ],
            [
                20134,
                20368
            ],
            [
                20368,
                20748
            ],
            [
                20748,
                20815
            ],
            [
                20815,
                20838
            ],
            [
                20838,
                20984
            ],
            [
                20984,
                21006
            ],
            [
                21006,
                21089
            ],
            [
                21089,
                21415
            ],
            [
                21415,
                21466
            ],
            [
                21466,
                21527
            ],
            [
                21527,
                21555
            ],
            [
                21555,
                21570
            ],
            [
                21570,
                21624
            ],
            [
                21624,
                21734
            ],
            [
                21734,
                22188
            ],
            [
                22188,
                22257
            ],
            [
                22257,
                22516
            ],
            [
                22516,
                22719
            ],
            [
                22719,
                22936
            ],
            [
                22936,
                23018
            ],
            [
                23018,
                23343
            ],
            [
                23343,
                23379
            ],
            [
                23379,
                23421
            ],
            [
                23421,
                23462
            ],
            [
                23462,
                23552
            ],
            [
                23552,
                23556
            ],
            [
                23556,
                23583
            ],
            [
                23583,
                23633
            ],
            [
                23633,
                23643
            ],
            [
                23643,
                23662
            ],
            [
                23662,
                23671
            ],
            [
                23671,
                23725
            ],
            [
                23725,
                23735
            ],
            [
                23735,
                23766
            ],
            [
                23766,
                23807
            ],
            [
                23807,
                23836
            ],
            [
                23836,
                23883
            ],
            [
                23883,
                23914
            ],
            [
                23914,
                23946
            ],
            [
                23946,
                23956
            ],
            [
                23956,
                23979
            ],
            [
                23979,
                24013
            ],
            [
                24013,
                24035
            ],
            [
                24035,
                24048
            ],
            [
                24048,
                24110
            ],
            [
                24110,
                24189
            ],
            [
                24189,
                24393
            ],
            [
                24393,
                24421
            ],
            [
                24421,
                24475
            ],
            [
                24475,
                24528
            ],
            [
                24528,
                24555
            ],
            [
                24555,
                24596
            ],
            [
                24596,
                24621
            ],
            [
                24621,
                24661
            ],
            [
                24661,
                24714
            ],
            [
                24714,
                24739
            ],
            [
                24739,
                24759
            ],
            [
                24759,
                24865
            ],
            [
                24865,
                24870
            ],
            [
                24870,
                24898
            ],
            [
                24898,
                24916
            ],
            [
                24916,
                24938
            ],
            [
                24938,
                25082
            ],
            [
                25082,
                25208
            ],
            [
                25208,
                25292
            ],
            [
                25292,
                25313
            ],
            [
                25313,
                25331
            ],
            [
                25331,
                25341
            ],
            [
                25341,
                25372
            ],
            [
                25372,
                25388
            ],
            [
                25388,
                25512
            ],
            [
                25512,
                25681
            ],
            [
                25681,
                25916
            ],
            [
                25916,
                25926
            ],
            [
                25926,
                25984
            ],
            [
                25984,
                26173
            ],
            [
                26173,
                26368
            ],
            [
                26368,
                26450
            ],
            [
                26450,
                26546
            ],
            [
                26546,
                26579
            ],
            [
                26579,
                26673
            ],
            [
                26673,
                26826
            ],
            [
                26826,
                27116
            ],
            [
                27116,
                27159
            ],
            [
                27159,
                27291
            ],
            [
                27291,
                27525
            ],
            [
                27525,
                27626
            ],
            [
                27626,
                27820
            ],
            [
                27820,
                27988
            ],
            [
                27988,
                28299
            ],
            [
                28299,
                28389
            ],
            [
                28389,
                28562
            ],
            [
                28562,
                28854
            ],
            [
                28854,
                29022
            ],
            [
                29022,
                29225
            ],
            [
                29225,
                29397
            ],
            [
                29397,
                30026
            ],
            [
                30026,
                30278
            ],
            [
                30278,
                30525
            ],
            [
                30525,
                30586
            ],
            [
                30586,
                31075
            ],
            [
                31075,
                31258
            ],
            [
                31258,
                31746
            ],
            [
                31746,
                31844
            ],
            [
                31844,
                31985
            ],
            [
                31985,
                32120
            ],
            [
                32120,
                32184
            ],
            [
                32184,
                32282
            ],
            [
                32282,
                32384
            ],
            [
                32384,
                32475
            ],
            [
                32475,
                32557
            ],
            [
                32557,
                32573
            ],
            [
                32573,
                32585
            ],
            [
                32585,
                32728
            ],
            [
                32728,
                32841
            ]
        ]
    },
    "abridged": {
        "text": "A touch on the lawyer's wrinkled hand as he stands in the dark room, irresolute, makes him start and say, \"What's that?\"\n\"It's me,\" returns the old man of the house. \"Can't you wake him?\"\n\"No.\"\n\"What have you done with your candle?\"\n\"It's gone out.\"\nKrook takes it, goes to the fire, stoops over the red embers, and tries to get a light, in vain. Muttering that he will go downstairs and bring a lighted candle from the shop, the old man departs. Mr. Tulkinghorn, for some reason, does not await his return in the room, but on the stairs outside.\nThe welcome light soon shines upon the wall, as Krook comes slowly up with his green-eyed cat following at his heels.\n\"Does the man generally sleep like this?\" inquires the lawyer in a low voice.\n\"Hi! I don't know,\" says Krook, shaking his head. \"I know next to nothing of his habits except that he keeps himself very close.\"\nThey go in together with the light. The great eyes in the shutters seem to close. Not so the eyes upon the bed.\n\"God save us!\" exclaims Mr. Tulkinghorn. \"He is dead!\"\nThey look at one another for a moment.\n\"Send for a doctor! Call for Miss Flite up the stairs, sir. Here's poison by the bed!\" says Krook.\nMr. Tulkinghorn hurries to the landing and calls, \"Miss Flite! Make haste, here, whoever you are!\" While he is calling, Krook steals across to the old portmanteau and back again.\n\"Run, Flite, run! The nearest doctor! Run!\" So Mr. Krook addresses the crazy little woman who is his female lodger, who vanishes in a breath, and soon returns accompanied by a testy medical man with a broad Scotch accent.\n\"Ey! Bless the hearts o' ye,\" says the medical man, after a moment's examination. \"He's just as dead as Phairy!\"\nMr. Tulkinghorn asks how long he has been dead.\n\"It's probable aboot three hours, sir.\"\n\"About that time, I should say,\" observes a dark young man on the other side of the bed.\n\"Air you in the maydickle prayfession yourself, sir?\" inquires the first.\nThe dark young man says yes.\n\"Then I'll just tak' my depairture,\" replies the other; and he leaves.\nThe dark young surgeon carefully examines the law-writer, who has now indeed become No one.\n\"I knew this person by sight very well,\" says he. \"He has purchased opium from me for the last year and a half. Was anybody present related to him?\" glancing round upon the three bystanders.\n\"I was his landlord,\" grimly answers Krook. \"He told me once I was the nearest relation he had.\"\n\"He has died,\" says the surgeon, \"of an over-dose of opium, there is no doubt. There is enough here,\" taking an old tea-pot from Mr. Krook, \"to kill a dozen people.\"\n\"Do you think he did it on purpose?\" asks Krook.\n\"I can't say. I should think it unlikely, as he has been in the habit of taking so much. But nobody can tell. He was very poor, I suppose?\"\n\"I suppose he was,\" says Krook. \"But he never told me.\"\n\"Did he owe you any rent?\"\n\"Six weeks.\"\n\"He will never pay it!\" says the young man. \"He is indeed as dead as Pharaoh; and I should think it a happy release. Yet he must have been a good figure when a youth, and I dare say, good-looking.\" He says this not unfeelingly. \"I recollect once thinking there was something in his manner that denoted a fall in life. Was that so?\"\nKrook replies, \"I only know that he was my lodger for a year and a half and lived - or didn't live - by law-writing, I know no more of him.\"\nDuring this dialogue Mr. Tulkinghorn has stood aloof by the old portmanteau, with his hands behind him, apparently unmoved. His imperturbable face has been as inexpressive as his rusty clothes. He now addresses the young surgeon in his professional way.\n\"I looked in here,\" he observes, \"just before you, with the intention of giving this deceased man some employment at his trade of copying. I had heard of him from my stationer - Snagsby of Cook's Court. Since no one here knows anything about him, it might be as well to send for Snagsby. Ah!\" to the little crazy woman, who has often seen him in court. \"Suppose you go for him!\"\nWhile she is gone, the surgeon covers the body with the patchwork counterpane. Mr. Krook and he exchange a word or two. Mr. Tulkinghorn says nothing, but stands near the old portmanteau.\nMr. Snagsby arrives hastily. \"Dear me, dear me,\" he says; \"and it has come to this! Bless my soul!\"\n\"Can you give us any information about this unfortunate creature?\" inquires Mr. Tulkinghorn. \"He owed rent, it seems. And he must be buried, you know.\"\n\"Well, sir,\" says Mr. Snagsby, coughing apologetically, \"I really don't know what advice I could offer, except sending for the beadle.\"\n\"I don't speak of advice,\" returns Mr. Tulkinghorn. \"I am asking for some clue to his connexions, or to where he came from.\"\n\"I assure you, sir,\" says Mr. Snagsby, \"that I don't know. About a year and a half ago he came into our place one morning, and finding my little woman in our shop, produced a specimen of his handwriting and told her that he was in want of copying work to do and was, not to put too fine a point upon it, hard up! My little woman is not in general partial to strangers. But she was rather took by something about this person; and she accepted of the specimen. He gradually fell into job-work at our place; and that is the most I know of him except that he was a quick hand, and would work through the night.\"\n\"Hadn't you better see,\" says Mr. Tulkinghorn to Krook, \"whether he had any papers that may enlighten you? There will be an inquest, and you will be asked the question. You can read?\"\n\"No, I can't,\" returns the old man with a sudden grin.\n\"Snagsby,\" says Mr. Tulkinghorn, \"look over the room for him. He will get into some difficulty otherwise. I'll wait if you make haste, and then I can testify on his behalf, if it should ever be necessary, that all was fair and right. If you will hold the candle for Mr. Snagsby, my friend, he'll soon see whether there is anything to help you.\"\n\"Here's an old portmanteau, sir,\" says Snagsby.\nAh, to be sure, so there is! Mr. Tulkinghorn does not appear to have seen it before, though he is standing so close to it.\nThe law-stationer conducts the search. The surgeon leans against the corner of the chimney-piece; Miss Flite peeps and trembles just within the door.\nThere are some worthless articles of clothing in the old portmanteau; a bundle of pawnbrokers' duplicates, a crumpled paper, smelling of opium, a few dirty scraps of newspapers, all referring to coroners' inquests; there is nothing else. They search the drawer of the ink-splashed table. There is not a morsel of any writing. The young surgeon examines the law-writer's clothes; a knife and some odd halfpence are all he finds. Mr. Snagsby's suggestion is the practical suggestion after all, and the beadle must be called in.\nSo the little crazy lodger goes for the beadle, and the rest come out of the room, driving the cat before them.\n\"Good night!\" says Mr. Tulkinghorn, and goes home to Allegory and meditation.\nBy this time the news has got into the court. Groups of its inhabitants assemble to discuss it, and several boys are pushed forward to Mr. Krook's window to see what they can. A policeman stands like a tower at the door, only condescending to see the boys occasionally; but whenever he does see them, they quail and fall back. People talk across the court out of windows, and scouts come hurrying in from Chancery Lane to know what's the matter. In the midst of this sensation, the beadle arrives and goes in.\nBy and by the beadle comes out. He is understood to want witnesses for the inquest tomorrow who can tell the coroner anything whatever about the deceased. Is immediately referred to innumerable people who can tell nothing whatever. The beadle goes into various shops and parlours, examining the inhabitants, always shutting the door first, and exasperating the public, who lose interest. So the excitement dies off for the time; and the unmoved policeman pursues his lounging way with a heavy tread.\nUnder cover of the night, the feeble-minded beadle comes flitting about Chancery Lane with his summonses, in which every juror's name is wrongly spelt. And all that night the coffin stands ready by the old portmanteau; and the lonely figure on the bed, whose path in life has lain through five and forty years, lies there with no track behind him.\nNext day the court is all alive. The coroner is to sit in the first-floor room at the Sol's Arms, which does brisk business all the morning. A pieman has established himself for the occasion at the corner of the court; and the beadle, hovering at the door, accepts a glass of ale.\nAt the appointed hour arrives the coroner, for whom the jurymen are waiting. He is conducted by the beadle and the landlord to the Harmonic Meeting Room, where he puts his hat on the piano and takes a chair at the head of a long table formed of several short tables put together and ornamented with glutinous rings made by pots and glasses. As many of the jury as can crowd together at the table sit there.\n\"Well, gentlemen-\" the coroner begins.\n\"Silence there, will you!\" says the beadle.\n\"Well, gentlemen,\" resumes the coroner. \"You are to inquire into the death of a certain man. Evidence will be given as to the circumstances attending that death, and you will give your verdict according to the evidence. The first thing to be done is to view the body.\"\n\"Make way there!\" cries the beadle.\nSo they go out in a loose procession, like a straggling funeral, and make their inspection in Mr. Krook's back second floor, from which a few of the jurymen retire pale and precipitately.\nWhen the jurymen return, Mr. Tulkinghorn is seated near the coroner. The inquiry proceeds. The jury learn how the subject of their inquiry died, and learn no more about him.\n\"This eminent solicitor, gentlemen,\" says the coroner, \"was accidentally present when the death was discovered, but he could only repeat the evidence you have already heard. Does anybody here know anything more?\"\nMrs. Piper is pushed forward, and sworn in.\n\"Now, Mrs. Piper, what have you got to say about this?\"\nWhy, Mrs. Piper has a good deal to say, chiefly without punctuation, but not much to tell. Mrs. Piper lives in the court and it has long been well known among the neighbours as the plaintive - so Mrs. Piper insists on calling the deceased - was reported to have sold himself. She see the plaintive often and considered as his air was feariocious and not to be allowed to go about some children being timid. Has seen the plaintive wexed and worrited by the children. Has seen him hurry away as if not partial to children and never see him speak to neither child nor grown person at any time excepting the boy that sweeps the crossing down the lane over the way round the corner which if he was here would tell you that he has been seen a-speaking to him frequent.\nSays the coroner, go and fetch that boy. While waiting, he converses with Mr. Tulkinghorn.\nOh! Here's the boy, gentlemen!\nHere he is, very muddy, very hoarse, very ragged. He must be put through a few preliminary paces.\nName, Jo. Nothing else that he knows on. Don't know that everybody has two names. Don't know that Jo is short for a longer name. Thinks it long enough for him. Spell it? No, he can't spell it. No father, no mother, no friends. Never been to school. Knows a broom's a broom, and knows it's wicked to tell a lie. Don't recollect who told him about the broom or about the lie, but knows both. Can't exactly say what'll be done to him arter he's dead if he tells a lie to the gentlemen here, but believes it'll be something wery bad to punish him, so he'll tell the truth.\n\"This won't do, gentlemen!\" says the coroner with a melancholy shake of the head. \"You have heard the boy. 'Can't exactly say' won't do, you know. It's terrible depravity. We can't take his evidence.\"\nBoy put aside. Is there any other witness? No other witness.\nVery well, gentlemen! Here's a man unknown, proved to have been in the habit of taking opium in large quantities for a year and a half, found dead of too much opium. If you think you have any evidence that he committed suicide, you will come to that conclusion. If you think it is a case of accidental death, you will find a verdict accordingly.\nVerdict accordingly. Accidental death. No doubt. Gentlemen, you are discharged. Good afternoon.\nWhile the coroner buttons his great-coat, he and Mr. Tulkinghorn speak privately to the rejected witness, Jo, in a corner.\nThat graceless creature only knows that the dead man was sometimes hooted and pursued about the streets. That one cold winter night when he, the boy, was shivering in a doorway, the man turned to look at him, and came back, and having questioned him and found that he had not a friend in the world, said, \"Neither have I. Not one!\" and gave him the price of a supper and a night's lodging. That the man had often spoken to him since and asked him whether he slept sound at night, and how he bore cold and hunger, and whether he ever wished to die, and similar strange questions. That when the man had no money, he would say in passing, \"I am as poor as you today, Jo,\" but that when he had any, he had always been glad to give him some.\n\"He was wery good to me,\" says the boy, wiping his eyes with his wretched sleeve. \"He wos wery good to me, he wos!\"\nAs he shuffles downstairs, Mr. Snagsby, lying in wait for him, puts a half-crown in his hand. \"If you ever see me coming past your crossing with my little woman - I mean a lady-\" says Mr. Snagsby with his finger on his nose, \"don't allude to it!\"\nFor some time the jurymen hang about the Sol's Arms in a cloud of pipe-smoke. Then, gradually, the Sol's Arms melts into the shadowy night.\nThen there is rest around the lonely figure, now laid in its last earthly habitation; and it is watched by the gaunt eyes in the shutters through the quiet hours of night.\nIn the morning the body is taken to a hemmed-in churchyard, pestiferous and obscene. With houses looking on, on every side, save where a reeking little tunnel of a court gives access to the iron gate - here they lower our dear brother down a foot or two, here sow him in corruption.\nCome night, come darkness, for you cannot come too soon or stay too long by such a place as this! Come, straggling lights into the windows of the ugly houses!\nWith the night comes a slouching figure through the tunnel-court to the outside of the iron gate. It holds the gate with its hands and looks in between the bars for a little while.\nIt then, with an old broom it carries, softly sweeps the step and makes the archway clean. It looks in again, and so departs.\nJo, is it thou? Well, well! Though a rejected witness, who \"can't exactly say\" what will be done to him in greater hands than men's, thou art not quite in outer darkness. There is something like a distant ray of light in thy muttered reason: \"He wos wery good to me, he wos!\"",
        "paragraph_chars": [
            [
                0,
                121
            ],
            [
                121,
                188
            ],
            [
                188,
                194
            ],
            [
                194,
                233
            ],
            [
                233,
                250
            ],
            [
                250,
                547
            ],
            [
                547,
                665
            ],
            [
                665,
                743
            ],
            [
                743,
                873
            ],
            [
                873,
                985
            ],
            [
                985,
                1040
            ],
            [
                1040,
                1079
            ],
            [
                1079,
                1178
            ],
            [
                1178,
                1357
            ],
            [
                1357,
                1579
            ],
            [
                1579,
                1692
            ],
            [
                1692,
                1740
            ],
            [
                1740,
                1780
            ],
            [
                1780,
                1869
            ],
            [
                1869,
                1943
            ],
            [
                1943,
                1972
            ],
            [
                1972,
                2043
            ],
            [
                2043,
                2135
            ],
            [
                2135,
                2326
            ],
            [
                2326,
                2423
            ],
            [
                2423,
                2589
            ],
            [
                2589,
                2638
            ],
            [
                2638,
                2778
            ],
            [
                2778,
                2834
            ],
            [
                2834,
                2861
            ],
            [
                2861,
                2874
            ],
            [
                2874,
                3206
            ],
            [
                3206,
                3347
            ],
            [
                3347,
                3601
            ],
            [
                3601,
                3980
            ],
            [
                3980,
                4167
            ],
            [
                4167,
                4267
            ],
            [
                4267,
                4419
            ],
            [
                4419,
                4555
            ],
            [
                4555,
                4680
            ],
            [
                4680,
                5288
            ],
            [
                5288,
                5472
            ],
            [
                5472,
                5527
            ],
            [
                5527,
                5872
            ],
            [
                5872,
                5920
            ],
            [
                5920,
                6043
            ],
            [
                6043,
                6193
            ],
            [
                6193,
                6719
            ],
            [
                6719,
                6831
            ],
            [
                6831,
                6909
            ],
            [
                6909,
                7419
            ],
            [
                7419,
                7919
            ],
            [
                7919,
                8267
            ],
            [
                8267,
                8548
            ],
            [
                8548,
                8955
            ],
            [
                8955,
                8994
            ],
            [
                8994,
                9038
            ],
            [
                9038,
                9307
            ],
            [
                9307,
                9343
            ],
            [
                9343,
                9531
            ],
            [
                9531,
                9705
            ],
            [
                9705,
                9918
            ],
            [
                9918,
                9962
            ],
            [
                9962,
                10018
            ],
            [
                10018,
                10781
            ],
            [
                10781,
                10872
            ],
            [
                10872,
                10903
            ],
            [
                10903,
                11001
            ],
            [
                11001,
                11570
            ],
            [
                11570,
                11771
            ],
            [
                11771,
                11832
            ],
            [
                11832,
                12178
            ],
            [
                12178,
                12274
            ],
            [
                12274,
                12397
            ],
            [
                12397,
                13134
            ],
            [
                13134,
                13250
            ],
            [
                13250,
                13497
            ],
            [
                13497,
                13637
            ],
            [
                13637,
                13809
            ],
            [
                13809,
                14092
            ],
            [
                14092,
                14251
            ],
            [
                14251,
                14432
            ],
            [
                14432,
                14558
            ],
            [
                14558,
                14833
            ]
        ],
        "segment_chars": [
            [
                0,
                121
            ],
            [
                121,
                166
            ],
            [
                166,
                188
            ],
            [
                188,
                194
            ],
            [
                194,
                233
            ],
            [
                233,
                250
            ],
            [
                250,
                347
            ],
            [
                347,
                447
            ],
            [
                447,
                547
            ],
            [
                547,
                665
            ],
            [
                665,
                707
            ],
            [
                707,
                743
            ],
            [
                743,
                748
            ],
            [
                748,
                793
            ],
            [
                793,
                873
            ],
            [
                873,
                909
            ],
            [
                909,
                955
            ],
            [
                955,
                985
            ],
            [
                985,
                1000
            ],
            [
                1000,
                1026
            ],
            [
                1026,
                1040
            ],
            [
                1040,
                1079
            ],
            [
                1079,
                1099
            ],
            [
                1099,
                1139
            ],
            [
                1139,
                1166
            ],
            [
                1166,
                1178
            ],
            [
                1178,
                1241
            ],
            [
                1241,
                1277
            ],
            [
                1277,
                1357
            ],
            [
                1357,
                1375
            ],
            [
                1375,
                1395
            ],
            [
                1395,
                1401
            ],
            [
                1401,
                1579
            ],
            [
                1579,
                1584
            ],
            [
                1584,
                1661
            ],
            [
                1661,
                1692
            ],
            [
                1692,
                1740
            ],
            [
                1740,
                1780
            ],
            [
                1780,
                1869
            ],
            [
                1869,
                1923
            ],
            [
                1923,
                1943
            ],
            [
                1943,
                1972
            ],
            [
                1972,
                2043
            ],
            [
                2043,
                2135
            ],
            [
                2135,
                2185
            ],
            [
                2185,
                2247
            ],
            [
                2247,
                2284
            ],
            [
                2284,
                2326
            ],
            [
                2326,
                2370
            ],
            [
                2370,
                2423
            ],
            [
                2423,
                2502
            ],
            [
                2502,
                2589
            ],
            [
                2589,
                2626
            ],
            [
                2626,
                2638
            ],
            [
                2638,
                2652
            ],
            [
                2652,
                2727
            ],
            [
                2727,
                2748
            ],
            [
                2748,
                2778
            ],
            [
                2778,
                2810
            ],
            [
                2810,
                2834
            ],
            [
                2834,
                2861
            ],
            [
                2861,
                2874
            ],
            [
                2874,
                2898
            ],
            [
                2898,
                2918
            ],
            [
                2918,
                2991
            ],
            [
                2991,
                3072
            ],
            [
                3072,
                3102
            ],
            [
                3102,
                3192
            ],
            [
                3192,
                3206
            ],
            [
                3206,
                3347
            ],
            [
                3347,
                3471
            ],
            [
                3471,
                3541
            ],
            [
                3541,
                3601
            ],
            [
                3601,
                3740
            ],
            [
                3740,
                3804
            ],
            [
                3804,
                3889
            ],
            [
                3889,
                3894
            ],
            [
                3894,
                3954
            ],
            [
                3954,
                3980
            ],
            [
                3980,
                4059
            ],
            [
                4059,
                4100
            ],
            [
                4100,
                4167
            ],
            [
                4167,
                4196
            ],
            [
                4196,
                4251
            ],
            [
                4251,
                4267
            ],
            [
                4267,
                4334
            ],
            [
                4334,
                4360
            ],
            [
                4360,
                4385
            ],
            [
                4385,
                4419
            ],
            [
                4419,
                4555
            ],
            [
                4555,
                4607
            ],
            [
                4607,
                4680
            ],
            [
                4680,
                4739
            ],
            [
                4739,
                4993
            ],
            [
                4993,
                5049
            ],
            [
                5049,
                5139
            ],
            [
                5139,
                5288
            ],
            [
                5288,
                5395
            ],
            [
                5395,
                5457
            ],
            [
                5457,
                5472
            ],
            [
                5472,
                5527
            ],
            [
                5527,
                5589
            ],
            [
                5589,
                5633
            ],
            [
                5633,
                5761
            ],
            [
                5761,
                5872
            ],
            [
                5872,
                5920
            ],
            [
                5920,
                5949
            ],
            [
                5949,
                6043
            ],
            [
                6043,
                6082
            ],
            [
                6082,
                6193
            ],
            [
                6193,
                6431
            ],
            [
                6431,
                6481
            ],
            [
                6481,
                6519
            ],
            [
                6519,
                6621
            ],
            [
                6621,
                6719
            ],
            [
                6719,
                6831
            ],
            [
                6831,
                6845
            ],
            [
                6845,
                6909
            ],
            [
                6909,
                6955
            ],
            [
                6955,
                7085
            ],
            [
                7085,
                7236
            ],
            [
                7236,
                7355
            ],
            [
                7355,
                7419
            ],
            [
                7419,
                7451
            ],
            [
                7451,
                7574
            ],
            [
                7574,
                7651
            ],
            [
                7651,
                7807
            ],
            [
                7807,
                7919
            ],
            [
                7919,
                8071
            ],
            [
                8071,
                8267
            ],
            [
                8267,
                8300
            ],
            [
                8300,
                8408
            ],
            [
                8408,
                8548
            ],
            [
                8548,
                8625
            ],
            [
                8625,
                8889
            ],
            [
                8889,
                8955
            ],
            [
                8955,
                8994
            ],
            [
                8994,
                9021
            ],
            [
                9021,
                9038
            ],
            [
                9038,
                9078
            ],
            [
                9078,
                9131
            ],
            [
                9131,
                9258
            ],
            [
                9258,
                9307
            ],
            [
                9307,
                9325
            ],
            [
                9325,
                9343
            ],
            [
                9343,
                9531
            ],
            [
                9531,
                9600
            ],
            [
                9600,
                9622
            ],
            [
                9622,
                9705
            ],
            [
                9705,
                9879
            ],
            [
                9879,
                9918
            ],
            [
                9918,
                9962
            ],
            [
                9962,
                10018
            ],
            [
                10018,
                10109
            ],
            [
                10109,
                10294
            ],
            [
                10294,
                10425
            ],
            [
                10425,
                10484
            ],
            [
                10484,
                10781
            ],
            [
                10781,
                10822
            ],
            [
                10822,
                10872
            ],
            [
                10872,
                10876
            ],
            [
                10876,
                10903
            ],
            [
                10903,
                10953
            ],
            [
                10953,
                11001
            ],
            [
                11001,
                11011
            ],
            [
                11011,
                11042
            ],
            [
                11042,
                11083
            ],
            [
                11083,
                11130
            ],
            [
                11130,
                11161
            ],
            [
                11161,
                11171
            ],
            [
                11171,
                11194
            ],
            [
                11194,
                11228
            ],
            [
                11228,
                11250
            ],
            [
                11250,
                11312
            ],
            [
                11312,
                11391
            ],
            [
                11391,
                11570
            ],
            [
                11570,
                11598
            ],
            [
                11598,
                11652
            ],
            [
                11652,
                11677
            ],
            [
                11677,
                11717
            ],
            [
                11717,
                11742
            ],
            [
                11742,
                11771
            ],
            [
                11771,
                11786
            ],
            [
                11786,
                11814
            ],
            [
                11814,
                11832
            ],
            [
                11832,
                11854
            ],
            [
                11854,
                11998
            ],
            [
                11998,
                12094
            ],
            [
                12094,
                12178
            ],
            [
                12178,
                12199
            ],
            [
                12199,
                12217
            ],
            [
                12217,
                12227
            ],
            [
                12227,
                12258
            ],
            [
                12258,
                12274
            ],
            [
                12274,
                12397
            ],
            [
                12397,
                12502
            ],
            [
                12502,
                12719
            ],
            [
                12719,
                12729
            ],
            [
                12729,
                12787
            ],
            [
                12787,
                12976
            ],
            [
                12976,
                13134
            ],
            [
                13134,
                13216
            ],
            [
                13216,
                13250
            ],
            [
                13250,
                13344
            ],
            [
                13344,
                13497
            ],
            [
                13497,
                13575
            ],
            [
                13575,
                13637
            ],
            [
                13637,
                13809
            ],
            [
                13809,
                13894
            ],
            [
                13894,
                14092
            ],
            [
                14092,
                14190
            ],
            [
                14190,
                14251
            ],
            [
                14251,
                14349
            ],
            [
                14349,
                14432
            ],
            [
                14432,
                14523
            ],
            [
                14523,
                14558
            ],
            [
                14558,
                14574
            ],
            [
                14574,
                14586
            ],
            [
                14586,
                14729
            ],
            [
                14729,
                14833
            ]
        ],
        "overlap_chars": [
            [
                0,
                121
            ],
            [
                121,
                164
            ],
            [
                164,
                166
            ],
            [
                166,
                188
            ],
            [
                188,
                194
            ],
            [
                194,
                233
            ],
            [
                233,
                247
            ],
            [
                250,
                336
            ],
            [
                345,
                347
            ],
            [
                347,
                356
            ],
            [
                357,
                447
            ],
            [
                447,
                472
            ],
            [
                473,
                479
            ],
            [
                479,
                547
            ],
            [
                547,
                664
            ],
            [
                665,
                707
            ],
            [
                707,
                711
            ],
            [
                716,
                742
            ],
            [
                743,
                748
            ],
            [
                748,
                791
            ],
            [
                791,
                793
            ],
            [
                793,
                873
            ],
            [
                873,
                877
            ],
            [
                878,
                892
            ],
            [
                907,
                909
            ],
            [
                909,
                939
            ],
            [
                940,
                955
            ],
            [
                955,
                985
            ],
            [
                985,
                1000
            ],
            [
                1000,
                1026
            ],
            [
                1026,
                1039
            ],
            [
                1040,
                1079
            ],
            [
                1079,
                1088
            ],
            [
                1091,
                1099
            ],
            [
                1099,
                1139
            ],
            [
                1139,
                1163
            ],
            [
                1166,
                1176
            ],
            [
                1176,
                1178
            ],
            [
                1178,
                1241
            ],
            [
                1241,
                1274
            ],
            [
                1277,
                1297
            ],
            [
                1298,
                1303
            ],
            [
                1318,
                1344
            ],
            [
                1345,
                1357
            ],
            [
                1357,
                1375
            ],
            [
                1375,
                1395
            ],
            [
                1395,
                1401
            ],
            [
                1401,
                1423
            ],
            [
                1428,
                1476
            ],
            [
                1477,
                1498
            ],
            [
                1499,
                1502
            ],
            [
                1503,
                1550
            ],
            [
                1551,
                1555
            ],
            [
                1556,
                1570
            ],
            [
                1577,
                1579
            ],
            [
                1579,
                1584
            ],
            [
                1584,
                1630
            ],
            [
                1631,
                1661
            ],
            [
                1661,
                1692
            ],
            [
                1692,
                1707
            ],
            [
                1722,
                1738
            ],
            [
                1738,
                1740
            ],
            [
                1740,
                1754
            ],
            [
                1755,
                1772
            ],
            [
                1777,
                1780
            ],
            [
                1780,
                1869
            ],
            [
                1869,
                1923
            ],
            [
                1923,
                1943
            ],
            [
                1943,
                1972
            ],
            [
                1972,
                2026
            ],
            [
                2028,
                2031
            ],
            [
                2032,
                2034
            ],
            [
                2041,
                2043
            ],
            [
                2043,
                2065
            ],
            [
                2066,
                2108
            ],
            [
                2113,
                2119
            ],
            [
                2127,
                2135
            ],
            [
                2135,
                2185
            ],
            [
                2185,
                2208
            ],
            [
                2214,
                2247
            ],
            [
                2247,
                2284
            ],
            [
                2284,
                2326
            ],
            [
                2326,
                2368
            ],
            [
                2368,
                2370
            ],
            [
                2370,
                2423
            ],
            [
                2423,
                2502
            ],
            [
                2502,
                2522
            ],
            [
                2522,
                2589
            ],
            [
                2589,
                2626
            ],
            [
                2626,
                2638
            ],
            [
                2638,
                2652
            ],
            [
                2652,
                2727
            ],
            [
                2727,
                2748
            ],
            [
                2748,
                2778
            ],
            [
                2778,
                2795
            ],
            [
                2795,
                2808
            ],
            [
                2808,
                2810
            ],
            [
                2810,
                2814
            ],
            [
                2815,
                2817
            ],
            [
                2818,
                2823
            ],
            [
                2829,
                2834
            ],
            [
                2834,
                2861
            ],
            [
                2861,
                2874
            ],
            [
                2874,
                2898
            ],
            [
                2898,
                2916
            ],
            [
                2916,
                2918
            ],
            [
                2918,
                2919
            ],
            [
                2919,
                2955
            ],
            [
                2956,
                2991
            ],
            [
                2991,
                3072
            ],
            [
                3072,
                3084
            ],
            [
                3085,
                3100
            ],
            [
                3100,
                3102
            ],
            [
                3102,
                3162
            ],
            [
                3163,
                3192
            ],
            [
                3192,
                3205
            ],
            [
                3206,
                3222
            ],
            [
                3222,
                3223
            ],
            [
                3234,
                3287
            ],
            [
                3290,
                3304
            ],
            [
                3307,
                3347
            ],
            [
                3347,
                3450
            ],
            [
                3469,
                3471
            ],
            [
                3471,
                3541
            ],
            [
                3541,
                3547
            ],
            [
                3558,
                3582
            ],
            [
                3583,
                3601
            ],
            [
                3601,
                3698
            ],
            [
                3699,
                3740
            ],
            [
                3740,
                3776
            ],
            [
                3779,
                3804
            ],
            [
                3804,
                3889
            ],
            [
                3889,
                3894
            ],
            [
                3894,
                3952
            ],
            [
                3952,
                3954
            ],
            [
                3954,
                3966
            ],
            [
                3977,
                3980
            ],
            [
                3980,
                4010
            ],
            [
                4011,
                4017
            ],
            [
                4027,
                4059
            ],
            [
                4059,
                4075
            ],
            [
                4085,
                4100
            ],
            [
                4100,
                4140
            ],
            [
                4141,
                4167
            ],
            [
                4167,
                4194
            ],
            [
                4194,
                4196
            ],
            [
                4196,
                4249
            ],
            [
                4249,
                4251
            ],
            [
                4251,
                4267
            ],
            [
                4267,
                4280
            ],
            [
                4284,
                4331
            ],
            [
                4331,
                4334
            ],
            [
                4334,
                4360
            ],
            [
                4360,
                4363
            ],
            [
                4369,
                4385
            ],
            [
                4385,
                4419
            ],
            [
                4419,
                4458
            ],
            [
                4459,
                4465
            ],
            [
                4473,
                4555
            ],
            [
                4555,
                4607
            ],
            [
                4607,
                4609
            ],
            [
                4624,
                4677
            ],
            [
                4677,
                4680
            ],
            [
                4680,
                4717
            ],
            [
                4717,
                4726
            ],
            [
                4733,
                4737
            ],
            [
                4739,
                4766
            ],
            [
                4767,
                4801
            ],
            [
                4801,
                4830
            ],
            [
                4831,
                4886
            ],
            [
                4892,
                4895
            ],
            [
                4896,
                4982
            ],
            [
                4982,
                4983
            ],
            [
                4984,
                4993
            ],
            [
                4993,
                5047
            ],
            [
                5047,
                5049
            ],
            [
                5049,
                5103
            ],
            [
                5103,
                5137
            ],
            [
                5137,
                5139
            ],
            [
                5139,
                5256
            ],
            [
                5257,
                5262
            ],
            [
                5263,
                5267
            ],
            [
                5276,
                5279
            ],
            [
                5280,
                5285
            ],
            [
                5288,
                5395
            ],
            [
                5395,
                5457
            ],
            [
                5457,
                5472
            ],
            [
                5472,
                5527
            ],
            [
                5527,
                5589
            ],
            [
                5589,
                5610
            ],
            [
                5611,
                5633
            ],
            [
                5633,
                5761
            ],
            [
                5761,
                5872
            ],
            [
                5872,
                5873
            ],
            [
                5873,
                5920
            ],
            [
                5920,
                5949
            ],
            [
                5949,
                6041
            ],
            [
                6041,
                6043
            ],
            [
                6043,
                6082
            ],
            [
                6082,
                6192
            ],
            [
                6193,
                6262
            ],
            [
                6263,
                6299
            ],
            [
                6300,
                6336
            ],
            [
                6337,
                6431
            ],
            [
                6431,
                6442
            ],
            [
                6443,
                6481
            ],
            [
                6481,
                6505
            ],
            [
                6506,
                6509
            ],
            [
                6510,
                6517
            ],
            [
                6517,
                6519
            ],
            [
                6519,
                6549
            ],
            [
                6550,
                6560
            ],
            [
                6572,
                6621
            ],
            [
                6621,
                6719
            ],
            [
                6719,
                6800
            ],
            [
                6800,
                6801
            ],
            [
                6810,
                6817
            ],
            [
                6818,
                6824
            ],
            [
                6829,
                6831
            ],
            [
                6831,
                6845
            ],
            [
                6845,
                6909
            ],
            [
                6909,
                6955
            ],
            [
                6955,
                7000
            ],
            [
                7003,
                7008
            ],
            [
                7017,
                7021
            ],
            [
                7022,
                7062
            ],
            [
                7075,
                7079
            ],
            [
                7083,
                7085
            ],
            [
                7085,
                7096
            ],
            [
                7097,
                7116
            ],
            [
                7117,
                7119
            ],
            [
                7120,
                7128
            ],
            [
                7128,
                7164
            ],
            [
                7165,
                7236
            ],
            [
                7236,
                7271
            ],
            [
                7279,
                7284
            ],
            [
                7285,
                7355
            ],
            [
                7355,
                7405
            ],
            [
                7417,
                7419
            ],
            [
                7419,
                7449
            ],
            [
                7449,
                7451
            ],
            [
                7451,
                7470
            ],
            [
                7471,
                7475
            ],
            [
                7476,
                7501
            ],
            [
                7511,
                7535
            ],
            [
                7536,
                7553
            ],
            [
                7560,
                7574
            ],
            [
                7574,
                7651
            ],
            [
                7662,
                7762
            ],
            [
                7763,
                7786
            ],
            [
                7786,
                7787
            ],
            [
                7797,
                7805
            ],
            [
                7805,
                7807
            ],
            [
                7807,
                7813
            ],
            [
                7825,
                7873
            ],
            [
                7874,
                7917
            ],
            [
                7917,
                7919
            ],
            [
                7919,
                8069
            ],
            [
                8069,
                8071
            ],
            [
                8071,
                8248
            ],
            [
                8249,
                8265
            ],
            [
                8265,
                8267
            ],
            [
                8267,
                8298
            ],
            [
                8298,
                8300
            ],
            [
                8300,
                8364
            ],
            [
                8371,
                8375
            ],
            [
                8376,
                8381
            ],
            [
                8382,
                8408
            ],
            [
                8408,
                8416
            ],
            [
                8417,
                8484
            ],
            [
                8486,
                8489
            ],
            [
                8490,
                8510
            ],
            [
                8514,
                8522
            ],
            [
                8522,
                8523
            ],
            [
                8524,
                8531
            ],
            [
                8532,
                8546
            ],
            [
                8546,
                8548
            ],
            [
                8548,
                8623
            ],
            [
                8623,
                8625
            ],
            [
                8625,
                8748
            ],
            [
                8749,
                8862
            ],
            [
                8863,
                8889
            ],
            [
                8889,
                8954
            ],
            [
                8955,
                8971
            ],
            [
                8974,
                8994
            ],
            [
                8994,
                9021
            ],
            [
                9021,
                9037
            ],
            [
                9038,
                9078
            ],
            [
                9078,
                9086
            ],
            [
                9087,
                9131
            ],
            [
                9131,
                9153
            ],
            [
                9154,
                9247
            ],
            [
                9248,
                9256
            ],
            [
                9256,
                9258
            ],
            [
                9258,
                9307
            ],
            [
                9307,
                9325
            ],
            [
                9325,
                9343
            ],
            [
                9343,
                9380
            ],
            [
                9386,
                9530
            ],
            [
                9536,
                9539
            ],
            [
                9554,
                9555
            ],
            [
                9558,
                9574
            ],
            [
                9575,
                9598
            ],
            [
                9598,
                9600
            ],
            [
                9600,
                9622
            ],
            [
                9622,
                9704
            ],
            [
                9705,
                9706
            ],
            [
                9711,
                9728
            ],
            [
                9728,
                9761
            ],
            [
                9761,
                9790
            ],
            [
                9791,
                9804
            ],
            [
                9815,
                9877
            ],
            [
                9877,
                9879
            ],
            [
                9884,
                9891
            ],
            [
                9902,
                9918
            ],
            [
                9918,
                9928
            ],
            [
                9932,
                9946
            ],
            [
                9952,
                9957
            ],
            [
                9960,
                9962
            ],
            [
                9963,
                10015
            ],
            [
                10018,
                10065
            ],
            [
                10066,
                10109
            ],
            [
                10109,
                10138
            ],
            [
                10139,
                10164
            ],
            [
                10165,
                10191
            ],
            [
                10192,
                10208
            ],
            [
                10209,
                10210
            ],
            [
                10211,
                10256
            ],
            [
                10257,
                10258
            ],
            [
                10259,
                10294
            ],
            [
                10294,
                10297
            ],
            [
                10298,
                10423
            ],
            [
                10423,
                10424
            ],
            [
                10425,
                10482
            ],
            [
                10484,
                10507
            ],
            [
                10508,
                10607
            ],
            [
                10608,
                10779
            ],
            [
                10781,
                10811
            ],
            [
                10820,
                10822
            ],
            [
                10835,
                10836
            ],
            [
                10840,
                10872
            ],
            [
                10872,
                10876
            ],
            [
                10876,
                10903
            ],
            [
                10903,
                10953
            ],
            [
                10956,
                11001
            ],
            [
                11001,
                11011
            ],
            [
                11011,
                11042
            ],
            [
                11042,
                11083
            ],
            [
                11083,
                11130
            ],
            [
                11130,
                11161
            ],
            [
                11161,
                11171
            ],
            [
                11171,
                11173
            ],
            [
                11175,
                11194
            ],
            [
                11194,
                11228
            ],
            [
                11228,
                11250
            ],
            [
                11250,
                11312
            ],
            [
                11312,
                11391
            ],
            [
                11391,
                11544
            ],
            [
                11545,
                11570
            ],
            [
                11570,
                11598
            ],
            [
                11598,
                11651
            ],
            [
                11652,
                11677
            ],
            [
                11677,
                11717
            ],
            [
                11717,
                11742
            ],
            [
                11768,
                11771
            ],
            [
                11771,
                11784
            ],
            [
                11784,
                11785
            ],
            [
                11786,
                11814
            ],
            [
                11814,
                11832
            ],
            [
                11832,
                11854
            ],
            [
                11854,
                11998
            ],
            [
                11998,
                12032
            ],
            [
                12033,
                12094
            ],
            [
                12094,
                12178
            ],
            [
                12178,
                12199
            ],
            [
                12199,
                12217
            ],
            [
                12217,
                12227
            ],
            [
                12227,
                12258
            ],
            [
                12258,
                12274
            ],
            [
                12274,
                12315
            ],
            [
                12316,
                12318
            ],
            [
                12319,
                12322
            ],
            [
                12323,
                12338
            ],
            [
                12355,
                12378
            ],
            [
                12384,
                12397
            ],
            [
                12397,
                12449
            ],
            [
                12450,
                12502
            ],
            [
                12502,
                12573
            ],
            [
                12573,
                12719
            ],
            [
                12719,
                12729
            ],
            [
                12729,
                12787
            ],
            [
                12787,
                12976
            ],
            [
                12976,
                13053
            ],
            [
                13059,
                13105
            ],
            [
                13106,
                13134
            ],
            [
                13134,
                13216
            ],
            [
                13217,
                13250
            ],
            [
                13250,
                13344
            ],
            [
                13344,
                13410
            ],
            [
                13413,
                13426
            ],
            [
                13429,
                13497
            ],
            [
                13497,
                13505
            ],
            [
                13506,
                13548
            ],
            [
                13549,
                13573
            ],
            [
                13573,
                13575
            ],
            [
                13575,
                13579
            ],
            [
                13579,
                13590
            ],
            [
                13592,
                13635
            ],
            [
                13635,
                13636
            ],
            [
                13637,
                13782
            ],
            [
                13787,
                13808
            ],
            [
                13812,
                13823
            ],
            [
                13824,
                13832
            ],
            [
                13842,
                13892
            ],
            [
                13892,
                13894
            ],
            [
                13894,
                14008
            ],
            [
                14009,
                14010
            ],
            [
                14011,
                14090
            ],
            [
                14090,
                14092
            ],
            [
                14092,
                14190
            ],
            [
                14190,
                14249
            ],
            [
                14249,
                14250
            ],
            [
                14251,
                14349
            ],
            [
                14349,
                14411
            ],
            [
                14412,
                14432
            ],
            [
                14432,
                14523
            ],
            [
                14523,
                14525
            ],
            [
                14526,
                14540
            ],
            [
                14540,
                14558
            ],
            [
                14558,
                14574
            ],
            [
                14574,
                14586
            ],
            [
                14586,
                14729
            ],
            [
                14729,
                14798
            ],
            [
                14798,
                14833
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                166
            ],
            [
                166,
                188
            ],
            [
                188,
                194
            ],
            [
                194,
                233
            ],
            [
                233,
                250
            ],
            [
                250,
                250
            ],
            [
                250,
                347
            ],
            [
                347,
                347
            ],
            [
                347,
                447
            ],
            [
                447,
                547
            ],
            [
                547,
                665
            ],
            [
                665,
                707
            ],
            [
                707,
                743
            ],
            [
                743,
                748
            ],
            [
                748,
                793
            ],
            [
                793,
                873
            ],
            [
                873,
                909
            ],
            [
                909,
                955
            ],
            [
                955,
                985
            ],
            [
                985,
                1000
            ],
            [
                1000,
                1026
            ],
            [
                1026,
                1040
            ],
            [
                1040,
                1040
            ],
            [
                1040,
                1079
            ],
            [
                1079,
                1099
            ],
            [
                1099,
                1139
            ],
            [
                1139,
                1166
            ],
            [
                1166,
                1166
            ],
            [
                1166,
                1178
            ],
            [
                1178,
                1241
            ],
            [
                1241,
                1241
            ],
            [
                1241,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1357
            ],
            [
                1357,
                1375
            ],
            [
                1375,
                1395
            ],
            [
                1395,
                1401
            ],
            [
                1401,
                1579
            ],
            [
                1579,
                1584
            ],
            [
                1584,
                1661
            ],
            [
                1661,
                1692
            ],
            [
                1692,
                1740
            ],
            [
                1740,
                1740
            ],
            [
                1740,
                1740
            ],
            [
                1740,
                1780
            ],
            [
                1780,
                1869
            ],
            [
                1869,
                1923
            ],
            [
                1923,
                1943
            ],
            [
                1943,
                1972
            ],
            [
                1972,
                2043
            ],
            [
                2043,
                2135
            ],
            [
                2135,
                2185
            ],
            [
                2185,
                2247
            ],
            [
                2247,
                2284
            ],
            [
                2284,
                2326
            ],
            [
                2326,
                2370
            ],
            [
                2370,
                2423
            ],
            [
                2423,
                2502
            ],
            [
                2502,
                2502
            ],
            [
                2502,
                2589
            ],
            [
                2589,
                2626
            ],
            [
                2626,
                2638
            ],
            [
                2638,
                2638
            ],
            [
                2638,
                2638
            ],
            [
                2638,
                2638
            ],
            [
                2638,
                2652
            ],
            [
                2652,
                2727
            ],
            [
                2727,
                2748
            ],
            [
                2748,
                2778
            ],
            [
                2778,
                2810
            ],
            [
                2810,
                2834
            ],
            [
                2834,
                2861
            ],
            [
                2861,
                2874
            ],
            [
                2874,
                2898
            ],
            [
                2898,
                2918
            ],
            [
                2918,
                2991
            ],
            [
                2991,
                3072
            ],
            [
                3072,
                3102
            ],
            [
                3102,
                3192
            ],
            [
                3192,
                3206
            ],
            [
                3206,
                3206
            ],
            [
                3206,
                3347
            ],
            [
                3347,
                3471
            ],
            [
                3471,
                3541
            ],
            [
                3541,
                3541
            ],
            [
                3541,
                3541
            ],
            [
                3541,
                3541
            ],
            [
                3541,
                3541
            ],
            [
                3541,
                3601
            ],
            [
                3601,
                3740
            ],
            [
                3740,
                3804
            ],
            [
                3804,
                3889
            ],
            [
                3889,
                3894
            ],
            [
                3894,
                3954
            ],
            [
                3954,
                3980
            ],
            [
                3980,
                4059
            ],
            [
                4059,
                4100
            ],
            [
                4100,
                4167
            ],
            [
                4167,
                4196
            ],
            [
                4196,
                4251
            ],
            [
                4251,
                4267
            ],
            [
                4267,
                4334
            ],
            [
                4334,
                4360
            ],
            [
                4360,
                4385
            ],
            [
                4385,
                4419
            ],
            [
                4419,
                4555
            ],
            [
                4555,
                4607
            ],
            [
                4607,
                4607
            ],
            [
                4607,
                4607
            ],
            [
                4607,
                4680
            ],
            [
                4680,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4739
            ],
            [
                4739,
                4993
            ],
            [
                4993,
                5049
            ],
            [
                5049,
                5139
            ],
            [
                5139,
                5139
            ],
            [
                5139,
                5139
            ],
            [
                5139,
                5139
            ],
            [
                5139,
                5139
            ],
            [
                5139,
                5139
            ],
            [
                5139,
                5139
            ],
            [
                5139,
                5288
            ],
            [
                5288,
                5288
            ],
            [
                5288,
                5395
            ],
            [
                5395,
                5457
            ],
            [
                5457,
                5472
            ],
            [
                5472,
                5527
            ],
            [
                5527,
                5589
            ],
            [
                5589,
                5633
            ],
            [
                5633,
                5761
            ],
            [
                5761,
                5872
            ],
            [
                5872,
                5920
            ],
            [
                5920,
                5949
            ],
            [
                5949,
                6043
            ],
            [
                6043,
                6082
            ],
            [
                6082,
                6193
            ],
            [
                6193,
                6193
            ],
            [
                6193,
                6431
            ],
            [
                6431,
                6481
            ],
            [
                6481,
                6519
            ],
            [
                6519,
                6621
            ],
            [
                6621,
                6719
            ],
            [
                6719,
                6831
            ],
            [
                6831,
                6845
            ],
            [
                6845,
                6909
            ],
            [
                6909,
                6955
            ],
            [
                6955,
                7085
            ],
            [
                7085,
                7236
            ],
            [
                7236,
                7236
            ],
            [
                7236,
                7236
            ],
            [
                7236,
                7355
            ],
            [
                7355,
                7355
            ],
            [
                7355,
                7419
            ],
            [
                7419,
                7419
            ],
            [
                7419,
                7419
            ],
            [
                7419,
                7419
            ],
            [
                7419,
                7451
            ],
            [
                7451,
                7574
            ],
            [
                7574,
                7651
            ],
            [
                7651,
                7651
            ],
            [
                7651,
                7807
            ],
            [
                7807,
                7807
            ],
            [
                7807,
                7807
            ],
            [
                7807,
                7919
            ],
            [
                7919,
                8071
            ],
            [
                8071,
                8071
            ],
            [
                8071,
                8267
            ],
            [
                8267,
                8300
            ],
            [
                8300,
                8408
            ],
            [
                8408,
                8548
            ],
            [
                8548,
                8625
            ],
            [
                8625,
                8625
            ],
            [
                8625,
                8625
            ],
            [
                8625,
                8889
            ],
            [
                8889,
                8955
            ],
            [
                8955,
                8955
            ],
            [
                8955,
                8955
            ],
            [
                8955,
                8955
            ],
            [
                8955,
                8955
            ],
            [
                8955,
                8955
            ],
            [
                8955,
                8955
            ],
            [
                8955,
                8994
            ],
            [
                8994,
                9021
            ],
            [
                9021,
                9038
            ],
            [
                9038,
                9038
            ],
            [
                9038,
                9078
            ],
            [
                9078,
                9131
            ],
            [
                9131,
                9258
            ],
            [
                9258,
                9307
            ],
            [
                9307,
                9325
            ],
            [
                9325,
                9343
            ],
            [
                9343,
                9531
            ],
            [
                9531,
                9531
            ],
            [
                9531,
                9531
            ],
            [
                9531,
                9531
            ],
            [
                9531,
                9531
            ],
            [
                9531,
                9600
            ],
            [
                9600,
                9622
            ],
            [
                9622,
                9705
            ],
            [
                9705,
                9879
            ],
            [
                9879,
                9918
            ],
            [
                9918,
                9962
            ],
            [
                9962,
                9962
            ],
            [
                9962,
                9962
            ],
            [
                9962,
                10018
            ],
            [
                10018,
                10109
            ],
            [
                10109,
                10294
            ],
            [
                10294,
                10294
            ],
            [
                10294,
                10425
            ],
            [
                10425,
                10484
            ],
            [
                10484,
                10484
            ],
            [
                10484,
                10484
            ],
            [
                10484,
                10781
            ],
            [
                10781,
                10781
            ],
            [
                10781,
                10781
            ],
            [
                10781,
                10822
            ],
            [
                10822,
                10872
            ],
            [
                10872,
                10876
            ],
            [
                10876,
                10903
            ],
            [
                10903,
                10953
            ],
            [
                10953,
                10953
            ],
            [
                10953,
                10953
            ],
            [
                10953,
                10953
            ],
            [
                10953,
                11001
            ],
            [
                11001,
                11011
            ],
            [
                11011,
                11042
            ],
            [
                11042,
                11083
            ],
            [
                11083,
                11083
            ],
            [
                11083,
                11130
            ],
            [
                11130,
                11161
            ],
            [
                11161,
                11161
            ],
            [
                11161,
                11171
            ],
            [
                11171,
                11194
            ],
            [
                11194,
                11228
            ],
            [
                11228,
                11250
            ],
            [
                11250,
                11250
            ],
            [
                11250,
                11312
            ],
            [
                11312,
                11391
            ],
            [
                11391,
                11570
            ],
            [
                11570,
                11598
            ],
            [
                11598,
                11652
            ],
            [
                11652,
                11652
            ],
            [
                11652,
                11652
            ],
            [
                11652,
                11652
            ],
            [
                11652,
                11677
            ],
            [
                11677,
                11717
            ],
            [
                11717,
                11717
            ],
            [
                11717,
                11742
            ],
            [
                11742,
                11771
            ],
            [
                11771,
                11786
            ],
            [
                11786,
                11786
            ],
            [
                11786,
                11814
            ],
            [
                11814,
                11832
            ],
            [
                11832,
                11854
            ],
            [
                11854,
                11998
            ],
            [
                11998,
                12094
            ],
            [
                12094,
                12178
            ],
            [
                12178,
                12199
            ],
            [
                12199,
                12217
            ],
            [
                12217,
                12227
            ],
            [
                12227,
                12258
            ],
            [
                12258,
                12274
            ],
            [
                12274,
                12397
            ],
            [
                12397,
                12502
            ],
            [
                12502,
                12719
            ],
            [
                12719,
                12729
            ],
            [
                12729,
                12787
            ],
            [
                12787,
                12976
            ],
            [
                12976,
                13134
            ],
            [
                13134,
                13216
            ],
            [
                13216,
                13216
            ],
            [
                13216,
                13250
            ],
            [
                13250,
                13344
            ],
            [
                13344,
                13497
            ],
            [
                13497,
                13575
            ],
            [
                13575,
                13575
            ],
            [
                13575,
                13575
            ],
            [
                13575,
                13575
            ],
            [
                13575,
                13637
            ],
            [
                13637,
                13637
            ],
            [
                13637,
                13637
            ],
            [
                13637,
                13637
            ],
            [
                13637,
                13637
            ],
            [
                13637,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13809
            ],
            [
                13809,
                13894
            ],
            [
                13894,
                13894
            ],
            [
                13894,
                14092
            ],
            [
                14092,
                14190
            ],
            [
                14190,
                14251
            ],
            [
                14251,
                14251
            ],
            [
                14251,
                14251
            ],
            [
                14251,
                14349
            ],
            [
                14349,
                14432
            ],
            [
                14432,
                14523
            ],
            [
                14523,
                14558
            ],
            [
                14558,
                14574
            ],
            [
                14574,
                14586
            ],
            [
                14586,
                14729
            ],
            [
                14729,
                14833
            ]
        ]
    }
}