{
    "original": {
        "text": "While we were in London Mr. Jarndyce was constantly beset by the crowd of excitable ladies and gentlemen whose proceedings had so much astonished us. Mr. Quale, who presented himself soon after our arrival, was in all such excitements. He seemed to project those two shining knobs of temples of his into everything that went on and to brush his hair farther and farther back, until the very roots were almost ready to fly out of his head in inappeasable philanthropy. All objects were alike to him, but he was always particularly ready for anything in the way of a testimonial to any one. His great power seemed to be his power of indiscriminate admiration. He would sit for any length of time, with the utmost enjoyment, bathing his temples in the light of any order of luminary. Having first seen him perfectly swallowed up in admiration of Mrs. Jellyby, I had supposed her to be the absorbing object of his devotion. I soon discovered my mistake and found him to be train-bearer and organ-blower to a whole procession of people.\nMrs. Pardiggle came one day for a subscription to something, and with her, Mr. Quale. Whatever Mrs. Pardiggle said, Mr. Quale repeated to us; and just as he had drawn Mrs. Jellyby out, he drew Mrs. Pardiggle out. Mrs. Pardiggle wrote a letter of introduction to my guardian in behalf of her eloquent friend Mr. Gusher. With Mr. Gusher appeared Mr. Quale again. Mr. Gusher, being a flabby gentleman with a moist surface and eyes so much too small for his moon of a face that they seemed to have been originally made for somebody else, was not at first sight prepossessing; yet he was scarcely seated before Mr. Quale asked Ada and me, not inaudibly, whether he was not a great creature--which he certainly was, flabbily speaking, though Mr. Quale meant in intellectual beauty--and whether we were not struck by his massive configuration of brow. In short, we heard of a great many missions of various sorts among this set of people, but nothing respecting them was half so clear to us as that it was Mr. Quale's mission to be in ecstasies with everybody else's mission and that it was the most popular mission of all.\nMr. Jarndyce had fallen into this company in the tenderness of his heart and his earnest desire to do all the good in his power; but that he felt it to be too often an unsatisfactory company, where benevolence took spasmodic forms, where charity was assumed as a regular uniform by loud professors and speculators in cheap notoriety, vehement in profession, restless and vain in action, servile in the last degree of meanness to the great, adulatory of one another, and intolerable to those who were anxious quietly to help the weak from failing rather than with a great deal of bluster and self-laudation to raise them up a little way when they were down, he plainly told us. When a testimonial was originated to Mr. Quale by Mr. Gusher (who had already got one, originated by Mr. Quale), and when Mr. Gusher spoke for an hour and a half on the subject to a meeting, including two charity schools of small boys and girls, who were specially reminded of the widow's mite, and requested to come forward with halfpence and be acceptable sacrifices, I think the wind was in the east for three whole weeks.\nI mention this because I am coming to Mr. Skimpole again. It seemed to me that his off-hand professions of childishness and carelessness were a great relief to my guardian, by contrast with such things, and were the more readily believed in since to find one perfectly undesigning and candid man among many opposites could not fail to give him pleasure. I should be sorry to imply that Mr. Skimpole divined this and was politic; I really never understood him well enough to know. What he was to my guardian, he certainly was to the rest of the world.\nHe had not been very well; and thus, though he lived in London, we had seen nothing of him until now. He appeared one morning in his usual agreeable way and as full of pleasant spirits as ever.\nWell, he said, here he was! He had been bilious, but rich men were often bilious, and therefore he had been persuading himself that he was a man of property. So he was, in a certain point of view--in his expansive intentions. He had been enriching his medical attendant in the most lavish manner. He had always doubled, and sometimes quadrupled, his fees. He had said to the doctor, \"Now, my dear doctor, it is quite a delusion on your part to suppose that you attend me for nothing. I am overwhelming you with money--in my expansive intentions--if you only knew it!\" And really (he said) he meant it to that degree that he thought it much the same as doing it. If he had had those bits of metal or thin paper to which mankind attached so much importance to put in the doctor's hand, he would have put them in the doctor's hand. Not having them, he substituted the will for the deed. Very well! If he really meant it--if his will were genuine and real, which it was--it appeared to him that it was the same as coin, and cancelled the obligation.\n\"It may be, partly, because I know nothing of the value of money,\" said Mr. Skimpole, \"but I often feel this. It seems so reasonable! My butcher says to me he wants that little bill. It's a part of the pleasant unconscious poetry of the man's nature that he always calls it a 'little' bill--to make the payment appear easy to both of us. I reply to the butcher, 'My good friend, if you knew it, you are paid. You haven't had the trouble of coming to ask for the little bill. You are paid. I mean it.'\"\n\"But, suppose,\" said my guardian, laughing, \"he had meant the meat in the bill, instead of providing it?\"\n\"My dear Jarndyce,\" he returned, \"you surprise me. You take the butcher's position. A butcher I once dealt with occupied that very ground. Says he, 'Sir, why did you eat spring lamb at eighteen pence a pound?' 'Why did I eat spring lamb at eighteen pence a pound, my honest friend?' said I, naturally amazed by the question. 'I like spring lamb!' This was so far convincing. 'Well, sir,' says he, 'I wish I had meant the lamb as you mean the money!' 'My good fellow,' said I, 'pray let us reason like intellectual beings. How could that be? It was impossible. You HAD got the lamb, and I have NOT got the money. You couldn't really mean the lamb without sending it in, whereas I can, and do, really mean the money without paying it!' He had not a word. There was an end of the subject.\"\n\"Did he take no legal proceedings?\" inquired my guardian.\n\"Yes, he took legal proceedings,\" said Mr. Skimpole. \"But in that he was influenced by passion, not by reason. Passion reminds me of Boythorn. He writes me that you and the ladies have promised him a short visit at his bachelor-house in Lincolnshire.\"\n\"He is a great favourite with my girls,\" said Mr. Jarndyce, \"and I have promised for them.\"\n\"Nature forgot to shade him off, I think,\" observed Mr. Skimpole to Ada and me. \"A little too boisterous--like the sea. A little too vehement--like a bull who has made up his mind to consider every colour scarlet. But I grant a sledge-hammering sort of merit in him!\"\nI should have been surprised if those two could have thought very highly of one another, Mr. Boythorn attaching so much importance to many things and Mr. Skimpole caring so little for anything. Besides which, I had noticed Mr. Boythorn more than once on the point of breaking out into some strong opinion when Mr. Skimpole was referred to. Of course I merely joined Ada in saying that we had been greatly pleased with him.\n\"He has invited me,\" said Mr. Skimpole; \"and if a child may trust himself in such hands--which the present child is encouraged to do, with the united tenderness of two angels to guard him--I shall go. He proposes to frank me down and back again. I suppose it will cost money? Shillings perhaps? Or pounds? Or something of that sort? By the by, Coavinses. You remember our friend Coavinses, Miss Summerson?\"\nHe asked me as the subject arose in his mind, in his graceful, light-hearted manner and without the least embarrassment.\n\"Oh, yes!\" said I.\n\"Coavinses has been arrested by the Great Bailiff,\" said Mr. Skimpole. \"He will never do violence to the sunshine any more.\"\nIt quite shocked me to hear it, for I had already recalled with anything but a serious association the image of the man sitting on the sofa that night wiping his head.\n\"His successor informed me of it yesterday,\" said Mr. Skimpole. \"His successor is in my house now--in possession, I think he calls it. He came yesterday, on my blue-eyed daughter's birthday. I put it to him, 'This is unreasonable and inconvenient. If you had a blue-eyed daughter you wouldn't like ME to come, uninvited, on HER birthday?' But he stayed.\"\nMr. Skimpole laughed at the pleasant absurdity and lightly touched the piano by which he was seated.\n\"And he told me,\" he said, playing little chords where I shall put full stops, \"The Coavinses had left. Three children. No mother. And that Coavinses' profession. Being unpopular. The rising Coavinses. Were at a considerable disadvantage.\"\nMr. Jarndyce got up, rubbing his head, and began to walk about. Mr. Skimpole played the melody of one of Ada's favourite songs. Ada and I both looked at Mr. Jarndyce, thinking that we knew what was passing in his mind.\nAfter walking and stopping, and several times leaving off rubbing his head, and beginning again, my guardian put his hand upon the keys and stopped Mr. Skimpole's playing. \"I don't like this, Skimpole,\" he said thoughtfully.\nMr. Skimpole, who had quite forgotten the subject, looked up surprised.\n\"The man was necessary,\" pursued my guardian, walking backward and forward in the very short space between the piano and the end of the room and rubbing his hair up from the back of his head as if a high east wind had blown it into that form. \"If we make such men necessary by our faults and follies, or by our want of worldly knowledge, or by our misfortunes, we must not revenge ourselves upon them. There was no harm in his trade. He maintained his children. One would like to know more about this.\"\n\"Oh! Coavinses?\" cried Mr. Skimpole, at length perceiving what he meant. \"Nothing easier. A walk to Coavinses' headquarters, and you can know what you will.\"\nMr. Jarndyce nodded to us, who were only waiting for the signal. \"Come! We will walk that way, my dears. Why not that way as soon as another!\" We were quickly ready and went out. Mr. Skimpole went with us and quite enjoyed the expedition. It was so new and so refreshing, he said, for him to want Coavinses instead of Coavinses wanting him!\nHe took us, first, to Cursitor Street, Chancery Lane, where there was a house with barred windows, which he called Coavinses' Castle. On our going into the entry and ringing a bell, a very hideous boy came out of a sort of office and looked at us over a spiked wicket.\n\"Who did you want?\" said the boy, fitting two of the spikes into his chin.\n\"There was a follower, or an officer, or something, here,\" said Mr. Jarndyce, \"who is dead.\"\n\"Yes?\" said the boy. \"Well?\"\n\"I want to know his name, if you please?\"\n\"Name of Neckett,\" said the boy.\n\"And his address?\"\n\"Bell Yard,\" said the boy. \"Chandler's shop, left hand side, name of Blinder.\"\n\"Was he--I don't know how to shape the question--\" murmured my guardian, \"industrious?\"\n\"Was Neckett?\" said the boy. \"Yes, wery much so. He was never tired of watching. He'd set upon a post at a street corner eight or ten hours at a stretch if he undertook to do it.\"\n\"He might have done worse,\" I heard my guardian soliloquize. \"He might have undertaken to do it and not done it. Thank you. That's all I want.\"\nWe left the boy, with his head on one side and his arms on the gate, fondling and sucking the spikes, and went back to Lincoln's Inn, where Mr. Skimpole, who had not cared to remain nearer Coavinses, awaited us. Then we all went to Bell Yard, a narrow alley at a very short distance. We soon found the chandler's shop. In it was a good-natured-looking old woman with a dropsy, or an asthma, or perhaps both.\n\"Neckett's children?\" said she in reply to my inquiry. \"Yes, Surely, miss. Three pair, if you please. Door right opposite the stairs.\" And she handed me the key across the counter.\nI glanced at the key and glanced at her, but she took it for granted that I knew what to do with it. As it could only be intended for the children's door, I came out without asking any more questions and led the way up the dark stairs. We went as quietly as we could, but four of us made some noise on the aged boards, and when we came to the second story we found we had disturbed a man who was standing there looking out of his room.\n\"Is it Gridley that's wanted?\" he said, fixing his eyes on me with an angry stare.\n\"No, sir,\" said I; \"I am going higher up.\"\nHe looked at Ada, and at Mr. Jarndyce, and at Mr. Skimpole, fixing the same angry stare on each in succession as they passed and followed me. Mr. Jarndyce gave him good day. \"Good day!\" he said abruptly and fiercely. He was a tall, sallow man with a careworn head on which but little hair remained, a deeply lined face, and prominent eyes. He had a combative look and a chafing, irritable manner which, associated with his figure--still large and powerful, though evidently in its decline--rather alarmed me. He had a pen in his hand, and in the glimpse I caught of his room in passing, I saw that it was covered with a litter of papers.\nLeaving him standing there, we went up to the top room. I tapped at the door, and a little shrill voice inside said, \"We are locked in. Mrs. Blinder's got the key!\"\nI applied the key on hearing this and opened the door. In a poor room with a sloping ceiling and containing very little furniture was a mite of a boy, some five or six years old, nursing and hushing a heavy child of eighteen months. There was no fire, though the weather was cold; both children were wrapped in some poor shawls and tippets as a substitute. Their clothing was not so warm, however, but that their noses looked red and pinched and their small figures shrunken as the boy walked up and down nursing and hushing the child with its head on his shoulder.\n\"Who has locked you up here alone?\" we naturally asked.\n\"Charley,\" said the boy, standing still to gaze at us.\n\"Is Charley your brother?\"\n\"No. She's my sister, Charlotte. Father called her Charley.\"\n\"Are there any more of you besides Charley?\"\n\"Me,\" said the boy, \"and Emma,\" patting the limp bonnet of the child he was nursing. \"And Charley.\"\n\"Where is Charley now?\"\n\"Out a-washing,\" said the boy, beginning to walk up and down again and taking the nankeen bonnet much too near the bedstead by trying to gaze at us at the same time.\nWe were looking at one another and at these two children when there came into the room a very little girl, childish in figure but shrewd and older-looking in the face--pretty-faced too--wearing a womanly sort of bonnet much too large for her and drying her bare arms on a womanly sort of apron. Her fingers were white and wrinkled with washing, and the soap-suds were yet smoking which she wiped off her arms. But for this, she might have been a child playing at washing and imitating a poor working-woman with a quick observation of the truth.\nShe had come running from some place in the neighbourhood and had made all the haste she could. Consequently, though she was very light, she was out of breath and could not speak at first, as she stood panting, and wiping her arms, and looking quietly at us.\n\"Oh, here's Charley!\" said the boy.\nThe child he was nursing stretched forth its arms and cried out to be taken by Charley. The little girl took it, in a womanly sort of manner belonging to the apron and the bonnet, and stood looking at us over the burden that clung to her most affectionately.\n\"Is it possible,\" whispered my guardian as we put a chair for the little creature and got her to sit down with her load, the boy keeping close to her, holding to her apron, \"that this child works for the rest? Look at this! For God's sake, look at this!\"\nIt was a thing to look at. The three children close together, and two of them relying solely on the third, and the third so young and yet with an air of age and steadiness that sat so strangely on the childish figure.\n\"Charley, Charley!\" said my guardian. \"How old are you?\"\n\"Over thirteen, sir,\" replied the child.\n\"Oh! What a great age,\" said my guardian. \"What a great age, Charley!\"\nI cannot describe the tenderness with which he spoke to her, half playfully yet all the more compassionately and mournfully.\n\"And do you live alone here with these babies, Charley?\" said my guardian.\n\"Yes, sir,\" returned the child, looking up into his face with perfect confidence, \"since father died.\"\n\"And how do you live, Charley? Oh! Charley,\" said my guardian, turning his face away for a moment, \"how do you live?\"\n\"Since father died, sir, I've gone out to work. I'm out washing to-day.\"\n\"God help you, Charley!\" said my guardian. \"You're not tall enough to reach the tub!\"\n\"In pattens I am, sir,\" she said quickly. \"I've got a high pair as belonged to mother.\"\n\"And when did mother die? Poor mother!\"\n\"Mother died just after Emma was born,\" said the child, glancing at the face upon her bosom. \"Then father said I was to be as good a mother to her as I could. And so I tried. And so I worked at home and did cleaning and nursing and washing for a long time before I began to go out. And that's how I know how; don't you see, sir?\"\n\"And do you often go out?\"\n\"As often as I can,\" said Charley, opening her eyes and smiling, \"because of earning sixpences and shillings!\"\n\"And do you always lock the babies up when you go out?\"\n\"To keep 'em safe, sir, don't you see?\" said Charley. \"Mrs. Blinder comes up now and then, and Mr. Gridley comes up sometimes, and perhaps I can run in sometimes, and they can play you know, and Tom an't afraid of being locked up, are you, Tom?\"\n\"No-o!\" said Tom stoutly.\n\"When it comes on dark, the lamps are lighted down in the court, and they show up here quite bright--almost quite bright. Don't they, Tom?\"\n\"Yes, Charley,\" said Tom, \"almost quite bright.\"\n\"Then he's as good as gold,\" said the little creature--Oh, in such a motherly, womanly way! \"And when Emma's tired, he puts her to bed. And when he's tired he goes to bed himself. And when I come home and light the candle and has a bit of supper, he sits up again and has it with me. Don't you, Tom?\"\n\"Oh, yes, Charley!\" said Tom. \"That I do!\" And either in this glimpse of the great pleasure of his life or in gratitude and love for Charley, who was all in all to him, he laid his face among the scanty folds of her frock and passed from laughing into crying.\nIt was the first time since our entry that a tear had been shed among these children. The little orphan girl had spoken of their father and their mother as if all that sorrow were subdued by the necessity of taking courage, and by her childish importance in being able to work, and by her bustling busy way. But now, when Tom cried, although she sat quite tranquil, looking quietly at us, and did not by any movement disturb a hair of the head of either of her little charges, I saw two silent tears fall down her face.\nI stood at the window with Ada, pretending to look at the housetops, and the blackened stack of chimneys, and the poor plants, and the birds in little cages belonging to the neighbours, when I found that Mrs. Blinder, from the shop below, had come in (perhaps it had taken her all this time to get upstairs) and was talking to my guardian.\n\"It's not much to forgive 'em the rent, sir,\" she said; \"who could take it from them!\"\n\"Well, well!\" said my guardian to us two. \"It is enough that the time will come when this good woman will find that it WAS much, and that forasmuch as she did it unto the least of these--This child,\" he added after a few moments, \"could she possibly continue this?\"\n\"Really, sir, I think she might,\" said Mrs. Blinder, getting her heavy breath by painful degrees. \"She's as handy as it's possible to be. Bless you, sir, the way she tended them two children after the mother died was the talk of the yard! And it was a wonder to see her with him after he was took ill, it really was! 'Mrs. Blinder,' he said to me the very last he spoke--he was lying there--'Mrs. Blinder, whatever my calling may have been, I see a angel sitting in this room last night along with my child, and I trust her to Our Father!'\"\n\"He had no other calling?\" said my guardian.\n\"No, sir,\" returned Mrs. Blinder, \"he was nothing but a follerers. When he first came to lodge here, I didn't know what he was, and I confess that when I found out I gave him notice. It wasn't liked in the yard. It wasn't approved by the other lodgers. It is NOT a genteel calling,\" said Mrs. Blinder, \"and most people do object to it. Mr. Gridley objected to it very strong, and he is a good lodger, though his temper has been hard tried.\"\n\"So you gave him notice?\" said my guardian.\n\"So I gave him notice,\" said Mrs. Blinder. \"But really when the time came, and I knew no other ill of him, I was in doubts. He was punctual and diligent; he did what he had to do, sir,\" said Mrs. Blinder, unconsciously fixing Mr. Skimpole with her eye, \"and it's something in this world even to do that.\"\n\"So you kept him after all?\"\n\"Why, I said that if he could arrange with Mr. Gridley, I could arrange it with the other lodgers and should not so much mind its being liked or disliked in the yard. Mr. Gridley gave his consent gruff--but gave it. He was always gruff with him, but he has been kind to the children since. A person is never known till a person is proved.\"\n\"Have many people been kind to the children?\" asked Mr. Jarndyce.\n\"Upon the whole, not so bad, sir,\" said Mrs. Blinder; \"but certainly not so many as would have been if their father's calling had been different. Mr. Coavins gave a guinea, and the follerers made up a little purse. Some neighbours in the yard that had always joked and tapped their shoulders when he went by came forward with a little subscription, and--in general--not so bad. Similarly with Charlotte. Some people won't employ her because she was a follerer's child; some people that do employ her cast it at her; some make a merit of having her to work for them, with that and all her draw-backs upon her, and perhaps pay her less and put upon her more. But she's patienter than others would be, and is clever too, and always willing, up to the full mark of her strength and over. So I should say, in general, not so bad, sir, but might be better.\"\nMrs. Blinder sat down to give herself a more favourable opportunity of recovering her breath, exhausted anew by so much talking before it was fully restored. Mr. Jarndyce was turning to speak to us when his attention was attracted by the abrupt entrance into the room of the Mr. Gridley who had been mentioned and whom we had seen on our way up.\n\"I don't know what you may be doing here, ladies and gentlemen,\" he said, as if he resented our presence, \"but you'll excuse my coming in. I don't come in to stare about me. Well, Charley! Well, Tom! Well, little one! How is it with us all to-day?\"\nHe bent over the group in a caressing way and clearly was regarded as a friend by the children, though his face retained its stern character and his manner to us was as rude as it could be. My guardian noticed it and respected it.\n\"No one, surely, would come here to stare about him,\" he said mildly.\n\"May be so, sir, may be so,\" returned the other, taking Tom upon his knee and waving him off impatiently. \"I don't want to argue with ladies and gentlemen. I have had enough of arguing to last one man his life.\"\n\"You have sufficient reason, I dare say,\" said Mr. Jarndyce, \"for being chafed and irritated--\"\n\"There again!\" exclaimed the man, becoming violently angry. \"I am of a quarrelsome temper. I am irascible. I am not polite!\"\n\"Not very, I think.\"\n\"Sir,\" said Gridley, putting down the child and going up to him as if he meant to strike him, \"do you know anything of Courts of Equity?\"\n\"Perhaps I do, to my sorrow.\"\n\"To your sorrow?\" said the man, pausing in his wrath, \"if so, I beg your pardon. I am not polite, I know. I beg your pardon! Sir,\" with renewed violence, \"I have been dragged for five and twenty years over burning iron, and I have lost the habit of treading upon velvet. Go into the Court of Chancery yonder and ask what is one of the standing jokes that brighten up their business sometimes, and they will tell you that the best joke they have is the man from Shropshire. I,\" he said, beating one hand on the other passionately, \"am the man from Shropshire.\"\n\"I believe I and my family have also had the honour of furnishing some entertainment in the same grave place,\" said my guardian composedly. \"You may have heard my name--Jarndyce.\"\n\"Mr. Jarndyce,\" said Gridley with a rough sort of salutation, \"you bear your wrongs more quietly than I can bear mine. More than that, I tell you--and I tell this gentleman, and these young ladies, if they are friends of yours--that if I took my wrongs in any other way, I should be driven mad! It is only by resenting them, and by revenging them in my mind, and by angrily demanding the justice I never get, that I am able to keep my wits together. It is only that!\" he said, speaking in a homely, rustic way and with great vehemence. \"You may tell me that I over-excite myself. I answer that it's in my nature to do it, under wrong, and I must do it. There's nothing between doing it, and sinking into the smiling state of the poor little mad woman that haunts the court. If I was once to sit down under it, I should become imbecile.\"\nThe passion and heat in which he was, and the manner in which his face worked, and the violent gestures with which he accompanied what he said, were most painful to see.\n\"Mr. Jarndyce,\" he said, \"consider my case. As true as there is a heaven above us, this is my case. I am one of two brothers. My father (a farmer) made a will and left his farm and stock and so forth to my mother for her life. After my mother's death, all was to come to me except a legacy of three hundred pounds that I was then to pay my brother. My mother died. My brother some time afterwards claimed his legacy. I and some of my relations said that he had had a part of it already in board and lodging and some other things. Now mind! That was the question, and nothing else. No one disputed the will; no one disputed anything but whether part of that three hundred pounds had been already paid or not. To settle that question, my brother filing a bill, I was obliged to go into this accursed Chancery; I was forced there because the law forced me and would let me go nowhere else. Seventeen people were made defendants to that simple suit! It first came on after two years. It was then stopped for another two years while the master (may his head rot off!) inquired whether I was my father's son, about which there was no dispute at all with any mortal creature. He then found out that there were not defendants enough--remember, there were only seventeen as yet!--but that we must have another who had been left out and must begin all over again. The costs at that time--before the thing was begun!--were three times the legacy. My brother would have given up the legacy, and joyful, to escape more costs. My whole estate, left to me in that will of my father's, has gone in costs. The suit, still undecided, has fallen into rack, and ruin, and despair, with everything else--and here I stand, this day! Now, Mr. Jarndyce, in your suit there are thousands and thousands involved, where in mine there are hundreds. Is mine less hard to bear or is it harder to bear, when my whole living was in it and has been thus shamefully sucked away?\"\nMr. Jarndyce said that he condoled with him with all his heart and that he set up no monopoly himself in being unjustly treated by this monstrous system.\n\"There again!\" said Mr. Gridley with no diminution of his rage. \"The system! I am told on all hands, it's the system. I mustn't look to individuals. It's the system. I mustn't go into court and say, 'My Lord, I beg to know this from you--is this right or wrong? Have you the face to tell me I have received justice and therefore am dismissed?' My Lord knows nothing of it. He sits there to administer the system. I mustn't go to Mr. Tulkinghorn, the solicitor in Lincoln's Inn Fields, and say to him when he makes me furious by being so cool and satisfied--as they all do, for I know they gain by it while I lose, don't I?--I mustn't say to him, 'I will have something out of some one for my ruin, by fair means or foul!' HE is not responsible. It's the system. But, if I do no violence to any of them, here--I may! I don't know what may happen if I am carried beyond myself at last! I will accuse the individual workers of that system against me, face to face, before the great eternal bar!\"\nHis passion was fearful. I could not have believed in such rage without seeing it.\n\"I have done!\" he said, sitting down and wiping his face. \"Mr. Jarndyce, I have done! I am violent, I know. I ought to know it. I have been in prison for contempt of court. I have been in prison for threatening the solicitor. I have been in this trouble, and that trouble, and shall be again. I am the man from Shropshire, and I sometimes go beyond amusing them, though they have found it amusing, too, to see me committed into custody and brought up in custody and all that. It would be better for me, they tell me, if I restrained myself. I tell them that if I did restrain myself I should become imbecile. I was a good-enough-tempered man once, I believe. People in my part of the country say they remember me so, but now I must have this vent under my sense of injury or nothing could hold my wits together. It would be far better for you, Mr. Gridley,' the Lord Chancellor told me last week, 'not to waste your time here, and to stay, usefully employed, down in Shropshire.' 'My Lord, my Lord, I know it would,' said I to him, 'and it would have been far better for me never to have heard the name of your high office, but unhappily for me, I can't undo the past, and the past drives me here!' Besides,\" he added, breaking fiercely out, \"I'll shame them. To the last, I'll show myself in that court to its shame. If I knew when I was going to die, and could be carried there, and had a voice to speak with, I would die there, saying, 'You have brought me here and sent me from here many and many a time. Now send me out feet foremost!'\"\nHis countenance had, perhaps for years, become so set in its contentious expression that it did not soften, even now when he was quiet.\n\"I came to take these babies down to my room for an hour,\" he said, going to them again, \"and let them play about. I didn't mean to say all this, but it don't much signify. You're not afraid of me, Tom, are you?\"\n\"No!\" said Tom. \"You ain't angry with ME.\"\n\"You are right, my child. You're going back, Charley? Aye? Come then, little one!\" He took the youngest child on his arm, where she was willing enough to be carried. \"I shouldn't wonder if we found a ginger-bread soldier downstairs. Let's go and look for him!\"\nHe made his former rough salutation, which was not deficient in a certain respect, to Mr. Jarndyce, and bowing slightly to us, went downstairs to his room.\nUpon that, Mr. Skimpole began to talk, for the first time since our arrival, in his usual gay strain. He said, Well, it was really very pleasant to see how things lazily adapted themselves to purposes. Here was this Mr. Gridley, a man of a robust will and surprising energy--intellectually speaking, a sort of inharmonious blacksmith--and he could easily imagine that there Gridley was, years ago, wandering about in life for something to expend his superfluous combativeness upon--a sort of Young Love among the thorns--when the Court of Chancery came in his way and accommodated him with the exact thing he wanted. There they were, matched, ever afterwards! Otherwise he might have been a great general, blowing up all sorts of towns, or he might have been a great politician, dealing in all sorts of parliamentary rhetoric; but as it was, he and the Court of Chancery had fallen upon each other in the pleasantest way, and nobody was much the worse, and Gridley was, so to speak, from that hour provided for. Then look at Coavinses! How delightfully poor Coavinses (father of these charming children) illustrated the same principle! He, Mr. Skimpole, himself, had sometimes repined at the existence of Coavinses. He had found Coavinses in his way. He could had dispensed with Coavinses. There had been times when, if he had been a sultan, and his grand vizier had said one morning, \"What does the Commander of the Faithful require at the hands of his slave?\" he might have even gone so far as to reply, \"The head of Coavinses!\" But what turned out to be the case? That, all that time, he had been giving employment to a most deserving man, that he had been a benefactor to Coavinses, that he had actually been enabling Coavinses to bring up these charming children in this agreeable way, developing these social virtues! Insomuch that his heart had just now swelled and the tears had come into his eyes when he had looked round the room and thought, \"I was the great patron of Coavinses, and his little comforts were MY work!\"\nThere was something so captivating in his light way of touching these fantastic strings, and he was such a mirthful child by the side of the graver childhood we had seen, that he made my guardian smile even as he turned towards us from a little private talk with Mrs. Blinder. We kissed Charley, and took her downstairs with us, and stopped outside the house to see her run away to her work. I don't know where she was going, but we saw her run, such a little, little creature in her womanly bonnet and apron, through a covered way at the bottom of the court and melt into the city's strife and sound like a dewdrop in an ocean.",
        "paragraph_chars": [
            [
                0,
                1032
            ],
            [
                1032,
                2149
            ],
            [
                2149,
                3252
            ],
            [
                3252,
                3803
            ],
            [
                3803,
                3997
            ],
            [
                3997,
                5043
            ],
            [
                5043,
                5545
            ],
            [
                5545,
                5651
            ],
            [
                5651,
                6438
            ],
            [
                6438,
                6496
            ],
            [
                6496,
                6748
            ],
            [
                6748,
                6840
            ],
            [
                6840,
                7108
            ],
            [
                7108,
                7531
            ],
            [
                7531,
                7938
            ],
            [
                7938,
                8059
            ],
            [
                8059,
                8078
            ],
            [
                8078,
                8203
            ],
            [
                8203,
                8371
            ],
            [
                8371,
                8726
            ],
            [
                8726,
                8827
            ],
            [
                8827,
                9067
            ],
            [
                9067,
                9286
            ],
            [
                9286,
                9511
            ],
            [
                9511,
                9583
            ],
            [
                9583,
                10086
            ],
            [
                10086,
                10244
            ],
            [
                10244,
                10585
            ],
            [
                10585,
                10854
            ],
            [
                10854,
                10929
            ],
            [
                10929,
                11022
            ],
            [
                11022,
                11051
            ],
            [
                11051,
                11093
            ],
            [
                11093,
                11126
            ],
            [
                11126,
                11145
            ],
            [
                11145,
                11224
            ],
            [
                11224,
                11312
            ],
            [
                11312,
                11492
            ],
            [
                11492,
                11636
            ],
            [
                11636,
                12044
            ],
            [
                12044,
                12225
            ],
            [
                12225,
                12661
            ],
            [
                12661,
                12744
            ],
            [
                12744,
                12787
            ],
            [
                12787,
                13425
            ],
            [
                13425,
                13590
            ],
            [
                13590,
                14156
            ],
            [
                14156,
                14212
            ],
            [
                14212,
                14267
            ],
            [
                14267,
                14294
            ],
            [
                14294,
                14355
            ],
            [
                14355,
                14400
            ],
            [
                14400,
                14500
            ],
            [
                14500,
                14524
            ],
            [
                14524,
                14690
            ],
            [
                14690,
                15235
            ],
            [
                15235,
                15494
            ],
            [
                15494,
                15530
            ],
            [
                15530,
                15789
            ],
            [
                15789,
                16044
            ],
            [
                16044,
                16262
            ],
            [
                16262,
                16319
            ],
            [
                16319,
                16360
            ],
            [
                16360,
                16431
            ],
            [
                16431,
                16556
            ],
            [
                16556,
                16631
            ],
            [
                16631,
                16734
            ],
            [
                16734,
                16852
            ],
            [
                16852,
                16925
            ],
            [
                16925,
                17011
            ],
            [
                17011,
                17099
            ],
            [
                17099,
                17139
            ],
            [
                17139,
                17469
            ],
            [
                17469,
                17496
            ],
            [
                17496,
                17607
            ],
            [
                17607,
                17663
            ],
            [
                17663,
                17909
            ],
            [
                17909,
                17935
            ],
            [
                17935,
                18075
            ],
            [
                18075,
                18124
            ],
            [
                18124,
                18425
            ],
            [
                18425,
                18685
            ],
            [
                18685,
                19205
            ],
            [
                19205,
                19545
            ],
            [
                19545,
                19632
            ],
            [
                19632,
                19898
            ],
            [
                19898,
                20439
            ],
            [
                20439,
                20484
            ],
            [
                20484,
                20925
            ],
            [
                20925,
                20969
            ],
            [
                20969,
                21274
            ],
            [
                21274,
                21303
            ],
            [
                21303,
                21643
            ],
            [
                21643,
                21709
            ],
            [
                21709,
                22561
            ],
            [
                22561,
                22907
            ],
            [
                22907,
                23156
            ],
            [
                23156,
                23387
            ],
            [
                23387,
                23457
            ],
            [
                23457,
                23669
            ],
            [
                23669,
                23765
            ],
            [
                23765,
                23890
            ],
            [
                23890,
                23911
            ],
            [
                23911,
                24049
            ],
            [
                24049,
                24079
            ],
            [
                24079,
                24639
            ],
            [
                24639,
                24819
            ],
            [
                24819,
                25656
            ],
            [
                25656,
                25826
            ],
            [
                25826,
                27772
            ],
            [
                27772,
                27926
            ],
            [
                27926,
                28919
            ],
            [
                28919,
                29002
            ],
            [
                29002,
                30544
            ],
            [
                30544,
                30680
            ],
            [
                30680,
                30893
            ],
            [
                30893,
                30936
            ],
            [
                30936,
                31197
            ],
            [
                31197,
                31353
            ],
            [
                31353,
                33383
            ],
            [
                33383,
                34011
            ]
        ],
        "segment_chars": [
            [
                0,
                150
            ],
            [
                150,
                236
            ],
            [
                236,
                468
            ],
            [
                468,
                589
            ],
            [
                589,
                658
            ],
            [
                658,
                781
            ],
            [
                781,
                920
            ],
            [
                920,
                1032
            ],
            [
                1032,
                1118
            ],
            [
                1118,
                1245
            ],
            [
                1245,
                1351
            ],
            [
                1351,
                1393
            ],
            [
                1393,
                1877
            ],
            [
                1877,
                2149
            ],
            [
                2149,
                2826
            ],
            [
                2826,
                3252
            ],
            [
                3252,
                3310
            ],
            [
                3310,
                3606
            ],
            [
                3606,
                3732
            ],
            [
                3732,
                3803
            ],
            [
                3803,
                3905
            ],
            [
                3905,
                3997
            ],
            [
                3997,
                4025
            ],
            [
                4025,
                4155
            ],
            [
                4155,
                4223
            ],
            [
                4223,
                4294
            ],
            [
                4294,
                4353
            ],
            [
                4353,
                4481
            ],
            [
                4481,
                4565
            ],
            [
                4565,
                4659
            ],
            [
                4659,
                4826
            ],
            [
                4826,
                4881
            ],
            [
                4881,
                4892
            ],
            [
                4892,
                5043
            ],
            [
                5043,
                5153
            ],
            [
                5153,
                5177
            ],
            [
                5177,
                5226
            ],
            [
                5226,
                5381
            ],
            [
                5381,
                5452
            ],
            [
                5452,
                5518
            ],
            [
                5518,
                5532
            ],
            [
                5532,
                5545
            ],
            [
                5545,
                5651
            ],
            [
                5651,
                5702
            ],
            [
                5702,
                5735
            ],
            [
                5735,
                5790
            ],
            [
                5790,
                5861
            ],
            [
                5861,
                5934
            ],
            [
                5934,
                5976
            ],
            [
                5976,
                5998
            ],
            [
                5998,
                6026
            ],
            [
                6026,
                6101
            ],
            [
                6101,
                6173
            ],
            [
                6173,
                6192
            ],
            [
                6192,
                6211
            ],
            [
                6211,
                6263
            ],
            [
                6263,
                6385
            ],
            [
                6385,
                6404
            ],
            [
                6404,
                6438
            ],
            [
                6438,
                6474
            ],
            [
                6474,
                6496
            ],
            [
                6496,
                6549
            ],
            [
                6549,
                6607
            ],
            [
                6607,
                6639
            ],
            [
                6639,
                6748
            ],
            [
                6748,
                6840
            ],
            [
                6840,
                6920
            ],
            [
                6920,
                6960
            ],
            [
                6960,
                7054
            ],
            [
                7054,
                7108
            ],
            [
                7108,
                7302
            ],
            [
                7302,
                7448
            ],
            [
                7448,
                7531
            ],
            [
                7531,
                7732
            ],
            [
                7732,
                7777
            ],
            [
                7777,
                7807
            ],
            [
                7807,
                7826
            ],
            [
                7826,
                7837
            ],
            [
                7837,
                7864
            ],
            [
                7864,
                7886
            ],
            [
                7886,
                7938
            ],
            [
                7938,
                8059
            ],
            [
                8059,
                8070
            ],
            [
                8070,
                8078
            ],
            [
                8078,
                8149
            ],
            [
                8149,
                8203
            ],
            [
                8203,
                8371
            ],
            [
                8371,
                8435
            ],
            [
                8435,
                8506
            ],
            [
                8506,
                8562
            ],
            [
                8562,
                8619
            ],
            [
                8619,
                8710
            ],
            [
                8710,
                8726
            ],
            [
                8726,
                8827
            ],
            [
                8827,
                8931
            ],
            [
                8931,
                8947
            ],
            [
                8947,
                8958
            ],
            [
                8958,
                8990
            ],
            [
                8990,
                9007
            ],
            [
                9007,
                9029
            ],
            [
                9029,
                9067
            ],
            [
                9067,
                9131
            ],
            [
                9131,
                9195
            ],
            [
                9195,
                9286
            ],
            [
                9286,
                9458
            ],
            [
                9458,
                9511
            ],
            [
                9511,
                9583
            ],
            [
                9583,
                9826
            ],
            [
                9826,
                9985
            ],
            [
                9985,
                10017
            ],
            [
                10017,
                10045
            ],
            [
                10045,
                10086
            ],
            [
                10086,
                10091
            ],
            [
                10091,
                10103
            ],
            [
                10103,
                10159
            ],
            [
                10159,
                10176
            ],
            [
                10176,
                10244
            ],
            [
                10244,
                10309
            ],
            [
                10309,
                10316
            ],
            [
                10316,
                10349
            ],
            [
                10349,
                10387
            ],
            [
                10387,
                10423
            ],
            [
                10423,
                10483
            ],
            [
                10483,
                10585
            ],
            [
                10585,
                10719
            ],
            [
                10719,
                10854
            ],
            [
                10854,
                10874
            ],
            [
                10874,
                10929
            ],
            [
                10929,
                11022
            ],
            [
                11022,
                11029
            ],
            [
                11029,
                11043
            ],
            [
                11043,
                11051
            ],
            [
                11051,
                11093
            ],
            [
                11093,
                11126
            ],
            [
                11126,
                11145
            ],
            [
                11145,
                11172
            ],
            [
                11172,
                11224
            ],
            [
                11224,
                11312
            ],
            [
                11312,
                11327
            ],
            [
                11327,
                11341
            ],
            [
                11341,
                11361
            ],
            [
                11361,
                11393
            ],
            [
                11393,
                11492
            ],
            [
                11492,
                11553
            ],
            [
                11553,
                11605
            ],
            [
                11605,
                11616
            ],
            [
                11616,
                11636
            ],
            [
                11636,
                11848
            ],
            [
                11848,
                11920
            ],
            [
                11920,
                11955
            ],
            [
                11955,
                12044
            ],
            [
                12044,
                12066
            ],
            [
                12066,
                12099
            ],
            [
                12099,
                12119
            ],
            [
                12119,
                12146
            ],
            [
                12146,
                12179
            ],
            [
                12179,
                12225
            ],
            [
                12225,
                12326
            ],
            [
                12326,
                12461
            ],
            [
                12461,
                12661
            ],
            [
                12661,
                12692
            ],
            [
                12692,
                12744
            ],
            [
                12744,
                12787
            ],
            [
                12787,
                12929
            ],
            [
                12929,
                12961
            ],
            [
                12961,
                12973
            ],
            [
                12973,
                13004
            ],
            [
                13004,
                13127
            ],
            [
                13127,
                13296
            ],
            [
                13296,
                13425
            ],
            [
                13425,
                13481
            ],
            [
                13481,
                13561
            ],
            [
                13561,
                13590
            ],
            [
                13590,
                13645
            ],
            [
                13645,
                13823
            ],
            [
                13823,
                13947
            ],
            [
                13947,
                14156
            ],
            [
                14156,
                14192
            ],
            [
                14192,
                14212
            ],
            [
                14212,
                14267
            ],
            [
                14267,
                14294
            ],
            [
                14294,
                14299
            ],
            [
                14299,
                14327
            ],
            [
                14327,
                14355
            ],
            [
                14355,
                14400
            ],
            [
                14400,
                14485
            ],
            [
                14485,
                14500
            ],
            [
                14500,
                14524
            ],
            [
                14524,
                14690
            ],
            [
                14690,
                14985
            ],
            [
                14985,
                15100
            ],
            [
                15100,
                15235
            ],
            [
                15235,
                15331
            ],
            [
                15331,
                15494
            ],
            [
                15494,
                15516
            ],
            [
                15516,
                15530
            ],
            [
                15530,
                15618
            ],
            [
                15618,
                15789
            ],
            [
                15789,
                15999
            ],
            [
                15999,
                16013
            ],
            [
                16013,
                16044
            ],
            [
                16044,
                16071
            ],
            [
                16071,
                16262
            ],
            [
                16262,
                16282
            ],
            [
                16282,
                16300
            ],
            [
                16300,
                16319
            ],
            [
                16319,
                16360
            ],
            [
                16360,
                16365
            ],
            [
                16365,
                16402
            ],
            [
                16402,
                16431
            ],
            [
                16431,
                16556
            ],
            [
                16556,
                16613
            ],
            [
                16613,
                16631
            ],
            [
                16631,
                16734
            ],
            [
                16734,
                16765
            ],
            [
                16765,
                16769
            ],
            [
                16769,
                16852
            ],
            [
                16852,
                16900
            ],
            [
                16900,
                16925
            ],
            [
                16925,
                16950
            ],
            [
                16950,
                16968
            ],
            [
                16968,
                17011
            ],
            [
                17011,
                17053
            ],
            [
                17053,
                17099
            ],
            [
                17099,
                17125
            ],
            [
                17125,
                17139
            ],
            [
                17139,
                17232
            ],
            [
                17232,
                17298
            ],
            [
                17298,
                17314
            ],
            [
                17314,
                17421
            ],
            [
                17421,
                17469
            ],
            [
                17469,
                17496
            ],
            [
                17496,
                17607
            ],
            [
                17607,
                17663
            ],
            [
                17663,
                17703
            ],
            [
                17703,
                17717
            ],
            [
                17717,
                17909
            ],
            [
                17909,
                17917
            ],
            [
                17917,
                17935
            ],
            [
                17935,
                18057
            ],
            [
                18057,
                18075
            ],
            [
                18075,
                18124
            ],
            [
                18124,
                18216
            ],
            [
                18216,
                18260
            ],
            [
                18260,
                18304
            ],
            [
                18304,
                18408
            ],
            [
                18408,
                18425
            ],
            [
                18425,
                18445
            ],
            [
                18445,
                18455
            ],
            [
                18455,
                18468
            ],
            [
                18468,
                18685
            ],
            [
                18685,
                18771
            ],
            [
                18771,
                18993
            ],
            [
                18993,
                19205
            ],
            [
                19205,
                19545
            ],
            [
                19545,
                19632
            ],
            [
                19632,
                19646
            ],
            [
                19646,
                19674
            ],
            [
                19674,
                19898
            ],
            [
                19898,
                19996
            ],
            [
                19996,
                20036
            ],
            [
                20036,
                20137
            ],
            [
                20137,
                20215
            ],
            [
                20215,
                20221
            ],
            [
                20221,
                20295
            ],
            [
                20295,
                20439
            ],
            [
                20439,
                20466
            ],
            [
                20466,
                20484
            ],
            [
                20484,
                20551
            ],
            [
                20551,
                20667
            ],
            [
                20667,
                20696
            ],
            [
                20696,
                20737
            ],
            [
                20737,
                20820
            ],
            [
                20820,
                20925
            ],
            [
                20925,
                20951
            ],
            [
                20951,
                20969
            ],
            [
                20969,
                21012
            ],
            [
                21012,
                21093
            ],
            [
                21093,
                21274
            ],
            [
                21274,
                21303
            ],
            [
                21303,
                21470
            ],
            [
                21470,
                21519
            ],
            [
                21519,
                21593
            ],
            [
                21593,
                21643
            ],
            [
                21643,
                21689
            ],
            [
                21689,
                21709
            ],
            [
                21709,
                21855
            ],
            [
                21855,
                21924
            ],
            [
                21924,
                22087
            ],
            [
                22087,
                22113
            ],
            [
                22113,
                22366
            ],
            [
                22366,
                22493
            ],
            [
                22493,
                22561
            ],
            [
                22561,
                22719
            ],
            [
                22719,
                22907
            ],
            [
                22907,
                23046
            ],
            [
                23046,
                23081
            ],
            [
                23081,
                23096
            ],
            [
                23096,
                23107
            ],
            [
                23107,
                23125
            ],
            [
                23125,
                23156
            ],
            [
                23156,
                23346
            ],
            [
                23346,
                23387
            ],
            [
                23387,
                23457
            ],
            [
                23457,
                23563
            ],
            [
                23563,
                23613
            ],
            [
                23613,
                23669
            ],
            [
                23669,
                23765
            ],
            [
                23765,
                23780
            ],
            [
                23780,
                23825
            ],
            [
                23825,
                23856
            ],
            [
                23856,
                23872
            ],
            [
                23872,
                23890
            ],
            [
                23890,
                23911
            ],
            [
                23911,
                24049
            ],
            [
                24049,
                24079
            ],
            [
                24079,
                24097
            ],
            [
                24097,
                24160
            ],
            [
                24160,
                24185
            ],
            [
                24185,
                24204
            ],
            [
                24204,
                24350
            ],
            [
                24350,
                24552
            ],
            [
                24552,
                24639
            ],
            [
                24639,
                24779
            ],
            [
                24779,
                24819
            ],
            [
                24819,
                24938
            ],
            [
                24938,
                25114
            ],
            [
                25114,
                25269
            ],
            [
                25269,
                25287
            ],
            [
                25287,
                25355
            ],
            [
                25355,
                25399
            ],
            [
                25399,
                25472
            ],
            [
                25472,
                25593
            ],
            [
                25593,
                25656
            ],
            [
                25656,
                25826
            ],
            [
                25826,
                25870
            ],
            [
                25870,
                25926
            ],
            [
                25926,
                25952
            ],
            [
                25952,
                26053
            ],
            [
                26053,
                26175
            ],
            [
                26175,
                26191
            ],
            [
                26191,
                26243
            ],
            [
                26243,
                26356
            ],
            [
                26356,
                26366
            ],
            [
                26366,
                26407
            ],
            [
                26407,
                26534
            ],
            [
                26534,
                26713
            ],
            [
                26713,
                26772
            ],
            [
                26772,
                26806
            ],
            [
                26806,
                26889
            ],
            [
                26889,
                26995
            ],
            [
                26995,
                27180
            ],
            [
                27180,
                27262
            ],
            [
                27262,
                27339
            ],
            [
                27339,
                27415
            ],
            [
                27415,
                27537
            ],
            [
                27537,
                27647
            ],
            [
                27647,
                27772
            ],
            [
                27772,
                27926
            ],
            [
                27926,
                27941
            ],
            [
                27941,
                27990
            ],
            [
                27990,
                28003
            ],
            [
                28003,
                28044
            ],
            [
                28044,
                28075
            ],
            [
                28075,
                28092
            ],
            [
                28092,
                28188
            ],
            [
                28188,
                28270
            ],
            [
                28270,
                28299
            ],
            [
                28299,
                28339
            ],
            [
                28339,
                28648
            ],
            [
                28648,
                28671
            ],
            [
                28671,
                28688
            ],
            [
                28688,
                28742
            ],
            [
                28742,
                28810
            ],
            [
                28810,
                28919
            ],
            [
                28919,
                28944
            ],
            [
                28944,
                29002
            ],
            [
                29002,
                29017
            ],
            [
                29017,
                29060
            ],
            [
                29060,
                29088
            ],
            [
                29088,
                29110
            ],
            [
                29110,
                29130
            ],
            [
                29130,
                29175
            ],
            [
                29175,
                29228
            ],
            [
                29228,
                29295
            ],
            [
                29295,
                29478
            ],
            [
                29478,
                29543
            ],
            [
                29543,
                29611
            ],
            [
                29611,
                29661
            ],
            [
                29661,
                29814
            ],
            [
                29814,
                29982
            ],
            [
                29982,
                30201
            ],
            [
                30201,
                30262
            ],
            [
                30262,
                30320
            ],
            [
                30320,
                30511
            ],
            [
                30511,
                30544
            ],
            [
                30544,
                30680
            ],
            [
                30680,
                30795
            ],
            [
                30795,
                30853
            ],
            [
                30853,
                30893
            ],
            [
                30893,
                30899
            ],
            [
                30899,
                30909
            ],
            [
                30909,
                30936
            ],
            [
                30936,
                30962
            ],
            [
                30962,
                30990
            ],
            [
                30990,
                30995
            ],
            [
                30995,
                31019
            ],
            [
                31019,
                31102
            ],
            [
                31102,
                31169
            ],
            [
                31169,
                31197
            ],
            [
                31197,
                31353
            ],
            [
                31353,
                31455
            ],
            [
                31455,
                31555
            ],
            [
                31555,
                31970
            ],
            [
                31970,
                32013
            ],
            [
                32013,
                32365
            ],
            [
                32365,
                32389
            ],
            [
                32389,
                32489
            ],
            [
                32489,
                32569
            ],
            [
                32569,
                32604
            ],
            [
                32604,
                32643
            ],
            [
                32643,
                32815
            ],
            [
                32815,
                32884
            ],
            [
                32884,
                32920
            ],
            [
                32920,
                33177
            ],
            [
                33177,
                33383
            ],
            [
                33383,
                33660
            ],
            [
                33660,
                33775
            ],
            [
                33775,
                34011
            ]
        ],
        "overlap_chars": [
            [
                0,
                60
            ],
            [
                74,
                104
            ],
            [
                148,
                150
            ],
            [
                150,
                210
            ],
            [
                234,
                236
            ],
            [
                236,
                245
            ],
            [
                332,
                468
            ],
            [
                503,
                516
            ],
            [
                530,
                539
            ],
            [
                563,
                576
            ],
            [
                587,
                589
            ],
            [
                781,
                802
            ],
            [
                813,
                920
            ],
            [
                920,
                981
            ],
            [
                999,
                1032
            ],
            [
                1032,
                1116
            ],
            [
                1146,
                1147
            ],
            [
                1158,
                1166
            ],
            [
                1142,
                1146
            ],
            [
                1167,
                1172
            ],
            [
                1243,
                1245
            ],
            [
                1245,
                1259
            ],
            [
                1294,
                1305
            ],
            [
                1266,
                1290
            ],
            [
                1309,
                1351
            ],
            [
                1351,
                1393
            ],
            [
                1393,
                1404
            ],
            [
                1411,
                1434
            ],
            [
                1455,
                1459
            ],
            [
                1463,
                1500
            ],
            [
                1564,
                1573
            ],
            [
                1589,
                1664
            ],
            [
                1681,
                1716
            ],
            [
                1718,
                1786
            ],
            [
                1875,
                1877
            ],
            [
                2109,
                2111
            ],
            [
                2004,
                2009
            ],
            [
                2019,
                2099
            ],
            [
                2147,
                2149
            ],
            [
                2149,
                2250
            ],
            [
                2259,
                2263
            ],
            [
                2276,
                2281
            ],
            [
                2806,
                2808
            ],
            [
                2817,
                2824
            ],
            [
                2282,
                2358
            ],
            [
                2364,
                2373
            ],
            [
                2379,
                2380
            ],
            [
                2447,
                2450
            ],
            [
                2387,
                2411
            ],
            [
                2420,
                2430
            ],
            [
                2520,
                2524
            ],
            [
                2516,
                2519
            ],
            [
                2483,
                2491
            ],
            [
                2534,
                2543
            ],
            [
                2575,
                2588
            ],
            [
                2755,
                2757
            ],
            [
                2602,
                2656
            ],
            [
                2665,
                2681
            ],
            [
                2657,
                2664
            ],
            [
                2481,
                2482
            ],
            [
                2728,
                2735
            ],
            [
                2824,
                2826
            ],
            [
                2826,
                2848
            ],
            [
                2863,
                2912
            ],
            [
                2924,
                3005
            ],
            [
                3027,
                3080
            ],
            [
                3125,
                3155
            ],
            [
                3156,
                3165
            ],
            [
                3194,
                3252
            ],
            [
                3252,
                3310
            ],
            [
                3310,
                3489
            ],
            [
                3604,
                3606
            ],
            [
                3606,
                3650
            ],
            [
                3659,
                3667
            ],
            [
                3679,
                3731
            ],
            [
                3803,
                3829
            ],
            [
                3847,
                3849
            ],
            [
                3900,
                3903
            ],
            [
                3908,
                3997
            ],
            [
                3997,
                4025
            ],
            [
                4025,
                4135
            ],
            [
                4153,
                4155
            ],
            [
                4353,
                4359
            ],
            [
                4372,
                4481
            ],
            [
                4481,
                4513
            ],
            [
                4515,
                4541
            ],
            [
                4543,
                4565
            ],
            [
                4565,
                4585
            ],
            [
                4618,
                4659
            ],
            [
                4659,
                4751
            ],
            [
                4779,
                4826
            ],
            [
                4826,
                4881
            ],
            [
                4881,
                4892
            ],
            [
                4915,
                4939
            ],
            [
                4948,
                4949
            ],
            [
                4964,
                5043
            ],
            [
                5043,
                5153
            ],
            [
                5153,
                5177
            ],
            [
                5177,
                5224
            ],
            [
                5224,
                5226
            ],
            [
                5381,
                5428
            ],
            [
                5429,
                5450
            ],
            [
                5545,
                5596
            ],
            [
                5597,
                5611
            ],
            [
                5623,
                5651
            ],
            [
                5651,
                5685
            ],
            [
                5735,
                5762
            ],
            [
                5772,
                5781
            ],
            [
                5788,
                5790
            ],
            [
                5790,
                5858
            ],
            [
                6049,
                6101
            ],
            [
                6101,
                6139
            ],
            [
                6171,
                6173
            ],
            [
                6211,
                6263
            ],
            [
                6263,
                6304
            ],
            [
                6313,
                6315
            ],
            [
                6318,
                6385
            ],
            [
                6385,
                6402
            ],
            [
                6438,
                6474
            ],
            [
                6474,
                6496
            ],
            [
                6496,
                6504
            ],
            [
                6527,
                6549
            ],
            [
                6549,
                6607
            ],
            [
                6615,
                6639
            ],
            [
                6639,
                6648
            ],
            [
                6652,
                6748
            ],
            [
                6748,
                6840
            ],
            [
                6840,
                6863
            ],
            [
                6871,
                6920
            ],
            [
                6920,
                6944
            ],
            [
                6946,
                6960
            ],
            [
                7054,
                7108
            ],
            [
                7108,
                7302
            ],
            [
                7448,
                7466
            ],
            [
                7488,
                7531
            ],
            [
                7531,
                7618
            ],
            [
                7663,
                7664
            ],
            [
                7720,
                7732
            ],
            [
                7732,
                7777
            ],
            [
                7777,
                7807
            ],
            [
                7807,
                7816
            ],
            [
                7837,
                7864
            ],
            [
                7864,
                7874
            ],
            [
                7886,
                7938
            ],
            [
                7938,
                7949
            ],
            [
                7984,
                8021
            ],
            [
                7982,
                7983
            ],
            [
                8026,
                8059
            ],
            [
                8059,
                8070
            ],
            [
                8070,
                8078
            ],
            [
                8078,
                8149
            ],
            [
                8149,
                8152
            ],
            [
                8200,
                8203
            ],
            [
                8203,
                8234
            ],
            [
                8239,
                8240
            ],
            [
                8253,
                8261
            ],
            [
                8315,
                8371
            ],
            [
                8371,
                8435
            ],
            [
                8435,
                8468
            ],
            [
                8504,
                8506
            ],
            [
                8506,
                8562
            ],
            [
                8562,
                8587
            ],
            [
                8605,
                8619
            ],
            [
                8619,
                8650
            ],
            [
                8651,
                8710
            ],
            [
                8710,
                8726
            ],
            [
                8726,
                8827
            ],
            [
                8827,
                8875
            ],
            [
                8904,
                8907
            ],
            [
                8911,
                8931
            ],
            [
                8931,
                8947
            ],
            [
                8947,
                8958
            ],
            [
                8958,
                8966
            ],
            [
                8978,
                8990
            ],
            [
                8990,
                9007
            ],
            [
                9029,
                9038
            ],
            [
                9052,
                9067
            ],
            [
                9067,
                9131
            ],
            [
                9131,
                9193
            ],
            [
                9383,
                9433
            ],
            [
                9284,
                9286
            ],
            [
                9458,
                9511
            ],
            [
                9511,
                9523
            ],
            [
                9562,
                9571
            ],
            [
                9523,
                9524
            ],
            [
                9572,
                9583
            ],
            [
                9583,
                9627
            ],
            [
                9824,
                9826
            ],
            [
                9826,
                9870
            ],
            [
                9884,
                9886
            ],
            [
                9927,
                9985
            ],
            [
                9985,
                10017
            ],
            [
                10017,
                10045
            ],
            [
                10045,
                10086
            ],
            [
                10086,
                10091
            ],
            [
                10091,
                10103
            ],
            [
                10103,
                10121
            ],
            [
                10157,
                10159
            ],
            [
                10159,
                10176
            ],
            [
                10178,
                10209
            ],
            [
                10241,
                10244
            ],
            [
                10244,
                10269
            ],
            [
                10307,
                10309
            ],
            [
                10309,
                10316
            ],
            [
                10316,
                10347
            ],
            [
                10387,
                10421
            ],
            [
                10441,
                10445
            ],
            [
                10423,
                10435
            ],
            [
                10453,
                10483
            ],
            [
                10483,
                10585
            ],
            [
                10585,
                10719
            ],
            [
                10719,
                10725
            ],
            [
                10751,
                10768
            ],
            [
                10774,
                10797
            ],
            [
                10808,
                10845
            ],
            [
                10852,
                10854
            ],
            [
                10854,
                10874
            ],
            [
                10874,
                10929
            ],
            [
                10929,
                10939
            ],
            [
                10955,
                11019
            ],
            [
                11052,
                11093
            ],
            [
                11093,
                11126
            ],
            [
                11126,
                11145
            ],
            [
                11145,
                11172
            ],
            [
                11172,
                11204
            ],
            [
                11221,
                11224
            ],
            [
                11224,
                11231
            ],
            [
                11298,
                11312
            ],
            [
                11312,
                11313
            ],
            [
                11317,
                11327
            ],
            [
                11327,
                11341
            ],
            [
                11341,
                11361
            ],
            [
                11361,
                11393
            ],
            [
                11393,
                11401
            ],
            [
                11414,
                11492
            ],
            [
                11492,
                11539
            ],
            [
                11551,
                11553
            ],
            [
                11553,
                11605
            ],
            [
                11605,
                11616
            ],
            [
                11616,
                11636
            ],
            [
                11636,
                11652
            ],
            [
                11679,
                11682
            ],
            [
                11860,
                11893
            ],
            [
                11897,
                11898
            ],
            [
                11904,
                11918
            ],
            [
                11918,
                11920
            ],
            [
                11920,
                11955
            ],
            [
                11955,
                11979
            ],
            [
                11980,
                11997
            ],
            [
                12042,
                12044
            ],
            [
                12044,
                12066
            ],
            [
                12066,
                12099
            ],
            [
                12099,
                12119
            ],
            [
                12146,
                12179
            ],
            [
                12179,
                12204
            ],
            [
                12223,
                12225
            ],
            [
                12380,
                12381
            ],
            [
                12429,
                12461
            ],
            [
                12461,
                12496
            ],
            [
                12548,
                12574
            ],
            [
                12581,
                12661
            ],
            [
                12661,
                12692
            ],
            [
                12692,
                12744
            ],
            [
                12744,
                12787
            ],
            [
                12787,
                12882
            ],
            [
                12927,
                12929
            ],
            [
                12929,
                12960
            ],
            [
                12961,
                12973
            ],
            [
                12973,
                13004
            ],
            [
                13004,
                13050
            ],
            [
                13084,
                13127
            ],
            [
                13206,
                13209
            ],
            [
                13136,
                13145
            ],
            [
                13164,
                13182
            ],
            [
                13277,
                13296
            ],
            [
                13296,
                13361
            ],
            [
                13372,
                13425
            ],
            [
                13425,
                13436
            ],
            [
                13446,
                13481
            ],
            [
                13481,
                13559
            ],
            [
                13590,
                13607
            ],
            [
                13624,
                13645
            ],
            [
                13645,
                13823
            ],
            [
                13823,
                13917
            ],
            [
                13930,
                13947
            ],
            [
                13997,
                14094
            ],
            [
                14107,
                14156
            ],
            [
                14156,
                14192
            ],
            [
                14192,
                14194
            ],
            [
                14205,
                14212
            ],
            [
                14212,
                14236
            ],
            [
                14260,
                14267
            ],
            [
                14267,
                14294
            ],
            [
                14294,
                14299
            ],
            [
                14299,
                14325
            ],
            [
                14355,
                14400
            ],
            [
                14400,
                14484
            ],
            [
                14500,
                14524
            ],
            [
                14524,
                14594
            ],
            [
                14651,
                14690
            ],
            [
                14752,
                14856
            ],
            [
                14864,
                14865
            ],
            [
                14858,
                14864
            ],
            [
                14871,
                14874
            ],
            [
                14884,
                14885
            ],
            [
                14902,
                14959
            ],
            [
                14978,
                14985
            ],
            [
                14985,
                15038
            ],
            [
                15076,
                15085
            ],
            [
                15043,
                15052
            ],
            [
                15086,
                15099
            ],
            [
                15235,
                15271
            ],
            [
                15306,
                15331
            ],
            [
                15331,
                15343
            ],
            [
                15370,
                15478
            ],
            [
                15487,
                15494
            ],
            [
                15494,
                15516
            ],
            [
                15516,
                15530
            ],
            [
                15530,
                15605
            ],
            [
                15616,
                15618
            ],
            [
                15618,
                15641
            ],
            [
                15708,
                15767
            ],
            [
                15773,
                15789
            ],
            [
                15789,
                15870
            ],
            [
                15883,
                15889
            ],
            [
                15960,
                15999
            ],
            [
                15999,
                16013
            ],
            [
                16013,
                16044
            ],
            [
                16044,
                16071
            ],
            [
                16071,
                16089
            ],
            [
                16096,
                16150
            ],
            [
                16165,
                16186
            ],
            [
                16187,
                16215
            ],
            [
                16260,
                16262
            ],
            [
                16262,
                16263
            ],
            [
                16272,
                16282
            ],
            [
                16282,
                16300
            ],
            [
                16300,
                16319
            ],
            [
                16319,
                16360
            ],
            [
                16360,
                16365
            ],
            [
                16365,
                16402
            ],
            [
                16431,
                16510
            ],
            [
                16524,
                16539
            ],
            [
                16554,
                16556
            ],
            [
                16556,
                16613
            ],
            [
                16613,
                16617
            ],
            [
                16629,
                16631
            ],
            [
                16631,
                16662
            ],
            [
                16713,
                16734
            ],
            [
                16734,
                16738
            ],
            [
                16765,
                16769
            ],
            [
                16769,
                16852
            ],
            [
                16852,
                16900
            ],
            [
                16900,
                16915
            ],
            [
                16922,
                16925
            ],
            [
                16925,
                16950
            ],
            [
                16950,
                16968
            ],
            [
                16968,
                17011
            ],
            [
                17011,
                17014
            ],
            [
                17023,
                17053
            ],
            [
                17053,
                17099
            ],
            [
                17099,
                17123
            ],
            [
                17139,
                17140
            ],
            [
                17152,
                17232
            ],
            [
                17232,
                17298
            ],
            [
                17298,
                17314
            ],
            [
                17321,
                17419
            ],
            [
                17469,
                17496
            ],
            [
                17496,
                17530
            ],
            [
                17552,
                17607
            ],
            [
                17607,
                17663
            ],
            [
                17663,
                17703
            ],
            [
                17703,
                17717
            ],
            [
                17717,
                17793
            ],
            [
                17802,
                17909
            ],
            [
                17909,
                17917
            ],
            [
                17917,
                17935
            ],
            [
                17935,
                18034
            ],
            [
                18055,
                18057
            ],
            [
                18057,
                18075
            ],
            [
                18075,
                18124
            ],
            [
                18124,
                18177
            ],
            [
                18179,
                18216
            ],
            [
                18216,
                18260
            ],
            [
                18260,
                18304
            ],
            [
                18304,
                18408
            ],
            [
                18408,
                18425
            ],
            [
                18425,
                18445
            ],
            [
                18445,
                18455
            ],
            [
                18455,
                18468
            ],
            [
                18468,
                18565
            ],
            [
                18592,
                18685
            ],
            [
                18685,
                18771
            ],
            [
                18771,
                18824
            ],
            [
                18831,
                18907
            ],
            [
                18909,
                18912
            ],
            [
                18991,
                18993
            ],
            [
                18993,
                19050
            ],
            [
                19162,
                19205
            ],
            [
                19205,
                19310
            ],
            [
                19391,
                19452
            ],
            [
                19315,
                19318
            ],
            [
                19513,
                19545
            ],
            [
                19545,
                19629
            ],
            [
                19632,
                19646
            ],
            [
                19646,
                19674
            ],
            [
                19674,
                19675
            ],
            [
                19693,
                19769
            ],
            [
                19780,
                19817
            ],
            [
                19819,
                19848
            ],
            [
                19860,
                19898
            ],
            [
                19898,
                19962
            ],
            [
                19969,
                19996
            ],
            [
                19996,
                20014
            ],
            [
                20032,
                20036
            ],
            [
                20036,
                20137
            ],
            [
                20137,
                20215
            ],
            [
                20215,
                20221
            ],
            [
                20221,
                20244
            ],
            [
                20269,
                20287
            ],
            [
                20289,
                20295
            ],
            [
                20295,
                20302
            ],
            [
                20337,
                20439
            ],
            [
                20439,
                20455
            ],
            [
                20463,
                20466
            ],
            [
                20466,
                20484
            ],
            [
                20484,
                20516
            ],
            [
                20549,
                20551
            ],
            [
                20551,
                20667
            ],
            [
                20667,
                20694
            ],
            [
                20715,
                20737
            ],
            [
                20820,
                20925
            ],
            [
                20925,
                20951
            ],
            [
                20951,
                20969
            ],
            [
                20969,
                20990
            ],
            [
                21010,
                21012
            ],
            [
                21013,
                21016
            ],
            [
                21024,
                21042
            ],
            [
                21074,
                21093
            ],
            [
                21093,
                21274
            ],
            [
                21274,
                21303
            ],
            [
                21303,
                21400
            ],
            [
                21468,
                21470
            ],
            [
                21470,
                21504
            ],
            [
                21506,
                21509
            ],
            [
                21510,
                21519
            ],
            [
                21553,
                21591
            ],
            [
                21643,
                21689
            ],
            [
                21689,
                21709
            ],
            [
                21709,
                21826
            ],
            [
                21835,
                21855
            ],
            [
                21855,
                21885
            ],
            [
                21924,
                21939
            ],
            [
                22017,
                22043
            ],
            [
                22056,
                22061
            ],
            [
                22063,
                22073
            ],
            [
                22075,
                22087
            ],
            [
                22113,
                22159
            ],
            [
                22168,
                22176
            ],
            [
                22316,
                22321
            ],
            [
                22178,
                22208
            ],
            [
                22330,
                22342
            ],
            [
                22364,
                22366
            ],
            [
                22366,
                22383
            ],
            [
                22406,
                22411
            ],
            [
                22415,
                22445
            ],
            [
                22491,
                22493
            ],
            [
                22493,
                22561
            ],
            [
                22561,
                22585
            ],
            [
                22643,
                22653
            ],
            [
                22703,
                22708
            ],
            [
                22717,
                22719
            ],
            [
                22719,
                22831
            ],
            [
                22836,
                22847
            ],
            [
                22875,
                22907
            ],
            [
                22907,
                22980
            ],
            [
                23013,
                23046
            ],
            [
                23081,
                23096
            ],
            [
                23096,
                23107
            ],
            [
                23107,
                23125
            ],
            [
                23125,
                23146
            ],
            [
                23153,
                23156
            ],
            [
                23156,
                23267
            ],
            [
                23281,
                23286
            ],
            [
                23297,
                23321
            ],
            [
                23325,
                23329
            ],
            [
                23344,
                23345
            ],
            [
                23563,
                23590
            ],
            [
                23467,
                23468
            ],
            [
                23591,
                23611
            ],
            [
                23483,
                23485
            ],
            [
                23504,
                23530
            ],
            [
                23611,
                23613
            ],
            [
                23613,
                23669
            ],
            [
                23669,
                23740
            ],
            [
                23752,
                23761
            ],
            [
                23765,
                23780
            ],
            [
                23780,
                23807
            ],
            [
                23818,
                23825
            ],
            [
                23825,
                23856
            ],
            [
                23856,
                23872
            ],
            [
                23872,
                23890
            ],
            [
                23890,
                23911
            ],
            [
                23911,
                24049
            ],
            [
                24049,
                24050
            ],
            [
                24058,
                24079
            ],
            [
                24079,
                24097
            ],
            [
                24097,
                24131
            ],
            [
                24133,
                24134
            ],
            [
                24141,
                24160
            ],
            [
                24160,
                24185
            ],
            [
                24204,
                24207
            ],
            [
                24231,
                24232
            ],
            [
                24234,
                24297
            ],
            [
                24348,
                24350
            ],
            [
                24350,
                24460
            ],
            [
                24470,
                24552
            ],
            [
                24552,
                24563
            ],
            [
                24595,
                24639
            ],
            [
                24639,
                24693
            ],
            [
                24705,
                24779
            ],
            [
                24779,
                24806
            ],
            [
                24808,
                24819
            ],
            [
                24819,
                24847
            ],
            [
                24879,
                24938
            ],
            [
                25052,
                25114
            ],
            [
                25114,
                25142
            ],
            [
                25228,
                25269
            ],
            [
                25356,
                25399
            ],
            [
                25399,
                25412
            ],
            [
                25458,
                25470
            ],
            [
                25439,
                25440
            ],
            [
                25518,
                25593
            ],
            [
                25593,
                25601
            ],
            [
                25607,
                25656
            ],
            [
                25718,
                25721
            ],
            [
                25660,
                25671
            ],
            [
                25800,
                25826
            ],
            [
                25826,
                25870
            ],
            [
                25926,
                25952
            ],
            [
                25952,
                26012
            ],
            [
                26026,
                26053
            ],
            [
                26053,
                26150
            ],
            [
                26156,
                26175
            ],
            [
                26175,
                26191
            ],
            [
                26191,
                26243
            ],
            [
                26243,
                26244
            ],
            [
                26270,
                26356
            ],
            [
                26356,
                26366
            ],
            [
                26366,
                26407
            ],
            [
                26407,
                26534
            ],
            [
                26534,
                26569
            ],
            [
                26577,
                26584
            ],
            [
                26679,
                26682
            ],
            [
                26585,
                26632
            ],
            [
                26711,
                26712
            ],
            [
                26713,
                26772
            ],
            [
                26772,
                26806
            ],
            [
                26806,
                26864
            ],
            [
                26889,
                26968
            ],
            [
                26993,
                26995
            ],
            [
                26995,
                27050
            ],
            [
                27052,
                27087
            ],
            [
                27097,
                27180
            ],
            [
                27180,
                27202
            ],
            [
                27204,
                27230
            ],
            [
                27233,
                27262
            ],
            [
                27262,
                27283
            ],
            [
                27284,
                27303
            ],
            [
                27317,
                27339
            ],
            [
                27339,
                27354
            ],
            [
                27396,
                27415
            ],
            [
                27415,
                27423
            ],
            [
                27425,
                27440
            ],
            [
                27509,
                27537
            ],
            [
                27537,
                27647
            ],
            [
                27647,
                27654
            ],
            [
                27655,
                27664
            ],
            [
                27689,
                27718
            ],
            [
                27733,
                27772
            ],
            [
                27772,
                27834
            ],
            [
                27903,
                27926
            ],
            [
                27926,
                27941
            ],
            [
                27941,
                27957
            ],
            [
                27988,
                27990
            ],
            [
                27990,
                28003
            ],
            [
                28003,
                28007
            ],
            [
                28008,
                28012
            ],
            [
                28025,
                28044
            ],
            [
                28270,
                28277
            ],
            [
                28299,
                28339
            ],
            [
                28339,
                28370
            ],
            [
                28372,
                28385
            ],
            [
                28419,
                28421
            ],
            [
                28370,
                28371
            ],
            [
                28648,
                28671
            ],
            [
                28671,
                28688
            ],
            [
                28742,
                28808
            ],
            [
                28944,
                28945
            ],
            [
                28956,
                28960
            ],
            [
                28973,
                28977
            ],
            [
                29000,
                29001
            ],
            [
                29024,
                29058
            ],
            [
                29017,
                29024
            ],
            [
                29002,
                29014
            ],
            [
                29086,
                29087
            ],
            [
                29063,
                29074
            ],
            [
                29088,
                29110
            ],
            [
                29130,
                29175
            ],
            [
                29175,
                29228
            ],
            [
                29228,
                29242
            ],
            [
                29266,
                29295
            ],
            [
                29611,
                29661
            ],
            [
                29661,
                29717
            ],
            [
                29812,
                29814
            ],
            [
                29814,
                29928
            ],
            [
                29933,
                29960
            ],
            [
                29966,
                29982
            ],
            [
                29982,
                29985
            ],
            [
                29995,
                30129
            ],
            [
                30148,
                30169
            ],
            [
                30198,
                30201
            ],
            [
                30201,
                30262
            ],
            [
                30262,
                30320
            ],
            [
                30320,
                30431
            ],
            [
                30544,
                30547
            ],
            [
                30636,
                30680
            ],
            [
                30680,
                30747
            ],
            [
                30769,
                30770
            ],
            [
                30754,
                30756
            ],
            [
                30774,
                30795
            ],
            [
                30795,
                30853
            ],
            [
                30853,
                30893
            ],
            [
                30893,
                30899
            ],
            [
                30899,
                30909
            ],
            [
                30909,
                30936
            ],
            [
                30936,
                30962
            ],
            [
                30962,
                30990
            ],
            [
                30990,
                30995
            ],
            [
                30995,
                31019
            ],
            [
                31019,
                31056
            ],
            [
                31100,
                31102
            ],
            [
                31102,
                31169
            ],
            [
                31169,
                31197
            ],
            [
                31197,
                31204
            ],
            [
                31261,
                31262
            ],
            [
                31216,
                31221
            ],
            [
                31222,
                31232
            ],
            [
                31280,
                31307
            ],
            [
                31317,
                31353
            ],
            [
                31353,
                31390
            ],
            [
                31430,
                31455
            ],
            [
                31455,
                31462
            ],
            [
                31470,
                31515
            ],
            [
                31523,
                31555
            ],
            [
                31555,
                31590
            ],
            [
                31609,
                31626
            ],
            [
                31688,
                31715
            ],
            [
                31727,
                31734
            ],
            [
                31751,
                31774
            ],
            [
                31775,
                31802
            ],
            [
                31815,
                31833
            ],
            [
                31874,
                31900
            ],
            [
                31934,
                31970
            ],
            [
                32365,
                32389
            ],
            [
                32389,
                32420
            ],
            [
                32457,
                32489
            ],
            [
                32489,
                32505
            ],
            [
                32507,
                32515
            ],
            [
                32607,
                32643
            ],
            [
                32926,
                32994
            ],
            [
                33001,
                33038
            ],
            [
                33175,
                33177
            ],
            [
                33191,
                33204
            ],
            [
                33214,
                33221
            ],
            [
                33205,
                33213
            ],
            [
                33222,
                33383
            ],
            [
                33383,
                33417
            ],
            [
                33472,
                33475
            ],
            [
                33490,
                33498
            ],
            [
                33552,
                33584
            ],
            [
                33590,
                33660
            ],
            [
                33660,
                33715
            ],
            [
                33749,
                33773
            ],
            [
                33827,
                33900
            ],
            [
                33932,
                33941
            ],
            [
                33742,
                33744
            ],
            [
                33946,
                34011
            ]
        ],
        "row_chars": [
            [
                0,
                150
            ],
            [
                150,
                236
            ],
            [
                236,
                468
            ],
            [
                468,
                589
            ],
            [
                589,
                658
            ],
            [
                658,
                781
            ],
            [
                781,
                920
            ],
            [
                920,
                1032
            ],
            [
                1032,
                1245
            ],
            [
                1245,
                1351
            ],
            [
                1351,
                1393
            ],
            [
                1393,
                1877
            ],
            [
                1877,
                2149
            ],
            [
                2149,
                2826
            ],
            [
                2826,
                3252
            ],
            [
                3252,
                3310
            ],
            [
                3310,
                3606
            ],
            [
                3606,
                3732
            ],
            [
                3732,
                3803
            ],
            [
                3803,
                3997
            ],
            [
                3997,
                4025
            ],
            [
                4025,
                4155
            ],
            [
                4155,
                4223
            ],
            [
                4223,
                4294
            ],
            [
                4294,
                4353
            ],
            [
                4353,
                4481
            ],
            [
                4481,
                4565
            ],
            [
                4565,
                4659
            ],
            [
                4659,
                4826
            ],
            [
                4826,
                4881
            ],
            [
                4881,
                4892
            ],
            [
                4892,
                5043
            ],
            [
                5043,
                5153
            ],
            [
                5153,
                5177
            ],
            [
                5177,
                5226
            ],
            [
                5226,
                5381
            ],
            [
                5381,
                5452
            ],
            [
                5452,
                5518
            ],
            [
                5518,
                5532
            ],
            [
                5532,
                5545
            ],
            [
                5545,
                5651
            ],
            [
                5651,
                5790
            ],
            [
                5790,
                5861
            ],
            [
                5861,
                5934
            ],
            [
                5934,
                5976
            ],
            [
                5976,
                5998
            ],
            [
                5998,
                6026
            ],
            [
                6026,
                6101
            ],
            [
                6101,
                6173
            ],
            [
                6173,
                6192
            ],
            [
                6192,
                6211
            ],
            [
                6211,
                6263
            ],
            [
                6263,
                6385
            ],
            [
                6385,
                6404
            ],
            [
                6404,
                6438
            ],
            [
                6438,
                6474
            ],
            [
                6474,
                6496
            ],
            [
                6496,
                6549
            ],
            [
                6549,
                6607
            ],
            [
                6607,
                6639
            ],
            [
                6639,
                6748
            ],
            [
                6748,
                6840
            ],
            [
                6840,
                6920
            ],
            [
                6920,
                6960
            ],
            [
                6960,
                7054
            ],
            [
                7054,
                7108
            ],
            [
                7108,
                7302
            ],
            [
                7302,
                7448
            ],
            [
                7448,
                7531
            ],
            [
                7531,
                7732
            ],
            [
                7732,
                7777
            ],
            [
                7777,
                7807
            ],
            [
                7807,
                7864
            ],
            [
                7864,
                7938
            ],
            [
                7938,
                8059
            ],
            [
                8059,
                8070
            ],
            [
                8070,
                8078
            ],
            [
                8078,
                8149
            ],
            [
                8149,
                8203
            ],
            [
                8203,
                8371
            ],
            [
                8371,
                8435
            ],
            [
                8435,
                8506
            ],
            [
                8506,
                8562
            ],
            [
                8562,
                8619
            ],
            [
                8619,
                8710
            ],
            [
                8710,
                8726
            ],
            [
                8726,
                8827
            ],
            [
                8827,
                8931
            ],
            [
                8931,
                8947
            ],
            [
                8947,
                8958
            ],
            [
                8958,
                8990
            ],
            [
                8990,
                9007
            ],
            [
                9007,
                9029
            ],
            [
                9029,
                9067
            ],
            [
                9067,
                9131
            ],
            [
                9131,
                9458
            ],
            [
                9458,
                9511
            ],
            [
                9511,
                9583
            ],
            [
                9583,
                9826
            ],
            [
                9826,
                9985
            ],
            [
                9985,
                10017
            ],
            [
                10017,
                10045
            ],
            [
                10045,
                10086
            ],
            [
                10086,
                10091
            ],
            [
                10091,
                10103
            ],
            [
                10103,
                10159
            ],
            [
                10159,
                10176
            ],
            [
                10176,
                10244
            ],
            [
                10244,
                10309
            ],
            [
                10309,
                10316
            ],
            [
                10316,
                10349
            ],
            [
                10349,
                10387
            ],
            [
                10387,
                10483
            ],
            [
                10483,
                10585
            ],
            [
                10585,
                10719
            ],
            [
                10719,
                10854
            ],
            [
                10854,
                10874
            ],
            [
                10874,
                10929
            ],
            [
                10929,
                11022
            ],
            [
                11022,
                11029
            ],
            [
                11029,
                11043
            ],
            [
                11043,
                11051
            ],
            [
                11051,
                11093
            ],
            [
                11093,
                11126
            ],
            [
                11126,
                11145
            ],
            [
                11145,
                11172
            ],
            [
                11172,
                11224
            ],
            [
                11224,
                11312
            ],
            [
                11312,
                11327
            ],
            [
                11327,
                11341
            ],
            [
                11341,
                11361
            ],
            [
                11361,
                11393
            ],
            [
                11393,
                11492
            ],
            [
                11492,
                11553
            ],
            [
                11553,
                11605
            ],
            [
                11605,
                11616
            ],
            [
                11616,
                11636
            ],
            [
                11636,
                11920
            ],
            [
                11920,
                11955
            ],
            [
                11955,
                12044
            ],
            [
                12044,
                12066
            ],
            [
                12066,
                12099
            ],
            [
                12099,
                12119
            ],
            [
                12119,
                12146
            ],
            [
                12146,
                12179
            ],
            [
                12179,
                12225
            ],
            [
                12225,
                12326
            ],
            [
                12326,
                12461
            ],
            [
                12461,
                12661
            ],
            [
                12661,
                12692
            ],
            [
                12692,
                12744
            ],
            [
                12744,
                12787
            ],
            [
                12787,
                12929
            ],
            [
                12929,
                12961
            ],
            [
                12961,
                12973
            ],
            [
                12973,
                13004
            ],
            [
                13004,
                13127
            ],
            [
                13127,
                13296
            ],
            [
                13296,
                13425
            ],
            [
                13425,
                13481
            ],
            [
                13481,
                13561
            ],
            [
                13561,
                13590
            ],
            [
                13590,
                13645
            ],
            [
                13645,
                13823
            ],
            [
                13823,
                13947
            ],
            [
                13947,
                14156
            ],
            [
                14156,
                14192
            ],
            [
                14192,
                14212
            ],
            [
                14212,
                14267
            ],
            [
                14267,
                14294
            ],
            [
                14294,
                14299
            ],
            [
                14299,
                14327
            ],
            [
                14327,
                14355
            ],
            [
                14355,
                14400
            ],
            [
                14400,
                14485
            ],
            [
                14485,
                14500
            ],
            [
                14500,
                14524
            ],
            [
                14524,
                14690
            ],
            [
                14690,
                14985
            ],
            [
                14985,
                15100
            ],
            [
                15100,
                15235
            ],
            [
                15235,
                15331
            ],
            [
                15331,
                15494
            ],
            [
                15494,
                15516
            ],
            [
                15516,
                15530
            ],
            [
                15530,
                15618
            ],
            [
                15618,
                15789
            ],
            [
                15789,
                15999
            ],
            [
                15999,
                16013
            ],
            [
                16013,
                16044
            ],
            [
                16044,
                16071
            ],
            [
                16071,
                16262
            ],
            [
                16262,
                16282
            ],
            [
                16282,
                16300
            ],
            [
                16300,
                16319
            ],
            [
                16319,
                16360
            ],
            [
                16360,
                16365
            ],
            [
                16365,
                16402
            ],
            [
                16402,
                16431
            ],
            [
                16431,
                16556
            ],
            [
                16556,
                16613
            ],
            [
                16613,
                16631
            ],
            [
                16631,
                16734
            ],
            [
                16734,
                16769
            ],
            [
                16769,
                16852
            ],
            [
                16852,
                16900
            ],
            [
                16900,
                16925
            ],
            [
                16925,
                16950
            ],
            [
                16950,
                16968
            ],
            [
                16968,
                17011
            ],
            [
                17011,
                17053
            ],
            [
                17053,
                17099
            ],
            [
                17099,
                17125
            ],
            [
                17125,
                17139
            ],
            [
                17139,
                17232
            ],
            [
                17232,
                17298
            ],
            [
                17298,
                17314
            ],
            [
                17314,
                17421
            ],
            [
                17421,
                17469
            ],
            [
                17469,
                17496
            ],
            [
                17496,
                17607
            ],
            [
                17607,
                17663
            ],
            [
                17663,
                17703
            ],
            [
                17703,
                17717
            ],
            [
                17717,
                17909
            ],
            [
                17909,
                17917
            ],
            [
                17917,
                17935
            ],
            [
                17935,
                18057
            ],
            [
                18057,
                18075
            ],
            [
                18075,
                18124
            ],
            [
                18124,
                18216
            ],
            [
                18216,
                18260
            ],
            [
                18260,
                18304
            ],
            [
                18304,
                18408
            ],
            [
                18408,
                18425
            ],
            [
                18425,
                18445
            ],
            [
                18445,
                18455
            ],
            [
                18455,
                18468
            ],
            [
                18468,
                18685
            ],
            [
                18685,
                18771
            ],
            [
                18771,
                18993
            ],
            [
                18993,
                19205
            ],
            [
                19205,
                19545
            ],
            [
                19545,
                19632
            ],
            [
                19632,
                19646
            ],
            [
                19646,
                19674
            ],
            [
                19674,
                19898
            ],
            [
                19898,
                19996
            ],
            [
                19996,
                20036
            ],
            [
                20036,
                20137
            ],
            [
                20137,
                20215
            ],
            [
                20215,
                20221
            ],
            [
                20221,
                20295
            ],
            [
                20295,
                20439
            ],
            [
                20439,
                20466
            ],
            [
                20466,
                20484
            ],
            [
                20484,
                20551
            ],
            [
                20551,
                20667
            ],
            [
                20667,
                20737
            ],
            [
                20737,
                20820
            ],
            [
                20820,
                20925
            ],
            [
                20925,
                20951
            ],
            [
                20951,
                20969
            ],
            [
                20969,
                21012
            ],
            [
                21012,
                21093
            ],
            [
                21093,
                21274
            ],
            [
                21274,
                21303
            ],
            [
                21303,
                21470
            ],
            [
                21470,
                21519
            ],
            [
                21519,
                21593
            ],
            [
                21593,
                21643
            ],
            [
                21643,
                21689
            ],
            [
                21689,
                21709
            ],
            [
                21709,
                21855
            ],
            [
                21855,
                22087
            ],
            [
                22087,
                22113
            ],
            [
                22113,
                22366
            ],
            [
                22366,
                22493
            ],
            [
                22493,
                22561
            ],
            [
                22561,
                22719
            ],
            [
                22719,
                22907
            ],
            [
                22907,
                23046
            ],
            [
                23046,
                23081
            ],
            [
                23081,
                23096
            ],
            [
                23096,
                23107
            ],
            [
                23107,
                23125
            ],
            [
                23125,
                23156
            ],
            [
                23156,
                23346
            ],
            [
                23346,
                23387
            ],
            [
                23387,
                23457
            ],
            [
                23457,
                23613
            ],
            [
                23613,
                23669
            ],
            [
                23669,
                23765
            ],
            [
                23765,
                23780
            ],
            [
                23780,
                23825
            ],
            [
                23825,
                23856
            ],
            [
                23856,
                23872
            ],
            [
                23872,
                23890
            ],
            [
                23890,
                23911
            ],
            [
                23911,
                24049
            ],
            [
                24049,
                24079
            ],
            [
                24079,
                24097
            ],
            [
                24097,
                24160
            ],
            [
                24160,
                24185
            ],
            [
                24185,
                24204
            ],
            [
                24204,
                24350
            ],
            [
                24350,
                24552
            ],
            [
                24552,
                24639
            ],
            [
                24639,
                24779
            ],
            [
                24779,
                24819
            ],
            [
                24819,
                24938
            ],
            [
                24938,
                25114
            ],
            [
                25114,
                25269
            ],
            [
                25269,
                25287
            ],
            [
                25287,
                25355
            ],
            [
                25355,
                25399
            ],
            [
                25399,
                25593
            ],
            [
                25593,
                25656
            ],
            [
                25656,
                25826
            ],
            [
                25826,
                25870
            ],
            [
                25870,
                25926
            ],
            [
                25926,
                25952
            ],
            [
                25952,
                26053
            ],
            [
                26053,
                26175
            ],
            [
                26175,
                26191
            ],
            [
                26191,
                26243
            ],
            [
                26243,
                26356
            ],
            [
                26356,
                26366
            ],
            [
                26366,
                26407
            ],
            [
                26407,
                26534
            ],
            [
                26534,
                26713
            ],
            [
                26713,
                26772
            ],
            [
                26772,
                26806
            ],
            [
                26806,
                26995
            ],
            [
                26995,
                27180
            ],
            [
                27180,
                27262
            ],
            [
                27262,
                27339
            ],
            [
                27339,
                27415
            ],
            [
                27415,
                27537
            ],
            [
                27537,
                27647
            ],
            [
                27647,
                27772
            ],
            [
                27772,
                27926
            ],
            [
                27926,
                27941
            ],
            [
                27941,
                27990
            ],
            [
                27990,
                28003
            ],
            [
                28003,
                28044
            ],
            [
                28044,
                28075
            ],
            [
                28075,
                28092
            ],
            [
                28092,
                28188
            ],
            [
                28188,
                28270
            ],
            [
                28270,
                28339
            ],
            [
                28339,
                28671
            ],
            [
                28671,
                28688
            ],
            [
                28688,
                28742
            ],
            [
                28742,
                28810
            ],
            [
                28810,
                28919
            ],
            [
                28919,
                28944
            ],
            [
                28944,
                29002
            ],
            [
                29002,
                29110
            ],
            [
                29110,
                29130
            ],
            [
                29130,
                29175
            ],
            [
                29175,
                29228
            ],
            [
                29228,
                29295
            ],
            [
                29295,
                29478
            ],
            [
                29478,
                29543
            ],
            [
                29543,
                29611
            ],
            [
                29611,
                29661
            ],
            [
                29661,
                29814
            ],
            [
                29814,
                29982
            ],
            [
                29982,
                30201
            ],
            [
                30201,
                30262
            ],
            [
                30262,
                30320
            ],
            [
                30320,
                30511
            ],
            [
                30511,
                30544
            ],
            [
                30544,
                30680
            ],
            [
                30680,
                30795
            ],
            [
                30795,
                30853
            ],
            [
                30853,
                30893
            ],
            [
                30893,
                30899
            ],
            [
                30899,
                30909
            ],
            [
                30909,
                30936
            ],
            [
                30936,
                30962
            ],
            [
                30962,
                30990
            ],
            [
                30990,
                30995
            ],
            [
                30995,
                31019
            ],
            [
                31019,
                31102
            ],
            [
                31102,
                31169
            ],
            [
                31169,
                31197
            ],
            [
                31197,
                31353
            ],
            [
                31353,
                31455
            ],
            [
                31455,
                31555
            ],
            [
                31555,
                31970
            ],
            [
                31970,
                32013
            ],
            [
                32013,
                32365
            ],
            [
                32365,
                32389
            ],
            [
                32389,
                32489
            ],
            [
                32489,
                32643
            ],
            [
                32643,
                32815
            ],
            [
                32815,
                32884
            ],
            [
                32884,
                32920
            ],
            [
                32920,
                33177
            ],
            [
                33177,
                33383
            ],
            [
                33383,
                33660
            ],
            [
                33660,
                34011
            ]
        ]
    },
    "abridged": {
        "text": "While we were in London Mr. Jarndyce was constantly beset by excitable ladies and gentlemen. Mr. Quale, who presented himself soon after our arrival, was one of these. He seemed to brush his hair farther and farther back, until the very roots were almost ready to fly out of his head in inappeasable philanthropy. He was always ready for a testimonial. Having first seen him swallowed up in admiration of Mrs. Jellyby, I had supposed her to be the absorbing object of his devotion. I soon discovered my mistake and found him to be train-bearer to a whole procession of people.\nMrs. Pardiggle came one day for a subscription to something, and with her, Mr. Quale, who repeated everything she said to us. Mrs. Pardiggle gave my guardian a letter of introduction on behalf of her eloquent friend Mr. Gusher. With Mr. Gusher appeared Mr. Quale again. Mr. Gusher, a flabby gentleman with eyes much too small for his moon of a face, was not prepossessing; yet he was scarcely seated before Mr. Quale asked Ada and me whether he was not a great creature - which he certainly was, flabbily speaking, though Mr. Quale meant in intellect. It became clear that it was Mr. Quale's mission to be in ecstasies with everybody else's mission.\nMr. Jarndyce had fallen into this company in the tenderness of his heart and his earnest desire to do good; but he told us that he felt it to be too often an unsatisfactory company, where benevolence was spasmodic, and charity was assumed as a uniform by vain and vehement people, servile to the great, flattering to one another, and intolerable to those who were anxious to help the weak quietly, without bluster. When a testimonial was started for Mr. Quale by Mr. Gusher (who had already got one, started by Mr. Quale), and when Mr. Gusher spoke for an hour and a half on the subject to two charity schools of small boys and girls, who were requested to come forward with their halfpence, I think the wind was in the east for three whole weeks.\nI mention this because I am coming to Mr. Skimpole again. It seemed to me that his off-hand professions of childishness and carelessness were a great relief to my guardian, by contrast with such things, and were the more readily believed. I should be sorry to imply that Mr. Skimpole guessed this and acted accordingly; I really never understood him well enough to know.\nHe had not been very well; but he now appeared one morning in his usual agreeable way and as full of pleasant spirits as ever.\nWell, he said, here he was! He had been bilious, but rich men were often bilious, and therefore he had been persuading himself that he was rich. He had told his doctor, \"Now, my dear doctor, it is quite a delusion on your part to suppose that you attend me for nothing. I am overwhelming you with money - in my expansive intentions - if you only knew it!\" And really (he said) he thought it much the same as doing it. If he had had those bits of metal or thin paper to which mankind attached so much importance, he would have put them in the doctor's hand. Not having them, he substituted the will for the deed. Very well! If his will were genuine, it appeared to him that it was the same as coin, and cancelled the obligation.\n\"It may be, partly, because I know nothing of the value of money,\" said Mr. Skimpole, \"but I often feel this. It seems so reasonable! My butcher says to me he wants that little bill paying. I reply to the butcher, 'My good friend, if you only knew it, you are paid.'\"\n\"But, suppose,\" said my guardian, laughing, \"he had only meant the meat, instead of providing it?\"\n\"My dear Jarndyce,\" he returned, \"A butcher I once dealt with said that very thing. Says he, 'Sir, why did you eat spring lamb at eighteen pence a pound? I wish I had meant the lamb as you mean the money!' 'My good fellow,' said I, 'pray let us be reasonable. You had got the lamb, and I have not got the money. You couldn't really mean the lamb without selling it, whereas I can, and do, really mean the money without paying it!' He had not a word to say.\"\n\"Did he take no legal proceedings?\" inquired my guardian.\n\"Yes, he did,\" said Mr. Skimpole. \"But in that he was influenced by passion, not by reason. That reminds me of Boythorn. He writes that you and the ladies have promised him a short visit at his bachelor-house in Lincolnshire.\"\n\"He is a great favourite with my girls,\" said Mr. Jarndyce, \"and I have promised for them.\"\n\"Nature forgot to shade Boythorn, I think,\" observed Mr. Skimpole to Ada and me. \"A little too boisterous - like the sea. But I grant a sledge-hammering sort of merit in him!\"\nI should have been surprised if those two could have thought very highly of one another, Mr. Boythorn attaching so much importance to many things and Mr. Skimpole caring so little for anything. Of course I merely said that we had been greatly pleased with him.\n\"He has invited me,\" said Mr. Skimpole; \"and if a child may trust himself in such hands, I shall go. He proposes to frank me down and back again. I suppose it will cost money? Shillings, or something of that sort? By the by, you remember our friend Coavinses, Miss Summerson?\"\nHe asked me in his graceful, light-hearted manner, without the least embarrassment.\n\"Oh, yes!\" said I.\n\"Coavinses has been arrested by the Great Bailiff,\" said Mr. Skimpole. \"He is dead.\"\nIt quite shocked me to hear it, as I recalled the man sitting on the sofa that night wiping his head.\n\"His successor informed me of it yesterday,\" said Mr. Skimpole. \"His successor is in my house now. He came yesterday, on my blue-eyed daughter's birthday. I put it to him, 'This is inconvenient. If you had a blue-eyed daughter, you wouldn't like me to come, uninvited, on her birthday?' But he stayed.\"\nMr. Skimpole laughed at the pleasant absurdity and lightly touched the piano by which he was seated.\n\"And he told me,\" he said, playing little chords between each phrase, \"that Coavinses had left. Three children. No mother. And that his profession. Being unpopular. They were at a disadvantage.\"\nMr. Jarndyce got up, rubbing his head, and began to walk about. Mr. Skimpole played the melody of one of Ada's favourite songs; but my guardian put his hand upon the keys and stopped him.\n\"I don't like this, Skimpole,\" he said thoughtfully.\nMr. Skimpole looked up, surprised.\n\"The man was necessary,\" pursued my guardian. \"If we make such men necessary by our faults or our misfortunes, we must not revenge ourselves upon them. There was no harm in his trade. He maintained his children. One would like to know more about this.\"\n\"Oh! Coavinses?\" cried Mr. Skimpole. \"Nothing easier. Walk to Coavinses' headquarters.\"\nMr. Jarndyce nodded to us. \"Come! We will walk that way, my dears.\"\nWe were quickly ready and went out with Mr. Skimpole, who quite enjoyed the expedition. It was so new and so refreshing, he said, for him to want Coavinses instead of Coavinses wanting him!\nHe took us, first, to Cursitor Street, Chancery Lane, where there was a house with barred windows, which he called Coavinses' Castle. On our ringing a bell, a hideous boy came out of an office and looked at us over a spiked gate.\n\"Who did you want?\" said the boy, fitting two of the spikes into his chin.\n\"There was an officer, or something, here,\" said Mr. Jarndyce, \"who is dead. I want to know his name, if you please?\"\n\"Name of Neckett,\" said the boy.\n\"And his address?\"\n\"Bell Yard,\" said the boy. \"Chandler's shop, left hand side.\"\n\"Was he industrious?\"\n\"Neckett?\" said the boy. \"Yes, wery much so. He was never tired of watching. He'd set at a street corner eight or ten hours at a stretch if he undertook to do it.\"\n\"He might have done worse,\" I heard my guardian murmur. \"He might have undertaken to do it and not done it. Thank you. That's all I want.\"\nWe left the boy, and went to Bell Yard, a narrow alley a short distance away. We soon found the chandler's shop. In it was a good-natured looking old woman.\n\"Neckett's children?\" said she in reply to my inquiry. \"Yes, Surely, miss. Door right opposite the stairs.\" And she handed me the key.\nI led the way up the dark stairs. We went as quietly as we could, but when we came to the second storey we found we had disturbed a man who was standing there looking out of his room.\n\"Is it Gridley that's wanted?\" he said, fixing his eyes on me with an angry stare.\n\"No, sir,\" said I; \"I am going higher up.\"\nHe looked at Ada, and at Mr. Jarndyce, and at Mr. Skimpole, fixing the same angry stare on each. Mr. Jarndyce gave him good day.\n\"Good day!\" he said abruptly and fiercely. He was a tall, sallow man with a careworn head, a deeply lined face, and prominent eyes. His combative, irritable manner rather alarmed me. He had a pen in his hand, and in the glimpse I caught of his room, I saw that it was covered with a litter of papers.\nLeaving him there, we went up to the top room. I tapped at the door, and a little shrill voice inside said, \"We are locked in.\"\nI applied the key and opened the door. In a poor room with a sloping ceiling and containing very little furniture was a mite of a boy, some five or six years old, nursing and hushing a heavy child of eighteen months. There was no fire, though the weather was cold; both children were wrapped in some poor shawls as a substitute. Their noses looked red and pinched and their small figures shrunken as the boy walked up and down hushing the child with its head on his shoulder.\n\"Who has locked you up here alone?\" we asked.\n\"Charley,\" said the boy, gazing at us.\n\"Is Charley your brother?\"\n\"No. She's my sister, Charlotte.\"\n\"Are there any more of you besides Charley?\"\n\"Me,\" said the boy, \"and Emma,\" patting the limp bonnet of the child he was nursing.\n\"Where is Charley now?\"\n\"Out a-washing,\" said the boy, beginning to walk up and down again and trying to gaze at us at the same time.\nJust then there came into the room a very little girl, childish in figure but shrewd and older-looking in the face - pretty too - wearing a bonnet much too large for her and drying her bare arms on an apron. Her fingers were white and wrinkled with washing, and she wiped soap-suds off her arms.\nShe had come running from some place nearby with all the haste she could. Consequently, she was out of breath and could not speak at first, as she stood panting, and wiping her arms, and looking at us.\n\"Oh, here's Charley!\" said the boy.\nThe child he was nursing stretched forth its arms and cried out to be taken. The little girl took it, and stood looking at us over the burden that clung to her affectionately.\n\"Is it possible,\" whispered my guardian as we put a chair for the little creature to sit on, \"that this child works for the rest? Look at this! For God's sake, look at this!\"\nIt was a thing to look at. The three children together, and two of them relying solely on the third, who was so young and yet with such an air of age and steadiness.\n\"Charley!\" said my guardian. \"How old are you?\"\n\"Over thirteen, sir,\" replied the child.\n\"Oh! What a great age,\" said my guardian. I cannot describe the tenderness with which he spoke to her, half playfully yet compassionately.\n\"And do you live alone here with these babies, Charley?\" said he.\n\"Yes, sir,\" returned the child, \"since father died.\"\n\"And - Oh! Charley,\" said my guardian, turning his face away for a moment, \"how do you live?\"\n\"Since father died, sir, I've gone out to work. I'm out washing today.\"\n\"God help you, Charley!\" said my guardian. \"You're not tall enough to reach the tub!\"\n\"In clogs I am, sir,\" she said quickly. \"I've got a high pair as belonged to mother.\"\n\"And when did mother die?\"\n\"Just after Emma was born,\" said the child, glancing at the face upon her bosom. \"Then father said I was to be as good a mother to her as I could. And so I tried. I worked at home and did cleaning and nursing and washing for a long time before I began to go out.\"\n\"And do you often go out?\"\n\"As often as I can,\" said Charley, smiling, \"because of earning sixpences and shillings!\"\n\"And do you always lock the babies up when you go out?\"\n\"To keep 'em safe, sir, don't you see?\" said Charley. \"Mrs. Blinder comes up now and then, and Mr. Gridley comes up sometimes, and I can run in sometimes, and they can play you know, and Tom an't afraid of being locked up, are you, Tom?\"\n\"No-o!\" said Tom stoutly.\n\"When it comes on dark, the lamps are lighted down in the court, and they show up here quite bright. Don't they, Tom?\"\n\"Yes, Charley,\" said Tom, \"almost quite bright.\"\n\"Then he's as good as gold,\" said the little creature - oh, in such a motherly, womanly way! \"And when Emma's tired, he puts her to bed. And when he's tired he goes to bed himself. And when I come home and light the candle and has a bit of supper, he sits up again and has it with me. Don't you, Tom?\"\n\"Oh, yes, Charley!\" said Tom. \"That I do!\" And either in this glimpse of the great pleasure of his life or in gratitude and love for Charley, he laid his face among the scanty folds of her frock and passed from laughing into crying.\nIt was the first time since our entry that a tear had been shed among these children. The little orphan girl had spoken of their father and mother as if all that sorrow were subdued by the necessity of taking courage and of working. But now, when Tom cried, although she sat quite tranquil, I saw two silent tears fall down her face.\nI stood at the window with Ada, pretending to look at the housetops, and the blackened stack of chimneys, when I found that Mrs. Blinder, from the shop below, had come panting up the stairs and was talking to my guardian.\n\"It's not much to forgive 'em the rent, sir,\" she said; \"who could take it from them?\"\n\"Well, well!\" said my guardian to us two. \"The time will come when this good woman will find that it was much, and that as she did it unto the least of these This child,\" he added after a moment, \"could she possibly continue this?\"\n\"Really, sir, I think she might,\" said Mrs. Blinder, getting her breath by painful degrees. \"She's as handy as can be. Bless you, sir, the way she tended them two children after the mother died was the talk of the yard! And it was a wonder to see her with him after he was took ill, it really was! 'Mrs. Blinder,' he said to me, as he was lying there - 'Mrs. Blinder, I see a angel sitting in this room last night along with my child, and I trust her to Our Father!'\"\n\"He had no other job?\" said my guardian.\n\"No, sir,\" returned Mrs. Blinder. \"When he first came to lodge here, I didn't know what he was, and I confess that when I found out I gave him notice. It wasn't liked in the yard, nor by the other lodgers. Mr. Gridley objected to it very strong, and he is a good lodger, though his temper has been hard tried.\"\n\"So you gave him notice?\" said my guardian.\n\"So I gave him notice. But when the time came, I was in doubts. He was punctual and diligent; he did what he had to do, sir,\" said Mrs. Blinder, unconsciously fixing Mr. Skimpole with her eye, \"and it's something in this world even to do that.\"\n\"So you kept him after all?\"\n\"Why, I said that if he could arrange with Mr. Gridley, I could arrange it with the other lodgers. Mr. Gridley gave his consent gruff - but he gave it. He has been kind to the children since.\"\n\"Have many people been kind to the children?\" asked Mr. Jarndyce.\n\"Upon the whole, not so bad, sir,\" said Mrs. Blinder; \"but certainly not so many as would have been if their father's job had been different. Mr. Coavins gave a guinea, and some neighbours came forward with a little, and - in general - not so bad. Some people won't employ her because she was a bailiff's child, and some people that do employ her maybe pay her less. But she's patient, and clever too, and always willing. So I should say, in general, not so bad, sir, but might be better.\"\nMrs. Blinder sat down to recover her breath fully. Mr. Jarndyce was turning to speak to us when his attention was attracted by the abrupt entrance into the room of Mr. Gridley, whom we had seen on our way up.\n\"I don't know what you may be doing here, ladies and gentlemen,\" he said, \"but you'll excuse my coming in. Well, Charley! Well, Tom! Well, little one! How is it with us all today?\"\nHe bent over the group in a caressing way and clearly was regarded as a friend by the children, though his face remained stern and his manner to us was rude.\n\"I don't want to argue with you, ladies and gentlemen,\" he said, taking Tom upon his knee. \"I have had enough of arguing to last one man his life.\"\n\"You have sufficient reason, I dare say,\" said Mr. Jarndyce, \"for being irritated-\"\n\"There again!\" exclaimed the man, becoming angry. \"I am of a quarrelsome temper. I am irascible. I am not polite!\"\n\"Not very, I think.\"\n\"Sir,\" said Gridley, putting down the child and going up to him as if he meant to strike him, \"do you know anything of Courts of Equity?\"\n\"I do, to my sorrow.\"\n\"To your sorrow?\" said the man, pausing in his wrath. \"I beg your pardon. I am not polite, I know. Sir, I have been dragged for five and twenty years over burning iron. Go into the Court of Chancery yonder and ask what is one of the standing jokes that brighten up their business, and they will tell you that the best joke they have is the man from Shropshire. I,\" he said passionately, \"am the man from Shropshire.\"\n\"I believe I and my family have also had the honour of giving some entertainment in the same grave place,\" said my guardian composedly. \"You may have heard my name - Jarndyce.\"\n\"Mr. Jarndyce,\" said Gridley, \"you bear your wrongs more quietly than I can bear mine. If I took my wrongs in any other way, I should be driven mad! It is only by resenting them that I am able to keep my wits together. You may tell me that I over-excite myself. I answer that I must do it, or sink into the smiling state of the poor little mad woman that haunts the court. If I was to sit down under it, I should become imbecile.\"\nHis passion and vehemence were most painful to see.\n\"Mr. Jarndyce,\" he said, \"consider my case. I am one of two brothers. My father (a farmer) made a will and left his farm and stock to my mother for her life. After my mother's death, all was to come to me except a legacy of three hundred pounds that I was to pay my brother. My mother died. My brother some time afterwards claimed his legacy. I said that he had had a part of it already in board and lodging and some other things. Now mind! That was the question, and nothing else. No one disputed the will; no one disputed anything but whether part of that three hundred pounds had been already paid or not. To settle that question, my brother filed a bill, and I was obliged to go into this accursed Chancery.\n\"Seventeen people were made defendants to that simple suit! It first came on after two years. It was then stopped for another two years while the master inquired whether I was my father's son, about which there was no dispute at all. He then found out that there were not defendants enough - remember, there were only seventeen! - but that we must have another who had been left out and must begin all over again. The costs at that time - before the thing was begun! - were three times the legacy. My brother would have happily given up the legacy to escape more costs. My whole estate has gone in costs. The suit is still undecided - and here I stand, this day! Now, Mr. Jarndyce, in your suit there are thousands and thousands involved, where in mine there are hundreds. Is mine any less hard to bear, when my whole living has been thus shamefully sucked away?\"\nMr. Jarndyce said that he condoled with him with all his heart about this monstrous system.\n\"There again!\" said Mr. Gridley. \"The system! I am always told, it's the system. I can't ask My Lord any questions, because he sits there to administer the system. I mustn't go to Mr. Tulkinghorn the solicitor to protest, because he is not responsible. It's the system. But I don't know what may happen if I am carried beyond myself at last!\"\nI have never seen such vehemence. At last, sitting down and wiping his face, he said, \"I have done! Mr. Jarndyce, I am violent, I know. I have been in prison for contempt of court. I have been in prison for threatening the solicitor. I have been in trouble, and shall be again. I was a good-enough-tempered man once, I believe. People in my part of the country say they remember me so. 'It would be far better for you, Mr. Gridley,' the Lord Chancellor told me last week, 'not to waste your time here, but to stay, usefully employed, in Shropshire.' 'My Lord, I know it would,' said I to him, 'and it would have been far better for me never to have heard the name of your high office, but I can't undo the past!' Besides,\" he added, breaking fiercely out, \"I'll shame them. To the last, I'll show myself in that court to its shame. If I knew when I was going to die, and could be carried there, and had a voice to speak with, I would die there!\"\nHis face did not soften, even now when he was quiet.\n\"I came to take these babies down to my room for an hour,\" he said, \"to let them play about. I didn't mean to say all this, but it don't much signify. You're not afraid of me, Tom, are you?\"\n\"No!\" said Tom. \"You ain't angry with me.\"\n\"You are right, my child. You're going back, Charley? Aye? Come then, little one!\" He took the youngest child on his arm. \"I shouldn't wonder if we found a ginger-bread soldier downstairs. Let's go and look for him!\"\nHe made a rough but respectful salutation to Mr. Jarndyce, and bowing to us, went downstairs to his room.\nUpon that, Mr. Skimpole began to talk in his usual gay strain. He said it was really very pleasant to see how things adapted themselves to purposes. Here was this Mr. Gridley, a man of surprising energy - and he could easily imagine Gridley wandering about in life looking for something to expend his combativeness upon - when the Court of Chancery provided him with the exact thing he wanted. Then look at Coavinses! How delightfully poor Coavinses illustrated the same principle! He, Mr. Skimpole himself, could had dispensed with Coavinses. But all that time, he had been giving employment to a most deserving man; he had been a benefactor to Coavinses! His heart had swelled just now and the tears had come into his eyes when he had looked round the room and thought, \"I was the great patron of Coavinses, and his little comforts were my work!\"\nThere was something so captivating and mirthful about him, that he made my guardian smile as he turned towards us from a little private talk with Mrs. Blinder. We kissed Charley, and took her downstairs with us, and watched her run away to her work: running, such a little, little creature in her womanly bonnet and apron, through the court to melt into the city's strife and sound like a dewdrop in an ocean.",
        "paragraph_chars": [
            [
                0,
                577
            ],
            [
                577,
                1227
            ],
            [
                1227,
                1975
            ],
            [
                1975,
                2346
            ],
            [
                2346,
                2473
            ],
            [
                2473,
                3201
            ],
            [
                3201,
                3469
            ],
            [
                3469,
                3568
            ],
            [
                3568,
                4026
            ],
            [
                4026,
                4084
            ],
            [
                4084,
                4311
            ],
            [
                4311,
                4403
            ],
            [
                4403,
                4579
            ],
            [
                4579,
                4840
            ],
            [
                4840,
                5117
            ],
            [
                5117,
                5201
            ],
            [
                5201,
                5220
            ],
            [
                5220,
                5305
            ],
            [
                5305,
                5407
            ],
            [
                5407,
                5710
            ],
            [
                5710,
                5811
            ],
            [
                5811,
                6006
            ],
            [
                6006,
                6194
            ],
            [
                6194,
                6247
            ],
            [
                6247,
                6282
            ],
            [
                6282,
                6535
            ],
            [
                6535,
                6623
            ],
            [
                6623,
                6691
            ],
            [
                6691,
                6881
            ],
            [
                6881,
                7111
            ],
            [
                7111,
                7186
            ],
            [
                7186,
                7304
            ],
            [
                7304,
                7337
            ],
            [
                7337,
                7356
            ],
            [
                7356,
                7418
            ],
            [
                7418,
                7440
            ],
            [
                7440,
                7604
            ],
            [
                7604,
                7743
            ],
            [
                7743,
                7900
            ],
            [
                7900,
                8035
            ],
            [
                8035,
                8219
            ],
            [
                8219,
                8302
            ],
            [
                8302,
                8345
            ],
            [
                8345,
                8474
            ],
            [
                8474,
                8775
            ],
            [
                8775,
                8903
            ],
            [
                8903,
                9379
            ],
            [
                9379,
                9425
            ],
            [
                9425,
                9464
            ],
            [
                9464,
                9491
            ],
            [
                9491,
                9525
            ],
            [
                9525,
                9570
            ],
            [
                9570,
                9655
            ],
            [
                9655,
                9679
            ],
            [
                9679,
                9789
            ],
            [
                9789,
                10085
            ],
            [
                10085,
                10287
            ],
            [
                10287,
                10323
            ],
            [
                10323,
                10499
            ],
            [
                10499,
                10674
            ],
            [
                10674,
                10840
            ],
            [
                10840,
                10888
            ],
            [
                10888,
                10929
            ],
            [
                10929,
                11068
            ],
            [
                11068,
                11134
            ],
            [
                11134,
                11187
            ],
            [
                11187,
                11281
            ],
            [
                11281,
                11353
            ],
            [
                11353,
                11439
            ],
            [
                11439,
                11525
            ],
            [
                11525,
                11552
            ],
            [
                11552,
                11816
            ],
            [
                11816,
                11843
            ],
            [
                11843,
                11933
            ],
            [
                11933,
                11989
            ],
            [
                11989,
                12227
            ],
            [
                12227,
                12253
            ],
            [
                12253,
                12372
            ],
            [
                12372,
                12421
            ],
            [
                12421,
                12723
            ],
            [
                12723,
                12956
            ],
            [
                12956,
                13290
            ],
            [
                13290,
                13512
            ],
            [
                13512,
                13599
            ],
            [
                13599,
                13831
            ],
            [
                13831,
                14299
            ],
            [
                14299,
                14340
            ],
            [
                14340,
                14651
            ],
            [
                14651,
                14695
            ],
            [
                14695,
                14940
            ],
            [
                14940,
                14969
            ],
            [
                14969,
                15162
            ],
            [
                15162,
                15228
            ],
            [
                15228,
                15718
            ],
            [
                15718,
                15927
            ],
            [
                15927,
                16108
            ],
            [
                16108,
                16266
            ],
            [
                16266,
                16414
            ],
            [
                16414,
                16498
            ],
            [
                16498,
                16613
            ],
            [
                16613,
                16634
            ],
            [
                16634,
                16772
            ],
            [
                16772,
                16794
            ],
            [
                16794,
                17211
            ],
            [
                17211,
                17388
            ],
            [
                17388,
                17819
            ],
            [
                17819,
                17871
            ],
            [
                17871,
                18583
            ],
            [
                18583,
                19447
            ],
            [
                19447,
                19539
            ],
            [
                19539,
                19882
            ],
            [
                19882,
                20828
            ],
            [
                20828,
                20881
            ],
            [
                20881,
                21072
            ],
            [
                21072,
                21115
            ],
            [
                21115,
                21332
            ],
            [
                21332,
                21438
            ],
            [
                21438,
                22287
            ],
            [
                22287,
                22696
            ]
        ],
        "segment_chars": [
            [
                0,
                93
            ],
            [
                93,
                168
            ],
            [
                168,
                314
            ],
            [
                314,
                353
            ],
            [
                353,
                482
            ],
            [
                482,
                577
            ],
            [
                577,
                703
            ],
            [
                703,
                805
            ],
            [
                805,
                847
            ],
            [
                847,
                1129
            ],
            [
                1129,
                1227
            ],
            [
                1227,
                1642
            ],
            [
                1642,
                1975
            ],
            [
                1975,
                2033
            ],
            [
                2033,
                2214
            ],
            [
                2214,
                2346
            ],
            [
                2346,
                2473
            ],
            [
                2473,
                2501
            ],
            [
                2501,
                2618
            ],
            [
                2618,
                2743
            ],
            [
                2743,
                2829
            ],
            [
                2829,
                2891
            ],
            [
                2891,
                3030
            ],
            [
                3030,
                3085
            ],
            [
                3085,
                3096
            ],
            [
                3096,
                3201
            ],
            [
                3201,
                3311
            ],
            [
                3311,
                3335
            ],
            [
                3335,
                3391
            ],
            [
                3391,
                3469
            ],
            [
                3469,
                3568
            ],
            [
                3568,
                3652
            ],
            [
                3652,
                3722
            ],
            [
                3722,
                3774
            ],
            [
                3774,
                3828
            ],
            [
                3828,
                3880
            ],
            [
                3880,
                3999
            ],
            [
                3999,
                4026
            ],
            [
                4026,
                4062
            ],
            [
                4062,
                4084
            ],
            [
                4084,
                4118
            ],
            [
                4118,
                4176
            ],
            [
                4176,
                4205
            ],
            [
                4205,
                4311
            ],
            [
                4311,
                4403
            ],
            [
                4403,
                4484
            ],
            [
                4484,
                4525
            ],
            [
                4525,
                4579
            ],
            [
                4579,
                4773
            ],
            [
                4773,
                4840
            ],
            [
                4840,
                4941
            ],
            [
                4941,
                4986
            ],
            [
                4986,
                5016
            ],
            [
                5016,
                5054
            ],
            [
                5054,
                5117
            ],
            [
                5117,
                5201
            ],
            [
                5201,
                5212
            ],
            [
                5212,
                5220
            ],
            [
                5220,
                5291
            ],
            [
                5291,
                5305
            ],
            [
                5305,
                5407
            ],
            [
                5407,
                5471
            ],
            [
                5471,
                5506
            ],
            [
                5506,
                5562
            ],
            [
                5562,
                5602
            ],
            [
                5602,
                5694
            ],
            [
                5694,
                5710
            ],
            [
                5710,
                5811
            ],
            [
                5811,
                5907
            ],
            [
                5907,
                5923
            ],
            [
                5923,
                5934
            ],
            [
                5934,
                5959
            ],
            [
                5959,
                5976
            ],
            [
                5976,
                6006
            ],
            [
                6006,
                6070
            ],
            [
                6070,
                6194
            ],
            [
                6194,
                6247
            ],
            [
                6247,
                6282
            ],
            [
                6282,
                6328
            ],
            [
                6328,
                6434
            ],
            [
                6434,
                6466
            ],
            [
                6466,
                6494
            ],
            [
                6494,
                6535
            ],
            [
                6535,
                6540
            ],
            [
                6540,
                6552
            ],
            [
                6552,
                6572
            ],
            [
                6572,
                6589
            ],
            [
                6589,
                6623
            ],
            [
                6623,
                6650
            ],
            [
                6650,
                6657
            ],
            [
                6657,
                6691
            ],
            [
                6691,
                6779
            ],
            [
                6779,
                6881
            ],
            [
                6881,
                7015
            ],
            [
                7015,
                7111
            ],
            [
                7111,
                7131
            ],
            [
                7131,
                7186
            ],
            [
                7186,
                7263
            ],
            [
                7263,
                7304
            ],
            [
                7304,
                7337
            ],
            [
                7337,
                7356
            ],
            [
                7356,
                7383
            ],
            [
                7383,
                7418
            ],
            [
                7418,
                7440
            ],
            [
                7440,
                7451
            ],
            [
                7451,
                7465
            ],
            [
                7465,
                7485
            ],
            [
                7485,
                7517
            ],
            [
                7517,
                7604
            ],
            [
                7604,
                7660
            ],
            [
                7660,
                7712
            ],
            [
                7712,
                7723
            ],
            [
                7723,
                7743
            ],
            [
                7743,
                7821
            ],
            [
                7821,
                7856
            ],
            [
                7856,
                7900
            ],
            [
                7900,
                7922
            ],
            [
                7922,
                7955
            ],
            [
                7955,
                7975
            ],
            [
                7975,
                8008
            ],
            [
                8008,
                8035
            ],
            [
                8035,
                8069
            ],
            [
                8069,
                8219
            ],
            [
                8219,
                8250
            ],
            [
                8250,
                8302
            ],
            [
                8302,
                8345
            ],
            [
                8345,
                8442
            ],
            [
                8442,
                8474
            ],
            [
                8474,
                8486
            ],
            [
                8486,
                8517
            ],
            [
                8517,
                8606
            ],
            [
                8606,
                8657
            ],
            [
                8657,
                8775
            ],
            [
                8775,
                8822
            ],
            [
                8822,
                8903
            ],
            [
                8903,
                8942
            ],
            [
                8942,
                9120
            ],
            [
                9120,
                9232
            ],
            [
                9232,
                9379
            ],
            [
                9379,
                9415
            ],
            [
                9415,
                9425
            ],
            [
                9425,
                9464
            ],
            [
                9464,
                9491
            ],
            [
                9491,
                9496
            ],
            [
                9496,
                9525
            ],
            [
                9525,
                9570
            ],
            [
                9570,
                9655
            ],
            [
                9655,
                9679
            ],
            [
                9679,
                9789
            ],
            [
                9789,
                9997
            ],
            [
                9997,
                10085
            ],
            [
                10085,
                10159
            ],
            [
                10159,
                10287
            ],
            [
                10287,
                10309
            ],
            [
                10309,
                10323
            ],
            [
                10323,
                10400
            ],
            [
                10400,
                10499
            ],
            [
                10499,
                10629
            ],
            [
                10629,
                10643
            ],
            [
                10643,
                10674
            ],
            [
                10674,
                10701
            ],
            [
                10701,
                10840
            ],
            [
                10840,
                10851
            ],
            [
                10851,
                10869
            ],
            [
                10869,
                10888
            ],
            [
                10888,
                10929
            ],
            [
                10929,
                10934
            ],
            [
                10934,
                10971
            ],
            [
                10971,
                11068
            ],
            [
                11068,
                11125
            ],
            [
                11125,
                11134
            ],
            [
                11134,
                11187
            ],
            [
                11187,
                11198
            ],
            [
                11198,
                11281
            ],
            [
                11281,
                11329
            ],
            [
                11329,
                11353
            ],
            [
                11353,
                11378
            ],
            [
                11378,
                11396
            ],
            [
                11396,
                11439
            ],
            [
                11439,
                11479
            ],
            [
                11479,
                11525
            ],
            [
                11525,
                11552
            ],
            [
                11552,
                11633
            ],
            [
                11633,
                11699
            ],
            [
                11699,
                11715
            ],
            [
                11715,
                11816
            ],
            [
                11816,
                11843
            ],
            [
                11843,
                11933
            ],
            [
                11933,
                11989
            ],
            [
                11989,
                12029
            ],
            [
                12029,
                12043
            ],
            [
                12043,
                12227
            ],
            [
                12227,
                12235
            ],
            [
                12235,
                12253
            ],
            [
                12253,
                12354
            ],
            [
                12354,
                12372
            ],
            [
                12372,
                12421
            ],
            [
                12421,
                12514
            ],
            [
                12514,
                12558
            ],
            [
                12558,
                12602
            ],
            [
                12602,
                12706
            ],
            [
                12706,
                12723
            ],
            [
                12723,
                12743
            ],
            [
                12743,
                12753
            ],
            [
                12753,
                12766
            ],
            [
                12766,
                12956
            ],
            [
                12956,
                13042
            ],
            [
                13042,
                13189
            ],
            [
                13189,
                13290
            ],
            [
                13290,
                13512
            ],
            [
                13512,
                13599
            ],
            [
                13599,
                13613
            ],
            [
                13613,
                13641
            ],
            [
                13641,
                13831
            ],
            [
                13831,
                13923
            ],
            [
                13923,
                13950
            ],
            [
                13950,
                14051
            ],
            [
                14051,
                14129
            ],
            [
                14129,
                14135
            ],
            [
                14135,
                14190
            ],
            [
                14190,
                14299
            ],
            [
                14299,
                14322
            ],
            [
                14322,
                14340
            ],
            [
                14340,
                14374
            ],
            [
                14374,
                14491
            ],
            [
                14491,
                14546
            ],
            [
                14546,
                14651
            ],
            [
                14651,
                14677
            ],
            [
                14677,
                14695
            ],
            [
                14695,
                14718
            ],
            [
                14718,
                14759
            ],
            [
                14759,
                14940
            ],
            [
                14940,
                14969
            ],
            [
                14969,
                15068
            ],
            [
                15068,
                15121
            ],
            [
                15121,
                15162
            ],
            [
                15162,
                15208
            ],
            [
                15208,
                15228
            ],
            [
                15228,
                15370
            ],
            [
                15370,
                15476
            ],
            [
                15476,
                15595
            ],
            [
                15595,
                15650
            ],
            [
                15650,
                15718
            ],
            [
                15718,
                15769
            ],
            [
                15769,
                15927
            ],
            [
                15927,
                16034
            ],
            [
                16034,
                16049
            ],
            [
                16049,
                16060
            ],
            [
                16060,
                16078
            ],
            [
                16078,
                16108
            ],
            [
                16108,
                16266
            ],
            [
                16266,
                16357
            ],
            [
                16357,
                16414
            ],
            [
                16414,
                16498
            ],
            [
                16498,
                16513
            ],
            [
                16513,
                16548
            ],
            [
                16548,
                16579
            ],
            [
                16579,
                16595
            ],
            [
                16595,
                16613
            ],
            [
                16613,
                16634
            ],
            [
                16634,
                16772
            ],
            [
                16772,
                16794
            ],
            [
                16794,
                16812
            ],
            [
                16812,
                16848
            ],
            [
                16848,
                16868
            ],
            [
                16868,
                16893
            ],
            [
                16893,
                16963
            ],
            [
                16963,
                17155
            ],
            [
                17155,
                17211
            ],
            [
                17211,
                17347
            ],
            [
                17347,
                17388
            ],
            [
                17388,
                17475
            ],
            [
                17475,
                17537
            ],
            [
                17537,
                17607
            ],
            [
                17607,
                17650
            ],
            [
                17650,
                17761
            ],
            [
                17761,
                17819
            ],
            [
                17819,
                17871
            ],
            [
                17871,
                17915
            ],
            [
                17915,
                17941
            ],
            [
                17941,
                18029
            ],
            [
                18029,
                18146
            ],
            [
                18146,
                18162
            ],
            [
                18162,
                18214
            ],
            [
                18214,
                18302
            ],
            [
                18302,
                18312
            ],
            [
                18312,
                18353
            ],
            [
                18353,
                18480
            ],
            [
                18480,
                18583
            ],
            [
                18583,
                18643
            ],
            [
                18643,
                18677
            ],
            [
                18677,
                18817
            ],
            [
                18817,
                18912
            ],
            [
                18912,
                18997
            ],
            [
                18997,
                19050
            ],
            [
                19050,
                19081
            ],
            [
                19081,
                19153
            ],
            [
                19153,
                19188
            ],
            [
                19188,
                19246
            ],
            [
                19246,
                19356
            ],
            [
                19356,
                19447
            ],
            [
                19447,
                19539
            ],
            [
                19539,
                19554
            ],
            [
                19554,
                19572
            ],
            [
                19572,
                19585
            ],
            [
                19585,
                19620
            ],
            [
                19620,
                19703
            ],
            [
                19703,
                19792
            ],
            [
                19792,
                19809
            ],
            [
                19809,
                19882
            ],
            [
                19882,
                19916
            ],
            [
                19916,
                19982
            ],
            [
                19982,
                20018
            ],
            [
                20018,
                20063
            ],
            [
                20063,
                20116
            ],
            [
                20116,
                20160
            ],
            [
                20160,
                20210
            ],
            [
                20210,
                20268
            ],
            [
                20268,
                20432
            ],
            [
                20432,
                20595
            ],
            [
                20595,
                20656
            ],
            [
                20656,
                20714
            ],
            [
                20714,
                20828
            ],
            [
                20828,
                20881
            ],
            [
                20881,
                20974
            ],
            [
                20974,
                21032
            ],
            [
                21032,
                21072
            ],
            [
                21072,
                21078
            ],
            [
                21078,
                21088
            ],
            [
                21088,
                21115
            ],
            [
                21115,
                21141
            ],
            [
                21141,
                21169
            ],
            [
                21169,
                21174
            ],
            [
                21174,
                21198
            ],
            [
                21198,
                21237
            ],
            [
                21237,
                21304
            ],
            [
                21304,
                21332
            ],
            [
                21332,
                21438
            ],
            [
                21438,
                21501
            ],
            [
                21501,
                21587
            ],
            [
                21587,
                21832
            ],
            [
                21832,
                21856
            ],
            [
                21856,
                21920
            ],
            [
                21920,
                21982
            ],
            [
                21982,
                22095
            ],
            [
                22095,
                22287
            ],
            [
                22287,
                22447
            ],
            [
                22447,
                22696
            ]
        ],
        "overlap_chars": [
            [
                0,
                60
            ],
            [
                61,
                91
            ],
            [
                91,
                93
            ],
            [
                93,
                153
            ],
            [
                166,
                168
            ],
            [
                168,
                177
            ],
            [
                178,
                314
            ],
            [
                314,
                327
            ],
            [
                328,
                337
            ],
            [
                338,
                351
            ],
            [
                351,
                353
            ],
            [
                353,
                374
            ],
            [
                375,
                482
            ],
            [
                482,
                543
            ],
            [
                544,
                577
            ],
            [
                577,
                661
            ],
            [
                661,
                662
            ],
            [
                667,
                675
            ],
            [
                691,
                695
            ],
            [
                696,
                701
            ],
            [
                701,
                703
            ],
            [
                703,
                717
            ],
            [
                723,
                734
            ],
            [
                735,
                759
            ],
            [
                763,
                805
            ],
            [
                805,
                847
            ],
            [
                847,
                858
            ],
            [
                859,
                882
            ],
            [
                883,
                887
            ],
            [
                888,
                925
            ],
            [
                925,
                934
            ],
            [
                935,
                1010
            ],
            [
                1011,
                1046
            ],
            [
                1049,
                1117
            ],
            [
                1127,
                1129
            ],
            [
                1129,
                1131
            ],
            [
                1139,
                1144
            ],
            [
                1145,
                1225
            ],
            [
                1225,
                1227
            ],
            [
                1227,
                1328
            ],
            [
                1329,
                1333
            ],
            [
                1333,
                1338
            ],
            [
                1339,
                1341
            ],
            [
                1342,
                1349
            ],
            [
                1350,
                1426
            ],
            [
                1431,
                1440
            ],
            [
                1440,
                1441
            ],
            [
                1442,
                1445
            ],
            [
                1446,
                1470
            ],
            [
                1471,
                1481
            ],
            [
                1482,
                1486
            ],
            [
                1487,
                1490
            ],
            [
                1491,
                1499
            ],
            [
                1506,
                1515
            ],
            [
                1516,
                1529
            ],
            [
                1541,
                1543
            ],
            [
                1544,
                1598
            ],
            [
                1599,
                1615
            ],
            [
                1616,
                1623
            ],
            [
                1623,
                1624
            ],
            [
                1633,
                1640
            ],
            [
                1640,
                1642
            ],
            [
                1642,
                1664
            ],
            [
                1677,
                1726
            ],
            [
                1735,
                1816
            ],
            [
                1817,
                1870
            ],
            [
                1871,
                1901
            ],
            [
                1908,
                1917
            ],
            [
                1917,
                1975
            ],
            [
                1975,
                2033
            ],
            [
                2033,
                2212
            ],
            [
                2212,
                2214
            ],
            [
                2214,
                2258
            ],
            [
                2267,
                2275
            ],
            [
                2293,
                2345
            ],
            [
                2346,
                2372
            ],
            [
                2377,
                2379
            ],
            [
                2380,
                2383
            ],
            [
                2384,
                2473
            ],
            [
                2473,
                2501
            ],
            [
                2501,
                2611
            ],
            [
                2616,
                2618
            ],
            [
                2618,
                2624
            ],
            [
                2634,
                2743
            ],
            [
                2743,
                2775
            ],
            [
                2778,
                2804
            ],
            [
                2807,
                2829
            ],
            [
                2829,
                2849
            ],
            [
                2850,
                2891
            ],
            [
                2891,
                2983
            ],
            [
                2983,
                3030
            ],
            [
                3030,
                3085
            ],
            [
                3085,
                3096
            ],
            [
                3096,
                3120
            ],
            [
                3120,
                3121
            ],
            [
                3122,
                3201
            ],
            [
                3201,
                3311
            ],
            [
                3311,
                3335
            ],
            [
                3335,
                3382
            ],
            [
                3389,
                3391
            ],
            [
                3391,
                3438
            ],
            [
                3444,
                3465
            ],
            [
                3469,
                3520
            ],
            [
                3526,
                3540
            ],
            [
                3540,
                3568
            ],
            [
                3568,
                3602
            ],
            [
                3602,
                3629
            ],
            [
                3635,
                3644
            ],
            [
                3650,
                3652
            ],
            [
                3652,
                3720
            ],
            [
                3722,
                3774
            ],
            [
                3774,
                3812
            ],
            [
                3826,
                3828
            ],
            [
                3828,
                3880
            ],
            [
                3880,
                3921
            ],
            [
                3930,
                3932
            ],
            [
                3932,
                3999
            ],
            [
                3999,
                4016
            ],
            [
                4026,
                4062
            ],
            [
                4062,
                4084
            ],
            [
                4084,
                4092
            ],
            [
                4096,
                4118
            ],
            [
                4118,
                4176
            ],
            [
                4181,
                4205
            ],
            [
                4205,
                4214
            ],
            [
                4215,
                4311
            ],
            [
                4311,
                4403
            ],
            [
                4403,
                4426
            ],
            [
                4435,
                4484
            ],
            [
                4484,
                4508
            ],
            [
                4511,
                4525
            ],
            [
                4525,
                4579
            ],
            [
                4579,
                4773
            ],
            [
                4773,
                4791
            ],
            [
                4797,
                4840
            ],
            [
                4840,
                4927
            ],
            [
                4927,
                4928
            ],
            [
                4929,
                4941
            ],
            [
                4941,
                4986
            ],
            [
                4986,
                5016
            ],
            [
                5016,
                5025
            ],
            [
                5027,
                5054
            ],
            [
                5054,
                5064
            ],
            [
                5065,
                5117
            ],
            [
                5117,
                5128
            ],
            [
                5129,
                5166
            ],
            [
                5166,
                5167
            ],
            [
                5168,
                5201
            ],
            [
                5201,
                5212
            ],
            [
                5212,
                5220
            ],
            [
                5220,
                5291
            ],
            [
                5291,
                5294
            ],
            [
                5302,
                5305
            ],
            [
                5305,
                5336
            ],
            [
                5340,
                5341
            ],
            [
                5342,
                5350
            ],
            [
                5351,
                5407
            ],
            [
                5407,
                5471
            ],
            [
                5471,
                5504
            ],
            [
                5504,
                5506
            ],
            [
                5506,
                5562
            ],
            [
                5562,
                5587
            ],
            [
                5588,
                5602
            ],
            [
                5602,
                5633
            ],
            [
                5635,
                5694
            ],
            [
                5694,
                5710
            ],
            [
                5710,
                5811
            ],
            [
                5811,
                5859
            ],
            [
                5879,
                5882
            ],
            [
                5887,
                5907
            ],
            [
                5907,
                5923
            ],
            [
                5923,
                5934
            ],
            [
                5934,
                5942
            ],
            [
                5947,
                5959
            ],
            [
                5959,
                5976
            ],
            [
                5981,
                5990
            ],
            [
                5991,
                6006
            ],
            [
                6006,
                6070
            ],
            [
                6070,
                6132
            ],
            [
                6138,
                6188
            ],
            [
                6192,
                6194
            ],
            [
                6194,
                6247
            ],
            [
                6247,
                6259
            ],
            [
                6260,
                6269
            ],
            [
                6269,
                6270
            ],
            [
                6271,
                6282
            ],
            [
                6282,
                6326
            ],
            [
                6326,
                6328
            ],
            [
                6328,
                6372
            ],
            [
                6373,
                6375
            ],
            [
                6376,
                6434
            ],
            [
                6434,
                6466
            ],
            [
                6466,
                6494
            ],
            [
                6494,
                6535
            ],
            [
                6535,
                6540
            ],
            [
                6540,
                6552
            ],
            [
                6552,
                6570
            ],
            [
                6570,
                6572
            ],
            [
                6572,
                6589
            ],
            [
                6589,
                6620
            ],
            [
                6620,
                6623
            ],
            [
                6623,
                6648
            ],
            [
                6648,
                6650
            ],
            [
                6650,
                6657
            ],
            [
                6657,
                6688
            ],
            [
                6691,
                6725
            ],
            [
                6726,
                6730
            ],
            [
                6731,
                6743
            ],
            [
                6749,
                6779
            ],
            [
                6779,
                6881
            ],
            [
                6881,
                7015
            ],
            [
                7015,
                7021
            ],
            [
                7022,
                7039
            ],
            [
                7040,
                7063
            ],
            [
                7067,
                7104
            ],
            [
                7109,
                7111
            ],
            [
                7111,
                7131
            ],
            [
                7131,
                7186
            ],
            [
                7186,
                7196
            ],
            [
                7197,
                7261
            ],
            [
                7263,
                7304
            ],
            [
                7304,
                7337
            ],
            [
                7337,
                7356
            ],
            [
                7356,
                7383
            ],
            [
                7383,
                7415
            ],
            [
                7415,
                7418
            ],
            [
                7418,
                7425
            ],
            [
                7426,
                7440
            ],
            [
                7440,
                7441
            ],
            [
                7441,
                7451
            ],
            [
                7451,
                7465
            ],
            [
                7465,
                7485
            ],
            [
                7485,
                7517
            ],
            [
                7517,
                7525
            ],
            [
                7526,
                7604
            ],
            [
                7604,
                7651
            ],
            [
                7658,
                7660
            ],
            [
                7660,
                7712
            ],
            [
                7712,
                7723
            ],
            [
                7723,
                7743
            ],
            [
                7743,
                7759
            ],
            [
                7760,
                7763
            ],
            [
                7764,
                7797
            ],
            [
                7798,
                7799
            ],
            [
                7800,
                7814
            ],
            [
                7819,
                7821
            ],
            [
                7821,
                7856
            ],
            [
                7856,
                7880
            ],
            [
                7881,
                7898
            ],
            [
                7898,
                7900
            ],
            [
                7900,
                7922
            ],
            [
                7922,
                7955
            ],
            [
                7955,
                7975
            ],
            [
                7975,
                8008
            ],
            [
                8008,
                8033
            ],
            [
                8033,
                8035
            ],
            [
                8035,
                8036
            ],
            [
                8037,
                8069
            ],
            [
                8069,
                8104
            ],
            [
                8105,
                8131
            ],
            [
                8139,
                8219
            ],
            [
                8219,
                8250
            ],
            [
                8250,
                8302
            ],
            [
                8302,
                8345
            ],
            [
                8345,
                8440
            ],
            [
                8440,
                8442
            ],
            [
                8442,
                8473
            ],
            [
                8474,
                8486
            ],
            [
                8486,
                8517
            ],
            [
                8517,
                8563
            ],
            [
                8563,
                8606
            ],
            [
                8606,
                8609
            ],
            [
                8610,
                8619
            ],
            [
                8619,
                8637
            ],
            [
                8638,
                8657
            ],
            [
                8657,
                8722
            ],
            [
                8722,
                8775
            ],
            [
                8775,
                8786
            ],
            [
                8787,
                8822
            ],
            [
                8822,
                8900
            ],
            [
                8903,
                8920
            ],
            [
                8921,
                8942
            ],
            [
                8942,
                9120
            ],
            [
                9120,
                9214
            ],
            [
                9215,
                9232
            ],
            [
                9232,
                9329
            ],
            [
                9330,
                9379
            ],
            [
                9379,
                9415
            ],
            [
                9415,
                9417
            ],
            [
                9418,
                9425
            ],
            [
                9425,
                9449
            ],
            [
                9457,
                9464
            ],
            [
                9464,
                9491
            ],
            [
                9491,
                9496
            ],
            [
                9496,
                9522
            ],
            [
                9525,
                9570
            ],
            [
                9570,
                9654
            ],
            [
                9655,
                9679
            ],
            [
                9679,
                9749
            ],
            [
                9750,
                9789
            ],
            [
                9799,
                9903
            ],
            [
                9904,
                9905
            ],
            [
                9906,
                9912
            ],
            [
                9913,
                9916
            ],
            [
                9927,
                9928
            ],
            [
                9929,
                9986
            ],
            [
                9990,
                9997
            ],
            [
                9997,
                10050
            ],
            [
                10051,
                10060
            ],
            [
                10061,
                10070
            ],
            [
                10071,
                10084
            ],
            [
                10085,
                10121
            ],
            [
                10134,
                10159
            ],
            [
                10159,
                10171
            ],
            [
                10171,
                10279
            ],
            [
                10280,
                10287
            ],
            [
                10287,
                10309
            ],
            [
                10309,
                10323
            ],
            [
                10323,
                10398
            ],
            [
                10398,
                10400
            ],
            [
                10400,
                10423
            ],
            [
                10423,
                10482
            ],
            [
                10483,
                10499
            ],
            [
                10499,
                10580
            ],
            [
                10581,
                10587
            ],
            [
                10590,
                10629
            ],
            [
                10629,
                10643
            ],
            [
                10643,
                10674
            ],
            [
                10674,
                10701
            ],
            [
                10701,
                10719
            ],
            [
                10720,
                10774
            ],
            [
                10783,
                10804
            ],
            [
                10810,
                10838
            ],
            [
                10838,
                10840
            ],
            [
                10840,
                10841
            ],
            [
                10841,
                10851
            ],
            [
                10851,
                10869
            ],
            [
                10869,
                10888
            ],
            [
                10888,
                10929
            ],
            [
                10929,
                10934
            ],
            [
                10934,
                10971
            ],
            [
                10971,
                11050
            ],
            [
                11051,
                11066
            ],
            [
                11066,
                11068
            ],
            [
                11068,
                11125
            ],
            [
                11125,
                11129
            ],
            [
                11132,
                11134
            ],
            [
                11134,
                11165
            ],
            [
                11166,
                11187
            ],
            [
                11187,
                11191
            ],
            [
                11194,
                11198
            ],
            [
                11198,
                11281
            ],
            [
                11281,
                11329
            ],
            [
                11329,
                11344
            ],
            [
                11350,
                11353
            ],
            [
                11353,
                11378
            ],
            [
                11378,
                11396
            ],
            [
                11396,
                11439
            ],
            [
                11439,
                11442
            ],
            [
                11449,
                11479
            ],
            [
                11479,
                11525
            ],
            [
                11525,
                11549
            ],
            [
                11552,
                11553
            ],
            [
                11553,
                11633
            ],
            [
                11633,
                11699
            ],
            [
                11699,
                11715
            ],
            [
                11715,
                11813
            ],
            [
                11816,
                11843
            ],
            [
                11843,
                11877
            ],
            [
                11878,
                11933
            ],
            [
                11933,
                11989
            ],
            [
                11989,
                12029
            ],
            [
                12029,
                12043
            ],
            [
                12043,
                12119
            ],
            [
                12120,
                12227
            ],
            [
                12227,
                12235
            ],
            [
                12235,
                12253
            ],
            [
                12253,
                12352
            ],
            [
                12352,
                12354
            ],
            [
                12354,
                12372
            ],
            [
                12372,
                12421
            ],
            [
                12421,
                12474
            ],
            [
                12477,
                12514
            ],
            [
                12514,
                12558
            ],
            [
                12558,
                12602
            ],
            [
                12602,
                12706
            ],
            [
                12706,
                12723
            ],
            [
                12723,
                12743
            ],
            [
                12743,
                12753
            ],
            [
                12753,
                12766
            ],
            [
                12766,
                12863
            ],
            [
                12863,
                12956
            ],
            [
                12956,
                13042
            ],
            [
                13042,
                13095
            ],
            [
                13096,
                13172
            ],
            [
                13173,
                13176
            ],
            [
                13187,
                13189
            ],
            [
                13189,
                13246
            ],
            [
                13247,
                13290
            ],
            [
                13290,
                13395
            ],
            [
                13396,
                13457
            ],
            [
                13469,
                13472
            ],
            [
                13480,
                13512
            ],
            [
                13512,
                13596
            ],
            [
                13599,
                13613
            ],
            [
                13613,
                13641
            ],
            [
                13641,
                13642
            ],
            [
                13642,
                13718
            ],
            [
                13719,
                13756
            ],
            [
                13757,
                13786
            ],
            [
                13793,
                13831
            ],
            [
                13831,
                13895
            ],
            [
                13896,
                13923
            ],
            [
                13923,
                13941
            ],
            [
                13946,
                13950
            ],
            [
                13950,
                14051
            ],
            [
                14051,
                14129
            ],
            [
                14129,
                14135
            ],
            [
                14135,
                14158
            ],
            [
                14163,
                14181
            ],
            [
                14184,
                14190
            ],
            [
                14190,
                14197
            ],
            [
                14197,
                14299
            ],
            [
                14299,
                14315
            ],
            [
                14319,
                14322
            ],
            [
                14322,
                14340
            ],
            [
                14340,
                14372
            ],
            [
                14372,
                14374
            ],
            [
                14375,
                14491
            ],
            [
                14491,
                14518
            ],
            [
                14524,
                14546
            ],
            [
                14546,
                14651
            ],
            [
                14651,
                14677
            ],
            [
                14677,
                14695
            ],
            [
                14695,
                14716
            ],
            [
                14716,
                14718
            ],
            [
                14718,
                14721
            ],
            [
                14722,
                14740
            ],
            [
                14740,
                14759
            ],
            [
                14759,
                14940
            ],
            [
                14940,
                14969
            ],
            [
                14969,
                15066
            ],
            [
                15066,
                15068
            ],
            [
                15068,
                15102
            ],
            [
                15105,
                15108
            ],
            [
                15112,
                15121
            ],
            [
                15121,
                15159
            ],
            [
                15162,
                15208
            ],
            [
                15208,
                15228
            ],
            [
                15228,
                15345
            ],
            [
                15350,
                15370
            ],
            [
                15370,
                15400
            ],
            [
                15401,
                15416
            ],
            [
                15417,
                15443
            ],
            [
                15443,
                15448
            ],
            [
                15451,
                15461
            ],
            [
                15464,
                15476
            ],
            [
                15476,
                15522
            ],
            [
                15530,
                15538
            ],
            [
                15538,
                15543
            ],
            [
                15544,
                15574
            ],
            [
                15581,
                15593
            ],
            [
                15593,
                15595
            ],
            [
                15595,
                15612
            ],
            [
                15612,
                15617
            ],
            [
                15618,
                15648
            ],
            [
                15648,
                15650
            ],
            [
                15650,
                15718
            ],
            [
                15718,
                15742
            ],
            [
                15751,
                15761
            ],
            [
                15762,
                15767
            ],
            [
                15767,
                15769
            ],
            [
                15769,
                15881
            ],
            [
                15882,
                15893
            ],
            [
                15895,
                15927
            ],
            [
                15927,
                16000
            ],
            [
                16001,
                16034
            ],
            [
                16034,
                16049
            ],
            [
                16049,
                16060
            ],
            [
                16060,
                16078
            ],
            [
                16078,
                16099
            ],
            [
                16105,
                16108
            ],
            [
                16108,
                16219
            ],
            [
                16229,
                16234
            ],
            [
                16235,
                16259
            ],
            [
                16260,
                16264
            ],
            [
                16264,
                16265
            ],
            [
                16266,
                16293
            ],
            [
                16297,
                16298
            ],
            [
                16299,
                16319
            ],
            [
                16319,
                16321
            ],
            [
                16329,
                16355
            ],
            [
                16355,
                16357
            ],
            [
                16358,
                16414
            ],
            [
                16414,
                16485
            ],
            [
                16486,
                16495
            ],
            [
                16498,
                16513
            ],
            [
                16513,
                16540
            ],
            [
                16541,
                16548
            ],
            [
                16548,
                16579
            ],
            [
                16579,
                16595
            ],
            [
                16595,
                16613
            ],
            [
                16613,
                16634
            ],
            [
                16634,
                16772
            ],
            [
                16772,
                16773
            ],
            [
                16773,
                16794
            ],
            [
                16794,
                16812
            ],
            [
                16812,
                16846
            ],
            [
                16848,
                16849
            ],
            [
                16849,
                16868
            ],
            [
                16868,
                16893
            ],
            [
                16893,
                16896
            ],
            [
                16896,
                16897
            ],
            [
                16898,
                16961
            ],
            [
                16961,
                16963
            ],
            [
                16963,
                17073
            ],
            [
                17073,
                17155
            ],
            [
                17155,
                17166
            ],
            [
                17167,
                17211
            ],
            [
                17211,
                17265
            ],
            [
                17273,
                17347
            ],
            [
                17347,
                17374
            ],
            [
                17377,
                17388
            ],
            [
                17388,
                17416
            ],
            [
                17416,
                17475
            ],
            [
                17475,
                17537
            ],
            [
                17537,
                17565
            ],
            [
                17566,
                17607
            ],
            [
                17607,
                17650
            ],
            [
                17650,
                17663
            ],
            [
                17664,
                17676
            ],
            [
                17676,
                17677
            ],
            [
                17686,
                17761
            ],
            [
                17761,
                17769
            ],
            [
                17770,
                17819
            ],
            [
                17819,
                17822
            ],
            [
                17823,
                17834
            ],
            [
                17845,
                17871
            ],
            [
                17871,
                17915
            ],
            [
                17915,
                17941
            ],
            [
                17941,
                18001
            ],
            [
                18002,
                18029
            ],
            [
                18029,
                18126
            ],
            [
                18127,
                18146
            ],
            [
                18146,
                18162
            ],
            [
                18162,
                18214
            ],
            [
                18214,
                18215
            ],
            [
                18216,
                18302
            ],
            [
                18302,
                18312
            ],
            [
                18312,
                18353
            ],
            [
                18353,
                18480
            ],
            [
                18480,
                18515
            ],
            [
                18522,
                18529
            ],
            [
                18530,
                18533
            ],
            [
                18534,
                18581
            ],
            [
                18581,
                18582
            ],
            [
                18584,
                18643
            ],
            [
                18643,
                18677
            ],
            [
                18677,
                18735
            ],
            [
                18736,
                18815
            ],
            [
                18815,
                18817
            ],
            [
                18817,
                18872
            ],
            [
                18875,
                18910
            ],
            [
                18914,
                18997
            ],
            [
                18997,
                19019
            ],
            [
                19022,
                19048
            ],
            [
                19052,
                19081
            ],
            [
                19081,
                19102
            ],
            [
                19111,
                19130
            ],
            [
                19131,
                19153
            ],
            [
                19153,
                19168
            ],
            [
                19169,
                19188
            ],
            [
                19188,
                19196
            ],
            [
                19200,
                19215
            ],
            [
                19218,
                19246
            ],
            [
                19246,
                19356
            ],
            [
                19356,
                19363
            ],
            [
                19368,
                19377
            ],
            [
                19378,
                19407
            ],
            [
                19408,
                19447
            ],
            [
                19447,
                19509
            ],
            [
                19516,
                19539
            ],
            [
                19539,
                19554
            ],
            [
                19554,
                19570
            ],
            [
                19570,
                19572
            ],
            [
                19572,
                19585
            ],
            [
                19585,
                19589
            ],
            [
                19597,
                19601
            ],
            [
                19601,
                19620
            ],
            [
                19632,
                19639
            ],
            [
                19663,
                19703
            ],
            [
                19703,
                19734
            ],
            [
                19735,
                19748
            ],
            [
                19749,
                19751
            ],
            [
                19759,
                19760
            ],
            [
                19769,
                19792
            ],
            [
                19792,
                19809
            ],
            [
                19813,
                19879
            ],
            [
                19882,
                19883
            ],
            [
                19884,
                19888
            ],
            [
                19900,
                19904
            ],
            [
                19914,
                19915
            ],
            [
                19923,
                19957
            ],
            [
                19959,
                19966
            ],
            [
                19968,
                19980
            ],
            [
                19980,
                19981
            ],
            [
                19984,
                19995
            ],
            [
                19996,
                20018
            ],
            [
                20018,
                20063
            ],
            [
                20063,
                20116
            ],
            [
                20116,
                20130
            ],
            [
                20131,
                20160
            ],
            [
                20160,
                20210
            ],
            [
                20210,
                20266
            ],
            [
                20266,
                20268
            ],
            [
                20269,
                20383
            ],
            [
                20388,
                20415
            ],
            [
                20416,
                20432
            ],
            [
                20432,
                20435
            ],
            [
                20436,
                20570
            ],
            [
                20571,
                20592
            ],
            [
                20592,
                20595
            ],
            [
                20595,
                20656
            ],
            [
                20656,
                20714
            ],
            [
                20714,
                20825
            ],
            [
                20828,
                20831
            ],
            [
                20837,
                20881
            ],
            [
                20881,
                20948
            ],
            [
                20949,
                20950
            ],
            [
                20950,
                20952
            ],
            [
                20953,
                20974
            ],
            [
                20974,
                21032
            ],
            [
                21032,
                21072
            ],
            [
                21072,
                21078
            ],
            [
                21078,
                21088
            ],
            [
                21088,
                21115
            ],
            [
                21115,
                21141
            ],
            [
                21141,
                21169
            ],
            [
                21169,
                21174
            ],
            [
                21174,
                21198
            ],
            [
                21198,
                21235
            ],
            [
                21235,
                21237
            ],
            [
                21237,
                21304
            ],
            [
                21304,
                21332
            ],
            [
                21332,
                21339
            ],
            [
                21340,
                21341
            ],
            [
                21342,
                21347
            ],
            [
                21363,
                21373
            ],
            [
                21374,
                21401
            ],
            [
                21402,
                21438
            ],
            [
                21438,
                21475
            ],
            [
                21476,
                21501
            ],
            [
                21501,
                21508
            ],
            [
                21509,
                21554
            ],
            [
                21555,
                21587
            ],
            [
                21587,
                21622
            ],
            [
                21623,
                21640
            ],
            [
                21643,
                21670
            ],
            [
                21671,
                21678
            ],
            [
                21679,
                21702
            ],
            [
                21711,
                21738
            ],
            [
                21739,
                21757
            ],
            [
                21760,
                21786
            ],
            [
                21796,
                21832
            ],
            [
                21832,
                21856
            ],
            [
                21856,
                21887
            ],
            [
                21888,
                21920
            ],
            [
                21920,
                21936
            ],
            [
                21937,
                21945
            ],
            [
                21946,
                21982
            ],
            [
                21986,
                22054
            ],
            [
                22056,
                22093
            ],
            [
                22093,
                22095
            ],
            [
                22095,
                22108
            ],
            [
                22109,
                22116
            ],
            [
                22117,
                22125
            ],
            [
                22126,
                22287
            ],
            [
                22287,
                22321
            ],
            [
                22322,
                22325
            ],
            [
                22326,
                22334
            ],
            [
                22344,
                22376
            ],
            [
                22377,
                22447
            ],
            [
                22447,
                22502
            ],
            [
                22511,
                22535
            ],
            [
                22544,
                22617
            ],
            [
                22618,
                22627
            ],
            [
                22628,
                22630
            ],
            [
                22631,
                22696
            ]
        ],
        "row_chars": [
            [
                0,
                93
            ],
            [
                93,
                168
            ],
            [
                168,
                314
            ],
            [
                314,
                353
            ],
            [
                353,
                353
            ],
            [
                353,
                353
            ],
            [
                353,
                482
            ],
            [
                482,
                577
            ],
            [
                577,
                703
            ],
            [
                703,
                805
            ],
            [
                805,
                847
            ],
            [
                847,
                1129
            ],
            [
                1129,
                1227
            ],
            [
                1227,
                1642
            ],
            [
                1642,
                1975
            ],
            [
                1975,
                2033
            ],
            [
                2033,
                2214
            ],
            [
                2214,
                2346
            ],
            [
                2346,
                2346
            ],
            [
                2346,
                2473
            ],
            [
                2473,
                2501
            ],
            [
                2501,
                2618
            ],
            [
                2618,
                2618
            ],
            [
                2618,
                2618
            ],
            [
                2618,
                2618
            ],
            [
                2618,
                2743
            ],
            [
                2743,
                2829
            ],
            [
                2829,
                2891
            ],
            [
                2891,
                3030
            ],
            [
                3030,
                3085
            ],
            [
                3085,
                3096
            ],
            [
                3096,
                3201
            ],
            [
                3201,
                3311
            ],
            [
                3311,
                3335
            ],
            [
                3335,
                3391
            ],
            [
                3391,
                3391
            ],
            [
                3391,
                3469
            ],
            [
                3469,
                3469
            ],
            [
                3469,
                3469
            ],
            [
                3469,
                3469
            ],
            [
                3469,
                3568
            ],
            [
                3568,
                3652
            ],
            [
                3652,
                3722
            ],
            [
                3722,
                3722
            ],
            [
                3722,
                3722
            ],
            [
                3722,
                3722
            ],
            [
                3722,
                3722
            ],
            [
                3722,
                3774
            ],
            [
                3774,
                3828
            ],
            [
                3828,
                3828
            ],
            [
                3828,
                3828
            ],
            [
                3828,
                3880
            ],
            [
                3880,
                3999
            ],
            [
                3999,
                4026
            ],
            [
                4026,
                4026
            ],
            [
                4026,
                4062
            ],
            [
                4062,
                4084
            ],
            [
                4084,
                4118
            ],
            [
                4118,
                4176
            ],
            [
                4176,
                4205
            ],
            [
                4205,
                4311
            ],
            [
                4311,
                4403
            ],
            [
                4403,
                4484
            ],
            [
                4484,
                4525
            ],
            [
                4525,
                4525
            ],
            [
                4525,
                4579
            ],
            [
                4579,
                4773
            ],
            [
                4773,
                4773
            ],
            [
                4773,
                4840
            ],
            [
                4840,
                4941
            ],
            [
                4941,
                4986
            ],
            [
                4986,
                5016
            ],
            [
                5016,
                5054
            ],
            [
                5054,
                5117
            ],
            [
                5117,
                5201
            ],
            [
                5201,
                5212
            ],
            [
                5212,
                5220
            ],
            [
                5220,
                5291
            ],
            [
                5291,
                5305
            ],
            [
                5305,
                5407
            ],
            [
                5407,
                5471
            ],
            [
                5471,
                5506
            ],
            [
                5506,
                5562
            ],
            [
                5562,
                5602
            ],
            [
                5602,
                5694
            ],
            [
                5694,
                5710
            ],
            [
                5710,
                5811
            ],
            [
                5811,
                5907
            ],
            [
                5907,
                5923
            ],
            [
                5923,
                5934
            ],
            [
                5934,
                5959
            ],
            [
                5959,
                5976
            ],
            [
                5976,
                5976
            ],
            [
                5976,
                6006
            ],
            [
                6006,
                6070
            ],
            [
                6070,
                6194
            ],
            [
                6194,
                6247
            ],
            [
                6247,
                6282
            ],
            [
                6282,
                6328
            ],
            [
                6328,
                6434
            ],
            [
                6434,
                6466
            ],
            [
                6466,
                6494
            ],
            [
                6494,
                6535
            ],
            [
                6535,
                6540
            ],
            [
                6540,
                6552
            ],
            [
                6552,
                6572
            ],
            [
                6572,
                6589
            ],
            [
                6589,
                6623
            ],
            [
                6623,
                6650
            ],
            [
                6650,
                6657
            ],
            [
                6657,
                6691
            ],
            [
                6691,
                6691
            ],
            [
                6691,
                6779
            ],
            [
                6779,
                6881
            ],
            [
                6881,
                7015
            ],
            [
                7015,
                7111
            ],
            [
                7111,
                7131
            ],
            [
                7131,
                7186
            ],
            [
                7186,
                7263
            ],
            [
                7263,
                7263
            ],
            [
                7263,
                7263
            ],
            [
                7263,
                7263
            ],
            [
                7263,
                7304
            ],
            [
                7304,
                7337
            ],
            [
                7337,
                7356
            ],
            [
                7356,
                7383
            ],
            [
                7383,
                7418
            ],
            [
                7418,
                7440
            ],
            [
                7440,
                7451
            ],
            [
                7451,
                7465
            ],
            [
                7465,
                7485
            ],
            [
                7485,
                7517
            ],
            [
                7517,
                7604
            ],
            [
                7604,
                7660
            ],
            [
                7660,
                7712
            ],
            [
                7712,
                7723
            ],
            [
                7723,
                7743
            ],
            [
                7743,
                7821
            ],
            [
                7821,
                7856
            ],
            [
                7856,
                7900
            ],
            [
                7900,
                7922
            ],
            [
                7922,
                7955
            ],
            [
                7955,
                7975
            ],
            [
                7975,
                7975
            ],
            [
                7975,
                8008
            ],
            [
                8008,
                8035
            ],
            [
                8035,
                8035
            ],
            [
                8035,
                8069
            ],
            [
                8069,
                8219
            ],
            [
                8219,
                8250
            ],
            [
                8250,
                8302
            ],
            [
                8302,
                8345
            ],
            [
                8345,
                8442
            ],
            [
                8442,
                8474
            ],
            [
                8474,
                8486
            ],
            [
                8486,
                8517
            ],
            [
                8517,
                8606
            ],
            [
                8606,
                8657
            ],
            [
                8657,
                8775
            ],
            [
                8775,
                8822
            ],
            [
                8822,
                8903
            ],
            [
                8903,
                8903
            ],
            [
                8903,
                8942
            ],
            [
                8942,
                9120
            ],
            [
                9120,
                9232
            ],
            [
                9232,
                9379
            ],
            [
                9379,
                9415
            ],
            [
                9415,
                9425
            ],
            [
                9425,
                9464
            ],
            [
                9464,
                9491
            ],
            [
                9491,
                9496
            ],
            [
                9496,
                9525
            ],
            [
                9525,
                9525
            ],
            [
                9525,
                9570
            ],
            [
                9570,
                9655
            ],
            [
                9655,
                9655
            ],
            [
                9655,
                9679
            ],
            [
                9679,
                9789
            ],
            [
                9789,
                9997
            ],
            [
                9997,
                10085
            ],
            [
                10085,
                10085
            ],
            [
                10085,
                10159
            ],
            [
                10159,
                10287
            ],
            [
                10287,
                10309
            ],
            [
                10309,
                10323
            ],
            [
                10323,
                10400
            ],
            [
                10400,
                10499
            ],
            [
                10499,
                10629
            ],
            [
                10629,
                10643
            ],
            [
                10643,
                10674
            ],
            [
                10674,
                10701
            ],
            [
                10701,
                10840
            ],
            [
                10840,
                10851
            ],
            [
                10851,
                10869
            ],
            [
                10869,
                10888
            ],
            [
                10888,
                10929
            ],
            [
                10929,
                10934
            ],
            [
                10934,
                10971
            ],
            [
                10971,
                10971
            ],
            [
                10971,
                11068
            ],
            [
                11068,
                11125
            ],
            [
                11125,
                11134
            ],
            [
                11134,
                11187
            ],
            [
                11187,
                11198
            ],
            [
                11198,
                11281
            ],
            [
                11281,
                11329
            ],
            [
                11329,
                11353
            ],
            [
                11353,
                11378
            ],
            [
                11378,
                11396
            ],
            [
                11396,
                11439
            ],
            [
                11439,
                11479
            ],
            [
                11479,
                11525
            ],
            [
                11525,
                11552
            ],
            [
                11552,
                11552
            ],
            [
                11552,
                11633
            ],
            [
                11633,
                11699
            ],
            [
                11699,
                11715
            ],
            [
                11715,
                11816
            ],
            [
                11816,
                11816
            ],
            [
                11816,
                11843
            ],
            [
                11843,
                11933
            ],
            [
                11933,
                11989
            ],
            [
                11989,
                12029
            ],
            [
                12029,
                12043
            ],
            [
                12043,
                12227
            ],
            [
                12227,
                12235
            ],
            [
                12235,
                12253
            ],
            [
                12253,
                12354
            ],
            [
                12354,
                12372
            ],
            [
                12372,
                12421
            ],
            [
                12421,
                12514
            ],
            [
                12514,
                12558
            ],
            [
                12558,
                12602
            ],
            [
                12602,
                12706
            ],
            [
                12706,
                12723
            ],
            [
                12723,
                12743
            ],
            [
                12743,
                12753
            ],
            [
                12753,
                12766
            ],
            [
                12766,
                12956
            ],
            [
                12956,
                13042
            ],
            [
                13042,
                13189
            ],
            [
                13189,
                13290
            ],
            [
                13290,
                13512
            ],
            [
                13512,
                13599
            ],
            [
                13599,
                13613
            ],
            [
                13613,
                13641
            ],
            [
                13641,
                13831
            ],
            [
                13831,
                13923
            ],
            [
                13923,
                13950
            ],
            [
                13950,
                14051
            ],
            [
                14051,
                14129
            ],
            [
                14129,
                14135
            ],
            [
                14135,
                14190
            ],
            [
                14190,
                14299
            ],
            [
                14299,
                14322
            ],
            [
                14322,
                14340
            ],
            [
                14340,
                14374
            ],
            [
                14374,
                14491
            ],
            [
                14491,
                14546
            ],
            [
                14546,
                14546
            ],
            [
                14546,
                14651
            ],
            [
                14651,
                14677
            ],
            [
                14677,
                14695
            ],
            [
                14695,
                14718
            ],
            [
                14718,
                14759
            ],
            [
                14759,
                14940
            ],
            [
                14940,
                14969
            ],
            [
                14969,
                15068
            ],
            [
                15068,
                15121
            ],
            [
                15121,
                15162
            ],
            [
                15162,
                15162
            ],
            [
                15162,
                15208
            ],
            [
                15208,
                15228
            ],
            [
                15228,
                15370
            ],
            [
                15370,
                15476
            ],
            [
                15476,
                15476
            ],
            [
                15476,
                15595
            ],
            [
                15595,
                15650
            ],
            [
                15650,
                15718
            ],
            [
                15718,
                15769
            ],
            [
                15769,
                15927
            ],
            [
                15927,
                16034
            ],
            [
                16034,
                16034
            ],
            [
                16034,
                16049
            ],
            [
                16049,
                16060
            ],
            [
                16060,
                16078
            ],
            [
                16078,
                16108
            ],
            [
                16108,
                16266
            ],
            [
                16266,
                16266
            ],
            [
                16266,
                16266
            ],
            [
                16266,
                16357
            ],
            [
                16357,
                16414
            ],
            [
                16414,
                16498
            ],
            [
                16498,
                16513
            ],
            [
                16513,
                16548
            ],
            [
                16548,
                16579
            ],
            [
                16579,
                16595
            ],
            [
                16595,
                16613
            ],
            [
                16613,
                16634
            ],
            [
                16634,
                16772
            ],
            [
                16772,
                16794
            ],
            [
                16794,
                16812
            ],
            [
                16812,
                16868
            ],
            [
                16868,
                16893
            ],
            [
                16893,
                16893
            ],
            [
                16893,
                16963
            ],
            [
                16963,
                17155
            ],
            [
                17155,
                17211
            ],
            [
                17211,
                17347
            ],
            [
                17347,
                17388
            ],
            [
                17388,
                17475
            ],
            [
                17475,
                17537
            ],
            [
                17537,
                17607
            ],
            [
                17607,
                17607
            ],
            [
                17607,
                17607
            ],
            [
                17607,
                17650
            ],
            [
                17650,
                17761
            ],
            [
                17761,
                17819
            ],
            [
                17819,
                17871
            ],
            [
                17871,
                17915
            ],
            [
                17915,
                17915
            ],
            [
                17915,
                17941
            ],
            [
                17941,
                18029
            ],
            [
                18029,
                18146
            ],
            [
                18146,
                18162
            ],
            [
                18162,
                18214
            ],
            [
                18214,
                18302
            ],
            [
                18302,
                18312
            ],
            [
                18312,
                18353
            ],
            [
                18353,
                18480
            ],
            [
                18480,
                18583
            ],
            [
                18583,
                18643
            ],
            [
                18643,
                18677
            ],
            [
                18677,
                18817
            ],
            [
                18817,
                18997
            ],
            [
                18997,
                19081
            ],
            [
                19081,
                19153
            ],
            [
                19153,
                19188
            ],
            [
                19188,
                19246
            ],
            [
                19246,
                19356
            ],
            [
                19356,
                19447
            ],
            [
                19447,
                19539
            ],
            [
                19539,
                19554
            ],
            [
                19554,
                19572
            ],
            [
                19572,
                19585
            ],
            [
                19585,
                19620
            ],
            [
                19620,
                19620
            ],
            [
                19620,
                19620
            ],
            [
                19620,
                19620
            ],
            [
                19620,
                19620
            ],
            [
                19620,
                19703
            ],
            [
                19703,
                19792
            ],
            [
                19792,
                19809
            ],
            [
                19809,
                19809
            ],
            [
                19809,
                19882
            ],
            [
                19882,
                19882
            ],
            [
                19882,
                19882
            ],
            [
                19882,
                19916
            ],
            [
                19916,
                20018
            ],
            [
                20018,
                20018
            ],
            [
                20018,
                20063
            ],
            [
                20063,
                20116
            ],
            [
                20116,
                20160
            ],
            [
                20160,
                20160
            ],
            [
                20160,
                20160
            ],
            [
                20160,
                20160
            ],
            [
                20160,
                20210
            ],
            [
                20210,
                20268
            ],
            [
                20268,
                20432
            ],
            [
                20432,
                20595
            ],
            [
                20595,
                20656
            ],
            [
                20656,
                20714
            ],
            [
                20714,
                20828
            ],
            [
                20828,
                20828
            ],
            [
                20828,
                20881
            ],
            [
                20881,
                20974
            ],
            [
                20974,
                21032
            ],
            [
                21032,
                21072
            ],
            [
                21072,
                21078
            ],
            [
                21078,
                21088
            ],
            [
                21088,
                21115
            ],
            [
                21115,
                21141
            ],
            [
                21141,
                21169
            ],
            [
                21169,
                21174
            ],
            [
                21174,
                21198
            ],
            [
                21198,
                21237
            ],
            [
                21237,
                21304
            ],
            [
                21304,
                21332
            ],
            [
                21332,
                21438
            ],
            [
                21438,
                21501
            ],
            [
                21501,
                21587
            ],
            [
                21587,
                21832
            ],
            [
                21832,
                21832
            ],
            [
                21832,
                21832
            ],
            [
                21832,
                21856
            ],
            [
                21856,
                21920
            ],
            [
                21920,
                21982
            ],
            [
                21982,
                21982
            ],
            [
                21982,
                21982
            ],
            [
                21982,
                21982
            ],
            [
                21982,
                22095
            ],
            [
                22095,
                22287
            ],
            [
                22287,
                22447
            ],
            [
                22447,
                22696
            ]
        ]
    }
}