{
    "original": {
        "text": "My Lady Dedlock is restless, very restless. The astonished fashionable intelligence hardly knows where to have her. To-day she is at Chesney Wold; yesterday she was at her house in town; to-morrow she may be abroad, for anything the fashionable intelligence can with confidence predict. Even Sir Leicester's gallantry has some trouble to keep pace with her. It would have more but that his other faithful ally, for better and for worse--the gout--darts into the old oak bed-chamber at Chesney Wold and grips him by both legs.\nSir Leicester receives the gout as a troublesome demon, but still a demon of the patrician order. All the Dedlocks, in the direct male line, through a course of time during and beyond which the memory of man goeth not to the contrary, have had the gout. It can be proved, sir. Other men's fathers may have died of the rheumatism or may have taken base contagion from the tainted blood of the sick vulgar, but the Dedlock family have communicated something exclusive even to the levelling process of dying by dying of their own family gout. It has come down through the illustrious line like the plate, or the pictures, or the place in Lincolnshire. It is among their dignities. Sir Leicester is perhaps not wholly without an impression, though he has never resolved it into words, that the angel of death in the discharge of his necessary duties may observe to the shades of the aristocracy, \"My lords and gentlemen, I have the honour to present to you another Dedlock certified to have arrived per the family gout.\"\nHence Sir Leicester yields up his family legs to the family disorder as if he held his name and fortune on that feudal tenure. He feels that for a Dedlock to be laid upon his back and spasmodically twitched and stabbed in his extremities is a liberty taken somewhere, but he thinks, \"We have all yielded to this; it belongs to us; it has for some hundreds of years been understood that we are not to make the vaults in the park interesting on more ignoble terms; and I submit myself to the compromise.\"\nAnd a goodly show he makes, lying in a flush of crimson and gold in the midst of the great drawing-room before his favourite picture of my Lady, with broad strips of sunlight shining in, down the long perspective, through the long line of windows, and alternating with soft reliefs of shadow. Outside, the stately oaks, rooted for ages in the green ground which has never known ploughshare, but was still a chase when kings rode to battle with sword and shield and rode a-hunting with bow and arrow, bear witness to his greatness. Inside, his forefathers, looking on him from the walls, say, \"Each of us was a passing reality here and left this coloured shadow of himself and melted into remembrance as dreamy as the distant voices of the rooks now lulling you to rest,\" and hear their testimony to his greatness too. And he is very great this day. And woe to Boythorn or other daring wight who shall presumptuously contest an inch with him!\nMy Lady is at present represented, near Sir Leicester, by her portrait. She has flitted away to town, with no intention of remaining there, and will soon flit hither again, to the confusion of the fashionable intelligence. The house in town is not prepared for her reception. It is muffled and dreary. Only one Mercury in powder gapes disconsolate at the hall-window; and he mentioned last night to another Mercury of his acquaintance, also accustomed to good society, that if that sort of thing was to last--which it couldn't, for a man of his spirits couldn't bear it, and a man of his figure couldn't be expected to bear it--there would be no resource for him, upon his honour, but to cut his throat!\nWhat connexion can there be between the place in Lincolnshire, the house in town, the Mercury in powder, and the whereabout of Jo the outlaw with the broom, who had that distant ray of light upon him when he swept the churchyard-step? What connexion can there have been between many people in the innumerable histories of this world who from opposite sides of great gulfs have, nevertheless, been very curiously brought together!\nJo sweeps his crossing all day long, unconscious of the link, if any link there be. He sums up his mental condition when asked a question by replying that he \"don't know nothink.\" He knows that it's hard to keep the mud off the crossing in dirty weather, and harder still to live by doing it. Nobody taught him even that much; he found it out.\nJo lives--that is to say, Jo has not yet died--in a ruinous place known to the like of him by the name of Tom-all-Alone's. It is a black, dilapidated street, avoided by all decent people, where the crazy houses were seized upon, when their decay was far advanced, by some bold vagrants who after establishing their own possession took to letting them out in lodgings. Now, these tumbling tenements contain, by night, a swarm of misery. As on the ruined human wretch vermin parasites appear, so these ruined shelters have bred a crowd of foul existence that crawls in and out of gaps in walls and boards; and coils itself to sleep, in maggot numbers, where the rain drips in; and comes and goes, fetching and carrying fever and sowing more evil in its every footprint than Lord Coodle, and Sir Thomas Doodle, and the Duke of Foodle, and all the fine gentlemen in office, down to Zoodle, shall set right in five hundred years--though born expressly to do it.\nTwice lately there has been a crash and a cloud of dust, like the springing of a mine, in Tom-all-Alone's; and each time a house has fallen. These accidents have made a paragraph in the newspapers and have filled a bed or two in the nearest hospital. The gaps remain, and there are not unpopular lodgings among the rubbish. As several more houses are nearly ready to go, the next crash in Tom-all-Alone's may be expected to be a good one.\nThis desirable property is in Chancery, of course. It would be an insult to the discernment of any man with half an eye to tell him so. Whether \"Tom\" is the popular representative of the original plaintiff or defendant in Jarndyce and Jarndyce, or whether Tom lived here when the suit had laid the street waste, all alone, until other settlers came to join him, or whether the traditional title is a comprehensive name for a retreat cut off from honest company and put out of the pale of hope, perhaps nobody knows. Certainly Jo don't know.\n\"For I don't,\" says Jo, \"I don't know nothink.\"\nIt must be a strange state to be like Jo! To shuffle through the streets, unfamiliar with the shapes, and in utter darkness as to the meaning, of those mysterious symbols, so abundant over the shops, and at the corners of streets, and on the doors, and in the windows! To see people read, and to see people write, and to see the postmen deliver letters, and not to have the least idea of all that language--to be, to every scrap of it, stone blind and dumb! It must be very puzzling to see the good company going to the churches on Sundays, with their books in their hands, and to think (for perhaps Jo DOES think at odd times) what does it all mean, and if it means anything to anybody, how comes it that it means nothing to me? To be hustled, and jostled, and moved on; and really to feel that it would appear to be perfectly true that I have no business here, or there, or anywhere; and yet to be perplexed by the consideration that I AM here somehow, too, and everybody overlooked me until I became the creature that I am! It must be a strange state, not merely to be told that I am scarcely human (as in the case of my offering myself for a witness), but to feel it of my own knowledge all my life! To see the horses, dogs, and cattle go by me and to know that in ignorance I belong to them and not to the superior beings in my shape, whose delicacy I offend! Jo's ideas of a criminal trial, or a judge, or a bishop, or a government, or that inestimable jewel to him (if he only knew it) the Constitution, should be strange! His whole material and immaterial life is wonderfully strange; his death, the strangest thing of all.\nJo comes out of Tom-all-Alone's, meeting the tardy morning which is always late in getting down there, and munches his dirty bit of bread as he comes along. His way lying through many streets, and the houses not yet being open, he sits down to breakfast on the door-step of the Society for the Propagation of the Gospel in Foreign Parts and gives it a brush when he has finished as an acknowledgment of the accommodation. He admires the size of the edifice and wonders what it's all about. He has no idea, poor wretch, of the spiritual destitution of a coral reef in the Pacific or what it costs to look up the precious souls among the coco-nuts and bread-fruit.\nHe goes to his crossing and begins to lay it out for the day. The town awakes; the great tee-totum is set up for its daily spin and whirl; all that unaccountable reading and writing, which has been suspended for a few hours, recommences. Jo and the other lower animals get on in the unintelligible mess as they can. It is market-day. The blinded oxen, over-goaded, over-driven, never guided, run into wrong places and are beaten out, and plunge red-eyed and foaming at stone walls, and often sorely hurt the innocent, and often sorely hurt themselves. Very like Jo and his order; very, very like!\nA band of music comes and plays. Jo listens to it. So does a dog--a drover's dog, waiting for his master outside a butcher's shop, and evidently thinking about those sheep he has had upon his mind for some hours and is happily rid of. He seems perplexed respecting three or four, can't remember where he left them, looks up and down the street as half expecting to see them astray, suddenly pricks up his ears and remembers all about it. A thoroughly vagabond dog, accustomed to low company and public-houses; a terrific dog to sheep, ready at a whistle to scamper over their backs and tear out mouthfuls of their wool; but an educated, improved, developed dog who has been taught his duties and knows how to discharge them. He and Jo listen to the music, probably with much the same amount of animal satisfaction; likewise as to awakened association, aspiration, or regret, melancholy or joyful reference to things beyond the senses, they are probably upon a par. But, otherwise, how far above the human listener is the brute!\nTurn that dog's descendants wild, like Jo, and in a very few years they will so degenerate that they will lose even their bark--but not their bite.\nThe day changes as it wears itself away and becomes dark and drizzly. Jo fights it out at his crossing among the mud and wheels, the horses, whips, and umbrellas, and gets but a scanty sum to pay for the unsavoury shelter of Tom-all-Alone's. Twilight comes on; gas begins to start up in the shops; the lamplighter, with his ladder, runs along the margin of the pavement. A wretched evening is beginning to close in.\nIn his chambers Mr. Tulkinghorn sits meditating an application to the nearest magistrate to-morrow morning for a warrant. Gridley, a disappointed suitor, has been here to-day and has been alarming. We are not to be put in bodily fear, and that ill-conditioned fellow shall be held to bail again. From the ceiling, foreshortened Allegory, in the person of one impossible Roman upside down, points with the arm of Samson (out of joint, and an odd one) obtrusively toward the window. Why should Mr. Tulkinghorn, for such no reason, look out of window? Is the hand not always pointing there? So he does not look out of window.\nAnd if he did, what would it be to see a woman going by? There are women enough in the world, Mr. Tulkinghorn thinks--too many; they are at the bottom of all that goes wrong in it, though, for the matter of that, they create business for lawyers. What would it be to see a woman going by, even though she were going secretly? They are all secret. Mr. Tulkinghorn knows that very well.\nBut they are not all like the woman who now leaves him and his house behind, between whose plain dress and her refined manner there is something exceedingly inconsistent. She should be an upper servant by her attire, yet in her air and step, though both are hurried and assumed--as far as she can assume in the muddy streets, which she treads with an unaccustomed foot--she is a lady. Her face is veiled, and still she sufficiently betrays herself to make more than one of those who pass her look round sharply.\nShe never turns her head. Lady or servant, she has a purpose in her and can follow it. She never turns her head until she comes to the crossing where Jo plies with his broom. He crosses with her and begs. Still, she does not turn her head until she has landed on the other side. Then she slightly beckons to him and says, \"Come here!\"\nJo follows her a pace or two into a quiet court.\n\"Are you the boy I've read of in the papers?\" she asked behind her veil.\n\"I don't know,\" says Jo, staring moodily at the veil, \"nothink about no papers. I don't know nothink about nothink at all.\"\n\"Were you examined at an inquest?\"\n\"I don't know nothink about no--where I was took by the beadle, do you mean?\" says Jo. \"Was the boy's name at the inkwhich Jo?\"\n\"Yes.\"\n\"That's me!\" says Jo.\n\"Come farther up.\"\n\"You mean about the man?\" says Jo, following. \"Him as wos dead?\"\n\"Hush! Speak in a whisper! Yes. Did he look, when he was living, so very ill and poor?\"\n\"Oh, jist!\" says Jo.\n\"Did he look like--not like YOU?\" says the woman with abhorrence.\n\"Oh, not so bad as me,\" says Jo. \"I'm a reg'lar one I am! You didn't know him, did you?\"\n\"How dare you ask me if I knew him?\"\n\"No offence, my lady,\" says Jo with much humility, for even he has got at the suspicion of her being a lady.\n\"I am not a lady. I am a servant.\"\n\"You are a jolly servant!\" says Jo without the least idea of saying anything offensive, merely as a tribute of admiration.\n\"Listen and be silent. Don't talk to me, and stand farther from me! Can you show me all those places that were spoken of in the account I read? The place he wrote for, the place he died at, the place where you were taken to, and the place where he was buried? Do you know the place where he was buried?\"\nJo answers with a nod, having also nodded as each other place was mentioned.\n\"Go before me and show me all those dreadful places. Stop opposite to each, and don't speak to me unless I speak to you. Don't look back. Do what I want, and I will pay you well.\"\nJo attends closely while the words are being spoken; tells them off on his broom-handle, finding them rather hard; pauses to consider their meaning; considers it satisfactory; and nods his ragged head.\n\"I'm fly,\" says Jo. \"But fen larks, you know. Stow hooking it!\"\n\"What does the horrible creature mean?\" exclaims the servant, recoiling from him.\n\"Stow cutting away, you know!\" says Jo.\n\"I don't understand you. Go on before! I will give you more money than you ever had in your life.\"\nJo screws up his mouth into a whistle, gives his ragged head a rub, takes his broom under his arm, and leads the way, passing deftly with his bare feet over the hard stones and through the mud and mire.\nCook's Court. Jo stops. A pause.\n\"Who lives here?\"\n\"Him wot give him his writing and give me half a bull,\" says Jo in a whisper without looking over his shoulder.\n\"Go on to the next.\"\nKrook's house. Jo stops again. A longer pause.\n\"Who lives here?\"\n\"HE lived here,\" Jo answers as before.\nAfter a silence he is asked, \"In which room?\"\n\"In the back room up there. You can see the winder from this corner. Up there! That's where I see him stritched out. This is the public-ouse where I was took to.\"\n\"Go on to the next!\"\nIt is a longer walk to the next, but Jo, relieved of his first suspicions, sticks to the forms imposed upon him and does not look round. By many devious ways, reeking with offence of many kinds, they come to the little tunnel of a court, and to the gas-lamp (lighted now), and to the iron gate.\n\"He was put there,\" says Jo, holding to the bars and looking in.\n\"Where? Oh, what a scene of horror!\"\n\"There!\" says Jo, pointing. \"Over yinder. Among them piles of bones, and close to that there kitchin winder! They put him wery nigh the top. They was obliged to stamp upon it to git it in. I could unkiver it for you with my broom if the gate was open. That's why they locks it, I s'pose,\" giving it a shake. \"It's always locked. Look at the rat!\" cries Jo, excited. \"Hi! Look! There he goes! Ho! Into the ground!\"\nThe servant shrinks into a corner, into a corner of that hideous archway, with its deadly stains contaminating her dress; and putting out her two hands and passionately telling him to keep away from her, for he is loathsome to her, so remains for some moments. Jo stands staring and is still staring when she recovers herself.\n\"Is this place of abomination consecrated ground?\"\n\"I don't know nothink of consequential ground,\" says Jo, still staring.\n\"Is it blessed?\"\n\"Which?\" says Jo, in the last degree amazed.\n\"Is it blessed?\"\n\"I'm blest if I know,\" says Jo, staring more than ever; \"but I shouldn't think it warn't. Blest?\" repeats Jo, something troubled in his mind. \"It an't done it much good if it is. Blest? I should think it was t'othered myself. But I don't know nothink!\"\nThe servant takes as little heed of what he says as she seems to take of what she has said herself. She draws off her glove to get some money from her purse. Jo silently notices how white and small her hand is and what a jolly servant she must be to wear such sparkling rings.\nShe drops a piece of money in his hand without touching it, and shuddering as their hands approach. \"Now,\" she adds, \"show me the spot again!\"\nJo thrusts the handle of his broom between the bars of the gate, and with his utmost power of elaboration, points it out. At length, looking aside to see if he has made himself intelligible, he finds that he is alone.\nHis first proceeding is to hold the piece of money to the gas-light and to be overpowered at finding that it is yellow--gold. His next is to give it a one-sided bite at the edge as a test of its quality. His next, to put it in his mouth for safety and to sweep the step and passage with great care. His job done, he sets off for Tom-all-Alone's, stopping in the light of innumerable gas-lamps to produce the piece of gold and give it another one-sided bite as a reassurance of its being genuine.\nThe Mercury in powder is in no want of society to-night, for my Lady goes to a grand dinner and three or four balls. Sir Leicester is fidgety down at Chesney Wold, with no better company than the gout; he complains to Mrs. Rouncewell that the rain makes such a monotonous pattering on the terrace that he can't read the paper even by the fireside in his own snug dressing-room.\n\"Sir Leicester would have done better to try the other side of the house, my dear,\" says Mrs. Rouncewell to Rosa. \"His dressing-room is on my Lady's side. And in all these years I never heard the step upon the Ghost's Walk more distinct than it is to-night!\"",
        "paragraph_chars": [
            [
                0,
                526
            ],
            [
                526,
                1543
            ],
            [
                1543,
                2046
            ],
            [
                2046,
                2988
            ],
            [
                2988,
                3692
            ],
            [
                3692,
                4122
            ],
            [
                4122,
                4466
            ],
            [
                4466,
                5423
            ],
            [
                5423,
                5862
            ],
            [
                5862,
                6403
            ],
            [
                6403,
                6451
            ],
            [
                6451,
                8083
            ],
            [
                8083,
                8746
            ],
            [
                8746,
                9343
            ],
            [
                9343,
                10371
            ],
            [
                10371,
                10519
            ],
            [
                10519,
                10935
            ],
            [
                10935,
                11558
            ],
            [
                11558,
                11943
            ],
            [
                11943,
                12455
            ],
            [
                12455,
                12790
            ],
            [
                12790,
                12839
            ],
            [
                12839,
                12912
            ],
            [
                12912,
                13036
            ],
            [
                13036,
                13071
            ],
            [
                13071,
                13199
            ],
            [
                13199,
                13206
            ],
            [
                13206,
                13228
            ],
            [
                13228,
                13247
            ],
            [
                13247,
                13312
            ],
            [
                13312,
                13400
            ],
            [
                13400,
                13421
            ],
            [
                13421,
                13487
            ],
            [
                13487,
                13576
            ],
            [
                13576,
                13613
            ],
            [
                13613,
                13722
            ],
            [
                13722,
                13757
            ],
            [
                13757,
                13880
            ],
            [
                13880,
                14184
            ],
            [
                14184,
                14261
            ],
            [
                14261,
                14441
            ],
            [
                14441,
                14643
            ],
            [
                14643,
                14707
            ],
            [
                14707,
                14789
            ],
            [
                14789,
                14829
            ],
            [
                14829,
                14928
            ],
            [
                14928,
                15131
            ],
            [
                15131,
                15164
            ],
            [
                15164,
                15182
            ],
            [
                15182,
                15294
            ],
            [
                15294,
                15315
            ],
            [
                15315,
                15362
            ],
            [
                15362,
                15380
            ],
            [
                15380,
                15419
            ],
            [
                15419,
                15465
            ],
            [
                15465,
                15628
            ],
            [
                15628,
                15649
            ],
            [
                15649,
                15944
            ],
            [
                15944,
                16009
            ],
            [
                16009,
                16046
            ],
            [
                16046,
                16460
            ],
            [
                16460,
                16787
            ],
            [
                16787,
                16838
            ],
            [
                16838,
                16910
            ],
            [
                16910,
                16927
            ],
            [
                16927,
                16972
            ],
            [
                16972,
                16989
            ],
            [
                16989,
                17242
            ],
            [
                17242,
                17519
            ],
            [
                17519,
                17662
            ],
            [
                17662,
                17880
            ],
            [
                17880,
                18376
            ],
            [
                18376,
                18754
            ],
            [
                18754,
                19012
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                116
            ],
            [
                116,
                287
            ],
            [
                287,
                358
            ],
            [
                358,
                526
            ],
            [
                526,
                624
            ],
            [
                624,
                780
            ],
            [
                780,
                803
            ],
            [
                803,
                1066
            ],
            [
                1066,
                1175
            ],
            [
                1175,
                1204
            ],
            [
                1204,
                1543
            ],
            [
                1543,
                1670
            ],
            [
                1670,
                2046
            ],
            [
                2046,
                2339
            ],
            [
                2339,
                2577
            ],
            [
                2577,
                2864
            ],
            [
                2864,
                2895
            ],
            [
                2895,
                2988
            ],
            [
                2988,
                3060
            ],
            [
                3060,
                3211
            ],
            [
                3211,
                3264
            ],
            [
                3264,
                3290
            ],
            [
                3290,
                3692
            ],
            [
                3692,
                3927
            ],
            [
                3927,
                4122
            ],
            [
                4122,
                4206
            ],
            [
                4206,
                4302
            ],
            [
                4302,
                4415
            ],
            [
                4415,
                4466
            ],
            [
                4466,
                4589
            ],
            [
                4589,
                4834
            ],
            [
                4834,
                4902
            ],
            [
                4902,
                5423
            ],
            [
                5423,
                5564
            ],
            [
                5564,
                5674
            ],
            [
                5674,
                5747
            ],
            [
                5747,
                5862
            ],
            [
                5862,
                5913
            ],
            [
                5913,
                5998
            ],
            [
                5998,
                6378
            ],
            [
                6378,
                6403
            ],
            [
                6403,
                6451
            ],
            [
                6451,
                6493
            ],
            [
                6493,
                6720
            ],
            [
                6720,
                6909
            ],
            [
                6909,
                7181
            ],
            [
                7181,
                7478
            ],
            [
                7478,
                7655
            ],
            [
                7655,
                7816
            ],
            [
                7816,
                7981
            ],
            [
                7981,
                8083
            ],
            [
                8083,
                8240
            ],
            [
                8240,
                8505
            ],
            [
                8505,
                8573
            ],
            [
                8573,
                8746
            ],
            [
                8746,
                8808
            ],
            [
                8808,
                8984
            ],
            [
                8984,
                9062
            ],
            [
                9062,
                9080
            ],
            [
                9080,
                9298
            ],
            [
                9298,
                9343
            ],
            [
                9343,
                9376
            ],
            [
                9376,
                9394
            ],
            [
                9394,
                9578
            ],
            [
                9578,
                9781
            ],
            [
                9781,
                10068
            ],
            [
                10068,
                10308
            ],
            [
                10308,
                10371
            ],
            [
                10371,
                10519
            ],
            [
                10519,
                10589
            ],
            [
                10589,
                10761
            ],
            [
                10761,
                10890
            ],
            [
                10890,
                10935
            ],
            [
                10935,
                11057
            ],
            [
                11057,
                11133
            ],
            [
                11133,
                11231
            ],
            [
                11231,
                11416
            ],
            [
                11416,
                11484
            ],
            [
                11484,
                11523
            ],
            [
                11523,
                11558
            ],
            [
                11558,
                11615
            ],
            [
                11615,
                11805
            ],
            [
                11805,
                11884
            ],
            [
                11884,
                11905
            ],
            [
                11905,
                11943
            ],
            [
                11943,
                12114
            ],
            [
                12114,
                12328
            ],
            [
                12328,
                12455
            ],
            [
                12455,
                12481
            ],
            [
                12481,
                12542
            ],
            [
                12542,
                12630
            ],
            [
                12630,
                12660
            ],
            [
                12660,
                12734
            ],
            [
                12734,
                12790
            ],
            [
                12790,
                12839
            ],
            [
                12839,
                12885
            ],
            [
                12885,
                12912
            ],
            [
                12912,
                12992
            ],
            [
                12992,
                13036
            ],
            [
                13036,
                13071
            ],
            [
                13071,
                13149
            ],
            [
                13149,
                13158
            ],
            [
                13158,
                13199
            ],
            [
                13199,
                13206
            ],
            [
                13206,
                13219
            ],
            [
                13219,
                13228
            ],
            [
                13228,
                13247
            ],
            [
                13247,
                13273
            ],
            [
                13273,
                13293
            ],
            [
                13293,
                13312
            ],
            [
                13312,
                13319
            ],
            [
                13319,
                13339
            ],
            [
                13339,
                13344
            ],
            [
                13344,
                13400
            ],
            [
                13400,
                13412
            ],
            [
                13412,
                13421
            ],
            [
                13421,
                13455
            ],
            [
                13455,
                13487
            ],
            [
                13487,
                13520
            ],
            [
                13520,
                13545
            ],
            [
                13545,
                13576
            ],
            [
                13576,
                13613
            ],
            [
                13613,
                13722
            ],
            [
                13722,
                13740
            ],
            [
                13740,
                13757
            ],
            [
                13757,
                13784
            ],
            [
                13784,
                13880
            ],
            [
                13880,
                13903
            ],
            [
                13903,
                13948
            ],
            [
                13948,
                14024
            ],
            [
                14024,
                14140
            ],
            [
                14140,
                14184
            ],
            [
                14184,
                14261
            ],
            [
                14261,
                14314
            ],
            [
                14314,
                14382
            ],
            [
                14382,
                14399
            ],
            [
                14399,
                14441
            ],
            [
                14441,
                14643
            ],
            [
                14643,
                14663
            ],
            [
                14663,
                14689
            ],
            [
                14689,
                14707
            ],
            [
                14707,
                14747
            ],
            [
                14747,
                14789
            ],
            [
                14789,
                14820
            ],
            [
                14820,
                14829
            ],
            [
                14829,
                14854
            ],
            [
                14854,
                14868
            ],
            [
                14868,
                14928
            ],
            [
                14928,
                15131
            ],
            [
                15131,
                15145
            ],
            [
                15145,
                15155
            ],
            [
                15155,
                15164
            ],
            [
                15164,
                15182
            ],
            [
                15182,
                15294
            ],
            [
                15294,
                15315
            ],
            [
                15315,
                15330
            ],
            [
                15330,
                15346
            ],
            [
                15346,
                15362
            ],
            [
                15362,
                15380
            ],
            [
                15380,
                15419
            ],
            [
                15419,
                15465
            ],
            [
                15465,
                15493
            ],
            [
                15493,
                15534
            ],
            [
                15534,
                15544
            ],
            [
                15544,
                15582
            ],
            [
                15582,
                15628
            ],
            [
                15628,
                15649
            ],
            [
                15649,
                15786
            ],
            [
                15786,
                15944
            ],
            [
                15944,
                16009
            ],
            [
                16009,
                16017
            ],
            [
                16017,
                16046
            ],
            [
                16046,
                16055
            ],
            [
                16055,
                16074
            ],
            [
                16074,
                16088
            ],
            [
                16088,
                16155
            ],
            [
                16155,
                16187
            ],
            [
                16187,
                16235
            ],
            [
                16235,
                16298
            ],
            [
                16298,
                16354
            ],
            [
                16354,
                16375
            ],
            [
                16375,
                16393
            ],
            [
                16393,
                16412
            ],
            [
                16412,
                16417
            ],
            [
                16417,
                16423
            ],
            [
                16423,
                16438
            ],
            [
                16438,
                16442
            ],
            [
                16442,
                16460
            ],
            [
                16460,
                16721
            ],
            [
                16721,
                16787
            ],
            [
                16787,
                16838
            ],
            [
                16838,
                16910
            ],
            [
                16910,
                16927
            ],
            [
                16927,
                16936
            ],
            [
                16936,
                16972
            ],
            [
                16972,
                16989
            ],
            [
                16989,
                17079
            ],
            [
                17079,
                17087
            ],
            [
                17087,
                17131
            ],
            [
                17131,
                17168
            ],
            [
                17168,
                17175
            ],
            [
                17175,
                17215
            ],
            [
                17215,
                17242
            ],
            [
                17242,
                17342
            ],
            [
                17342,
                17400
            ],
            [
                17400,
                17519
            ],
            [
                17519,
                17619
            ],
            [
                17619,
                17662
            ],
            [
                17662,
                17784
            ],
            [
                17784,
                17880
            ],
            [
                17880,
                18006
            ],
            [
                18006,
                18084
            ],
            [
                18084,
                18179
            ],
            [
                18179,
                18376
            ],
            [
                18376,
                18493
            ],
            [
                18493,
                18754
            ],
            [
                18754,
                18868
            ],
            [
                18868,
                18909
            ],
            [
                18909,
                19012
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                29,
                44
            ],
            [
                123,
                186
            ],
            [
                197,
                228
            ],
            [
                258,
                261
            ],
            [
                278,
                287
            ],
            [
                287,
                317
            ],
            [
                338,
                356
            ],
            [
                409,
                414
            ],
            [
                437,
                445
            ],
            [
                318,
                321
            ],
            [
                508,
                526
            ],
            [
                526,
                539
            ],
            [
                549,
                574
            ],
            [
                582,
                585
            ],
            [
                575,
                580
            ],
            [
                622,
                624
            ],
            [
                624,
                648
            ],
            [
                656,
                665
            ],
            [
                759,
                780
            ],
            [
                803,
                839
            ],
            [
                923,
                929
            ],
            [
                929,
                958
            ],
            [
                911,
                913
            ],
            [
                1064,
                1066
            ],
            [
                1066,
                1120
            ],
            [
                1121,
                1126
            ],
            [
                1143,
                1174
            ],
            [
                1549,
                1614
            ],
            [
                1626,
                1629
            ],
            [
                1668,
                1670
            ],
            [
                1670,
                1740
            ],
            [
                1754,
                1873
            ],
            [
                2006,
                2028
            ],
            [
                1874,
                1876
            ],
            [
                2043,
                2046
            ],
            [
                2046,
                2056
            ],
            [
                2064,
                2113
            ],
            [
                2127,
                2231
            ],
            [
                2260,
                2292
            ],
            [
                2337,
                2339
            ],
            [
                2339,
                2372
            ],
            [
                2382,
                2423
            ],
            [
                2424,
                2430
            ],
            [
                2435,
                2440
            ],
            [
                2451,
                2452
            ],
            [
                2517,
                2518
            ],
            [
                2373,
                2376
            ],
            [
                2544,
                2577
            ],
            [
                2577,
                2717
            ],
            [
                2988,
                3021
            ],
            [
                3043,
                3060
            ],
            [
                3060,
                3089
            ],
            [
                3128,
                3146
            ],
            [
                3154,
                3196
            ],
            [
                3209,
                3210
            ],
            [
                3211,
                3264
            ],
            [
                3264,
                3290
            ],
            [
                3290,
                3298
            ],
            [
                3522,
                3525
            ],
            [
                3317,
                3354
            ],
            [
                3692,
                3777
            ],
            [
                3795,
                3804
            ],
            [
                3816,
                3852
            ],
            [
                3900,
                3926
            ],
            [
                4122,
                4206
            ],
            [
                4206,
                4302
            ],
            [
                4302,
                4415
            ],
            [
                4415,
                4466
            ],
            [
                4466,
                4474
            ],
            [
                4476,
                4511
            ],
            [
                4513,
                4537
            ],
            [
                4572,
                4589
            ],
            [
                4589,
                4634
            ],
            [
                4639,
                4669
            ],
            [
                4693,
                4694
            ],
            [
                4670,
                4693
            ],
            [
                4730,
                4755
            ],
            [
                4812,
                4820
            ],
            [
                4824,
                4834
            ],
            [
                4834,
                4902
            ],
            [
                4939,
                4948
            ],
            [
                4905,
                4907
            ],
            [
                4912,
                4924
            ],
            [
                4955,
                4956
            ],
            [
                4992,
                5017
            ],
            [
                5023,
                5057
            ],
            [
                5068,
                5192
            ],
            [
                5205,
                5212
            ],
            [
                5217,
                5232
            ],
            [
                5421,
                5423
            ],
            [
                5423,
                5478
            ],
            [
                5510,
                5529
            ],
            [
                5534,
                5564
            ],
            [
                5564,
                5674
            ],
            [
                5674,
                5747
            ],
            [
                5747,
                5827
            ],
            [
                5835,
                5862
            ],
            [
                5862,
                5913
            ],
            [
                5998,
                6011
            ],
            [
                6045,
                6067
            ],
            [
                6081,
                6173
            ],
            [
                6224,
                6238
            ],
            [
                6251,
                6261
            ],
            [
                6239,
                6250
            ],
            [
                6276,
                6280
            ],
            [
                6354,
                6378
            ],
            [
                6378,
                6390
            ],
            [
                6394,
                6403
            ],
            [
                6403,
                6407
            ],
            [
                6428,
                6448
            ],
            [
                6415,
                6425
            ],
            [
                6451,
                6493
            ],
            [
                6493,
                6524
            ],
            [
                6557,
                6592
            ],
            [
                6594,
                6621
            ],
            [
                6635,
                6649
            ],
            [
                6698,
                6720
            ],
            [
                6720,
                6738
            ],
            [
                6740,
                6743
            ],
            [
                6758,
                6763
            ],
            [
                6803,
                6856
            ],
            [
                6907,
                6909
            ],
            [
                6909,
                7105
            ],
            [
                7139,
                7181
            ],
            [
                7181,
                7226
            ],
            [
                7341,
                7367
            ],
            [
                7382,
                7404
            ],
            [
                7409,
                7478
            ],
            [
                7478,
                7552
            ],
            [
                7607,
                7621
            ],
            [
                7653,
                7655
            ],
            [
                7655,
                7738
            ],
            [
                7742,
                7777
            ],
            [
                7791,
                7815
            ],
            [
                8083,
                8115
            ],
            [
                8198,
                8220
            ],
            [
                8238,
                8240
            ],
            [
                8311,
                8461
            ],
            [
                8274,
                8275
            ],
            [
                8280,
                8283
            ],
            [
                8503,
                8505
            ],
            [
                8505,
                8531
            ],
            [
                8540,
                8572
            ],
            [
                8746,
                8808
            ],
            [
                8808,
                8823
            ],
            [
                8859,
                8927
            ],
            [
                8971,
                8984
            ],
            [
                8984,
                9062
            ],
            [
                9062,
                9080
            ],
            [
                9080,
                9199
            ],
            [
                9212,
                9267
            ],
            [
                9286,
                9298
            ],
            [
                9298,
                9330
            ],
            [
                9337,
                9343
            ],
            [
                9343,
                9376
            ],
            [
                9376,
                9394
            ],
            [
                9394,
                9401
            ],
            [
                9409,
                9472
            ],
            [
                9576,
                9578
            ],
            [
                9781,
                9782
            ],
            [
                9794,
                9854
            ],
            [
                9864,
                9899
            ],
            [
                9929,
                9988
            ],
            [
                10000,
                10051
            ],
            [
                10062,
                10068
            ],
            [
                10068,
                10157
            ],
            [
                10167,
                10181
            ],
            [
                10276,
                10308
            ],
            [
                10308,
                10371
            ],
            [
                10519,
                10558
            ],
            [
                10559,
                10589
            ],
            [
                10589,
                10690
            ],
            [
                10695,
                10761
            ],
            [
                10761,
                10783
            ],
            [
                10815,
                10865
            ],
            [
                10880,
                10890
            ],
            [
                10890,
                10935
            ],
            [
                10935,
                11000
            ],
            [
                11013,
                11023
            ],
            [
                11034,
                11057
            ],
            [
                11057,
                11064
            ],
            [
                11089,
                11102
            ],
            [
                11110,
                11133
            ],
            [
                11144,
                11146
            ],
            [
                11208,
                11231
            ],
            [
                11429,
                11442
            ],
            [
                11529,
                11549
            ],
            [
                11487,
                11490
            ],
            [
                11550,
                11558
            ],
            [
                11558,
                11615
            ],
            [
                11615,
                11624
            ],
            [
                11676,
                11684
            ],
            [
                11625,
                11630
            ],
            [
                11638,
                11674
            ],
            [
                11684,
                11738
            ],
            [
                11771,
                11805
            ],
            [
                11805,
                11884
            ],
            [
                11884,
                11905
            ],
            [
                11905,
                11943
            ],
            [
                11943,
                12019
            ],
            [
                12028,
                12045
            ],
            [
                12050,
                12068
            ],
            [
                12112,
                12114
            ],
            [
                12114,
                12151
            ],
            [
                12158,
                12183
            ],
            [
                12247,
                12267
            ],
            [
                12313,
                12328
            ],
            [
                12328,
                12361
            ],
            [
                12375,
                12390
            ],
            [
                12391,
                12398
            ],
            [
                12422,
                12455
            ],
            [
                12455,
                12481
            ],
            [
                12481,
                12515
            ],
            [
                12523,
                12526
            ],
            [
                12546,
                12630
            ],
            [
                12630,
                12660
            ],
            [
                12660,
                12703
            ],
            [
                12715,
                12734
            ],
            [
                12734,
                12790
            ],
            [
                12790,
                12839
            ],
            [
                12839,
                12885
            ],
            [
                12885,
                12888
            ],
            [
                12895,
                12912
            ],
            [
                12912,
                12935
            ],
            [
                12990,
                12992
            ],
            [
                12992,
                13018
            ],
            [
                13033,
                13036
            ],
            [
                13036,
                13071
            ],
            [
                13071,
                13101
            ],
            [
                13103,
                13149
            ],
            [
                13149,
                13158
            ],
            [
                13158,
                13199
            ],
            [
                13199,
                13206
            ],
            [
                13206,
                13219
            ],
            [
                13219,
                13227
            ],
            [
                13247,
                13270
            ],
            [
                13294,
                13312
            ],
            [
                13312,
                13319
            ],
            [
                13337,
                13339
            ],
            [
                13339,
                13344
            ],
            [
                13344,
                13400
            ],
            [
                13400,
                13412
            ],
            [
                13412,
                13421
            ],
            [
                13421,
                13438
            ],
            [
                13449,
                13455
            ],
            [
                13455,
                13487
            ],
            [
                13487,
                13520
            ],
            [
                13545,
                13576
            ],
            [
                13576,
                13596
            ],
            [
                13610,
                13613
            ],
            [
                13613,
                13643
            ],
            [
                13662,
                13675
            ],
            [
                13704,
                13707
            ],
            [
                13701,
                13703
            ],
            [
                13708,
                13722
            ],
            [
                13722,
                13740
            ],
            [
                13740,
                13757
            ],
            [
                13757,
                13761
            ],
            [
                13766,
                13784
            ],
            [
                13784,
                13791
            ],
            [
                13868,
                13880
            ],
            [
                13880,
                13903
            ],
            [
                13925,
                13938
            ],
            [
                13946,
                13948
            ],
            [
                13948,
                13963
            ],
            [
                13968,
                14024
            ],
            [
                14024,
                14138
            ],
            [
                14184,
                14205
            ],
            [
                14229,
                14233
            ],
            [
                14259,
                14261
            ],
            [
                14261,
                14264
            ],
            [
                14272,
                14314
            ],
            [
                14314,
                14327
            ],
            [
                14331,
                14382
            ],
            [
                14382,
                14399
            ],
            [
                14419,
                14441
            ],
            [
                14441,
                14459
            ],
            [
                14470,
                14475
            ],
            [
                14528,
                14589
            ],
            [
                14617,
                14643
            ],
            [
                14643,
                14663
            ],
            [
                14663,
                14689
            ],
            [
                14689,
                14707
            ],
            [
                14707,
                14747
            ],
            [
                14747,
                14788
            ],
            [
                14829,
                14854
            ],
            [
                14854,
                14859
            ],
            [
                14866,
                14868
            ],
            [
                14868,
                14928
            ],
            [
                14928,
                14965
            ],
            [
                14994,
                15044
            ],
            [
                15066,
                15131
            ],
            [
                15131,
                15145
            ],
            [
                15145,
                15155
            ],
            [
                15155,
                15164
            ],
            [
                15164,
                15182
            ],
            [
                15182,
                15211
            ],
            [
                15235,
                15294
            ],
            [
                15294,
                15315
            ],
            [
                15315,
                15330
            ],
            [
                15330,
                15346
            ],
            [
                15346,
                15362
            ],
            [
                15362,
                15380
            ],
            [
                15380,
                15419
            ],
            [
                15419,
                15465
            ],
            [
                15465,
                15493
            ],
            [
                15493,
                15534
            ],
            [
                15544,
                15582
            ],
            [
                15582,
                15628
            ],
            [
                15628,
                15649
            ],
            [
                15649,
                15688
            ],
            [
                15765,
                15786
            ],
            [
                15786,
                15801
            ],
            [
                15922,
                15925
            ],
            [
                15808,
                15815
            ],
            [
                15802,
                15806
            ],
            [
                15842,
                15897
            ],
            [
                15933,
                15944
            ],
            [
                15944,
                16009
            ],
            [
                16009,
                16017
            ],
            [
                16017,
                16046
            ],
            [
                16046,
                16055
            ],
            [
                16055,
                16074
            ],
            [
                16074,
                16088
            ],
            [
                16088,
                16114
            ],
            [
                16168,
                16187
            ],
            [
                16187,
                16235
            ],
            [
                16235,
                16296
            ],
            [
                16332,
                16352
            ],
            [
                16322,
                16323
            ],
            [
                16354,
                16355
            ],
            [
                16355,
                16375
            ],
            [
                16375,
                16393
            ],
            [
                16393,
                16412
            ],
            [
                16412,
                16417
            ],
            [
                16423,
                16436
            ],
            [
                16442,
                16460
            ],
            [
                16460,
                16463
            ],
            [
                16472,
                16479
            ],
            [
                16495,
                16601
            ],
            [
                16606,
                16663
            ],
            [
                16692,
                16721
            ],
            [
                16721,
                16738
            ],
            [
                16765,
                16787
            ],
            [
                16787,
                16838
            ],
            [
                16838,
                16893
            ],
            [
                16908,
                16910
            ],
            [
                16910,
                16927
            ],
            [
                16927,
                16936
            ],
            [
                16936,
                16944
            ],
            [
                16964,
                16972
            ],
            [
                16972,
                16989
            ],
            [
                16989,
                17067
            ],
            [
                17077,
                17079
            ],
            [
                17132,
                17168
            ],
            [
                17168,
                17175
            ],
            [
                17175,
                17215
            ],
            [
                17215,
                17242
            ],
            [
                17242,
                17259
            ],
            [
                17263,
                17290
            ],
            [
                17340,
                17342
            ],
            [
                17342,
                17400
            ],
            [
                17400,
                17519
            ],
            [
                17519,
                17578
            ],
            [
                17583,
                17619
            ],
            [
                17619,
                17662
            ],
            [
                17662,
                17730
            ],
            [
                17769,
                17784
            ],
            [
                17784,
                17802
            ],
            [
                17851,
                17880
            ],
            [
                17912,
                17951
            ],
            [
                17901,
                17903
            ],
            [
                17958,
                17998
            ],
            [
                18000,
                18006
            ],
            [
                18026,
                18028
            ],
            [
                18029,
                18030
            ],
            [
                18041,
                18045
            ],
            [
                18092,
                18093
            ],
            [
                18101,
                18127
            ],
            [
                18082,
                18083
            ],
            [
                18141,
                18179
            ],
            [
                18179,
                18250
            ],
            [
                18263,
                18321
            ],
            [
                18367,
                18376
            ],
            [
                18437,
                18444
            ],
            [
                18445,
                18493
            ],
            [
                18493,
                18538
            ],
            [
                18576,
                18701
            ],
            [
                18723,
                18729
            ],
            [
                18739,
                18754
            ],
            [
                18754,
                18868
            ],
            [
                18868,
                18909
            ],
            [
                18909,
                19001
            ],
            [
                19010,
                19012
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                116
            ],
            [
                116,
                287
            ],
            [
                287,
                526
            ],
            [
                526,
                624
            ],
            [
                624,
                780
            ],
            [
                780,
                803
            ],
            [
                803,
                1066
            ],
            [
                1066,
                1175
            ],
            [
                1175,
                1204
            ],
            [
                1204,
                1543
            ],
            [
                1543,
                1670
            ],
            [
                1670,
                2046
            ],
            [
                2046,
                2339
            ],
            [
                2339,
                2577
            ],
            [
                2577,
                2864
            ],
            [
                2864,
                2895
            ],
            [
                2895,
                2988
            ],
            [
                2988,
                3060
            ],
            [
                3060,
                3211
            ],
            [
                3211,
                3264
            ],
            [
                3264,
                3290
            ],
            [
                3290,
                3692
            ],
            [
                3692,
                3927
            ],
            [
                3927,
                4122
            ],
            [
                4122,
                4206
            ],
            [
                4206,
                4302
            ],
            [
                4302,
                4415
            ],
            [
                4415,
                4466
            ],
            [
                4466,
                4589
            ],
            [
                4589,
                4834
            ],
            [
                4834,
                4902
            ],
            [
                4902,
                5423
            ],
            [
                5423,
                5564
            ],
            [
                5564,
                5674
            ],
            [
                5674,
                5747
            ],
            [
                5747,
                5862
            ],
            [
                5862,
                5913
            ],
            [
                5913,
                5998
            ],
            [
                5998,
                6378
            ],
            [
                6378,
                6403
            ],
            [
                6403,
                6451
            ],
            [
                6451,
                6493
            ],
            [
                6493,
                6720
            ],
            [
                6720,
                6909
            ],
            [
                6909,
                7181
            ],
            [
                7181,
                7478
            ],
            [
                7478,
                7655
            ],
            [
                7655,
                7816
            ],
            [
                7816,
                7981
            ],
            [
                7981,
                8083
            ],
            [
                8083,
                8240
            ],
            [
                8240,
                8505
            ],
            [
                8505,
                8573
            ],
            [
                8573,
                8746
            ],
            [
                8746,
                8808
            ],
            [
                8808,
                8984
            ],
            [
                8984,
                9062
            ],
            [
                9062,
                9080
            ],
            [
                9080,
                9298
            ],
            [
                9298,
                9343
            ],
            [
                9343,
                9376
            ],
            [
                9376,
                9394
            ],
            [
                9394,
                9578
            ],
            [
                9578,
                9781
            ],
            [
                9781,
                10068
            ],
            [
                10068,
                10308
            ],
            [
                10308,
                10371
            ],
            [
                10371,
                10519
            ],
            [
                10519,
                10589
            ],
            [
                10589,
                10761
            ],
            [
                10761,
                10890
            ],
            [
                10890,
                10935
            ],
            [
                10935,
                11057
            ],
            [
                11057,
                11133
            ],
            [
                11133,
                11231
            ],
            [
                11231,
                11416
            ],
            [
                11416,
                11558
            ],
            [
                11558,
                11615
            ],
            [
                11615,
                11805
            ],
            [
                11805,
                11884
            ],
            [
                11884,
                11905
            ],
            [
                11905,
                11943
            ],
            [
                11943,
                12114
            ],
            [
                12114,
                12328
            ],
            [
                12328,
                12455
            ],
            [
                12455,
                12481
            ],
            [
                12481,
                12630
            ],
            [
                12630,
                12660
            ],
            [
                12660,
                12734
            ],
            [
                12734,
                12790
            ],
            [
                12790,
                12839
            ],
            [
                12839,
                12885
            ],
            [
                12885,
                12912
            ],
            [
                12912,
                12992
            ],
            [
                12992,
                13036
            ],
            [
                13036,
                13071
            ],
            [
                13071,
                13149
            ],
            [
                13149,
                13158
            ],
            [
                13158,
                13199
            ],
            [
                13199,
                13206
            ],
            [
                13206,
                13219
            ],
            [
                13219,
                13228
            ],
            [
                13228,
                13247
            ],
            [
                13247,
                13273
            ],
            [
                13273,
                13293
            ],
            [
                13293,
                13312
            ],
            [
                13312,
                13319
            ],
            [
                13319,
                13339
            ],
            [
                13339,
                13344
            ],
            [
                13344,
                13400
            ],
            [
                13400,
                13412
            ],
            [
                13412,
                13421
            ],
            [
                13421,
                13455
            ],
            [
                13455,
                13487
            ],
            [
                13487,
                13520
            ],
            [
                13520,
                13545
            ],
            [
                13545,
                13576
            ],
            [
                13576,
                13613
            ],
            [
                13613,
                13722
            ],
            [
                13722,
                13740
            ],
            [
                13740,
                13757
            ],
            [
                13757,
                13784
            ],
            [
                13784,
                13880
            ],
            [
                13880,
                13903
            ],
            [
                13903,
                13948
            ],
            [
                13948,
                14024
            ],
            [
                14024,
                14140
            ],
            [
                14140,
                14184
            ],
            [
                14184,
                14261
            ],
            [
                14261,
                14314
            ],
            [
                14314,
                14382
            ],
            [
                14382,
                14399
            ],
            [
                14399,
                14441
            ],
            [
                14441,
                14643
            ],
            [
                14643,
                14663
            ],
            [
                14663,
                14689
            ],
            [
                14689,
                14707
            ],
            [
                14707,
                14747
            ],
            [
                14747,
                14789
            ],
            [
                14789,
                14820
            ],
            [
                14820,
                14829
            ],
            [
                14829,
                14854
            ],
            [
                14854,
                14868
            ],
            [
                14868,
                14928
            ],
            [
                14928,
                15131
            ],
            [
                15131,
                15145
            ],
            [
                15145,
                15155
            ],
            [
                15155,
                15164
            ],
            [
                15164,
                15182
            ],
            [
                15182,
                15294
            ],
            [
                15294,
                15315
            ],
            [
                15315,
                15330
            ],
            [
                15330,
                15346
            ],
            [
                15346,
                15362
            ],
            [
                15362,
                15380
            ],
            [
                15380,
                15419
            ],
            [
                15419,
                15465
            ],
            [
                15465,
                15493
            ],
            [
                15493,
                15534
            ],
            [
                15534,
                15544
            ],
            [
                15544,
                15582
            ],
            [
                15582,
                15628
            ],
            [
                15628,
                15649
            ],
            [
                15649,
                15786
            ],
            [
                15786,
                15944
            ],
            [
                15944,
                16009
            ],
            [
                16009,
                16017
            ],
            [
                16017,
                16046
            ],
            [
                16046,
                16055
            ],
            [
                16055,
                16074
            ],
            [
                16074,
                16088
            ],
            [
                16088,
                16187
            ],
            [
                16187,
                16235
            ],
            [
                16235,
                16375
            ],
            [
                16375,
                16393
            ],
            [
                16393,
                16412
            ],
            [
                16412,
                16417
            ],
            [
                16417,
                16423
            ],
            [
                16423,
                16460
            ],
            [
                16460,
                16721
            ],
            [
                16721,
                16787
            ],
            [
                16787,
                16838
            ],
            [
                16838,
                16910
            ],
            [
                16910,
                16927
            ],
            [
                16927,
                16936
            ],
            [
                16936,
                16972
            ],
            [
                16972,
                16989
            ],
            [
                16989,
                17079
            ],
            [
                17079,
                17087
            ],
            [
                17087,
                17131
            ],
            [
                17131,
                17168
            ],
            [
                17168,
                17175
            ],
            [
                17175,
                17215
            ],
            [
                17215,
                17242
            ],
            [
                17242,
                17342
            ],
            [
                17342,
                17400
            ],
            [
                17400,
                17519
            ],
            [
                17519,
                17619
            ],
            [
                17619,
                17662
            ],
            [
                17662,
                17784
            ],
            [
                17784,
                17880
            ],
            [
                17880,
                18006
            ],
            [
                18006,
                18179
            ],
            [
                18179,
                18376
            ],
            [
                18376,
                18493
            ],
            [
                18493,
                18754
            ],
            [
                18754,
                18868
            ],
            [
                18868,
                18909
            ],
            [
                18909,
                19012
            ]
        ]
    },
    "abridged": {
        "text": "My Lady Dedlock is very restless. Today she is at Chesney Wold; yesterday she was at her house in town; tomorrow she may be abroad, for anything anyone can predict. Even Sir Leicester's gallantry cannot keep pace with her, for the gout has gripped him by both legs.\nSir Leicester views the gout as a troublesome but aristocratic demon. All the Dedlocks, in the male line, have had the gout. Other men's fathers may have died of vulgar complaints, but the Dedlock family have a higher class of illness. It has come down through the illustrious line like the silver-plate, or the place in Lincolnshire.\nSo Sir Leicester yields up his family legs to the family disorder as his inheritance. He feels that for a Dedlock to be laid upon his back and spasmodically stabbed in his extremities is a liberty taken somewhere, but he thinks, \"We have all yielded to this; it belongs to us; and I submit myself to it.\"\nAnd a good picture he makes, lying in a flush of crimson and gold in the great drawing-room before his favourite picture of my Lady, with broad strips of sunlight shining in through the long line of windows. Outside, the stately oaks, rooted in the green ground which has never known the plough, but has been a hunting-estate for centuries, bear witness to his greatness. Inside, his forefathers, looking on him from the walls, say, \"Each of us was a passing reality here and left this coloured shadow of himself.\"\nMy Lady is at present represented by her portrait. She has flitted away to town, and will soon flit back here again, to the confusion of the fashionable world.\nThe house in town is not prepared for her reception. It is muffled and dreary. Only one powdered footman gapes disconsolate at the hall-window.\nWhat connexion can there be between the place in Lincolnshire, the house in town, the footman, and the whereabouts of Jo the outlaw with the broom, who swept the churchyard-step?\nJo sweeps his crossing all day long, unconscious of the link, if any link there be. He sums up his mental condition when asked a question by replying that he \"don't know nothink.\" He knows that it's hard to keep the mud off the crossing in dirty weather, and harder still to live by doing it. Nobody taught him even that much; he found it out.\nJo lives - that is to say, Jo has not yet died - in a ruinous place known as Tom-all-Alone's. It is a black, dilapidated street, avoided by decent people, where the crazy, decaying houses were seized upon by some bold vagrants who then let them out as lodgings. Now, these tumbling tenements contain, by night, a swarm of misery. Like parasites on a ruined human body, a crowd of foul existence crawls in and out of gaps in walls; and coils itself to sleep, in maggot numbers, where the rain drips in; and comes and goes, fetching and carrying fever and evil in every footprint.\nTwice lately there has been a crash and a cloud of dust in Tom-all-Alone's; each time a house has fallen. These accidents have made a paragraph in the newspapers and have filled a bed or two in the nearest hospital. The gaps remain, and there are not unpopular lodgings among the rubbish. As several more houses are nearly ready to go, the next crash in Tom-all-Alone's is expected to be a good one.\nThis desirable property is in Chancery, of course. Whether \"Tom\" represents the original plaintiff in Jarndyce and Jarndyce, or whether Tom lived here when the suit had laid the street waste, or whether the title is a traditional name, perhaps nobody knows. Certainly Jo doesn't know.\n\"For I don't know nothink,\" says Jo.\nIt must be a strange state to be like Jo! To shuffle through the streets, in utter darkness as to the meaning of those mysterious symbols over the shops, and in the windows! To see people read and write, and not to have the least idea of all that language! It must be very puzzling to see the good company going to the churches on Sundays, with their books in their hands, and to think (for perhaps Jo does think at odd times) what does it all mean, and how comes it that it means nothing to me? To be hustled, and jostled, and moved on; and yet to be perplexed by the feeling that I am here somehow, and everybody overlooked me until I became the creature that I am! It must be a strange state, not merely to be told that I am scarcely human, but to feel it! To see the horses, dogs, and cattle go by me and to know that in ignorance I belong with them and not to the superior beings whose delicacy I offend!\nJo comes out of Tom-all-Alone's, munching his dirty bit of bread. He sits down to breakfast on the door-step of the Society for the Propagation of the Gospel in Foreign Parts and gives it a brush when he has finished, in return for the seat. He admires the size of the building and wonders what it's all about.\nHe goes to his crossing and begins to lay it out for the day. The town awakes to its daily spin and whirl; all that unaccountable reading and writing recommences. Jo and the other lower animals get on in the unintelligible mess as they can. It is market-day. The blinded oxen, over-goaded, over-driven, never guided, run into wrong places and are beaten out, and plunge red-eyed at stone walls, and often sorely hurt the innocent, and themselves. Very like Jo and his order; very like!\nA band of music comes and plays. Jo listens to it. So does a drover's dog, waiting for his master outside a butcher's shop. A vagabond dog, accustomed to low company and public-houses; a terrifying dog to sheep, ready at a whistle to tear out mouthfuls of their wool; but an educated, improved dog who has been taught his duties and knows how to do them. He and Jo listen to the music, probably with much the same amount of animal satisfaction; as to awakened associations, they are probably upon a par. But, otherwise, how far above the human listener is the brute!\nThe day changes as it wears itself away, and becomes dark and drizzly. Jo fights it out at his crossing among the mud and wheels, the horses, whips, and umbrellas, and gets only a scanty sum to pay for the unsavoury shelter of Tom-all-Alone's. Twilight comes on; gas lamps are lit; the lamplighter, with his ladder, runs along the pavement. A wretched evening is beginning to close in.\nIn his chambers Mr. Tulkinghorn sits meditating an application to a magistrate tomorrow morning for a warrant. Gridley has been here today and has been alarming. He needs to be held to bail again. Mr. Tulkinghorn does not look out of the window.\nAnd if he did, what would it be to see a woman going by? There are too many women in the world, Mr. Tulkinghorn thinks; they are at the bottom of all that goes wrong in it, although they create business for lawyers. What would it be to see a woman going by, even though she were going secretly? They are all secret. Mr. Tulkinghorn knows that very well.\nBut they are not all like the woman who now leaves him and his house behind, whose plain dress does not match her refined manner. She should be an upper servant by her clothing, yet in her air and step - even in the muddy streets - she is a lady. Her face is veiled, and still she betrays herself enough to make some who pass her look round sharply.\nShe never turns her head. Lady or servant, she has a purpose and never turns her head until she comes to the crossing where Jo plies with his broom. He crosses with her and begs. Still, she does not turn her head until she is on the other side. Then she slightly beckons to him and says, \"Come here!\"\nJo follows her a pace or two into a quiet court.\n\"Are you the boy I've read of in the papers?\" she asks behind her veil.\n\"I don't know,\" says Jo. \"I don't know nothink about no papers.\"\n\"Were you examined at an inquest?\"\n\"I don't know nothink about no - where I was took by the beadle, do you mean?\" says Jo. \"Was the boy's name at the inkwhich Jo?\"\n\"Yes.\"\n\"That's me!\" says Jo. \"You mean about the man? Him as wos dead?\"\n\"Hush! Whisper! Yes. Did he look, when he was living, so very ill and poor?\"\n\"Oh, jist!\" says Jo.\n\"Did he look like you?\" says the woman with abhorrence.\n\"Oh, not so bad as me,\" says Jo. \"You didn't know him, did you?\"\n\"How dare you ask me that?\"\n\"No offence, my lady,\" says Jo humbly, for even he suspects her of being a lady.\n\"I am not a lady. I am a servant.\"\n\"You're a jolly servant!\" says Jo in admiration.\n\"Listen and be silent. Stand farther away! Can you show me those places that were spoken of in the account I read? The place he wrote for, the place he died at, the place where you were taken to, and the place where he was buried?\"\nJo answers with a nod for each.\n\"Go ahead of me and show me all those dreadful places. Stop opposite each, and don't speak to me unless I speak to you. Don't look back. I will pay you well.\"\nJo attends closely to these words, finding them rather hard; pauses to consider their meaning; and nods his ragged head.\n\"I'm fly,\" says Jo. \"But fen larks, you know. Stow hooking it!\"\n\"What does the horrible creature mean?\" exclaims the servant, recoiling from him. \"I don't understand you. Go on! I will give you more money than you ever had in your life.\"\nJo screws up his mouth into a whistle, takes his broom under his arm, and leads the way in his bare feet over the hard stones and through the mud and mire.\nCook's Court. Jo stops. A pause.\n\"Who lives here?\"\n\"Him wot give him his writing,\" says Jo in a whisper without looking over his shoulder.\n\"Go on to the next.\"\nKrook's house. Jo stops again. A longer pause.\n\"Who lives here?\"\n\"He lived here,\" Jo answers as before.\nAfter a silence he is asked, \"In which room?\"\n\"In the back room up there. You can see the winder from this corner. That's where I see him stritched out. This is the public-ouse where I was took to.\"\n\"Go on to the next!\"\nIt is a longer walk to the next, but Jo does not look round. By many devious and reeking ways, they come to the little tunnel of a court, and to the iron gate.\n\"He was put there,\" says Jo, holding to the bars and looking in.\n\"Where? Oh, what a scene of horror!\"\n\"There!\" says Jo, pointing. \"Over yinder. Among them piles of bones, wery nigh the top. They was obliged to stamp upon it to git it in. I could unkiver it for you with my broom if the gate was open,\" giving it a shake, \"but it's always locked. Look at the rat!\" cries Jo, excited. \"Hi! There he goes, into the ground!\"\nThe woman shrinks into a corner of that hideous archway, with its deadly stains contaminating her dress; and putting out her hands and passionately telling him to keep away from her, so remains for some moments. Jo stands staring until she recovers herself.\n\"Is this place of abomination consecrated ground?\"\n\"I don't know nothink of consequential ground,\" says Jo.\n\"Is it blessed?\"\n\"Which?\" says Jo, amazed.\n\"Is it blessed?\"\n\"I'm blest if I know,\" says Jo, staring more than ever; \"but I shouldn't think so. It an't done it much good if it is. Blest? I should think it was t'othered myself. But I don't know nothink!\"\nThe servant takes little heed of what he says. She draws off her glove to get some money from her purse. Jo silently notices how white and small her hand is and what a jolly servant she must be to wear such sparkling rings.\nShe drops a piece of money in his hand without touching it, shuddering as their hands approach. \"Now,\" she adds, \"show me the spot again!\"\nJo thrusts the handle of his broom between the bars of the gate, and points it out. At length, looking around, he finds that he is alone.\nHe holds the piece of money to the gas-light and is overpowered at finding that it is yellow - gold. He tests it with a bite, then puts it in his mouth for safety. He sweeps the step and passage with great care. His job done, he sets off for Tom-all-Alone's, stopping in the light of many gas-lamps to produce the piece of gold and give it another look to reassure himself that it is genuine.\nThat evening my Lady Dedlock goes to a grand dinner and three or four balls. Sir Leicester is fidgety down at Chesney Wold; he complains to Mrs. Rouncewell that the rain makes such a monotonous pattering on the terrace that he can't read the paper in his dressing-room.\n\"Sir Leicester would have done better to try the other side of the house, my dear,\" says Mrs. Rouncewell to Rosa. \"His dressing-room is on my Lady's side. And in all these years I never heard the step upon the Ghost's Walk more distinct than it is tonight!\"",
        "paragraph_chars": [
            [
                0,
                266
            ],
            [
                266,
                601
            ],
            [
                601,
                906
            ],
            [
                906,
                1421
            ],
            [
                1421,
                1581
            ],
            [
                1581,
                1725
            ],
            [
                1725,
                1904
            ],
            [
                1904,
                2248
            ],
            [
                2248,
                2827
            ],
            [
                2827,
                3227
            ],
            [
                3227,
                3512
            ],
            [
                3512,
                3549
            ],
            [
                3549,
                4459
            ],
            [
                4459,
                4770
            ],
            [
                4770,
                5256
            ],
            [
                5256,
                5823
            ],
            [
                5823,
                6209
            ],
            [
                6209,
                6455
            ],
            [
                6455,
                6809
            ],
            [
                6809,
                7159
            ],
            [
                7159,
                7460
            ],
            [
                7460,
                7509
            ],
            [
                7509,
                7581
            ],
            [
                7581,
                7646
            ],
            [
                7646,
                7681
            ],
            [
                7681,
                7810
            ],
            [
                7810,
                7817
            ],
            [
                7817,
                7882
            ],
            [
                7882,
                7959
            ],
            [
                7959,
                7980
            ],
            [
                7980,
                8036
            ],
            [
                8036,
                8101
            ],
            [
                8101,
                8129
            ],
            [
                8129,
                8210
            ],
            [
                8210,
                8245
            ],
            [
                8245,
                8294
            ],
            [
                8294,
                8526
            ],
            [
                8526,
                8558
            ],
            [
                8558,
                8717
            ],
            [
                8717,
                8838
            ],
            [
                8838,
                8902
            ],
            [
                8902,
                9076
            ],
            [
                9076,
                9232
            ],
            [
                9232,
                9265
            ],
            [
                9265,
                9283
            ],
            [
                9283,
                9371
            ],
            [
                9371,
                9392
            ],
            [
                9392,
                9439
            ],
            [
                9439,
                9457
            ],
            [
                9457,
                9496
            ],
            [
                9496,
                9542
            ],
            [
                9542,
                9695
            ],
            [
                9695,
                9716
            ],
            [
                9716,
                9876
            ],
            [
                9876,
                9941
            ],
            [
                9941,
                9978
            ],
            [
                9978,
                10297
            ],
            [
                10297,
                10555
            ],
            [
                10555,
                10606
            ],
            [
                10606,
                10663
            ],
            [
                10663,
                10680
            ],
            [
                10680,
                10706
            ],
            [
                10706,
                10723
            ],
            [
                10723,
                10916
            ],
            [
                10916,
                11140
            ],
            [
                11140,
                11279
            ],
            [
                11279,
                11417
            ],
            [
                11417,
                11810
            ],
            [
                11810,
                12080
            ],
            [
                12080,
                12337
            ]
        ],
        "segment_chars": [
            [
                0,
                34
            ],
            [
                34,
                165
            ],
            [
                165,
                266
            ],
            [
                266,
                336
            ],
            [
                336,
                391
            ],
            [
                391,
                502
            ],
            [
                502,
                601
            ],
            [
                601,
                687
            ],
            [
                687,
                906
            ],
            [
                906,
                1114
            ],
            [
                1114,
                1278
            ],
            [
                1278,
                1421
            ],
            [
                1421,
                1472
            ],
            [
                1472,
                1581
            ],
            [
                1581,
                1634
            ],
            [
                1634,
                1660
            ],
            [
                1660,
                1725
            ],
            [
                1725,
                1904
            ],
            [
                1904,
                1988
            ],
            [
                1988,
                2084
            ],
            [
                2084,
                2197
            ],
            [
                2197,
                2248
            ],
            [
                2248,
                2342
            ],
            [
                2342,
                2510
            ],
            [
                2510,
                2578
            ],
            [
                2578,
                2827
            ],
            [
                2827,
                2933
            ],
            [
                2933,
                3043
            ],
            [
                3043,
                3116
            ],
            [
                3116,
                3227
            ],
            [
                3227,
                3278
            ],
            [
                3278,
                3485
            ],
            [
                3485,
                3512
            ],
            [
                3512,
                3549
            ],
            [
                3549,
                3591
            ],
            [
                3591,
                3723
            ],
            [
                3723,
                3806
            ],
            [
                3806,
                4045
            ],
            [
                4045,
                4217
            ],
            [
                4217,
                4309
            ],
            [
                4309,
                4459
            ],
            [
                4459,
                4525
            ],
            [
                4525,
                4701
            ],
            [
                4701,
                4770
            ],
            [
                4770,
                4832
            ],
            [
                4832,
                4933
            ],
            [
                4933,
                5011
            ],
            [
                5011,
                5029
            ],
            [
                5029,
                5217
            ],
            [
                5217,
                5256
            ],
            [
                5256,
                5289
            ],
            [
                5289,
                5307
            ],
            [
                5307,
                5380
            ],
            [
                5380,
                5611
            ],
            [
                5611,
                5760
            ],
            [
                5760,
                5823
            ],
            [
                5823,
                5894
            ],
            [
                5894,
                6067
            ],
            [
                6067,
                6164
            ],
            [
                6164,
                6209
            ],
            [
                6209,
                6320
            ],
            [
                6320,
                6371
            ],
            [
                6371,
                6406
            ],
            [
                6406,
                6455
            ],
            [
                6455,
                6512
            ],
            [
                6512,
                6671
            ],
            [
                6671,
                6750
            ],
            [
                6750,
                6771
            ],
            [
                6771,
                6809
            ],
            [
                6809,
                6939
            ],
            [
                6939,
                7056
            ],
            [
                7056,
                7159
            ],
            [
                7159,
                7185
            ],
            [
                7185,
                7308
            ],
            [
                7308,
                7338
            ],
            [
                7338,
                7404
            ],
            [
                7404,
                7460
            ],
            [
                7460,
                7509
            ],
            [
                7509,
                7555
            ],
            [
                7555,
                7581
            ],
            [
                7581,
                7606
            ],
            [
                7606,
                7646
            ],
            [
                7646,
                7681
            ],
            [
                7681,
                7760
            ],
            [
                7760,
                7769
            ],
            [
                7769,
                7810
            ],
            [
                7810,
                7817
            ],
            [
                7817,
                7830
            ],
            [
                7830,
                7839
            ],
            [
                7839,
                7864
            ],
            [
                7864,
                7882
            ],
            [
                7882,
                7889
            ],
            [
                7889,
                7898
            ],
            [
                7898,
                7903
            ],
            [
                7903,
                7959
            ],
            [
                7959,
                7971
            ],
            [
                7971,
                7980
            ],
            [
                7980,
                8004
            ],
            [
                8004,
                8036
            ],
            [
                8036,
                8069
            ],
            [
                8069,
                8101
            ],
            [
                8101,
                8129
            ],
            [
                8129,
                8210
            ],
            [
                8210,
                8228
            ],
            [
                8228,
                8245
            ],
            [
                8245,
                8271
            ],
            [
                8271,
                8294
            ],
            [
                8294,
                8317
            ],
            [
                8317,
                8337
            ],
            [
                8337,
                8409
            ],
            [
                8409,
                8526
            ],
            [
                8526,
                8558
            ],
            [
                8558,
                8613
            ],
            [
                8613,
                8678
            ],
            [
                8678,
                8695
            ],
            [
                8695,
                8717
            ],
            [
                8717,
                8838
            ],
            [
                8838,
                8858
            ],
            [
                8858,
                8884
            ],
            [
                8884,
                8902
            ],
            [
                8902,
                8942
            ],
            [
                8942,
                8984
            ],
            [
                8984,
                9009
            ],
            [
                9009,
                9016
            ],
            [
                9016,
                9076
            ],
            [
                9076,
                9232
            ],
            [
                9232,
                9246
            ],
            [
                9246,
                9256
            ],
            [
                9256,
                9265
            ],
            [
                9265,
                9283
            ],
            [
                9283,
                9371
            ],
            [
                9371,
                9392
            ],
            [
                9392,
                9407
            ],
            [
                9407,
                9423
            ],
            [
                9423,
                9439
            ],
            [
                9439,
                9457
            ],
            [
                9457,
                9496
            ],
            [
                9496,
                9542
            ],
            [
                9542,
                9570
            ],
            [
                9570,
                9611
            ],
            [
                9611,
                9649
            ],
            [
                9649,
                9695
            ],
            [
                9695,
                9716
            ],
            [
                9716,
                9777
            ],
            [
                9777,
                9876
            ],
            [
                9876,
                9941
            ],
            [
                9941,
                9949
            ],
            [
                9949,
                9978
            ],
            [
                9978,
                9987
            ],
            [
                9987,
                10006
            ],
            [
                10006,
                10020
            ],
            [
                10020,
                10066
            ],
            [
                10066,
                10114
            ],
            [
                10114,
                10222
            ],
            [
                10222,
                10240
            ],
            [
                10240,
                10259
            ],
            [
                10259,
                10264
            ],
            [
                10264,
                10297
            ],
            [
                10297,
                10509
            ],
            [
                10509,
                10555
            ],
            [
                10555,
                10606
            ],
            [
                10606,
                10663
            ],
            [
                10663,
                10680
            ],
            [
                10680,
                10689
            ],
            [
                10689,
                10706
            ],
            [
                10706,
                10723
            ],
            [
                10723,
                10806
            ],
            [
                10806,
                10842
            ],
            [
                10842,
                10849
            ],
            [
                10849,
                10889
            ],
            [
                10889,
                10916
            ],
            [
                10916,
                10963
            ],
            [
                10963,
                11021
            ],
            [
                11021,
                11140
            ],
            [
                11140,
                11236
            ],
            [
                11236,
                11279
            ],
            [
                11279,
                11363
            ],
            [
                11363,
                11417
            ],
            [
                11417,
                11518
            ],
            [
                11518,
                11581
            ],
            [
                11581,
                11629
            ],
            [
                11629,
                11810
            ],
            [
                11810,
                11887
            ],
            [
                11887,
                12080
            ],
            [
                12080,
                12194
            ],
            [
                12194,
                12235
            ],
            [
                12235,
                12337
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                19,
                34
            ],
            [
                40,
                103
            ],
            [
                113,
                144
            ],
            [
                152,
                155
            ],
            [
                156,
                165
            ],
            [
                165,
                195
            ],
            [
                203,
                221
            ],
            [
                221,
                226
            ],
            [
                227,
                235
            ],
            [
                236,
                239
            ],
            [
                248,
                266
            ],
            [
                266,
                279
            ],
            [
                286,
                311
            ],
            [
                312,
                315
            ],
            [
                329,
                334
            ],
            [
                334,
                336
            ],
            [
                336,
                360
            ],
            [
                361,
                370
            ],
            [
                370,
                391
            ],
            [
                391,
                427
            ],
            [
                428,
                434
            ],
            [
                445,
                474
            ],
            [
                490,
                492
            ],
            [
                500,
                502
            ],
            [
                502,
                556
            ],
            [
                564,
                569
            ],
            [
                569,
                600
            ],
            [
                604,
                669
            ],
            [
                670,
                673
            ],
            [
                685,
                687
            ],
            [
                687,
                757
            ],
            [
                758,
                877
            ],
            [
                878,
                900
            ],
            [
                901,
                903
            ],
            [
                903,
                906
            ],
            [
                906,
                916
            ],
            [
                925,
                974
            ],
            [
                975,
                1079
            ],
            [
                1080,
                1112
            ],
            [
                1112,
                1114
            ],
            [
                1114,
                1147
            ],
            [
                1148,
                1189
            ],
            [
                1194,
                1200
            ],
            [
                1200,
                1205
            ],
            [
                1215,
                1216
            ],
            [
                1224,
                1225
            ],
            [
                1232,
                1235
            ],
            [
                1245,
                1278
            ],
            [
                1278,
                1418
            ],
            [
                1421,
                1454
            ],
            [
                1455,
                1472
            ],
            [
                1472,
                1501
            ],
            [
                1502,
                1520
            ],
            [
                1531,
                1573
            ],
            [
                1579,
                1580
            ],
            [
                1581,
                1634
            ],
            [
                1634,
                1660
            ],
            [
                1660,
                1668
            ],
            [
                1682,
                1685
            ],
            [
                1686,
                1723
            ],
            [
                1725,
                1810
            ],
            [
                1818,
                1827
            ],
            [
                1840,
                1876
            ],
            [
                1877,
                1903
            ],
            [
                1904,
                1988
            ],
            [
                1988,
                2084
            ],
            [
                2084,
                2197
            ],
            [
                2197,
                2248
            ],
            [
                2248,
                2256
            ],
            [
                2259,
                2294
            ],
            [
                2297,
                2321
            ],
            [
                2325,
                2342
            ],
            [
                2342,
                2387
            ],
            [
                2388,
                2418
            ],
            [
                2418,
                2419
            ],
            [
                2429,
                2452
            ],
            [
                2453,
                2478
            ],
            [
                2488,
                2496
            ],
            [
                2500,
                2510
            ],
            [
                2510,
                2578
            ],
            [
                2583,
                2592
            ],
            [
                2593,
                2595
            ],
            [
                2598,
                2610
            ],
            [
                2615,
                2616
            ],
            [
                2617,
                2642
            ],
            [
                2643,
                2677
            ],
            [
                2677,
                2801
            ],
            [
                2802,
                2809
            ],
            [
                2810,
                2825
            ],
            [
                2825,
                2827
            ],
            [
                2827,
                2882
            ],
            [
                2883,
                2902
            ],
            [
                2903,
                2933
            ],
            [
                2933,
                3043
            ],
            [
                3043,
                3116
            ],
            [
                3116,
                3196
            ],
            [
                3200,
                3227
            ],
            [
                3227,
                3278
            ],
            [
                3278,
                3291
            ],
            [
                3303,
                3325
            ],
            [
                3326,
                3418
            ],
            [
                3419,
                3433
            ],
            [
                3434,
                3444
            ],
            [
                3445,
                3456
            ],
            [
                3457,
                3461
            ],
            [
                3461,
                3485
            ],
            [
                3485,
                3497
            ],
            [
                3503,
                3512
            ],
            [
                3512,
                3516
            ],
            [
                3517,
                3537
            ],
            [
                3537,
                3547
            ],
            [
                3549,
                3591
            ],
            [
                3591,
                3622
            ],
            [
                3623,
                3658
            ],
            [
                3659,
                3686
            ],
            [
                3687,
                3701
            ],
            [
                3701,
                3723
            ],
            [
                3723,
                3741
            ],
            [
                3742,
                3745
            ],
            [
                3746,
                3751
            ],
            [
                3751,
                3804
            ],
            [
                3804,
                3806
            ],
            [
                3806,
                4002
            ],
            [
                4003,
                4045
            ],
            [
                4045,
                4090
            ],
            [
                4091,
                4117
            ],
            [
                4126,
                4148
            ],
            [
                4148,
                4217
            ],
            [
                4217,
                4291
            ],
            [
                4293,
                4307
            ],
            [
                4307,
                4309
            ],
            [
                4309,
                4392
            ],
            [
                4398,
                4433
            ],
            [
                4434,
                4458
            ],
            [
                4459,
                4491
            ],
            [
                4501,
                4523
            ],
            [
                4523,
                4525
            ],
            [
                4525,
                4675
            ],
            [
                4675,
                4676
            ],
            [
                4691,
                4694
            ],
            [
                4699,
                4701
            ],
            [
                4701,
                4727
            ],
            [
                4737,
                4769
            ],
            [
                4770,
                4832
            ],
            [
                4832,
                4847
            ],
            [
                4851,
                4919
            ],
            [
                4920,
                4933
            ],
            [
                4933,
                5011
            ],
            [
                5011,
                5029
            ],
            [
                5029,
                5148
            ],
            [
                5149,
                5204
            ],
            [
                5205,
                5217
            ],
            [
                5217,
                5249
            ],
            [
                5250,
                5256
            ],
            [
                5256,
                5289
            ],
            [
                5289,
                5307
            ],
            [
                5307,
                5314
            ],
            [
                5315,
                5378
            ],
            [
                5378,
                5380
            ],
            [
                5380,
                5381
            ],
            [
                5382,
                5442
            ],
            [
                5454,
                5489
            ],
            [
                5490,
                5549
            ],
            [
                5550,
                5601
            ],
            [
                5605,
                5611
            ],
            [
                5611,
                5700
            ],
            [
                5701,
                5715
            ],
            [
                5728,
                5760
            ],
            [
                5760,
                5823
            ],
            [
                5823,
                5862
            ],
            [
                5864,
                5894
            ],
            [
                5894,
                5995
            ],
            [
                6001,
                6067
            ],
            [
                6067,
                6089
            ],
            [
                6103,
                6153
            ],
            [
                6154,
                6164
            ],
            [
                6164,
                6209
            ],
            [
                6209,
                6274
            ],
            [
                6277,
                6287
            ],
            [
                6297,
                6320
            ],
            [
                6320,
                6327
            ],
            [
                6328,
                6341
            ],
            [
                6348,
                6371
            ],
            [
                6380,
                6382
            ],
            [
                6383,
                6406
            ],
            [
                6408,
                6421
            ],
            [
                6422,
                6442
            ],
            [
                6443,
                6446
            ],
            [
                6447,
                6455
            ],
            [
                6455,
                6512
            ],
            [
                6512,
                6521
            ],
            [
                6522,
                6530
            ],
            [
                6531,
                6536
            ],
            [
                6537,
                6573
            ],
            [
                6573,
                6627
            ],
            [
                6637,
                6671
            ],
            [
                6671,
                6750
            ],
            [
                6750,
                6771
            ],
            [
                6771,
                6809
            ],
            [
                6809,
                6885
            ],
            [
                6886,
                6903
            ],
            [
                6919,
                6937
            ],
            [
                6937,
                6939
            ],
            [
                6939,
                6976
            ],
            [
                6985,
                7010
            ],
            [
                7018,
                7038
            ],
            [
                7041,
                7056
            ],
            [
                7056,
                7089
            ],
            [
                7090,
                7105
            ],
            [
                7113,
                7120
            ],
            [
                7126,
                7159
            ],
            [
                7159,
                7185
            ],
            [
                7185,
                7219
            ],
            [
                7220,
                7223
            ],
            [
                7224,
                7308
            ],
            [
                7308,
                7338
            ],
            [
                7338,
                7381
            ],
            [
                7385,
                7404
            ],
            [
                7404,
                7460
            ],
            [
                7460,
                7509
            ],
            [
                7509,
                7555
            ],
            [
                7555,
                7558
            ],
            [
                7564,
                7581
            ],
            [
                7581,
                7604
            ],
            [
                7604,
                7606
            ],
            [
                7607,
                7633
            ],
            [
                7643,
                7646
            ],
            [
                7646,
                7681
            ],
            [
                7681,
                7711
            ],
            [
                7714,
                7760
            ],
            [
                7760,
                7769
            ],
            [
                7769,
                7810
            ],
            [
                7810,
                7817
            ],
            [
                7817,
                7830
            ],
            [
                7830,
                7838
            ],
            [
                7839,
                7862
            ],
            [
                7864,
                7882
            ],
            [
                7882,
                7889
            ],
            [
                7896,
                7898
            ],
            [
                7898,
                7903
            ],
            [
                7903,
                7959
            ],
            [
                7959,
                7971
            ],
            [
                7971,
                7980
            ],
            [
                7980,
                7997
            ],
            [
                7998,
                8004
            ],
            [
                8004,
                8036
            ],
            [
                8036,
                8069
            ],
            [
                8070,
                8101
            ],
            [
                8101,
                8121
            ],
            [
                8126,
                8129
            ],
            [
                8129,
                8159
            ],
            [
                8166,
                8179
            ],
            [
                8189,
                8192
            ],
            [
                8193,
                8195
            ],
            [
                8196,
                8210
            ],
            [
                8210,
                8228
            ],
            [
                8228,
                8245
            ],
            [
                8245,
                8249
            ],
            [
                8253,
                8271
            ],
            [
                8271,
                8278
            ],
            [
                8282,
                8294
            ],
            [
                8294,
                8317
            ],
            [
                8317,
                8330
            ],
            [
                8335,
                8337
            ],
            [
                8337,
                8352
            ],
            [
                8353,
                8409
            ],
            [
                8409,
                8523
            ],
            [
                8526,
                8547
            ],
            [
                8552,
                8556
            ],
            [
                8556,
                8558
            ],
            [
                8558,
                8561
            ],
            [
                8571,
                8613
            ],
            [
                8613,
                8626
            ],
            [
                8627,
                8678
            ],
            [
                8678,
                8695
            ],
            [
                8695,
                8717
            ],
            [
                8717,
                8735
            ],
            [
                8745,
                8750
            ],
            [
                8750,
                8811
            ],
            [
                8812,
                8838
            ],
            [
                8838,
                8858
            ],
            [
                8858,
                8884
            ],
            [
                8884,
                8902
            ],
            [
                8902,
                8942
            ],
            [
                8942,
                8983
            ],
            [
                8984,
                9009
            ],
            [
                9009,
                9014
            ],
            [
                9014,
                9016
            ],
            [
                9016,
                9076
            ],
            [
                9076,
                9113
            ],
            [
                9113,
                9163
            ],
            [
                9167,
                9232
            ],
            [
                9232,
                9246
            ],
            [
                9246,
                9256
            ],
            [
                9256,
                9265
            ],
            [
                9265,
                9283
            ],
            [
                9283,
                9312
            ],
            [
                9312,
                9371
            ],
            [
                9371,
                9392
            ],
            [
                9392,
                9407
            ],
            [
                9407,
                9423
            ],
            [
                9423,
                9439
            ],
            [
                9439,
                9457
            ],
            [
                9457,
                9496
            ],
            [
                9496,
                9542
            ],
            [
                9542,
                9570
            ],
            [
                9570,
                9611
            ],
            [
                9611,
                9649
            ],
            [
                9649,
                9695
            ],
            [
                9695,
                9716
            ],
            [
                9716,
                9755
            ],
            [
                9756,
                9777
            ],
            [
                9777,
                9792
            ],
            [
                9793,
                9796
            ],
            [
                9797,
                9804
            ],
            [
                9805,
                9809
            ],
            [
                9809,
                9864
            ],
            [
                9865,
                9876
            ],
            [
                9876,
                9941
            ],
            [
                9941,
                9949
            ],
            [
                9949,
                9978
            ],
            [
                9978,
                9987
            ],
            [
                9987,
                10006
            ],
            [
                10006,
                10020
            ],
            [
                10020,
                10046
            ],
            [
                10047,
                10066
            ],
            [
                10066,
                10114
            ],
            [
                10114,
                10175
            ],
            [
                10175,
                10195
            ],
            [
                10195,
                10196
            ],
            [
                10197,
                10198
            ],
            [
                10202,
                10222
            ],
            [
                10222,
                10240
            ],
            [
                10240,
                10259
            ],
            [
                10259,
                10264
            ],
            [
                10264,
                10277
            ],
            [
                10279,
                10297
            ],
            [
                10297,
                10300
            ],
            [
                10307,
                10314
            ],
            [
                10315,
                10421
            ],
            [
                10422,
                10479
            ],
            [
                10480,
                10509
            ],
            [
                10509,
                10526
            ],
            [
                10533,
                10555
            ],
            [
                10555,
                10606
            ],
            [
                10606,
                10661
            ],
            [
                10661,
                10663
            ],
            [
                10663,
                10680
            ],
            [
                10680,
                10689
            ],
            [
                10689,
                10697
            ],
            [
                10698,
                10706
            ],
            [
                10706,
                10723
            ],
            [
                10723,
                10801
            ],
            [
                10804,
                10806
            ],
            [
                10806,
                10842
            ],
            [
                10842,
                10849
            ],
            [
                10849,
                10889
            ],
            [
                10889,
                10916
            ],
            [
                10916,
                10933
            ],
            [
                10934,
                10961
            ],
            [
                10961,
                10963
            ],
            [
                10963,
                11021
            ],
            [
                11021,
                11140
            ],
            [
                11140,
                11199
            ],
            [
                11200,
                11236
            ],
            [
                11236,
                11279
            ],
            [
                11279,
                11347
            ],
            [
                11348,
                11363
            ],
            [
                11363,
                11381
            ],
            [
                11388,
                11417
            ],
            [
                11426,
                11465
            ],
            [
                11466,
                11468
            ],
            [
                11469,
                11509
            ],
            [
                11512,
                11518
            ],
            [
                11527,
                11529
            ],
            [
                11535,
                11536
            ],
            [
                11537,
                11541
            ],
            [
                11541,
                11542
            ],
            [
                11553,
                11579
            ],
            [
                11579,
                11580
            ],
            [
                11591,
                11629
            ],
            [
                11629,
                11700
            ],
            [
                11706,
                11764
            ],
            [
                11801,
                11810
            ],
            [
                11823,
                11830
            ],
            [
                11839,
                11887
            ],
            [
                11887,
                11932
            ],
            [
                11932,
                12057
            ],
            [
                12058,
                12064
            ],
            [
                12065,
                12080
            ],
            [
                12080,
                12194
            ],
            [
                12194,
                12235
            ],
            [
                12235,
                12327
            ],
            [
                12335,
                12337
            ]
        ],
        "row_chars": [
            [
                0,
                34
            ],
            [
                34,
                34
            ],
            [
                34,
                165
            ],
            [
                165,
                266
            ],
            [
                266,
                336
            ],
            [
                336,
                391
            ],
            [
                391,
                391
            ],
            [
                391,
                502
            ],
            [
                502,
                601
            ],
            [
                601,
                601
            ],
            [
                601,
                601
            ],
            [
                601,
                687
            ],
            [
                687,
                906
            ],
            [
                906,
                1114
            ],
            [
                1114,
                1278
            ],
            [
                1278,
                1421
            ],
            [
                1421,
                1421
            ],
            [
                1421,
                1421
            ],
            [
                1421,
                1472
            ],
            [
                1472,
                1581
            ],
            [
                1581,
                1634
            ],
            [
                1634,
                1660
            ],
            [
                1660,
                1725
            ],
            [
                1725,
                1904
            ],
            [
                1904,
                1904
            ],
            [
                1904,
                1988
            ],
            [
                1988,
                2084
            ],
            [
                2084,
                2197
            ],
            [
                2197,
                2248
            ],
            [
                2248,
                2342
            ],
            [
                2342,
                2510
            ],
            [
                2510,
                2578
            ],
            [
                2578,
                2827
            ],
            [
                2827,
                2933
            ],
            [
                2933,
                3043
            ],
            [
                3043,
                3116
            ],
            [
                3116,
                3227
            ],
            [
                3227,
                3278
            ],
            [
                3278,
                3278
            ],
            [
                3278,
                3485
            ],
            [
                3485,
                3512
            ],
            [
                3512,
                3549
            ],
            [
                3549,
                3591
            ],
            [
                3591,
                3723
            ],
            [
                3723,
                3806
            ],
            [
                3806,
                4045
            ],
            [
                4045,
                4217
            ],
            [
                4217,
                4309
            ],
            [
                4309,
                4459
            ],
            [
                4459,
                4459
            ],
            [
                4459,
                4459
            ],
            [
                4459,
                4525
            ],
            [
                4525,
                4701
            ],
            [
                4701,
                4770
            ],
            [
                4770,
                4770
            ],
            [
                4770,
                4832
            ],
            [
                4832,
                4933
            ],
            [
                4933,
                5011
            ],
            [
                5011,
                5029
            ],
            [
                5029,
                5217
            ],
            [
                5217,
                5256
            ],
            [
                5256,
                5289
            ],
            [
                5289,
                5307
            ],
            [
                5307,
                5380
            ],
            [
                5380,
                5380
            ],
            [
                5380,
                5611
            ],
            [
                5611,
                5760
            ],
            [
                5760,
                5823
            ],
            [
                5823,
                5823
            ],
            [
                5823,
                5894
            ],
            [
                5894,
                6067
            ],
            [
                6067,
                6164
            ],
            [
                6164,
                6209
            ],
            [
                6209,
                6320
            ],
            [
                6320,
                6371
            ],
            [
                6371,
                6406
            ],
            [
                6406,
                6406
            ],
            [
                6406,
                6455
            ],
            [
                6455,
                6512
            ],
            [
                6512,
                6671
            ],
            [
                6671,
                6750
            ],
            [
                6750,
                6771
            ],
            [
                6771,
                6809
            ],
            [
                6809,
                6939
            ],
            [
                6939,
                7056
            ],
            [
                7056,
                7159
            ],
            [
                7159,
                7185
            ],
            [
                7185,
                7308
            ],
            [
                7308,
                7338
            ],
            [
                7338,
                7404
            ],
            [
                7404,
                7460
            ],
            [
                7460,
                7509
            ],
            [
                7509,
                7555
            ],
            [
                7555,
                7581
            ],
            [
                7581,
                7606
            ],
            [
                7606,
                7646
            ],
            [
                7646,
                7681
            ],
            [
                7681,
                7760
            ],
            [
                7760,
                7769
            ],
            [
                7769,
                7810
            ],
            [
                7810,
                7817
            ],
            [
                7817,
                7830
            ],
            [
                7830,
                7839
            ],
            [
                7839,
                7839
            ],
            [
                7839,
                7864
            ],
            [
                7864,
                7864
            ],
            [
                7864,
                7882
            ],
            [
                7882,
                7889
            ],
            [
                7889,
                7898
            ],
            [
                7898,
                7903
            ],
            [
                7903,
                7959
            ],
            [
                7959,
                7971
            ],
            [
                7971,
                7980
            ],
            [
                7980,
                8004
            ],
            [
                8004,
                8036
            ],
            [
                8036,
                8069
            ],
            [
                8069,
                8069
            ],
            [
                8069,
                8101
            ],
            [
                8101,
                8129
            ],
            [
                8129,
                8210
            ],
            [
                8210,
                8228
            ],
            [
                8228,
                8245
            ],
            [
                8245,
                8271
            ],
            [
                8271,
                8294
            ],
            [
                8294,
                8317
            ],
            [
                8317,
                8337
            ],
            [
                8337,
                8409
            ],
            [
                8409,
                8526
            ],
            [
                8526,
                8526
            ],
            [
                8526,
                8558
            ],
            [
                8558,
                8613
            ],
            [
                8613,
                8678
            ],
            [
                8678,
                8695
            ],
            [
                8695,
                8717
            ],
            [
                8717,
                8838
            ],
            [
                8838,
                8858
            ],
            [
                8858,
                8884
            ],
            [
                8884,
                8902
            ],
            [
                8902,
                8942
            ],
            [
                8942,
                8984
            ],
            [
                8984,
                8984
            ],
            [
                8984,
                8984
            ],
            [
                8984,
                9009
            ],
            [
                9009,
                9016
            ],
            [
                9016,
                9076
            ],
            [
                9076,
                9232
            ],
            [
                9232,
                9246
            ],
            [
                9246,
                9256
            ],
            [
                9256,
                9265
            ],
            [
                9265,
                9283
            ],
            [
                9283,
                9371
            ],
            [
                9371,
                9392
            ],
            [
                9392,
                9407
            ],
            [
                9407,
                9423
            ],
            [
                9423,
                9439
            ],
            [
                9439,
                9457
            ],
            [
                9457,
                9496
            ],
            [
                9496,
                9542
            ],
            [
                9542,
                9570
            ],
            [
                9570,
                9611
            ],
            [
                9611,
                9611
            ],
            [
                9611,
                9649
            ],
            [
                9649,
                9695
            ],
            [
                9695,
                9716
            ],
            [
                9716,
                9777
            ],
            [
                9777,
                9876
            ],
            [
                9876,
                9941
            ],
            [
                9941,
                9949
            ],
            [
                9949,
                9978
            ],
            [
                9978,
                9987
            ],
            [
                9987,
                10006
            ],
            [
                10006,
                10020
            ],
            [
                10020,
                10066
            ],
            [
                10066,
                10114
            ],
            [
                10114,
                10222
            ],
            [
                10222,
                10240
            ],
            [
                10240,
                10259
            ],
            [
                10259,
                10264
            ],
            [
                10264,
                10264
            ],
            [
                10264,
                10297
            ],
            [
                10297,
                10509
            ],
            [
                10509,
                10555
            ],
            [
                10555,
                10606
            ],
            [
                10606,
                10663
            ],
            [
                10663,
                10680
            ],
            [
                10680,
                10689
            ],
            [
                10689,
                10706
            ],
            [
                10706,
                10723
            ],
            [
                10723,
                10806
            ],
            [
                10806,
                10806
            ],
            [
                10806,
                10806
            ],
            [
                10806,
                10842
            ],
            [
                10842,
                10849
            ],
            [
                10849,
                10889
            ],
            [
                10889,
                10916
            ],
            [
                10916,
                10963
            ],
            [
                10963,
                11021
            ],
            [
                11021,
                11140
            ],
            [
                11140,
                11236
            ],
            [
                11236,
                11279
            ],
            [
                11279,
                11363
            ],
            [
                11363,
                11417
            ],
            [
                11417,
                11518
            ],
            [
                11518,
                11629
            ],
            [
                11629,
                11810
            ],
            [
                11810,
                11887
            ],
            [
                11887,
                12080
            ],
            [
                12080,
                12194
            ],
            [
                12194,
                12235
            ],
            [
                12235,
                12337
            ]
        ]
    }
}