{
    "original": {
        "text": "It was not so easy as it had appeared at first to arrange for Richard's making a trial of Mr. Kenge's office. Richard himself was the chief impediment. As soon as he had it in his power to leave Mr. Badger at any moment, he began to doubt whether he wanted to leave him at all. He didn't know, he said, really. It wasn't a bad profession; he couldn't assert that he disliked it; perhaps he liked it as well as he liked any other--suppose he gave it one more chance! Upon that, he shut himself up for a few weeks with some books and some bones and seemed to acquire a considerable fund of information with great rapidity. His fervour, after lasting about a month, began to cool, and when it was quite cooled, began to grow warm again. His vacillations between law and medicine lasted so long that midsummer arrived before he finally separated from Mr. Badger and entered on an experimental course of Messrs. Kenge and Carboy. For all his waywardness, he took great credit to himself as being determined to be in earnest \"this time.\" And he was so good-natured throughout, and in such high spirits, and so fond of Ada, that it was very difficult indeed to be otherwise than pleased with him.\n\"As to Mr. Jarndyce,\" who, I may mention, found the wind much given, during this period, to stick in the east; \"As to Mr. Jarndyce,\" Richard would say to me, \"he is the finest fellow in the world, Esther! I must be particularly careful, if it were only for his satisfaction, to take myself well to task and have a regular wind-up of this business now.\"\nThe idea of his taking himself well to task, with that laughing face and heedless manner and with a fancy that everything could catch and nothing could hold, was ludicrously anomalous. However, he told us between-whiles that he was doing it to such an extent that he wondered his hair didn't turn grey. His regular wind-up of the business was (as I have said) that he went to Mr. Kenge's about midsummer to try how he liked it.\nAll this time he was, in money affairs, what I have described him in a former illustration--generous, profuse, wildly careless, but fully persuaded that he was rather calculating and prudent. I happened to say to Ada, in his presence, half jestingly, half seriously, about the time of his going to Mr. Kenge's, that he needed to have Fortunatus' purse, he made so light of money, which he answered in this way, \"My jewel of a dear cousin, you hear this old woman! Why does she say that? Because I gave eight pounds odd (or whatever it was) for a certain neat waistcoat and buttons a few days ago. Now, if I had stayed at Badger's I should have been obliged to spend twelve pounds at a blow for some heart-breaking lecture-fees. So I make four pounds--in a lump--by the transaction!\"\nIt was a question much discussed between him and my guardian what arrangements should be made for his living in London while he experimented on the law, for we had long since gone back to Bleak House, and it was too far off to admit of his coming there oftener than once a week. My guardian told me that if Richard were to settle down at Mr. Kenge's he would take some apartments or chambers where we too could occasionally stay for a few days at a time; \"but, little woman,\" he added, rubbing his head very significantly, \"he hasn't settled down there yet!\" The discussions ended in our hiring for him, by the month, a neat little furnished lodging in a quiet old house near Queen Square. He immediately began to spend all the money he had in buying the oddest little ornaments and luxuries for this lodging; and so often as Ada and I dissuaded him from making any purchase that he had in contemplation which was particularly unnecessary and expensive, he took credit for what it would have cost and made out that to spend anything less on something else was to save the difference.\nWhile these affairs were in abeyance, our visit to Mr. Boythorn's was postponed. At length, Richard having taken possession of his lodging, there was nothing to prevent our departure. He could have gone with us at that time of the year very well, but he was in the full novelty of his new position and was making most energetic attempts to unravel the mysteries of the fatal suit. Consequently we went without him, and my darling was delighted to praise him for being so busy.\nWe made a pleasant journey down into Lincolnshire by the coach and had an entertaining companion in Mr. Skimpole. His furniture had been all cleared off, it appeared, by the person who took possession of it on his blue-eyed daughter's birthday, but he seemed quite relieved to think that it was gone. Chairs and table, he said, were wearisome objects; they were monotonous ideas, they had no variety of expression, they looked you out of countenance, and you looked them out of countenance. How pleasant, then, to be bound to no particular chairs and tables, but to sport like a butterfly among all the furniture on hire, and to flit from rosewood to mahogany, and from mahogany to walnut, and from this shape to that, as the humour took one!\n\"The oddity of the thing is,\" said Mr. Skimpole with a quickened sense of the ludicrous, \"that my chairs and tables were not paid for, and yet my landlord walks off with them as composedly as possible. Now, that seems droll! There is something grotesque in it. The chair and table merchant never engaged to pay my landlord my rent. Why should my landlord quarrel with HIM? If I have a pimple on my nose which is disagreeable to my landlord's peculiar ideas of beauty, my landlord has no business to scratch my chair and table merchant's nose, which has no pimple on it. His reasoning seems defective!\"\n\"Well,\" said my guardian good-humouredly, \"it's pretty clear that whoever became security for those chairs and tables will have to pay for them.\"\n\"Exactly!\" returned Mr. Skimpole. \"That's the crowning point of unreason in the business! I said to my landlord, 'My good man, you are not aware that my excellent friend Jarndyce will have to pay for those things that you are sweeping off in that indelicate manner. Have you no consideration for HIS property?' He hadn't the least.\"\n\"And refused all proposals,\" said my guardian.\n\"Refused all proposals,\" returned Mr. Skimpole. \"I made him business proposals. I had him into my room. I said, 'You are a man of business, I believe?' He replied, 'I am,' 'Very well,' said I, 'now let us be business-like. Here is an inkstand, here are pens and paper, here are wafers. What do you want? I have occupied your house for a considerable period, I believe to our mutual satisfaction until this unpleasant misunderstanding arose; let us be at once friendly and business-like. What do you want?' In reply to this, he made use of the figurative expression--which has something Eastern about it--that he had never seen the colour of my money. 'My amiable friend,' said I, 'I never have any money. I never know anything about money.' 'Well, sir,' said he, 'what do you offer if I give you time?' 'My good fellow,' said I, 'I have no idea of time; but you say you are a man of business, and whatever you can suggest to be done in a business-like way with pen, and ink, and paper--and wafers--I am ready to do. Don't pay yourself at another man's expense (which is foolish), but be business-like!' However, he wouldn't be, and there was an end of it.\"\nIf these were some of the inconveniences of Mr. Skimpole's childhood, it assuredly possessed its advantages too. On the journey he had a very good appetite for such refreshment as came in our way (including a basket of choice hothouse peaches), but never thought of paying for anything. So when the coachman came round for his fee, he pleasantly asked him what he considered a very good fee indeed, now--a liberal one--and on his replying half a crown for a single passenger, said it was little enough too, all things considered, and left Mr. Jarndyce to give it him.\nIt was delightful weather. The green corn waved so beautifully, the larks sang so joyfully, the hedges were so full of wild flowers, the trees were so thickly out in leaf, the bean-fields, with a light wind blowing over them, filled the air with such a delicious fragrance! Late in the afternoon we came to the market-town where we were to alight from the coach--a dull little town with a church-spire, and a marketplace, and a market-cross, and one intensely sunny street, and a pond with an old horse cooling his legs in it, and a very few men sleepily lying and standing about in narrow little bits of shade. After the rustling of the leaves and the waving of the corn all along the road, it looked as still, as hot, as motionless a little town as England could produce.\nAt the inn we found Mr. Boythorn on horseback, waiting with an open carriage to take us to his house, which was a few miles off. He was overjoyed to see us and dismounted with great alacrity.\n\"By heaven!\" said he after giving us a courteous greeting. \"This a most infamous coach. It is the most flagrant example of an abominable public vehicle that ever encumbered the face of the earth. It is twenty-five minutes after its time this afternoon. The coachman ought to be put to death!\"\n\"IS he after his time?\" said Mr. Skimpole, to whom he happened to address himself. \"You know my infirmity.\"\n\"Twenty-five minutes! Twenty-six minutes!\" replied Mr. Boythorn, referring to his watch. \"With two ladies in the coach, this scoundrel has deliberately delayed his arrival six and twenty minutes. Deliberately! It is impossible that it can be accidental! But his father--and his uncle--were the most profligate coachmen that ever sat upon a box.\"\nWhile he said this in tones of the greatest indignation, he handed us into the little phaeton with the utmost gentleness and was all smiles and pleasure.\n\"I am sorry, ladies,\" he said, standing bare-headed at the carriage-door when all was ready, \"that I am obliged to conduct you nearly two miles out of the way. But our direct road lies through Sir Leicester Dedlock's park, and in that fellow's property I have sworn never to set foot of mine, or horse's foot of mine, pending the present relations between us, while I breathe the breath of life!\" And here, catching my guardian's eye, he broke into one of his tremendous laughs, which seemed to shake even the motionless little market-town.\n\"Are the Dedlocks down here, Lawrence?\" said my guardian as we drove along and Mr. Boythorn trotted on the green turf by the roadside.\n\"Sir Arrogant Numskull is here,\" replied Mr. Boythorn. \"Ha ha ha! Sir Arrogant is here, and I am glad to say, has been laid by the heels here. My Lady,\" in naming whom he always made a courtly gesture as if particularly to exclude her from any part in the quarrel, \"is expected, I believe, daily. I am not in the least surprised that she postpones her appearance as long as possible. Whatever can have induced that transcendent woman to marry that effigy and figure-head of a baronet is one of the most impenetrable mysteries that ever baffled human inquiry. Ha ha ha ha!\"\n\"I suppose,\" said my guardian, laughing, \"WE may set foot in the park while we are here? The prohibition does not extend to us, does it?\"\n\"I can lay no prohibition on my guests,\" he said, bending his head to Ada and me with the smiling politeness which sat so gracefully upon him, \"except in the matter of their departure. I am only sorry that I cannot have the happiness of being their escort about Chesney Wold, which is a very fine place! But by the light of this summer day, Jarndyce, if you call upon the owner while you stay with me, you are likely to have but a cool reception. He carries himself like an eight-day clock at all times, like one of a race of eight-day clocks in gorgeous cases that never go and never went--Ha ha ha!--but he will have some extra stiffness, I can promise you, for the friends of his friend and neighbour Boythorn!\"\n\"I shall not put him to the proof,\" said my guardian. \"He is as indifferent to the honour of knowing me, I dare say, as I am to the honour of knowing him. The air of the grounds and perhaps such a view of the house as any other sightseer might get are quite enough for me.\"\n\"Well!\" said Mr. Boythorn. \"I am glad of it on the whole. It's in better keeping. I am looked upon about here as a second Ajax defying the lightning. Ha ha ha ha! When I go into our little church on a Sunday, a considerable part of the inconsiderable congregation expect to see me drop, scorched and withered, on the pavement under the Dedlock displeasure. Ha ha ha ha! I have no doubt he is surprised that I don't. For he is, by heaven, the most self-satisfied, and the shallowest, and the most coxcombical and utterly brainless ass!\"\nOur coming to the ridge of a hill we had been ascending enabled our friend to point out Chesney Wold itself to us and diverted his attention from its master.\nIt was a picturesque old house in a fine park richly wooded. Among the trees and not far from the residence he pointed out the spire of the little church of which he had spoken. Oh, the solemn woods over which the light and shadow travelled swiftly, as if heavenly wings were sweeping on benignant errands through the summer air; the smooth green slopes, the glittering water, the garden where the flowers were so symmetrically arranged in clusters of the richest colours, how beautiful they looked! The house, with gable and chimney, and tower, and turret, and dark doorway, and broad terrace-walk, twining among the balustrades of which, and lying heaped upon the vases, there was one great flush of roses, seemed scarcely real in its light solidity and in the serene and peaceful hush that rested on all around it. To Ada and to me, that above all appeared the pervading influence. On everything, house, garden, terrace, green slopes, water, old oaks, fern, moss, woods again, and far away across the openings in the prospect to the distance lying wide before us with a purple bloom upon it, there seemed to be such undisturbed repose.\nWhen we came into the little village and passed a small inn with the sign of the Dedlock Arms swinging over the road in front, Mr. Boythorn interchanged greetings with a young gentleman sitting on a bench outside the inn-door who had some fishing-tackle lying beside him.\n\"That's the housekeeper's grandson, Mr. Rouncewell by name,\" said, he, \"and he is in love with a pretty girl up at the house. Lady Dedlock has taken a fancy to the pretty girl and is going to keep her about her own fair person--an honour which my young friend himself does not at all appreciate. However, he can't marry just yet, even if his Rosebud were willing; so he is fain to make the best of it. In the meanwhile, he comes here pretty often for a day or two at a time to--fish. Ha ha ha ha!\"\n\"Are he and the pretty girl engaged, Mr. Boythorn?\" asked Ada.\n\"Why, my dear Miss Clare,\" he returned, \"I think they may perhaps understand each other; but you will see them soon, I dare say, and I must learn from you on such a point--not you from me.\"\nAda blushed, and Mr. Boythorn, trotting forward on his comely grey horse, dismounted at his own door and stood ready with extended arm and uncovered head to welcome us when we arrived.\nHe lived in a pretty house, formerly the parsonage house, with a lawn in front, a bright flower-garden at the side, and a well-stocked orchard and kitchen-garden in the rear, enclosed with a venerable wall that had of itself a ripened ruddy look. But, indeed, everything about the place wore an aspect of maturity and abundance. The old lime-tree walk was like green cloisters, the very shadows of the cherry-trees and apple-trees were heavy with fruit, the gooseberry-bushes were so laden that their branches arched and rested on the earth, the strawberries and raspberries grew in like profusion, and the peaches basked by the hundred on the wall. Tumbled about among the spread nets and the glass frames sparkling and winking in the sun there were such heaps of drooping pods, and marrows, and cucumbers, that every foot of ground appeared a vegetable treasury, while the smell of sweet herbs and all kinds of wholesome growth (to say nothing of the neighbouring meadows where the hay was carrying) made the whole air a great nosegay. Such stillness and composure reigned within the orderly precincts of the old red wall that even the feathers hung in garlands to scare the birds hardly stirred; and the wall had such a ripening influence that where, here and there high up, a disused nail and scrap of list still clung to it, it was easy to fancy that they had mellowed with the changing seasons and that they had rusted and decayed according to the common fate.\nThe house, though a little disorderly in comparison with the garden, was a real old house with settles in the chimney of the brick-floored kitchen and great beams across the ceilings. On one side of it was the terrible piece of ground in dispute, where Mr. Boythorn maintained a sentry in a smock-frock day and night, whose duty was supposed to be, in cases of aggression, immediately to ring a large bell hung up there for the purpose, to unchain a great bull-dog established in a kennel as his ally, and generally to deal destruction on the enemy. Not content with these precautions, Mr. Boythorn had himself composed and posted there, on painted boards to which his name was attached in large letters, the following solemn warnings: \"Beware of the bull-dog. He is most ferocious. Lawrence Boythorn.\" \"The blunderbus is loaded with slugs. Lawrence Boythorn.\" \"Man-traps and spring-guns are set here at all times of the day and night. Lawrence Boythorn.\" \"Take notice. That any person or persons audaciously presuming to trespass on this property will be punished with the utmost severity of private chastisement and prosecuted with the utmost rigour of the law. Lawrence Boythorn.\" These he showed us from the drawing-room window, while his bird was hopping about his head, and he laughed, \"Ha ha ha ha! Ha ha ha ha!\" to that extent as he pointed them out that I really thought he would have hurt himself.\n\"But this is taking a good deal of trouble,\" said Mr. Skimpole in his light way, \"when you are not in earnest after all.\"\n\"Not in earnest!\" returned Mr. Boythorn with unspeakable warmth. \"Not in earnest! If I could have hoped to train him, I would have bought a lion instead of that dog and would have turned him loose upon the first intolerable robber who should dare to make an encroachment on my rights. Let Sir Leicester Dedlock consent to come out and decide this question by single combat, and I will meet him with any weapon known to mankind in any age or country. I am that much in earnest. Not more!\"\nWe arrived at his house on a Saturday. On the Sunday morning we all set forth to walk to the little church in the park. Entering the park, almost immediately by the disputed ground, we pursued a pleasant footpath winding among the verdant turf and the beautiful trees until it brought us to the church-porch.\nThe congregation was extremely small and quite a rustic one with the exception of a large muster of servants from the house, some of whom were already in their seats, while others were yet dropping in. There were some stately footmen, and there was a perfect picture of an old coachman, who looked as if he were the official representative of all the pomps and vanities that had ever been put into his coach. There was a very pretty show of young women, and above them, the handsome old face and fine responsible portly figure of the housekeeper towered pre-eminent. The pretty girl of whom Mr. Boythorn had told us was close by her. She was so very pretty that I might have known her by her beauty even if I had not seen how blushingly conscious she was of the eyes of the young fisherman, whom I discovered not far off. One face, and not an agreeable one, though it was handsome, seemed maliciously watchful of this pretty girl, and indeed of every one and everything there. It was a Frenchwoman's.\nAs the bell was yet ringing and the great people were not yet come, I had leisure to glance over the church, which smelt as earthy as a grave, and to think what a shady, ancient, solemn little church it was. The windows, heavily shaded by trees, admitted a subdued light that made the faces around me pale, and darkened the old brasses in the pavement and the time and damp-worn monuments, and rendered the sunshine in the little porch, where a monotonous ringer was working at the bell, inestimably bright. But a stir in that direction, a gathering of reverential awe in the rustic faces, and a blandly ferocious assumption on the part of Mr. Boythorn of being resolutely unconscious of somebody's existence forewarned me that the great people were come and that the service was going to begin.\n\"'Enter not into judgment with thy servant, O Lord, for in thy sight--'\"\nShall I ever forget the rapid beating at my heart, occasioned by the look I met as I stood up! Shall I ever forget the manner in which those handsome proud eyes seemed to spring out of their languor and to hold mine! It was only a moment before I cast mine down--released again, if I may say so--on my book; but I knew the beautiful face quite well in that short space of time.\nAnd, very strangely, there was something quickened within me, associated with the lonely days at my godmother's; yes, away even to the days when I had stood on tiptoe to dress myself at my little glass after dressing my doll. And this, although I had never seen this lady's face before in all my life--I was quite sure of it--absolutely certain.\nIt was easy to know that the ceremonious, gouty, grey-haired gentleman, the only other occupant of the great pew, was Sir Leicester Dedlock, and that the lady was Lady Dedlock. But why her face should be, in a confused way, like a broken glass to me, in which I saw scraps of old remembrances, and why I should be so fluttered and troubled (for I was still) by having casually met her eyes, I could not think.\nI felt it to be an unmeaning weakness in me and tried to overcome it by attending to the words I heard. Then, very strangely, I seemed to hear them, not in the reader's voice, but in the well-remembered voice of my godmother. This made me think, did Lady Dedlock's face accidentally resemble my godmother's? It might be that it did, a little; but the expression was so different, and the stern decision which had worn into my godmother's face, like weather into rocks, was so completely wanting in the face before me that it could not be that resemblance which had struck me. Neither did I know the loftiness and haughtiness of Lady Dedlock's face, at all, in any one. And yet I--I, little Esther Summerson, the child who lived a life apart and on whose birthday there was no rejoicing--seemed to arise before my own eyes, evoked out of the past by some power in this fashionable lady, whom I not only entertained no fancy that I had ever seen, but whom I perfectly well knew I had never seen until that hour.\nIt made me tremble so to be thrown into this unaccountable agitation that I was conscious of being distressed even by the observation of the French maid, though I knew she had been looking watchfully here, and there, and everywhere, from the moment of her coming into the church. By degrees, though very slowly, I at last overcame my strange emotion. After a long time, I looked towards Lady Dedlock again. It was while they were preparing to sing, before the sermon. She took no heed of me, and the beating at my heart was gone. Neither did it revive for more than a few moments when she once or twice afterwards glanced at Ada or at me through her glass.\nThe service being concluded, Sir Leicester gave his arm with much taste and gallantry to Lady Dedlock--though he was obliged to walk by the help of a thick stick--and escorted her out of church to the pony carriage in which they had come. The servants then dispersed, and so did the congregation, whom Sir Leicester had contemplated all along (Mr. Skimpole said to Mr. Boythorn's infinite delight) as if he were a considerable landed proprietor in heaven.\n\"He believes he is!\" said Mr. Boythorn. \"He firmly believes it. So did his father, and his grandfather, and his great-grandfather!\"\n\"Do you know,\" pursued Mr. Skimpole very unexpectedly to Mr. Boythorn, \"it's agreeable to me to see a man of that sort.\"\n\"IS it!\" said Mr. Boythorn.\n\"Say that he wants to patronize me,\" pursued Mr. Skimpole. \"Very well! I don't object.\"\n\"I do,\" said Mr. Boythorn with great vigour.\n\"Do you really?\" returned Mr. Skimpole in his easy light vein. \"But that's taking trouble, surely. And why should you take trouble? Here am I, content to receive things childishly as they fall out, and I never take trouble! I come down here, for instance, and I find a mighty potentate exacting homage. Very well! I say 'Mighty potentate, here IS my homage! It's easier to give it than to withhold it. Here it is. If you have anything of an agreeable nature to show me, I shall be happy to see it; if you have anything of an agreeable nature to give me, I shall be happy to accept it.' Mighty potentate replies in effect, 'This is a sensible fellow. I find him accord with my digestion and my bilious system. He doesn't impose upon me the necessity of rolling myself up like a hedgehog with my points outward. I expand, I open, I turn my silver lining outward like Milton's cloud, and it's more agreeable to both of us.' That's my view of such things, speaking as a child!\"\n\"But suppose you went down somewhere else to-morrow,\" said Mr. Boythorn, \"where there was the opposite of that fellow--or of this fellow. How then?\"\n\"How then?\" said Mr. Skimpole with an appearance of the utmost simplicity and candour. \"Just the same then! I should say, 'My esteemed Boythorn'--to make you the personification of our imaginary friend--'my esteemed Boythorn, you object to the mighty potentate? Very good. So do I. I take it that my business in the social system is to be agreeable; I take it that everybody's business in the social system is to be agreeable. It's a system of harmony, in short. Therefore if you object, I object. Now, excellent Boythorn, let us go to dinner!'\"\n\"But excellent Boythorn might say,\" returned our host, swelling and growing very red, \"I'll be--\"\n\"I understand,\" said Mr. Skimpole. \"Very likely he would.\"\n\"--if I WILL go to dinner!\" cried Mr. Boythorn in a violent burst and stopping to strike his stick upon the ground. \"And he would probably add, 'Is there such a thing as principle, Mr. Harold Skimpole?'\"\n\"To which Harold Skimpole would reply, you know,\" he returned in his gayest manner and with his most ingenuous smile, \"'Upon my life I have not the least idea! I don't know what it is you call by that name, or where it is, or who possesses it. If you possess it and find it comfortable, I am quite delighted and congratulate you heartily. But I know nothing about it, I assure you; for I am a mere child, and I lay no claim to it, and I don't want it!' So, you see, excellent Boythorn and I would go to dinner after all!\"\nThis was one of many little dialogues between them which I always expected to end, and which I dare say would have ended under other circumstances, in some violent explosion on the part of our host. But he had so high a sense of his hospitable and responsible position as our entertainer, and my guardian laughed so sincerely at and with Mr. Skimpole, as a child who blew bubbles and broke them all day long, that matters never went beyond this point. Mr. Skimpole, who always seemed quite unconscious of having been on delicate ground, then betook himself to beginning some sketch in the park which he never finished, or to playing fragments of airs on the piano, or to singing scraps of songs, or to lying down on his back under a tree and looking at the sky--which he couldn't help thinking, he said, was what he was meant for; it suited him so exactly.\n\"Enterprise and effort,\" he would say to us (on his back), \"are delightful to me. I believe I am truly cosmopolitan. I have the deepest sympathy with them. I lie in a shady place like this and think of adventurous spirits going to the North Pole or penetrating to the heart of the Torrid Zone with admiration. Mercenary creatures ask, 'What is the use of a man's going to the North Pole? What good does it do?' I can't say; but, for anything I CAN say, he may go for the purpose--though he don't know it--of employing my thoughts as I lie here. Take an extreme case. Take the case of the slaves on American plantations. I dare say they are worked hard, I dare say they don't altogether like it. I dare say theirs is an unpleasant experience on the whole; but they people the landscape for me, they give it a poetry for me, and perhaps that is one of the pleasanter objects of their existence. I am very sensible of it, if it be, and I shouldn't wonder if it were!\"\nI always wondered on these occasions whether he ever thought of Mrs. Skimpole and the children, and in what point of view they presented themselves to his cosmopolitan mind. So far as I could understand, they rarely presented themselves at all.\nThe week had gone round to the Saturday following that beating of my heart in the church; and every day had been so bright and blue that to ramble in the woods, and to see the light striking down among the transparent leaves and sparkling in the beautiful interlacings of the shadows of the trees, while the birds poured out their songs and the air was drowsy with the hum of insects, had been most delightful. We had one favourite spot, deep in moss and last year's leaves, where there were some felled trees from which the bark was all stripped off. Seated among these, we looked through a green vista supported by thousands of natural columns, the whitened stems of trees, upon a distant prospect made so radiant by its contrast with the shade in which we sat and made so precious by the arched perspective through which we saw it that it was like a glimpse of the better land. Upon the Saturday we sat here, Mr. Jarndyce, Ada, and I, until we heard thunder muttering in the distance and felt the large raindrops rattle through the leaves.\nThe weather had been all the week extremely sultry, but the storm broke so suddenly--upon us, at least, in that sheltered spot--that before we reached the outskirts of the wood the thunder and lightning were frequent and the rain came plunging through the leaves as if every drop were a great leaden bead. As it was not a time for standing among trees, we ran out of the wood, and up and down the moss-grown steps which crossed the plantation-fence like two broad-staved ladders placed back to back, and made for a keeper's lodge which was close at hand. We had often noticed the dark beauty of this lodge standing in a deep twilight of trees, and how the ivy clustered over it, and how there was a steep hollow near, where we had once seen the keeper's dog dive down into the fern as if it were water.\nThe lodge was so dark within, now the sky was overcast, that we only clearly saw the man who came to the door when we took shelter there and put two chairs for Ada and me. The lattice-windows were all thrown open, and we sat just within the doorway watching the storm. It was grand to see how the wind awoke, and bent the trees, and drove the rain before it like a cloud of smoke; and to hear the solemn thunder and to see the lightning; and while thinking with awe of the tremendous powers by which our little lives are encompassed, to consider how beneficent they are and how upon the smallest flower and leaf there was already a freshness poured from all this seeming rage which seemed to make creation new again.\n\"Is it not dangerous to sit in so exposed a place?\"\n\"Oh, no, Esther dear!\" said Ada quietly.\nAda said it to me, but I had not spoken.\nThe beating of my heart came back again. I had never heard the voice, as I had never seen the face, but it affected me in the same strange way. Again, in a moment, there arose before my mind innumerable pictures of myself.\nLady Dedlock had taken shelter in the lodge before our arrival there and had come out of the gloom within. She stood behind my chair with her hand upon it. I saw her with her hand close to my shoulder when I turned my head.\n\"I have frightened you?\" she said.\nNo. It was not fright. Why should I be frightened!\n\"I believe,\" said Lady Dedlock to my guardian, \"I have the pleasure of speaking to Mr. Jarndyce.\"\n\"Your remembrance does me more honour than I had supposed it would, Lady Dedlock,\" he returned.\n\"I recognized you in church on Sunday. I am sorry that any local disputes of Sir Leicester's--they are not of his seeking, however, I believe--should render it a matter of some absurd difficulty to show you any attention here.\"\n\"I am aware of the circumstances,\" returned my guardian with a smile, \"and am sufficiently obliged.\"\nShe had given him her hand in an indifferent way that seemed habitual to her and spoke in a correspondingly indifferent manner, though in a very pleasant voice. She was as graceful as she was beautiful, perfectly self-possessed, and had the air, I thought, of being able to attract and interest any one if she had thought it worth her while. The keeper had brought her a chair on which she sat in the middle of the porch between us.\n\"Is the young gentleman disposed of whom you wrote to Sir Leicester about and whose wishes Sir Leicester was sorry not to have it in his power to advance in any way?\" she said over her shoulder to my guardian.\n\"I hope so,\" said he.\nShe seemed to respect him and even to wish to conciliate him. There was something very winning in her haughty manner, and it became more familiar--I was going to say more easy, but that could hardly be--as she spoke to him over her shoulder.\n\"I presume this is your other ward, Miss Clare?\"\nHe presented Ada, in form.\n\"You will lose the disinterested part of your Don Quixote character,\" said Lady Dedlock to Mr. Jarndyce over her shoulder again, \"if you only redress the wrongs of beauty like this. But present me,\" and she turned full upon me, \"to this young lady too!\"\n\"Miss Summerson really is my ward,\" said Mr. Jarndyce. \"I am responsible to no Lord Chancellor in her case.\"\n\"Has Miss Summerson lost both her parents?\" said my Lady.\n\"Yes.\"\n\"She is very fortunate in her guardian.\"\nLady Dedlock looked at me, and I looked at her and said I was indeed. All at once she turned from me with a hasty air, almost expressive of displeasure or dislike, and spoke to him over her shoulder again.\n\"Ages have passed since we were in the habit of meeting, Mr. Jarndyce.\"\n\"A long time. At least I thought it was a long time, until I saw you last Sunday,\" he returned.\n\"What! Even you are a courtier, or think it necessary to become one to me!\" she said with some disdain. \"I have achieved that reputation, I suppose.\"\n\"You have achieved so much, Lady Dedlock,\" said my guardian, \"that you pay some little penalty, I dare say. But none to me.\"\n\"So much!\" she repeated, slightly laughing. \"Yes!\"\nWith her air of superiority, and power, and fascination, and I know not what, she seemed to regard Ada and me as little more than children. So, as she slightly laughed and afterwards sat looking at the rain, she was as self-possessed and as free to occupy herself with her own thoughts as if she had been alone.\n\"I think you knew my sister when we were abroad together better than you know me?\" she said, looking at him again.\n\"Yes, we happened to meet oftener,\" he returned.\n\"We went our several ways,\" said Lady Dedlock, \"and had little in common even before we agreed to differ. It is to be regretted, I suppose, but it could not be helped.\"\nLady Dedlock again sat looking at the rain. The storm soon began to pass upon its way. The shower greatly abated, the lightning ceased, the thunder rolled among the distant hills, and the sun began to glisten on the wet leaves and the falling rain. As we sat there, silently, we saw a little pony phaeton coming towards us at a merry pace.\n\"The messenger is coming back, my Lady,\" said the keeper, \"with the carriage.\"\nAs it drove up, we saw that there were two people inside. There alighted from it, with some cloaks and wrappers, first the Frenchwoman whom I had seen in church, and secondly the pretty girl, the Frenchwoman with a defiant confidence, the pretty girl confused and hesitating.\n\"What now?\" said Lady Dedlock. \"Two!\"\n\"I am your maid, my Lady, at the present,\" said the Frenchwoman. \"The message was for the attendant.\"\n\"I was afraid you might mean me, my Lady,\" said the pretty girl.\n\"I did mean you, child,\" replied her mistress calmly. \"Put that shawl on me.\"\nShe slightly stooped her shoulders to receive it, and the pretty girl lightly dropped it in its place. The Frenchwoman stood unnoticed, looking on with her lips very tightly set.\n\"I am sorry,\" said Lady Dedlock to Mr. Jarndyce, \"that we are not likely to renew our former acquaintance. You will allow me to send the carriage back for your two wards. It shall be here directly.\"\nBut as he would on no account accept this offer, she took a graceful leave of Ada--none of me--and put her hand upon his proffered arm, and got into the carriage, which was a little, low, park carriage with a hood.\n\"Come in, child,\" she said to the pretty girl; \"I shall want you. Go on!\"\nThe carriage rolled away, and the Frenchwoman, with the wrappers she had brought hanging over her arm, remained standing where she had alighted.\nI suppose there is nothing pride can so little bear with as pride itself, and that she was punished for her imperious manner. Her retaliation was the most singular I could have imagined. She remained perfectly still until the carriage had turned into the drive, and then, without the least discomposure of countenance, slipped off her shoes, left them on the ground, and walked deliberately in the same direction through the wettest of the wet grass.\n\"Is that young woman mad?\" said my guardian.\n\"Oh, no, sir!\" said the keeper, who, with his wife, was looking after her. \"Hortense is not one of that sort. She has as good a head-piece as the best. But she's mortal high and passionate--powerful high and passionate; and what with having notice to leave, and having others put above her, she don't take kindly to it.\"\n\"But why should she walk shoeless through all that water?\" said my guardian.\n\"Why, indeed, sir, unless it is to cool her down!\" said the man.\n\"Or unless she fancies it's blood,\" said the woman. \"She'd as soon walk through that as anything else, I think, when her own's up!\"\nWe passed not far from the house a few minutes afterwards. Peaceful as it had looked when we first saw it, it looked even more so now, with a diamond spray glittering all about it, a light wind blowing, the birds no longer hushed but singing strongly, everything refreshed by the late rain, and the little carriage shining at the doorway like a fairy carriage made of silver. Still, very steadfastly and quietly walking towards it, a peaceful figure too in the landscape, went Mademoiselle Hortense, shoeless, through the wet grass.",
        "paragraph_chars": [
            [
                0,
                1190
            ],
            [
                1190,
                1543
            ],
            [
                1543,
                1971
            ],
            [
                1971,
                2754
            ],
            [
                2754,
                3838
            ],
            [
                3838,
                4315
            ],
            [
                4315,
                5058
            ],
            [
                5058,
                5660
            ],
            [
                5660,
                5806
            ],
            [
                5806,
                6139
            ],
            [
                6139,
                6186
            ],
            [
                6186,
                7343
            ],
            [
                7343,
                7911
            ],
            [
                7911,
                8685
            ],
            [
                8685,
                8877
            ],
            [
                8877,
                9170
            ],
            [
                9170,
                9278
            ],
            [
                9278,
                9624
            ],
            [
                9624,
                9778
            ],
            [
                9778,
                10319
            ],
            [
                10319,
                10454
            ],
            [
                10454,
                11027
            ],
            [
                11027,
                11165
            ],
            [
                11165,
                11880
            ],
            [
                11880,
                12154
            ],
            [
                12154,
                12690
            ],
            [
                12690,
                12848
            ],
            [
                12848,
                13987
            ],
            [
                13987,
                14259
            ],
            [
                14259,
                14757
            ],
            [
                14757,
                14820
            ],
            [
                14820,
                15010
            ],
            [
                15010,
                15195
            ],
            [
                15195,
                16662
            ],
            [
                16662,
                18070
            ],
            [
                18070,
                18192
            ],
            [
                18192,
                18680
            ],
            [
                18680,
                18989
            ],
            [
                18989,
                19990
            ],
            [
                19990,
                20786
            ],
            [
                20786,
                20859
            ],
            [
                20859,
                21237
            ],
            [
                21237,
                21583
            ],
            [
                21583,
                21993
            ],
            [
                21993,
                23003
            ],
            [
                23003,
                23660
            ],
            [
                23660,
                24116
            ],
            [
                24116,
                24248
            ],
            [
                24248,
                24369
            ],
            [
                24369,
                24397
            ],
            [
                24397,
                24485
            ],
            [
                24485,
                24530
            ],
            [
                24530,
                25504
            ],
            [
                25504,
                25653
            ],
            [
                25653,
                26199
            ],
            [
                26199,
                26297
            ],
            [
                26297,
                26356
            ],
            [
                26356,
                26560
            ],
            [
                26560,
                27082
            ],
            [
                27082,
                27939
            ],
            [
                27939,
                28904
            ],
            [
                28904,
                29149
            ],
            [
                29149,
                30192
            ],
            [
                30192,
                30995
            ],
            [
                30995,
                31712
            ],
            [
                31712,
                31764
            ],
            [
                31764,
                31805
            ],
            [
                31805,
                31846
            ],
            [
                31846,
                32069
            ],
            [
                32069,
                32293
            ],
            [
                32293,
                32328
            ],
            [
                32328,
                32379
            ],
            [
                32379,
                32477
            ],
            [
                32477,
                32573
            ],
            [
                32573,
                32801
            ],
            [
                32801,
                32902
            ],
            [
                32902,
                33335
            ],
            [
                33335,
                33545
            ],
            [
                33545,
                33567
            ],
            [
                33567,
                33809
            ],
            [
                33809,
                33858
            ],
            [
                33858,
                33885
            ],
            [
                33885,
                34139
            ],
            [
                34139,
                34248
            ],
            [
                34248,
                34306
            ],
            [
                34306,
                34313
            ],
            [
                34313,
                34354
            ],
            [
                34354,
                34560
            ],
            [
                34560,
                34632
            ],
            [
                34632,
                34728
            ],
            [
                34728,
                34878
            ],
            [
                34878,
                35003
            ],
            [
                35003,
                35054
            ],
            [
                35054,
                35366
            ],
            [
                35366,
                35481
            ],
            [
                35481,
                35530
            ],
            [
                35530,
                35699
            ],
            [
                35699,
                36039
            ],
            [
                36039,
                36118
            ],
            [
                36118,
                36394
            ],
            [
                36394,
                36432
            ],
            [
                36432,
                36534
            ],
            [
                36534,
                36599
            ],
            [
                36599,
                36677
            ],
            [
                36677,
                36856
            ],
            [
                36856,
                37055
            ],
            [
                37055,
                37270
            ],
            [
                37270,
                37344
            ],
            [
                37344,
                37489
            ],
            [
                37489,
                37940
            ],
            [
                37940,
                37985
            ],
            [
                37985,
                38306
            ],
            [
                38306,
                38383
            ],
            [
                38383,
                38448
            ],
            [
                38448,
                38580
            ],
            [
                38580,
                39112
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                152
            ],
            [
                152,
                278
            ],
            [
                278,
                311
            ],
            [
                311,
                466
            ],
            [
                466,
                621
            ],
            [
                621,
                734
            ],
            [
                734,
                925
            ],
            [
                925,
                1032
            ],
            [
                1032,
                1190
            ],
            [
                1190,
                1395
            ],
            [
                1395,
                1543
            ],
            [
                1543,
                1728
            ],
            [
                1728,
                1846
            ],
            [
                1846,
                1971
            ],
            [
                1971,
                2163
            ],
            [
                2163,
                2435
            ],
            [
                2435,
                2458
            ],
            [
                2458,
                2568
            ],
            [
                2568,
                2699
            ],
            [
                2699,
                2754
            ],
            [
                2754,
                3033
            ],
            [
                3033,
                3313
            ],
            [
                3313,
                3444
            ],
            [
                3444,
                3838
            ],
            [
                3838,
                3919
            ],
            [
                3919,
                4022
            ],
            [
                4022,
                4219
            ],
            [
                4219,
                4315
            ],
            [
                4315,
                4429
            ],
            [
                4429,
                4616
            ],
            [
                4616,
                4806
            ],
            [
                4806,
                5058
            ],
            [
                5058,
                5260
            ],
            [
                5260,
                5283
            ],
            [
                5283,
                5319
            ],
            [
                5319,
                5390
            ],
            [
                5390,
                5431
            ],
            [
                5431,
                5628
            ],
            [
                5628,
                5660
            ],
            [
                5660,
                5806
            ],
            [
                5806,
                5817
            ],
            [
                5817,
                5840
            ],
            [
                5840,
                5896
            ],
            [
                5896,
                6072
            ],
            [
                6072,
                6117
            ],
            [
                6117,
                6139
            ],
            [
                6139,
                6186
            ],
            [
                6186,
                6234
            ],
            [
                6234,
                6266
            ],
            [
                6266,
                6290
            ],
            [
                6290,
                6338
            ],
            [
                6338,
                6409
            ],
            [
                6409,
                6472
            ],
            [
                6472,
                6490
            ],
            [
                6490,
                6673
            ],
            [
                6673,
                6692
            ],
            [
                6692,
                6837
            ],
            [
                6837,
                6891
            ],
            [
                6891,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                6989,
                7202
            ],
            [
                7202,
                7289
            ],
            [
                7289,
                7343
            ],
            [
                7343,
                7456
            ],
            [
                7456,
                7630
            ],
            [
                7630,
                7911
            ],
            [
                7911,
                7938
            ],
            [
                7938,
                8185
            ],
            [
                8185,
                8523
            ],
            [
                8523,
                8685
            ],
            [
                8685,
                8814
            ],
            [
                8814,
                8877
            ],
            [
                8877,
                8890
            ],
            [
                8890,
                8936
            ],
            [
                8936,
                8965
            ],
            [
                8965,
                9073
            ],
            [
                9073,
                9130
            ],
            [
                9130,
                9170
            ],
            [
                9170,
                9194
            ],
            [
                9194,
                9253
            ],
            [
                9253,
                9278
            ],
            [
                9278,
                9300
            ],
            [
                9300,
                9321
            ],
            [
                9321,
                9367
            ],
            [
                9367,
                9474
            ],
            [
                9474,
                9488
            ],
            [
                9488,
                9532
            ],
            [
                9532,
                9624
            ],
            [
                9624,
                9778
            ],
            [
                9778,
                9938
            ],
            [
                9938,
                10175
            ],
            [
                10175,
                10319
            ],
            [
                10319,
                10359
            ],
            [
                10359,
                10454
            ],
            [
                10454,
                10509
            ],
            [
                10509,
                10520
            ],
            [
                10520,
                10597
            ],
            [
                10597,
                10751
            ],
            [
                10751,
                10838
            ],
            [
                10838,
                11013
            ],
            [
                11013,
                11027
            ],
            [
                11027,
                11116
            ],
            [
                11116,
                11165
            ],
            [
                11165,
                11350
            ],
            [
                11350,
                11469
            ],
            [
                11469,
                11612
            ],
            [
                11612,
                11880
            ],
            [
                11880,
                11934
            ],
            [
                11934,
                12035
            ],
            [
                12035,
                12154
            ],
            [
                12154,
                12162
            ],
            [
                12162,
                12181
            ],
            [
                12181,
                12212
            ],
            [
                12212,
                12236
            ],
            [
                12236,
                12304
            ],
            [
                12304,
                12317
            ],
            [
                12317,
                12511
            ],
            [
                12511,
                12524
            ],
            [
                12524,
                12570
            ],
            [
                12570,
                12690
            ],
            [
                12690,
                12848
            ],
            [
                12848,
                12909
            ],
            [
                12909,
                13026
            ],
            [
                13026,
                13348
            ],
            [
                13348,
                13666
            ],
            [
                13666,
                13733
            ],
            [
                13733,
                13987
            ],
            [
                13987,
                14259
            ],
            [
                14259,
                14385
            ],
            [
                14385,
                14555
            ],
            [
                14555,
                14661
            ],
            [
                14661,
                14743
            ],
            [
                14743,
                14757
            ],
            [
                14757,
                14809
            ],
            [
                14809,
                14820
            ],
            [
                14820,
                15010
            ],
            [
                15010,
                15195
            ],
            [
                15195,
                15442
            ],
            [
                15442,
                15524
            ],
            [
                15524,
                15845
            ],
            [
                15845,
                16233
            ],
            [
                16233,
                16662
            ],
            [
                16662,
                16846
            ],
            [
                16846,
                17212
            ],
            [
                17212,
                17423
            ],
            [
                17423,
                17445
            ],
            [
                17445,
                17465
            ],
            [
                17465,
                17503
            ],
            [
                17503,
                17523
            ],
            [
                17523,
                17598
            ],
            [
                17598,
                17618
            ],
            [
                17618,
                17632
            ],
            [
                17632,
                17826
            ],
            [
                17826,
                17846
            ],
            [
                17846,
                17968
            ],
            [
                17968,
                17982
            ],
            [
                17982,
                18070
            ],
            [
                18070,
                18192
            ],
            [
                18192,
                18210
            ],
            [
                18210,
                18257
            ],
            [
                18257,
                18274
            ],
            [
                18274,
                18477
            ],
            [
                18477,
                18642
            ],
            [
                18642,
                18669
            ],
            [
                18669,
                18680
            ],
            [
                18680,
                18719
            ],
            [
                18719,
                18800
            ],
            [
                18800,
                18989
            ],
            [
                18989,
                19191
            ],
            [
                19191,
                19398
            ],
            [
                19398,
                19556
            ],
            [
                19556,
                19623
            ],
            [
                19623,
                19811
            ],
            [
                19811,
                19966
            ],
            [
                19966,
                19990
            ],
            [
                19990,
                20198
            ],
            [
                20198,
                20498
            ],
            [
                20498,
                20786
            ],
            [
                20786,
                20859
            ],
            [
                20859,
                20954
            ],
            [
                20954,
                21076
            ],
            [
                21076,
                21237
            ],
            [
                21237,
                21463
            ],
            [
                21463,
                21583
            ],
            [
                21583,
                21760
            ],
            [
                21760,
                21993
            ],
            [
                21993,
                22097
            ],
            [
                22097,
                22219
            ],
            [
                22219,
                22301
            ],
            [
                22301,
                22569
            ],
            [
                22569,
                22662
            ],
            [
                22662,
                23003
            ],
            [
                23003,
                23283
            ],
            [
                23283,
                23354
            ],
            [
                23354,
                23410
            ],
            [
                23410,
                23471
            ],
            [
                23471,
                23533
            ],
            [
                23533,
                23660
            ],
            [
                23660,
                23899
            ],
            [
                23899,
                24116
            ],
            [
                24116,
                24137
            ],
            [
                24137,
                24156
            ],
            [
                24156,
                24180
            ],
            [
                24180,
                24248
            ],
            [
                24248,
                24369
            ],
            [
                24369,
                24378
            ],
            [
                24378,
                24397
            ],
            [
                24397,
                24456
            ],
            [
                24456,
                24468
            ],
            [
                24468,
                24485
            ],
            [
                24485,
                24530
            ],
            [
                24530,
                24547
            ],
            [
                24547,
                24593
            ],
            [
                24593,
                24629
            ],
            [
                24629,
                24662
            ],
            [
                24662,
                24754
            ],
            [
                24754,
                24833
            ],
            [
                24833,
                24844
            ],
            [
                24844,
                24888
            ],
            [
                24888,
                24932
            ],
            [
                24932,
                24944
            ],
            [
                24944,
                25116
            ],
            [
                25116,
                25180
            ],
            [
                25180,
                25239
            ],
            [
                25239,
                25340
            ],
            [
                25340,
                25451
            ],
            [
                25451,
                25504
            ],
            [
                25504,
                25642
            ],
            [
                25642,
                25653
            ],
            [
                25653,
                25665
            ],
            [
                25665,
                25740
            ],
            [
                25740,
                25761
            ],
            [
                25761,
                25915
            ],
            [
                25915,
                25926
            ],
            [
                25926,
                26080
            ],
            [
                26080,
                26116
            ],
            [
                26116,
                26151
            ],
            [
                26151,
                26199
            ],
            [
                26199,
                26297
            ],
            [
                26297,
                26332
            ],
            [
                26332,
                26356
            ],
            [
                26356,
                26384
            ],
            [
                26384,
                26472
            ],
            [
                26472,
                26560
            ],
            [
                26560,
                26720
            ],
            [
                26720,
                26804
            ],
            [
                26804,
                26899
            ],
            [
                26899,
                27013
            ],
            [
                27013,
                27082
            ],
            [
                27082,
                27281
            ],
            [
                27281,
                27534
            ],
            [
                27534,
                27939
            ],
            [
                27939,
                28021
            ],
            [
                28021,
                28056
            ],
            [
                28056,
                28095
            ],
            [
                28095,
                28249
            ],
            [
                28249,
                28327
            ],
            [
                28327,
                28350
            ],
            [
                28350,
                28484
            ],
            [
                28484,
                28506
            ],
            [
                28506,
                28559
            ],
            [
                28559,
                28634
            ],
            [
                28634,
                28832
            ],
            [
                28832,
                28904
            ],
            [
                28904,
                29078
            ],
            [
                29078,
                29149
            ],
            [
                29149,
                29560
            ],
            [
                29560,
                29701
            ],
            [
                29701,
                30030
            ],
            [
                30030,
                30192
            ],
            [
                30192,
                30498
            ],
            [
                30498,
                30747
            ],
            [
                30747,
                30995
            ],
            [
                30995,
                31167
            ],
            [
                31167,
                31264
            ],
            [
                31264,
                31712
            ],
            [
                31712,
                31764
            ],
            [
                31764,
                31787
            ],
            [
                31787,
                31805
            ],
            [
                31805,
                31846
            ],
            [
                31846,
                31887
            ],
            [
                31887,
                31990
            ],
            [
                31990,
                32069
            ],
            [
                32069,
                32176
            ],
            [
                32176,
                32225
            ],
            [
                32225,
                32293
            ],
            [
                32293,
                32318
            ],
            [
                32318,
                32328
            ],
            [
                32328,
                32332
            ],
            [
                32332,
                32351
            ],
            [
                32351,
                32379
            ],
            [
                32379,
                32477
            ],
            [
                32477,
                32573
            ],
            [
                32573,
                32612
            ],
            [
                32612,
                32801
            ],
            [
                32801,
                32902
            ],
            [
                32902,
                33063
            ],
            [
                33063,
                33244
            ],
            [
                33244,
                33335
            ],
            [
                33335,
                33502
            ],
            [
                33502,
                33545
            ],
            [
                33545,
                33567
            ],
            [
                33567,
                33629
            ],
            [
                33629,
                33809
            ],
            [
                33809,
                33858
            ],
            [
                33858,
                33885
            ],
            [
                33885,
                34067
            ],
            [
                34067,
                34139
            ],
            [
                34139,
                34194
            ],
            [
                34194,
                34248
            ],
            [
                34248,
                34292
            ],
            [
                34292,
                34306
            ],
            [
                34306,
                34313
            ],
            [
                34313,
                34354
            ],
            [
                34354,
                34424
            ],
            [
                34424,
                34560
            ],
            [
                34560,
                34632
            ],
            [
                34632,
                34646
            ],
            [
                34646,
                34728
            ],
            [
                34728,
                34735
            ],
            [
                34735,
                34804
            ],
            [
                34804,
                34832
            ],
            [
                34832,
                34878
            ],
            [
                34878,
                34986
            ],
            [
                34986,
                35003
            ],
            [
                35003,
                35014
            ],
            [
                35014,
                35047
            ],
            [
                35047,
                35054
            ],
            [
                35054,
                35194
            ],
            [
                35194,
                35366
            ],
            [
                35366,
                35449
            ],
            [
                35449,
                35481
            ],
            [
                35481,
                35530
            ],
            [
                35530,
                35636
            ],
            [
                35636,
                35699
            ],
            [
                35699,
                35743
            ],
            [
                35743,
                35786
            ],
            [
                35786,
                35948
            ],
            [
                35948,
                36039
            ],
            [
                36039,
                36118
            ],
            [
                36118,
                36176
            ],
            [
                36176,
                36394
            ],
            [
                36394,
                36406
            ],
            [
                36406,
                36425
            ],
            [
                36425,
                36432
            ],
            [
                36432,
                36497
            ],
            [
                36497,
                36534
            ],
            [
                36534,
                36599
            ],
            [
                36599,
                36653
            ],
            [
                36653,
                36677
            ],
            [
                36677,
                36780
            ],
            [
                36780,
                36856
            ],
            [
                36856,
                36963
            ],
            [
                36963,
                37027
            ],
            [
                37027,
                37055
            ],
            [
                37055,
                37270
            ],
            [
                37270,
                37336
            ],
            [
                37336,
                37344
            ],
            [
                37344,
                37489
            ],
            [
                37489,
                37615
            ],
            [
                37615,
                37676
            ],
            [
                37676,
                37940
            ],
            [
                37940,
                37967
            ],
            [
                37967,
                37985
            ],
            [
                37985,
                38000
            ],
            [
                38000,
                38060
            ],
            [
                38060,
                38095
            ],
            [
                38095,
                38137
            ],
            [
                38137,
                38306
            ],
            [
                38306,
                38365
            ],
            [
                38365,
                38383
            ],
            [
                38383,
                38434
            ],
            [
                38434,
                38448
            ],
            [
                38448,
                38500
            ],
            [
                38500,
                38580
            ],
            [
                38580,
                38639
            ],
            [
                38639,
                38956
            ],
            [
                38956,
                39112
            ]
        ],
        "overlap_chars": [
            [
                0,
                37
            ],
            [
                47,
                86
            ],
            [
                38,
                40
            ],
            [
                90,
                110
            ],
            [
                110,
                152
            ],
            [
                152,
                205
            ],
            [
                219,
                259
            ],
            [
                276,
                278
            ],
            [
                278,
                311
            ],
            [
                311,
                337
            ],
            [
                377,
                409
            ],
            [
                419,
                428
            ],
            [
                438,
                466
            ],
            [
                466,
                531
            ],
            [
                537,
                566
            ],
            [
                605,
                610
            ],
            [
                585,
                599
            ],
            [
                619,
                620
            ],
            [
                634,
                639
            ],
            [
                648,
                661
            ],
            [
                621,
                632
            ],
            [
                663,
                734
            ],
            [
                734,
                831
            ],
            [
                847,
                857
            ],
            [
                899,
                925
            ],
            [
                950,
                970
            ],
            [
                925,
                928
            ],
            [
                985,
                1032
            ],
            [
                1032,
                1058
            ],
            [
                1095,
                1143
            ],
            [
                1151,
                1156
            ],
            [
                1180,
                1190
            ],
            [
                1190,
                1211
            ],
            [
                1212,
                1215
            ],
            [
                1232,
                1246
            ],
            [
                1247,
                1251
            ],
            [
                1288,
                1299
            ],
            [
                1259,
                1270
            ],
            [
                1348,
                1385
            ],
            [
                1320,
                1346
            ],
            [
                1310,
                1311
            ],
            [
                1395,
                1404
            ],
            [
                1418,
                1425
            ],
            [
                1465,
                1492
            ],
            [
                1540,
                1543
            ],
            [
                1543,
                1714
            ],
            [
                1726,
                1728
            ],
            [
                1728,
                1747
            ],
            [
                1763,
                1774
            ],
            [
                1784,
                1786
            ],
            [
                1802,
                1845
            ],
            [
                2754,
                2786
            ],
            [
                2833,
                2839
            ],
            [
                2863,
                2881
            ],
            [
                2898,
                2917
            ],
            [
                2929,
                2954
            ],
            [
                2962,
                2980
            ],
            [
                2990,
                3000
            ],
            [
                3007,
                3033
            ],
            [
                3033,
                3133
            ],
            [
                3146,
                3239
            ],
            [
                3277,
                3312
            ],
            [
                3313,
                3444
            ],
            [
                3444,
                3477
            ],
            [
                3482,
                3487
            ],
            [
                3495,
                3504
            ],
            [
                3516,
                3619
            ],
            [
                3681,
                3692
            ],
            [
                3620,
                3628
            ],
            [
                3706,
                3754
            ],
            [
                3792,
                3809
            ],
            [
                3836,
                3838
            ],
            [
                3876,
                3919
            ],
            [
                3919,
                3928
            ],
            [
                3930,
                3937
            ],
            [
                3965,
                3977
            ],
            [
                4136,
                4143
            ],
            [
                4144,
                4150
            ],
            [
                4156,
                4212
            ],
            [
                4217,
                4219
            ],
            [
                4219,
                4239
            ],
            [
                4240,
                4315
            ],
            [
                4315,
                4341
            ],
            [
                4347,
                4429
            ],
            [
                4429,
                4455
            ],
            [
                4467,
                4588
            ],
            [
                4598,
                4616
            ],
            [
                4616,
                4626
            ],
            [
                4632,
                4657
            ],
            [
                4766,
                4769
            ],
            [
                4677,
                4687
            ],
            [
                4658,
                4665
            ],
            [
                4804,
                4806
            ],
            [
                4806,
                4975
            ],
            [
                5034,
                5058
            ],
            [
                5058,
                5105
            ],
            [
                5145,
                5260
            ],
            [
                5260,
                5283
            ],
            [
                5319,
                5328
            ],
            [
                5339,
                5388
            ],
            [
                5660,
                5806
            ],
            [
                5806,
                5817
            ],
            [
                5817,
                5840
            ],
            [
                5840,
                5847
            ],
            [
                5896,
                5917
            ],
            [
                6070,
                6071
            ],
            [
                5919,
                5932
            ],
            [
                5937,
                5940
            ],
            [
                5933,
                5936
            ],
            [
                5941,
                6044
            ],
            [
                6072,
                6117
            ],
            [
                6117,
                6139
            ],
            [
                6139,
                6186
            ],
            [
                6234,
                6266
            ],
            [
                6351,
                6352
            ],
            [
                6371,
                6375
            ],
            [
                6348,
                6351
            ],
            [
                6384,
                6409
            ],
            [
                6409,
                6453
            ],
            [
                6470,
                6472
            ],
            [
                6490,
                6516
            ],
            [
                6554,
                6586
            ],
            [
                6625,
                6636
            ],
            [
                6645,
                6671
            ],
            [
                6710,
                6712
            ],
            [
                6790,
                6837
            ],
            [
                6837,
                6891
            ],
            [
                6891,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                6989,
                7141
            ],
            [
                7150,
                7151
            ],
            [
                7184,
                7202
            ],
            [
                7270,
                7289
            ],
            [
                7289,
                7343
            ],
            [
                7456,
                7470
            ],
            [
                7474,
                7489
            ],
            [
                7490,
                7549
            ],
            [
                7562,
                7630
            ],
            [
                7633,
                7719
            ],
            [
                7749,
                7760
            ],
            [
                7762,
                7849
            ],
            [
                7873,
                7911
            ],
            [
                7911,
                7938
            ],
            [
                7938,
                8098
            ],
            [
                8137,
                8185
            ],
            [
                8185,
                8242
            ],
            [
                8251,
                8257
            ],
            [
                8258,
                8272
            ],
            [
                8274,
                8313
            ],
            [
                8337,
                8352
            ],
            [
                8357,
                8436
            ],
            [
                8521,
                8523
            ],
            [
                8685,
                8717
            ],
            [
                8785,
                8786
            ],
            [
                8718,
                8785
            ],
            [
                8797,
                8814
            ],
            [
                8814,
                8840
            ],
            [
                8875,
                8877
            ],
            [
                8877,
                8890
            ],
            [
                8890,
                8897
            ],
            [
                8934,
                8936
            ],
            [
                8936,
                8941
            ],
            [
                8942,
                8965
            ],
            [
                8965,
                8979
            ],
            [
                9003,
                9073
            ],
            [
                9073,
                9086
            ],
            [
                9307,
                9318
            ],
            [
                9298,
                9299
            ],
            [
                9368,
                9412
            ],
            [
                9134,
                9142
            ],
            [
                9413,
                9472
            ],
            [
                9486,
                9487
            ],
            [
                9174,
                9176
            ],
            [
                9143,
                9170
            ],
            [
                9624,
                9642
            ],
            [
                9679,
                9744
            ],
            [
                9776,
                9778
            ],
            [
                9778,
                9807
            ],
            [
                9869,
                9938
            ],
            [
                9938,
                10061
            ],
            [
                10136,
                10153
            ],
            [
                10172,
                10175
            ],
            [
                10175,
                10178
            ],
            [
                10213,
                10319
            ],
            [
                10319,
                10359
            ],
            [
                10359,
                10418
            ],
            [
                10452,
                10454
            ],
            [
                10454,
                10509
            ],
            [
                10509,
                10520
            ],
            [
                10546,
                10563
            ],
            [
                10564,
                10597
            ],
            [
                10597,
                10606
            ],
            [
                10622,
                10624
            ],
            [
                10632,
                10660
            ],
            [
                10674,
                10717
            ],
            [
                10719,
                10731
            ],
            [
                10744,
                10751
            ],
            [
                10838,
                10896
            ],
            [
                10938,
                10940
            ],
            [
                10957,
                10969
            ],
            [
                11011,
                11013
            ],
            [
                11013,
                11027
            ],
            [
                11027,
                11116
            ],
            [
                11116,
                11165
            ],
            [
                11165,
                11205
            ],
            [
                11209,
                11213
            ],
            [
                11246,
                11250
            ],
            [
                11255,
                11273
            ],
            [
                11348,
                11350
            ],
            [
                11350,
                11379
            ],
            [
                11408,
                11469
            ],
            [
                11469,
                11472
            ],
            [
                11504,
                11589
            ],
            [
                11594,
                11612
            ],
            [
                11612,
                11630
            ],
            [
                11681,
                11682
            ],
            [
                11649,
                11667
            ],
            [
                11644,
                11645
            ],
            [
                11756,
                11764
            ],
            [
                11696,
                11697
            ],
            [
                11767,
                11847
            ],
            [
                11859,
                11880
            ],
            [
                11880,
                11892
            ],
            [
                11897,
                11900
            ],
            [
                11913,
                11934
            ],
            [
                12108,
                12113
            ],
            [
                12043,
                12069
            ],
            [
                12075,
                12094
            ],
            [
                12128,
                12154
            ],
            [
                12154,
                12162
            ],
            [
                12162,
                12181
            ],
            [
                12181,
                12197
            ],
            [
                12210,
                12212
            ],
            [
                12236,
                12252
            ],
            [
                12259,
                12304
            ],
            [
                12304,
                12317
            ],
            [
                12317,
                12362
            ],
            [
                12383,
                12389
            ],
            [
                12405,
                12511
            ],
            [
                12511,
                12524
            ],
            [
                12581,
                12591
            ],
            [
                12574,
                12579
            ],
            [
                12592,
                12615
            ],
            [
                12662,
                12690
            ],
            [
                12690,
                12723
            ],
            [
                12754,
                12764
            ],
            [
                12774,
                12790
            ],
            [
                12846,
                12847
            ],
            [
                12848,
                12907
            ],
            [
                12971,
                13001
            ],
            [
                12907,
                12908
            ],
            [
                13026,
                13132
            ],
            [
                13154,
                13235
            ],
            [
                13297,
                13348
            ],
            [
                13348,
                13392
            ],
            [
                13394,
                13404
            ],
            [
                13422,
                13447
            ],
            [
                13535,
                13555
            ],
            [
                13448,
                13461
            ],
            [
                13581,
                13584
            ],
            [
                13466,
                13477
            ],
            [
                13555,
                13577
            ],
            [
                13604,
                13635
            ],
            [
                13664,
                13666
            ],
            [
                13684,
                13688
            ],
            [
                13680,
                13682
            ],
            [
                13689,
                13698
            ],
            [
                13731,
                13733
            ],
            [
                13733,
                13771
            ],
            [
                13815,
                13820
            ],
            [
                13941,
                13987
            ],
            [
                13992,
                14094
            ],
            [
                14114,
                14126
            ],
            [
                14140,
                14207
            ],
            [
                14112,
                14113
            ],
            [
                14226,
                14259
            ],
            [
                14259,
                14309
            ],
            [
                14317,
                14324
            ],
            [
                14326,
                14385
            ],
            [
                14385,
                14418
            ],
            [
                14435,
                14485
            ],
            [
                14487,
                14518
            ],
            [
                14527,
                14555
            ],
            [
                14555,
                14566
            ],
            [
                14637,
                14659
            ],
            [
                14587,
                14588
            ],
            [
                14682,
                14705
            ],
            [
                14733,
                14735
            ],
            [
                14737,
                14743
            ],
            [
                14743,
                14757
            ],
            [
                15029,
                15039
            ],
            [
                15084,
                15126
            ],
            [
                15164,
                15177
            ],
            [
                15193,
                15194
            ],
            [
                15195,
                15245
            ],
            [
                15251,
                15368
            ],
            [
                15440,
                15441
            ],
            [
                15455,
                15465
            ],
            [
                15482,
                15524
            ],
            [
                15524,
                15711
            ],
            [
                15726,
                15777
            ],
            [
                15783,
                15845
            ],
            [
                15845,
                15868
            ],
            [
                15889,
                15901
            ],
            [
                15941,
                15959
            ],
            [
                15979,
                15986
            ],
            [
                15988,
                16001
            ],
            [
                16003,
                16078
            ],
            [
                16085,
                16090
            ],
            [
                16079,
                16084
            ],
            [
                15885,
                15888
            ],
            [
                16212,
                16215
            ],
            [
                16231,
                16232
            ],
            [
                16662,
                16756
            ],
            [
                16765,
                16786
            ],
            [
                16801,
                16846
            ],
            [
                16846,
                16947
            ],
            [
                16965,
                16990
            ],
            [
                16948,
                16950
            ],
            [
                17020,
                17033
            ],
            [
                16991,
                16994
            ],
            [
                17047,
                17067
            ],
            [
                17162,
                17167
            ],
            [
                17102,
                17126
            ],
            [
                17154,
                17157
            ],
            [
                17144,
                17150
            ],
            [
                17178,
                17212
            ],
            [
                17250,
                17272
            ],
            [
                17303,
                17317
            ],
            [
                17224,
                17228
            ],
            [
                17367,
                17423
            ],
            [
                17423,
                17445
            ],
            [
                17445,
                17465
            ],
            [
                17465,
                17477
            ],
            [
                17481,
                17490
            ],
            [
                17501,
                17503
            ],
            [
                17503,
                17523
            ],
            [
                17523,
                17562
            ],
            [
                17583,
                17598
            ],
            [
                17598,
                17618
            ],
            [
                17618,
                17632
            ],
            [
                17637,
                17647
            ],
            [
                17693,
                17751
            ],
            [
                17776,
                17779
            ],
            [
                17807,
                17826
            ],
            [
                17826,
                17845
            ],
            [
                17945,
                17952
            ],
            [
                17852,
                17864
            ],
            [
                17846,
                17851
            ],
            [
                18477,
                18513
            ],
            [
                18527,
                18564
            ],
            [
                18564,
                18565
            ],
            [
                18566,
                18618
            ],
            [
                18680,
                18719
            ],
            [
                18719,
                18747
            ],
            [
                18766,
                18800
            ],
            [
                18800,
                18817
            ],
            [
                18841,
                18864
            ],
            [
                18873,
                18906
            ],
            [
                18942,
                18989
            ],
            [
                18989,
                19035
            ],
            [
                19038,
                19044
            ],
            [
                19112,
                19113
            ],
            [
                19071,
                19112
            ],
            [
                19189,
                19191
            ],
            [
                19191,
                19227
            ],
            [
                19238,
                19274
            ],
            [
                19396,
                19398
            ],
            [
                19398,
                19489
            ],
            [
                19502,
                19556
            ],
            [
                19556,
                19621
            ],
            [
                19715,
                19735
            ],
            [
                19744,
                19811
            ],
            [
                19811,
                19814
            ],
            [
                19861,
                19869
            ],
            [
                19815,
                19820
            ],
            [
                19847,
                19853
            ],
            [
                19825,
                19845
            ],
            [
                19869,
                19933
            ],
            [
                19959,
                19966
            ],
            [
                19966,
                19990
            ],
            [
                19990,
                20005
            ],
            [
                20010,
                20017
            ],
            [
                20056,
                20098
            ],
            [
                20133,
                20150
            ],
            [
                20160,
                20198
            ],
            [
                20198,
                20265
            ],
            [
                20301,
                20317
            ],
            [
                20369,
                20378
            ],
            [
                20281,
                20290
            ],
            [
                20295,
                20300
            ],
            [
                20266,
                20270
            ],
            [
                20393,
                20425
            ],
            [
                20490,
                20498
            ],
            [
                20502,
                20527
            ],
            [
                20580,
                20583
            ],
            [
                20618,
                20621
            ],
            [
                20543,
                20579
            ],
            [
                20710,
                20739
            ],
            [
                20745,
                20786
            ],
            [
                20788,
                20854
            ],
            [
                20859,
                20909
            ],
            [
                20921,
                20954
            ],
            [
                20954,
                21076
            ],
            [
                21076,
                21120
            ],
            [
                21155,
                21237
            ],
            [
                21237,
                21354
            ],
            [
                21360,
                21463
            ],
            [
                21482,
                21537
            ],
            [
                21539,
                21561
            ],
            [
                21581,
                21583
            ],
            [
                21583,
                21630
            ],
            [
                21644,
                21669
            ],
            [
                21682,
                21760
            ],
            [
                21760,
                21786
            ],
            [
                21807,
                21848
            ],
            [
                21793,
                21801
            ],
            [
                21849,
                21922
            ],
            [
                21941,
                21993
            ],
            [
                21993,
                21994
            ],
            [
                22041,
                22058
            ],
            [
                22022,
                22030
            ],
            [
                22062,
                22097
            ],
            [
                22117,
                22219
            ],
            [
                22219,
                22301
            ],
            [
                22318,
                22358
            ],
            [
                22362,
                22372
            ],
            [
                22377,
                22395
            ],
            [
                22416,
                22435
            ],
            [
                22567,
                22569
            ],
            [
                22588,
                22640
            ],
            [
                22581,
                22582
            ],
            [
                22660,
                22662
            ],
            [
                22662,
                22671
            ],
            [
                22676,
                22778
            ],
            [
                22787,
                22885
            ],
            [
                22971,
                23003
            ],
            [
                23043,
                23071
            ],
            [
                23234,
                23235
            ],
            [
                23077,
                23234
            ],
            [
                23281,
                23283
            ],
            [
                23302,
                23354
            ],
            [
                23354,
                23408
            ],
            [
                23450,
                23471
            ],
            [
                23471,
                23533
            ],
            [
                23533,
                23640
            ],
            [
                23658,
                23660
            ],
            [
                23660,
                23671
            ],
            [
                23687,
                23725
            ],
            [
                23736,
                23761
            ],
            [
                23763,
                23772
            ],
            [
                23788,
                23792
            ],
            [
                23808,
                23809
            ],
            [
                23816,
                23821
            ],
            [
                23823,
                23843
            ],
            [
                23785,
                23787
            ],
            [
                23866,
                23874
            ],
            [
                23897,
                23899
            ],
            [
                23899,
                23992
            ],
            [
                24003,
                24016
            ],
            [
                24017,
                24039
            ],
            [
                24049,
                24073
            ],
            [
                24087,
                24116
            ],
            [
                24116,
                24137
            ],
            [
                24137,
                24156
            ],
            [
                24156,
                24178
            ],
            [
                24248,
                24283
            ],
            [
                24289,
                24301
            ],
            [
                24317,
                24369
            ],
            [
                24369,
                24378
            ],
            [
                24378,
                24397
            ],
            [
                24397,
                24456
            ],
            [
                24456,
                24468
            ],
            [
                24468,
                24485
            ],
            [
                24485,
                24530
            ],
            [
                24530,
                24547
            ],
            [
                24547,
                24593
            ],
            [
                24593,
                24629
            ],
            [
                24629,
                24662
            ],
            [
                24662,
                24754
            ],
            [
                24754,
                24833
            ],
            [
                24833,
                24844
            ],
            [
                24844,
                24888
            ],
            [
                24888,
                24932
            ],
            [
                24932,
                24942
            ],
            [
                25451,
                25504
            ],
            [
                25504,
                25525
            ],
            [
                25531,
                25545
            ],
            [
                25555,
                25621
            ],
            [
                25640,
                25642
            ],
            [
                25642,
                25653
            ],
            [
                25653,
                25665
            ],
            [
                25665,
                25682
            ],
            [
                25738,
                25740
            ],
            [
                25740,
                25761
            ],
            [
                25761,
                25797
            ],
            [
                25799,
                25854
            ],
            [
                25856,
                25857
            ],
            [
                25879,
                25915
            ],
            [
                25915,
                25926
            ],
            [
                25926,
                25934
            ],
            [
                26018,
                26080
            ],
            [
                26080,
                26116
            ],
            [
                26116,
                26151
            ],
            [
                26151,
                26199
            ],
            [
                26199,
                26293
            ],
            [
                26297,
                26332
            ],
            [
                26332,
                26356
            ],
            [
                26359,
                26384
            ],
            [
                26384,
                26421
            ],
            [
                26445,
                26472
            ],
            [
                26472,
                26560
            ],
            [
                26560,
                26642
            ],
            [
                26676,
                26677
            ],
            [
                26680,
                26720
            ],
            [
                26720,
                26765
            ],
            [
                26802,
                26804
            ],
            [
                26804,
                26899
            ],
            [
                26899,
                26989
            ],
            [
                27010,
                27013
            ],
            [
                27013,
                27082
            ],
            [
                27082,
                27163
            ],
            [
                27230,
                27281
            ],
            [
                27281,
                27325
            ],
            [
                27369,
                27433
            ],
            [
                27491,
                27534
            ],
            [
                27534,
                27618
            ],
            [
                27619,
                27623
            ],
            [
                27652,
                27703
            ],
            [
                27715,
                27724
            ],
            [
                27733,
                27749
            ],
            [
                27790,
                27819
            ],
            [
                27824,
                27842
            ],
            [
                27776,
                27777
            ],
            [
                27844,
                27852
            ],
            [
                27880,
                27884
            ],
            [
                27916,
                27926
            ],
            [
                27930,
                27939
            ],
            [
                27939,
                28021
            ],
            [
                28056,
                28095
            ],
            [
                28095,
                28187
            ],
            [
                28203,
                28206
            ],
            [
                28232,
                28249
            ],
            [
                28484,
                28506
            ],
            [
                28506,
                28559
            ],
            [
                28559,
                28632
            ],
            [
                28692,
                28832
            ],
            [
                28872,
                28904
            ],
            [
                28904,
                28998
            ],
            [
                29076,
                29078
            ],
            [
                29078,
                29112
            ],
            [
                29113,
                29119
            ],
            [
                29141,
                29149
            ],
            [
                29153,
                29157
            ],
            [
                29237,
                29354
            ],
            [
                29367,
                29485
            ],
            [
                29532,
                29560
            ],
            [
                29560,
                29658
            ],
            [
                29699,
                29701
            ],
            [
                29701,
                29794
            ],
            [
                30028,
                30030
            ],
            [
                30039,
                30144
            ],
            [
                30149,
                30192
            ],
            [
                30248,
                30275
            ],
            [
                30320,
                30408
            ],
            [
                30242,
                30243
            ],
            [
                30409,
                30454
            ],
            [
                30479,
                30491
            ],
            [
                30496,
                30498
            ],
            [
                30545,
                30567
            ],
            [
                30690,
                30747
            ],
            [
                30747,
                30835
            ],
            [
                30848,
                30869
            ],
            [
                30993,
                30995
            ],
            [
                31080,
                31083
            ],
            [
                31088,
                31104
            ],
            [
                31132,
                31135
            ],
            [
                31140,
                31167
            ],
            [
                31225,
                31231
            ],
            [
                31167,
                31224
            ],
            [
                31232,
                31264
            ],
            [
                31264,
                31432
            ],
            [
                31437,
                31528
            ],
            [
                31617,
                31624
            ],
            [
                31625,
                31636
            ],
            [
                31644,
                31657
            ],
            [
                31666,
                31712
            ],
            [
                31712,
                31764
            ],
            [
                31764,
                31787
            ],
            [
                31787,
                31805
            ],
            [
                31805,
                31846
            ],
            [
                31846,
                31887
            ],
            [
                31887,
                31990
            ],
            [
                31990,
                32069
            ],
            [
                32069,
                32131
            ],
            [
                32138,
                32176
            ],
            [
                32176,
                32223
            ],
            [
                32249,
                32269
            ],
            [
                32291,
                32293
            ],
            [
                32293,
                32318
            ],
            [
                32318,
                32328
            ],
            [
                32328,
                32332
            ],
            [
                32332,
                32351
            ],
            [
                32351,
                32377
            ],
            [
                32379,
                32474
            ],
            [
                32574,
                32612
            ],
            [
                32612,
                32665
            ],
            [
                32716,
                32722
            ],
            [
                32730,
                32732
            ],
            [
                32768,
                32779
            ],
            [
                32784,
                32801
            ],
            [
                32801,
                32875
            ],
            [
                32876,
                32878
            ],
            [
                32892,
                32899
            ],
            [
                32899,
                32902
            ],
            [
                32902,
                33063
            ],
            [
                33063,
                33196
            ],
            [
                33205,
                33211
            ],
            [
                33216,
                33244
            ],
            [
                33244,
                33254
            ],
            [
                33259,
                33278
            ],
            [
                33279,
                33295
            ],
            [
                33323,
                33335
            ],
            [
                33335,
                33358
            ],
            [
                33368,
                33402
            ],
            [
                33499,
                33502
            ],
            [
                33502,
                33510
            ],
            [
                33529,
                33545
            ],
            [
                33545,
                33567
            ],
            [
                33567,
                33592
            ],
            [
                33627,
                33629
            ],
            [
                33629,
                33684
            ],
            [
                33770,
                33809
            ],
            [
                33809,
                33843
            ],
            [
                33843,
                33858
            ],
            [
                33858,
                33874
            ],
            [
                33883,
                33885
            ],
            [
                34067,
                34087
            ],
            [
                34092,
                34139
            ],
            [
                34139,
                34194
            ],
            [
                34194,
                34248
            ],
            [
                34248,
                34292
            ],
            [
                34292,
                34306
            ],
            [
                34306,
                34313
            ],
            [
                34313,
                34354
            ],
            [
                34354,
                34424
            ],
            [
                34424,
                34560
            ],
            [
                34560,
                34632
            ],
            [
                34632,
                34646
            ],
            [
                34646,
                34728
            ],
            [
                34728,
                34735
            ],
            [
                34735,
                34804
            ],
            [
                34804,
                34832
            ],
            [
                34832,
                34878
            ],
            [
                34878,
                34986
            ],
            [
                34986,
                35003
            ],
            [
                35003,
                35014
            ],
            [
                35014,
                35047
            ],
            [
                35047,
                35054
            ],
            [
                35054,
                35109
            ],
            [
                35130,
                35194
            ],
            [
                35201,
                35204
            ],
            [
                35214,
                35225
            ],
            [
                35237,
                35261
            ],
            [
                35273,
                35291
            ],
            [
                35318,
                35326
            ],
            [
                35331,
                35339
            ],
            [
                35364,
                35366
            ],
            [
                35366,
                35449
            ],
            [
                35449,
                35481
            ],
            [
                35481,
                35530
            ],
            [
                35530,
                35636
            ],
            [
                35636,
                35699
            ],
            [
                35712,
                35743
            ],
            [
                35743,
                35771
            ],
            [
                35784,
                35786
            ],
            [
                35786,
                35796
            ],
            [
                35805,
                35833
            ],
            [
                35835,
                35925
            ],
            [
                35946,
                35948
            ],
            [
                35948,
                35963
            ],
            [
                35965,
                36039
            ],
            [
                36039,
                36118
            ],
            [
                36118,
                36176
            ],
            [
                36176,
                36308
            ],
            [
                36310,
                36325
            ],
            [
                36326,
                36394
            ],
            [
                36394,
                36406
            ],
            [
                36406,
                36425
            ],
            [
                36425,
                36432
            ],
            [
                36432,
                36497
            ],
            [
                36497,
                36521
            ],
            [
                36531,
                36534
            ],
            [
                36534,
                36599
            ],
            [
                36599,
                36653
            ],
            [
                36653,
                36677
            ],
            [
                36677,
                36768
            ],
            [
                36773,
                36780
            ],
            [
                36780,
                36801
            ],
            [
                36813,
                36856
            ],
            [
                36856,
                36963
            ],
            [
                36963,
                37025
            ],
            [
                37055,
                37064
            ],
            [
                37092,
                37136
            ],
            [
                37138,
                37148
            ],
            [
                37154,
                37216
            ],
            [
                37268,
                37270
            ],
            [
                37270,
                37318
            ],
            [
                37336,
                37344
            ],
            [
                37344,
                37464
            ],
            [
                37487,
                37489
            ],
            [
                37489,
                37540
            ],
            [
                37546,
                37548
            ],
            [
                37549,
                37554
            ],
            [
                37561,
                37615
            ],
            [
                37615,
                37634
            ],
            [
                37644,
                37652
            ],
            [
                37674,
                37676
            ],
            [
                37676,
                37791
            ],
            [
                37806,
                37909
            ],
            [
                37929,
                37940
            ],
            [
                37940,
                37967
            ],
            [
                37967,
                37985
            ],
            [
                37985,
                38000
            ],
            [
                38000,
                38015
            ],
            [
                38058,
                38060
            ],
            [
                38137,
                38140
            ],
            [
                38147,
                38153
            ],
            [
                38184,
                38306
            ],
            [
                38306,
                38365
            ],
            [
                38365,
                38383
            ],
            [
                38383,
                38434
            ],
            [
                38434,
                38448
            ],
            [
                38448,
                38500
            ],
            [
                38500,
                38572
            ],
            [
                38572,
                38580
            ],
            [
                38580,
                38639
            ],
            [
                38639,
                38760
            ],
            [
                38832,
                38956
            ],
            [
                38963,
                39010
            ],
            [
                39050,
                39112
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                152
            ],
            [
                152,
                278
            ],
            [
                278,
                311
            ],
            [
                311,
                466
            ],
            [
                466,
                621
            ],
            [
                621,
                734
            ],
            [
                734,
                925
            ],
            [
                925,
                1032
            ],
            [
                1032,
                1190
            ],
            [
                1190,
                1395
            ],
            [
                1395,
                1543
            ],
            [
                1543,
                1728
            ],
            [
                1728,
                1846
            ],
            [
                1846,
                1971
            ],
            [
                1971,
                2163
            ],
            [
                2163,
                2435
            ],
            [
                2435,
                2458
            ],
            [
                2458,
                2568
            ],
            [
                2568,
                2699
            ],
            [
                2699,
                2754
            ],
            [
                2754,
                3033
            ],
            [
                3033,
                3313
            ],
            [
                3313,
                3444
            ],
            [
                3444,
                3838
            ],
            [
                3838,
                3919
            ],
            [
                3919,
                4219
            ],
            [
                4219,
                4315
            ],
            [
                4315,
                4429
            ],
            [
                4429,
                4616
            ],
            [
                4616,
                4806
            ],
            [
                4806,
                5058
            ],
            [
                5058,
                5260
            ],
            [
                5260,
                5283
            ],
            [
                5283,
                5319
            ],
            [
                5319,
                5390
            ],
            [
                5390,
                5431
            ],
            [
                5431,
                5628
            ],
            [
                5628,
                5660
            ],
            [
                5660,
                5806
            ],
            [
                5806,
                5817
            ],
            [
                5817,
                5840
            ],
            [
                5840,
                6072
            ],
            [
                6072,
                6117
            ],
            [
                6117,
                6139
            ],
            [
                6139,
                6186
            ],
            [
                6186,
                6234
            ],
            [
                6234,
                6266
            ],
            [
                6266,
                6290
            ],
            [
                6290,
                6338
            ],
            [
                6338,
                6409
            ],
            [
                6409,
                6472
            ],
            [
                6472,
                6490
            ],
            [
                6490,
                6673
            ],
            [
                6673,
                6692
            ],
            [
                6692,
                6837
            ],
            [
                6837,
                6891
            ],
            [
                6891,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                6989,
                7202
            ],
            [
                7202,
                7289
            ],
            [
                7289,
                7343
            ],
            [
                7343,
                7456
            ],
            [
                7456,
                7630
            ],
            [
                7630,
                7911
            ],
            [
                7911,
                7938
            ],
            [
                7938,
                8185
            ],
            [
                8185,
                8523
            ],
            [
                8523,
                8685
            ],
            [
                8685,
                8814
            ],
            [
                8814,
                8877
            ],
            [
                8877,
                8890
            ],
            [
                8890,
                8936
            ],
            [
                8936,
                8965
            ],
            [
                8965,
                9073
            ],
            [
                9073,
                9488
            ],
            [
                9488,
                9532
            ],
            [
                9532,
                9624
            ],
            [
                9624,
                9778
            ],
            [
                9778,
                9938
            ],
            [
                9938,
                10175
            ],
            [
                10175,
                10319
            ],
            [
                10319,
                10359
            ],
            [
                10359,
                10454
            ],
            [
                10454,
                10509
            ],
            [
                10509,
                10520
            ],
            [
                10520,
                10597
            ],
            [
                10597,
                10751
            ],
            [
                10751,
                10838
            ],
            [
                10838,
                11013
            ],
            [
                11013,
                11027
            ],
            [
                11027,
                11116
            ],
            [
                11116,
                11165
            ],
            [
                11165,
                11350
            ],
            [
                11350,
                11469
            ],
            [
                11469,
                11612
            ],
            [
                11612,
                11880
            ],
            [
                11880,
                11934
            ],
            [
                11934,
                12035
            ],
            [
                12035,
                12154
            ],
            [
                12154,
                12162
            ],
            [
                12162,
                12181
            ],
            [
                12181,
                12212
            ],
            [
                12212,
                12236
            ],
            [
                12236,
                12304
            ],
            [
                12304,
                12317
            ],
            [
                12317,
                12511
            ],
            [
                12511,
                12524
            ],
            [
                12524,
                12570
            ],
            [
                12570,
                12690
            ],
            [
                12690,
                12848
            ],
            [
                12848,
                13026
            ],
            [
                13026,
                13348
            ],
            [
                13348,
                13666
            ],
            [
                13666,
                13733
            ],
            [
                13733,
                13987
            ],
            [
                13987,
                14259
            ],
            [
                14259,
                14385
            ],
            [
                14385,
                14555
            ],
            [
                14555,
                14743
            ],
            [
                14743,
                14757
            ],
            [
                14757,
                14809
            ],
            [
                14809,
                14820
            ],
            [
                14820,
                15010
            ],
            [
                15010,
                15195
            ],
            [
                15195,
                15442
            ],
            [
                15442,
                15524
            ],
            [
                15524,
                15845
            ],
            [
                15845,
                16233
            ],
            [
                16233,
                16662
            ],
            [
                16662,
                16846
            ],
            [
                16846,
                17212
            ],
            [
                17212,
                17423
            ],
            [
                17423,
                17445
            ],
            [
                17445,
                17465
            ],
            [
                17465,
                17503
            ],
            [
                17503,
                17523
            ],
            [
                17523,
                17598
            ],
            [
                17598,
                17618
            ],
            [
                17618,
                17632
            ],
            [
                17632,
                17826
            ],
            [
                17826,
                17846
            ],
            [
                17846,
                17968
            ],
            [
                17968,
                17982
            ],
            [
                17982,
                18070
            ],
            [
                18070,
                18192
            ],
            [
                18192,
                18210
            ],
            [
                18210,
                18257
            ],
            [
                18257,
                18274
            ],
            [
                18274,
                18477
            ],
            [
                18477,
                18642
            ],
            [
                18642,
                18669
            ],
            [
                18669,
                18680
            ],
            [
                18680,
                18719
            ],
            [
                18719,
                18800
            ],
            [
                18800,
                18989
            ],
            [
                18989,
                19191
            ],
            [
                19191,
                19398
            ],
            [
                19398,
                19556
            ],
            [
                19556,
                19811
            ],
            [
                19811,
                19966
            ],
            [
                19966,
                19990
            ],
            [
                19990,
                20198
            ],
            [
                20198,
                20498
            ],
            [
                20498,
                20786
            ],
            [
                20786,
                20859
            ],
            [
                20859,
                20954
            ],
            [
                20954,
                21076
            ],
            [
                21076,
                21237
            ],
            [
                21237,
                21463
            ],
            [
                21463,
                21583
            ],
            [
                21583,
                21760
            ],
            [
                21760,
                21993
            ],
            [
                21993,
                22097
            ],
            [
                22097,
                22219
            ],
            [
                22219,
                22301
            ],
            [
                22301,
                22569
            ],
            [
                22569,
                22662
            ],
            [
                22662,
                23003
            ],
            [
                23003,
                23283
            ],
            [
                23283,
                23354
            ],
            [
                23354,
                23471
            ],
            [
                23471,
                23533
            ],
            [
                23533,
                23660
            ],
            [
                23660,
                23899
            ],
            [
                23899,
                24116
            ],
            [
                24116,
                24137
            ],
            [
                24137,
                24156
            ],
            [
                24156,
                24180
            ],
            [
                24180,
                24248
            ],
            [
                24248,
                24369
            ],
            [
                24369,
                24378
            ],
            [
                24378,
                24397
            ],
            [
                24397,
                24456
            ],
            [
                24456,
                24468
            ],
            [
                24468,
                24485
            ],
            [
                24485,
                24530
            ],
            [
                24530,
                24547
            ],
            [
                24547,
                24593
            ],
            [
                24593,
                24629
            ],
            [
                24629,
                24662
            ],
            [
                24662,
                24754
            ],
            [
                24754,
                24833
            ],
            [
                24833,
                24844
            ],
            [
                24844,
                24888
            ],
            [
                24888,
                24932
            ],
            [
                24932,
                24944
            ],
            [
                24944,
                25116
            ],
            [
                25116,
                25180
            ],
            [
                25180,
                25239
            ],
            [
                25239,
                25340
            ],
            [
                25340,
                25451
            ],
            [
                25451,
                25504
            ],
            [
                25504,
                25642
            ],
            [
                25642,
                25653
            ],
            [
                25653,
                25665
            ],
            [
                25665,
                25740
            ],
            [
                25740,
                25761
            ],
            [
                25761,
                25915
            ],
            [
                25915,
                25926
            ],
            [
                25926,
                26080
            ],
            [
                26080,
                26116
            ],
            [
                26116,
                26151
            ],
            [
                26151,
                26199
            ],
            [
                26199,
                26297
            ],
            [
                26297,
                26332
            ],
            [
                26332,
                26356
            ],
            [
                26356,
                26384
            ],
            [
                26384,
                26472
            ],
            [
                26472,
                26560
            ],
            [
                26560,
                26720
            ],
            [
                26720,
                26804
            ],
            [
                26804,
                26899
            ],
            [
                26899,
                27013
            ],
            [
                27013,
                27082
            ],
            [
                27082,
                27281
            ],
            [
                27281,
                27534
            ],
            [
                27534,
                27939
            ],
            [
                27939,
                28021
            ],
            [
                28021,
                28056
            ],
            [
                28056,
                28095
            ],
            [
                28095,
                28249
            ],
            [
                28249,
                28327
            ],
            [
                28327,
                28350
            ],
            [
                28350,
                28484
            ],
            [
                28484,
                28506
            ],
            [
                28506,
                28559
            ],
            [
                28559,
                28832
            ],
            [
                28832,
                28904
            ],
            [
                28904,
                29078
            ],
            [
                29078,
                29149
            ],
            [
                29149,
                29560
            ],
            [
                29560,
                29701
            ],
            [
                29701,
                30030
            ],
            [
                30030,
                30192
            ],
            [
                30192,
                30498
            ],
            [
                30498,
                30747
            ],
            [
                30747,
                30995
            ],
            [
                30995,
                31167
            ],
            [
                31167,
                31264
            ],
            [
                31264,
                31712
            ],
            [
                31712,
                31764
            ],
            [
                31764,
                31787
            ],
            [
                31787,
                31805
            ],
            [
                31805,
                31846
            ],
            [
                31846,
                31887
            ],
            [
                31887,
                31990
            ],
            [
                31990,
                32069
            ],
            [
                32069,
                32176
            ],
            [
                32176,
                32293
            ],
            [
                32293,
                32318
            ],
            [
                32318,
                32328
            ],
            [
                32328,
                32332
            ],
            [
                32332,
                32351
            ],
            [
                32351,
                32379
            ],
            [
                32379,
                32477
            ],
            [
                32477,
                32573
            ],
            [
                32573,
                32612
            ],
            [
                32612,
                32801
            ],
            [
                32801,
                32902
            ],
            [
                32902,
                33063
            ],
            [
                33063,
                33244
            ],
            [
                33244,
                33335
            ],
            [
                33335,
                33502
            ],
            [
                33502,
                33545
            ],
            [
                33545,
                33567
            ],
            [
                33567,
                33629
            ],
            [
                33629,
                33809
            ],
            [
                33809,
                33858
            ],
            [
                33858,
                33885
            ],
            [
                33885,
                34067
            ],
            [
                34067,
                34139
            ],
            [
                34139,
                34194
            ],
            [
                34194,
                34248
            ],
            [
                34248,
                34292
            ],
            [
                34292,
                34306
            ],
            [
                34306,
                34313
            ],
            [
                34313,
                34354
            ],
            [
                34354,
                34424
            ],
            [
                34424,
                34560
            ],
            [
                34560,
                34632
            ],
            [
                34632,
                34646
            ],
            [
                34646,
                34728
            ],
            [
                34728,
                34735
            ],
            [
                34735,
                34804
            ],
            [
                34804,
                34832
            ],
            [
                34832,
                34878
            ],
            [
                34878,
                34986
            ],
            [
                34986,
                35003
            ],
            [
                35003,
                35014
            ],
            [
                35014,
                35047
            ],
            [
                35047,
                35054
            ],
            [
                35054,
                35194
            ],
            [
                35194,
                35366
            ],
            [
                35366,
                35449
            ],
            [
                35449,
                35481
            ],
            [
                35481,
                35530
            ],
            [
                35530,
                35636
            ],
            [
                35636,
                35699
            ],
            [
                35699,
                35743
            ],
            [
                35743,
                35786
            ],
            [
                35786,
                35948
            ],
            [
                35948,
                36039
            ],
            [
                36039,
                36118
            ],
            [
                36118,
                36176
            ],
            [
                36176,
                36394
            ],
            [
                36394,
                36406
            ],
            [
                36406,
                36425
            ],
            [
                36425,
                36432
            ],
            [
                36432,
                36497
            ],
            [
                36497,
                36534
            ],
            [
                36534,
                36599
            ],
            [
                36599,
                36653
            ],
            [
                36653,
                36677
            ],
            [
                36677,
                36780
            ],
            [
                36780,
                36856
            ],
            [
                36856,
                36963
            ],
            [
                36963,
                37027
            ],
            [
                37027,
                37055
            ],
            [
                37055,
                37270
            ],
            [
                37270,
                37344
            ],
            [
                37344,
                37489
            ],
            [
                37489,
                37615
            ],
            [
                37615,
                37676
            ],
            [
                37676,
                37940
            ],
            [
                37940,
                37967
            ],
            [
                37967,
                37985
            ],
            [
                37985,
                38000
            ],
            [
                38000,
                38060
            ],
            [
                38060,
                38095
            ],
            [
                38095,
                38137
            ],
            [
                38137,
                38306
            ],
            [
                38306,
                38365
            ],
            [
                38365,
                38383
            ],
            [
                38383,
                38434
            ],
            [
                38434,
                38448
            ],
            [
                38448,
                38500
            ],
            [
                38500,
                38580
            ],
            [
                38580,
                38639
            ],
            [
                38639,
                38956
            ],
            [
                38956,
                39112
            ]
        ]
    },
    "abridged": {
        "text": "It was not so easy as it had appeared to arrange for Richard's making a trial at Mr. Kenge's office. Richard himself was the chief impediment. As soon as he had it in his power to leave Mr. Badger, he began to doubt whether he wanted to. He didn't know, he said, really. It wasn't a bad profession; perhaps he liked it as well as any other - suppose he gave it one more chance! Upon that, he shut himself up for a few weeks with some books and bones and seemed to acquire a great deal of information very quickly.\nAfter about a month his fervour began to cool, and when it was quite cooled, began to grow warm again. His vacillations between law and medicine lasted so long that midsummer arrived before he finally left Mr. Badger for Messrs. Kenge and Carboy. He took great credit for being determined to be in earnest \"this time.\" And he was so good-natured, and so fond of Ada, that it was very difficult to be displeased with him.\n\"As to Mr. Jarndyce,\" (who found the wind sticking much in the east during this time,) \"he is the finest fellow in the world,\" Richard would say to me. \"I must be careful to take myself well to task.\"\nThe idea of his taking himself well to task, with that laughing face and heedless manner and with a fancy that everything could catch and nothing could hold, was ludicrous. However, he told us sometimes that he was taking himself to task so well that he wondered his hair didn't turn grey.\nIt was a question much discussed where he should live in London while he studied the law, for we had now gone back to Bleak House, which was too far off to allow his coming oftener than once a week. My guardian told me that if Richard were to settle down at Mr. Kenge's he would take some apartments where we too could occasionally stay for a few days at a time; \"but, little woman,\" he added, \"he hasn't settled down there yet!\"\nThe discussions ended in our hiring for him, by the month, a neat little furnished lodging in a quiet old house near Queen Square. He immediately began to spend all his money in buying little ornaments and luxuries for this lodging; and so often as Ada and I dissuaded him from making any unnecessary purchase, he took credit for what it would have cost and spent it on something else.\nMeanwhile our visit to Mr. Boythorn's was postponed. At length Richard moved into his lodging, and was soon making energetic attempts to unravel the mysteries of the fatal lawsuit. Consequently we went on our visit without him, and my darling was delighted to praise him for being so busy.\nWe made a pleasant journey into Lincolnshire by the coach and had an entertaining companion in Mr. Skimpole. His furniture had been all removed, it appeared, by the person who took possession of it on his blue-eyed daughter's birthday, but he seemed quite relieved that it was gone. Chairs and tables, he said, were wearisome and monotonous objects. How pleasant, then, to be bound to no particular chairs and tables, but to sport like a butterfly among all the furniture on hire, and to flit from rosewood to mahogany, as the humour took one!\n\"The oddity of the thing is,\" said Mr. Skimpole, \"that my chairs and tables were not paid for, and yet my landlord walks off with them as composedly as possible. Now, that seems droll! The chair merchant never engaged to pay my landlord my rent!\"\n\"Well,\" said my guardian good-humouredly, \"it's pretty clear that whoever became security for those chairs and tables will have to pay for them.\"\n\"Exactly!\" returned Mr. Skimpole. \"That's what I said to my landlord. 'My good man, are you not aware that my excellent friend Jarndyce will have to pay for those things that you are sweeping off? Have you no consideration for his property?' He hadn't the least.\"\n\"And refused all proposals,\" said my guardian.\n\"I made him business proposals. I said, 'Let us be business-like. Here is an inkstand, here are pens and paper. I have occupied your house to our mutual satisfaction until now; let us be friendly and business-like.' He replied that he had never seen the colour of my money. 'My amiable friend,' said I, 'I never have any money. I never know anything about money.' 'Well, sir,' said he, 'what do you offer if I give you time?' 'My good fellow,' said I, 'I have no idea of time; but you say you are a man of business, and whatever you can suggest to be done in a business-like way, I am ready to do. Be business-like!' However, he wouldn't be, and there was an end of it.\"\nOn the journey Mr. Skimpole had a very good, child-like appetite for such refreshment as came in our way (including some choice hothouse peaches), but never thought of paying for anything. When the coachman came round for his fee, he pleasantly asked him what he considered a liberal one - and on his replying half a crown for a single passenger, said it was little enough too, and left Mr. Jarndyce to give it him.\nIt was delightful weather. The green corn waved so beautifully, the larks sang so joyfully, the hedges were so full of wild flowers, the trees were so thickly out in leaf, the bean-fields filled the air with such a delicious fragrance! Late in the afternoon we came to the market-town where we alighted from the coach - a dull little town with a church-spire, a market-cross, one intensely sunny street, and a pond with an old horse cooling his legs in it. At the inn we found Mr. Boythorn, on horseback, waiting with an open carriage to take us to his house a few miles off. He was overjoyed to see us.\n\"By heaven!\" said he. \"This is a most infamous coach. It is the most abominable public vehicle that ever encumbered the face of the earth. It is twenty-six minutes late! With two ladies in the coach, this scoundrel of a coachman has deliberately delayed his arrival six and twenty minutes! He ought to be put to death!\"\nWhile he said this, he handed us into the little phaeton with the utmost gentleness.\n\"I am sorry, ladies,\" he said, \"that I am obliged to conduct you nearly two miles out of the way. But our direct road lies through Sir Leicester Dedlock's park, and in that fellow's property I have sworn never to set foot, while I breathe!\" And he broke into one of his tremendous laughs, which seemed to shake even the motionless little market-town.\n\"Are the Dedlocks down here, Lawrence?\" said my guardian as we drove along and Mr. Boythorn trotted alongside.\n\"Sir Arrogant Numskull is here,\" replied Mr. Boythorn. \"Ha ha ha! I am glad to say, he has been laid by the heels here. My Lady,\" - he made a courtly gesture as if to exclude her from any part in the quarrel - \"is expected daily. Whatever can have induced that transcendent woman to marry him is an impenetrable mystery. Ha ha ha ha!\"\n\"I suppose,\" said my guardian, laughing, \"We may set foot in the park while we are here? The prohibition does not extend to us, does it?\"\n\"I can lay no prohibition on my guests,\" said Boythorn with smiling politeness. \"I am only sorry that I cannot be their escort about Chesney Wold, which is a very fine place! But, Jarndyce, if you call upon the owner while you stay with me, you are likely to have a cool reception. He carries himself as stiffly as a grandfather clock at all times - Ha ha ha! - but he will have some extra stiffness, I can promise you, for the friends of his neighbour Boythorn!\"\n\"I shall not test it by seeing him,\" said my guardian. \"A sight of the grounds and perhaps a view of the house are quite enough for me.\"\n\"Well!\" said Mr. Boythorn. \"I am glad of it. I am looked upon around here as a second Ajax defying the lightning. Ha ha ha ha! When I go into our little church on a Sunday, most of the congregation expect to see me drop, scorched and withered, on the pavement under the Dedlock displeasure. Ha ha ha ha! By heaven, he is the most self-satisfied and utterly brainless ass!\"\nOn our coming to the ridge of a hill, our friend pointed out Chesney Wold. It was a picturesque old house in a fine park richly wooded, with the spire of the little church nearby.\nOh, the solemn woods over which the light and shadow travelled swiftly, as if heavenly wings were sweeping through the summer air; the smooth green slopes, the glittering water, the garden full of the richest colours, how beautiful they looked! The house, with gable and chimney, and tower and turret, and broad terrace-walk, with a great flush of roses twining among its balustrades, seemed scarcely real in the serene and peaceful hush. That struck me above all. On everything, house, garden, terrace, woods, there seemed to be such undisturbed repose.\nWe came into the little village and passed a small inn with the sign of the Dedlock Arms swinging over it. Mr. Boythorn exchanged greetings with a young gentleman sitting on a bench outside the inn, with fishing-tackle lying beside him.\n\"That's the housekeeper's grandson, Mr. Rouncewell,\" said he, \"and he is in love with a pretty girl up at the house. Lady Dedlock has taken a fancy to her and is going to keep her about her own fair person - an honour which my young friend does not at all appreciate. However, he has to make the best of it, and comes here pretty often - to fish. Ha ha ha ha!\"\nMr. Boythorn dismounted at his own door and stood ready to welcome us. He lived in a pretty house, formerly the parsonage, with a lawn in front, a bright flower-garden at the side, and a well-stocked orchard and kitchen-garden in the rear.\nEverything wore an aspect of maturity and abundance. The old lime-tree walk was like green cloisters, the very shadows of the cherry-trees and apple-trees were heavy with fruit, the gooseberry-bushes were so laden that their branches arched onto the earth, the strawberries and raspberries grew in profusion, and the peaches basked by the hundred on the wall. Tumbled about among the glass frames were such heaps of marrows and cucumbers that every foot of ground appeared a vegetable treasury, while the smell of herbs sweetened the air.\nThe house, though a little disorderly in comparison with the garden, was a real old house with seats in the chimney of the kitchen and great beams across the ceilings. On one side of it was the terrible piece of ground in dispute, where Mr. Boythorn maintained a sentry day and night, whose duty in case of aggression was to ring a large bell, and unchain a great bull-dog from his kennel to deal destruction on the enemy. Mr. Boythorn had himself painted boards with the following solemn warnings: \"Beware of the bull-dog. He is most ferocious. Lawrence Boythorn.\" \"The blunderbuss is loaded. Lawrence Boythorn.\" \"Man-traps and spring-guns are set here day and night. Lawrence Boythorn.\" \"Take notice. Any person trespassing on this property will be punished with the utmost severity and rigour of the law. Lawrence Boythorn.\"\nMr. Boythorn laughed as he showed us all these. \"Let Sir Leicester Dedlock consent to decide this question by single combat,\" he said, \"and I will meet him with any weapon known to mankind!\"\nWe arrived at his house on a Saturday. On the Sunday morning we all walked to the little church in the park. Entering the park near the disputed ground, we followed a pleasant footpath winding among trees until it brought us to the church-porch.\nThe congregation was extremely small and quite rustic, apart from a large muster of servants from the house. There were some stately footmen, and a perfect picture of an old coachman. There was a very pretty show of young women, and above them, the handsome old face and fine portly figure of the housekeeper towered pre-eminent. The pretty girl of whom Mr. Boythorn had told us was close by her, blushingly conscious of the eyes of the young fisherman, whom I discovered not far off. One handsome face, though not an agreeable one, seemed maliciously watchful of this pretty girl, and indeed of everyone there. It was a Frenchwoman's.\nAs the bell was still ringing, I had leisure to glance over the church, and to think what an ancient, solemn little church it was. The windows, heavily shaded by trees, admitted a subdued light that darkened the old monuments around me, and made the sunshine in the little porch seem very bright. A stir in that direction, and the reverential awe in the rustic faces, warned me that the great people were arriving and that the service was going to begin.\n\" 'Enter not into judgment with thy servant, O Lord, for in thy sight-' \"\nShall I ever forget the rapid beating at my heart, caused by the look I met as I stood up! Shall I ever forget the manner in which those handsome proud eyes seemed to spring out of their languor and to hold mine! It was only a moment before I cast mine down on my book; but I knew the beautiful face quite well in that short space of time.\nAnd, very strangely, there was something quickened within me, associated with the lonely days at my godmother's; yes, even to the days when I had stood on tiptoe to dress myself at my little glass after dressing my doll. Yet I had never seen this lady's face before in all my life - I was quite sure of it.\nIt was easy to know that the ceremonious, gouty old gentleman, the only other person in the great pew, was Sir Leicester Dedlock, and that the lady was Lady Dedlock. But why her face should be like a broken glass to me, in which I saw confused scraps of old remembrances, and why I should be so fluttered and troubled by having casually met her eyes, I could not think.\nI tried to overcome this weakness by attending to the words I heard. Strangely, I seemed to hear them, not in the reader's voice, but in the well-remembered voice of my godmother. This made me think, did Lady Dedlock's face accidentally resemble my godmother's? Maybe it did, a little; but the expression was quite different, without the stern decision of my godmother's face. The loftiness and haughtiness of Lady Dedlock's face was unlike anyone I knew. And yet I - little Esther Summerson, the child who lived a life apart and on whose birthday there was no rejoicing - seemed to arise before my own eyes, evoked out of the past by some power in this fashionable lady, whom I had never seen until that hour.\nTrembling in this unaccountable agitation, I was conscious of being distressed even by the observation of the French maid, though I knew she had been looking watchfully here, and there, and everywhere. Very slowly, I at last overcame my strange emotion. After a long time, I looked towards Lady Dedlock again, before the sermon. She took no heed of me, and the beating at my heart was gone. Neither did it revive for more than a few moments when she once or twice afterwards glanced at Ada or at me.\nAfter the service, Sir Leicester gave his arm with much gallantry to Lady Dedlock - though he could only walk with a stick - and escorted her out to their carriage. The servants then dispersed, and so did the congregation, whom Sir Leicester had contemplated (Mr. Skimpole, said to Mr. Boythorn's delight) as if he were a landed proprietor in heaven.\n\"He believes he is!\" said Mr. Boythorn. \"He firmly believes it!\"\n\"Do you know,\" pursued Mr. Skimpole unexpectedly, \"it's agreeable to me to see a man of that sort.\"\n\"Is it!\" said Mr. Boythorn.\n\"Say that he wants to patronize me,\" pursued Mr. Skimpole. \"Very well! I don't object.\"\n\"I do,\" said Mr. Boythorn with great vigour.\n\"Do you really?\" returned Mr. Skimpole in his easy light vein. \"But that's taking trouble, surely. And why should you take trouble? Here am I, content to receive things childishly as they fall out, and I never take trouble! I come down here, for instance, and I find a mighty potentate exacting homage. Very well! I say 'Mighty potentate, here is my homage! It's easier to give it than to withhold it. Here it is.' That's my view of such things, speaking as a child!\"\n\"But suppose you went somewhere else tomorrow,\" said Mr. Boythorn, \"where there was the opposite of that fellow. How then?\"\n\"How then?\" said Mr. Skimpole. \"Just the same then! I should say, 'My esteemed Boythorn' - to make you the personification of our imaginary friend - 'do you object to the mighty potentate? Very good. So do I. Everybody's business in the social system is to be agreeable. It's a system of harmony, in short. Therefore if you object, I object. Now, excellent Boythorn, let us go to dinner!'\"\n\"But excellent Boythorn might say,\" returned our host, swelling and growing very red, \"I'll be-\"\n\"I understand,\" said Mr. Skimpole. \"Very likely he would.\"\n\"-if I will go to dinner!\" cried Mr. Boythorn in a violent burst, striking his stick upon the ground. \"And he would probably add, 'Is there such a thing as principle, Mr. Harold Skimpole?'\"\n\"To which Harold Skimpole would reply, you know,\" he returned in his gayest manner, \" 'Upon my life I have not the least idea! I don't know what it is you call by that name. If you possess it and find it comfortable, I am quite delighted and congratulate you heartily. But I know nothing about it, I assure you; for I am a mere child, and I lay no claim to it!' So, you see, excellent Boythorn and I would go to dinner after all!\"\nThis was one of many little dialogues between them which I always expected to end in some violent explosion on the part of our host. But he had so high a sense of his hospitable duty, and my guardian laughed so sincerely at and with Mr. Skimpole, that matters never went beyond this point. Mr. Skimpole, who always seemed quite unconscious of having been on delicate ground, would then begin some sketch in the park which he never finished, or play fragments on the piano, or lie down on his back under a tree looking at the sky, an occupation which he said suited him exactly.\n\"Enterprise and effort,\" he would say to us (on his back), \"are delightful to me. I have the deepest sympathy with them. I lie in a shady place like this and think of adventurous spirits going to the North Pole or the tropics with admiration. Take an extreme case. Take the case of the slaves on American plantations. I dare say they are worked hard, I dare say they don't altogether like it; but they people the landscape for me, they give it a poetry for me, and perhaps that is one of the pleasanter objects of their existence. I shouldn't wonder if it were!\"\nI always wondered on these occasions whether he ever thought of Mrs. Skimpole and the children. So far as I could understand, they were rarely present in his mind at all.\nA week passed; and every day had been so bright and blue that to ramble in the woods, and to see the light striking down among the leaves and sparkling in the beautiful interlacings of the shadows of the trees, while the birds poured out their songs, had been most delightful. We had one favourite spot, deep in moss and last year's leaves, where there were some felled trees. Seated among these, we looked through a green vista supported by thousands of natural columns. On Saturday we sat here, Mr. Jarndyce, Ada, and I, until we heard thunder muttering in the distance and felt large raindrops rattle through the leaves.\nThe storm broke so suddenly that before we reached the outskirts of the wood the thunder and lightning were frequent, and the rain came plunging through the leaves like great leaden beads. We ran out of the wood, and made for a keeper's lodge which was close at hand. We had often noticed the dark beauty of this lodge standing in a deep twilight of trees, with ivy clustered over it.\nA man came to the door and set out two chairs for Ada and me. The lodge was dark within; but the lattice-windows were all thrown open, and we sat just inside the doorway watching the storm. It was grand to see how the wind awoke, and bent the trees, and drove the rain before it like a cloud of smoke; and to hear the solemn thunder and to see the lightning; while thinking with awe of the tremendous powers by which our little lives are encompassed, yet which already brought a freshness from all this rage which seemed to make creation new again.\n\"Is it not dangerous to sit in so exposed a place?\"\n\"Oh, no, Esther dear!\" said Ada quietly.\nAda said it to me, but I had not spoken.\nThe beating of my heart came back again. I had never heard the voice, as I had never seen the face, but it affected me in the same strange way. Again, in a moment, there arose before my mind innumerable pictures of myself.\nLady Dedlock had taken shelter in the lodge before our arrival and had come out of the gloom within. She stood behind my chair with her hand upon it, close to my shoulder.\n\"I have frightened you?\" she said.\nNo. It was not fright. Why should I be frightened?\n\"I believe,\" said Lady Dedlock to my guardian, \"I have the pleasure of speaking to Mr. Jarndyce. I recognized you in church on Sunday. I am sorry that any local disputes of Sir Leicester's should make it difficult to show you attention here.\"\n\"I am aware of the circumstances,\" returned my guardian with a smile, \"and I am obliged to you.\"\nShe had given him her hand in an indifferent way that seemed habitual to her and spoke in a correspondingly indifferent manner, though in a very pleasant voice. She was as graceful as she was beautiful, perfectly self-possessed, and had the air, I thought, of being able to attract and interest anyone if she thought it worth her while. The keeper brought her a chair, on which she sat between us.\n\"Is the young gentleman settled, of whom you wrote to Sir Leicester?\" she said to my guardian.\n\"I hope so,\" said he.\nShe seemed to respect him. There was something very winning in her haughty manner, as she spoke to him over her shoulder.\n\"I presume this is your other ward in Chancery, Miss Clare?\"\nHe presented Ada.\n\"But present me,\" and Lady Dedlock turned full upon me, \"to this young lady too!\"\n\"Miss Summerson really is my ward,\" said Mr. Jarndyce. \"I am responsible to no Lord Chancellor in her case.\"\n\"Has Miss Summerson lost both her parents?\" said my Lady.\n\"Yes.\"\n\"She is very fortunate in her guardian.\"\nLady Dedlock looked at me, and I looked at her and said I was indeed. All at once she turned from me with a hasty air, almost expressive of displeasure or dislike, and spoke to him over her shoulder again.\n\"Ages have passed since we were in the habit of meeting, Mr. Jarndyce.\"\n\"A long time. At least I thought it was a long time, until I saw you last Sunday,\" he returned.\n\"What! Even you are a courtier, or think it necessary to become one to me!\" she said with some disdain. \"I have achieved that reputation, I suppose.\"\n\"You have achieved so much, Lady Dedlock,\" said my guardian, \"that you pay some little penalty, I dare say. But none to me.\"\n\"So much!\" she repeated, slightly laughing. \"Yes!\"\nWith her air of superiority, and power, and fascination, she seemed to regard Ada and me as little more than children. She laughed and sat looking at the rain, self-possessed and occupied with her thoughts.\n\"I think you knew my sister when we were abroad together better than you know me?\" she said, looking at him again.\n\"Yes, we happened to meet oftener,\" he returned.\n\"We went our several ways,\" said Lady Dedlock, \"and had little in common even before we agreed to differ. It is to be regretted, I suppose, but it could not be helped.\"\nShe again sat looking at the rain. The storm soon began to pass. The shower abated, the lightning ceased; the thunder rolled among the distant hills, and the sun began to glisten on the wet leaves. As we sat there silently, we saw a little pony phaeton coming towards us at a merry pace.\n\"The messenger is coming back, my Lady,\" said the keeper, \"with the carriage.\"\nAs it drove up, we saw that there were two people inside. There alighted from it, with some cloaks and wrappers, first the Frenchwoman whom I had seen in church, and secondly the pretty girl. The Frenchwoman stepped out with a defiant confidence, the pretty girl confused and hesitating.\n\"What now?\" said Lady Dedlock. \"Two!\"\n\"I am your maid, my Lady, at the present,\" said the Frenchwoman. \"The message was for the maid.\"\n\"I was afraid you might mean me, my Lady,\" said the pretty girl.\n\"I did mean you, child,\" replied her mistress calmly. \"Put that shawl on me.\"\nShe slightly stooped her shoulders to receive it, and the pretty girl lightly dropped it in place. The Frenchwoman stood looking on with her lips very tightly set.\n\"I am sorry,\" said Lady Dedlock to Mr. Jarndyce, \"that we are not likely to renew our former acquaintance. You will allow me to send the carriage back for your two wards.\"\nBut as he declined this offer, she took a graceful leave of Ada - none of me - put her hand upon his proffered arm, and got into the carriage.\n\"Come in, child,\" she said to the pretty girl; \"Go on!\"\nThe carriage rolled away, and the Frenchwoman, with the wrappers she had brought hanging over her arm, remained standing there.\nI suppose there is nothing pride can so little bear as another's pride, and that she was punished for her imperious manner. Her retaliation was singular. She remained perfectly still until the carriage had turned into the drive, and then, without the least discomposure, slipped off her shoes, left them on the ground, and walked deliberately in the same direction through wet grass.\n\"Is that young woman mad?\" said my guardian.\n\"Oh, no, sir!\" said the keeper. \"But Hortense is mortal high and passionate; and what with having notice to leave, and having others put above her, she don't take kindly to it.\"\n\"But why should she walk shoeless through all that water?\" said my guardian.\n\"Why, indeed, sir, unless it is to cool her down!\" said the man.\n\"Or unless she fancies it's blood,\" said the woman. \"She'd as soon walk through that as anything else, I think, when her own blood's up!\"\nWe passed not far from the house a few minutes afterwards. Peaceful as it had looked when we first saw it, it looked even more so now, with a diamond spray glittering all about it, everything refreshed by the late rain, and the little carriage shining at the doorway like a fairy carriage made of silver. Very steadfastly and quietly walking towards it, went Mademoiselle Hortense, shoeless, through the wet grass.",
        "paragraph_chars": [
            [
                0,
                514
            ],
            [
                514,
                935
            ],
            [
                935,
                1136
            ],
            [
                1136,
                1426
            ],
            [
                1426,
                1856
            ],
            [
                1856,
                2242
            ],
            [
                2242,
                2532
            ],
            [
                2532,
                3076
            ],
            [
                3076,
                3323
            ],
            [
                3323,
                3469
            ],
            [
                3469,
                3733
            ],
            [
                3733,
                3780
            ],
            [
                3780,
                4451
            ],
            [
                4451,
                4867
            ],
            [
                4867,
                5471
            ],
            [
                5471,
                5791
            ],
            [
                5791,
                5876
            ],
            [
                5876,
                6227
            ],
            [
                6227,
                6338
            ],
            [
                6338,
                6673
            ],
            [
                6673,
                6811
            ],
            [
                6811,
                7275
            ],
            [
                7275,
                7412
            ],
            [
                7412,
                7785
            ],
            [
                7785,
                7965
            ],
            [
                7965,
                8520
            ],
            [
                8520,
                8757
            ],
            [
                8757,
                9118
            ],
            [
                9118,
                9358
            ],
            [
                9358,
                9897
            ],
            [
                9897,
                10725
            ],
            [
                10725,
                10916
            ],
            [
                10916,
                11162
            ],
            [
                11162,
                11798
            ],
            [
                11798,
                12253
            ],
            [
                12253,
                12327
            ],
            [
                12327,
                12667
            ],
            [
                12667,
                12974
            ],
            [
                12974,
                13344
            ],
            [
                13344,
                14055
            ],
            [
                14055,
                14555
            ],
            [
                14555,
                14906
            ],
            [
                14906,
                14971
            ],
            [
                14971,
                15071
            ],
            [
                15071,
                15099
            ],
            [
                15099,
                15187
            ],
            [
                15187,
                15232
            ],
            [
                15232,
                15700
            ],
            [
                15700,
                15824
            ],
            [
                15824,
                16214
            ],
            [
                16214,
                16311
            ],
            [
                16311,
                16370
            ],
            [
                16370,
                16560
            ],
            [
                16560,
                16991
            ],
            [
                16991,
                17569
            ],
            [
                17569,
                18132
            ],
            [
                18132,
                18303
            ],
            [
                18303,
                18927
            ],
            [
                18927,
                19312
            ],
            [
                19312,
                19861
            ],
            [
                19861,
                19913
            ],
            [
                19913,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20218
            ],
            [
                20218,
                20390
            ],
            [
                20390,
                20425
            ],
            [
                20425,
                20476
            ],
            [
                20476,
                20719
            ],
            [
                20719,
                20816
            ],
            [
                20816,
                21214
            ],
            [
                21214,
                21309
            ],
            [
                21309,
                21331
            ],
            [
                21331,
                21453
            ],
            [
                21453,
                21514
            ],
            [
                21514,
                21532
            ],
            [
                21532,
                21614
            ],
            [
                21614,
                21723
            ],
            [
                21723,
                21781
            ],
            [
                21781,
                21788
            ],
            [
                21788,
                21829
            ],
            [
                21829,
                22035
            ],
            [
                22035,
                22107
            ],
            [
                22107,
                22203
            ],
            [
                22203,
                22353
            ],
            [
                22353,
                22478
            ],
            [
                22478,
                22529
            ],
            [
                22529,
                22736
            ],
            [
                22736,
                22851
            ],
            [
                22851,
                22900
            ],
            [
                22900,
                23069
            ],
            [
                23069,
                23357
            ],
            [
                23357,
                23436
            ],
            [
                23436,
                23724
            ],
            [
                23724,
                23762
            ],
            [
                23762,
                23859
            ],
            [
                23859,
                23924
            ],
            [
                23924,
                24002
            ],
            [
                24002,
                24166
            ],
            [
                24166,
                24338
            ],
            [
                24338,
                24481
            ],
            [
                24481,
                24537
            ],
            [
                24537,
                24665
            ],
            [
                24665,
                25049
            ],
            [
                25049,
                25094
            ],
            [
                25094,
                25272
            ],
            [
                25272,
                25349
            ],
            [
                25349,
                25414
            ],
            [
                25414,
                25552
            ],
            [
                25552,
                25966
            ]
        ],
        "segment_chars": [
            [
                0,
                101
            ],
            [
                101,
                143
            ],
            [
                143,
                238
            ],
            [
                238,
                271
            ],
            [
                271,
                378
            ],
            [
                378,
                514
            ],
            [
                514,
                617
            ],
            [
                617,
                761
            ],
            [
                761,
                833
            ],
            [
                833,
                935
            ],
            [
                935,
                1087
            ],
            [
                1087,
                1136
            ],
            [
                1136,
                1309
            ],
            [
                1309,
                1426
            ],
            [
                1426,
                1625
            ],
            [
                1625,
                1856
            ],
            [
                1856,
                1987
            ],
            [
                1987,
                2242
            ],
            [
                2242,
                2295
            ],
            [
                2295,
                2423
            ],
            [
                2423,
                2532
            ],
            [
                2532,
                2641
            ],
            [
                2641,
                2815
            ],
            [
                2815,
                2882
            ],
            [
                2882,
                3076
            ],
            [
                3076,
                3238
            ],
            [
                3238,
                3261
            ],
            [
                3261,
                3323
            ],
            [
                3323,
                3469
            ],
            [
                3469,
                3480
            ],
            [
                3480,
                3503
            ],
            [
                3503,
                3539
            ],
            [
                3539,
                3666
            ],
            [
                3666,
                3711
            ],
            [
                3711,
                3733
            ],
            [
                3733,
                3780
            ],
            [
                3780,
                3812
            ],
            [
                3812,
                3846
            ],
            [
                3846,
                3892
            ],
            [
                3892,
                3996
            ],
            [
                3996,
                4054
            ],
            [
                4054,
                4108
            ],
            [
                4108,
                4144
            ],
            [
                4144,
                4206
            ],
            [
                4206,
                4378
            ],
            [
                4378,
                4397
            ],
            [
                4397,
                4451
            ],
            [
                4451,
                4640
            ],
            [
                4640,
                4867
            ],
            [
                4867,
                4894
            ],
            [
                4894,
                5103
            ],
            [
                5103,
                5324
            ],
            [
                5324,
                5443
            ],
            [
                5443,
                5471
            ],
            [
                5471,
                5484
            ],
            [
                5484,
                5493
            ],
            [
                5493,
                5525
            ],
            [
                5525,
                5610
            ],
            [
                5610,
                5641
            ],
            [
                5641,
                5761
            ],
            [
                5761,
                5791
            ],
            [
                5791,
                5876
            ],
            [
                5876,
                5974
            ],
            [
                5974,
                6117
            ],
            [
                6117,
                6227
            ],
            [
                6227,
                6267
            ],
            [
                6267,
                6338
            ],
            [
                6338,
                6393
            ],
            [
                6393,
                6404
            ],
            [
                6404,
                6458
            ],
            [
                6458,
                6568
            ],
            [
                6568,
                6659
            ],
            [
                6659,
                6673
            ],
            [
                6673,
                6762
            ],
            [
                6762,
                6811
            ],
            [
                6811,
                6891
            ],
            [
                6891,
                6986
            ],
            [
                6986,
                7093
            ],
            [
                7093,
                7171
            ],
            [
                7171,
                7275
            ],
            [
                7275,
                7330
            ],
            [
                7330,
                7412
            ],
            [
                7412,
                7420
            ],
            [
                7420,
                7439
            ],
            [
                7439,
                7457
            ],
            [
                7457,
                7526
            ],
            [
                7526,
                7539
            ],
            [
                7539,
                7703
            ],
            [
                7703,
                7716
            ],
            [
                7716,
                7785
            ],
            [
                7785,
                7860
            ],
            [
                7860,
                7965
            ],
            [
                7965,
                8210
            ],
            [
                8210,
                8404
            ],
            [
                8404,
                8430
            ],
            [
                8430,
                8520
            ],
            [
                8520,
                8627
            ],
            [
                8627,
                8757
            ],
            [
                8757,
                8874
            ],
            [
                8874,
                9025
            ],
            [
                9025,
                9104
            ],
            [
                9104,
                9118
            ],
            [
                9118,
                9189
            ],
            [
                9189,
                9358
            ],
            [
                9358,
                9411
            ],
            [
                9411,
                9718
            ],
            [
                9718,
                9897
            ],
            [
                9897,
                10065
            ],
            [
                10065,
                10320
            ],
            [
                10320,
                10421
            ],
            [
                10421,
                10443
            ],
            [
                10443,
                10463
            ],
            [
                10463,
                10491
            ],
            [
                10491,
                10511
            ],
            [
                10511,
                10566
            ],
            [
                10566,
                10586
            ],
            [
                10586,
                10600
            ],
            [
                10600,
                10705
            ],
            [
                10705,
                10725
            ],
            [
                10725,
                10773
            ],
            [
                10773,
                10916
            ],
            [
                10916,
                10955
            ],
            [
                10955,
                11025
            ],
            [
                11025,
                11162
            ],
            [
                11162,
                11271
            ],
            [
                11271,
                11346
            ],
            [
                11346,
                11492
            ],
            [
                11492,
                11647
            ],
            [
                11647,
                11774
            ],
            [
                11774,
                11798
            ],
            [
                11798,
                11929
            ],
            [
                11929,
                12095
            ],
            [
                12095,
                12253
            ],
            [
                12253,
                12327
            ],
            [
                12327,
                12418
            ],
            [
                12418,
                12540
            ],
            [
                12540,
                12667
            ],
            [
                12667,
                12888
            ],
            [
                12888,
                12974
            ],
            [
                12974,
                13140
            ],
            [
                13140,
                13344
            ],
            [
                13344,
                13413
            ],
            [
                13413,
                13524
            ],
            [
                13524,
                13606
            ],
            [
                13606,
                13721
            ],
            [
                13721,
                13800
            ],
            [
                13800,
                14055
            ],
            [
                14055,
                14257
            ],
            [
                14257,
                14309
            ],
            [
                14309,
                14384
            ],
            [
                14384,
                14446
            ],
            [
                14446,
                14555
            ],
            [
                14555,
                14720
            ],
            [
                14720,
                14906
            ],
            [
                14906,
                14927
            ],
            [
                14927,
                14946
            ],
            [
                14946,
                14971
            ],
            [
                14971,
                15071
            ],
            [
                15071,
                15080
            ],
            [
                15080,
                15099
            ],
            [
                15099,
                15158
            ],
            [
                15158,
                15170
            ],
            [
                15170,
                15187
            ],
            [
                15187,
                15232
            ],
            [
                15232,
                15249
            ],
            [
                15249,
                15295
            ],
            [
                15295,
                15331
            ],
            [
                15331,
                15364
            ],
            [
                15364,
                15456
            ],
            [
                15456,
                15535
            ],
            [
                15535,
                15546
            ],
            [
                15546,
                15590
            ],
            [
                15590,
                15634
            ],
            [
                15634,
                15647
            ],
            [
                15647,
                15700
            ],
            [
                15700,
                15813
            ],
            [
                15813,
                15824
            ],
            [
                15824,
                15836
            ],
            [
                15836,
                15855
            ],
            [
                15855,
                15876
            ],
            [
                15876,
                16013
            ],
            [
                16013,
                16024
            ],
            [
                16024,
                16033
            ],
            [
                16033,
                16095
            ],
            [
                16095,
                16131
            ],
            [
                16131,
                16166
            ],
            [
                16166,
                16214
            ],
            [
                16214,
                16311
            ],
            [
                16311,
                16346
            ],
            [
                16346,
                16370
            ],
            [
                16370,
                16397
            ],
            [
                16397,
                16472
            ],
            [
                16472,
                16560
            ],
            [
                16560,
                16687
            ],
            [
                16687,
                16734
            ],
            [
                16734,
                16829
            ],
            [
                16829,
                16922
            ],
            [
                16922,
                16991
            ],
            [
                16991,
                17124
            ],
            [
                17124,
                17281
            ],
            [
                17281,
                17569
            ],
            [
                17569,
                17651
            ],
            [
                17651,
                17690
            ],
            [
                17690,
                17812
            ],
            [
                17812,
                17834
            ],
            [
                17834,
                17887
            ],
            [
                17887,
                18100
            ],
            [
                18100,
                18132
            ],
            [
                18132,
                18228
            ],
            [
                18228,
                18303
            ],
            [
                18303,
                18580
            ],
            [
                18580,
                18680
            ],
            [
                18680,
                18775
            ],
            [
                18775,
                18927
            ],
            [
                18927,
                19116
            ],
            [
                19116,
                19195
            ],
            [
                19195,
                19312
            ],
            [
                19312,
                19374
            ],
            [
                19374,
                19502
            ],
            [
                19502,
                19861
            ],
            [
                19861,
                19913
            ],
            [
                19913,
                19936
            ],
            [
                19936,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20036
            ],
            [
                20036,
                20139
            ],
            [
                20139,
                20218
            ],
            [
                20218,
                20319
            ],
            [
                20319,
                20390
            ],
            [
                20390,
                20415
            ],
            [
                20415,
                20425
            ],
            [
                20425,
                20429
            ],
            [
                20429,
                20448
            ],
            [
                20448,
                20476
            ],
            [
                20476,
                20573
            ],
            [
                20573,
                20611
            ],
            [
                20611,
                20719
            ],
            [
                20719,
                20816
            ],
            [
                20816,
                20977
            ],
            [
                20977,
                21153
            ],
            [
                21153,
                21214
            ],
            [
                21214,
                21284
            ],
            [
                21284,
                21309
            ],
            [
                21309,
                21331
            ],
            [
                21331,
                21358
            ],
            [
                21358,
                21453
            ],
            [
                21453,
                21514
            ],
            [
                21514,
                21532
            ],
            [
                21532,
                21614
            ],
            [
                21614,
                21669
            ],
            [
                21669,
                21723
            ],
            [
                21723,
                21767
            ],
            [
                21767,
                21781
            ],
            [
                21781,
                21788
            ],
            [
                21788,
                21829
            ],
            [
                21829,
                21899
            ],
            [
                21899,
                22035
            ],
            [
                22035,
                22107
            ],
            [
                22107,
                22121
            ],
            [
                22121,
                22203
            ],
            [
                22203,
                22210
            ],
            [
                22210,
                22279
            ],
            [
                22279,
                22307
            ],
            [
                22307,
                22353
            ],
            [
                22353,
                22461
            ],
            [
                22461,
                22478
            ],
            [
                22478,
                22489
            ],
            [
                22489,
                22522
            ],
            [
                22522,
                22529
            ],
            [
                22529,
                22648
            ],
            [
                22648,
                22736
            ],
            [
                22736,
                22819
            ],
            [
                22819,
                22851
            ],
            [
                22851,
                22900
            ],
            [
                22900,
                23006
            ],
            [
                23006,
                23069
            ],
            [
                23069,
                23104
            ],
            [
                23104,
                23134
            ],
            [
                23134,
                23267
            ],
            [
                23267,
                23357
            ],
            [
                23357,
                23436
            ],
            [
                23436,
                23494
            ],
            [
                23494,
                23628
            ],
            [
                23628,
                23724
            ],
            [
                23724,
                23736
            ],
            [
                23736,
                23755
            ],
            [
                23755,
                23762
            ],
            [
                23762,
                23827
            ],
            [
                23827,
                23859
            ],
            [
                23859,
                23924
            ],
            [
                23924,
                23978
            ],
            [
                23978,
                24002
            ],
            [
                24002,
                24101
            ],
            [
                24101,
                24166
            ],
            [
                24166,
                24273
            ],
            [
                24273,
                24338
            ],
            [
                24338,
                24481
            ],
            [
                24481,
                24537
            ],
            [
                24537,
                24665
            ],
            [
                24665,
                24789
            ],
            [
                24789,
                24819
            ],
            [
                24819,
                25049
            ],
            [
                25049,
                25076
            ],
            [
                25076,
                25094
            ],
            [
                25094,
                25109
            ],
            [
                25109,
                25126
            ],
            [
                25126,
                25272
            ],
            [
                25272,
                25331
            ],
            [
                25331,
                25349
            ],
            [
                25349,
                25400
            ],
            [
                25400,
                25414
            ],
            [
                25414,
                25466
            ],
            [
                25466,
                25552
            ],
            [
                25552,
                25611
            ],
            [
                25611,
                25857
            ],
            [
                25857,
                25966
            ]
        ],
        "overlap_chars": [
            [
                0,
                37
            ],
            [
                38,
                77
            ],
            [
                78,
                80
            ],
            [
                81,
                101
            ],
            [
                101,
                143
            ],
            [
                143,
                196
            ],
            [
                196,
                236
            ],
            [
                236,
                238
            ],
            [
                238,
                271
            ],
            [
                271,
                297
            ],
            [
                297,
                329
            ],
            [
                330,
                339
            ],
            [
                350,
                378
            ],
            [
                378,
                443
            ],
            [
                444,
                473
            ],
            [
                474,
                479
            ],
            [
                485,
                499
            ],
            [
                512,
                513
            ],
            [
                514,
                519
            ],
            [
                520,
                533
            ],
            [
                534,
                545
            ],
            [
                546,
                617
            ],
            [
                617,
                714
            ],
            [
                720,
                730
            ],
            [
                735,
                761
            ],
            [
                761,
                781
            ],
            [
                782,
                785
            ],
            [
                786,
                833
            ],
            [
                833,
                859
            ],
            [
                859,
                907
            ],
            [
                908,
                913
            ],
            [
                925,
                935
            ],
            [
                935,
                956
            ],
            [
                958,
                961
            ],
            [
                962,
                976
            ],
            [
                986,
                990
            ],
            [
                991,
                1002
            ],
            [
                1003,
                1014
            ],
            [
                1022,
                1059
            ],
            [
                1059,
                1085
            ],
            [
                1085,
                1086
            ],
            [
                1088,
                1097
            ],
            [
                1098,
                1105
            ],
            [
                1106,
                1133
            ],
            [
                1133,
                1136
            ],
            [
                1136,
                1307
            ],
            [
                1307,
                1309
            ],
            [
                1309,
                1328
            ],
            [
                1339,
                1350
            ],
            [
                1366,
                1368
            ],
            [
                1382,
                1425
            ],
            [
                1426,
                1458
            ],
            [
                1468,
                1474
            ],
            [
                1480,
                1498
            ],
            [
                1507,
                1526
            ],
            [
                1531,
                1556
            ],
            [
                1563,
                1581
            ],
            [
                1588,
                1598
            ],
            [
                1599,
                1625
            ],
            [
                1625,
                1725
            ],
            [
                1726,
                1819
            ],
            [
                1820,
                1855
            ],
            [
                1856,
                1987
            ],
            [
                1987,
                2020
            ],
            [
                2025,
                2030
            ],
            [
                2031,
                2040
            ],
            [
                2041,
                2144
            ],
            [
                2145,
                2156
            ],
            [
                2157,
                2165
            ],
            [
                2165,
                2213
            ],
            [
                2223,
                2240
            ],
            [
                2240,
                2242
            ],
            [
                2252,
                2295
            ],
            [
                2295,
                2304
            ],
            [
                2305,
                2312
            ],
            [
                2324,
                2336
            ],
            [
                2337,
                2344
            ],
            [
                2350,
                2356
            ],
            [
                2357,
                2413
            ],
            [
                2421,
                2423
            ],
            [
                2423,
                2443
            ],
            [
                2457,
                2532
            ],
            [
                2532,
                2558
            ],
            [
                2559,
                2641
            ],
            [
                2641,
                2667
            ],
            [
                2675,
                2796
            ],
            [
                2797,
                2815
            ],
            [
                2815,
                2825
            ],
            [
                2832,
                2857
            ],
            [
                2858,
                2861
            ],
            [
                2862,
                2872
            ],
            [
                2873,
                2880
            ],
            [
                2880,
                2882
            ],
            [
                2882,
                3051
            ],
            [
                3052,
                3076
            ],
            [
                3076,
                3123
            ],
            [
                3123,
                3238
            ],
            [
                3238,
                3261
            ],
            [
                3261,
                3270
            ],
            [
                3271,
                3320
            ],
            [
                3323,
                3469
            ],
            [
                3469,
                3480
            ],
            [
                3480,
                3503
            ],
            [
                3503,
                3510
            ],
            [
                3516,
                3537
            ],
            [
                3537,
                3538
            ],
            [
                3539,
                3552
            ],
            [
                3553,
                3556
            ],
            [
                3557,
                3560
            ],
            [
                3561,
                3664
            ],
            [
                3666,
                3711
            ],
            [
                3711,
                3733
            ],
            [
                3733,
                3780
            ],
            [
                3780,
                3812
            ],
            [
                3812,
                3813
            ],
            [
                3814,
                3818
            ],
            [
                3818,
                3821
            ],
            [
                3821,
                3846
            ],
            [
                3846,
                3890
            ],
            [
                3890,
                3892
            ],
            [
                3892,
                3918
            ],
            [
                3919,
                3951
            ],
            [
                3955,
                3966
            ],
            [
                3967,
                3993
            ],
            [
                3996,
                3998
            ],
            [
                4007,
                4054
            ],
            [
                4054,
                4108
            ],
            [
                4108,
                4144
            ],
            [
                4144,
                4206
            ],
            [
                4206,
                4358
            ],
            [
                4358,
                4359
            ],
            [
                4360,
                4378
            ],
            [
                4378,
                4397
            ],
            [
                4397,
                4451
            ],
            [
                4451,
                4465
            ],
            [
                4479,
                4494
            ],
            [
                4507,
                4566
            ],
            [
                4572,
                4640
            ],
            [
                4640,
                4726
            ],
            [
                4727,
                4738
            ],
            [
                4741,
                4828
            ],
            [
                4829,
                4867
            ],
            [
                4867,
                4894
            ],
            [
                4894,
                5054
            ],
            [
                5055,
                5103
            ],
            [
                5103,
                5160
            ],
            [
                5161,
                5167
            ],
            [
                5170,
                5184
            ],
            [
                5187,
                5226
            ],
            [
                5227,
                5242
            ],
            [
                5243,
                5322
            ],
            [
                5322,
                5324
            ],
            [
                5324,
                5356
            ],
            [
                5356,
                5357
            ],
            [
                5358,
                5425
            ],
            [
                5426,
                5443
            ],
            [
                5443,
                5469
            ],
            [
                5469,
                5471
            ],
            [
                5471,
                5484
            ],
            [
                5484,
                5491
            ],
            [
                5491,
                5493
            ],
            [
                5493,
                5498
            ],
            [
                5502,
                5525
            ],
            [
                5525,
                5539
            ],
            [
                5540,
                5610
            ],
            [
                5610,
                5623
            ],
            [
                5623,
                5634
            ],
            [
                5639,
                5640
            ],
            [
                5641,
                5685
            ],
            [
                5691,
                5699
            ],
            [
                5700,
                5759
            ],
            [
                5759,
                5760
            ],
            [
                5761,
                5763
            ],
            [
                5764,
                5791
            ],
            [
                5791,
                5809
            ],
            [
                5809,
                5874
            ],
            [
                5874,
                5876
            ],
            [
                5876,
                5905
            ],
            [
                5905,
                5974
            ],
            [
                5974,
                6097
            ],
            [
                6097,
                6114
            ],
            [
                6114,
                6117
            ],
            [
                6117,
                6120
            ],
            [
                6121,
                6227
            ],
            [
                6227,
                6267
            ],
            [
                6267,
                6326
            ],
            [
                6336,
                6338
            ],
            [
                6338,
                6393
            ],
            [
                6393,
                6404
            ],
            [
                6404,
                6421
            ],
            [
                6425,
                6458
            ],
            [
                6458,
                6467
            ],
            [
                6470,
                6472
            ],
            [
                6473,
                6501
            ],
            [
                6502,
                6545
            ],
            [
                6548,
                6560
            ],
            [
                6561,
                6568
            ],
            [
                6568,
                6626
            ],
            [
                6631,
                6633
            ],
            [
                6637,
                6649
            ],
            [
                6657,
                6659
            ],
            [
                6659,
                6673
            ],
            [
                6673,
                6762
            ],
            [
                6762,
                6811
            ],
            [
                6811,
                6851
            ],
            [
                6852,
                6856
            ],
            [
                6866,
                6870
            ],
            [
                6871,
                6889
            ],
            [
                6889,
                6891
            ],
            [
                6892,
                6921
            ],
            [
                6925,
                6986
            ],
            [
                6986,
                6989
            ],
            [
                6989,
                7074
            ],
            [
                7075,
                7093
            ],
            [
                7093,
                7111
            ],
            [
                7126,
                7127
            ],
            [
                7140,
                7158
            ],
            [
                7159,
                7160
            ],
            [
                7161,
                7169
            ],
            [
                7171,
                7172
            ],
            [
                7173,
                7253
            ],
            [
                7254,
                7275
            ],
            [
                7275,
                7287
            ],
            [
                7306,
                7309
            ],
            [
                7309,
                7330
            ],
            [
                7333,
                7338
            ],
            [
                7339,
                7365
            ],
            [
                7366,
                7385
            ],
            [
                7386,
                7412
            ],
            [
                7412,
                7420
            ],
            [
                7420,
                7439
            ],
            [
                7439,
                7455
            ],
            [
                7455,
                7457
            ],
            [
                7457,
                7473
            ],
            [
                7481,
                7526
            ],
            [
                7526,
                7539
            ],
            [
                7539,
                7584
            ],
            [
                7590,
                7596
            ],
            [
                7597,
                7703
            ],
            [
                7703,
                7716
            ],
            [
                7716,
                7726
            ],
            [
                7727,
                7732
            ],
            [
                7733,
                7756
            ],
            [
                7757,
                7785
            ],
            [
                7788,
                7821
            ],
            [
                7823,
                7833
            ],
            [
                7842,
                7858
            ],
            [
                7858,
                7859
            ],
            [
                7860,
                7919
            ],
            [
                7926,
                7956
            ],
            [
                7963,
                7964
            ],
            [
                7965,
                8071
            ],
            [
                8072,
                8153
            ],
            [
                8159,
                8210
            ],
            [
                8210,
                8254
            ],
            [
                8255,
                8265
            ],
            [
                8265,
                8290
            ],
            [
                8298,
                8318
            ],
            [
                8319,
                8332
            ],
            [
                8333,
                8336
            ],
            [
                8337,
                8348
            ],
            [
                8348,
                8370
            ],
            [
                8371,
                8402
            ],
            [
                8402,
                8404
            ],
            [
                8404,
                8408
            ],
            [
                8416,
                8418
            ],
            [
                8419,
                8428
            ],
            [
                8428,
                8430
            ],
            [
                8430,
                8468
            ],
            [
                8469,
                8474
            ],
            [
                8474,
                8520
            ],
            [
                8520,
                8622
            ],
            [
                8627,
                8639
            ],
            [
                8650,
                8717
            ],
            [
                8717,
                8718
            ],
            [
                8724,
                8757
            ],
            [
                8757,
                8807
            ],
            [
                8807,
                8814
            ],
            [
                8815,
                8874
            ],
            [
                8874,
                8907
            ],
            [
                8912,
                8962
            ],
            [
                8965,
                8996
            ],
            [
                8997,
                9025
            ],
            [
                9025,
                9036
            ],
            [
                9041,
                9063
            ],
            [
                9063,
                9064
            ],
            [
                9069,
                9092
            ],
            [
                9095,
                9097
            ],
            [
                9098,
                9104
            ],
            [
                9104,
                9118
            ],
            [
                9120,
                9130
            ],
            [
                9131,
                9173
            ],
            [
                9174,
                9187
            ],
            [
                9187,
                9188
            ],
            [
                9189,
                9239
            ],
            [
                9239,
                9356
            ],
            [
                9356,
                9357
            ],
            [
                9358,
                9368
            ],
            [
                9369,
                9411
            ],
            [
                9411,
                9598
            ],
            [
                9604,
                9655
            ],
            [
                9656,
                9718
            ],
            [
                9718,
                9741
            ],
            [
                9742,
                9754
            ],
            [
                9755,
                9773
            ],
            [
                9774,
                9781
            ],
            [
                9782,
                9795
            ],
            [
                9796,
                9871
            ],
            [
                9872,
                9877
            ],
            [
                9878,
                9883
            ],
            [
                9888,
                9891
            ],
            [
                9892,
                9895
            ],
            [
                9895,
                9896
            ],
            [
                9897,
                9991
            ],
            [
                9998,
                10019
            ],
            [
                10020,
                10065
            ],
            [
                10065,
                10166
            ],
            [
                10167,
                10192
            ],
            [
                10193,
                10195
            ],
            [
                10201,
                10214
            ],
            [
                10215,
                10218
            ],
            [
                10219,
                10239
            ],
            [
                10239,
                10244
            ],
            [
                10245,
                10269
            ],
            [
                10275,
                10278
            ],
            [
                10279,
                10285
            ],
            [
                10286,
                10320
            ],
            [
                10322,
                10344
            ],
            [
                10345,
                10359
            ],
            [
                10360,
                10364
            ],
            [
                10365,
                10421
            ],
            [
                10421,
                10443
            ],
            [
                10443,
                10463
            ],
            [
                10463,
                10475
            ],
            [
                10480,
                10489
            ],
            [
                10489,
                10491
            ],
            [
                10491,
                10511
            ],
            [
                10511,
                10550
            ],
            [
                10551,
                10566
            ],
            [
                10566,
                10586
            ],
            [
                10586,
                10600
            ],
            [
                10600,
                10610
            ],
            [
                10623,
                10681
            ],
            [
                10682,
                10685
            ],
            [
                10686,
                10705
            ],
            [
                10705,
                10724
            ],
            [
                10738,
                10745
            ],
            [
                10749,
                10761
            ],
            [
                10766,
                10771
            ],
            [
                10774,
                10810
            ],
            [
                10811,
                10848
            ],
            [
                10858,
                10859
            ],
            [
                10861,
                10913
            ],
            [
                10916,
                10955
            ],
            [
                10955,
                10983
            ],
            [
                10991,
                11025
            ],
            [
                11025,
                11042
            ],
            [
                11048,
                11071
            ],
            [
                11081,
                11114
            ],
            [
                11115,
                11162
            ],
            [
                11162,
                11208
            ],
            [
                11209,
                11215
            ],
            [
                11215,
                11216
            ],
            [
                11228,
                11269
            ],
            [
                11269,
                11271
            ],
            [
                11271,
                11307
            ],
            [
                11308,
                11344
            ],
            [
                11344,
                11346
            ],
            [
                11346,
                11437
            ],
            [
                11438,
                11492
            ],
            [
                11492,
                11557
            ],
            [
                11559,
                11579
            ],
            [
                11580,
                11647
            ],
            [
                11647,
                11650
            ],
            [
                11651,
                11659
            ],
            [
                11660,
                11665
            ],
            [
                11666,
                11672
            ],
            [
                11673,
                11693
            ],
            [
                11693,
                11757
            ],
            [
                11767,
                11774
            ],
            [
                11774,
                11798
            ],
            [
                11798,
                11813
            ],
            [
                11820,
                11827
            ],
            [
                11827,
                11869
            ],
            [
                11870,
                11887
            ],
            [
                11891,
                11929
            ],
            [
                11929,
                11996
            ],
            [
                11997,
                12013
            ],
            [
                12014,
                12023
            ],
            [
                12024,
                12033
            ],
            [
                12033,
                12038
            ],
            [
                12039,
                12043
            ],
            [
                12044,
                12076
            ],
            [
                12087,
                12095
            ],
            [
                12095,
                12120
            ],
            [
                12121,
                12124
            ],
            [
                12125,
                12128
            ],
            [
                12129,
                12165
            ],
            [
                12173,
                12202
            ],
            [
                12212,
                12253
            ],
            [
                12256,
                12322
            ],
            [
                12327,
                12377
            ],
            [
                12385,
                12418
            ],
            [
                12418,
                12540
            ],
            [
                12540,
                12584
            ],
            [
                12585,
                12667
            ],
            [
                12667,
                12784
            ],
            [
                12785,
                12888
            ],
            [
                12892,
                12947
            ],
            [
                12950,
                12972
            ],
            [
                12972,
                12974
            ],
            [
                12974,
                13021
            ],
            [
                13026,
                13051
            ],
            [
                13062,
                13140
            ],
            [
                13140,
                13166
            ],
            [
                13167,
                13208
            ],
            [
                13209,
                13217
            ],
            [
                13218,
                13291
            ],
            [
                13292,
                13344
            ],
            [
                13344,
                13345
            ],
            [
                13346,
                13363
            ],
            [
                13369,
                13377
            ],
            [
                13378,
                13413
            ],
            [
                13422,
                13524
            ],
            [
                13524,
                13606
            ],
            [
                13612,
                13652
            ],
            [
                13659,
                13669
            ],
            [
                13678,
                13696
            ],
            [
                13700,
                13719
            ],
            [
                13719,
                13721
            ],
            [
                13721,
                13773
            ],
            [
                13792,
                13793
            ],
            [
                13798,
                13800
            ],
            [
                13800,
                13809
            ],
            [
                13812,
                13914
            ],
            [
                13924,
                14022
            ],
            [
                14023,
                14055
            ],
            [
                14068,
                14096
            ],
            [
                14096,
                14097
            ],
            [
                14098,
                14255
            ],
            [
                14255,
                14257
            ],
            [
                14257,
                14309
            ],
            [
                14309,
                14363
            ],
            [
                14363,
                14384
            ],
            [
                14384,
                14446
            ],
            [
                14446,
                14553
            ],
            [
                14553,
                14555
            ],
            [
                14561,
                14572
            ],
            [
                14572,
                14610
            ],
            [
                14611,
                14636
            ],
            [
                14639,
                14648
            ],
            [
                14660,
                14664
            ],
            [
                14670,
                14671
            ],
            [
                14672,
                14677
            ],
            [
                14680,
                14700
            ],
            [
                14701,
                14703
            ],
            [
                14710,
                14718
            ],
            [
                14718,
                14720
            ],
            [
                14720,
                14813
            ],
            [
                14814,
                14827
            ],
            [
                14829,
                14851
            ],
            [
                14852,
                14876
            ],
            [
                14877,
                14906
            ],
            [
                14906,
                14927
            ],
            [
                14927,
                14946
            ],
            [
                14946,
                14968
            ],
            [
                14971,
                15006
            ],
            [
                15007,
                15019
            ],
            [
                15019,
                15071
            ],
            [
                15071,
                15080
            ],
            [
                15080,
                15099
            ],
            [
                15099,
                15158
            ],
            [
                15158,
                15170
            ],
            [
                15170,
                15187
            ],
            [
                15187,
                15232
            ],
            [
                15232,
                15249
            ],
            [
                15249,
                15295
            ],
            [
                15295,
                15331
            ],
            [
                15331,
                15364
            ],
            [
                15364,
                15456
            ],
            [
                15456,
                15535
            ],
            [
                15535,
                15546
            ],
            [
                15546,
                15590
            ],
            [
                15590,
                15634
            ],
            [
                15634,
                15644
            ],
            [
                15647,
                15700
            ],
            [
                15700,
                15721
            ],
            [
                15722,
                15736
            ],
            [
                15745,
                15811
            ],
            [
                15811,
                15813
            ],
            [
                15813,
                15824
            ],
            [
                15824,
                15836
            ],
            [
                15836,
                15853
            ],
            [
                15853,
                15855
            ],
            [
                15855,
                15876
            ],
            [
                15876,
                15912
            ],
            [
                15915,
                15970
            ],
            [
                15973,
                15974
            ],
            [
                15977,
                16013
            ],
            [
                16013,
                16024
            ],
            [
                16024,
                16032
            ],
            [
                16033,
                16095
            ],
            [
                16095,
                16131
            ],
            [
                16131,
                16166
            ],
            [
                16166,
                16214
            ],
            [
                16214,
                16308
            ],
            [
                16311,
                16346
            ],
            [
                16346,
                16370
            ],
            [
                16372,
                16397
            ],
            [
                16397,
                16434
            ],
            [
                16445,
                16472
            ],
            [
                16472,
                16560
            ],
            [
                16560,
                16642
            ],
            [
                16642,
                16643
            ],
            [
                16647,
                16687
            ],
            [
                16687,
                16732
            ],
            [
                16732,
                16734
            ],
            [
                16734,
                16829
            ],
            [
                16829,
                16919
            ],
            [
                16919,
                16922
            ],
            [
                16922,
                16991
            ],
            [
                16991,
                17072
            ],
            [
                17073,
                17124
            ],
            [
                17124,
                17168
            ],
            [
                17173,
                17237
            ],
            [
                17238,
                17281
            ],
            [
                17281,
                17365
            ],
            [
                17372,
                17376
            ],
            [
                17383,
                17434
            ],
            [
                17440,
                17449
            ],
            [
                17450,
                17466
            ],
            [
                17471,
                17500
            ],
            [
                17501,
                17519
            ],
            [
                17519,
                17520
            ],
            [
                17535,
                17543
            ],
            [
                17544,
                17548
            ],
            [
                17549,
                17559
            ],
            [
                17560,
                17569
            ],
            [
                17569,
                17651
            ],
            [
                17651,
                17690
            ],
            [
                17690,
                17782
            ],
            [
                17783,
                17786
            ],
            [
                17795,
                17812
            ],
            [
                17812,
                17834
            ],
            [
                17834,
                17887
            ],
            [
                17887,
                17960
            ],
            [
                17960,
                18100
            ],
            [
                18100,
                18132
            ],
            [
                18132,
                18226
            ],
            [
                18226,
                18228
            ],
            [
                18228,
                18262
            ],
            [
                18268,
                18274
            ],
            [
                18295,
                18303
            ],
            [
                18305,
                18309
            ],
            [
                18316,
                18433
            ],
            [
                18434,
                18552
            ],
            [
                18552,
                18580
            ],
            [
                18580,
                18678
            ],
            [
                18678,
                18680
            ],
            [
                18680,
                18773
            ],
            [
                18773,
                18775
            ],
            [
                18778,
                18883
            ],
            [
                18884,
                18927
            ],
            [
                18927,
                18954
            ],
            [
                18955,
                19043
            ],
            [
                19043,
                19044
            ],
            [
                19045,
                19090
            ],
            [
                19096,
                19108
            ],
            [
                19114,
                19116
            ],
            [
                19116,
                19138
            ],
            [
                19138,
                19195
            ],
            [
                19195,
                19283
            ],
            [
                19289,
                19310
            ],
            [
                19310,
                19312
            ],
            [
                19314,
                19317
            ],
            [
                19318,
                19334
            ],
            [
                19335,
                19338
            ],
            [
                19347,
                19374
            ],
            [
                19393,
                19399
            ],
            [
                19405,
                19462
            ],
            [
                19470,
                19502
            ],
            [
                19502,
                19670
            ],
            [
                19671,
                19762
            ],
            [
                19773,
                19780
            ],
            [
                19789,
                19800
            ],
            [
                19801,
                19814
            ],
            [
                19815,
                19861
            ],
            [
                19861,
                19913
            ],
            [
                19913,
                19936
            ],
            [
                19936,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20036
            ],
            [
                20036,
                20139
            ],
            [
                20139,
                20218
            ],
            [
                20218,
                20280
            ],
            [
                20281,
                20319
            ],
            [
                20319,
                20366
            ],
            [
                20368,
                20388
            ],
            [
                20388,
                20390
            ],
            [
                20390,
                20415
            ],
            [
                20415,
                20425
            ],
            [
                20425,
                20429
            ],
            [
                20429,
                20448
            ],
            [
                20448,
                20474
            ],
            [
                20476,
                20571
            ],
            [
                20573,
                20611
            ],
            [
                20611,
                20664
            ],
            [
                20665,
                20671
            ],
            [
                20677,
                20679
            ],
            [
                20690,
                20701
            ],
            [
                20702,
                20719
            ],
            [
                20719,
                20793
            ],
            [
                20796,
                20798
            ],
            [
                20799,
                20806
            ],
            [
                20813,
                20816
            ],
            [
                20816,
                20977
            ],
            [
                20977,
                21110
            ],
            [
                21118,
                21124
            ],
            [
                21125,
                21153
            ],
            [
                21153,
                21163
            ],
            [
                21164,
                21183
            ],
            [
                21185,
                21201
            ],
            [
                21202,
                21214
            ],
            [
                21214,
                21237
            ],
            [
                21247,
                21281
            ],
            [
                21281,
                21284
            ],
            [
                21284,
                21292
            ],
            [
                21293,
                21309
            ],
            [
                21309,
                21331
            ],
            [
                21331,
                21356
            ],
            [
                21356,
                21358
            ],
            [
                21358,
                21413
            ],
            [
                21414,
                21453
            ],
            [
                21453,
                21487
            ],
            [
                21499,
                21514
            ],
            [
                21514,
                21530
            ],
            [
                21530,
                21532
            ],
            [
                21533,
                21553
            ],
            [
                21567,
                21614
            ],
            [
                21614,
                21669
            ],
            [
                21669,
                21723
            ],
            [
                21723,
                21767
            ],
            [
                21767,
                21781
            ],
            [
                21781,
                21788
            ],
            [
                21788,
                21829
            ],
            [
                21829,
                21899
            ],
            [
                21899,
                22035
            ],
            [
                22035,
                22107
            ],
            [
                22107,
                22121
            ],
            [
                22121,
                22203
            ],
            [
                22203,
                22210
            ],
            [
                22210,
                22279
            ],
            [
                22279,
                22307
            ],
            [
                22307,
                22353
            ],
            [
                22353,
                22461
            ],
            [
                22461,
                22478
            ],
            [
                22478,
                22489
            ],
            [
                22489,
                22522
            ],
            [
                22522,
                22529
            ],
            [
                22529,
                22584
            ],
            [
                22584,
                22648
            ],
            [
                22648,
                22651
            ],
            [
                22652,
                22663
            ],
            [
                22664,
                22688
            ],
            [
                22689,
                22707
            ],
            [
                22717,
                22725
            ],
            [
                22726,
                22734
            ],
            [
                22734,
                22736
            ],
            [
                22736,
                22819
            ],
            [
                22819,
                22851
            ],
            [
                22851,
                22900
            ],
            [
                22900,
                23006
            ],
            [
                23006,
                23069
            ],
            [
                23073,
                23104
            ],
            [
                23104,
                23132
            ],
            [
                23132,
                23134
            ],
            [
                23134,
                23144
            ],
            [
                23145,
                23173
            ],
            [
                23175,
                23265
            ],
            [
                23265,
                23267
            ],
            [
                23267,
                23282
            ],
            [
                23283,
                23357
            ],
            [
                23357,
                23436
            ],
            [
                23436,
                23494
            ],
            [
                23494,
                23626
            ],
            [
                23628,
                23643
            ],
            [
                23656,
                23724
            ],
            [
                23724,
                23736
            ],
            [
                23736,
                23755
            ],
            [
                23755,
                23762
            ],
            [
                23762,
                23827
            ],
            [
                23827,
                23851
            ],
            [
                23856,
                23859
            ],
            [
                23859,
                23924
            ],
            [
                23924,
                23978
            ],
            [
                23978,
                24002
            ],
            [
                24002,
                24093
            ],
            [
                24094,
                24101
            ],
            [
                24101,
                24122
            ],
            [
                24123,
                24166
            ],
            [
                24166,
                24273
            ],
            [
                24273,
                24335
            ],
            [
                24338,
                24347
            ],
            [
                24357,
                24401
            ],
            [
                24404,
                24414
            ],
            [
                24417,
                24479
            ],
            [
                24479,
                24481
            ],
            [
                24481,
                24529
            ],
            [
                24529,
                24537
            ],
            [
                24537,
                24657
            ],
            [
                24663,
                24665
            ],
            [
                24665,
                24716
            ],
            [
                24717,
                24719
            ],
            [
                24730,
                24735
            ],
            [
                24735,
                24789
            ],
            [
                24789,
                24808
            ],
            [
                24809,
                24817
            ],
            [
                24817,
                24819
            ],
            [
                24819,
                24934
            ],
            [
                24934,
                25037
            ],
            [
                25038,
                25049
            ],
            [
                25049,
                25076
            ],
            [
                25076,
                25094
            ],
            [
                25094,
                25109
            ],
            [
                25109,
                25124
            ],
            [
                25124,
                25126
            ],
            [
                25127,
                25130
            ],
            [
                25143,
                25149
            ],
            [
                25150,
                25272
            ],
            [
                25272,
                25331
            ],
            [
                25331,
                25349
            ],
            [
                25349,
                25400
            ],
            [
                25400,
                25414
            ],
            [
                25414,
                25466
            ],
            [
                25466,
                25538
            ],
            [
                25544,
                25552
            ],
            [
                25552,
                25611
            ],
            [
                25611,
                25732
            ],
            [
                25733,
                25857
            ],
            [
                25857,
                25904
            ],
            [
                25904,
                25966
            ]
        ],
        "row_chars": [
            [
                0,
                101
            ],
            [
                101,
                143
            ],
            [
                143,
                238
            ],
            [
                238,
                271
            ],
            [
                271,
                378
            ],
            [
                378,
                514
            ],
            [
                514,
                617
            ],
            [
                617,
                761
            ],
            [
                761,
                833
            ],
            [
                833,
                935
            ],
            [
                935,
                1087
            ],
            [
                1087,
                1136
            ],
            [
                1136,
                1309
            ],
            [
                1309,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1426
            ],
            [
                1426,
                1625
            ],
            [
                1625,
                1856
            ],
            [
                1856,
                1987
            ],
            [
                1987,
                2242
            ],
            [
                2242,
                2295
            ],
            [
                2295,
                2423
            ],
            [
                2423,
                2532
            ],
            [
                2532,
                2641
            ],
            [
                2641,
                2815
            ],
            [
                2815,
                2882
            ],
            [
                2882,
                3076
            ],
            [
                3076,
                3238
            ],
            [
                3238,
                3261
            ],
            [
                3261,
                3261
            ],
            [
                3261,
                3323
            ],
            [
                3323,
                3323
            ],
            [
                3323,
                3323
            ],
            [
                3323,
                3323
            ],
            [
                3323,
                3469
            ],
            [
                3469,
                3480
            ],
            [
                3480,
                3503
            ],
            [
                3503,
                3666
            ],
            [
                3666,
                3711
            ],
            [
                3711,
                3733
            ],
            [
                3733,
                3780
            ],
            [
                3780,
                3780
            ],
            [
                3780,
                3812
            ],
            [
                3812,
                3812
            ],
            [
                3812,
                3812
            ],
            [
                3812,
                3846
            ],
            [
                3846,
                3892
            ],
            [
                3892,
                3892
            ],
            [
                3892,
                3996
            ],
            [
                3996,
                3996
            ],
            [
                3996,
                4054
            ],
            [
                4054,
                4108
            ],
            [
                4108,
                4144
            ],
            [
                4144,
                4206
            ],
            [
                4206,
                4378
            ],
            [
                4378,
                4397
            ],
            [
                4397,
                4451
            ],
            [
                4451,
                4451
            ],
            [
                4451,
                4640
            ],
            [
                4640,
                4867
            ],
            [
                4867,
                4894
            ],
            [
                4894,
                5103
            ],
            [
                5103,
                5324
            ],
            [
                5324,
                5324
            ],
            [
                5324,
                5443
            ],
            [
                5443,
                5471
            ],
            [
                5471,
                5484
            ],
            [
                5484,
                5493
            ],
            [
                5493,
                5525
            ],
            [
                5525,
                5610
            ],
            [
                5610,
                5791
            ],
            [
                5791,
                5791
            ],
            [
                5791,
                5791
            ],
            [
                5791,
                5876
            ],
            [
                5876,
                5974
            ],
            [
                5974,
                6117
            ],
            [
                6117,
                6227
            ],
            [
                6227,
                6267
            ],
            [
                6267,
                6338
            ],
            [
                6338,
                6393
            ],
            [
                6393,
                6404
            ],
            [
                6404,
                6458
            ],
            [
                6458,
                6568
            ],
            [
                6568,
                6568
            ],
            [
                6568,
                6659
            ],
            [
                6659,
                6673
            ],
            [
                6673,
                6762
            ],
            [
                6762,
                6811
            ],
            [
                6811,
                6891
            ],
            [
                6891,
                6986
            ],
            [
                6986,
                7093
            ],
            [
                7093,
                7275
            ],
            [
                7275,
                7330
            ],
            [
                7330,
                7330
            ],
            [
                7330,
                7412
            ],
            [
                7412,
                7420
            ],
            [
                7420,
                7439
            ],
            [
                7439,
                7457
            ],
            [
                7457,
                7457
            ],
            [
                7457,
                7526
            ],
            [
                7526,
                7539
            ],
            [
                7539,
                7703
            ],
            [
                7703,
                7716
            ],
            [
                7716,
                7716
            ],
            [
                7716,
                7785
            ],
            [
                7785,
                7860
            ],
            [
                7860,
                7965
            ],
            [
                7965,
                8210
            ],
            [
                8210,
                8404
            ],
            [
                8404,
                8430
            ],
            [
                8430,
                8520
            ],
            [
                8520,
                8757
            ],
            [
                8757,
                8874
            ],
            [
                8874,
                9025
            ],
            [
                9025,
                9104
            ],
            [
                9104,
                9118
            ],
            [
                9118,
                9118
            ],
            [
                9118,
                9118
            ],
            [
                9118,
                9118
            ],
            [
                9118,
                9189
            ],
            [
                9189,
                9358
            ],
            [
                9358,
                9411
            ],
            [
                9411,
                9718
            ],
            [
                9718,
                9897
            ],
            [
                9897,
                9897
            ],
            [
                9897,
                10065
            ],
            [
                10065,
                10320
            ],
            [
                10320,
                10421
            ],
            [
                10421,
                10443
            ],
            [
                10443,
                10463
            ],
            [
                10463,
                10491
            ],
            [
                10491,
                10511
            ],
            [
                10511,
                10566
            ],
            [
                10566,
                10586
            ],
            [
                10586,
                10600
            ],
            [
                10600,
                10705
            ],
            [
                10705,
                10725
            ],
            [
                10725,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10916
            ],
            [
                10916,
                10916
            ],
            [
                10916,
                10916
            ],
            [
                10916,
                10955
            ],
            [
                10955,
                11025
            ],
            [
                11025,
                11162
            ],
            [
                11162,
                11271
            ],
            [
                11271,
                11346
            ],
            [
                11346,
                11492
            ],
            [
                11492,
                11647
            ],
            [
                11647,
                11774
            ],
            [
                11774,
                11798
            ],
            [
                11798,
                11929
            ],
            [
                11929,
                12095
            ],
            [
                12095,
                12253
            ],
            [
                12253,
                12327
            ],
            [
                12327,
                12418
            ],
            [
                12418,
                12540
            ],
            [
                12540,
                12667
            ],
            [
                12667,
                12888
            ],
            [
                12888,
                12974
            ],
            [
                12974,
                13140
            ],
            [
                13140,
                13344
            ],
            [
                13344,
                13413
            ],
            [
                13413,
                13524
            ],
            [
                13524,
                13606
            ],
            [
                13606,
                13721
            ],
            [
                13721,
                13800
            ],
            [
                13800,
                14055
            ],
            [
                14055,
                14257
            ],
            [
                14257,
                14309
            ],
            [
                14309,
                14384
            ],
            [
                14384,
                14446
            ],
            [
                14446,
                14555
            ],
            [
                14555,
                14720
            ],
            [
                14720,
                14906
            ],
            [
                14906,
                14927
            ],
            [
                14927,
                14946
            ],
            [
                14946,
                14971
            ],
            [
                14971,
                14971
            ],
            [
                14971,
                15071
            ],
            [
                15071,
                15080
            ],
            [
                15080,
                15099
            ],
            [
                15099,
                15158
            ],
            [
                15158,
                15170
            ],
            [
                15170,
                15187
            ],
            [
                15187,
                15232
            ],
            [
                15232,
                15249
            ],
            [
                15249,
                15295
            ],
            [
                15295,
                15331
            ],
            [
                15331,
                15364
            ],
            [
                15364,
                15456
            ],
            [
                15456,
                15535
            ],
            [
                15535,
                15546
            ],
            [
                15546,
                15590
            ],
            [
                15590,
                15634
            ],
            [
                15634,
                15647
            ],
            [
                15647,
                15647
            ],
            [
                15647,
                15647
            ],
            [
                15647,
                15647
            ],
            [
                15647,
                15647
            ],
            [
                15647,
                15647
            ],
            [
                15647,
                15700
            ],
            [
                15700,
                15813
            ],
            [
                15813,
                15824
            ],
            [
                15824,
                15836
            ],
            [
                15836,
                15855
            ],
            [
                15855,
                15876
            ],
            [
                15876,
                16013
            ],
            [
                16013,
                16024
            ],
            [
                16024,
                16095
            ],
            [
                16095,
                16131
            ],
            [
                16131,
                16166
            ],
            [
                16166,
                16214
            ],
            [
                16214,
                16311
            ],
            [
                16311,
                16346
            ],
            [
                16346,
                16370
            ],
            [
                16370,
                16397
            ],
            [
                16397,
                16472
            ],
            [
                16472,
                16560
            ],
            [
                16560,
                16687
            ],
            [
                16687,
                16734
            ],
            [
                16734,
                16829
            ],
            [
                16829,
                16922
            ],
            [
                16922,
                16991
            ],
            [
                16991,
                17124
            ],
            [
                17124,
                17281
            ],
            [
                17281,
                17569
            ],
            [
                17569,
                17651
            ],
            [
                17651,
                17651
            ],
            [
                17651,
                17690
            ],
            [
                17690,
                17812
            ],
            [
                17812,
                17812
            ],
            [
                17812,
                17812
            ],
            [
                17812,
                17812
            ],
            [
                17812,
                17834
            ],
            [
                17834,
                17887
            ],
            [
                17887,
                18100
            ],
            [
                18100,
                18132
            ],
            [
                18132,
                18228
            ],
            [
                18228,
                18303
            ],
            [
                18303,
                18580
            ],
            [
                18580,
                18680
            ],
            [
                18680,
                18775
            ],
            [
                18775,
                18927
            ],
            [
                18927,
                19116
            ],
            [
                19116,
                19195
            ],
            [
                19195,
                19312
            ],
            [
                19312,
                19374
            ],
            [
                19374,
                19502
            ],
            [
                19502,
                19861
            ],
            [
                19861,
                19913
            ],
            [
                19913,
                19936
            ],
            [
                19936,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20036
            ],
            [
                20036,
                20139
            ],
            [
                20139,
                20218
            ],
            [
                20218,
                20319
            ],
            [
                20319,
                20390
            ],
            [
                20390,
                20415
            ],
            [
                20415,
                20425
            ],
            [
                20425,
                20429
            ],
            [
                20429,
                20448
            ],
            [
                20448,
                20476
            ],
            [
                20476,
                20573
            ],
            [
                20573,
                20573
            ],
            [
                20573,
                20611
            ],
            [
                20611,
                20719
            ],
            [
                20719,
                20816
            ],
            [
                20816,
                20977
            ],
            [
                20977,
                21153
            ],
            [
                21153,
                21214
            ],
            [
                21214,
                21284
            ],
            [
                21284,
                21309
            ],
            [
                21309,
                21331
            ],
            [
                21331,
                21358
            ],
            [
                21358,
                21453
            ],
            [
                21453,
                21514
            ],
            [
                21514,
                21532
            ],
            [
                21532,
                21532
            ],
            [
                21532,
                21614
            ],
            [
                21614,
                21669
            ],
            [
                21669,
                21723
            ],
            [
                21723,
                21767
            ],
            [
                21767,
                21781
            ],
            [
                21781,
                21788
            ],
            [
                21788,
                21829
            ],
            [
                21829,
                21899
            ],
            [
                21899,
                22035
            ],
            [
                22035,
                22107
            ],
            [
                22107,
                22121
            ],
            [
                22121,
                22203
            ],
            [
                22203,
                22210
            ],
            [
                22210,
                22279
            ],
            [
                22279,
                22307
            ],
            [
                22307,
                22353
            ],
            [
                22353,
                22461
            ],
            [
                22461,
                22478
            ],
            [
                22478,
                22489
            ],
            [
                22489,
                22522
            ],
            [
                22522,
                22529
            ],
            [
                22529,
                22648
            ],
            [
                22648,
                22736
            ],
            [
                22736,
                22819
            ],
            [
                22819,
                22851
            ],
            [
                22851,
                22900
            ],
            [
                22900,
                23006
            ],
            [
                23006,
                23069
            ],
            [
                23069,
                23104
            ],
            [
                23104,
                23134
            ],
            [
                23134,
                23267
            ],
            [
                23267,
                23357
            ],
            [
                23357,
                23436
            ],
            [
                23436,
                23494
            ],
            [
                23494,
                23724
            ],
            [
                23724,
                23736
            ],
            [
                23736,
                23755
            ],
            [
                23755,
                23762
            ],
            [
                23762,
                23827
            ],
            [
                23827,
                23859
            ],
            [
                23859,
                23924
            ],
            [
                23924,
                23978
            ],
            [
                23978,
                24002
            ],
            [
                24002,
                24101
            ],
            [
                24101,
                24166
            ],
            [
                24166,
                24273
            ],
            [
                24273,
                24338
            ],
            [
                24338,
                24338
            ],
            [
                24338,
                24481
            ],
            [
                24481,
                24537
            ],
            [
                24537,
                24665
            ],
            [
                24665,
                24789
            ],
            [
                24789,
                24819
            ],
            [
                24819,
                25049
            ],
            [
                25049,
                25076
            ],
            [
                25076,
                25094
            ],
            [
                25094,
                25109
            ],
            [
                25109,
                25126
            ],
            [
                25126,
                25126
            ],
            [
                25126,
                25126
            ],
            [
                25126,
                25272
            ],
            [
                25272,
                25331
            ],
            [
                25331,
                25349
            ],
            [
                25349,
                25400
            ],
            [
                25400,
                25414
            ],
            [
                25414,
                25466
            ],
            [
                25466,
                25552
            ],
            [
                25552,
                25611
            ],
            [
                25611,
                25857
            ],
            [
                25857,
                25966
            ]
        ]
    }
}