{
    "original": {
        "text": "It is the long vacation in the regions of Chancery Lane. The good ships Law and Equity, those teak-built, copper-bottomed, iron-fastened, brazen-faced, and not by any means fast-sailing clippers are laid up in ordinary. The Flying Dutchman, with a crew of ghostly clients imploring all whom they may encounter to peruse their papers, has drifted, for the time being, heaven knows where. The courts are all shut up; the public offices lie in a hot sleep. Westminster Hall itself is a shady solitude where nightingales might sing, and a tenderer class of suitors than is usually found there, walk.\nThe Temple, Chancery Lane, Serjeants' Inn, and Lincoln's Inn even unto the Fields are like tidal harbours at low water, where stranded proceedings, offices at anchor, idle clerks lounging on lop-sided stools that will not recover their perpendicular until the current of Term sets in, lie high and dry upon the ooze of the long vacation. Outer doors of chambers are shut up by the score, messages and parcels are to be left at the Porter's Lodge by the bushel. A crop of grass would grow in the chinks of the stone pavement outside Lincoln's Inn Hall, but that the ticket-porters, who have nothing to do beyond sitting in the shade there, with their white aprons over their heads to keep the flies off, grub it up and eat it thoughtfully.\nThere is only one judge in town. Even he only comes twice a week to sit in chambers. If the country folks of those assize towns on his circuit could see him now! No full-bottomed wig, no red petticoats, no fur, no javelin-men, no white wands. Merely a close-shaved gentleman in white trousers and a white hat, with sea-bronze on the judicial countenance, and a strip of bark peeled by the solar rays from the judicial nose, who calls in at the shell-fish shop as he comes along and drinks iced ginger-beer!\nThe bar of England is scattered over the face of the earth. How England can get on through four long summer months without its bar--which is its acknowledged refuge in adversity and its only legitimate triumph in prosperity--is beside the question; assuredly that shield and buckler of Britannia are not in present wear. The learned gentleman who is always so tremendously indignant at the unprecedented outrage committed on the feelings of his client by the opposite party that he never seems likely to recover it is doing infinitely better than might be expected in Switzerland. The learned gentleman who does the withering business and who blights all opponents with his gloomy sarcasm is as merry as a grig at a French watering-place. The learned gentleman who weeps by the pint on the smallest provocation has not shed a tear these six weeks. The very learned gentleman who has cooled the natural heat of his gingery complexion in pools and fountains of law until he has become great in knotty arguments for term-time, when he poses the drowsy bench with legal \"chaff,\" inexplicable to the uninitiated and to most of the initiated too, is roaming, with a characteristic delight in aridity and dust, about Constantinople. Other dispersed fragments of the same great palladium are to be found on the canals of Venice, at the second cataract of the Nile, in the baths of Germany, and sprinkled on the sea-sand all over the English coast. Scarcely one is to be encountered in the deserted region of Chancery Lane. If such a lonely member of the bar do flit across the waste and come upon a prowling suitor who is unable to leave off haunting the scenes of his anxiety, they frighten one another and retreat into opposite shades.\nIt is the hottest long vacation known for many years. All the young clerks are madly in love, and according to their various degrees, pine for bliss with the beloved object, at Margate, Ramsgate, or Gravesend. All the middle-aged clerks think their families too large. All the unowned dogs who stray into the Inns of Court and pant about staircases and other dry places seeking water give short howls of aggravation. All the blind men's dogs in the streets draw their masters against pumps or trip them over buckets. A shop with a sun-blind, and a watered pavement, and a bowl of gold and silver fish in the window, is a sanctuary. Temple Bar gets so hot that it is, to the adjacent Strand and Fleet Street, what a heater is in an urn, and keeps them simmering all night.\nThere are offices about the Inns of Court in which a man might be cool, if any coolness were worth purchasing at such a price in dullness; but the little thoroughfares immediately outside those retirements seem to blaze. In Mr. Krook's court, it is so hot that the people turn their houses inside out and sit in chairs upon the pavement--Mr. Krook included, who there pursues his studies, with his cat (who never is too hot) by his side. The Sol's Arms has discontinued the Harmonic Meetings for the season, and Little Swills is engaged at the Pastoral Gardens down the river, where he comes out in quite an innocent manner and sings comic ditties of a juvenile complexion calculated (as the bill says) not to wound the feelings of the most fastidious mind.\nOver all the legal neighbourhood there hangs, like some great veil of rust or gigantic cobweb, the idleness and pensiveness of the long vacation. Mr. Snagsby, law-stationer of Cook's Court, Cursitor Street, is sensible of the influence not only in his mind as a sympathetic and contemplative man, but also in his business as a law-stationer aforesaid. He has more leisure for musing in Staple Inn and in the Rolls Yard during the long vacation than at other seasons, and he says to the two 'prentices, what a thing it is in such hot weather to think that you live in an island with the sea a-rolling and a-bowling right round you.\nGuster is busy in the little drawing-room on this present afternoon in the long vacation, when Mr. and Mrs. Snagsby have it in contemplation to receive company. The expected guests are rather select than numerous, being Mr. and Mrs. Chadband and no more. From Mr. Chadband's being much given to describe himself, both verbally and in writing, as a vessel, he is occasionally mistaken by strangers for a gentleman connected with navigation, but he is, as he expresses it, \"in the ministry.\" Mr. Chadband is attached to no particular denomination and is considered by his persecutors to have nothing so very remarkable to say on the greatest of subjects as to render his volunteering, on his own account, at all incumbent on his conscience; but he has his followers, and Mrs. Snagsby is of the number. Mrs. Snagsby has but recently taken a passage upward by the vessel, Chadband; and her attention was attracted to that Bark A 1, when she was something flushed by the hot weather.\n\"My little woman,\" says Mr. Snagsby to the sparrows in Staple Inn, \"likes to have her religion rather sharp, you see!\"\nSo Guster, much impressed by regarding herself for the time as the handmaid of Chadband, whom she knows to be endowed with the gift of holding forth for four hours at a stretch, prepares the little drawing-room for tea. All the furniture is shaken and dusted, the portraits of Mr. and Mrs. Snagsby are touched up with a wet cloth, the best tea-service is set forth, and there is excellent provision made of dainty new bread, crusty twists, cool fresh butter, thin slices of ham, tongue, and German sausage, and delicate little rows of anchovies nestling in parsley, not to mention new-laid eggs, to be brought up warm in a napkin, and hot buttered toast. For Chadband is rather a consuming vessel--the persecutors say a gorging vessel--and can wield such weapons of the flesh as a knife and fork remarkably well.\nMr. Snagsby in his best coat, looking at all the preparations when they are completed and coughing his cough of deference behind his hand, says to Mrs. Snagsby, \"At what time did you expect Mr. and Mrs. Chadband, my love?\"\n\"At six,\" says Mrs. Snagsby.\nMr. Snagsby observes in a mild and casual way that \"it's gone that.\"\n\"Perhaps you'd like to begin without them,\" is Mrs. Snagsby's reproachful remark.\nMr. Snagsby does look as if he would like it very much, but he says, with his cough of mildness, \"No, my dear, no. I merely named the time.\"\n\"What's time,\" says Mrs. Snagsby, \"to eternity?\"\n\"Very true, my dear,\" says Mr. Snagsby. \"Only when a person lays in victuals for tea, a person does it with a view--perhaps--more to time. And when a time is named for having tea, it's better to come up to it.\"\n\"To come up to it!\" Mrs. Snagsby repeats with severity. \"Up to it! As if Mr. Chadband was a fighter!\"\n\"Not at all, my dear,\" says Mr. Snagsby.\nHere, Guster, who had been looking out of the bedroom window, comes rustling and scratching down the little staircase like a popular ghost, and falling flushed into the drawing-room, announces that Mr. and Mrs. Chadband have appeared in the court. The bell at the inner door in the passage immediately thereafter tinkling, she is admonished by Mrs. Snagsby, on pain of instant reconsignment to her patron saint, not to omit the ceremony of announcement. Much discomposed in her nerves (which were previously in the best order) by this threat, she so fearfully mutilates that point of state as to announce \"Mr. and Mrs. Cheeseming, least which, Imeantersay, whatsername!\" and retires conscience-stricken from the presence.\nMr. Chadband is a large yellow man with a fat smile and a general appearance of having a good deal of train oil in his system. Mrs. Chadband is a stern, severe-looking, silent woman. Mr. Chadband moves softly and cumbrously, not unlike a bear who has been taught to walk upright. He is very much embarrassed about the arms, as if they were inconvenient to him and he wanted to grovel, is very much in a perspiration about the head, and never speaks without first putting up his great hand, as delivering a token to his hearers that he is going to edify them.\n\"My friends,\" says Mr. Chadband, \"peace be on this house! On the master thereof, on the mistress thereof, on the young maidens, and on the young men! My friends, why do I wish for peace? What is peace? Is it war? No. Is it strife? No. Is it lovely, and gentle, and beautiful, and pleasant, and serene, and joyful? Oh, yes! Therefore, my friends, I wish for peace, upon you and upon yours.\"\nIn consequence of Mrs. Snagsby looking deeply edified, Mr. Snagsby thinks it expedient on the whole to say amen, which is well received.\n\"Now, my friends,\" proceeds Mr. Chadband, \"since I am upon this theme--\"\nGuster presents herself. Mrs. Snagsby, in a spectral bass voice and without removing her eyes from Chadband, says with dreadful distinctness, \"Go away!\"\n\"Now, my friends,\" says Chadband, \"since I am upon this theme, and in my lowly path improving it--\"\nGuster is heard unaccountably to murmur \"one thousing seven hundred and eighty-two.\" The spectral voice repeats more solemnly, \"Go away!\"\n\"Now, my friends,\" says Mr. Chadband, \"we will inquire in a spirit of love--\"\nStill Guster reiterates \"one thousing seven hundred and eighty-two.\"\nMr. Chadband, pausing with the resignation of a man accustomed to be persecuted and languidly folding up his chin into his fat smile, says, \"Let us hear the maiden! Speak, maiden!\"\n\"One thousing seven hundred and eighty-two, if you please, sir. Which he wish to know what the shilling ware for,\" says Guster, breathless.\n\"For?\" returns Mrs. Chadband. \"For his fare!\"\nGuster replied that \"he insistes on one and eightpence or on summonsizzing the party.\" Mrs. Snagsby and Mrs. Chadband are proceeding to grow shrill in indignation when Mr. Chadband quiets the tumult by lifting up his hand.\n\"My friends,\" says he, \"I remember a duty unfulfilled yesterday. It is right that I should be chastened in some penalty. I ought not to murmur. Rachael, pay the eightpence!\"\nWhile Mrs. Snagsby, drawing her breath, looks hard at Mr. Snagsby, as who should say, \"You hear this apostle!\" and while Mr. Chadband glows with humility and train oil, Mrs. Chadband pays the money. It is Mr. Chadband's habit--it is the head and front of his pretensions indeed--to keep this sort of debtor and creditor account in the smallest items and to post it publicly on the most trivial occasions.\n\"My friends,\" says Chadband, \"eightpence is not much; it might justly have been one and fourpence; it might justly have been half a crown. O let us be joyful, joyful! O let us be joyful!\"\nWith which remark, which appears from its sound to be an extract in verse, Mr. Chadband stalks to the table, and before taking a chair, lifts up his admonitory hand.\n\"My friends,\" says he, \"what is this which we now behold as being spread before us? Refreshment. Do we need refreshment then, my friends? We do. And why do we need refreshment, my friends? Because we are but mortal, because we are but sinful, because we are but of the earth, because we are not of the air. Can we fly, my friends? We cannot. Why can we not fly, my friends?\"\nMr. Snagsby, presuming on the success of his last point, ventures to observe in a cheerful and rather knowing tone, \"No wings.\" But is immediately frowned down by Mrs. Snagsby.\n\"I say, my friends,\" pursues Mr. Chadband, utterly rejecting and obliterating Mr. Snagsby's suggestion, \"why can we not fly? Is it because we are calculated to walk? It is. Could we walk, my friends, without strength? We could not. What should we do without strength, my friends? Our legs would refuse to bear us, our knees would double up, our ankles would turn over, and we should come to the ground. Then from whence, my friends, in a human point of view, do we derive the strength that is necessary to our limbs? Is it,\" says Chadband, glancing over the table, \"from bread in various forms, from butter which is churned from the milk which is yielded unto us by the cow, from the eggs which are laid by the fowl, from ham, from tongue, from sausage, and from such like? It is. Then let us partake of the good things which are set before us!\"\nThe persecutors denied that there was any particular gift in Mr. Chadband's piling verbose flights of stairs, one upon another, after this fashion. But this can only be received as a proof of their determination to persecute, since it must be within everybody's experience that the Chadband style of oratory is widely received and much admired.\nMr. Chadband, however, having concluded for the present, sits down at Mr. Snagsby's table and lays about him prodigiously. The conversion of nutriment of any sort into oil of the quality already mentioned appears to be a process so inseparable from the constitution of this exemplary vessel that in beginning to eat and drink, he may be described as always becoming a kind of considerable oil mills or other large factory for the production of that article on a wholesale scale. On the present evening of the long vacation, in Cook's Court, Cursitor Street, he does such a powerful stroke of business that the warehouse appears to be quite full when the works cease.\nAt this period of the entertainment, Guster, who has never recovered her first failure, but has neglected no possible or impossible means of bringing the establishment and herself into contempt--among which may be briefly enumerated her unexpectedly performing clashing military music on Mr. Chadband's head with plates, and afterwards crowning that gentleman with muffins--at which period of the entertainment, Guster whispers Mr. Snagsby that he is wanted.\n\"And being wanted in the--not to put too fine a point upon it--in the shop,\" says Mr. Snagsby, rising, \"perhaps this good company will excuse me for half a minute.\"\nMr. Snagsby descends and finds the two 'prentices intently contemplating a police constable, who holds a ragged boy by the arm.\n\"Why, bless my heart,\" says Mr. Snagsby, \"what's the matter!\"\n\"This boy,\" says the constable, \"although he's repeatedly told to, won't move on--\"\n\"I'm always a-moving on, sar,\" cries the boy, wiping away his grimy tears with his arm. \"I've always been a-moving and a-moving on, ever since I was born. Where can I possibly move to, sir, more nor I do move!\"\n\"He won't move on,\" says the constable calmly, with a slight professional hitch of his neck involving its better settlement in his stiff stock, \"although he has been repeatedly cautioned, and therefore I am obliged to take him into custody. He's as obstinate a young gonoph as I know. He WON'T move on.\"\n\"Oh, my eye! Where can I move to!\" cries the boy, clutching quite desperately at his hair and beating his bare feet upon the floor of Mr. Snagsby's passage.\n\"Don't you come none of that or I shall make blessed short work of you!\" says the constable, giving him a passionless shake. \"My instructions are that you are to move on. I have told you so five hundred times.\"\n\"But where?\" cries the boy.\n\"Well! Really, constable, you know,\" says Mr. Snagsby wistfully, and coughing behind his hand his cough of great perplexity and doubt, \"really, that does seem a question. Where, you know?\"\n\"My instructions don't go to that,\" replies the constable. \"My instructions are that this boy is to move on.\"\nDo you hear, Jo? It is nothing to you or to any one else that the great lights of the parliamentary sky have failed for some few years in this business to set you the example of moving on. The one grand recipe remains for you--the profound philosophical prescription--the be-all and the end-all of your strange existence upon earth. Move on! You are by no means to move off, Jo, for the great lights can't at all agree about that. Move on!\nMr. Snagsby says nothing to this effect, says nothing at all indeed, but coughs his forlornest cough, expressive of no thoroughfare in any direction. By this time Mr. and Mrs. Chadband and Mrs. Snagsby, hearing the altercation, have appeared upon the stairs. Guster having never left the end of the passage, the whole household are assembled.\n\"The simple question is, sir,\" says the constable, \"whether you know this boy. He says you do.\"\nMrs. Snagsby, from her elevation, instantly cries out, \"No he don't!\"\n\"My lit-tle woman!\" says Mr. Snagsby, looking up the staircase. \"My love, permit me! Pray have a moment's patience, my dear. I do know something of this lad, and in what I know of him, I can't say that there's any harm; perhaps on the contrary, constable.\" To whom the law-stationer relates his Joful and woeful experience, suppressing the half-crown fact.\n\"Well!\" says the constable, \"so far, it seems, he had grounds for what he said. When I took him into custody up in Holborn, he said you knew him. Upon that, a young man who was in the crowd said he was acquainted with you, and you were a respectable housekeeper, and if I'd call and make the inquiry, he'd appear. The young man don't seem inclined to keep his word, but--Oh! Here IS the young man!\"\nEnter Mr. Guppy, who nods to Mr. Snagsby and touches his hat with the chivalry of clerkship to the ladies on the stairs.\n\"I was strolling away from the office just now when I found this row going on,\" says Mr. Guppy to the law-stationer, \"and as your name was mentioned, I thought it was right the thing should be looked into.\"\n\"It was very good-natured of you, sir,\" says Mr. Snagsby, \"and I am obliged to you.\" And Mr. Snagsby again relates his experience, again suppressing the half-crown fact.\n\"Now, I know where you live,\" says the constable, then, to Jo. \"You live down in Tom-all-Alone's. That's a nice innocent place to live in, ain't it?\"\n\"I can't go and live in no nicer place, sir,\" replies Jo. \"They wouldn't have nothink to say to me if I wos to go to a nice innocent place fur to live. Who ud go and let a nice innocent lodging to such a reg'lar one as me!\"\n\"You are very poor, ain't you?\" says the constable.\n\"Yes, I am indeed, sir, wery poor in gin'ral,\" replies Jo. \"I leave you to judge now! I shook these two half-crowns out of him,\" says the constable, producing them to the company, \"in only putting my hand upon him!\"\n\"They're wot's left, Mr. Snagsby,\" says Jo, \"out of a sov-ring as wos give me by a lady in a wale as sed she wos a servant and as come to my crossin one night and asked to be showd this 'ere ouse and the ouse wot him as you giv the writin to died at, and the berrin-ground wot he's berrid in. She ses to me she ses 'are you the boy at the inkwhich?' she ses. I ses 'yes' I ses. She ses to me she ses 'can you show me all them places?' I ses 'yes I can' I ses. And she ses to me 'do it' and I dun it and she giv me a sov'ring and hooked it. And I an't had much of the sov'ring neither,\" says Jo, with dirty tears, \"fur I had to pay five bob, down in Tom-all-Alone's, afore they'd square it fur to give me change, and then a young man he thieved another five while I was asleep and another boy he thieved ninepence and the landlord he stood drains round with a lot more on it.\"\n\"You don't expect anybody to believe this, about the lady and the sovereign, do you?\" says the constable, eyeing him aside with ineffable disdain.\n\"I don't know as I do, sir,\" replies Jo. \"I don't expect nothink at all, sir, much, but that's the true hist'ry on it.\"\n\"You see what he is!\" the constable observes to the audience. \"Well, Mr. Snagsby, if I don't lock him up this time, will you engage for his moving on?\"\n\"No!\" cries Mrs. Snagsby from the stairs.\n\"My little woman!\" pleads her husband. \"Constable, I have no doubt he'll move on. You know you really must do it,\" says Mr. Snagsby.\n\"I'm everyways agreeable, sir,\" says the hapless Jo.\n\"Do it, then,\" observes the constable. \"You know what you have got to do. Do it! And recollect you won't get off so easy next time. Catch hold of your money. Now, the sooner you're five mile off, the better for all parties.\"\nWith this farewell hint and pointing generally to the setting sun as a likely place to move on to, the constable bids his auditors good afternoon and makes the echoes of Cook's Court perform slow music for him as he walks away on the shady side, carrying his iron-bound hat in his hand for a little ventilation.\nNow, Jo's improbable story concerning the lady and the sovereign has awakened more or less the curiosity of all the company. Mr. Guppy, who has an inquiring mind in matters of evidence and who has been suffering severely from the lassitude of the long vacation, takes that interest in the case that he enters on a regular cross-examination of the witness, which is found so interesting by the ladies that Mrs. Snagsby politely invites him to step upstairs and drink a cup of tea, if he will excuse the disarranged state of the tea-table, consequent on their previous exertions. Mr. Guppy yielding his assent to this proposal, Jo is requested to follow into the drawing-room doorway, where Mr. Guppy takes him in hand as a witness, patting him into this shape, that shape, and the other shape like a butterman dealing with so much butter, and worrying him according to the best models. Nor is the examination unlike many such model displays, both in respect of its eliciting nothing and of its being lengthy, for Mr. Guppy is sensible of his talent, and Mrs. Snagsby feels not only that it gratifies her inquisitive disposition, but that it lifts her husband's establishment higher up in the law. During the progress of this keen encounter, the vessel Chadband, being merely engaged in the oil trade, gets aground and waits to be floated off.\n\"Well!\" says Mr. Guppy. \"Either this boy sticks to it like cobbler's-wax or there is something out of the common here that beats anything that ever came into my way at Kenge and Carboy's.\"\nMrs. Chadband whispers Mrs. Snagsby, who exclaims, \"You don't say so!\"\n\"For years!\" replied Mrs. Chadband.\n\"Has known Kenge and Carboy's office for years,\" Mrs. Snagsby triumphantly explains to Mr. Guppy. \"Mrs. Chadband--this gentleman's wife--Reverend Mr. Chadband.\"\n\"Oh, indeed!\" says Mr. Guppy.\n\"Before I married my present husband,\" says Mrs. Chadband.\n\"Was you a party in anything, ma'am?\" says Mr. Guppy, transferring his cross-examination.\n\"No.\"\n\"NOT a party in anything, ma'am?\" says Mr. Guppy.\nMrs. Chadband shakes her head.\n\"Perhaps you were acquainted with somebody who was a party in something, ma'am?\" says Mr. Guppy, who likes nothing better than to model his conversation on forensic principles.\n\"Not exactly that, either,\" replies Mrs. Chadband, humouring the joke with a hard-favoured smile.\n\"Not exactly that, either!\" repeats Mr. Guppy. \"Very good. Pray, ma'am, was it a lady of your acquaintance who had some transactions (we will not at present say what transactions) with Kenge and Carboy's office, or was it a gentleman of your acquaintance? Take time, ma'am. We shall come to it presently. Man or woman, ma'am?\"\n\"Neither,\" says Mrs. Chadband as before.\n\"Oh! A child!\" says Mr. Guppy, throwing on the admiring Mrs. Snagsby the regular acute professional eye which is thrown on British jurymen. \"Now, ma'am, perhaps you'll have the kindness to tell us WHAT child.\"\n\"You have got it at last, sir,\" says Mrs. Chadband with another hard-favoured smile. \"Well, sir, it was before your time, most likely, judging from your appearance. I was left in charge of a child named Esther Summerson, who was put out in life by Messrs. Kenge and Carboy.\"\n\"Miss Summerson, ma'am!\" cries Mr. Guppy, excited.\n\"I call her Esther Summerson,\" says Mrs. Chadband with austerity. \"There was no Miss-ing of the girl in my time. It was Esther. 'Esther, do this! Esther, do that!' and she was made to do it.\"\n\"My dear ma'am,\" returns Mr. Guppy, moving across the small apartment, \"the humble individual who now addresses you received that young lady in London when she first came here from the establishment to which you have alluded. Allow me to have the pleasure of taking you by the hand.\"\nMr. Chadband, at last seeing his opportunity, makes his accustomed signal and rises with a smoking head, which he dabs with his pocket-handkerchief. Mrs. Snagsby whispers \"Hush!\"\n\"My friends,\" says Chadband, \"we have partaken in moderation\" (which was certainly not the case so far as he was concerned) \"of the comforts which have been provided for us. May this house live upon the fatness of the land; may corn and wine be plentiful therein; may it grow, may it thrive, may it prosper, may it advance, may it proceed, may it press forward! But, my friends, have we partaken of anything else? We have. My friends, of what else have we partaken? Of spiritual profit? Yes. From whence have we derived that spiritual profit? My young friend, stand forth!\"\nJo, thus apostrophized, gives a slouch backward, and another slouch forward, and another slouch to each side, and confronts the eloquent Chadband with evident doubts of his intentions.\n\"My young friend,\" says Chadband, \"you are to us a pearl, you are to us a diamond, you are to us a gem, you are to us a jewel. And why, my young friend?\"\n\"I don't know,\" replies Jo. \"I don't know nothink.\"\n\"My young friend,\" says Chadband, \"it is because you know nothing that you are to us a gem and jewel. For what are you, my young friend? Are you a beast of the field? No. A bird of the air? No. A fish of the sea or river? No. You are a human boy, my young friend. A human boy. O glorious to be a human boy! And why glorious, my young friend? Because you are capable of receiving the lessons of wisdom, because you are capable of profiting by this discourse which I now deliver for your good, because you are not a stick, or a staff, or a stock, or a stone, or a post, or a pillar.\nO running stream of sparkling joy To be a soaring human boy!\nAnd do you cool yourself in that stream now, my young friend? No. Why do you not cool yourself in that stream now? Because you are in a state of darkness, because you are in a state of obscurity, because you are in a state of sinfulness, because you are in a state of bondage. My young friend, what is bondage? Let us, in a spirit of love, inquire.\"\nAt this threatening stage of the discourse, Jo, who seems to have been gradually going out of his mind, smears his right arm over his face and gives a terrible yawn. Mrs. Snagsby indignantly expresses her belief that he is a limb of the arch-fiend.\n\"My friends,\" says Mr. Chadband with his persecuted chin folding itself into its fat smile again as he looks round, \"it is right that I should be humbled, it is right that I should be tried, it is right that I should be mortified, it is right that I should be corrected. I stumbled, on Sabbath last, when I thought with pride of my three hours' improving. The account is now favourably balanced: my creditor has accepted a composition. O let us be joyful, joyful! O let us be joyful!\"\nGreat sensation on the part of Mrs. Snagsby.\n\"My friends,\" says Chadband, looking round him in conclusion, \"I will not proceed with my young friend now. Will you come to-morrow, my young friend, and inquire of this good lady where I am to be found to deliver a discourse unto you, and will you come like the thirsty swallow upon the next day, and upon the day after that, and upon the day after that, and upon many pleasant days, to hear discourses?\" (This with a cow-like lightness.)\nJo, whose immediate object seems to be to get away on any terms, gives a shuffling nod. Mr. Guppy then throws him a penny, and Mrs. Snagsby calls to Guster to see him safely out of the house. But before he goes downstairs, Mr. Snagsby loads him with some broken meats from the table, which he carries away, hugging in his arms.\nSo, Mr. Chadband--of whom the persecutors say that it is no wonder he should go on for any length of time uttering such abominable nonsense, but that the wonder rather is that he should ever leave off, having once the audacity to begin--retires into private life until he invests a little capital of supper in the oil-trade. Jo moves on, through the long vacation, down to Blackfriars Bridge, where he finds a baking stony corner wherein to settle to his repast.\nAnd there he sits, munching and gnawing, and looking up at the great cross on the summit of St. Paul's Cathedral, glittering above a red-and-violet-tinted cloud of smoke. From the boy's face one might suppose that sacred emblem to be, in his eyes, the crowning confusion of the great, confused city--so golden, so high up, so far out of his reach. There he sits, the sun going down, the river running fast, the crowd flowing by him in two streams--everything moving on to some purpose and to one end--until he is stirred up and told to \"move on\" too.",
        "paragraph_chars": [
            [
                0,
                596
            ],
            [
                596,
                1335
            ],
            [
                1335,
                1842
            ],
            [
                1842,
                3572
            ],
            [
                3572,
                4344
            ],
            [
                4344,
                5102
            ],
            [
                5102,
                5733
            ],
            [
                5733,
                6712
            ],
            [
                6712,
                6831
            ],
            [
                6831,
                7644
            ],
            [
                7644,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                7965
            ],
            [
                7965,
                8047
            ],
            [
                8047,
                8188
            ],
            [
                8188,
                8237
            ],
            [
                8237,
                8448
            ],
            [
                8448,
                8550
            ],
            [
                8550,
                8591
            ],
            [
                8591,
                9313
            ],
            [
                9313,
                9872
            ],
            [
                9872,
                10262
            ],
            [
                10262,
                10399
            ],
            [
                10399,
                10472
            ],
            [
                10472,
                10625
            ],
            [
                10625,
                10725
            ],
            [
                10725,
                10863
            ],
            [
                10863,
                10941
            ],
            [
                10941,
                11010
            ],
            [
                11010,
                11191
            ],
            [
                11191,
                11331
            ],
            [
                11331,
                11377
            ],
            [
                11377,
                11600
            ],
            [
                11600,
                11774
            ],
            [
                11774,
                12179
            ],
            [
                12179,
                12367
            ],
            [
                12367,
                12533
            ],
            [
                12533,
                12908
            ],
            [
                12908,
                13085
            ],
            [
                13085,
                13931
            ],
            [
                13931,
                14276
            ],
            [
                14276,
                14943
            ],
            [
                14943,
                15402
            ],
            [
                15402,
                15567
            ],
            [
                15567,
                15695
            ],
            [
                15695,
                15757
            ],
            [
                15757,
                15841
            ],
            [
                15841,
                16052
            ],
            [
                16052,
                16356
            ],
            [
                16356,
                16513
            ],
            [
                16513,
                16724
            ],
            [
                16724,
                16752
            ],
            [
                16752,
                16941
            ],
            [
                16941,
                17051
            ],
            [
                17051,
                17491
            ],
            [
                17491,
                17834
            ],
            [
                17834,
                17930
            ],
            [
                17930,
                18000
            ],
            [
                18000,
                18357
            ],
            [
                18357,
                18756
            ],
            [
                18756,
                18877
            ],
            [
                18877,
                19084
            ],
            [
                19084,
                19254
            ],
            [
                19254,
                19404
            ],
            [
                19404,
                19628
            ],
            [
                19628,
                19680
            ],
            [
                19680,
                19896
            ],
            [
                19896,
                20772
            ],
            [
                20772,
                20919
            ],
            [
                20919,
                21039
            ],
            [
                21039,
                21191
            ],
            [
                21191,
                21233
            ],
            [
                21233,
                21366
            ],
            [
                21366,
                21419
            ],
            [
                21419,
                21644
            ],
            [
                21644,
                21956
            ],
            [
                21956,
                23298
            ],
            [
                23298,
                23487
            ],
            [
                23487,
                23558
            ],
            [
                23558,
                23594
            ],
            [
                23594,
                23755
            ],
            [
                23755,
                23785
            ],
            [
                23785,
                23844
            ],
            [
                23844,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23990
            ],
            [
                23990,
                24021
            ],
            [
                24021,
                24198
            ],
            [
                24198,
                24296
            ],
            [
                24296,
                24623
            ],
            [
                24623,
                24664
            ],
            [
                24664,
                24874
            ],
            [
                24874,
                25149
            ],
            [
                25149,
                25200
            ],
            [
                25200,
                25392
            ],
            [
                25392,
                25676
            ],
            [
                25676,
                25855
            ],
            [
                25855,
                26429
            ],
            [
                26429,
                26614
            ],
            [
                26614,
                26768
            ],
            [
                26768,
                26820
            ],
            [
                26820,
                27401
            ],
            [
                27401,
                27462
            ],
            [
                27462,
                27812
            ],
            [
                27812,
                28061
            ],
            [
                28061,
                28546
            ],
            [
                28546,
                28591
            ],
            [
                28591,
                29031
            ],
            [
                29031,
                29359
            ],
            [
                29359,
                29822
            ],
            [
                29822,
                30372
            ]
        ],
        "segment_chars": [
            [
                0,
                57
            ],
            [
                57,
                220
            ],
            [
                220,
                387
            ],
            [
                387,
                454
            ],
            [
                454,
                596
            ],
            [
                596,
                934
            ],
            [
                934,
                1057
            ],
            [
                1057,
                1335
            ],
            [
                1335,
                1368
            ],
            [
                1368,
                1420
            ],
            [
                1420,
                1497
            ],
            [
                1497,
                1578
            ],
            [
                1578,
                1842
            ],
            [
                1842,
                1902
            ],
            [
                1902,
                2163
            ],
            [
                2163,
                2423
            ],
            [
                2423,
                2581
            ],
            [
                2581,
                2690
            ],
            [
                2690,
                3068
            ],
            [
                3068,
                3282
            ],
            [
                3282,
                3357
            ],
            [
                3357,
                3572
            ],
            [
                3572,
                3626
            ],
            [
                3626,
                3782
            ],
            [
                3782,
                3841
            ],
            [
                3841,
                3989
            ],
            [
                3989,
                4089
            ],
            [
                4089,
                4204
            ],
            [
                4204,
                4344
            ],
            [
                4344,
                4565
            ],
            [
                4565,
                4782
            ],
            [
                4782,
                5102
            ],
            [
                5102,
                5248
            ],
            [
                5248,
                5454
            ],
            [
                5454,
                5733
            ],
            [
                5733,
                5894
            ],
            [
                5894,
                5988
            ],
            [
                5988,
                6223
            ],
            [
                6223,
                6533
            ],
            [
                6533,
                6712
            ],
            [
                6712,
                6831
            ],
            [
                6831,
                7051
            ],
            [
                7051,
                7486
            ],
            [
                7486,
                7644
            ],
            [
                7644,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                7965
            ],
            [
                7965,
                8047
            ],
            [
                8047,
                8162
            ],
            [
                8162,
                8188
            ],
            [
                8188,
                8237
            ],
            [
                8237,
                8277
            ],
            [
                8277,
                8376
            ],
            [
                8376,
                8448
            ],
            [
                8448,
                8468
            ],
            [
                8468,
                8504
            ],
            [
                8504,
                8515
            ],
            [
                8515,
                8550
            ],
            [
                8550,
                8591
            ],
            [
                8591,
                8839
            ],
            [
                8839,
                9045
            ],
            [
                9045,
                9262
            ],
            [
                9262,
                9313
            ],
            [
                9313,
                9440
            ],
            [
                9440,
                9496
            ],
            [
                9496,
                9593
            ],
            [
                9593,
                9872
            ],
            [
                9872,
                9930
            ],
            [
                9930,
                10022
            ],
            [
                10022,
                10059
            ],
            [
                10059,
                10074
            ],
            [
                10074,
                10085
            ],
            [
                10085,
                10089
            ],
            [
                10089,
                10103
            ],
            [
                10103,
                10107
            ],
            [
                10107,
                10186
            ],
            [
                10186,
                10195
            ],
            [
                10195,
                10262
            ],
            [
                10262,
                10399
            ],
            [
                10399,
                10472
            ],
            [
                10472,
                10497
            ],
            [
                10497,
                10625
            ],
            [
                10625,
                10725
            ],
            [
                10725,
                10810
            ],
            [
                10810,
                10863
            ],
            [
                10863,
                10941
            ],
            [
                10941,
                11010
            ],
            [
                11010,
                11175
            ],
            [
                11175,
                11191
            ],
            [
                11191,
                11255
            ],
            [
                11255,
                11331
            ],
            [
                11331,
                11338
            ],
            [
                11338,
                11361
            ],
            [
                11361,
                11377
            ],
            [
                11377,
                11464
            ],
            [
                11464,
                11600
            ],
            [
                11600,
                11665
            ],
            [
                11665,
                11721
            ],
            [
                11721,
                11744
            ],
            [
                11744,
                11774
            ],
            [
                11774,
                11885
            ],
            [
                11885,
                11973
            ],
            [
                11973,
                12179
            ],
            [
                12179,
                12318
            ],
            [
                12318,
                12346
            ],
            [
                12346,
                12367
            ],
            [
                12367,
                12533
            ],
            [
                12533,
                12617
            ],
            [
                12617,
                12630
            ],
            [
                12630,
                12671
            ],
            [
                12671,
                12678
            ],
            [
                12678,
                12722
            ],
            [
                12722,
                12840
            ],
            [
                12840,
                12864
            ],
            [
                12864,
                12875
            ],
            [
                12875,
                12908
            ],
            [
                12908,
                13036
            ],
            [
                13036,
                13085
            ],
            [
                13085,
                13210
            ],
            [
                13210,
                13251
            ],
            [
                13251,
                13258
            ],
            [
                13258,
                13303
            ],
            [
                13303,
                13317
            ],
            [
                13317,
                13365
            ],
            [
                13365,
                13488
            ],
            [
                13488,
                13602
            ],
            [
                13602,
                13859
            ],
            [
                13859,
                13866
            ],
            [
                13866,
                13931
            ],
            [
                13931,
                14079
            ],
            [
                14079,
                14276
            ],
            [
                14276,
                14399
            ],
            [
                14399,
                14755
            ],
            [
                14755,
                14943
            ],
            [
                14943,
                15402
            ],
            [
                15402,
                15567
            ],
            [
                15567,
                15695
            ],
            [
                15695,
                15757
            ],
            [
                15757,
                15841
            ],
            [
                15841,
                15929
            ],
            [
                15929,
                15996
            ],
            [
                15996,
                16052
            ],
            [
                16052,
                16293
            ],
            [
                16293,
                16337
            ],
            [
                16337,
                16356
            ],
            [
                16356,
                16369
            ],
            [
                16369,
                16391
            ],
            [
                16391,
                16513
            ],
            [
                16513,
                16586
            ],
            [
                16586,
                16638
            ],
            [
                16638,
                16684
            ],
            [
                16684,
                16724
            ],
            [
                16724,
                16737
            ],
            [
                16737,
                16752
            ],
            [
                16752,
                16759
            ],
            [
                16759,
                16923
            ],
            [
                16923,
                16941
            ],
            [
                16941,
                17000
            ],
            [
                17000,
                17051
            ],
            [
                17051,
                17068
            ],
            [
                17068,
                17240
            ],
            [
                17240,
                17384
            ],
            [
                17384,
                17393
            ],
            [
                17393,
                17482
            ],
            [
                17482,
                17491
            ],
            [
                17491,
                17641
            ],
            [
                17641,
                17750
            ],
            [
                17750,
                17834
            ],
            [
                17834,
                17913
            ],
            [
                17913,
                17930
            ],
            [
                17930,
                18000
            ],
            [
                18000,
                18020
            ],
            [
                18020,
                18064
            ],
            [
                18064,
                18085
            ],
            [
                18085,
                18125
            ],
            [
                18125,
                18257
            ],
            [
                18257,
                18357
            ],
            [
                18357,
                18365
            ],
            [
                18365,
                18437
            ],
            [
                18437,
                18503
            ],
            [
                18503,
                18671
            ],
            [
                18671,
                18732
            ],
            [
                18732,
                18756
            ],
            [
                18756,
                18877
            ],
            [
                18877,
                19084
            ],
            [
                19084,
                19169
            ],
            [
                19169,
                19254
            ],
            [
                19254,
                19317
            ],
            [
                19317,
                19352
            ],
            [
                19352,
                19404
            ],
            [
                19404,
                19462
            ],
            [
                19462,
                19556
            ],
            [
                19556,
                19628
            ],
            [
                19628,
                19660
            ],
            [
                19660,
                19680
            ],
            [
                19680,
                19739
            ],
            [
                19739,
                19766
            ],
            [
                19766,
                19896
            ],
            [
                19896,
                20189
            ],
            [
                20189,
                20246
            ],
            [
                20246,
                20255
            ],
            [
                20255,
                20274
            ],
            [
                20274,
                20331
            ],
            [
                20331,
                20356
            ],
            [
                20356,
                20436
            ],
            [
                20436,
                20772
            ],
            [
                20772,
                20858
            ],
            [
                20858,
                20919
            ],
            [
                20919,
                20960
            ],
            [
                20960,
                21039
            ],
            [
                21039,
                21061
            ],
            [
                21061,
                21101
            ],
            [
                21101,
                21191
            ],
            [
                21191,
                21197
            ],
            [
                21197,
                21233
            ],
            [
                21233,
                21252
            ],
            [
                21252,
                21272
            ],
            [
                21272,
                21315
            ],
            [
                21315,
                21366
            ],
            [
                21366,
                21419
            ],
            [
                21419,
                21458
            ],
            [
                21458,
                21493
            ],
            [
                21493,
                21500
            ],
            [
                21500,
                21551
            ],
            [
                21551,
                21577
            ],
            [
                21577,
                21644
            ],
            [
                21644,
                21956
            ],
            [
                21956,
                22081
            ],
            [
                22081,
                22534
            ],
            [
                22534,
                22841
            ],
            [
                22841,
                23152
            ],
            [
                23152,
                23298
            ],
            [
                23298,
                23306
            ],
            [
                23306,
                23322
            ],
            [
                23322,
                23487
            ],
            [
                23487,
                23558
            ],
            [
                23558,
                23571
            ],
            [
                23571,
                23594
            ],
            [
                23594,
                23692
            ],
            [
                23692,
                23755
            ],
            [
                23755,
                23769
            ],
            [
                23769,
                23785
            ],
            [
                23785,
                23844
            ],
            [
                23844,
                23882
            ],
            [
                23882,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23974
            ],
            [
                23974,
                23990
            ],
            [
                23990,
                24021
            ],
            [
                24021,
                24102
            ],
            [
                24102,
                24198
            ],
            [
                24198,
                24296
            ],
            [
                24296,
                24324
            ],
            [
                24324,
                24343
            ],
            [
                24343,
                24355
            ],
            [
                24355,
                24552
            ],
            [
                24552,
                24570
            ],
            [
                24570,
                24601
            ],
            [
                24601,
                24623
            ],
            [
                24623,
                24664
            ],
            [
                24664,
                24669
            ],
            [
                24669,
                24679
            ],
            [
                24679,
                24804
            ],
            [
                24804,
                24874
            ],
            [
                24874,
                24959
            ],
            [
                24959,
                25039
            ],
            [
                25039,
                25149
            ],
            [
                25149,
                25174
            ],
            [
                25174,
                25200
            ],
            [
                25200,
                25266
            ],
            [
                25266,
                25313
            ],
            [
                25313,
                25328
            ],
            [
                25328,
                25346
            ],
            [
                25346,
                25364
            ],
            [
                25364,
                25392
            ],
            [
                25392,
                25618
            ],
            [
                25618,
                25676
            ],
            [
                25676,
                25825
            ],
            [
                25825,
                25855
            ],
            [
                25855,
                26029
            ],
            [
                26029,
                26217
            ],
            [
                26217,
                26269
            ],
            [
                26269,
                26278
            ],
            [
                26278,
                26321
            ],
            [
                26321,
                26342
            ],
            [
                26342,
                26347
            ],
            [
                26347,
                26398
            ],
            [
                26398,
                26429
            ],
            [
                26429,
                26614
            ],
            [
                26614,
                26741
            ],
            [
                26741,
                26768
            ],
            [
                26768,
                26796
            ],
            [
                26796,
                26820
            ],
            [
                26820,
                26922
            ],
            [
                26922,
                26957
            ],
            [
                26957,
                26987
            ],
            [
                26987,
                26991
            ],
            [
                26991,
                27010
            ],
            [
                27010,
                27014
            ],
            [
                27014,
                27042
            ],
            [
                27042,
                27046
            ],
            [
                27046,
                27084
            ],
            [
                27084,
                27097
            ],
            [
                27097,
                27127
            ],
            [
                27127,
                27162
            ],
            [
                27162,
                27401
            ],
            [
                27401,
                27462
            ],
            [
                27462,
                27524
            ],
            [
                27524,
                27528
            ],
            [
                27528,
                27577
            ],
            [
                27577,
                27739
            ],
            [
                27739,
                27773
            ],
            [
                27773,
                27812
            ],
            [
                27812,
                27978
            ],
            [
                27978,
                28061
            ],
            [
                28061,
                28332
            ],
            [
                28332,
                28417
            ],
            [
                28417,
                28497
            ],
            [
                28497,
                28525
            ],
            [
                28525,
                28546
            ],
            [
                28546,
                28591
            ],
            [
                28591,
                28699
            ],
            [
                28699,
                28997
            ],
            [
                28997,
                29031
            ],
            [
                29031,
                29119
            ],
            [
                29119,
                29223
            ],
            [
                29223,
                29359
            ],
            [
                29359,
                29684
            ],
            [
                29684,
                29822
            ],
            [
                29822,
                29993
            ],
            [
                29993,
                30170
            ],
            [
                30170,
                30372
            ]
        ],
        "overlap_chars": [
            [
                0,
                57
            ],
            [
                57,
                105
            ],
            [
                123,
                137
            ],
            [
                177,
                206
            ],
            [
                218,
                220
            ],
            [
                387,
                410
            ],
            [
                413,
                453
            ],
            [
                596,
                656
            ],
            [
                671,
                762
            ],
            [
                763,
                803
            ],
            [
                879,
                934
            ],
            [
                934,
                966
            ],
            [
                982,
                1008
            ],
            [
                1015,
                1056
            ],
            [
                1335,
                1368
            ],
            [
                1368,
                1418
            ],
            [
                1585,
                1586
            ],
            [
                1600,
                1643
            ],
            [
                1504,
                1505
            ],
            [
                1497,
                1499
            ],
            [
                1514,
                1517
            ],
            [
                1466,
                1469
            ],
            [
                1753,
                1757
            ],
            [
                1735,
                1743
            ],
            [
                1690,
                1693
            ],
            [
                1798,
                1800
            ],
            [
                1817,
                1840
            ],
            [
                1418,
                1419
            ],
            [
                1842,
                1902
            ],
            [
                1902,
                1968
            ],
            [
                2067,
                2089
            ],
            [
                2161,
                2163
            ],
            [
                3084,
                3100
            ],
            [
                3122,
                3162
            ],
            [
                3189,
                3282
            ],
            [
                3282,
                3356
            ],
            [
                3572,
                3626
            ],
            [
                3626,
                3669
            ],
            [
                3706,
                3714
            ],
            [
                3726,
                3744
            ],
            [
                3746,
                3782
            ],
            [
                3782,
                3841
            ],
            [
                4089,
                4156
            ],
            [
                4168,
                4204
            ],
            [
                4204,
                4214
            ],
            [
                4262,
                4278
            ],
            [
                4323,
                4344
            ],
            [
                4344,
                4414
            ],
            [
                4481,
                4497
            ],
            [
                4524,
                4531
            ],
            [
                4550,
                4565
            ],
            [
                4565,
                4680
            ],
            [
                4684,
                4705
            ],
            [
                4712,
                4731
            ],
            [
                4733,
                4745
            ],
            [
                4769,
                4781
            ],
            [
                5102,
                5157
            ],
            [
                5180,
                5248
            ],
            [
                5248,
                5274
            ],
            [
                5290,
                5291
            ],
            [
                5457,
                5484
            ],
            [
                5521,
                5591
            ],
            [
                5602,
                5694
            ],
            [
                5708,
                5733
            ],
            [
                5733,
                5774
            ],
            [
                5778,
                5782
            ],
            [
                5791,
                5800
            ],
            [
                5821,
                5848
            ],
            [
                5874,
                5894
            ],
            [
                5894,
                5917
            ],
            [
                5953,
                5974
            ],
            [
                5986,
                5988
            ],
            [
                5988,
                6044
            ],
            [
                6076,
                6135
            ],
            [
                6171,
                6183
            ],
            [
                6187,
                6189
            ],
            [
                6202,
                6223
            ],
            [
                6223,
                6330
            ],
            [
                6334,
                6356
            ],
            [
                6470,
                6517
            ],
            [
                6373,
                6375
            ],
            [
                6531,
                6532
            ],
            [
                6712,
                6831
            ],
            [
                6831,
                6840
            ],
            [
                7009,
                7021
            ],
            [
                7029,
                7051
            ],
            [
                7051,
                7071
            ],
            [
                7083,
                7089
            ],
            [
                7160,
                7229
            ],
            [
                7235,
                7254
            ],
            [
                7269,
                7396
            ],
            [
                7421,
                7425
            ],
            [
                7462,
                7486
            ],
            [
                7486,
                7527
            ],
            [
                7642,
                7644
            ],
            [
                7644,
                7705
            ],
            [
                7781,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                7916
            ],
            [
                7942,
                7965
            ],
            [
                7965,
                8047
            ],
            [
                8047,
                8091
            ],
            [
                8101,
                8162
            ],
            [
                8162,
                8188
            ],
            [
                8188,
                8237
            ],
            [
                8237,
                8276
            ],
            [
                8591,
                8608
            ],
            [
                8613,
                8658
            ],
            [
                8743,
                8750
            ],
            [
                8668,
                8671
            ],
            [
                8659,
                8667
            ],
            [
                8683,
                8708
            ],
            [
                8784,
                8839
            ],
            [
                8839,
                8847
            ],
            [
                8881,
                8892
            ],
            [
                8904,
                8908
            ],
            [
                9045,
                9075
            ],
            [
                8912,
                8917
            ],
            [
                9181,
                9183
            ],
            [
                9196,
                9261
            ],
            [
                9313,
                9440
            ],
            [
                9440,
                9496
            ],
            [
                9496,
                9593
            ],
            [
                9593,
                9598
            ],
            [
                9711,
                9802
            ],
            [
                9825,
                9872
            ],
            [
                9872,
                9930
            ],
            [
                9930,
                9976
            ],
            [
                10020,
                10022
            ],
            [
                10022,
                10059
            ],
            [
                10059,
                10074
            ],
            [
                10074,
                10085
            ],
            [
                10085,
                10089
            ],
            [
                10089,
                10103
            ],
            [
                10103,
                10107
            ],
            [
                10107,
                10151
            ],
            [
                10166,
                10172
            ],
            [
                10184,
                10186
            ],
            [
                10186,
                10195
            ],
            [
                10195,
                10262
            ],
            [
                10280,
                10292
            ],
            [
                10293,
                10348
            ],
            [
                10362,
                10399
            ],
            [
                10399,
                10468
            ],
            [
                10472,
                10478
            ],
            [
                10495,
                10497
            ],
            [
                10497,
                10535
            ],
            [
                10579,
                10585
            ],
            [
                10612,
                10625
            ],
            [
                10625,
                10721
            ],
            [
                10725,
                10809
            ],
            [
                11010,
                11089
            ],
            [
                11112,
                11143
            ],
            [
                11090,
                11093
            ],
            [
                11144,
                11173
            ],
            [
                11191,
                11192
            ],
            [
                11192,
                11255
            ],
            [
                11255,
                11331
            ],
            [
                11331,
                11338
            ],
            [
                11338,
                11361
            ],
            [
                11361,
                11362
            ],
            [
                11366,
                11377
            ],
            [
                11377,
                11383
            ],
            [
                11392,
                11400
            ],
            [
                11410,
                11464
            ],
            [
                11464,
                11498
            ],
            [
                11518,
                11600
            ],
            [
                11600,
                11665
            ],
            [
                11665,
                11721
            ],
            [
                11744,
                11774
            ],
            [
                11889,
                11972
            ],
            [
                12179,
                12241
            ],
            [
                12294,
                12318
            ],
            [
                12318,
                12344
            ],
            [
                12367,
                12385
            ],
            [
                12455,
                12515
            ],
            [
                12527,
                12533
            ],
            [
                12533,
                12575
            ],
            [
                12599,
                12617
            ],
            [
                12617,
                12630
            ],
            [
                12630,
                12652
            ],
            [
                12657,
                12671
            ],
            [
                12671,
                12678
            ],
            [
                12678,
                12685
            ],
            [
                12708,
                12722
            ],
            [
                12722,
                12808
            ],
            [
                12824,
                12840
            ],
            [
                12840,
                12864
            ],
            [
                12864,
                12875
            ],
            [
                12875,
                12908
            ],
            [
                12908,
                12919
            ],
            [
                12974,
                13036
            ],
            [
                13040,
                13085
            ],
            [
                13085,
                13127
            ],
            [
                13150,
                13210
            ],
            [
                13210,
                13230
            ],
            [
                13242,
                13251
            ],
            [
                13251,
                13258
            ],
            [
                13258,
                13303
            ],
            [
                13303,
                13317
            ],
            [
                13399,
                13488
            ],
            [
                13488,
                13516
            ],
            [
                13542,
                13602
            ],
            [
                13602,
                13691
            ],
            [
                13758,
                13764
            ],
            [
                13769,
                13773
            ],
            [
                13800,
                13859
            ],
            [
                13859,
                13866
            ],
            [
                13866,
                13931
            ],
            [
                14276,
                14288
            ],
            [
                14297,
                14399
            ],
            [
                14399,
                14416
            ],
            [
                14439,
                14507
            ],
            [
                14698,
                14701
            ],
            [
                14545,
                14549
            ],
            [
                14560,
                14566
            ],
            [
                14601,
                14602
            ],
            [
                14567,
                14574
            ],
            [
                14603,
                14625
            ],
            [
                14633,
                14651
            ],
            [
                14665,
                14668
            ],
            [
                14753,
                14754
            ],
            [
                14943,
                14957
            ],
            [
                15353,
                15370
            ],
            [
                15371,
                15400
            ],
            [
                14961,
                14964
            ],
            [
                15400,
                15402
            ],
            [
                15505,
                15564
            ],
            [
                15476,
                15503
            ],
            [
                15579,
                15605
            ],
            [
                15626,
                15695
            ],
            [
                15695,
                15757
            ],
            [
                15757,
                15837
            ],
            [
                15841,
                15929
            ],
            [
                15929,
                15996
            ],
            [
                15996,
                16044
            ],
            [
                16049,
                16052
            ],
            [
                16052,
                16097
            ],
            [
                16194,
                16293
            ],
            [
                16337,
                16356
            ],
            [
                16356,
                16369
            ],
            [
                16369,
                16391
            ],
            [
                16391,
                16513
            ],
            [
                16513,
                16541
            ],
            [
                16583,
                16586
            ],
            [
                16586,
                16638
            ],
            [
                16638,
                16684
            ],
            [
                16684,
                16724
            ],
            [
                16724,
                16737
            ],
            [
                16737,
                16752
            ],
            [
                16752,
                16759
            ],
            [
                16759,
                16858
            ],
            [
                16865,
                16923
            ],
            [
                16923,
                16941
            ],
            [
                16941,
                17000
            ],
            [
                17000,
                17051
            ],
            [
                17641,
                17749
            ],
            [
                17834,
                17913
            ],
            [
                17913,
                17930
            ],
            [
                17930,
                17942
            ],
            [
                17964,
                18000
            ],
            [
                18000,
                18020
            ],
            [
                18020,
                18064
            ],
            [
                18064,
                18085
            ],
            [
                18125,
                18257
            ],
            [
                18265,
                18322
            ],
            [
                18355,
                18357
            ],
            [
                18357,
                18365
            ],
            [
                18365,
                18386
            ],
            [
                18394,
                18402
            ],
            [
                18404,
                18437
            ],
            [
                18437,
                18503
            ],
            [
                18514,
                18583
            ],
            [
                18624,
                18656
            ],
            [
                18732,
                18756
            ],
            [
                18756,
                18816
            ],
            [
                18848,
                18877
            ],
            [
                18877,
                19084
            ],
            [
                19084,
                19140
            ],
            [
                19254,
                19302
            ],
            [
                19310,
                19317
            ],
            [
                19317,
                19352
            ],
            [
                19352,
                19404
            ],
            [
                19404,
                19461
            ],
            [
                19628,
                19660
            ],
            [
                19660,
                19680
            ],
            [
                19680,
                19738
            ],
            [
                19739,
                19760
            ],
            [
                19764,
                19766
            ],
            [
                19766,
                19858
            ],
            [
                19896,
                19983
            ],
            [
                19994,
                20145
            ],
            [
                20147,
                20189
            ],
            [
                20189,
                20202
            ],
            [
                20211,
                20246
            ],
            [
                20255,
                20265
            ],
            [
                20274,
                20331
            ],
            [
                20331,
                20347
            ],
            [
                20356,
                20436
            ],
            [
                20436,
                20574
            ],
            [
                20600,
                20606
            ],
            [
                20582,
                20588
            ],
            [
                20597,
                20599
            ],
            [
                20606,
                20618
            ],
            [
                20625,
                20708
            ],
            [
                20767,
                20772
            ],
            [
                20772,
                20858
            ],
            [
                20858,
                20876
            ],
            [
                20895,
                20899
            ],
            [
                20910,
                20919
            ],
            [
                20960,
                21006
            ],
            [
                21034,
                21036
            ],
            [
                21011,
                21013
            ],
            [
                21018,
                21022
            ],
            [
                21036,
                21039
            ],
            [
                21039,
                21061
            ],
            [
                21061,
                21101
            ],
            [
                21101,
                21191
            ],
            [
                21191,
                21197
            ],
            [
                21197,
                21233
            ],
            [
                21233,
                21252
            ],
            [
                21252,
                21272
            ],
            [
                21272,
                21315
            ],
            [
                21315,
                21345
            ],
            [
                21366,
                21419
            ],
            [
                21419,
                21458
            ],
            [
                21514,
                21551
            ],
            [
                21565,
                21577
            ],
            [
                21577,
                21644
            ],
            [
                21743,
                21761
            ],
            [
                21775,
                21793
            ],
            [
                21860,
                21870
            ],
            [
                21954,
                21956
            ],
            [
                21956,
                22033
            ],
            [
                22047,
                22079
            ],
            [
                22079,
                22081
            ],
            [
                22255,
                22434
            ],
            [
                22083,
                22084
            ],
            [
                22534,
                22543
            ],
            [
                22580,
                22685
            ],
            [
                22839,
                22841
            ],
            [
                22993,
                22996
            ],
            [
                22852,
                22863
            ],
            [
                22845,
                22847
            ],
            [
                22897,
                22901
            ],
            [
                22938,
                22941
            ],
            [
                23082,
                23087
            ],
            [
                23009,
                23027
            ],
            [
                23088,
                23152
            ],
            [
                23196,
                23255
            ],
            [
                23273,
                23298
            ],
            [
                23298,
                23306
            ],
            [
                23306,
                23322
            ],
            [
                23322,
                23487
            ],
            [
                23487,
                23509
            ],
            [
                23510,
                23558
            ],
            [
                23594,
                23595
            ],
            [
                23595,
                23691
            ],
            [
                23755,
                23769
            ],
            [
                23769,
                23785
            ],
            [
                23785,
                23844
            ],
            [
                23844,
                23863
            ],
            [
                23872,
                23882
            ],
            [
                23882,
                23896
            ],
            [
                23932,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                24021,
                24102
            ],
            [
                24102,
                24116
            ],
            [
                24196,
                24198
            ],
            [
                24198,
                24248
            ],
            [
                24268,
                24296
            ],
            [
                24343,
                24355
            ],
            [
                24355,
                24428
            ],
            [
                24476,
                24529
            ],
            [
                24550,
                24552
            ],
            [
                24552,
                24570
            ],
            [
                24601,
                24623
            ],
            [
                24623,
                24652
            ],
            [
                24662,
                24664
            ],
            [
                24664,
                24669
            ],
            [
                24669,
                24679
            ],
            [
                24679,
                24732
            ],
            [
                24745,
                24767
            ],
            [
                24802,
                24804
            ],
            [
                24804,
                24874
            ],
            [
                24874,
                24959
            ],
            [
                24959,
                24994
            ],
            [
                25037,
                25039
            ],
            [
                25039,
                25149
            ],
            [
                25149,
                25164
            ],
            [
                25171,
                25174
            ],
            [
                25174,
                25200
            ],
            [
                25200,
                25201
            ],
            [
                25212,
                25266
            ],
            [
                25266,
                25284
            ],
            [
                25301,
                25313
            ],
            [
                25313,
                25328
            ],
            [
                25328,
                25344
            ],
            [
                25364,
                25392
            ],
            [
                25392,
                25427
            ],
            [
                25463,
                25464
            ],
            [
                25508,
                25567
            ],
            [
                25616,
                25618
            ],
            [
                25618,
                25650
            ],
            [
                25669,
                25676
            ],
            [
                25676,
                25721
            ],
            [
                25754,
                25759
            ],
            [
                25823,
                25824
            ],
            [
                25855,
                26020
            ],
            [
                26027,
                26029
            ],
            [
                26029,
                26217
            ],
            [
                26217,
                26269
            ],
            [
                26269,
                26278
            ],
            [
                26278,
                26321
            ],
            [
                26321,
                26342
            ],
            [
                26342,
                26347
            ],
            [
                26347,
                26398
            ],
            [
                26398,
                26429
            ],
            [
                26429,
                26431
            ],
            [
                26453,
                26504
            ],
            [
                26612,
                26614
            ],
            [
                26614,
                26687
            ],
            [
                26713,
                26741
            ],
            [
                26741,
                26748
            ],
            [
                26765,
                26768
            ],
            [
                26768,
                26796
            ],
            [
                26796,
                26820
            ],
            [
                26820,
                26922
            ],
            [
                26922,
                26957
            ],
            [
                26957,
                26987
            ],
            [
                26987,
                26991
            ],
            [
                26991,
                27010
            ],
            [
                27010,
                27014
            ],
            [
                27014,
                27042
            ],
            [
                27042,
                27046
            ],
            [
                27046,
                27084
            ],
            [
                27097,
                27127
            ],
            [
                27127,
                27162
            ],
            [
                27162,
                27220
            ],
            [
                27277,
                27400
            ],
            [
                27585,
                27616
            ],
            [
                27636,
                27657
            ],
            [
                27677,
                27699
            ],
            [
                27719,
                27739
            ],
            [
                27739,
                27773
            ],
            [
                27773,
                27812
            ],
            [
                27812,
                27858
            ],
            [
                27916,
                27978
            ],
            [
                27978,
                28061
            ],
            [
                28061,
                28092
            ],
            [
                28175,
                28214
            ],
            [
                28330,
                28332
            ],
            [
                28332,
                28417
            ],
            [
                28417,
                28456
            ],
            [
                28497,
                28523
            ],
            [
                28546,
                28591
            ],
            [
                28591,
                28618
            ],
            [
                28651,
                28699
            ],
            [
                28699,
                28712
            ],
            [
                28722,
                28892
            ],
            [
                28898,
                28921
            ],
            [
                28927,
                28997
            ],
            [
                28997,
                29031
            ],
            [
                29031,
                29119
            ],
            [
                29119,
                29128
            ],
            [
                29134,
                29223
            ],
            [
                29223,
                29285
            ],
            [
                29299,
                29357
            ],
            [
                29722,
                29750
            ],
            [
                29357,
                29359
            ],
            [
                29758,
                29768
            ],
            [
                29776,
                29788
            ],
            [
                29586,
                29588
            ],
            [
                29810,
                29820
            ],
            [
                29822,
                29846
            ],
            [
                29858,
                29934
            ],
            [
                29991,
                29993
            ],
            [
                29993,
                30120
            ],
            [
                30122,
                30140
            ],
            [
                30143,
                30170
            ],
            [
                30170,
                30183
            ],
            [
                30227,
                30253
            ],
            [
                30323,
                30334
            ],
            [
                30350,
                30366
            ]
        ],
        "row_chars": [
            [
                0,
                57
            ],
            [
                57,
                220
            ],
            [
                220,
                387
            ],
            [
                387,
                454
            ],
            [
                454,
                596
            ],
            [
                596,
                934
            ],
            [
                934,
                1057
            ],
            [
                1057,
                1335
            ],
            [
                1335,
                1368
            ],
            [
                1368,
                1842
            ],
            [
                1842,
                1902
            ],
            [
                1902,
                2163
            ],
            [
                2163,
                2423
            ],
            [
                2423,
                2581
            ],
            [
                2581,
                2690
            ],
            [
                2690,
                3068
            ],
            [
                3068,
                3282
            ],
            [
                3282,
                3357
            ],
            [
                3357,
                3572
            ],
            [
                3572,
                3626
            ],
            [
                3626,
                3782
            ],
            [
                3782,
                3841
            ],
            [
                3841,
                3989
            ],
            [
                3989,
                4089
            ],
            [
                4089,
                4204
            ],
            [
                4204,
                4344
            ],
            [
                4344,
                4565
            ],
            [
                4565,
                4782
            ],
            [
                4782,
                5102
            ],
            [
                5102,
                5248
            ],
            [
                5248,
                5733
            ],
            [
                5733,
                5894
            ],
            [
                5894,
                5988
            ],
            [
                5988,
                6223
            ],
            [
                6223,
                6533
            ],
            [
                6533,
                6712
            ],
            [
                6712,
                6831
            ],
            [
                6831,
                7051
            ],
            [
                7051,
                7486
            ],
            [
                7486,
                7644
            ],
            [
                7644,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                7965
            ],
            [
                7965,
                8047
            ],
            [
                8047,
                8162
            ],
            [
                8162,
                8188
            ],
            [
                8188,
                8237
            ],
            [
                8237,
                8277
            ],
            [
                8277,
                8376
            ],
            [
                8376,
                8448
            ],
            [
                8448,
                8468
            ],
            [
                8468,
                8504
            ],
            [
                8504,
                8515
            ],
            [
                8515,
                8550
            ],
            [
                8550,
                8591
            ],
            [
                8591,
                8839
            ],
            [
                8839,
                9262
            ],
            [
                9262,
                9313
            ],
            [
                9313,
                9440
            ],
            [
                9440,
                9496
            ],
            [
                9496,
                9593
            ],
            [
                9593,
                9872
            ],
            [
                9872,
                9930
            ],
            [
                9930,
                10022
            ],
            [
                10022,
                10059
            ],
            [
                10059,
                10074
            ],
            [
                10074,
                10085
            ],
            [
                10085,
                10089
            ],
            [
                10089,
                10103
            ],
            [
                10103,
                10107
            ],
            [
                10107,
                10186
            ],
            [
                10186,
                10195
            ],
            [
                10195,
                10262
            ],
            [
                10262,
                10399
            ],
            [
                10399,
                10472
            ],
            [
                10472,
                10497
            ],
            [
                10497,
                10625
            ],
            [
                10625,
                10725
            ],
            [
                10725,
                10810
            ],
            [
                10810,
                10863
            ],
            [
                10863,
                10941
            ],
            [
                10941,
                11010
            ],
            [
                11010,
                11175
            ],
            [
                11175,
                11191
            ],
            [
                11191,
                11255
            ],
            [
                11255,
                11331
            ],
            [
                11331,
                11338
            ],
            [
                11338,
                11361
            ],
            [
                11361,
                11377
            ],
            [
                11377,
                11464
            ],
            [
                11464,
                11600
            ],
            [
                11600,
                11665
            ],
            [
                11665,
                11721
            ],
            [
                11721,
                11744
            ],
            [
                11744,
                11774
            ],
            [
                11774,
                11885
            ],
            [
                11885,
                11973
            ],
            [
                11973,
                12179
            ],
            [
                12179,
                12318
            ],
            [
                12318,
                12346
            ],
            [
                12346,
                12367
            ],
            [
                12367,
                12533
            ],
            [
                12533,
                12617
            ],
            [
                12617,
                12630
            ],
            [
                12630,
                12671
            ],
            [
                12671,
                12678
            ],
            [
                12678,
                12722
            ],
            [
                12722,
                12840
            ],
            [
                12840,
                12864
            ],
            [
                12864,
                12875
            ],
            [
                12875,
                12908
            ],
            [
                12908,
                13036
            ],
            [
                13036,
                13085
            ],
            [
                13085,
                13210
            ],
            [
                13210,
                13251
            ],
            [
                13251,
                13258
            ],
            [
                13258,
                13303
            ],
            [
                13303,
                13317
            ],
            [
                13317,
                13365
            ],
            [
                13365,
                13488
            ],
            [
                13488,
                13602
            ],
            [
                13602,
                13859
            ],
            [
                13859,
                13866
            ],
            [
                13866,
                13931
            ],
            [
                13931,
                14079
            ],
            [
                14079,
                14276
            ],
            [
                14276,
                14399
            ],
            [
                14399,
                14755
            ],
            [
                14755,
                14943
            ],
            [
                14943,
                15402
            ],
            [
                15402,
                15567
            ],
            [
                15567,
                15695
            ],
            [
                15695,
                15757
            ],
            [
                15757,
                15841
            ],
            [
                15841,
                15929
            ],
            [
                15929,
                15996
            ],
            [
                15996,
                16052
            ],
            [
                16052,
                16293
            ],
            [
                16293,
                16337
            ],
            [
                16337,
                16356
            ],
            [
                16356,
                16369
            ],
            [
                16369,
                16391
            ],
            [
                16391,
                16513
            ],
            [
                16513,
                16586
            ],
            [
                16586,
                16638
            ],
            [
                16638,
                16684
            ],
            [
                16684,
                16724
            ],
            [
                16724,
                16737
            ],
            [
                16737,
                16752
            ],
            [
                16752,
                16759
            ],
            [
                16759,
                16923
            ],
            [
                16923,
                16941
            ],
            [
                16941,
                17000
            ],
            [
                17000,
                17051
            ],
            [
                17051,
                17068
            ],
            [
                17068,
                17240
            ],
            [
                17240,
                17384
            ],
            [
                17384,
                17393
            ],
            [
                17393,
                17482
            ],
            [
                17482,
                17491
            ],
            [
                17491,
                17641
            ],
            [
                17641,
                17750
            ],
            [
                17750,
                17834
            ],
            [
                17834,
                17913
            ],
            [
                17913,
                17930
            ],
            [
                17930,
                18000
            ],
            [
                18000,
                18020
            ],
            [
                18020,
                18064
            ],
            [
                18064,
                18085
            ],
            [
                18085,
                18125
            ],
            [
                18125,
                18257
            ],
            [
                18257,
                18357
            ],
            [
                18357,
                18365
            ],
            [
                18365,
                18437
            ],
            [
                18437,
                18503
            ],
            [
                18503,
                18671
            ],
            [
                18671,
                18732
            ],
            [
                18732,
                18756
            ],
            [
                18756,
                18877
            ],
            [
                18877,
                19084
            ],
            [
                19084,
                19169
            ],
            [
                19169,
                19254
            ],
            [
                19254,
                19317
            ],
            [
                19317,
                19352
            ],
            [
                19352,
                19404
            ],
            [
                19404,
                19462
            ],
            [
                19462,
                19556
            ],
            [
                19556,
                19628
            ],
            [
                19628,
                19660
            ],
            [
                19660,
                19680
            ],
            [
                19680,
                19739
            ],
            [
                19739,
                19766
            ],
            [
                19766,
                19896
            ],
            [
                19896,
                20189
            ],
            [
                20189,
                20246
            ],
            [
                20246,
                20255
            ],
            [
                20255,
                20274
            ],
            [
                20274,
                20331
            ],
            [
                20331,
                20356
            ],
            [
                20356,
                20436
            ],
            [
                20436,
                20772
            ],
            [
                20772,
                20858
            ],
            [
                20858,
                20919
            ],
            [
                20919,
                20960
            ],
            [
                20960,
                21039
            ],
            [
                21039,
                21061
            ],
            [
                21061,
                21101
            ],
            [
                21101,
                21191
            ],
            [
                21191,
                21197
            ],
            [
                21197,
                21233
            ],
            [
                21233,
                21252
            ],
            [
                21252,
                21272
            ],
            [
                21272,
                21315
            ],
            [
                21315,
                21366
            ],
            [
                21366,
                21419
            ],
            [
                21419,
                21458
            ],
            [
                21458,
                21493
            ],
            [
                21493,
                21500
            ],
            [
                21500,
                21551
            ],
            [
                21551,
                21577
            ],
            [
                21577,
                21644
            ],
            [
                21644,
                21956
            ],
            [
                21956,
                22081
            ],
            [
                22081,
                22534
            ],
            [
                22534,
                22841
            ],
            [
                22841,
                23152
            ],
            [
                23152,
                23298
            ],
            [
                23298,
                23306
            ],
            [
                23306,
                23322
            ],
            [
                23322,
                23487
            ],
            [
                23487,
                23558
            ],
            [
                23558,
                23571
            ],
            [
                23571,
                23594
            ],
            [
                23594,
                23692
            ],
            [
                23692,
                23755
            ],
            [
                23755,
                23769
            ],
            [
                23769,
                23785
            ],
            [
                23785,
                23844
            ],
            [
                23844,
                23882
            ],
            [
                23882,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23974
            ],
            [
                23974,
                23990
            ],
            [
                23990,
                24021
            ],
            [
                24021,
                24102
            ],
            [
                24102,
                24198
            ],
            [
                24198,
                24296
            ],
            [
                24296,
                24324
            ],
            [
                24324,
                24343
            ],
            [
                24343,
                24355
            ],
            [
                24355,
                24552
            ],
            [
                24552,
                24570
            ],
            [
                24570,
                24601
            ],
            [
                24601,
                24623
            ],
            [
                24623,
                24664
            ],
            [
                24664,
                24669
            ],
            [
                24669,
                24679
            ],
            [
                24679,
                24804
            ],
            [
                24804,
                24874
            ],
            [
                24874,
                24959
            ],
            [
                24959,
                25039
            ],
            [
                25039,
                25149
            ],
            [
                25149,
                25174
            ],
            [
                25174,
                25200
            ],
            [
                25200,
                25266
            ],
            [
                25266,
                25313
            ],
            [
                25313,
                25328
            ],
            [
                25328,
                25346
            ],
            [
                25346,
                25364
            ],
            [
                25364,
                25392
            ],
            [
                25392,
                25618
            ],
            [
                25618,
                25676
            ],
            [
                25676,
                25825
            ],
            [
                25825,
                25855
            ],
            [
                25855,
                26029
            ],
            [
                26029,
                26217
            ],
            [
                26217,
                26269
            ],
            [
                26269,
                26278
            ],
            [
                26278,
                26321
            ],
            [
                26321,
                26342
            ],
            [
                26342,
                26347
            ],
            [
                26347,
                26398
            ],
            [
                26398,
                26429
            ],
            [
                26429,
                26614
            ],
            [
                26614,
                26741
            ],
            [
                26741,
                26768
            ],
            [
                26768,
                26796
            ],
            [
                26796,
                26820
            ],
            [
                26820,
                26922
            ],
            [
                26922,
                26957
            ],
            [
                26957,
                26987
            ],
            [
                26987,
                26991
            ],
            [
                26991,
                27010
            ],
            [
                27010,
                27014
            ],
            [
                27014,
                27042
            ],
            [
                27042,
                27046
            ],
            [
                27046,
                27084
            ],
            [
                27084,
                27097
            ],
            [
                27097,
                27127
            ],
            [
                27127,
                27162
            ],
            [
                27162,
                27401
            ],
            [
                27401,
                27462
            ],
            [
                27462,
                27524
            ],
            [
                27524,
                27528
            ],
            [
                27528,
                27577
            ],
            [
                27577,
                27739
            ],
            [
                27739,
                27773
            ],
            [
                27773,
                27812
            ],
            [
                27812,
                27978
            ],
            [
                27978,
                28061
            ],
            [
                28061,
                28332
            ],
            [
                28332,
                28417
            ],
            [
                28417,
                28525
            ],
            [
                28525,
                28546
            ],
            [
                28546,
                28591
            ],
            [
                28591,
                28699
            ],
            [
                28699,
                28997
            ],
            [
                28997,
                29031
            ],
            [
                29031,
                29119
            ],
            [
                29119,
                29223
            ],
            [
                29223,
                29993
            ],
            [
                29993,
                30170
            ],
            [
                30170,
                30372
            ]
        ]
    },
    "abridged": {
        "text": "It is the long vacation in the regions of Chancery Lane. The good ships Law and Equity, those teak-built, iron-fastened, slowly-sailing clippers are laid up. The courts are all shut; the public offices lie in a hot sleep.\nThe Temple, Chancery Lane, Serjeants' Inn, and Lincoln's Inn Fields are like tidal harbours at low water, where stranded proceedings, offices at anchor, and idle clerks lounging on lop-sided stools, lie high and dry upon the ooze of the long vacation. Outer doors of chambers are shut, messages and parcels are left at the Porter's Lodge by the bushel.\nThere is only one judge in town. Even he only comes twice a week to sit in chambers; a gentleman in white trousers and a white hat - no wig; his nose is peeling from the sun and he drinks iced ginger-beer.\nThe bar of England is scattered over the face of the earth. How England can get on through four long summer months without its lawyers is beside the question. Dispersed fragments of the bar are to be found on the canals of Venice, by the Nile, in the baths of Germany, and sprinkled on the sea-sand all over the English coast. Scarcely one is to be encountered in the deserted region of Chancery Lane.\nIt is the hottest long vacation known for many years. All the young clerks are madly in love, and pine for the beloved object at Margate, Ramsgate, or Gravesend. All the middle-aged clerks think their families too large. A shop with a sun-blind, and a watered pavement, and a bowl of goldfish in the window, is a sanctuary. Temple Bar and Fleet Street are simmering all night.\nThere are offices about the Inns of Court in which a man might be cool; but the little alleys outside them seem to blaze. In Mr. Krook's court, it is so hot that the people turn their houses inside out and sit in chairs upon the pavement - Mr. Krook included, who pursues his studies with his cat by his side.\nOver all the legal neighbourhood there hangs, like some gigantic cobweb, the idleness and pensiveness of the long vacation. Mr. Snagsby, law-stationer, has more leisure for musing during the long vacation than at other seasons, and he says to the two apprentices, what a thing it is in such hot weather to think that you live in an island with the sea a-bowling right round you.\nGuster is busy in the little drawing-room this afternoon, when Mr. and Mrs. Snagsby are to receive company. The expected guests are Mr. and Mrs. Chadband. From Mr. Chadband's being much given to describe himself as a vessel, he is occasionally mistaken by strangers for a sailor, but he is, he says, \"in the ministry.\" Mr. Chadband is attached to no particular denomination and is considered by his persecutors to have nothing very remarkable to say; but he has his followers, and Mrs. Snagsby is one of them.\n\"My little woman,\" says Mr. Snagsby to the sparrows in Staple Inn, \"likes to have her religion rather sharp, you see!\"\nSo Guster prepares the drawing-room for tea. All the furniture is dusted, the best tea-service is set forth, and there is excellent provision of dainty new bread, cool fresh butter, thin slices of ham, tongue, and German sausage, and delicate little rows of anchovies nestling in parsley, eggs and hot buttered toast. For Chadband is rather a consuming vessel.\nMr. Snagsby in his best coat, looking at all the preparations, says to Mrs. Snagsby, \"At what time did you expect Mr. and Mrs. Chadband, my love?\"\n\"At six,\" says Mrs. Snagsby.\nMr. Snagsby observes mildly that \"it's gone that.\"\n\"Perhaps you'd like to begin without them,\" is Mrs. Snagsby's reproachful remark.\nMr. Snagsby does look as if he would like it, but he says, with his cough of mildness, \"No, my dear, no. I merely named the time.\"\n\"What's time,\" says Mrs. Snagsby, \"to eternity?\"\n\"Very true, my dear,\" says Mr. Snagsby.\nHere, Guster, who has been looking out of the bedroom window, comes flushed and rustling down the little staircase to announce that Mr. and Mrs. Chadband have appeared in the court. The bell immediately tinkles; and much discomposed in her nerves, she announces them as \"Mr. and Mrs. Cheeseming, least which, Imeantersay, whatsername!\"\nMr. Chadband is a large yellow man with a fat smile and a general appearance of having a good deal of train oil in his system. Mrs. Chadband is a stern, severe-looking, silent woman. Mr. Chadband moves softly and cumbrously, not unlike a bear who has been taught to walk upright. He is in a perspiration about the head, and never speaks without first putting up his great hand, signalling to his hearers that he is going to edify them.\n\"My friends,\" says Mr. Chadband, \"peace be on this house! On the master thereof, on the mistress thereof! My friends, why do I wish for peace? What is peace? Is it war? No. Is it strife? No. Is it lovely, and gentle, and beautiful, and serene? Oh, yes! Therefore, my friends, I wish for peace, upon you and upon yours.\"\nAs Mrs. Snagsby is looking deeply edified, Mr. Snagsby thinks it expedient to say amen, which is well received.\n\"Now, my friends,\" proceeds Mr. Chadband, \"since I am upon this theme-\"\nGuster comes in. Mrs. Snagsby, in a spectral bass voice, says, \"Go away!\"\n\"Now, my friends,\" says Chadband, \"since I am upon this theme, and in my lowly path improving it-\"\nGuster is heard unaccountably to murmur \"one thousing seven hundred and eighty-two.\"\nMr. Chadband, pausing with the resignation of a man accustomed to be persecuted, folds up his chin into his fat smile, and says, \"Let us hear the maiden!\"\n\"Cab number one thousing seven hundred and eighty-two, if you please, sir. Which he wish to know what the shilling ware for,\" says Guster, breathless.\n\"For?\" returns Mrs. Chadband. \"His fare!\"\nGuster replies that \"he insists on one and eightpence or on summonsizzing the party.\" Mrs. Snagsby and Mrs. Chadband are growing shrill in indignation when Mr. Chadband quiets the tumult by lifting up his hand.\n\"My friends,\" says he, \"I remember a duty unfulfilled yesterday. It is right that I should be chastened in some penalty. Rachael, pay the eightpence!\"\nWhile Mr. Chadband glows with humility and train oil, Mrs. Chadband pays the money.\n\"My friends,\" says Chadband, \"eightpence is not much; it might have been half a crown. O let us be joyful, joyful!\"\nWith which remark, he stalks to the table, and before taking a chair, lifts up his hand.\n\"My friends,\" says he, \"what is this which is spread before us? Refreshment. Do we need refreshment, my friends? We do. And why, my friends? Because we are but mortal, because we are but sinful, because we are but of the earth, and not of the air. Can we fly, my friends? We cannot. Why can we not fly, my friends?\"\nMr. Snagsby to observe in a cheerful and rather knowing tone, \"No wings.\" He is immediately frowned down by Mrs. Snagsby.\n\"I say, my friends,\" pursues Mr. Chadband, obliterating Mr. Snagsby's suggestion, \"why can we not fly? Is it because we are meant to walk? It is. Could we walk, my friends, without strength? We could not. Our knees would double up, our ankles would turn over, and we should come to the ground. Then from whence, my friends, do we derive the strength that is necessary to our limbs? Is it,\" says Chadband, glancing over the table, \"from bread in various forms, from butter, from eggs, from ham, from tongue, from sausage, and from such like? It is. Then let us partake of the good things which are set before us!\"\nMr. Chadband, having concluded for the present, sits down at Mr. Snagsby's table and lays about him prodigiously. The conversion of food into oil of the quality already mentioned appears to be a process so inevitable for this vessel, that in eating he may be described as becoming a kind of oil mill.\nAt this period, Guster whispers to Mr. Snagsby that he is wanted in the shop.\n\"Perhaps this good company will excuse me for half a minute,\" says Mr. Snagsby, rising.\nHe descends and finds the two apprentices contemplating a police constable, who holds a ragged boy by the arm.\n\"Why, bless my heart,\" says Mr. Snagsby, \"what's the matter!\"\n\"This boy,\" says the constable, \"although he's repeatedly told to, won't move on-\"\n\"I'm always a-moving on, sar,\" cries the boy, wiping away his grimy tears with his arm. \"I've always been a-moving and a-moving on, ever since I was born. Where can I possibly move to, sir, more nor I do!\"\n\"He won't move on,\" says the constable calmly, \"although he has been repeatedly cautioned, and therefore I am obliged to take him into custody. He won't move on.\"\n\"Oh, my eye! Where can I move to!\" cries the boy, clutching quite desperately at his hair and beating his bare feet upon the floor of Mr. Snagsby's passage.\n\"Don't you come none of that!\" says the constable, giving him a passionless shake. \"My instructions are that you are to move on. I have told you so five hundred times.\"\n\"But where?\" cries the boy.\n\"Well! Really, constable, you know,\" says Mr. Snagsby wistfully, and coughing behind his hand his cough of perplexity and doubt, \"really, that does seem a question. Where, you know?\"\n\"My instructions don't go to that,\" replies the constable. \"My instructions are that this boy is to move on.\"\nBy this time Mr. and Mrs. Chadband and Mrs. Snagsby, hearing the altercation, have appeared upon the stairs.\n\"The simple question is, sir,\" says the constable, \"whether you know this boy. He says you do.\"\nMrs. Snagsby instantly cries out, \"No he don't!\"\n\"My lit-tle woman!\" says Mr. Snagsby, looking up the staircase. \"My love, permit me! I do know something of this lad, and in what I know of him, I can't say that there's any harm; perhaps on the contrary, constable.\" The law-stationer relates his Joful and woeful experience.\n\"Well!\" says the constable, \"it seems he had grounds for what he said. When I took him into custody up in Holborn, he said you knew him. A young man who was in the crowd said he was acquainted with you, and if I'd call and make the inquiry - oh! Here is the young man!\"\nEnter Mr. Guppy, who nods to Mr. Snagsby and touches his hat to the ladies on the stairs.\n\"I was strolling away from the office just now when I found this row going on,\" says Mr. Guppy to the law-stationer, \"and as your name was mentioned, I thought it was right the thing should be looked into.\"\n\"It was very good-natured of you, sir,\" says Mr. Snagsby.\n\"Now, I know where you live,\" says the constable to Jo. \"You live down in Tom-all-Alone's. That's a nice innocent place to live in, ain't it?\"\n\"I can't go and live in no nicer place, sir,\" replies Jo.\n\"You are very poor, ain't you?\" says the constable.\n\"Yes, I am indeed, sir, wery poor in gin'ral,\" replies Jo.\n\"I leave you to judge! I shook these two half-crowns out of him,\" says the constable, producing them to the company.\n\"They're wot's left, Mr. Snagsby,\" says Jo, \"out of a sov-ring as wos give me by a lady as sed she wos a servant and as come to my crossin one night and asked to be showd this 'ere ouse and the ouse wot him as you giv the writin to died at and the berrin-ground wot he's berrid in. She ses to me 'are you the boy at the inkwhich?' I ses 'yes.' She ses to me she ses 'can you show me all them places?' I ses 'yes I can.' And she ses to me 'do it' and I dun it and she giv me a sov'ring and hooked it. And I an't had much of the sov'ring neither,\" says Jo, with dirty tears, \"fur I had to pay five bob, down in Tom-all-Alone's, afore they'd change it fur me, and then a man he thieved another five while I was asleep and another boy he thieved ninepence of it.\"\n\"You don't expect anybody to believe this, about the lady and the sovereign, do you?\" says the constable with disdain.\n\"I don't expect nothink at all, sir, much, but it's true.\"\n\"You see what he is!\" the constable observes to the audience. \"Well, Mr. Snagsby, if I don't lock him up this time, will you engage for his moving on?\"\n\"No!\" cries Mrs. Snagsby from the stairs.\n\"My little woman!\" pleads her husband. \"Constable, I have no doubt he'll move on. You know you really must do it, Jo.\"\n\"I'm everyways agreeable, sir,\" says the hapless Jo.\n\"Do it, then,\" observes the constable. \"You won't get off so easy next time. Take your money. Now, the sooner you're five mile off, the better for all parties.\"\nThe constable bids good afternoon and walks away.\nNow, Jo's improbable story concerning the lady and the sovereign has awakened the curiosity of all the company, especially Mr. Guppy, who has an inquiring mind. He enters on a regular cross-examination of the witness, which is found so interesting by the ladies that Mrs. Snagsby politely invites him to step upstairs and drink a cup of tea.\nMr. Guppy accepting, Jo is requested to follow into the drawing-room doorway, where Mr. Guppy takes him in hand as a witness. His cross examination is both long and fruitless, but Mrs. Snagsby feels that it lifts her husband's establishment higher up in the law. Meanwhile the vessel Chadband, being merely engaged in the oil trade, waits to be floated off.\n\"Well!\" says Mr. Guppy. \"Either this boy sticks to it like cobbler's-wax or there is something out of the common here that beats anything that ever came into my way at Kenge and Carboy's.\"\nMrs. Chadband whispers to Mrs. Snagsby, who exclaims, \"You don't say so!\"\n\"Mrs. Chadband - this gentleman's wife - has known Kenge and Carboy's office for years,\" Mrs. Snagsby triumphantly explains to Mr. Guppy.\n\"Oh, indeed!\" says Mr. Guppy.\n\"Before I married my present husband,\" says Mrs. Chadband.\n\"Was you a party in any suit, ma'am?\" says Mr. Guppy.\n\"No.\"\n\"Perhaps you were acquainted with somebody who was a party in something, ma'am?\" says Mr. Guppy.\n\"Not exactly that, either,\" replies Mrs. Chadband, with a hard-favoured smile.\n\"Very good. Pray, ma'am, was it a lady of your acquaintance who had some transactions with Kenge and Carboy's office, or was it a gentleman? Take time, ma'am. Man or woman, ma'am?\"\n\"Neither,\" says Mrs. Chadband.\n\"Oh! A child!\" says Mr. Guppy, throwing on the admiring Mrs. Snagsby an acute professional eye. \"Now, ma'am, perhaps you'll have the kindness to tell us what child.\"\n\"You have got it at last, sir,\" says Mrs. Chadband with another hard-favoured smile. \"Well, sir, it was before your time. I was left in charge of a child named Esther Summerson, who was put out in life by Messrs. Kenge and Carboy.\"\n\"Miss Summerson!\" cries Mr. Guppy, excited.\n\"Esther Summerson,\" says Mrs. Chadband with austerity. \"There was no Miss in my time. It was Esther. 'Esther, do this!' and she was made to do it.\"\n\"My dear ma'am,\" returns Mr. Guppy, \"I received that young lady in London when she first came here. Allow me to have the pleasure of shaking your hand.\"\nMr. Chadband, at last seeing his opportunity, rises.\n\"My friends,\" says Chadband, \"we have partaken in moderation\" (which was certainly not the case so far as he was concerned) \"of the comforts which have been provided. May this house live upon the fatness of the land; may corn and wine be plentiful therein; may it grow, may it thrive, may it prosper, may it advance, may it proceed, may it press forward! But, my friends, have we partaken of anything else? We have. My friends, of what else have we partaken? Of spiritual profit? Yes. From whence have we derived that spiritual profit? My young friend, stand forth!\"\nJo gives a slouch backward, and another slouch forward.\n\"My young friend,\" says Chadband, \"you are to us a pearl, you are to us a gem, you are to us a jewel. And why?\"\n\"I don't know,\" replies Jo. \"I don't know nothink.\"\n\"My young friend,\" says Chadband, \"it is because you know nothing that you are to us a gem and jewel. For what are you, my young friend? Are you a beast of the field? No. A bird of the air? No. A fish of the sea or river? No. You are a human boy, my young friend. O glorious to be a human boy! And why glorious, my young friend? Because you are capable of receiving the lessons of wisdom which I now deliver for your good, because you are not a stick, or a staff, or a stock, or a stone, or a post, or a pillar. But you are in a state of darkness, a state of obscurity, a state of sinfulness, a state of bondage. My young friend, what is bondage? Let us, in a spirit of love, inquire.\"\nAt this threatening stage of the discourse, Jo smears his right arm over his face and gives a terrible yawn. Mrs. Snagsby indignantly expresses her belief that he is a limb of the arch-fiend.\n\"My friends,\" says Mr. Chadband, \"it is right that I should be humbled. I stumbled, on Sabbath last, when I thought with pride of my three hours' improving. The account is now favourably balanced: O let us be joyful, joyful!\"\nGreat sensation on the part of Mrs. Snagsby.\n\"My friends,\" says Chadband, \"I will not proceed with my young friend now. Will you come tomorrow, my young friend, and inquire of this good lady where I am to be found to deliver a discourse unto you, and will you come like the thirsty swallow upon the next day, and the day after that, and the day after that, and upon many pleasant days, to hear discourses?\" (This with a cow-like lightness.)\nJo, whose immediate object seems to be to get away on any terms, gives a shuffling nod. Mr. Guppy throws him a penny, and Mrs. Snagsby calls to Guster to see him safely out of the house. But before he goes downstairs, Mr. Snagsby loads him with some food from the table, which he carries away, hugging in his arms, down to Blackfriars Bridge.\nHe finds a stony corner to eat his repast; and there he sits, munching, and looking up at the great cross on the summit of St. Paul's Cathedral. From the boy's face one might suppose that sacred emblem to be, in his eyes, the crowning confusion of the great, confused city - so golden, so high, so far out of his reach. There he sits, the crowd flowing by him - until he is told to \"move on\".",
        "paragraph_chars": [
            [
                0,
                222
            ],
            [
                222,
                575
            ],
            [
                575,
                781
            ],
            [
                781,
                1183
            ],
            [
                1183,
                1560
            ],
            [
                1560,
                1870
            ],
            [
                1870,
                2249
            ],
            [
                2249,
                2759
            ],
            [
                2759,
                2878
            ],
            [
                2878,
                3239
            ],
            [
                3239,
                3386
            ],
            [
                3386,
                3415
            ],
            [
                3415,
                3466
            ],
            [
                3466,
                3548
            ],
            [
                3548,
                3679
            ],
            [
                3679,
                3728
            ],
            [
                3728,
                3768
            ],
            [
                3768,
                4104
            ],
            [
                4104,
                4540
            ],
            [
                4540,
                4860
            ],
            [
                4860,
                4972
            ],
            [
                4972,
                5044
            ],
            [
                5044,
                5118
            ],
            [
                5118,
                5217
            ],
            [
                5217,
                5302
            ],
            [
                5302,
                5457
            ],
            [
                5457,
                5608
            ],
            [
                5608,
                5650
            ],
            [
                5650,
                5861
            ],
            [
                5861,
                6012
            ],
            [
                6012,
                6096
            ],
            [
                6096,
                6212
            ],
            [
                6212,
                6301
            ],
            [
                6301,
                6617
            ],
            [
                6617,
                6739
            ],
            [
                6739,
                7352
            ],
            [
                7352,
                7653
            ],
            [
                7653,
                7731
            ],
            [
                7731,
                7819
            ],
            [
                7819,
                7930
            ],
            [
                7930,
                7992
            ],
            [
                7992,
                8075
            ],
            [
                8075,
                8281
            ],
            [
                8281,
                8444
            ],
            [
                8444,
                8601
            ],
            [
                8601,
                8770
            ],
            [
                8770,
                8798
            ],
            [
                8798,
                8981
            ],
            [
                8981,
                9091
            ],
            [
                9091,
                9200
            ],
            [
                9200,
                9296
            ],
            [
                9296,
                9345
            ],
            [
                9345,
                9621
            ],
            [
                9621,
                9891
            ],
            [
                9891,
                9981
            ],
            [
                9981,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10389
            ],
            [
                10389,
                10447
            ],
            [
                10447,
                10499
            ],
            [
                10499,
                10558
            ],
            [
                10558,
                10675
            ],
            [
                10675,
                11435
            ],
            [
                11435,
                11554
            ],
            [
                11554,
                11613
            ],
            [
                11613,
                11765
            ],
            [
                11765,
                11807
            ],
            [
                11807,
                11926
            ],
            [
                11926,
                11979
            ],
            [
                11979,
                12140
            ],
            [
                12140,
                12190
            ],
            [
                12190,
                12532
            ],
            [
                12532,
                12890
            ],
            [
                12890,
                13079
            ],
            [
                13079,
                13153
            ],
            [
                13153,
                13291
            ],
            [
                13291,
                13321
            ],
            [
                13321,
                13380
            ],
            [
                13380,
                13434
            ],
            [
                13434,
                13440
            ],
            [
                13440,
                13537
            ],
            [
                13537,
                13616
            ],
            [
                13616,
                13797
            ],
            [
                13797,
                13828
            ],
            [
                13828,
                13994
            ],
            [
                13994,
                14226
            ],
            [
                14226,
                14270
            ],
            [
                14270,
                14418
            ],
            [
                14418,
                14571
            ],
            [
                14571,
                14624
            ],
            [
                14624,
                15191
            ],
            [
                15191,
                15247
            ],
            [
                15247,
                15359
            ],
            [
                15359,
                15411
            ],
            [
                15411,
                16097
            ],
            [
                16097,
                16289
            ],
            [
                16289,
                16515
            ],
            [
                16515,
                16560
            ],
            [
                16560,
                16956
            ],
            [
                16956,
                17299
            ],
            [
                17299,
                17691
            ]
        ],
        "segment_chars": [
            [
                0,
                57
            ],
            [
                57,
                158
            ],
            [
                158,
                222
            ],
            [
                222,
                474
            ],
            [
                474,
                575
            ],
            [
                575,
                608
            ],
            [
                608,
                781
            ],
            [
                781,
                841
            ],
            [
                841,
                940
            ],
            [
                940,
                1108
            ],
            [
                1108,
                1183
            ],
            [
                1183,
                1237
            ],
            [
                1237,
                1345
            ],
            [
                1345,
                1404
            ],
            [
                1404,
                1507
            ],
            [
                1507,
                1560
            ],
            [
                1560,
                1682
            ],
            [
                1682,
                1870
            ],
            [
                1870,
                1994
            ],
            [
                1994,
                2249
            ],
            [
                2249,
                2357
            ],
            [
                2357,
                2404
            ],
            [
                2404,
                2568
            ],
            [
                2568,
                2759
            ],
            [
                2759,
                2878
            ],
            [
                2878,
                2923
            ],
            [
                2923,
                3196
            ],
            [
                3196,
                3239
            ],
            [
                3239,
                3386
            ],
            [
                3386,
                3415
            ],
            [
                3415,
                3466
            ],
            [
                3466,
                3548
            ],
            [
                3548,
                3653
            ],
            [
                3653,
                3679
            ],
            [
                3679,
                3728
            ],
            [
                3728,
                3768
            ],
            [
                3768,
                3950
            ],
            [
                3950,
                4104
            ],
            [
                4104,
                4231
            ],
            [
                4231,
                4287
            ],
            [
                4287,
                4384
            ],
            [
                4384,
                4540
            ],
            [
                4540,
                4598
            ],
            [
                4598,
                4646
            ],
            [
                4646,
                4683
            ],
            [
                4683,
                4698
            ],
            [
                4698,
                4709
            ],
            [
                4709,
                4713
            ],
            [
                4713,
                4727
            ],
            [
                4727,
                4731
            ],
            [
                4731,
                4784
            ],
            [
                4784,
                4793
            ],
            [
                4793,
                4860
            ],
            [
                4860,
                4972
            ],
            [
                4972,
                5044
            ],
            [
                5044,
                5061
            ],
            [
                5061,
                5118
            ],
            [
                5118,
                5217
            ],
            [
                5217,
                5302
            ],
            [
                5302,
                5457
            ],
            [
                5457,
                5532
            ],
            [
                5532,
                5608
            ],
            [
                5608,
                5615
            ],
            [
                5615,
                5638
            ],
            [
                5638,
                5650
            ],
            [
                5650,
                5736
            ],
            [
                5736,
                5861
            ],
            [
                5861,
                5926
            ],
            [
                5926,
                5982
            ],
            [
                5982,
                6012
            ],
            [
                6012,
                6096
            ],
            [
                6096,
                6183
            ],
            [
                6183,
                6212
            ],
            [
                6212,
                6301
            ],
            [
                6301,
                6365
            ],
            [
                6365,
                6378
            ],
            [
                6378,
                6414
            ],
            [
                6414,
                6421
            ],
            [
                6421,
                6442
            ],
            [
                6442,
                6549
            ],
            [
                6549,
                6573
            ],
            [
                6573,
                6584
            ],
            [
                6584,
                6617
            ],
            [
                6617,
                6691
            ],
            [
                6691,
                6739
            ],
            [
                6739,
                6842
            ],
            [
                6842,
                6878
            ],
            [
                6878,
                6885
            ],
            [
                6885,
                6930
            ],
            [
                6930,
                6944
            ],
            [
                6944,
                7033
            ],
            [
                7033,
                7121
            ],
            [
                7121,
                7280
            ],
            [
                7280,
                7287
            ],
            [
                7287,
                7352
            ],
            [
                7352,
                7466
            ],
            [
                7466,
                7653
            ],
            [
                7653,
                7731
            ],
            [
                7731,
                7819
            ],
            [
                7819,
                7930
            ],
            [
                7930,
                7992
            ],
            [
                7992,
                8075
            ],
            [
                8075,
                8163
            ],
            [
                8163,
                8230
            ],
            [
                8230,
                8281
            ],
            [
                8281,
                8425
            ],
            [
                8425,
                8444
            ],
            [
                8444,
                8457
            ],
            [
                8457,
                8479
            ],
            [
                8479,
                8601
            ],
            [
                8601,
                8632
            ],
            [
                8632,
                8684
            ],
            [
                8684,
                8730
            ],
            [
                8730,
                8770
            ],
            [
                8770,
                8783
            ],
            [
                8783,
                8798
            ],
            [
                8798,
                8805
            ],
            [
                8805,
                8963
            ],
            [
                8963,
                8981
            ],
            [
                8981,
                9040
            ],
            [
                9040,
                9091
            ],
            [
                9091,
                9200
            ],
            [
                9200,
                9279
            ],
            [
                9279,
                9296
            ],
            [
                9296,
                9345
            ],
            [
                9345,
                9365
            ],
            [
                9365,
                9409
            ],
            [
                9409,
                9430
            ],
            [
                9430,
                9562
            ],
            [
                9562,
                9621
            ],
            [
                9621,
                9629
            ],
            [
                9629,
                9692
            ],
            [
                9692,
                9758
            ],
            [
                9758,
                9867
            ],
            [
                9867,
                9891
            ],
            [
                9891,
                9981
            ],
            [
                9981,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10302
            ],
            [
                10302,
                10337
            ],
            [
                10337,
                10389
            ],
            [
                10389,
                10447
            ],
            [
                10447,
                10479
            ],
            [
                10479,
                10499
            ],
            [
                10499,
                10558
            ],
            [
                10558,
                10581
            ],
            [
                10581,
                10675
            ],
            [
                10675,
                10957
            ],
            [
                10957,
                11006
            ],
            [
                11006,
                11019
            ],
            [
                11019,
                11076
            ],
            [
                11076,
                11095
            ],
            [
                11095,
                11175
            ],
            [
                11175,
                11435
            ],
            [
                11435,
                11521
            ],
            [
                11521,
                11554
            ],
            [
                11554,
                11613
            ],
            [
                11613,
                11635
            ],
            [
                11635,
                11675
            ],
            [
                11675,
                11765
            ],
            [
                11765,
                11771
            ],
            [
                11771,
                11807
            ],
            [
                11807,
                11826
            ],
            [
                11826,
                11846
            ],
            [
                11846,
                11889
            ],
            [
                11889,
                11926
            ],
            [
                11926,
                11979
            ],
            [
                11979,
                12018
            ],
            [
                12018,
                12056
            ],
            [
                12056,
                12073
            ],
            [
                12073,
                12140
            ],
            [
                12140,
                12190
            ],
            [
                12190,
                12351
            ],
            [
                12351,
                12532
            ],
            [
                12532,
                12658
            ],
            [
                12658,
                12795
            ],
            [
                12795,
                12890
            ],
            [
                12890,
                12898
            ],
            [
                12898,
                12914
            ],
            [
                12914,
                13079
            ],
            [
                13079,
                13153
            ],
            [
                13153,
                13291
            ],
            [
                13291,
                13305
            ],
            [
                13305,
                13321
            ],
            [
                13321,
                13380
            ],
            [
                13380,
                13418
            ],
            [
                13418,
                13434
            ],
            [
                13434,
                13440
            ],
            [
                13440,
                13521
            ],
            [
                13521,
                13537
            ],
            [
                13537,
                13616
            ],
            [
                13616,
                13628
            ],
            [
                13628,
                13757
            ],
            [
                13757,
                13775
            ],
            [
                13775,
                13797
            ],
            [
                13797,
                13828
            ],
            [
                13828,
                13833
            ],
            [
                13833,
                13843
            ],
            [
                13843,
                13924
            ],
            [
                13924,
                13994
            ],
            [
                13994,
                14079
            ],
            [
                14079,
                14116
            ],
            [
                14116,
                14226
            ],
            [
                14226,
                14244
            ],
            [
                14244,
                14270
            ],
            [
                14270,
                14325
            ],
            [
                14325,
                14356
            ],
            [
                14356,
                14371
            ],
            [
                14371,
                14390
            ],
            [
                14390,
                14418
            ],
            [
                14418,
                14518
            ],
            [
                14518,
                14571
            ],
            [
                14571,
                14624
            ],
            [
                14624,
                14791
            ],
            [
                14791,
                14979
            ],
            [
                14979,
                15031
            ],
            [
                15031,
                15040
            ],
            [
                15040,
                15083
            ],
            [
                15083,
                15104
            ],
            [
                15104,
                15109
            ],
            [
                15109,
                15160
            ],
            [
                15160,
                15191
            ],
            [
                15191,
                15247
            ],
            [
                15247,
                15349
            ],
            [
                15349,
                15359
            ],
            [
                15359,
                15387
            ],
            [
                15387,
                15411
            ],
            [
                15411,
                15513
            ],
            [
                15513,
                15548
            ],
            [
                15548,
                15578
            ],
            [
                15578,
                15582
            ],
            [
                15582,
                15601
            ],
            [
                15601,
                15605
            ],
            [
                15605,
                15633
            ],
            [
                15633,
                15637
            ],
            [
                15637,
                15675
            ],
            [
                15675,
                15705
            ],
            [
                15705,
                15740
            ],
            [
                15740,
                15923
            ],
            [
                15923,
                16024
            ],
            [
                16024,
                16058
            ],
            [
                16058,
                16097
            ],
            [
                16097,
                16206
            ],
            [
                16206,
                16289
            ],
            [
                16289,
                16361
            ],
            [
                16361,
                16446
            ],
            [
                16446,
                16515
            ],
            [
                16515,
                16560
            ],
            [
                16560,
                16635
            ],
            [
                16635,
                16922
            ],
            [
                16922,
                16956
            ],
            [
                16956,
                17044
            ],
            [
                17044,
                17143
            ],
            [
                17143,
                17299
            ],
            [
                17299,
                17444
            ],
            [
                17444,
                17619
            ],
            [
                17619,
                17691
            ]
        ],
        "overlap_chars": [
            [
                0,
                57
            ],
            [
                57,
                105
            ],
            [
                106,
                120
            ],
            [
                127,
                156
            ],
            [
                156,
                158
            ],
            [
                158,
                181
            ],
            [
                181,
                221
            ],
            [
                222,
                282
            ],
            [
                283,
                374
            ],
            [
                379,
                419
            ],
            [
                419,
                474
            ],
            [
                474,
                506
            ],
            [
                506,
                532
            ],
            [
                533,
                574
            ],
            [
                575,
                608
            ],
            [
                608,
                658
            ],
            [
                660,
                661
            ],
            [
                662,
                705
            ],
            [
                706,
                707
            ],
            [
                708,
                710
            ],
            [
                711,
                714
            ],
            [
                716,
                719
            ],
            [
                720,
                724
            ],
            [
                736,
                744
            ],
            [
                749,
                752
            ],
            [
                753,
                755
            ],
            [
                756,
                779
            ],
            [
                779,
                780
            ],
            [
                781,
                841
            ],
            [
                841,
                907
            ],
            [
                916,
                938
            ],
            [
                938,
                940
            ],
            [
                950,
                966
            ],
            [
                971,
                1011
            ],
            [
                1015,
                1108
            ],
            [
                1108,
                1182
            ],
            [
                1183,
                1237
            ],
            [
                1237,
                1280
            ],
            [
                1281,
                1289
            ],
            [
                1290,
                1308
            ],
            [
                1309,
                1345
            ],
            [
                1345,
                1404
            ],
            [
                1404,
                1471
            ],
            [
                1471,
                1507
            ],
            [
                1507,
                1517
            ],
            [
                1518,
                1534
            ],
            [
                1539,
                1560
            ],
            [
                1560,
                1630
            ],
            [
                1630,
                1646
            ],
            [
                1654,
                1661
            ],
            [
                1667,
                1682
            ],
            [
                1682,
                1797
            ],
            [
                1802,
                1823
            ],
            [
                1824,
                1843
            ],
            [
                1844,
                1856
            ],
            [
                1857,
                1869
            ],
            [
                1870,
                1925
            ],
            [
                1926,
                1994
            ],
            [
                1994,
                2020
            ],
            [
                2020,
                2021
            ],
            [
                2022,
                2049
            ],
            [
                2050,
                2120
            ],
            [
                2132,
                2224
            ],
            [
                2224,
                2249
            ],
            [
                2249,
                2290
            ],
            [
                2291,
                2295
            ],
            [
                2296,
                2305
            ],
            [
                2305,
                2332
            ],
            [
                2337,
                2357
            ],
            [
                2357,
                2380
            ],
            [
                2381,
                2402
            ],
            [
                2402,
                2404
            ],
            [
                2404,
                2460
            ],
            [
                2461,
                2520
            ],
            [
                2527,
                2539
            ],
            [
                2540,
                2542
            ],
            [
                2547,
                2568
            ],
            [
                2568,
                2675
            ],
            [
                2676,
                2698
            ],
            [
                2698,
                2745
            ],
            [
                2750,
                2752
            ],
            [
                2757,
                2758
            ],
            [
                2759,
                2878
            ],
            [
                2878,
                2887
            ],
            [
                2888,
                2900
            ],
            [
                2901,
                2923
            ],
            [
                2923,
                2943
            ],
            [
                2944,
                2950
            ],
            [
                2950,
                3019
            ],
            [
                3020,
                3039
            ],
            [
                3039,
                3166
            ],
            [
                3167,
                3171
            ],
            [
                3172,
                3196
            ],
            [
                3196,
                3237
            ],
            [
                3237,
                3239
            ],
            [
                3239,
                3300
            ],
            [
                3300,
                3386
            ],
            [
                3386,
                3415
            ],
            [
                3415,
                3435
            ],
            [
                3443,
                3466
            ],
            [
                3466,
                3548
            ],
            [
                3548,
                3592
            ],
            [
                3592,
                3653
            ],
            [
                3653,
                3679
            ],
            [
                3679,
                3728
            ],
            [
                3728,
                3767
            ],
            [
                3768,
                3785
            ],
            [
                3790,
                3835
            ],
            [
                3836,
                3843
            ],
            [
                3844,
                3847
            ],
            [
                3848,
                3856
            ],
            [
                3857,
                3882
            ],
            [
                3895,
                3950
            ],
            [
                3950,
                3958
            ],
            [
                3959,
                3970
            ],
            [
                3971,
                3975
            ],
            [
                3984,
                4014
            ],
            [
                4014,
                4019
            ],
            [
                4035,
                4037
            ],
            [
                4038,
                4103
            ],
            [
                4104,
                4231
            ],
            [
                4231,
                4287
            ],
            [
                4287,
                4384
            ],
            [
                4384,
                4389
            ],
            [
                4390,
                4481
            ],
            [
                4493,
                4540
            ],
            [
                4540,
                4598
            ],
            [
                4598,
                4644
            ],
            [
                4644,
                4646
            ],
            [
                4646,
                4683
            ],
            [
                4683,
                4698
            ],
            [
                4698,
                4709
            ],
            [
                4709,
                4713
            ],
            [
                4713,
                4727
            ],
            [
                4727,
                4731
            ],
            [
                4731,
                4775
            ],
            [
                4776,
                4782
            ],
            [
                4782,
                4784
            ],
            [
                4784,
                4793
            ],
            [
                4793,
                4860
            ],
            [
                4863,
                4875
            ],
            [
                4879,
                4934
            ],
            [
                4935,
                4972
            ],
            [
                4972,
                5041
            ],
            [
                5044,
                5050
            ],
            [
                5059,
                5061
            ],
            [
                5061,
                5099
            ],
            [
                5099,
                5105
            ],
            [
                5105,
                5118
            ],
            [
                5118,
                5214
            ],
            [
                5217,
                5301
            ],
            [
                5302,
                5381
            ],
            [
                5389,
                5420
            ],
            [
                5421,
                5424
            ],
            [
                5425,
                5454
            ],
            [
                5457,
                5458
            ],
            [
                5469,
                5532
            ],
            [
                5532,
                5608
            ],
            [
                5608,
                5615
            ],
            [
                5615,
                5638
            ],
            [
                5638,
                5639
            ],
            [
                5639,
                5650
            ],
            [
                5650,
                5656
            ],
            [
                5665,
                5673
            ],
            [
                5682,
                5736
            ],
            [
                5736,
                5770
            ],
            [
                5779,
                5861
            ],
            [
                5861,
                5926
            ],
            [
                5926,
                5982
            ],
            [
                5982,
                6012
            ],
            [
                6012,
                6095
            ],
            [
                6096,
                6158
            ],
            [
                6159,
                6183
            ],
            [
                6183,
                6209
            ],
            [
                6212,
                6230
            ],
            [
                6234,
                6294
            ],
            [
                6295,
                6301
            ],
            [
                6301,
                6343
            ],
            [
                6347,
                6365
            ],
            [
                6365,
                6378
            ],
            [
                6378,
                6400
            ],
            [
                6400,
                6414
            ],
            [
                6414,
                6421
            ],
            [
                6421,
                6428
            ],
            [
                6428,
                6442
            ],
            [
                6442,
                6528
            ],
            [
                6533,
                6549
            ],
            [
                6549,
                6573
            ],
            [
                6573,
                6584
            ],
            [
                6584,
                6617
            ],
            [
                6617,
                6628
            ],
            [
                6629,
                6691
            ],
            [
                6694,
                6739
            ],
            [
                6739,
                6781
            ],
            [
                6782,
                6842
            ],
            [
                6842,
                6862
            ],
            [
                6869,
                6878
            ],
            [
                6878,
                6885
            ],
            [
                6885,
                6930
            ],
            [
                6930,
                6944
            ],
            [
                6944,
                7033
            ],
            [
                7033,
                7061
            ],
            [
                7061,
                7121
            ],
            [
                7121,
                7210
            ],
            [
                7210,
                7216
            ],
            [
                7217,
                7221
            ],
            [
                7221,
                7280
            ],
            [
                7280,
                7287
            ],
            [
                7287,
                7352
            ],
            [
                7352,
                7364
            ],
            [
                7364,
                7466
            ],
            [
                7466,
                7483
            ],
            [
                7489,
                7557
            ],
            [
                7569,
                7572
            ],
            [
                7573,
                7577
            ],
            [
                7578,
                7584
            ],
            [
                7584,
                7585
            ],
            [
                7586,
                7593
            ],
            [
                7601,
                7623
            ],
            [
                7624,
                7642
            ],
            [
                7643,
                7646
            ],
            [
                7651,
                7652
            ],
            [
                7653,
                7667
            ],
            [
                7667,
                7684
            ],
            [
                7688,
                7717
            ],
            [
                7721,
                7724
            ],
            [
                7729,
                7731
            ],
            [
                7731,
                7790
            ],
            [
                7790,
                7817
            ],
            [
                7822,
                7848
            ],
            [
                7861,
                7930
            ],
            [
                7930,
                7992
            ],
            [
                7992,
                8072
            ],
            [
                8075,
                8163
            ],
            [
                8163,
                8230
            ],
            [
                8230,
                8278
            ],
            [
                8278,
                8281
            ],
            [
                8281,
                8326
            ],
            [
                8326,
                8425
            ],
            [
                8425,
                8444
            ],
            [
                8444,
                8457
            ],
            [
                8457,
                8479
            ],
            [
                8479,
                8601
            ],
            [
                8601,
                8629
            ],
            [
                8629,
                8632
            ],
            [
                8632,
                8684
            ],
            [
                8684,
                8730
            ],
            [
                8730,
                8770
            ],
            [
                8770,
                8783
            ],
            [
                8783,
                8798
            ],
            [
                8798,
                8805
            ],
            [
                8805,
                8904
            ],
            [
                8905,
                8963
            ],
            [
                8963,
                8981
            ],
            [
                8981,
                9040
            ],
            [
                9040,
                9091
            ],
            [
                9091,
                9199
            ],
            [
                9200,
                9279
            ],
            [
                9279,
                9296
            ],
            [
                9296,
                9308
            ],
            [
                9309,
                9345
            ],
            [
                9345,
                9365
            ],
            [
                9365,
                9409
            ],
            [
                9409,
                9430
            ],
            [
                9430,
                9562
            ],
            [
                9562,
                9619
            ],
            [
                9619,
                9621
            ],
            [
                9621,
                9629
            ],
            [
                9629,
                9650
            ],
            [
                9650,
                9658
            ],
            [
                9659,
                9692
            ],
            [
                9692,
                9758
            ],
            [
                9758,
                9827
            ],
            [
                9828,
                9860
            ],
            [
                9867,
                9891
            ],
            [
                9891,
                9951
            ],
            [
                9952,
                9981
            ],
            [
                9981,
                10188
            ],
            [
                10188,
                10244
            ],
            [
                10246,
                10294
            ],
            [
                10295,
                10302
            ],
            [
                10302,
                10337
            ],
            [
                10337,
                10389
            ],
            [
                10389,
                10446
            ],
            [
                10447,
                10479
            ],
            [
                10479,
                10499
            ],
            [
                10499,
                10557
            ],
            [
                10558,
                10579
            ],
            [
                10579,
                10581
            ],
            [
                10581,
                10673
            ],
            [
                10675,
                10762
            ],
            [
                10763,
                10914
            ],
            [
                10915,
                10957
            ],
            [
                10957,
                10970
            ],
            [
                10971,
                11006
            ],
            [
                11006,
                11016
            ],
            [
                11019,
                11076
            ],
            [
                11076,
                11092
            ],
            [
                11095,
                11175
            ],
            [
                11175,
                11313
            ],
            [
                11314,
                11320
            ],
            [
                11321,
                11327
            ],
            [
                11328,
                11330
            ],
            [
                11330,
                11342
            ],
            [
                11343,
                11426
            ],
            [
                11430,
                11435
            ],
            [
                11435,
                11521
            ],
            [
                11521,
                11539
            ],
            [
                11540,
                11544
            ],
            [
                11545,
                11554
            ],
            [
                11554,
                11600
            ],
            [
                11601,
                11603
            ],
            [
                11603,
                11605
            ],
            [
                11606,
                11610
            ],
            [
                11610,
                11613
            ],
            [
                11613,
                11635
            ],
            [
                11635,
                11675
            ],
            [
                11675,
                11765
            ],
            [
                11765,
                11771
            ],
            [
                11771,
                11807
            ],
            [
                11807,
                11826
            ],
            [
                11826,
                11846
            ],
            [
                11846,
                11889
            ],
            [
                11889,
                11919
            ],
            [
                11926,
                11979
            ],
            [
                11979,
                12018
            ],
            [
                12019,
                12056
            ],
            [
                12061,
                12073
            ],
            [
                12073,
                12140
            ],
            [
                12140,
                12158
            ],
            [
                12159,
                12177
            ],
            [
                12178,
                12188
            ],
            [
                12188,
                12190
            ],
            [
                12190,
                12267
            ],
            [
                12268,
                12300
            ],
            [
                12349,
                12351
            ],
            [
                12351,
                12530
            ],
            [
                12530,
                12531
            ],
            [
                12532,
                12541
            ],
            [
                12551,
                12656
            ],
            [
                12656,
                12658
            ],
            [
                12658,
                12661
            ],
            [
                12668,
                12679
            ],
            [
                12680,
                12682
            ],
            [
                12683,
                12687
            ],
            [
                12693,
                12696
            ],
            [
                12706,
                12711
            ],
            [
                12712,
                12730
            ],
            [
                12731,
                12795
            ],
            [
                12805,
                12864
            ],
            [
                12865,
                12890
            ],
            [
                12890,
                12898
            ],
            [
                12898,
                12914
            ],
            [
                12914,
                13079
            ],
            [
                13079,
                13101
            ],
            [
                13105,
                13153
            ],
            [
                13153,
                13154
            ],
            [
                13194,
                13290
            ],
            [
                13291,
                13305
            ],
            [
                13305,
                13321
            ],
            [
                13321,
                13380
            ],
            [
                13380,
                13399
            ],
            [
                13408,
                13418
            ],
            [
                13418,
                13432
            ],
            [
                13432,
                13434
            ],
            [
                13434,
                13440
            ],
            [
                13440,
                13521
            ],
            [
                13521,
                13535
            ],
            [
                13535,
                13537
            ],
            [
                13537,
                13587
            ],
            [
                13588,
                13616
            ],
            [
                13616,
                13628
            ],
            [
                13628,
                13701
            ],
            [
                13702,
                13755
            ],
            [
                13755,
                13757
            ],
            [
                13757,
                13775
            ],
            [
                13775,
                13797
            ],
            [
                13797,
                13826
            ],
            [
                13826,
                13828
            ],
            [
                13828,
                13833
            ],
            [
                13833,
                13843
            ],
            [
                13843,
                13896
            ],
            [
                13900,
                13922
            ],
            [
                13922,
                13924
            ],
            [
                13924,
                13994
            ],
            [
                13994,
                14079
            ],
            [
                14079,
                14114
            ],
            [
                14114,
                14116
            ],
            [
                14116,
                14226
            ],
            [
                14226,
                14241
            ],
            [
                14241,
                14244
            ],
            [
                14244,
                14270
            ],
            [
                14270,
                14271
            ],
            [
                14271,
                14325
            ],
            [
                14325,
                14343
            ],
            [
                14344,
                14356
            ],
            [
                14356,
                14371
            ],
            [
                14371,
                14387
            ],
            [
                14390,
                14418
            ],
            [
                14418,
                14453
            ],
            [
                14454,
                14455
            ],
            [
                14457,
                14516
            ],
            [
                14516,
                14518
            ],
            [
                14518,
                14550
            ],
            [
                14564,
                14571
            ],
            [
                14571,
                14616
            ],
            [
                14617,
                14622
            ],
            [
                14622,
                14623
            ],
            [
                14624,
                14789
            ],
            [
                14789,
                14791
            ],
            [
                14791,
                14979
            ],
            [
                14979,
                15031
            ],
            [
                15031,
                15040
            ],
            [
                15040,
                15083
            ],
            [
                15083,
                15104
            ],
            [
                15104,
                15109
            ],
            [
                15109,
                15160
            ],
            [
                15160,
                15191
            ],
            [
                15191,
                15193
            ],
            [
                15194,
                15245
            ],
            [
                15245,
                15247
            ],
            [
                15247,
                15320
            ],
            [
                15321,
                15349
            ],
            [
                15349,
                15356
            ],
            [
                15356,
                15359
            ],
            [
                15359,
                15387
            ],
            [
                15387,
                15411
            ],
            [
                15411,
                15513
            ],
            [
                15513,
                15548
            ],
            [
                15548,
                15578
            ],
            [
                15578,
                15582
            ],
            [
                15582,
                15601
            ],
            [
                15601,
                15605
            ],
            [
                15605,
                15633
            ],
            [
                15633,
                15637
            ],
            [
                15637,
                15675
            ],
            [
                15675,
                15705
            ],
            [
                15705,
                15740
            ],
            [
                15740,
                15798
            ],
            [
                15799,
                15922
            ],
            [
                15927,
                15958
            ],
            [
                15959,
                15980
            ],
            [
                15981,
                16003
            ],
            [
                16004,
                16024
            ],
            [
                16024,
                16058
            ],
            [
                16058,
                16097
            ],
            [
                16097,
                16143
            ],
            [
                16144,
                16206
            ],
            [
                16206,
                16289
            ],
            [
                16289,
                16320
            ],
            [
                16320,
                16359
            ],
            [
                16359,
                16361
            ],
            [
                16361,
                16446
            ],
            [
                16446,
                16485
            ],
            [
                16486,
                16512
            ],
            [
                16515,
                16560
            ],
            [
                16560,
                16587
            ],
            [
                16587,
                16635
            ],
            [
                16635,
                16648
            ],
            [
                16657,
                16827
            ],
            [
                16828,
                16851
            ],
            [
                16852,
                16922
            ],
            [
                16922,
                16956
            ],
            [
                16956,
                17044
            ],
            [
                17044,
                17053
            ],
            [
                17054,
                17143
            ],
            [
                17143,
                17205
            ],
            [
                17211,
                17269
            ],
            [
                17269,
                17297
            ],
            [
                17297,
                17299
            ],
            [
                17299,
                17309
            ],
            [
                17310,
                17322
            ],
            [
                17323,
                17325
            ],
            [
                17330,
                17340
            ],
            [
                17342,
                17366
            ],
            [
                17366,
                17442
            ],
            [
                17442,
                17444
            ],
            [
                17444,
                17571
            ],
            [
                17574,
                17592
            ],
            [
                17592,
                17619
            ],
            [
                17619,
                17632
            ],
            [
                17632,
                17658
            ],
            [
                17661,
                17672
            ],
            [
                17673,
                17689
            ]
        ],
        "row_chars": [
            [
                0,
                57
            ],
            [
                57,
                158
            ],
            [
                158,
                158
            ],
            [
                158,
                222
            ],
            [
                222,
                222
            ],
            [
                222,
                474
            ],
            [
                474,
                575
            ],
            [
                575,
                575
            ],
            [
                575,
                608
            ],
            [
                608,
                781
            ],
            [
                781,
                841
            ],
            [
                841,
                940
            ],
            [
                940,
                940
            ],
            [
                940,
                940
            ],
            [
                940,
                940
            ],
            [
                940,
                940
            ],
            [
                940,
                1108
            ],
            [
                1108,
                1183
            ],
            [
                1183,
                1183
            ],
            [
                1183,
                1237
            ],
            [
                1237,
                1345
            ],
            [
                1345,
                1404
            ],
            [
                1404,
                1404
            ],
            [
                1404,
                1404
            ],
            [
                1404,
                1507
            ],
            [
                1507,
                1560
            ],
            [
                1560,
                1682
            ],
            [
                1682,
                1870
            ],
            [
                1870,
                1870
            ],
            [
                1870,
                1994
            ],
            [
                1994,
                2249
            ],
            [
                2249,
                2357
            ],
            [
                2357,
                2404
            ],
            [
                2404,
                2568
            ],
            [
                2568,
                2759
            ],
            [
                2759,
                2759
            ],
            [
                2759,
                2878
            ],
            [
                2878,
                2923
            ],
            [
                2923,
                3196
            ],
            [
                3196,
                3239
            ],
            [
                3239,
                3386
            ],
            [
                3386,
                3415
            ],
            [
                3415,
                3466
            ],
            [
                3466,
                3548
            ],
            [
                3548,
                3653
            ],
            [
                3653,
                3679
            ],
            [
                3679,
                3728
            ],
            [
                3728,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3768
            ],
            [
                3768,
                3950
            ],
            [
                3950,
                4104
            ],
            [
                4104,
                4104
            ],
            [
                4104,
                4231
            ],
            [
                4231,
                4287
            ],
            [
                4287,
                4384
            ],
            [
                4384,
                4540
            ],
            [
                4540,
                4598
            ],
            [
                4598,
                4646
            ],
            [
                4646,
                4683
            ],
            [
                4683,
                4698
            ],
            [
                4698,
                4709
            ],
            [
                4709,
                4713
            ],
            [
                4713,
                4727
            ],
            [
                4727,
                4731
            ],
            [
                4731,
                4784
            ],
            [
                4784,
                4793
            ],
            [
                4793,
                4860
            ],
            [
                4860,
                4972
            ],
            [
                4972,
                5044
            ],
            [
                5044,
                5061
            ],
            [
                5061,
                5118
            ],
            [
                5118,
                5217
            ],
            [
                5217,
                5302
            ],
            [
                5302,
                5302
            ],
            [
                5302,
                5302
            ],
            [
                5302,
                5302
            ],
            [
                5302,
                5457
            ],
            [
                5457,
                5457
            ],
            [
                5457,
                5532
            ],
            [
                5532,
                5608
            ],
            [
                5608,
                5615
            ],
            [
                5615,
                5638
            ],
            [
                5638,
                5650
            ],
            [
                5650,
                5736
            ],
            [
                5736,
                5861
            ],
            [
                5861,
                5926
            ],
            [
                5926,
                5982
            ],
            [
                5982,
                5982
            ],
            [
                5982,
                6012
            ],
            [
                6012,
                6012
            ],
            [
                6012,
                6096
            ],
            [
                6096,
                6096
            ],
            [
                6096,
                6183
            ],
            [
                6183,
                6212
            ],
            [
                6212,
                6212
            ],
            [
                6212,
                6301
            ],
            [
                6301,
                6365
            ],
            [
                6365,
                6378
            ],
            [
                6378,
                6414
            ],
            [
                6414,
                6421
            ],
            [
                6421,
                6442
            ],
            [
                6442,
                6549
            ],
            [
                6549,
                6573
            ],
            [
                6573,
                6584
            ],
            [
                6584,
                6617
            ],
            [
                6617,
                6691
            ],
            [
                6691,
                6739
            ],
            [
                6739,
                6842
            ],
            [
                6842,
                6878
            ],
            [
                6878,
                6885
            ],
            [
                6885,
                6930
            ],
            [
                6930,
                6944
            ],
            [
                6944,
                6944
            ],
            [
                6944,
                7033
            ],
            [
                7033,
                7121
            ],
            [
                7121,
                7280
            ],
            [
                7280,
                7287
            ],
            [
                7287,
                7352
            ],
            [
                7352,
                7352
            ],
            [
                7352,
                7352
            ],
            [
                7352,
                7466
            ],
            [
                7466,
                7653
            ],
            [
                7653,
                7653
            ],
            [
                7653,
                7731
            ],
            [
                7731,
                7819
            ],
            [
                7819,
                7930
            ],
            [
                7930,
                7992
            ],
            [
                7992,
                8075
            ],
            [
                8075,
                8163
            ],
            [
                8163,
                8230
            ],
            [
                8230,
                8281
            ],
            [
                8281,
                8425
            ],
            [
                8425,
                8425
            ],
            [
                8425,
                8444
            ],
            [
                8444,
                8457
            ],
            [
                8457,
                8479
            ],
            [
                8479,
                8601
            ],
            [
                8601,
                8632
            ],
            [
                8632,
                8684
            ],
            [
                8684,
                8730
            ],
            [
                8730,
                8770
            ],
            [
                8770,
                8783
            ],
            [
                8783,
                8798
            ],
            [
                8798,
                8805
            ],
            [
                8805,
                8963
            ],
            [
                8963,
                8981
            ],
            [
                8981,
                9040
            ],
            [
                9040,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9091
            ],
            [
                9091,
                9200
            ],
            [
                9200,
                9200
            ],
            [
                9200,
                9279
            ],
            [
                9279,
                9296
            ],
            [
                9296,
                9345
            ],
            [
                9345,
                9365
            ],
            [
                9365,
                9409
            ],
            [
                9409,
                9430
            ],
            [
                9430,
                9430
            ],
            [
                9430,
                9562
            ],
            [
                9562,
                9621
            ],
            [
                9621,
                9629
            ],
            [
                9629,
                9692
            ],
            [
                9692,
                9758
            ],
            [
                9758,
                9867
            ],
            [
                9867,
                9867
            ],
            [
                9867,
                9891
            ],
            [
                9891,
                9981
            ],
            [
                9981,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10246
            ],
            [
                10246,
                10302
            ],
            [
                10302,
                10337
            ],
            [
                10337,
                10389
            ],
            [
                10389,
                10447
            ],
            [
                10447,
                10447
            ],
            [
                10447,
                10447
            ],
            [
                10447,
                10479
            ],
            [
                10479,
                10499
            ],
            [
                10499,
                10558
            ],
            [
                10558,
                10581
            ],
            [
                10581,
                10675
            ],
            [
                10675,
                10957
            ],
            [
                10957,
                11006
            ],
            [
                11006,
                11006
            ],
            [
                11006,
                11019
            ],
            [
                11019,
                11076
            ],
            [
                11076,
                11095
            ],
            [
                11095,
                11175
            ],
            [
                11175,
                11435
            ],
            [
                11435,
                11521
            ],
            [
                11521,
                11554
            ],
            [
                11554,
                11554
            ],
            [
                11554,
                11613
            ],
            [
                11613,
                11635
            ],
            [
                11635,
                11675
            ],
            [
                11675,
                11765
            ],
            [
                11765,
                11771
            ],
            [
                11771,
                11807
            ],
            [
                11807,
                11826
            ],
            [
                11826,
                11846
            ],
            [
                11846,
                11889
            ],
            [
                11889,
                11926
            ],
            [
                11926,
                11979
            ],
            [
                11979,
                12018
            ],
            [
                12018,
                12018
            ],
            [
                12018,
                12018
            ],
            [
                12018,
                12056
            ],
            [
                12056,
                12073
            ],
            [
                12073,
                12140
            ],
            [
                12140,
                12190
            ],
            [
                12190,
                12351
            ],
            [
                12351,
                12532
            ],
            [
                12532,
                12658
            ],
            [
                12658,
                12795
            ],
            [
                12795,
                12890
            ],
            [
                12890,
                12898
            ],
            [
                12898,
                12914
            ],
            [
                12914,
                13079
            ],
            [
                13079,
                13153
            ],
            [
                13153,
                13153
            ],
            [
                13153,
                13153
            ],
            [
                13153,
                13291
            ],
            [
                13291,
                13291
            ],
            [
                13291,
                13305
            ],
            [
                13305,
                13321
            ],
            [
                13321,
                13380
            ],
            [
                13380,
                13418
            ],
            [
                13418,
                13434
            ],
            [
                13434,
                13440
            ],
            [
                13440,
                13440
            ],
            [
                13440,
                13440
            ],
            [
                13440,
                13440
            ],
            [
                13440,
                13521
            ],
            [
                13521,
                13537
            ],
            [
                13537,
                13616
            ],
            [
                13616,
                13616
            ],
            [
                13616,
                13616
            ],
            [
                13616,
                13628
            ],
            [
                13628,
                13757
            ],
            [
                13757,
                13775
            ],
            [
                13775,
                13775
            ],
            [
                13775,
                13797
            ],
            [
                13797,
                13828
            ],
            [
                13828,
                13833
            ],
            [
                13833,
                13843
            ],
            [
                13843,
                13924
            ],
            [
                13924,
                13994
            ],
            [
                13994,
                14079
            ],
            [
                14079,
                14116
            ],
            [
                14116,
                14226
            ],
            [
                14226,
                14244
            ],
            [
                14244,
                14270
            ],
            [
                14270,
                14325
            ],
            [
                14325,
                14356
            ],
            [
                14356,
                14371
            ],
            [
                14371,
                14390
            ],
            [
                14390,
                14390
            ],
            [
                14390,
                14418
            ],
            [
                14418,
                14518
            ],
            [
                14518,
                14571
            ],
            [
                14571,
                14624
            ],
            [
                14624,
                14624
            ],
            [
                14624,
                14791
            ],
            [
                14791,
                14979
            ],
            [
                14979,
                15031
            ],
            [
                15031,
                15040
            ],
            [
                15040,
                15083
            ],
            [
                15083,
                15104
            ],
            [
                15104,
                15109
            ],
            [
                15109,
                15160
            ],
            [
                15160,
                15191
            ],
            [
                15191,
                15247
            ],
            [
                15247,
                15349
            ],
            [
                15349,
                15359
            ],
            [
                15359,
                15387
            ],
            [
                15387,
                15411
            ],
            [
                15411,
                15513
            ],
            [
                15513,
                15548
            ],
            [
                15548,
                15578
            ],
            [
                15578,
                15582
            ],
            [
                15582,
                15601
            ],
            [
                15601,
                15605
            ],
            [
                15605,
                15633
            ],
            [
                15633,
                15637
            ],
            [
                15637,
                15675
            ],
            [
                15675,
                15675
            ],
            [
                15675,
                15705
            ],
            [
                15705,
                15740
            ],
            [
                15740,
                15923
            ],
            [
                15923,
                15923
            ],
            [
                15923,
                15923
            ],
            [
                15923,
                15923
            ],
            [
                15923,
                15923
            ],
            [
                15923,
                16024
            ],
            [
                16024,
                16058
            ],
            [
                16058,
                16097
            ],
            [
                16097,
                16206
            ],
            [
                16206,
                16289
            ],
            [
                16289,
                16361
            ],
            [
                16361,
                16446
            ],
            [
                16446,
                16515
            ],
            [
                16515,
                16515
            ],
            [
                16515,
                16560
            ],
            [
                16560,
                16635
            ],
            [
                16635,
                16922
            ],
            [
                16922,
                16956
            ],
            [
                16956,
                17044
            ],
            [
                17044,
                17143
            ],
            [
                17143,
                17444
            ],
            [
                17444,
                17619
            ],
            [
                17619,
                17691
            ]
        ]
    }
}