{
    "original": {
        "text": "It is but a glimpse of the world of fashion that we want on this same miry afternoon. It is not so unlike the Court of Chancery but that we may pass from the one scene to the other, as the crow flies. Both the world of fashion and the Court of Chancery are things of precedent and usage: oversleeping Rip Van Winkles who have played at strange games through a deal of thundery weather; sleeping beauties whom the knight will wake one day, when all the stopped spits in the kitchen shall begin to turn prodigiously!\nIt is not a large world. Relatively even to this world of ours, which has its limits too (as your Highness shall find when you have made the tour of it and are come to the brink of the void beyond), it is a very little speck. There is much good in it; there are many good and true people in it; it has its appointed place. But the evil of it is that it is a world wrapped up in too much jeweller's cotton and fine wool, and cannot hear the rushing of the larger worlds, and cannot see them as they circle round the sun. It is a deadened world, and its growth is sometimes unhealthy for want of air.\nMy Lady Dedlock has returned to her house in town for a few days previous to her departure for Paris, where her ladyship intends to stay some weeks, after which her movements are uncertain. The fashionable intelligence says so for the comfort of the Parisians, and it knows all fashionable things. To know things otherwise were to be unfashionable. My Lady Dedlock has been down at what she calls, in familiar conversation, her \"place\" in Lincolnshire. The waters are out in Lincolnshire. An arch of the bridge in the park has been sapped and sopped away. The adjacent low-lying ground for half a mile in breadth is a stagnant river with melancholy trees for islands in it and a surface punctured all over, all day long, with falling rain. My Lady Dedlock's place has been extremely dreary. The weather for many a day and night has been so wet that the trees seem wet through, and the soft loppings and prunings of the woodman's axe can make no crash or crackle as they fall. The deer, looking soaked, leave quagmires where they pass. The shot of a rifle loses its sharpness in the moist air, and its smoke moves in a tardy little cloud towards the green rise, coppice-topped, that makes a background for the falling rain. The view from my Lady Dedlock's own windows is alternately a lead-coloured view and a view in Indian ink. The vases on the stone terrace in the foreground catch the rain all day; and the heavy drops fall--drip, drip, drip--upon the broad flagged pavement, called from old time the Ghost's Walk, all night. On Sundays the little church in the park is mouldy; the oaken pulpit breaks out into a cold sweat; and there is a general smell and taste as of the ancient Dedlocks in their graves. My Lady Dedlock (who is childless), looking out in the early twilight from her boudoir at a keeper's lodge and seeing the light of a fire upon the latticed panes, and smoke rising from the chimney, and a child, chased by a woman, running out into the rain to meet the shining figure of a wrapped-up man coming through the gate, has been put quite out of temper. My Lady Dedlock says she has been \"bored to death.\"\nTherefore my Lady Dedlock has come away from the place in Lincolnshire and has left it to the rain, and the crows, and the rabbits, and the deer, and the partridges and pheasants. The pictures of the Dedlocks past and gone have seemed to vanish into the damp walls in mere lowness of spirits, as the housekeeper has passed along the old rooms shutting up the shutters. And when they will next come forth again, the fashionable intelligence--which, like the fiend, is omniscient of the past and present, but not the future--cannot yet undertake to say.\nSir Leicester Dedlock is only a baronet, but there is no mightier baronet than he. His family is as old as the hills, and infinitely more respectable. He has a general opinion that the world might get on without hills but would be done up without Dedlocks. He would on the whole admit nature to be a good idea (a little low, perhaps, when not enclosed with a park-fence), but an idea dependent for its execution on your great county families. He is a gentleman of strict conscience, disdainful of all littleness and meanness and ready on the shortest notice to die any death you may please to mention rather than give occasion for the least impeachment of his integrity. He is an honourable, obstinate, truthful, high-spirited, intensely prejudiced, perfectly unreasonable man.\nSir Leicester is twenty years, full measure, older than my Lady. He will never see sixty-five again, nor perhaps sixty-six, nor yet sixty-seven. He has a twist of the gout now and then and walks a little stiffly. He is of a worthy presence, with his light-grey hair and whiskers, his fine shirt-frill, his pure-white waistcoat, and his blue coat with bright buttons always buttoned. He is ceremonious, stately, most polite on every occasion to my Lady, and holds her personal attractions in the highest estimation. His gallantry to my Lady, which has never changed since he courted her, is the one little touch of romantic fancy in him.\nIndeed, he married her for love. A whisper still goes about that she had not even family; howbeit, Sir Leicester had so much family that perhaps he had enough and could dispense with any more. But she had beauty, pride, ambition, insolent resolve, and sense enough to portion out a legion of fine ladies. Wealth and station, added to these, soon floated her upward, and for years now my Lady Dedlock has been at the centre of the fashionable intelligence and at the top of the fashionable tree.\nHow Alexander wept when he had no more worlds to conquer, everybody knows--or has some reason to know by this time, the matter having been rather frequently mentioned. My Lady Dedlock, having conquered HER world, fell not into the melting, but rather into the freezing, mood. An exhausted composure, a worn-out placidity, an equanimity of fatigue not to be ruffled by interest or satisfaction, are the trophies of her victory. She is perfectly well-bred. If she could be translated to heaven to-morrow, she might be expected to ascend without any rapture.\nShe has beauty still, and if it be not in its heyday, it is not yet in its autumn. She has a fine face--originally of a character that would be rather called very pretty than handsome, but improved into classicality by the acquired expression of her fashionable state. Her figure is elegant and has the effect of being tall. Not that she is so, but that \"the most is made,\" as the Honourable Bob Stables has frequently asserted upon oath, \"of all her points.\" The same authority observes that she is perfectly got up and remarks in commendation of her hair especially that she is the best-groomed woman in the whole stud.\nWith all her perfections on her head, my Lady Dedlock has come up from her place in Lincolnshire (hotly pursued by the fashionable intelligence) to pass a few days at her house in town previous to her departure for Paris, where her ladyship intends to stay some weeks, after which her movements are uncertain. And at her house in town, upon this muddy, murky afternoon, presents himself an old-fashioned old gentleman, attorney-at-law and eke solicitor of the High Court of Chancery, who has the honour of acting as legal adviser of the Dedlocks and has as many cast-iron boxes in his office with that name outside as if the present baronet were the coin of the conjuror's trick and were constantly being juggled through the whole set. Across the hall, and up the stairs, and along the passages, and through the rooms, which are very brilliant in the season and very dismal out of it--fairy-land to visit, but a desert to live in--the old gentleman is conducted by a Mercury in powder to my Lady's presence.\nThe old gentleman is rusty to look at, but is reputed to have made good thrift out of aristocratic marriage settlements and aristocratic wills, and to be very rich. He is surrounded by a mysterious halo of family confidences, of which he is known to be the silent depository. There are noble mausoleums rooted for centuries in retired glades of parks among the growing timber and the fern, which perhaps hold fewer noble secrets than walk abroad among men, shut up in the breast of Mr. Tulkinghorn. He is of what is called the old school--a phrase generally meaning any school that seems never to have been young--and wears knee-breeches tied with ribbons, and gaiters or stockings. One peculiarity of his black clothes and of his black stockings, be they silk or worsted, is that they never shine. Mute, close, irresponsive to any glancing light, his dress is like himself. He never converses when not professionally consulted. He is found sometimes, speechless but quite at home, at corners of dinner-tables in great country houses and near doors of drawing-rooms, concerning which the fashionable intelligence is eloquent, where everybody knows him and where half the Peerage stops to say \"How do you do, Mr. Tulkinghorn?\" He receives these salutations with gravity and buries them along with the rest of his knowledge.\nSir Leicester Dedlock is with my Lady and is happy to see Mr. Tulkinghorn. There is an air of prescription about him which is always agreeable to Sir Leicester; he receives it as a kind of tribute. He likes Mr. Tulkinghorn's dress; there is a kind of tribute in that too. It is eminently respectable, and likewise, in a general way, retainer-like. It expresses, as it were, the steward of the legal mysteries, the butler of the legal cellar, of the Dedlocks.\nHas Mr. Tulkinghorn any idea of this himself? It may be so, or it may not, but there is this remarkable circumstance to be noted in everything associated with my Lady Dedlock as one of a class--as one of the leaders and representatives of her little world. She supposes herself to be an inscrutable Being, quite out of the reach and ken of ordinary mortals--seeing herself in her glass, where indeed she looks so. Yet every dim little star revolving about her, from her maid to the manager of the Italian Opera, knows her weaknesses, prejudices, follies, haughtinesses, and caprices and lives upon as accurate a calculation and as nice a measure of her moral nature as her dressmaker takes of her physical proportions. Is a new dress, a new custom, a new singer, a new dancer, a new form of jewellery, a new dwarf or giant, a new chapel, a new anything, to be set up? There are deferential people in a dozen callings whom my Lady Dedlock suspects of nothing but prostration before her, who can tell you how to manage her as if she were a baby, who do nothing but nurse her all their lives, who, humbly affecting to follow with profound subservience, lead her and her whole troop after them; who, in hooking one, hook all and bear them off as Lemuel Gulliver bore away the stately fleet of the majestic Lilliput. \"If you want to address our people, sir,\" say Blaze and Sparkle, the jewellers--meaning by our people Lady Dedlock and the rest--\"you must remember that you are not dealing with the general public; you must hit our people in their weakest place, and their weakest place is such a place.\" \"To make this article go down, gentlemen,\" say Sheen and Gloss, the mercers, to their friends the manufacturers, \"you must come to us, because we know where to have the fashionable people, and we can make it fashionable.\" \"If you want to get this print upon the tables of my high connexion, sir,\" says Mr. Sladdery, the librarian, \"or if you want to get this dwarf or giant into the houses of my high connexion, sir, or if you want to secure to this entertainment the patronage of my high connexion, sir, you must leave it, if you please, to me, for I have been accustomed to study the leaders of my high connexion, sir, and I may tell you without vanity that I can turn them round my finger\"--in which Mr. Sladdery, who is an honest man, does not exaggerate at all.\nTherefore, while Mr. Tulkinghorn may not know what is passing in the Dedlock mind at present, it is very possible that he may.\n\"My Lady's cause has been again before the Chancellor, has it, Mr. Tulkinghorn?\" says Sir Leicester, giving him his hand.\n\"Yes. It has been on again to-day,\" Mr. Tulkinghorn replies, making one of his quiet bows to my Lady, who is on a sofa near the fire, shading her face with a hand-screen.\n\"It would be useless to ask,\" says my Lady with the dreariness of the place in Lincolnshire still upon her, \"whether anything has been done.\"\n\"Nothing that YOU would call anything has been done to-day,\" replies Mr. Tulkinghorn.\n\"Nor ever will be,\" says my Lady.\nSir Leicester has no objection to an interminable Chancery suit. It is a slow, expensive, British, constitutional kind of thing. To be sure, he has not a vital interest in the suit in question, her part in which was the only property my Lady brought him; and he has a shadowy impression that for his name--the name of Dedlock--to be in a cause, and not in the title of that cause, is a most ridiculous accident. But he regards the Court of Chancery, even if it should involve an occasional delay of justice and a trifling amount of confusion, as a something devised in conjunction with a variety of other somethings by the perfection of human wisdom for the eternal settlement (humanly speaking) of everything. And he is upon the whole of a fixed opinion that to give the sanction of his countenance to any complaints respecting it would be to encourage some person in the lower classes to rise up somewhere--like Wat Tyler.\n\"As a few fresh affidavits have been put upon the file,\" says Mr. Tulkinghorn, \"and as they are short, and as I proceed upon the troublesome principle of begging leave to possess my clients with any new proceedings in a cause\"--cautious man Mr. Tulkinghorn, taking no more responsibility than necessary--\"and further, as I see you are going to Paris, I have brought them in my pocket.\"\n(Sir Leicester was going to Paris too, by the by, but the delight of the fashionable intelligence was in his Lady.)\nMr. Tulkinghorn takes out his papers, asks permission to place them on a golden talisman of a table at my Lady's elbow, puts on his spectacles, and begins to read by the light of a shaded lamp.\n\"'In Chancery. Between John Jarndyce--'\"\nMy Lady interrupts, requesting him to miss as many of the formal horrors as he can.\nMr. Tulkinghorn glances over his spectacles and begins again lower down. My Lady carelessly and scornfully abstracts her attention. Sir Leicester in a great chair looks at the file and appears to have a stately liking for the legal repetitions and prolixities as ranging among the national bulwarks. It happens that the fire is hot where my Lady sits and that the hand-screen is more beautiful than useful, being priceless but small. My Lady, changing her position, sees the papers on the table--looks at them nearer--looks at them nearer still--asks impulsively, \"Who copied that?\"\nMr. Tulkinghorn stops short, surprised by my Lady's animation and her unusual tone.\n\"Is it what you people call law-hand?\" she asks, looking full at him in her careless way again and toying with her screen.\n\"Not quite. Probably\"--Mr. Tulkinghorn examines it as he speaks--\"the legal character which it has was acquired after the original hand was formed. Why do you ask?\"\n\"Anything to vary this detestable monotony. Oh, go on, do!\"\nMr. Tulkinghorn reads again. The heat is greater; my Lady screens her face. Sir Leicester dozes, starts up suddenly, and cries, \"Eh? What do you say?\"\n\"I say I am afraid,\" says Mr. Tulkinghorn, who had risen hastily, \"that Lady Dedlock is ill.\"\n\"Faint,\" my Lady murmurs with white lips, \"only that; but it is like the faintness of death. Don't speak to me. Ring, and take me to my room!\"\nMr. Tulkinghorn retires into another chamber; bells ring, feet shuffle and patter, silence ensues. Mercury at last begs Mr. Tulkinghorn to return.\n\"Better now,\" quoth Sir Leicester, motioning the lawyer to sit down and read to him alone. \"I have been quite alarmed. I never knew my Lady swoon before. But the weather is extremely trying, and she really has been bored to death down at our place in Lincolnshire.\"",
        "paragraph_chars": [
            [
                0,
                515
            ],
            [
                515,
                1114
            ],
            [
                1114,
                3239
            ],
            [
                3239,
                3791
            ],
            [
                3791,
                4569
            ],
            [
                4569,
                5206
            ],
            [
                5206,
                5701
            ],
            [
                5701,
                6257
            ],
            [
                6257,
                6879
            ],
            [
                6879,
                7887
            ],
            [
                7887,
                9210
            ],
            [
                9210,
                9669
            ],
            [
                9669,
                12036
            ],
            [
                12036,
                12163
            ],
            [
                12163,
                12285
            ],
            [
                12285,
                12456
            ],
            [
                12456,
                12598
            ],
            [
                12598,
                12684
            ],
            [
                12684,
                12718
            ],
            [
                12718,
                13643
            ],
            [
                13643,
                14029
            ],
            [
                14029,
                14145
            ],
            [
                14145,
                14339
            ],
            [
                14339,
                14380
            ],
            [
                14380,
                14464
            ],
            [
                14464,
                15047
            ],
            [
                15047,
                15131
            ],
            [
                15131,
                15254
            ],
            [
                15254,
                15419
            ],
            [
                15419,
                15479
            ],
            [
                15479,
                15630
            ],
            [
                15630,
                15724
            ],
            [
                15724,
                15867
            ],
            [
                15867,
                16014
            ],
            [
                16014,
                16279
            ]
        ],
        "segment_chars": [
            [
                0,
                86
            ],
            [
                86,
                201
            ],
            [
                201,
                515
            ],
            [
                515,
                540
            ],
            [
                540,
                741
            ],
            [
                741,
                838
            ],
            [
                838,
                1035
            ],
            [
                1035,
                1114
            ],
            [
                1114,
                1304
            ],
            [
                1304,
                1412
            ],
            [
                1412,
                1463
            ],
            [
                1463,
                1567
            ],
            [
                1567,
                1603
            ],
            [
                1603,
                1670
            ],
            [
                1670,
                1854
            ],
            [
                1854,
                1905
            ],
            [
                1905,
                2090
            ],
            [
                2090,
                2149
            ],
            [
                2149,
                2337
            ],
            [
                2337,
                2443
            ],
            [
                2443,
                2643
            ],
            [
                2643,
                2825
            ],
            [
                2825,
                3187
            ],
            [
                3187,
                3239
            ],
            [
                3239,
                3419
            ],
            [
                3419,
                3608
            ],
            [
                3608,
                3791
            ],
            [
                3791,
                3874
            ],
            [
                3874,
                3942
            ],
            [
                3942,
                4048
            ],
            [
                4048,
                4234
            ],
            [
                4234,
                4462
            ],
            [
                4462,
                4569
            ],
            [
                4569,
                4634
            ],
            [
                4634,
                4714
            ],
            [
                4714,
                4782
            ],
            [
                4782,
                4952
            ],
            [
                4952,
                5084
            ],
            [
                5084,
                5206
            ],
            [
                5206,
                5239
            ],
            [
                5239,
                5399
            ],
            [
                5399,
                5511
            ],
            [
                5511,
                5701
            ],
            [
                5701,
                5869
            ],
            [
                5869,
                5977
            ],
            [
                5977,
                6128
            ],
            [
                6128,
                6156
            ],
            [
                6156,
                6257
            ],
            [
                6257,
                6340
            ],
            [
                6340,
                6526
            ],
            [
                6526,
                6582
            ],
            [
                6582,
                6717
            ],
            [
                6717,
                6879
            ],
            [
                6879,
                7189
            ],
            [
                7189,
                7615
            ],
            [
                7615,
                7887
            ],
            [
                7887,
                8052
            ],
            [
                8052,
                8163
            ],
            [
                8163,
                8386
            ],
            [
                8386,
                8570
            ],
            [
                8570,
                8686
            ],
            [
                8686,
                8762
            ],
            [
                8762,
                8816
            ],
            [
                8816,
                9113
            ],
            [
                9113,
                9210
            ],
            [
                9210,
                9285
            ],
            [
                9285,
                9408
            ],
            [
                9408,
                9482
            ],
            [
                9482,
                9558
            ],
            [
                9558,
                9669
            ],
            [
                9669,
                9715
            ],
            [
                9715,
                9926
            ],
            [
                9926,
                10083
            ],
            [
                10083,
                10388
            ],
            [
                10388,
                10537
            ],
            [
                10537,
                10981
            ],
            [
                10981,
                11269
            ],
            [
                11269,
                11491
            ],
            [
                11491,
                12036
            ],
            [
                12036,
                12163
            ],
            [
                12163,
                12244
            ],
            [
                12244,
                12285
            ],
            [
                12285,
                12291
            ],
            [
                12291,
                12456
            ],
            [
                12456,
                12598
            ],
            [
                12598,
                12684
            ],
            [
                12684,
                12718
            ],
            [
                12718,
                12783
            ],
            [
                12783,
                12847
            ],
            [
                12847,
                13130
            ],
            [
                13130,
                13429
            ],
            [
                13429,
                13643
            ],
            [
                13643,
                14029
            ],
            [
                14029,
                14145
            ],
            [
                14145,
                14339
            ],
            [
                14339,
                14354
            ],
            [
                14354,
                14380
            ],
            [
                14380,
                14464
            ],
            [
                14464,
                14537
            ],
            [
                14537,
                14596
            ],
            [
                14596,
                14764
            ],
            [
                14764,
                14898
            ],
            [
                14898,
                15047
            ],
            [
                15047,
                15131
            ],
            [
                15131,
                15170
            ],
            [
                15170,
                15254
            ],
            [
                15254,
                15266
            ],
            [
                15266,
                15402
            ],
            [
                15402,
                15419
            ],
            [
                15419,
                15463
            ],
            [
                15463,
                15479
            ],
            [
                15479,
                15508
            ],
            [
                15508,
                15555
            ],
            [
                15555,
                15612
            ],
            [
                15612,
                15630
            ],
            [
                15630,
                15724
            ],
            [
                15724,
                15817
            ],
            [
                15817,
                15836
            ],
            [
                15836,
                15867
            ],
            [
                15867,
                15966
            ],
            [
                15966,
                16014
            ],
            [
                16014,
                16105
            ],
            [
                16105,
                16133
            ],
            [
                16133,
                16168
            ],
            [
                16168,
                16279
            ]
        ],
        "overlap_chars": [
            [
                49,
                51
            ],
            [
                6,
                26
            ],
            [
                27,
                32
            ],
            [
                57,
                64
            ],
            [
                70,
                86
            ],
            [
                86,
                95
            ],
            [
                99,
                127
            ],
            [
                286,
                287
            ],
            [
                201,
                205
            ],
            [
                253,
                286
            ],
            [
                199,
                200
            ],
            [
                515,
                540
            ],
            [
                767,
                820
            ],
            [
                831,
                838
            ],
            [
                838,
                841
            ],
            [
                865,
                919
            ],
            [
                933,
                1004
            ],
            [
                1033,
                1035
            ],
            [
                1035,
                1062
            ],
            [
                1077,
                1114
            ],
            [
                1114,
                1178
            ],
            [
                1205,
                1221
            ],
            [
                1235,
                1261
            ],
            [
                1302,
                1304
            ],
            [
                1463,
                1510
            ],
            [
                1538,
                1566
            ],
            [
                1578,
                1581
            ],
            [
                1586,
                1603
            ],
            [
                1603,
                1652
            ],
            [
                1664,
                1670
            ],
            [
                1670,
                1673
            ],
            [
                1683,
                1699
            ],
            [
                1730,
                1780
            ],
            [
                1787,
                1854
            ],
            [
                2090,
                2098
            ],
            [
                2116,
                2148
            ],
            [
                2337,
                2368
            ],
            [
                2373,
                2383
            ],
            [
                2398,
                2411
            ],
            [
                2441,
                2443
            ],
            [
                2443,
                2473
            ],
            [
                2492,
                2540
            ],
            [
                2560,
                2574
            ],
            [
                2583,
                2592
            ],
            [
                2614,
                2630
            ],
            [
                2641,
                2643
            ],
            [
                2643,
                2694
            ],
            [
                2746,
                2770
            ],
            [
                2781,
                2825
            ],
            [
                2825,
                2899
            ],
            [
                2915,
                2916
            ],
            [
                2917,
                2931
            ],
            [
                2986,
                2991
            ],
            [
                2936,
                2942
            ],
            [
                3027,
                3034
            ],
            [
                3055,
                3092
            ],
            [
                3113,
                3123
            ],
            [
                3101,
                3112
            ],
            [
                3124,
                3187
            ],
            [
                3187,
                3239
            ],
            [
                3239,
                3337
            ],
            [
                3417,
                3419
            ],
            [
                3419,
                3434
            ],
            [
                3439,
                3492
            ],
            [
                3498,
                3503
            ],
            [
                3532,
                3608
            ],
            [
                3608,
                3665
            ],
            [
                3769,
                3772
            ],
            [
                3786,
                3791
            ],
            [
                3791,
                3835
            ],
            [
                3874,
                3942
            ],
            [
                3942,
                3948
            ],
            [
                3959,
                4021
            ],
            [
                4030,
                4048
            ],
            [
                4234,
                4287
            ],
            [
                4307,
                4315
            ],
            [
                4468,
                4569
            ],
            [
                4569,
                4598
            ],
            [
                4614,
                4634
            ],
            [
                4634,
                4636
            ],
            [
                4712,
                4714
            ],
            [
                4714,
                4720
            ],
            [
                4736,
                4782
            ],
            [
                4952,
                4991
            ],
            [
                5010,
                5071
            ],
            [
                5082,
                5084
            ],
            [
                5084,
                5206
            ],
            [
                5206,
                5239
            ],
            [
                5266,
                5278
            ],
            [
                5288,
                5295
            ],
            [
                5303,
                5353
            ],
            [
                5369,
                5399
            ],
            [
                5399,
                5463
            ],
            [
                5509,
                5511
            ],
            [
                5511,
                5521
            ],
            [
                5529,
                5621
            ],
            [
                5672,
                5701
            ],
            [
                5977,
                6000
            ],
            [
                6023,
                6025
            ],
            [
                6007,
                6008
            ],
            [
                6040,
                6047
            ],
            [
                6095,
                6128
            ],
            [
                6128,
                6156
            ],
            [
                6257,
                6277
            ],
            [
                6348,
                6359
            ],
            [
                6277,
                6278
            ],
            [
                6375,
                6376
            ],
            [
                6460,
                6469
            ],
            [
                6526,
                6547
            ],
            [
                6309,
                6310
            ],
            [
                6279,
                6282
            ],
            [
                6845,
                6853
            ],
            [
                6877,
                6879
            ],
            [
                6917,
                6975
            ],
            [
                7024,
                7063
            ],
            [
                7073,
                7075
            ],
            [
                7094,
                7099
            ],
            [
                7090,
                7093
            ],
            [
                7136,
                7189
            ],
            [
                7189,
                7224
            ],
            [
                7232,
                7248
            ],
            [
                7266,
                7297
            ],
            [
                7322,
                7366
            ],
            [
                7395,
                7424
            ],
            [
                7613,
                7615
            ],
            [
                7615,
                7649
            ],
            [
                7673,
                7762
            ],
            [
                7769,
                7808
            ],
            [
                7810,
                7840
            ],
            [
                7867,
                7887
            ],
            [
                7887,
                7943
            ],
            [
                8038,
                8052
            ],
            [
                8052,
                8111
            ],
            [
                8163,
                8172
            ],
            [
                8302,
                8315
            ],
            [
                8344,
                8386
            ],
            [
                8386,
                8424
            ],
            [
                8426,
                8452
            ],
            [
                8464,
                8499
            ],
            [
                8501,
                8547
            ],
            [
                8559,
                8570
            ],
            [
                8762,
                8770
            ],
            [
                8790,
                8816
            ],
            [
                8816,
                8838
            ],
            [
                8850,
                8871
            ],
            [
                8883,
                8920
            ],
            [
                9011,
                9042
            ],
            [
                9066,
                9113
            ],
            [
                9113,
                9210
            ],
            [
                9210,
                9285
            ],
            [
                9408,
                9434
            ],
            [
                9509,
                9514
            ],
            [
                9523,
                9524
            ],
            [
                9488,
                9509
            ],
            [
                9543,
                9556
            ],
            [
                9570,
                9574
            ],
            [
                9578,
                9582
            ],
            [
                9620,
                9650
            ],
            [
                9652,
                9669
            ],
            [
                9669,
                9715
            ],
            [
                9715,
                9742
            ],
            [
                9744,
                9756
            ],
            [
                9847,
                9850
            ],
            [
                9762,
                9772
            ],
            [
                9831,
                9843
            ],
            [
                9885,
                9888
            ],
            [
                9908,
                9911
            ],
            [
                9856,
                9861
            ],
            [
                9924,
                9926
            ],
            [
                9926,
                9997
            ],
            [
                10006,
                10025
            ],
            [
                10081,
                10083
            ],
            [
                10083,
                10214
            ],
            [
                10239,
                10242
            ],
            [
                10215,
                10222
            ],
            [
                10267,
                10269
            ],
            [
                10335,
                10352
            ],
            [
                10362,
                10374
            ],
            [
                10386,
                10388
            ],
            [
                10537,
                10585
            ],
            [
                10655,
                10685
            ],
            [
                10594,
                10606
            ],
            [
                10690,
                10763
            ],
            [
                10781,
                10858
            ],
            [
                10979,
                10981
            ],
            [
                12036,
                12163
            ],
            [
                12163,
                12244
            ],
            [
                12244,
                12262
            ],
            [
                12283,
                12285
            ],
            [
                12285,
                12291
            ],
            [
                12291,
                12311
            ],
            [
                12318,
                12345
            ],
            [
                12375,
                12435
            ],
            [
                12454,
                12456
            ],
            [
                12456,
                12521
            ],
            [
                12535,
                12598
            ],
            [
                12598,
                12649
            ],
            [
                12656,
                12684
            ],
            [
                12684,
                12718
            ],
            [
                12718,
                12783
            ],
            [
                12783,
                12815
            ],
            [
                12832,
                12847
            ],
            [
                12847,
                12910
            ],
            [
                12971,
                12972
            ],
            [
                12955,
                12959
            ],
            [
                13036,
                13043
            ],
            [
                12916,
                12923
            ],
            [
                12930,
                12951
            ],
            [
                12960,
                12971
            ],
            [
                13128,
                13130
            ],
            [
                13130,
                13193
            ],
            [
                13572,
                13576
            ],
            [
                13231,
                13239
            ],
            [
                13208,
                13213
            ],
            [
                13225,
                13228
            ],
            [
                13250,
                13265
            ],
            [
                13429,
                13432
            ],
            [
                13433,
                13435
            ],
            [
                13641,
                13643
            ],
            [
                13643,
                13729
            ],
            [
                13970,
                14029
            ],
            [
                14161,
                14181
            ],
            [
                14263,
                14307
            ],
            [
                14337,
                14339
            ],
            [
                14339,
                14354
            ],
            [
                14354,
                14375
            ],
            [
                14380,
                14464
            ],
            [
                14464,
                14479
            ],
            [
                14512,
                14524
            ],
            [
                14535,
                14537
            ],
            [
                14898,
                14905
            ],
            [
                14930,
                14958
            ],
            [
                14966,
                14980
            ],
            [
                15010,
                15047
            ],
            [
                15047,
                15085
            ],
            [
                15129,
                15131
            ],
            [
                15131,
                15170
            ],
            [
                15170,
                15199
            ],
            [
                15252,
                15254
            ],
            [
                15254,
                15266
            ],
            [
                15402,
                15419
            ],
            [
                15419,
                15463
            ],
            [
                15463,
                15479
            ],
            [
                15479,
                15508
            ],
            [
                15508,
                15555
            ],
            [
                15555,
                15612
            ],
            [
                15612,
                15630
            ],
            [
                15630,
                15724
            ],
            [
                15724,
                15817
            ],
            [
                15817,
                15836
            ],
            [
                15836,
                15867
            ],
            [
                15867,
                15966
            ],
            [
                15989,
                16002
            ],
            [
                16003,
                16014
            ],
            [
                16014,
                16027
            ],
            [
                16034,
                16081
            ],
            [
                16103,
                16105
            ],
            [
                16105,
                16133
            ],
            [
                16133,
                16168
            ],
            [
                16168,
                16279
            ]
        ],
        "row_chars": [
            [
                0,
                86
            ],
            [
                86,
                515
            ],
            [
                515,
                540
            ],
            [
                540,
                741
            ],
            [
                741,
                838
            ],
            [
                838,
                1035
            ],
            [
                1035,
                1114
            ],
            [
                1114,
                1304
            ],
            [
                1304,
                1412
            ],
            [
                1412,
                1463
            ],
            [
                1463,
                1567
            ],
            [
                1567,
                1603
            ],
            [
                1603,
                1670
            ],
            [
                1670,
                1854
            ],
            [
                1854,
                1905
            ],
            [
                1905,
                2090
            ],
            [
                2090,
                2149
            ],
            [
                2149,
                2337
            ],
            [
                2337,
                2443
            ],
            [
                2443,
                2643
            ],
            [
                2643,
                2825
            ],
            [
                2825,
                3187
            ],
            [
                3187,
                3239
            ],
            [
                3239,
                3419
            ],
            [
                3419,
                3608
            ],
            [
                3608,
                3791
            ],
            [
                3791,
                3942
            ],
            [
                3942,
                4048
            ],
            [
                4048,
                4234
            ],
            [
                4234,
                4569
            ],
            [
                4569,
                4634
            ],
            [
                4634,
                4714
            ],
            [
                4714,
                4782
            ],
            [
                4782,
                4952
            ],
            [
                4952,
                5084
            ],
            [
                5084,
                5206
            ],
            [
                5206,
                5239
            ],
            [
                5239,
                5399
            ],
            [
                5399,
                5511
            ],
            [
                5511,
                5701
            ],
            [
                5701,
                5869
            ],
            [
                5869,
                5977
            ],
            [
                5977,
                6128
            ],
            [
                6128,
                6156
            ],
            [
                6156,
                6257
            ],
            [
                6257,
                6879
            ],
            [
                6879,
                7189
            ],
            [
                7189,
                7615
            ],
            [
                7615,
                7887
            ],
            [
                7887,
                8052
            ],
            [
                8052,
                8386
            ],
            [
                8386,
                8570
            ],
            [
                8570,
                8686
            ],
            [
                8686,
                8762
            ],
            [
                8762,
                8816
            ],
            [
                8816,
                9113
            ],
            [
                9113,
                9210
            ],
            [
                9210,
                9285
            ],
            [
                9285,
                9408
            ],
            [
                9408,
                9669
            ],
            [
                9669,
                9715
            ],
            [
                9715,
                9926
            ],
            [
                9926,
                10083
            ],
            [
                10083,
                10388
            ],
            [
                10388,
                10537
            ],
            [
                10537,
                10981
            ],
            [
                10981,
                11269
            ],
            [
                11269,
                11491
            ],
            [
                11491,
                12036
            ],
            [
                12036,
                12163
            ],
            [
                12163,
                12244
            ],
            [
                12244,
                12285
            ],
            [
                12285,
                12291
            ],
            [
                12291,
                12456
            ],
            [
                12456,
                12598
            ],
            [
                12598,
                12684
            ],
            [
                12684,
                12718
            ],
            [
                12718,
                12783
            ],
            [
                12783,
                12847
            ],
            [
                12847,
                13130
            ],
            [
                13130,
                13643
            ],
            [
                13643,
                14029
            ],
            [
                14029,
                14145
            ],
            [
                14145,
                14339
            ],
            [
                14339,
                14354
            ],
            [
                14354,
                14380
            ],
            [
                14380,
                14464
            ],
            [
                14464,
                14537
            ],
            [
                14537,
                14596
            ],
            [
                14596,
                14764
            ],
            [
                14764,
                14898
            ],
            [
                14898,
                15047
            ],
            [
                15047,
                15131
            ],
            [
                15131,
                15170
            ],
            [
                15170,
                15254
            ],
            [
                15254,
                15266
            ],
            [
                15266,
                15402
            ],
            [
                15402,
                15419
            ],
            [
                15419,
                15463
            ],
            [
                15463,
                15479
            ],
            [
                15479,
                15508
            ],
            [
                15508,
                15555
            ],
            [
                15555,
                15612
            ],
            [
                15612,
                15630
            ],
            [
                15630,
                15724
            ],
            [
                15724,
                15817
            ],
            [
                15817,
                15836
            ],
            [
                15836,
                15867
            ],
            [
                15867,
                15966
            ],
            [
                15966,
                16014
            ],
            [
                16014,
                16105
            ],
            [
                16105,
                16133
            ],
            [
                16133,
                16168
            ],
            [
                16168,
                16279
            ]
        ]
    },
    "abridged": {
        "text": "We need but a glimpse of the fashionable world on this miry afternoon. It is not unlike the Court of Chancery: both are things of precedent and usage.\nIt is not a large world. There are many good and true people in it; it has its place. But it is a world wrapped up in too much jeweller's cotton, and cannot hear the rushing of the larger worlds, and cannot see them. It is a deadened world, and sometimes unhealthy for want of air.\nMy Lady Dedlock has returned to her house in town for a few days before departing for Paris, where she intends to stay some weeks. My Lady Dedlock has been down at what she calls her \"place\" in Lincolnshire.\nThere are floods in Lincolnshire. An arch of the bridge in the park has been sapped away. The low-lying ground has become a stagnant river with melancholy trees for islands and a surface punctured all over, all day long, with falling rain. The deer leave quagmires where they pass.\nThe view from my Lady Dedlock's windows is lead-coloured. The vases on the stone terrace catch the rain all day; and the heavy drops fall upon the broad flag-stoned pavement, known as the Ghost's Walk. On Sundays the little church in the park is mouldy; there is a general smell as of the ancient Dedlocks in their graves. My Lady Dedlock (who is childless), looking out in the early twilight from a game-keeper's lodge, and seeing a child running out into the rain to meet the wrapped-up figure of a man coming through the gate, has been put quite out of temper. My Lady Dedlock says she has been \"bored to death.\"\nTherefore my Lady Dedlock has come away from the place in Lincolnshire and has left it to the rain. The pictures of Dedlocks past and gone have seemed to vanish into the dark walls as the housekeeper has passed along the old rooms shutting up the shutters. And when they will next come forth again, the fashionable world cannot yet say.\nSir Leicester Dedlock is only a baronet, but his family is as old as the hills, and infinitely more respectable. He has the opinion that the world might get on without hills but would be finished without Dedlocks. He is a gentleman of strict conscience, disdainful of meanness: an honourable, obstinate, truthful, high-spirited, intensely prejudiced, perfectly unreasonable man.\nSir Leicester is twenty years older than my Lady. He is nearly seventy. He has gout now and then and walks a little stiffly. He is ceremonious, stately, most polite to my Lady, and holds her personal attractions in the highest esteem. His gallantry to my Lady, which has never changed since he courted her, is the one little touch of romantic fancy in him.\nIndeed, he married her for love. It is said that she had no family; however, Sir Leicester had so much family that perhaps he could dispense with any more. But she had beauty, pride, ambition, insolent resolve, and sense. Wealth and position, added to these, soon floated her upward, and for years now my Lady Dedlock has been at the top of the fashionable tree.\nAn exhausted composure, an even-tempered fatigue are the trophies of her victory. She is perfectly well-bred. She has beauty still: a fine face, with a classical demeanour; her figure is elegant, well-dressed and well-groomed.\nMy Lady Dedlock has come up from her place in Lincolnshire to pass a few days at her house in town before departing to Paris for some weeks, after which her movements are uncertain. And at her house in town, upon this murky afternoon, arrives an old-fashioned old gentleman, solicitor of the High Court of Chancery, who is legal adviser of the Dedlocks. Across the hall, and up the stairs, and through the rooms, which are very brilliant in the season and very dismal out of it - fairy-land to visit, but a desert to live in - the old gentleman is conducted into my Lady's presence.\nThe old gentleman is rusty to look at, but is reputed to be very rich. He is surrounded by a mysterious halo of family confidences; there are many noble secrets shut up in the breast of Mr. Tulkinghorn. He is of what is called the old school - a phrase generally meaning anybody that seems never to have been young - and wears knee-breeches tied with ribbons, and black stockings. He never talks unless professionally consulted. He is found sometimes, silent but quite at home, at dinner-tables in great country houses, where everybody knows him and stops to say \"How do you do, Mr. Tulkinghorn?\" He receives these salutations with gravity and buries them along with the rest of his knowledge.\nSir Leicester Dedlock is with my Lady and is happy to see Mr. Tulkinghorn. He likes Mr. Tulkinghorn's air, and his clothes, which are eminently respectable and retainer-like, as if he were the butler of the legal cellar of the Dedlocks.\nHas Mr. Tulkinghorn any idea of this himself? It may be so, or it may not; but there is one remarkable thing about Lady Dedlock and indeed her whole class. She supposes herself to be an inscrutable Being, quite out of the reach of ordinary mortals. Yet every dim little star revolving about her, from her maid to the manager of the Italian Opera, knows her weaknesses, prejudices, and follies as well as her dressmaker knows her physical measurements. There are deferential people in a dozen callings who can tell you how to manage Lady Dedlock as if she were a baby, who do nothing but nurse her all their lives, who, pretending to follow with profound subservience, lead her and her whole troop after them. Therefore, while Mr. Tulkinghorn may not know what is passing in the Dedlock mind at present, it is very possible that he may.\n\"My Lady's cause has been again before the Chancellor, has it, Mr. Tulkinghorn?\" says Sir Leicester.\n\"Yes. It has been on again today,\" Mr. Tulkinghorn replies, bowing to my Lady, who is on a sofa near the fire, shading her face.\n\"It would be useless to ask,\" says my Lady with the dreariness of Lincolnshire still upon her, \"whether anything has been done.\"\n\"Nothing that you would call anything has been done today,\" replies Mr. Tulkinghorn.\n\"Nor ever will be,\" says my Lady.\nSir Leicester has no objection to an interminable Chancery suit. It is a slow, expensive, British kind of thing. To be sure, he has not a vital interest in the suit in question; Lady Dedlock's part in it was the only property she brought him on marriage. But he regards the Court of Chancery, even if it should involve some trifling delay and confusion, as a wise and good institution, about which he should not complain.\n\"As a few fresh affidavits have been put upon the file,\" says Mr. Tulkinghorn, \"and as you are going to Paris, I have brought them in my pocket.\"\nHe takes out his papers, puts on his spectacles, and begins to read.\n\"'In Chancery. Between John Jarndyce-'\"\nMy Lady interrupts, requesting him to miss as many of the formal horrors as he can.\nMr. Tulkinghorn begins again. My Lady sees the papers on the table - looks at them nearer - and asks impulsively, \"Who copied that?\"\nMr. Tulkinghorn stops short, surprised.\n\"Is it what you people call law-hand?\" she asks, looking full at him.\n\"Not quite. Why do you ask?\"\n\"Anything to vary this detestable monotony. Oh, go on, do!\"\nMr. Tulkinghorn reads again. The heat is greater; my Lady screens her face. Sir Leicester dozes, starts up suddenly, and cries, \"Eh? What do you say?\"\n\"I say I am afraid,\" says Mr. Tulkinghorn, who had risen hastily, \"that Lady Dedlock is ill.\"\n\"Faint,\" my Lady murmurs with white lips, \"only that; but it is like the faintness of death. Don't speak to me. Ring, and take me to my room!\"\nMr. Tulkinghorn retires into another chamber; bells ring, feet shuffle and patter, silence ensues. Mr. Tulkinghorn is summoned to return.\n\"Better now,\" says Sir Leicester, motioning the lawyer to sit down. \"I have been quite alarmed. I never knew my Lady swoon before. But the weather is extremely trying, and she really has been bored to death down at our place in Lincolnshire.\"",
        "paragraph_chars": [
            [
                0,
                151
            ],
            [
                151,
                433
            ],
            [
                433,
                641
            ],
            [
                641,
                923
            ],
            [
                923,
                1539
            ],
            [
                1539,
                1876
            ],
            [
                1876,
                2255
            ],
            [
                2255,
                2612
            ],
            [
                2612,
                2975
            ],
            [
                2975,
                3202
            ],
            [
                3202,
                3785
            ],
            [
                3785,
                4479
            ],
            [
                4479,
                4716
            ],
            [
                4716,
                5552
            ],
            [
                5552,
                5653
            ],
            [
                5653,
                5782
            ],
            [
                5782,
                5911
            ],
            [
                5911,
                5996
            ],
            [
                5996,
                6030
            ],
            [
                6030,
                6452
            ],
            [
                6452,
                6598
            ],
            [
                6598,
                6667
            ],
            [
                6667,
                6707
            ],
            [
                6707,
                6791
            ],
            [
                6791,
                6924
            ],
            [
                6924,
                6964
            ],
            [
                6964,
                7034
            ],
            [
                7034,
                7063
            ],
            [
                7063,
                7123
            ],
            [
                7123,
                7274
            ],
            [
                7274,
                7368
            ],
            [
                7368,
                7511
            ],
            [
                7511,
                7649
            ],
            [
                7649,
                7891
            ]
        ],
        "segment_chars": [
            [
                0,
                71
            ],
            [
                71,
                151
            ],
            [
                151,
                176
            ],
            [
                176,
                237
            ],
            [
                237,
                368
            ],
            [
                368,
                433
            ],
            [
                433,
                564
            ],
            [
                564,
                641
            ],
            [
                641,
                675
            ],
            [
                675,
                731
            ],
            [
                731,
                881
            ],
            [
                881,
                923
            ],
            [
                923,
                981
            ],
            [
                981,
                1125
            ],
            [
                1125,
                1246
            ],
            [
                1246,
                1487
            ],
            [
                1487,
                1539
            ],
            [
                1539,
                1639
            ],
            [
                1639,
                1796
            ],
            [
                1796,
                1876
            ],
            [
                1876,
                1989
            ],
            [
                1989,
                2090
            ],
            [
                2090,
                2255
            ],
            [
                2255,
                2305
            ],
            [
                2305,
                2327
            ],
            [
                2327,
                2380
            ],
            [
                2380,
                2490
            ],
            [
                2490,
                2612
            ],
            [
                2612,
                2645
            ],
            [
                2645,
                2768
            ],
            [
                2768,
                2834
            ],
            [
                2834,
                2975
            ],
            [
                2975,
                3057
            ],
            [
                3057,
                3085
            ],
            [
                3085,
                3202
            ],
            [
                3202,
                3384
            ],
            [
                3384,
                3556
            ],
            [
                3556,
                3785
            ],
            [
                3785,
                3856
            ],
            [
                3856,
                3988
            ],
            [
                3988,
                4166
            ],
            [
                4166,
                4214
            ],
            [
                4214,
                4382
            ],
            [
                4382,
                4479
            ],
            [
                4479,
                4554
            ],
            [
                4554,
                4716
            ],
            [
                4716,
                4762
            ],
            [
                4762,
                4872
            ],
            [
                4872,
                4965
            ],
            [
                4965,
                5168
            ],
            [
                5168,
                5425
            ],
            [
                5425,
                5552
            ],
            [
                5552,
                5633
            ],
            [
                5633,
                5653
            ],
            [
                5653,
                5659
            ],
            [
                5659,
                5782
            ],
            [
                5782,
                5911
            ],
            [
                5911,
                5996
            ],
            [
                5996,
                6030
            ],
            [
                6030,
                6095
            ],
            [
                6095,
                6143
            ],
            [
                6143,
                6285
            ],
            [
                6285,
                6452
            ],
            [
                6452,
                6598
            ],
            [
                6598,
                6667
            ],
            [
                6667,
                6682
            ],
            [
                6682,
                6707
            ],
            [
                6707,
                6791
            ],
            [
                6791,
                6821
            ],
            [
                6821,
                6924
            ],
            [
                6924,
                6964
            ],
            [
                6964,
                7003
            ],
            [
                7003,
                7034
            ],
            [
                7034,
                7046
            ],
            [
                7046,
                7063
            ],
            [
                7063,
                7107
            ],
            [
                7107,
                7123
            ],
            [
                7123,
                7152
            ],
            [
                7152,
                7199
            ],
            [
                7199,
                7256
            ],
            [
                7256,
                7274
            ],
            [
                7274,
                7368
            ],
            [
                7368,
                7461
            ],
            [
                7461,
                7480
            ],
            [
                7480,
                7511
            ],
            [
                7511,
                7610
            ],
            [
                7610,
                7649
            ],
            [
                7649,
                7717
            ],
            [
                7717,
                7745
            ],
            [
                7745,
                7780
            ],
            [
                7780,
                7891
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                8,
                28
            ],
            [
                41,
                46
            ],
            [
                47,
                54
            ],
            [
                55,
                71
            ],
            [
                71,
                80
            ],
            [
                81,
                109
            ],
            [
                109,
                110
            ],
            [
                111,
                115
            ],
            [
                116,
                149
            ],
            [
                149,
                150
            ],
            [
                151,
                176
            ],
            [
                176,
                229
            ],
            [
                230,
                237
            ],
            [
                237,
                240
            ],
            [
                241,
                295
            ],
            [
                295,
                366
            ],
            [
                366,
                368
            ],
            [
                368,
                395
            ],
            [
                396,
                433
            ],
            [
                433,
                497
            ],
            [
                515,
                531
            ],
            [
                536,
                562
            ],
            [
                562,
                564
            ],
            [
                564,
                611
            ],
            [
                612,
                640
            ],
            [
                647,
                650
            ],
            [
                658,
                675
            ],
            [
                675,
                724
            ],
            [
                725,
                731
            ],
            [
                731,
                734
            ],
            [
                735,
                751
            ],
            [
                763,
                813
            ],
            [
                814,
                881
            ],
            [
                881,
                889
            ],
            [
                890,
                922
            ],
            [
                923,
                954
            ],
            [
                955,
                965
            ],
            [
                966,
                979
            ],
            [
                979,
                981
            ],
            [
                981,
                1011
            ],
            [
                1012,
                1060
            ],
            [
                1061,
                1075
            ],
            [
                1088,
                1097
            ],
            [
                1107,
                1123
            ],
            [
                1123,
                1125
            ],
            [
                1125,
                1176
            ],
            [
                1177,
                1201
            ],
            [
                1202,
                1246
            ],
            [
                1246,
                1320
            ],
            [
                1321,
                1322
            ],
            [
                1328,
                1342
            ],
            [
                1342,
                1347
            ],
            [
                1348,
                1354
            ],
            [
                1355,
                1362
            ],
            [
                1363,
                1400
            ],
            [
                1401,
                1411
            ],
            [
                1412,
                1423
            ],
            [
                1424,
                1487
            ],
            [
                1487,
                1539
            ],
            [
                1539,
                1637
            ],
            [
                1637,
                1639
            ],
            [
                1639,
                1654
            ],
            [
                1655,
                1708
            ],
            [
                1714,
                1719
            ],
            [
                1720,
                1796
            ],
            [
                1796,
                1853
            ],
            [
                1867,
                1870
            ],
            [
                1871,
                1876
            ],
            [
                1876,
                1920
            ],
            [
                1921,
                1989
            ],
            [
                1989,
                1995
            ],
            [
                2000,
                2062
            ],
            [
                2072,
                2090
            ],
            [
                2090,
                2143
            ],
            [
                2144,
                2152
            ],
            [
                2154,
                2255
            ],
            [
                2255,
                2284
            ],
            [
                2285,
                2305
            ],
            [
                2305,
                2307
            ],
            [
                2325,
                2327
            ],
            [
                2327,
                2333
            ],
            [
                2334,
                2380
            ],
            [
                2380,
                2419
            ],
            [
                2420,
                2481
            ],
            [
                2488,
                2490
            ],
            [
                2490,
                2612
            ],
            [
                2612,
                2645
            ],
            [
                2656,
                2668
            ],
            [
                2672,
                2679
            ],
            [
                2687,
                2737
            ],
            [
                2738,
                2768
            ],
            [
                2768,
                2832
            ],
            [
                2832,
                2834
            ],
            [
                2834,
                2844
            ],
            [
                2853,
                2945
            ],
            [
                2946,
                2975
            ],
            [
                2975,
                2998
            ],
            [
                2999,
                3001
            ],
            [
                3006,
                3007
            ],
            [
                3016,
                3023
            ],
            [
                3024,
                3057
            ],
            [
                3057,
                3085
            ],
            [
                3085,
                3105
            ],
            [
                3107,
                3118
            ],
            [
                3118,
                3119
            ],
            [
                3125,
                3126
            ],
            [
                3127,
                3136
            ],
            [
                3148,
                3169
            ],
            [
                3169,
                3170
            ],
            [
                3184,
                3187
            ],
            [
                3192,
                3200
            ],
            [
                3200,
                3202
            ],
            [
                3202,
                3260
            ],
            [
                3261,
                3300
            ],
            [
                3318,
                3320
            ],
            [
                3321,
                3326
            ],
            [
                3327,
                3330
            ],
            [
                3331,
                3384
            ],
            [
                3384,
                3419
            ],
            [
                3420,
                3436
            ],
            [
                3445,
                3476
            ],
            [
                3477,
                3521
            ],
            [
                3525,
                3554
            ],
            [
                3554,
                3556
            ],
            [
                3556,
                3590
            ],
            [
                3590,
                3679
            ],
            [
                3687,
                3726
            ],
            [
                3729,
                3759
            ],
            [
                3765,
                3785
            ],
            [
                3785,
                3841
            ],
            [
                3842,
                3856
            ],
            [
                3856,
                3915
            ],
            [
                3917,
                3926
            ],
            [
                3932,
                3945
            ],
            [
                3946,
                3988
            ],
            [
                3988,
                4026
            ],
            [
                4029,
                4055
            ],
            [
                4064,
                4099
            ],
            [
                4102,
                4148
            ],
            [
                4155,
                4166
            ],
            [
                4166,
                4174
            ],
            [
                4188,
                4214
            ],
            [
                4214,
                4236
            ],
            [
                4244,
                4265
            ],
            [
                4266,
                4303
            ],
            [
                4303,
                4334
            ],
            [
                4335,
                4382
            ],
            [
                4382,
                4479
            ],
            [
                4479,
                4554
            ],
            [
                4554,
                4580
            ],
            [
                4584,
                4589
            ],
            [
                4601,
                4602
            ],
            [
                4613,
                4634
            ],
            [
                4639,
                4652
            ],
            [
                4652,
                4656
            ],
            [
                4663,
                4667
            ],
            [
                4668,
                4698
            ],
            [
                4699,
                4716
            ],
            [
                4716,
                4762
            ],
            [
                4762,
                4789
            ],
            [
                4791,
                4803
            ],
            [
                4804,
                4807
            ],
            [
                4808,
                4818
            ],
            [
                4831,
                4843
            ],
            [
                4844,
                4847
            ],
            [
                4855,
                4858
            ],
            [
                4865,
                4870
            ],
            [
                4870,
                4872
            ],
            [
                4872,
                4943
            ],
            [
                4944,
                4963
            ],
            [
                4963,
                4965
            ],
            [
                4965,
                5096
            ],
            [
                5097,
                5100
            ],
            [
                5101,
                5108
            ],
            [
                5109,
                5111
            ],
            [
                5117,
                5134
            ],
            [
                5141,
                5153
            ],
            [
                5166,
                5168
            ],
            [
                5168,
                5216
            ],
            [
                5217,
                5247
            ],
            [
                5248,
                5260
            ],
            [
                5261,
                5334
            ],
            [
                5346,
                5423
            ],
            [
                5423,
                5425
            ],
            [
                5425,
                5552
            ],
            [
                5552,
                5633
            ],
            [
                5633,
                5651
            ],
            [
                5651,
                5653
            ],
            [
                5653,
                5659
            ],
            [
                5659,
                5679
            ],
            [
                5685,
                5712
            ],
            [
                5720,
                5780
            ],
            [
                5780,
                5782
            ],
            [
                5782,
                5847
            ],
            [
                5848,
                5911
            ],
            [
                5911,
                5962
            ],
            [
                5968,
                5996
            ],
            [
                5996,
                6030
            ],
            [
                6030,
                6095
            ],
            [
                6095,
                6127
            ],
            [
                6128,
                6143
            ],
            [
                6143,
                6206
            ],
            [
                6206,
                6207
            ],
            [
                6208,
                6212
            ],
            [
                6213,
                6220
            ],
            [
                6223,
                6230
            ],
            [
                6234,
                6255
            ],
            [
                6260,
                6271
            ],
            [
                6283,
                6285
            ],
            [
                6285,
                6348
            ],
            [
                6349,
                6353
            ],
            [
                6354,
                6362
            ],
            [
                6363,
                6368
            ],
            [
                6369,
                6372
            ],
            [
                6373,
                6388
            ],
            [
                6394,
                6397
            ],
            [
                6428,
                6430
            ],
            [
                6450,
                6452
            ],
            [
                6452,
                6538
            ],
            [
                6539,
                6598
            ],
            [
                6601,
                6621
            ],
            [
                6621,
                6665
            ],
            [
                6665,
                6667
            ],
            [
                6667,
                6682
            ],
            [
                6682,
                6703
            ],
            [
                6707,
                6791
            ],
            [
                6791,
                6806
            ],
            [
                6807,
                6819
            ],
            [
                6819,
                6821
            ],
            [
                6821,
                6828
            ],
            [
                6829,
                6857
            ],
            [
                6866,
                6880
            ],
            [
                6887,
                6924
            ],
            [
                6924,
                6962
            ],
            [
                6962,
                6964
            ],
            [
                6964,
                7003
            ],
            [
                7003,
                7032
            ],
            [
                7032,
                7034
            ],
            [
                7034,
                7046
            ],
            [
                7046,
                7063
            ],
            [
                7063,
                7107
            ],
            [
                7107,
                7123
            ],
            [
                7123,
                7152
            ],
            [
                7152,
                7199
            ],
            [
                7199,
                7256
            ],
            [
                7256,
                7274
            ],
            [
                7274,
                7368
            ],
            [
                7368,
                7461
            ],
            [
                7461,
                7480
            ],
            [
                7480,
                7511
            ],
            [
                7511,
                7610
            ],
            [
                7612,
                7625
            ],
            [
                7638,
                7649
            ],
            [
                7649,
                7662
            ],
            [
                7668,
                7715
            ],
            [
                7715,
                7717
            ],
            [
                7717,
                7745
            ],
            [
                7745,
                7780
            ],
            [
                7780,
                7891
            ]
        ],
        "row_chars": [
            [
                0,
                71
            ],
            [
                71,
                151
            ],
            [
                151,
                176
            ],
            [
                176,
                176
            ],
            [
                176,
                237
            ],
            [
                237,
                368
            ],
            [
                368,
                433
            ],
            [
                433,
                564
            ],
            [
                564,
                564
            ],
            [
                564,
                564
            ],
            [
                564,
                641
            ],
            [
                641,
                675
            ],
            [
                675,
                731
            ],
            [
                731,
                881
            ],
            [
                881,
                881
            ],
            [
                881,
                881
            ],
            [
                881,
                923
            ],
            [
                923,
                923
            ],
            [
                923,
                981
            ],
            [
                981,
                1125
            ],
            [
                1125,
                1246
            ],
            [
                1246,
                1487
            ],
            [
                1487,
                1539
            ],
            [
                1539,
                1639
            ],
            [
                1639,
                1796
            ],
            [
                1796,
                1876
            ],
            [
                1876,
                1989
            ],
            [
                1989,
                2090
            ],
            [
                2090,
                2090
            ],
            [
                2090,
                2255
            ],
            [
                2255,
                2305
            ],
            [
                2305,
                2327
            ],
            [
                2327,
                2380
            ],
            [
                2380,
                2380
            ],
            [
                2380,
                2490
            ],
            [
                2490,
                2612
            ],
            [
                2612,
                2645
            ],
            [
                2645,
                2768
            ],
            [
                2768,
                2834
            ],
            [
                2834,
                2975
            ],
            [
                2975,
                2975
            ],
            [
                2975,
                2975
            ],
            [
                2975,
                3057
            ],
            [
                3057,
                3085
            ],
            [
                3085,
                3085
            ],
            [
                3085,
                3202
            ],
            [
                3202,
                3384
            ],
            [
                3384,
                3556
            ],
            [
                3556,
                3785
            ],
            [
                3785,
                3856
            ],
            [
                3856,
                3988
            ],
            [
                3988,
                4166
            ],
            [
                4166,
                4166
            ],
            [
                4166,
                4166
            ],
            [
                4166,
                4214
            ],
            [
                4214,
                4382
            ],
            [
                4382,
                4479
            ],
            [
                4479,
                4554
            ],
            [
                4554,
                4554
            ],
            [
                4554,
                4716
            ],
            [
                4716,
                4762
            ],
            [
                4762,
                4872
            ],
            [
                4872,
                4965
            ],
            [
                4965,
                5168
            ],
            [
                5168,
                5168
            ],
            [
                5168,
                5425
            ],
            [
                5425,
                5425
            ],
            [
                5425,
                5425
            ],
            [
                5425,
                5425
            ],
            [
                5425,
                5552
            ],
            [
                5552,
                5633
            ],
            [
                5633,
                5653
            ],
            [
                5653,
                5659
            ],
            [
                5659,
                5782
            ],
            [
                5782,
                5911
            ],
            [
                5911,
                5996
            ],
            [
                5996,
                6030
            ],
            [
                6030,
                6095
            ],
            [
                6095,
                6143
            ],
            [
                6143,
                6285
            ],
            [
                6285,
                6452
            ],
            [
                6452,
                6598
            ],
            [
                6598,
                6598
            ],
            [
                6598,
                6667
            ],
            [
                6667,
                6682
            ],
            [
                6682,
                6707
            ],
            [
                6707,
                6791
            ],
            [
                6791,
                6821
            ],
            [
                6821,
                6821
            ],
            [
                6821,
                6821
            ],
            [
                6821,
                6821
            ],
            [
                6821,
                6924
            ],
            [
                6924,
                6964
            ],
            [
                6964,
                7003
            ],
            [
                7003,
                7034
            ],
            [
                7034,
                7046
            ],
            [
                7046,
                7046
            ],
            [
                7046,
                7063
            ],
            [
                7063,
                7107
            ],
            [
                7107,
                7123
            ],
            [
                7123,
                7152
            ],
            [
                7152,
                7199
            ],
            [
                7199,
                7256
            ],
            [
                7256,
                7274
            ],
            [
                7274,
                7368
            ],
            [
                7368,
                7461
            ],
            [
                7461,
                7480
            ],
            [
                7480,
                7511
            ],
            [
                7511,
                7610
            ],
            [
                7610,
                7649
            ],
            [
                7649,
                7717
            ],
            [
                7717,
                7745
            ],
            [
                7745,
                7780
            ],
            [
                7780,
                7891
            ]
        ]
    }
}