{
    "original": {
        "text": "Allegory looks pretty cool in Lincoln's Inn Fields, though the evening is hot, for both Mr. Tulkinghorn's windows are wide open, and the room is lofty, gusty, and gloomy. These may not be desirable characteristics when November comes with fog and sleet or January with ice and snow, but they have their merits in the sultry long vacation weather. They enable Allegory, though it has cheeks like peaches, and knees like bunches of blossoms, and rosy swellings for calves to its legs and muscles to its arms, to look tolerably cool to-night.\nPlenty of dust comes in at Mr. Tulkinghorn's windows, and plenty more has generated among his furniture and papers. It lies thick everywhere. When a breeze from the country that has lost its way takes fright and makes a blind hurry to rush out again, it flings as much dust in the eyes of Allegory as the law--or Mr. Tulkinghorn, one of its trustiest representatives--may scatter, on occasion, in the eyes of the laity.\nIn his lowering magazine of dust, the universal article into which his papers and himself, and all his clients, and all things of earth, animate and inanimate, are resolving, Mr. Tulkinghorn sits at one of the open windows enjoying a bottle of old port. Though a hard-grained man, close, dry, and silent, he can enjoy old wine with the best. He has a priceless bin of port in some artful cellar under the Fields, which is one of his many secrets. When he dines alone in chambers, as he has dined to-day, and has his bit of fish and his steak or chicken brought in from the coffee-house, he descends with a candle to the echoing regions below the deserted mansion, and heralded by a remote reverberation of thundering doors, comes gravely back encircled by an earthy atmosphere and carrying a bottle from which he pours a radiant nectar, two score and ten years old, that blushes in the glass to find itself so famous and fills the whole room with the fragrance of southern grapes.\nMr. Tulkinghorn, sitting in the twilight by the open window, enjoys his wine. As if it whispered to him of its fifty years of silence and seclusion, it shuts him up the closer. More impenetrable than ever, he sits, and drinks, and mellows as it were in secrecy, pondering at that twilight hour on all the mysteries he knows, associated with darkening woods in the country, and vast blank shut-up houses in town, and perhaps sparing a thought or two for himself, and his family history, and his money, and his will--all a mystery to every one--and that one bachelor friend of his, a man of the same mould and a lawyer too, who lived the same kind of life until he was seventy-five years old, and then suddenly conceiving (as it is supposed) an impression that it was too monotonous, gave his gold watch to his hair-dresser one summer evening and walked leisurely home to the Temple and hanged himself.\nBut Mr. Tulkinghorn is not alone to-night to ponder at his usual length. Seated at the same table, though with his chair modestly and uncomfortably drawn a little way from it, sits a bald, mild, shining man who coughs respectfully behind his hand when the lawyer bids him fill his glass.\n\"Now, Snagsby,\" says Mr. Tulkinghorn, \"to go over this odd story again.\"\n\"If you please, sir.\"\n\"You told me when you were so good as to step round here last night--\"\n\"For which I must ask you to excuse me if it was a liberty, sir; but I remember that you had taken a sort of an interest in that person, and I thought it possible that you might--just--wish--to--\"\nMr. Tulkinghorn is not the man to help him to any conclusion or to admit anything as to any possibility concerning himself. So Mr. Snagsby trails off into saying, with an awkward cough, \"I must ask you to excuse the liberty, sir, I am sure.\"\n\"Not at all,\" says Mr. Tulkinghorn. \"You told me, Snagsby, that you put on your hat and came round without mentioning your intention to your wife. That was prudent I think, because it's not a matter of such importance that it requires to be mentioned.\"\n\"Well, sir,\" returns Mr. Snagsby, \"you see, my little woman is--not to put too fine a point upon it--inquisitive. She's inquisitive. Poor little thing, she's liable to spasms, and it's good for her to have her mind employed. In consequence of which she employs it--I should say upon every individual thing she can lay hold of, whether it concerns her or not--especially not. My little woman has a very active mind, sir.\"\nMr. Snagsby drinks and murmurs with an admiring cough behind his hand, \"Dear me, very fine wine indeed!\"\n\"Therefore you kept your visit to yourself last night?\" says Mr. Tulkinghorn. \"And to-night too?\"\n\"Yes, sir, and to-night, too. My little woman is at present in--not to put too fine a point on it--in a pious state, or in what she considers such, and attends the Evening Exertions (which is the name they go by) of a reverend party of the name of Chadband. He has a great deal of eloquence at his command, undoubtedly, but I am not quite favourable to his style myself. That's neither here nor there. My little woman being engaged in that way made it easier for me to step round in a quiet manner.\"\nMr. Tulkinghorn assents. \"Fill your glass, Snagsby.\"\n\"Thank you, sir, I am sure,\" returns the stationer with his cough of deference. \"This is wonderfully fine wine, sir!\"\n\"It is a rare wine now,\" says Mr. Tulkinghorn. \"It is fifty years old.\"\n\"Is it indeed, sir? But I am not surprised to hear it, I am sure. It might be--any age almost.\" After rendering this general tribute to the port, Mr. Snagsby in his modesty coughs an apology behind his hand for drinking anything so precious.\n\"Will you run over, once again, what the boy said?\" asks Mr. Tulkinghorn, putting his hands into the pockets of his rusty smallclothes and leaning quietly back in his chair.\n\"With pleasure, sir.\"\nThen, with fidelity, though with some prolixity, the law-stationer repeats Jo's statement made to the assembled guests at his house. On coming to the end of his narrative, he gives a great start and breaks off with, \"Dear me, sir, I wasn't aware there was any other gentleman present!\"\nMr. Snagsby is dismayed to see, standing with an attentive face between himself and the lawyer at a little distance from the table, a person with a hat and stick in his hand who was not there when he himself came in and has not since entered by the door or by either of the windows. There is a press in the room, but its hinges have not creaked, nor has a step been audible upon the floor. Yet this third person stands there with his attentive face, and his hat and stick in his hands, and his hands behind him, a composed and quiet listener. He is a stoutly built, steady-looking, sharp-eyed man in black, of about the middle-age. Except that he looks at Mr. Snagsby as if he were going to take his portrait, there is nothing remarkable about him at first sight but his ghostly manner of appearing.\n\"Don't mind this gentleman,\" says Mr. Tulkinghorn in his quiet way. \"This is only Mr. Bucket.\"\n\"Oh, indeed, sir?\" returns the stationer, expressing by a cough that he is quite in the dark as to who Mr. Bucket may be.\n\"I wanted him to hear this story,\" says the lawyer, \"because I have half a mind (for a reason) to know more of it, and he is very intelligent in such things. What do you say to this, Bucket?\"\n\"It's very plain, sir. Since our people have moved this boy on, and he's not to be found on his old lay, if Mr. Snagsby don't object to go down with me to Tom-all-Alone's and point him out, we can have him here in less than a couple of hours' time. I can do it without Mr. Snagsby, of course, but this is the shortest way.\"\n\"Mr. Bucket is a detective officer, Snagsby,\" says the lawyer in explanation.\n\"Is he indeed, sir?\" says Mr. Snagsby with a strong tendency in his clump of hair to stand on end.\n\"And if you have no real objection to accompany Mr. Bucket to the place in question,\" pursues the lawyer, \"I shall feel obliged to you if you will do so.\"\nIn a moment's hesitation on the part of Mr. Snagsby, Bucket dips down to the bottom of his mind.\n\"Don't you be afraid of hurting the boy,\" he says. \"You won't do that. It's all right as far as the boy's concerned. We shall only bring him here to ask him a question or so I want to put to him, and he'll be paid for his trouble and sent away again. It'll be a good job for him. I promise you, as a man, that you shall see the boy sent away all right. Don't you be afraid of hurting him; you an't going to do that.\"\n\"Very well, Mr. Tulkinghorn!\" cries Mr. Snagsby cheerfully. And reassured, \"Since that's the case--\"\n\"Yes! And lookee here, Mr. Snagsby,\" resumes Bucket, taking him aside by the arm, tapping him familiarly on the breast, and speaking in a confidential tone. \"You're a man of the world, you know, and a man of business, and a man of sense. That's what YOU are.\"\n\"I am sure I am much obliged to you for your good opinion,\" returns the stationer with his cough of modesty, \"but--\"\n\"That's what YOU are, you know,\" says Bucket. \"Now, it an't necessary to say to a man like you, engaged in your business, which is a business of trust and requires a person to be wide awake and have his senses about him and his head screwed on tight (I had an uncle in your business once)--it an't necessary to say to a man like you that it's the best and wisest way to keep little matters like this quiet. Don't you see? Quiet!\"\n\"Certainly, certainly,\" returns the other.\n\"I don't mind telling YOU,\" says Bucket with an engaging appearance of frankness, \"that as far as I can understand it, there seems to be a doubt whether this dead person wasn't entitled to a little property, and whether this female hasn't been up to some games respecting that property, don't you see?\"\n\"Oh!\" says Mr. Snagsby, but not appearing to see quite distinctly.\n\"Now, what YOU want,\" pursues Bucket, again tapping Mr. Snagsby on the breast in a comfortable and soothing manner, \"is that every person should have their rights according to justice. That's what YOU want.\"\n\"To be sure,\" returns Mr. Snagsby with a nod.\n\"On account of which, and at the same time to oblige a--do you call it, in your business, customer or client? I forget how my uncle used to call it.\"\n\"Why, I generally say customer myself,\" replies Mr. Snagsby.\n\"You're right!\" returns Mr. Bucket, shaking hands with him quite affectionately. \"--On account of which, and at the same time to oblige a real good customer, you mean to go down with me, in confidence, to Tom-all-Alone's and to keep the whole thing quiet ever afterwards and never mention it to any one. That's about your intentions, if I understand you?\"\n\"You are right, sir. You are right,\" says Mr. Snagsby.\n\"Then here's your hat,\" returns his new friend, quite as intimate with it as if he had made it; \"and if you're ready, I am.\"\nThey leave Mr. Tulkinghorn, without a ruffle on the surface of his unfathomable depths, drinking his old wine, and go down into the streets.\n\"You don't happen to know a very good sort of person of the name of Gridley, do you?\" says Bucket in friendly converse as they descend the stairs.\n\"No,\" says Mr. Snagsby, considering, \"I don't know anybody of that name. Why?\"\n\"Nothing particular,\" says Bucket; \"only having allowed his temper to get a little the better of him and having been threatening some respectable people, he is keeping out of the way of a warrant I have got against him--which it's a pity that a man of sense should do.\"\nAs they walk along, Mr. Snagsby observes, as a novelty, that however quick their pace may be, his companion still seems in some undefinable manner to lurk and lounge; also, that whenever he is going to turn to the right or left, he pretends to have a fixed purpose in his mind of going straight ahead, and wheels off, sharply, at the very last moment. Now and then, when they pass a police-constable on his beat, Mr. Snagsby notices that both the constable and his guide fall into a deep abstraction as they come towards each other, and appear entirely to overlook each other, and to gaze into space. In a few instances, Mr. Bucket, coming behind some under-sized young man with a shining hat on, and his sleek hair twisted into one flat curl on each side of his head, almost without glancing at him touches him with his stick, upon which the young man, looking round, instantly evaporates. For the most part Mr. Bucket notices things in general, with a face as unchanging as the great mourning ring on his little finger or the brooch, composed of not much diamond and a good deal of setting, which he wears in his shirt.\nWhen they come at last to Tom-all-Alone's, Mr. Bucket stops for a moment at the corner and takes a lighted bull's-eye from the constable on duty there, who then accompanies him with his own particular bull's-eye at his waist. Between his two conductors, Mr. Snagsby passes along the middle of a villainous street, undrained, unventilated, deep in black mud and corrupt water--though the roads are dry elsewhere--and reeking with such smells and sights that he, who has lived in London all his life, can scarce believe his senses. Branching from this street and its heaps of ruins are other streets and courts so infamous that Mr. Snagsby sickens in body and mind and feels as if he were going every moment deeper down into the infernal gulf.\n\"Draw off a bit here, Mr. Snagsby,\" says Bucket as a kind of shabby palanquin is borne towards them, surrounded by a noisy crowd. \"Here's the fever coming up the street!\"\nAs the unseen wretch goes by, the crowd, leaving that object of attraction, hovers round the three visitors like a dream of horrible faces and fades away up alleys and into ruins and behind walls, and with occasional cries and shrill whistles of warning, thenceforth flits about them until they leave the place.\n\"Are those the fever-houses, Darby?\" Mr. Bucket coolly asks as he turns his bull's-eye on a line of stinking ruins.\nDarby replies that \"all them are,\" and further that in all, for months and months, the people \"have been down by dozens\" and have been carried out dead and dying \"like sheep with the rot.\" Bucket observing to Mr. Snagsby as they go on again that he looks a little poorly, Mr. Snagsby answers that he feels as if he couldn't breathe the dreadful air.\nThere is inquiry made at various houses for a boy named Jo. As few people are known in Tom-all-Alone's by any Christian sign, there is much reference to Mr. Snagsby whether he means Carrots, or the Colonel, or Gallows, or Young Chisel, or Terrier Tip, or Lanky, or the Brick. Mr. Snagsby describes over and over again. There are conflicting opinions respecting the original of his picture. Some think it must be Carrots, some say the Brick. The Colonel is produced, but is not at all near the thing. Whenever Mr. Snagsby and his conductors are stationary, the crowd flows round, and from its squalid depths obsequious advice heaves up to Mr. Bucket. Whenever they move, and the angry bull's-eyes glare, it fades away and flits about them up the alleys, and in the ruins, and behind the walls, as before.\nAt last there is a lair found out where Toughy, or the Tough Subject, lays him down at night; and it is thought that the Tough Subject may be Jo. Comparison of notes between Mr. Snagsby and the proprietress of the house--a drunken face tied up in a black bundle, and flaring out of a heap of rags on the floor of a dog-hutch which is her private apartment--leads to the establishment of this conclusion. Toughy has gone to the doctor's to get a bottle of stuff for a sick woman but will be here anon.\n\"And who have we got here to-night?\" says Mr. Bucket, opening another door and glaring in with his bull's-eye. \"Two drunken men, eh? And two women? The men are sound enough,\" turning back each sleeper's arm from his face to look at him. \"Are these your good men, my dears?\"\n\"Yes, sir,\" returns one of the women. \"They are our husbands.\"\n\"Brickmakers, eh?\"\n\"Yes, sir.\"\n\"What are you doing here? You don't belong to London.\"\n\"No, sir. We belong to Hertfordshire.\"\n\"Whereabouts in Hertfordshire?\"\n\"Saint Albans.\"\n\"Come up on the tramp?\"\n\"We walked up yesterday. There's no work down with us at present, but we have done no good by coming here, and shall do none, I expect.\"\n\"That's not the way to do much good,\" says Mr. Bucket, turning his head in the direction of the unconscious figures on the ground.\n\"It an't indeed,\" replies the woman with a sigh. \"Jenny and me knows it full well.\"\nThe room, though two or three feet higher than the door, is so low that the head of the tallest of the visitors would touch the blackened ceiling if he stood upright. It is offensive to every sense; even the gross candle burns pale and sickly in the polluted air. There are a couple of benches and a higher bench by way of table. The men lie asleep where they stumbled down, but the women sit by the candle. Lying in the arms of the woman who has spoken is a very young child.\n\"Why, what age do you call that little creature?\" says Bucket. \"It looks as if it was born yesterday.\" He is not at all rough about it; and as he turns his light gently on the infant, Mr. Snagsby is strangely reminded of another infant, encircled with light, that he has seen in pictures.\n\"He is not three weeks old yet, sir,\" says the woman.\n\"Is he your child?\"\n\"Mine.\"\nThe other woman, who was bending over it when they came in, stoops down again and kisses it as it lies asleep.\n\"You seem as fond of it as if you were the mother yourself,\" says Mr. Bucket.\n\"I was the mother of one like it, master, and it died.\"\n\"Ah, Jenny, Jenny!\" says the other woman to her. \"Better so. Much better to think of dead than alive, Jenny! Much better!\"\n\"Why, you an't such an unnatural woman, I hope,\" returns Bucket sternly, \"as to wish your own child dead?\"\n\"God knows you are right, master,\" she returns. \"I am not. I'd stand between it and death with my own life if I could, as true as any pretty lady.\"\n\"Then don't talk in that wrong manner,\" says Mr. Bucket, mollified again. \"Why do you do it?\"\n\"It's brought into my head, master,\" returns the woman, her eyes filling with tears, \"when I look down at the child lying so. If it was never to wake no more, you'd think me mad, I should take on so. I know that very well. I was with Jenny when she lost hers--warn't I, Jenny?--and I know how she grieved. But look around you at this place. Look at them,\" glancing at the sleepers on the ground. \"Look at the boy you're waiting for, who's gone out to do me a good turn. Think of the children that your business lays with often and often, and that YOU see grow up!\"\n\"Well, well,\" says Mr. Bucket, \"you train him respectable, and he'll be a comfort to you, and look after you in your old age, you know.\"\n\"I mean to try hard,\" she answers, wiping her eyes. \"But I have been a-thinking, being over-tired to-night and not well with the ague, of all the many things that'll come in his way. My master will be against it, and he'll be beat, and see me beat, and made to fear his home, and perhaps to stray wild. If I work for him ever so much, and ever so hard, there's no one to help me; and if he should be turned bad 'spite of all I could do, and the time should come when I should sit by him in his sleep, made hard and changed, an't it likely I should think of him as he lies in my lap now and wish he had died as Jenny's child died!\"\n\"There, there!\" says Jenny. \"Liz, you're tired and ill. Let me take him.\"\nIn doing so, she displaces the mother's dress, but quickly readjusts it over the wounded and bruised bosom where the baby has been lying.\n\"It's my dead child,\" says Jenny, walking up and down as she nurses, \"that makes me love this child so dear, and it's my dead child that makes her love it so dear too, as even to think of its being taken away from her now. While she thinks that, I think what fortune would I give to have my darling back. But we mean the same thing, if we knew how to say it, us two mothers does in our poor hearts!\"\nAs Mr. Snagsby blows his nose and coughs his cough of sympathy, a step is heard without. Mr. Bucket throws his light into the doorway and says to Mr. Snagsby, \"Now, what do you say to Toughy? Will HE do?\"\n\"That's Jo,\" says Mr. Snagsby.\nJo stands amazed in the disk of light, like a ragged figure in a magic-lantern, trembling to think that he has offended against the law in not having moved on far enough. Mr. Snagsby, however, giving him the consolatory assurance, \"It's only a job you will be paid for, Jo,\" he recovers; and on being taken outside by Mr. Bucket for a little private confabulation, tells his tale satisfactorily, though out of breath.\n\"I have squared it with the lad,\" says Mr. Bucket, returning, \"and it's all right. Now, Mr. Snagsby, we're ready for you.\"\nFirst, Jo has to complete his errand of good nature by handing over the physic he has been to get, which he delivers with the laconic verbal direction that \"it's to be all took d'rectly.\" Secondly, Mr. Snagsby has to lay upon the table half a crown, his usual panacea for an immense variety of afflictions. Thirdly, Mr. Bucket has to take Jo by the arm a little above the elbow and walk him on before him, without which observance neither the Tough Subject nor any other Subject could be professionally conducted to Lincoln's Inn Fields. These arrangements completed, they give the women good night and come out once more into black and foul Tom-all-Alone's.\nBy the noisome ways through which they descended into that pit, they gradually emerge from it, the crowd flitting, and whistling, and skulking about them until they come to the verge, where restoration of the bull's-eyes is made to Darby. Here the crowd, like a concourse of imprisoned demons, turns back, yelling, and is seen no more. Through the clearer and fresher streets, never so clear and fresh to Mr. Snagsby's mind as now, they walk and ride until they come to Mr. Tulkinghorn's gate.\nAs they ascend the dim stairs (Mr. Tulkinghorn's chambers being on the first floor), Mr. Bucket mentions that he has the key of the outer door in his pocket and that there is no need to ring. For a man so expert in most things of that kind, Bucket takes time to open the door and makes some noise too. It may be that he sounds a note of preparation.\nHowbeit, they come at last into the hall, where a lamp is burning, and so into Mr. Tulkinghorn's usual room--the room where he drank his old wine to-night. He is not there, but his two old-fashioned candlesticks are, and the room is tolerably light.\nMr. Bucket, still having his professional hold of Jo and appearing to Mr. Snagsby to possess an unlimited number of eyes, makes a little way into this room, when Jo starts and stops.\n\"What's the matter?\" says Bucket in a whisper.\n\"There she is!\" cries Jo.\n\"Who!\"\n\"The lady!\"\nA female figure, closely veiled, stands in the middle of the room, where the light falls upon it. It is quite still and silent. The front of the figure is towards them, but it takes no notice of their entrance and remains like a statue.\n\"Now, tell me,\" says Bucket aloud, \"how you know that to be the lady.\"\n\"I know the wale,\" replies Jo, staring, \"and the bonnet, and the gownd.\"\n\"Be quite sure of what you say, Tough,\" returns Bucket, narrowly observant of him. \"Look again.\"\n\"I am a-looking as hard as ever I can look,\" says Jo with starting eyes, \"and that there's the wale, the bonnet, and the gownd.\"\n\"What about those rings you told me of?\" asks Bucket.\n\"A-sparkling all over here,\" says Jo, rubbing the fingers of his left hand on the knuckles of his right without taking his eyes from the figure.\nThe figure removes the right-hand glove and shows the hand.\n\"Now, what do you say to that?\" asks Bucket.\nJo shakes his head. \"Not rings a bit like them. Not a hand like that.\"\n\"What are you talking of?\" says Bucket, evidently pleased though, and well pleased too.\n\"Hand was a deal whiter, a deal delicater, and a deal smaller,\" returns Jo.\n\"Why, you'll tell me I'm my own mother next,\" says Mr. Bucket. \"Do you recollect the lady's voice?\"\n\"I think I does,\" says Jo.\nThe figure speaks. \"Was it at all like this? I will speak as long as you like if you are not sure. Was it this voice, or at all like this voice?\"\nJo looks aghast at Mr. Bucket. \"Not a bit!\"\n\"Then, what,\" retorts that worthy, pointing to the figure, \"did you say it was the lady for?\"\n\"Cos,\" says Jo with a perplexed stare but without being at all shaken in his certainty, \"cos that there's the wale, the bonnet, and the gownd. It is her and it an't her. It an't her hand, nor yet her rings, nor yet her woice. But that there's the wale, the bonnet, and the gownd, and they're wore the same way wot she wore 'em, and it's her height wot she wos, and she giv me a sov'ring and hooked it.\"\n\"Well!\" says Mr. Bucket slightly, \"we haven't got much good out of YOU. But, however, here's five shillings for you. Take care how you spend it, and don't get yourself into trouble.\" Bucket stealthily tells the coins from one hand into the other like counters--which is a way he has, his principal use of them being in these games of skill--and then puts them, in a little pile, into the boy's hand and takes him out to the door, leaving Mr. Snagsby, not by any means comfortable under these mysterious circumstances, alone with the veiled figure. But on Mr. Tulkinghorn's coming into the room, the veil is raised and a sufficiently good-looking Frenchwoman is revealed, though her expression is something of the intensest.\n\"Thank you, Mademoiselle Hortense,\" says Mr. Tulkinghorn with his usual equanimity. \"I will give you no further trouble about this little wager.\"\n\"You will do me the kindness to remember, sir, that I am not at present placed?\" says mademoiselle.\n\"Certainly, certainly!\"\n\"And to confer upon me the favour of your distinguished recommendation?\"\n\"By all means, Mademoiselle Hortense.\"\n\"A word from Mr. Tulkinghorn is so powerful.\"\n\"It shall not be wanting, mademoiselle.\"\n\"Receive the assurance of my devoted gratitude, dear sir.\"\n\"Good night.\"\nMademoiselle goes out with an air of native gentility; and Mr. Bucket, to whom it is, on an emergency, as natural to be groom of the ceremonies as it is to be anything else, shows her downstairs, not without gallantry.\n\"Well, Bucket?\" quoth Mr. Tulkinghorn on his return.\n\"It's all squared, you see, as I squared it myself, sir. There an't a doubt that it was the other one with this one's dress on. The boy was exact respecting colours and everything. Mr. Snagsby, I promised you as a man that he should be sent away all right. Don't say it wasn't done!\"\n\"You have kept your word, sir,\" returns the stationer; \"and if I can be of no further use, Mr. Tulkinghorn, I think, as my little woman will be getting anxious--\"\n\"Thank you, Snagsby, no further use,\" says Mr. Tulkinghorn. \"I am quite indebted to you for the trouble you have taken already.\"\n\"Not at all, sir. I wish you good night.\"\n\"You see, Mr. Snagsby,\" says Mr. Bucket, accompanying him to the door and shaking hands with him over and over again, \"what I like in you is that you're a man it's of no use pumping; that's what YOU are. When you know you have done a right thing, you put it away, and it's done with and gone, and there's an end of it. That's what YOU do.\"\n\"That is certainly what I endeavour to do, sir,\" returns Mr. Snagsby.\n\"No, you don't do yourself justice. It an't what you endeavour to do,\" says Mr. Bucket, shaking hands with him and blessing him in the tenderest manner, \"it's what you DO. That's what I estimate in a man in your way of business.\"\nMr. Snagsby makes a suitable response and goes homeward so confused by the events of the evening that he is doubtful of his being awake and out--doubtful of the reality of the streets through which he goes--doubtful of the reality of the moon that shines above him. He is presently reassured on these subjects by the unchallengeable reality of Mrs. Snagsby, sitting up with her head in a perfect beehive of curl-papers and night-cap, who has dispatched Guster to the police-station with official intelligence of her husband's being made away with, and who within the last two hours has passed through every stage of swooning with the greatest decorum. But as the little woman feelingly says, many thanks she gets for it!",
        "paragraph_chars": [
            [
                0,
                540
            ],
            [
                540,
                960
            ],
            [
                960,
                1941
            ],
            [
                1941,
                2842
            ],
            [
                2842,
                3130
            ],
            [
                3130,
                3203
            ],
            [
                3203,
                3225
            ],
            [
                3225,
                3296
            ],
            [
                3296,
                3493
            ],
            [
                3493,
                3735
            ],
            [
                3735,
                3988
            ],
            [
                3988,
                4409
            ],
            [
                4409,
                4514
            ],
            [
                4514,
                4612
            ],
            [
                4612,
                5112
            ],
            [
                5112,
                5165
            ],
            [
                5165,
                5283
            ],
            [
                5283,
                5355
            ],
            [
                5355,
                5597
            ],
            [
                5597,
                5771
            ],
            [
                5771,
                5793
            ],
            [
                5793,
                6079
            ],
            [
                6079,
                6879
            ],
            [
                6879,
                6974
            ],
            [
                6974,
                7096
            ],
            [
                7096,
                7288
            ],
            [
                7288,
                7612
            ],
            [
                7612,
                7690
            ],
            [
                7690,
                7789
            ],
            [
                7789,
                7944
            ],
            [
                7944,
                8041
            ],
            [
                8041,
                8458
            ],
            [
                8458,
                8559
            ],
            [
                8559,
                8819
            ],
            [
                8819,
                8936
            ],
            [
                8936,
                9366
            ],
            [
                9366,
                9409
            ],
            [
                9409,
                9712
            ],
            [
                9712,
                9779
            ],
            [
                9779,
                9987
            ],
            [
                9987,
                10033
            ],
            [
                10033,
                10183
            ],
            [
                10183,
                10244
            ],
            [
                10244,
                10600
            ],
            [
                10600,
                10655
            ],
            [
                10655,
                10780
            ],
            [
                10780,
                10921
            ],
            [
                10921,
                11068
            ],
            [
                11068,
                11147
            ],
            [
                11147,
                11417
            ],
            [
                11417,
                12539
            ],
            [
                12539,
                13281
            ],
            [
                13281,
                13452
            ],
            [
                13452,
                13764
            ],
            [
                13764,
                13880
            ],
            [
                13880,
                14230
            ],
            [
                14230,
                15034
            ],
            [
                15034,
                15535
            ],
            [
                15535,
                15809
            ],
            [
                15809,
                15872
            ],
            [
                15872,
                15891
            ],
            [
                15891,
                15903
            ],
            [
                15903,
                15958
            ],
            [
                15958,
                15997
            ],
            [
                15997,
                16029
            ],
            [
                16029,
                16045
            ],
            [
                16045,
                16069
            ],
            [
                16069,
                16206
            ],
            [
                16206,
                16337
            ],
            [
                16337,
                16421
            ],
            [
                16421,
                16898
            ],
            [
                16898,
                17187
            ],
            [
                17187,
                17241
            ],
            [
                17241,
                17261
            ],
            [
                17261,
                17269
            ],
            [
                17269,
                17380
            ],
            [
                17380,
                17458
            ],
            [
                17458,
                17514
            ],
            [
                17514,
                17637
            ],
            [
                17637,
                17744
            ],
            [
                17744,
                17892
            ],
            [
                17892,
                17986
            ],
            [
                17986,
                18551
            ],
            [
                18551,
                18688
            ],
            [
                18688,
                19319
            ],
            [
                19319,
                19393
            ],
            [
                19393,
                19531
            ],
            [
                19531,
                19931
            ],
            [
                19931,
                20136
            ],
            [
                20136,
                20167
            ],
            [
                20167,
                20585
            ],
            [
                20585,
                20708
            ],
            [
                20708,
                21367
            ],
            [
                21367,
                21861
            ],
            [
                21861,
                22211
            ],
            [
                22211,
                22461
            ],
            [
                22461,
                22644
            ],
            [
                22644,
                22691
            ],
            [
                22691,
                22717
            ],
            [
                22717,
                22724
            ],
            [
                22724,
                22736
            ],
            [
                22736,
                22973
            ],
            [
                22973,
                23044
            ],
            [
                23044,
                23117
            ],
            [
                23117,
                23214
            ],
            [
                23214,
                23343
            ],
            [
                23343,
                23397
            ],
            [
                23397,
                23542
            ],
            [
                23542,
                23602
            ],
            [
                23602,
                23647
            ],
            [
                23647,
                23718
            ],
            [
                23718,
                23806
            ],
            [
                23806,
                23882
            ],
            [
                23882,
                23982
            ],
            [
                23982,
                24009
            ],
            [
                24009,
                24155
            ],
            [
                24155,
                24199
            ],
            [
                24199,
                24293
            ],
            [
                24293,
                24696
            ],
            [
                24696,
                25420
            ],
            [
                25420,
                25566
            ],
            [
                25566,
                25666
            ],
            [
                25666,
                25690
            ],
            [
                25690,
                25763
            ],
            [
                25763,
                25802
            ],
            [
                25802,
                25848
            ],
            [
                25848,
                25889
            ],
            [
                25889,
                25948
            ],
            [
                25948,
                25962
            ],
            [
                25962,
                26181
            ],
            [
                26181,
                26234
            ],
            [
                26234,
                26518
            ],
            [
                26518,
                26681
            ],
            [
                26681,
                26810
            ],
            [
                26810,
                26852
            ],
            [
                26852,
                27192
            ],
            [
                27192,
                27262
            ],
            [
                27262,
                27492
            ],
            [
                27492,
                28212
            ]
        ],
        "segment_chars": [
            [
                0,
                171
            ],
            [
                171,
                347
            ],
            [
                347,
                540
            ],
            [
                540,
                656
            ],
            [
                656,
                682
            ],
            [
                682,
                960
            ],
            [
                960,
                1214
            ],
            [
                1214,
                1302
            ],
            [
                1302,
                1407
            ],
            [
                1407,
                1941
            ],
            [
                1941,
                2019
            ],
            [
                2019,
                2118
            ],
            [
                2118,
                2842
            ],
            [
                2842,
                2915
            ],
            [
                2915,
                3130
            ],
            [
                3130,
                3203
            ],
            [
                3203,
                3225
            ],
            [
                3225,
                3296
            ],
            [
                3296,
                3493
            ],
            [
                3493,
                3617
            ],
            [
                3617,
                3735
            ],
            [
                3735,
                3771
            ],
            [
                3771,
                3882
            ],
            [
                3882,
                3988
            ],
            [
                3988,
                4102
            ],
            [
                4102,
                4121
            ],
            [
                4121,
                4213
            ],
            [
                4213,
                4363
            ],
            [
                4363,
                4409
            ],
            [
                4409,
                4514
            ],
            [
                4514,
                4570
            ],
            [
                4570,
                4592
            ],
            [
                4592,
                4612
            ],
            [
                4612,
                4642
            ],
            [
                4642,
                4870
            ],
            [
                4870,
                4983
            ],
            [
                4983,
                5014
            ],
            [
                5014,
                5112
            ],
            [
                5112,
                5137
            ],
            [
                5137,
                5165
            ],
            [
                5165,
                5245
            ],
            [
                5245,
                5283
            ],
            [
                5283,
                5330
            ],
            [
                5330,
                5355
            ],
            [
                5355,
                5375
            ],
            [
                5375,
                5421
            ],
            [
                5421,
                5451
            ],
            [
                5451,
                5597
            ],
            [
                5597,
                5649
            ],
            [
                5649,
                5771
            ],
            [
                5771,
                5793
            ],
            [
                5793,
                5926
            ],
            [
                5926,
                6079
            ],
            [
                6079,
                6362
            ],
            [
                6362,
                6469
            ],
            [
                6469,
                6622
            ],
            [
                6622,
                6711
            ],
            [
                6711,
                6879
            ],
            [
                6879,
                6947
            ],
            [
                6947,
                6974
            ],
            [
                6974,
                6993
            ],
            [
                6993,
                7096
            ],
            [
                7096,
                7254
            ],
            [
                7254,
                7288
            ],
            [
                7288,
                7311
            ],
            [
                7311,
                7537
            ],
            [
                7537,
                7612
            ],
            [
                7612,
                7690
            ],
            [
                7690,
                7711
            ],
            [
                7711,
                7789
            ],
            [
                7789,
                7944
            ],
            [
                7944,
                8041
            ],
            [
                8041,
                8092
            ],
            [
                8092,
                8112
            ],
            [
                8112,
                8158
            ],
            [
                8158,
                8292
            ],
            [
                8292,
                8321
            ],
            [
                8321,
                8394
            ],
            [
                8394,
                8458
            ],
            [
                8458,
                8488
            ],
            [
                8488,
                8518
            ],
            [
                8518,
                8559
            ],
            [
                8559,
                8565
            ],
            [
                8565,
                8716
            ],
            [
                8716,
                8797
            ],
            [
                8797,
                8819
            ],
            [
                8819,
                8936
            ],
            [
                8936,
                8982
            ],
            [
                8982,
                9343
            ],
            [
                9343,
                9358
            ],
            [
                9358,
                9366
            ],
            [
                9366,
                9409
            ],
            [
                9409,
                9712
            ],
            [
                9712,
                9718
            ],
            [
                9718,
                9779
            ],
            [
                9779,
                9964
            ],
            [
                9964,
                9987
            ],
            [
                9987,
                10033
            ],
            [
                10033,
                10143
            ],
            [
                10143,
                10183
            ],
            [
                10183,
                10244
            ],
            [
                10244,
                10260
            ],
            [
                10260,
                10326
            ],
            [
                10326,
                10548
            ],
            [
                10548,
                10600
            ],
            [
                10600,
                10621
            ],
            [
                10621,
                10655
            ],
            [
                10655,
                10780
            ],
            [
                10780,
                10921
            ],
            [
                10921,
                11007
            ],
            [
                11007,
                11068
            ],
            [
                11068,
                11141
            ],
            [
                11141,
                11147
            ],
            [
                11147,
                11417
            ],
            [
                11417,
                11769
            ],
            [
                11769,
                12018
            ],
            [
                12018,
                12308
            ],
            [
                12308,
                12539
            ],
            [
                12539,
                12765
            ],
            [
                12765,
                13069
            ],
            [
                13069,
                13281
            ],
            [
                13281,
                13411
            ],
            [
                13411,
                13452
            ],
            [
                13452,
                13764
            ],
            [
                13764,
                13801
            ],
            [
                13801,
                13880
            ],
            [
                13880,
                14069
            ],
            [
                14069,
                14230
            ],
            [
                14230,
                14290
            ],
            [
                14290,
                14506
            ],
            [
                14506,
                14549
            ],
            [
                14549,
                14620
            ],
            [
                14620,
                14671
            ],
            [
                14671,
                14730
            ],
            [
                14730,
                14880
            ],
            [
                14880,
                15034
            ],
            [
                15034,
                15180
            ],
            [
                15180,
                15438
            ],
            [
                15438,
                15535
            ],
            [
                15535,
                15572
            ],
            [
                15572,
                15646
            ],
            [
                15646,
                15668
            ],
            [
                15668,
                15683
            ],
            [
                15683,
                15772
            ],
            [
                15772,
                15809
            ],
            [
                15809,
                15847
            ],
            [
                15847,
                15872
            ],
            [
                15872,
                15891
            ],
            [
                15891,
                15903
            ],
            [
                15903,
                15929
            ],
            [
                15929,
                15958
            ],
            [
                15958,
                15968
            ],
            [
                15968,
                15997
            ],
            [
                15997,
                16029
            ],
            [
                16029,
                16045
            ],
            [
                16045,
                16069
            ],
            [
                16069,
                16094
            ],
            [
                16094,
                16206
            ],
            [
                16206,
                16337
            ],
            [
                16337,
                16386
            ],
            [
                16386,
                16421
            ],
            [
                16421,
                16588
            ],
            [
                16588,
                16685
            ],
            [
                16685,
                16751
            ],
            [
                16751,
                16829
            ],
            [
                16829,
                16898
            ],
            [
                16898,
                16948
            ],
            [
                16948,
                16961
            ],
            [
                16961,
                17001
            ],
            [
                17001,
                17187
            ],
            [
                17187,
                17241
            ],
            [
                17241,
                17261
            ],
            [
                17261,
                17269
            ],
            [
                17269,
                17380
            ],
            [
                17380,
                17458
            ],
            [
                17458,
                17514
            ],
            [
                17514,
                17534
            ],
            [
                17534,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                17623
            ],
            [
                17623,
                17637
            ],
            [
                17637,
                17744
            ],
            [
                17744,
                17792
            ],
            [
                17792,
                17803
            ],
            [
                17803,
                17892
            ],
            [
                17892,
                17966
            ],
            [
                17966,
                17986
            ],
            [
                17986,
                18112
            ],
            [
                18112,
                18186
            ],
            [
                18186,
                18209
            ],
            [
                18209,
                18292
            ],
            [
                18292,
                18327
            ],
            [
                18327,
                18382
            ],
            [
                18382,
                18456
            ],
            [
                18456,
                18551
            ],
            [
                18551,
                18688
            ],
            [
                18688,
                18740
            ],
            [
                18740,
                18871
            ],
            [
                18871,
                18991
            ],
            [
                18991,
                19319
            ],
            [
                19319,
                19335
            ],
            [
                19335,
                19347
            ],
            [
                19347,
                19393
            ],
            [
                19393,
                19531
            ],
            [
                19531,
                19754
            ],
            [
                19754,
                19836
            ],
            [
                19836,
                19931
            ],
            [
                19931,
                20020
            ],
            [
                20020,
                20123
            ],
            [
                20123,
                20136
            ],
            [
                20136,
                20167
            ],
            [
                20167,
                20338
            ],
            [
                20338,
                20585
            ],
            [
                20585,
                20668
            ],
            [
                20668,
                20708
            ],
            [
                20708,
                20896
            ],
            [
                20896,
                21015
            ],
            [
                21015,
                21246
            ],
            [
                21246,
                21367
            ],
            [
                21367,
                21606
            ],
            [
                21606,
                21703
            ],
            [
                21703,
                21861
            ],
            [
                21861,
                22053
            ],
            [
                22053,
                22163
            ],
            [
                22163,
                22211
            ],
            [
                22211,
                22367
            ],
            [
                22367,
                22461
            ],
            [
                22461,
                22644
            ],
            [
                22644,
                22665
            ],
            [
                22665,
                22691
            ],
            [
                22691,
                22707
            ],
            [
                22707,
                22717
            ],
            [
                22717,
                22724
            ],
            [
                22724,
                22736
            ],
            [
                22736,
                22834
            ],
            [
                22834,
                22864
            ],
            [
                22864,
                22973
            ],
            [
                22973,
                23044
            ],
            [
                23044,
                23117
            ],
            [
                23117,
                23200
            ],
            [
                23200,
                23214
            ],
            [
                23214,
                23343
            ],
            [
                23343,
                23384
            ],
            [
                23384,
                23397
            ],
            [
                23397,
                23542
            ],
            [
                23542,
                23602
            ],
            [
                23602,
                23634
            ],
            [
                23634,
                23647
            ],
            [
                23647,
                23667
            ],
            [
                23667,
                23695
            ],
            [
                23695,
                23718
            ],
            [
                23718,
                23745
            ],
            [
                23745,
                23806
            ],
            [
                23806,
                23882
            ],
            [
                23882,
                23945
            ],
            [
                23945,
                23982
            ],
            [
                23982,
                24009
            ],
            [
                24009,
                24028
            ],
            [
                24028,
                24054
            ],
            [
                24054,
                24108
            ],
            [
                24108,
                24155
            ],
            [
                24155,
                24186
            ],
            [
                24186,
                24199
            ],
            [
                24199,
                24293
            ],
            [
                24293,
                24436
            ],
            [
                24436,
                24463
            ],
            [
                24463,
                24519
            ],
            [
                24519,
                24696
            ],
            [
                24696,
                24704
            ],
            [
                24704,
                24768
            ],
            [
                24768,
                24813
            ],
            [
                24813,
                24879
            ],
            [
                24879,
                25244
            ],
            [
                25244,
                25420
            ],
            [
                25420,
                25504
            ],
            [
                25504,
                25566
            ],
            [
                25566,
                25647
            ],
            [
                25647,
                25666
            ],
            [
                25666,
                25690
            ],
            [
                25690,
                25763
            ],
            [
                25763,
                25802
            ],
            [
                25802,
                25848
            ],
            [
                25848,
                25889
            ],
            [
                25889,
                25948
            ],
            [
                25948,
                25962
            ],
            [
                25962,
                26181
            ],
            [
                26181,
                26197
            ],
            [
                26197,
                26234
            ],
            [
                26234,
                26291
            ],
            [
                26291,
                26362
            ],
            [
                26362,
                26415
            ],
            [
                26415,
                26491
            ],
            [
                26491,
                26518
            ],
            [
                26518,
                26681
            ],
            [
                26681,
                26741
            ],
            [
                26741,
                26810
            ],
            [
                26810,
                26828
            ],
            [
                26828,
                26852
            ],
            [
                26852,
                27056
            ],
            [
                27056,
                27171
            ],
            [
                27171,
                27192
            ],
            [
                27192,
                27262
            ],
            [
                27262,
                27298
            ],
            [
                27298,
                27434
            ],
            [
                27434,
                27492
            ],
            [
                27492,
                27758
            ],
            [
                27758,
                28144
            ],
            [
                28144,
                28212
            ]
        ],
        "overlap_chars": [
            [
                27,
                51
            ],
            [
                59,
                78
            ],
            [
                129,
                132
            ],
            [
                88,
                127
            ],
            [
                169,
                171
            ],
            [
                540,
                566
            ],
            [
                592,
                656
            ],
            [
                656,
                681
            ],
            [
                960,
                966
            ],
            [
                985,
                993
            ],
            [
                994,
                997
            ],
            [
                1087,
                1089
            ],
            [
                1133,
                1214
            ],
            [
                1214,
                1302
            ],
            [
                1302,
                1407
            ],
            [
                1407,
                1455
            ],
            [
                1545,
                1627
            ],
            [
                1684,
                1689
            ],
            [
                1698,
                1702
            ],
            [
                1750,
                1796
            ],
            [
                1815,
                1830
            ],
            [
                1881,
                1941
            ],
            [
                1941,
                1981
            ],
            [
                2000,
                2019
            ],
            [
                2019,
                2118
            ],
            [
                2147,
                2171
            ],
            [
                2203,
                2207
            ],
            [
                2235,
                2454
            ],
            [
                2615,
                2616
            ],
            [
                2456,
                2472
            ],
            [
                2840,
                2842
            ],
            [
                2842,
                2874
            ],
            [
                2913,
                2915
            ],
            [
                2915,
                2971
            ],
            [
                2990,
                3035
            ],
            [
                3045,
                3130
            ],
            [
                3130,
                3169
            ],
            [
                3172,
                3203
            ],
            [
                3296,
                3297
            ],
            [
                3307,
                3308
            ],
            [
                3354,
                3359
            ],
            [
                3376,
                3394
            ],
            [
                3405,
                3473
            ],
            [
                3475,
                3479
            ],
            [
                3493,
                3508
            ],
            [
                3512,
                3515
            ],
            [
                3527,
                3535
            ],
            [
                3615,
                3617
            ],
            [
                3622,
                3680
            ],
            [
                3705,
                3721
            ],
            [
                3732,
                3735
            ],
            [
                3735,
                3771
            ],
            [
                3771,
                3802
            ],
            [
                3823,
                3882
            ],
            [
                3882,
                3898
            ],
            [
                3906,
                3960
            ],
            [
                3970,
                3988
            ],
            [
                3988,
                4050
            ],
            [
                4052,
                4087
            ],
            [
                4089,
                4102
            ],
            [
                4363,
                4409
            ],
            [
                4514,
                4556
            ],
            [
                4567,
                4570
            ],
            [
                4570,
                4591
            ],
            [
                4612,
                4621
            ],
            [
                4640,
                4642
            ],
            [
                4642,
                4674
            ],
            [
                4714,
                4727
            ],
            [
                4758,
                4793
            ],
            [
                4845,
                4851
            ],
            [
                4830,
                4838
            ],
            [
                4860,
                4870
            ],
            [
                5014,
                5091
            ],
            [
                5109,
                5112
            ],
            [
                5137,
                5165
            ],
            [
                5165,
                5245
            ],
            [
                5245,
                5283
            ],
            [
                5330,
                5352
            ],
            [
                5598,
                5649
            ],
            [
                5656,
                5669
            ],
            [
                5752,
                5771
            ],
            [
                5771,
                5792
            ],
            [
                5842,
                5894
            ],
            [
                5905,
                5926
            ],
            [
                5926,
                6079
            ],
            [
                6079,
                6119
            ],
            [
                6174,
                6278
            ],
            [
                6287,
                6298
            ],
            [
                6299,
                6306
            ],
            [
                6313,
                6320
            ],
            [
                6307,
                6312
            ],
            [
                6360,
                6362
            ],
            [
                6362,
                6372
            ],
            [
                6379,
                6452
            ],
            [
                6467,
                6469
            ],
            [
                6469,
                6512
            ],
            [
                6537,
                6563
            ],
            [
                6589,
                6622
            ],
            [
                6622,
                6671
            ],
            [
                6699,
                6706
            ],
            [
                6672,
                6684
            ],
            [
                6709,
                6711
            ],
            [
                6789,
                6826
            ],
            [
                6842,
                6879
            ],
            [
                6879,
                6928
            ],
            [
                6945,
                6947
            ],
            [
                6947,
                6974
            ],
            [
                6974,
                6993
            ],
            [
                6993,
                7096
            ],
            [
                7096,
                7156
            ],
            [
                7215,
                7254
            ],
            [
                7254,
                7288
            ],
            [
                7288,
                7311
            ],
            [
                7393,
                7468
            ],
            [
                7339,
                7347
            ],
            [
                7473,
                7501
            ],
            [
                7512,
                7529
            ],
            [
                7535,
                7537
            ],
            [
                7537,
                7612
            ],
            [
                7612,
                7690
            ],
            [
                7690,
                7711
            ],
            [
                7711,
                7732
            ],
            [
                7787,
                7789
            ],
            [
                7789,
                7808
            ],
            [
                7814,
                7916
            ],
            [
                7924,
                7944
            ],
            [
                7984,
                7995
            ],
            [
                7995,
                8003
            ],
            [
                8031,
                8041
            ],
            [
                8041,
                8082
            ],
            [
                8086,
                8090
            ],
            [
                8090,
                8092
            ],
            [
                8092,
                8112
            ],
            [
                8158,
                8214
            ],
            [
                8235,
                8292
            ],
            [
                8292,
                8321
            ],
            [
                8321,
                8394
            ],
            [
                8394,
                8428
            ],
            [
                8455,
                8458
            ],
            [
                8458,
                8488
            ],
            [
                8488,
                8505
            ],
            [
                8531,
                8532
            ],
            [
                8522,
                8531
            ],
            [
                8516,
                8517
            ],
            [
                8565,
                8622
            ],
            [
                8629,
                8639
            ],
            [
                8677,
                8716
            ],
            [
                8716,
                8742
            ],
            [
                8752,
                8795
            ],
            [
                8819,
                8932
            ],
            [
                8936,
                8982
            ],
            [
                8982,
                9030
            ],
            [
                9269,
                9278
            ],
            [
                9283,
                9298
            ],
            [
                9303,
                9343
            ],
            [
                9358,
                9366
            ],
            [
                9366,
                9409
            ],
            [
                9409,
                9523
            ],
            [
                9526,
                9712
            ],
            [
                9712,
                9718
            ],
            [
                9718,
                9734
            ],
            [
                9777,
                9779
            ],
            [
                9779,
                9816
            ],
            [
                9823,
                9873
            ],
            [
                9887,
                9962
            ],
            [
                9987,
                10020
            ],
            [
                10031,
                10033
            ],
            [
                10328,
                10381
            ],
            [
                10387,
                10498
            ],
            [
                10504,
                10538
            ],
            [
                10546,
                10548
            ],
            [
                10548,
                10554
            ],
            [
                10561,
                10565
            ],
            [
                10576,
                10600
            ],
            [
                10600,
                10619
            ],
            [
                10634,
                10655
            ],
            [
                10655,
                10701
            ],
            [
                10749,
                10780
            ],
            [
                10780,
                10806
            ],
            [
                10868,
                10921
            ],
            [
                10921,
                10948
            ],
            [
                10954,
                11007
            ],
            [
                11007,
                11068
            ],
            [
                11068,
                11103
            ],
            [
                11139,
                11141
            ],
            [
                11141,
                11147
            ],
            [
                11147,
                11365
            ],
            [
                11414,
                11417
            ],
            [
                11417,
                11457
            ],
            [
                11473,
                11623
            ],
            [
                11631,
                11681
            ],
            [
                11694,
                11733
            ],
            [
                11735,
                11742
            ],
            [
                11744,
                11768
            ],
            [
                11769,
                12018
            ],
            [
                12018,
                12112
            ],
            [
                12118,
                12132
            ],
            [
                12184,
                12307
            ],
            [
                12539,
                12656
            ],
            [
                12657,
                12715
            ],
            [
                12763,
                12765
            ],
            [
                12765,
                12895
            ],
            [
                12896,
                12899
            ],
            [
                12955,
                13069
            ],
            [
                13069,
                13231
            ],
            [
                13252,
                13281
            ],
            [
                13281,
                13348
            ],
            [
                13359,
                13361
            ],
            [
                13368,
                13411
            ],
            [
                13411,
                13452
            ],
            [
                13452,
                13491
            ],
            [
                13528,
                13594
            ],
            [
                13595,
                13647
            ],
            [
                13762,
                13764
            ],
            [
                13764,
                13801
            ],
            [
                13801,
                13823
            ],
            [
                13878,
                13880
            ],
            [
                13880,
                13898
            ],
            [
                13940,
                13943
            ],
            [
                13955,
                14069
            ],
            [
                14091,
                14100
            ],
            [
                14180,
                14194
            ],
            [
                14201,
                14211
            ],
            [
                14228,
                14230
            ],
            [
                14236,
                14238
            ],
            [
                14247,
                14290
            ],
            [
                14385,
                14394
            ],
            [
                14362,
                14364
            ],
            [
                14395,
                14506
            ],
            [
                14506,
                14527
            ],
            [
                14528,
                14549
            ],
            [
                14620,
                14671
            ],
            [
                14730,
                14738
            ],
            [
                14770,
                14807
            ],
            [
                14878,
                14880
            ],
            [
                14880,
                14899
            ],
            [
                14904,
                14907
            ],
            [
                14951,
                14956
            ],
            [
                14942,
                14946
            ],
            [
                14968,
                14970
            ],
            [
                14975,
                14986
            ],
            [
                14994,
                15011
            ],
            [
                15016,
                15034
            ],
            [
                15034,
                15127
            ],
            [
                15132,
                15150
            ],
            [
                15169,
                15180
            ],
            [
                15224,
                15253
            ],
            [
                15438,
                15528
            ],
            [
                15533,
                15535
            ],
            [
                15535,
                15560
            ],
            [
                15569,
                15572
            ],
            [
                15572,
                15633
            ],
            [
                15644,
                15646
            ],
            [
                15646,
                15668
            ],
            [
                15668,
                15683
            ],
            [
                15773,
                15809
            ],
            [
                15809,
                15847
            ],
            [
                15847,
                15872
            ],
            [
                15872,
                15891
            ],
            [
                15891,
                15903
            ],
            [
                15903,
                15929
            ],
            [
                15929,
                15958
            ],
            [
                15958,
                15968
            ],
            [
                15968,
                15997
            ],
            [
                16045,
                16069
            ],
            [
                16069,
                16094
            ],
            [
                16094,
                16109
            ],
            [
                16133,
                16206
            ],
            [
                16206,
                16277
            ],
            [
                16298,
                16337
            ],
            [
                16337,
                16386
            ],
            [
                16386,
                16421
            ],
            [
                16421,
                16429
            ],
            [
                16478,
                16516
            ],
            [
                16533,
                16588
            ],
            [
                16625,
                16628
            ],
            [
                16635,
                16647
            ],
            [
                16657,
                16685
            ],
            [
                16685,
                16720
            ],
            [
                16744,
                16751
            ],
            [
                16751,
                16829
            ],
            [
                16829,
                16879
            ],
            [
                16896,
                16898
            ],
            [
                16898,
                16899
            ],
            [
                16904,
                16912
            ],
            [
                16925,
                16948
            ],
            [
                16948,
                16961
            ],
            [
                16961,
                17001
            ],
            [
                17041,
                17080
            ],
            [
                17185,
                17187
            ],
            [
                17187,
                17241
            ],
            [
                17241,
                17261
            ],
            [
                17261,
                17268
            ],
            [
                17269,
                17284
            ],
            [
                17329,
                17340
            ],
            [
                17347,
                17380
            ],
            [
                17380,
                17458
            ],
            [
                17458,
                17514
            ],
            [
                17514,
                17534
            ],
            [
                17534,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                17586
            ],
            [
                17637,
                17744
            ],
            [
                17792,
                17801
            ],
            [
                17768,
                17791
            ],
            [
                17803,
                17877
            ],
            [
                17885,
                17892
            ],
            [
                17892,
                17897
            ],
            [
                17904,
                17929
            ],
            [
                17932,
                17947
            ],
            [
                17964,
                17965
            ],
            [
                18112,
                18184
            ],
            [
                18184,
                18186
            ],
            [
                18186,
                18209
            ],
            [
                18209,
                18244
            ],
            [
                18254,
                18255
            ],
            [
                18264,
                18292
            ],
            [
                18292,
                18327
            ],
            [
                18383,
                18456
            ],
            [
                18456,
                18482
            ],
            [
                18483,
                18496
            ],
            [
                18522,
                18551
            ],
            [
                18551,
                18639
            ],
            [
                18685,
                18688
            ],
            [
                18688,
                18740
            ],
            [
                18740,
                18785
            ],
            [
                18795,
                18798
            ],
            [
                18808,
                18833
            ],
            [
                18839,
                18871
            ],
            [
                18871,
                18991
            ],
            [
                18991,
                19021
            ],
            [
                19039,
                19098
            ],
            [
                19175,
                19177
            ],
            [
                19106,
                19128
            ],
            [
                19189,
                19294
            ],
            [
                19316,
                19319
            ],
            [
                19319,
                19335
            ],
            [
                19335,
                19347
            ],
            [
                19347,
                19392
            ],
            [
                19393,
                19409
            ],
            [
                19420,
                19473
            ],
            [
                19486,
                19531
            ],
            [
                19531,
                19611
            ],
            [
                19615,
                19638
            ],
            [
                19752,
                19754
            ],
            [
                19760,
                19770
            ],
            [
                19775,
                19776
            ],
            [
                19777,
                19836
            ],
            [
                19836,
                19862
            ],
            [
                19910,
                19931
            ],
            [
                19931,
                20010
            ],
            [
                20018,
                20020
            ],
            [
                20020,
                20030
            ],
            [
                20038,
                20123
            ],
            [
                20123,
                20136
            ],
            [
                20136,
                20167
            ],
            [
                20167,
                20204
            ],
            [
                20245,
                20338
            ],
            [
                20338,
                20359
            ],
            [
                20367,
                20370
            ],
            [
                20396,
                20495
            ],
            [
                20530,
                20561
            ],
            [
                20583,
                20585
            ],
            [
                20585,
                20668
            ],
            [
                20668,
                20697
            ],
            [
                20705,
                20708
            ],
            [
                20708,
                20779
            ],
            [
                20787,
                20833
            ],
            [
                20859,
                20896
            ],
            [
                20896,
                20956
            ],
            [
                21013,
                21015
            ],
            [
                21015,
                21060
            ],
            [
                21070,
                21113
            ],
            [
                21196,
                21246
            ],
            [
                21276,
                21367
            ],
            [
                21367,
                21480
            ],
            [
                21497,
                21526
            ],
            [
                21661,
                21680
            ],
            [
                21622,
                21660
            ],
            [
                21682,
                21703
            ],
            [
                21703,
                21817
            ],
            [
                21834,
                21861
            ],
            [
                21861,
                21890
            ],
            [
                21894,
                21918
            ],
            [
                21946,
                21985
            ],
            [
                22018,
                22053
            ],
            [
                22109,
                22163
            ],
            [
                22163,
                22211
            ],
            [
                22220,
                22318
            ],
            [
                22365,
                22367
            ],
            [
                22367,
                22443
            ],
            [
                22454,
                22461
            ],
            [
                22461,
                22513
            ],
            [
                22581,
                22582
            ],
            [
                22589,
                22644
            ],
            [
                22644,
                22665
            ],
            [
                22665,
                22676
            ],
            [
                22689,
                22691
            ],
            [
                22691,
                22707
            ],
            [
                22707,
                22717
            ],
            [
                22717,
                22724
            ],
            [
                22724,
                22736
            ],
            [
                22736,
                22834
            ],
            [
                22834,
                22863
            ],
            [
                22973,
                23000
            ],
            [
                23006,
                23044
            ],
            [
                23044,
                23117
            ],
            [
                23117,
                23147
            ],
            [
                23154,
                23181
            ],
            [
                23195,
                23200
            ],
            [
                23200,
                23214
            ],
            [
                23214,
                23343
            ],
            [
                23343,
                23384
            ],
            [
                23384,
                23397
            ],
            [
                23397,
                23500
            ],
            [
                23540,
                23541
            ],
            [
                23542,
                23602
            ],
            [
                23647,
                23667
            ],
            [
                23667,
                23695
            ],
            [
                23695,
                23718
            ],
            [
                23718,
                23723
            ],
            [
                23728,
                23731
            ],
            [
                23742,
                23745
            ],
            [
                23745,
                23782
            ],
            [
                23804,
                23806
            ],
            [
                23806,
                23830
            ],
            [
                23838,
                23852
            ],
            [
                23860,
                23882
            ],
            [
                23882,
                23945
            ],
            [
                23945,
                23982
            ],
            [
                23982,
                24009
            ],
            [
                24009,
                24028
            ],
            [
                24028,
                24054
            ],
            [
                24054,
                24108
            ],
            [
                24108,
                24114
            ],
            [
                24137,
                24155
            ],
            [
                24155,
                24186
            ],
            [
                24186,
                24199
            ],
            [
                24199,
                24212
            ],
            [
                24213,
                24220
            ],
            [
                24232,
                24293
            ],
            [
                24293,
                24330
            ],
            [
                24379,
                24436
            ],
            [
                24436,
                24463
            ],
            [
                24463,
                24519
            ],
            [
                24519,
                24624
            ],
            [
                24658,
                24696
            ],
            [
                24696,
                24704
            ],
            [
                24704,
                24719
            ],
            [
                24728,
                24768
            ],
            [
                24780,
                24813
            ],
            [
                24813,
                24879
            ],
            [
                24879,
                24885
            ],
            [
                25046,
                25050
            ],
            [
                24903,
                24912
            ],
            [
                25075,
                25112
            ],
            [
                25124,
                25145
            ],
            [
                25214,
                25243
            ],
            [
                25244,
                25315
            ],
            [
                25329,
                25391
            ],
            [
                25418,
                25420
            ],
            [
                25420,
                25504
            ],
            [
                25504,
                25566
            ],
            [
                25566,
                25637
            ],
            [
                25644,
                25647
            ],
            [
                25647,
                25666
            ],
            [
                25666,
                25676
            ],
            [
                25687,
                25690
            ],
            [
                25690,
                25697
            ],
            [
                25710,
                25731
            ],
            [
                25746,
                25763
            ],
            [
                25763,
                25802
            ],
            [
                25802,
                25848
            ],
            [
                25848,
                25864
            ],
            [
                25872,
                25889
            ],
            [
                25889,
                25890
            ],
            [
                25915,
                25948
            ],
            [
                25948,
                25962
            ],
            [
                25962,
                25983
            ],
            [
                26015,
                26031
            ],
            [
                26136,
                26156
            ],
            [
                26179,
                26181
            ],
            [
                26181,
                26197
            ],
            [
                26203,
                26234
            ],
            [
                26291,
                26362
            ],
            [
                26362,
                26415
            ],
            [
                26415,
                26442
            ],
            [
                26452,
                26489
            ],
            [
                26518,
                26677
            ],
            [
                26681,
                26700
            ],
            [
                26716,
                26741
            ],
            [
                26741,
                26746
            ],
            [
                26753,
                26799
            ],
            [
                26807,
                26810
            ],
            [
                26810,
                26828
            ],
            [
                26828,
                26852
            ],
            [
                26852,
                26948
            ],
            [
                26968,
                26997
            ],
            [
                27056,
                27119
            ],
            [
                27149,
                27171
            ],
            [
                27171,
                27192
            ],
            [
                27192,
                27217
            ],
            [
                27228,
                27262
            ],
            [
                27262,
                27298
            ],
            [
                27298,
                27314
            ],
            [
                27325,
                27349
            ],
            [
                27350,
                27363
            ],
            [
                27413,
                27432
            ],
            [
                27492,
                27627
            ],
            [
                27646,
                27697
            ],
            [
                27756,
                27758
            ],
            [
                27758,
                27783
            ],
            [
                27802,
                27924
            ],
            [
                27930,
                27973
            ],
            [
                28004,
                28015
            ],
            [
                28024,
                28043
            ],
            [
                28048,
                28116
            ],
            [
                28142,
                28144
            ],
            [
                28144,
                28212
            ]
        ],
        "row_chars": [
            [
                0,
                171
            ],
            [
                171,
                347
            ],
            [
                347,
                540
            ],
            [
                540,
                656
            ],
            [
                656,
                682
            ],
            [
                682,
                960
            ],
            [
                960,
                1214
            ],
            [
                1214,
                1302
            ],
            [
                1302,
                1407
            ],
            [
                1407,
                1941
            ],
            [
                1941,
                2019
            ],
            [
                2019,
                2118
            ],
            [
                2118,
                2842
            ],
            [
                2842,
                2915
            ],
            [
                2915,
                3130
            ],
            [
                3130,
                3203
            ],
            [
                3203,
                3225
            ],
            [
                3225,
                3296
            ],
            [
                3296,
                3493
            ],
            [
                3493,
                3617
            ],
            [
                3617,
                3735
            ],
            [
                3735,
                3771
            ],
            [
                3771,
                3882
            ],
            [
                3882,
                3988
            ],
            [
                3988,
                4102
            ],
            [
                4102,
                4121
            ],
            [
                4121,
                4213
            ],
            [
                4213,
                4363
            ],
            [
                4363,
                4409
            ],
            [
                4409,
                4514
            ],
            [
                4514,
                4570
            ],
            [
                4570,
                4592
            ],
            [
                4592,
                4612
            ],
            [
                4612,
                4642
            ],
            [
                4642,
                4870
            ],
            [
                4870,
                4983
            ],
            [
                4983,
                5014
            ],
            [
                5014,
                5112
            ],
            [
                5112,
                5137
            ],
            [
                5137,
                5165
            ],
            [
                5165,
                5245
            ],
            [
                5245,
                5283
            ],
            [
                5283,
                5330
            ],
            [
                5330,
                5355
            ],
            [
                5355,
                5375
            ],
            [
                5375,
                5421
            ],
            [
                5421,
                5451
            ],
            [
                5451,
                5597
            ],
            [
                5597,
                5649
            ],
            [
                5649,
                5771
            ],
            [
                5771,
                5793
            ],
            [
                5793,
                5926
            ],
            [
                5926,
                6079
            ],
            [
                6079,
                6362
            ],
            [
                6362,
                6469
            ],
            [
                6469,
                6622
            ],
            [
                6622,
                6711
            ],
            [
                6711,
                6879
            ],
            [
                6879,
                6947
            ],
            [
                6947,
                6974
            ],
            [
                6974,
                6993
            ],
            [
                6993,
                7096
            ],
            [
                7096,
                7254
            ],
            [
                7254,
                7288
            ],
            [
                7288,
                7311
            ],
            [
                7311,
                7537
            ],
            [
                7537,
                7612
            ],
            [
                7612,
                7690
            ],
            [
                7690,
                7711
            ],
            [
                7711,
                7789
            ],
            [
                7789,
                7944
            ],
            [
                7944,
                8041
            ],
            [
                8041,
                8092
            ],
            [
                8092,
                8112
            ],
            [
                8112,
                8158
            ],
            [
                8158,
                8292
            ],
            [
                8292,
                8321
            ],
            [
                8321,
                8394
            ],
            [
                8394,
                8458
            ],
            [
                8458,
                8488
            ],
            [
                8488,
                8559
            ],
            [
                8559,
                8565
            ],
            [
                8565,
                8716
            ],
            [
                8716,
                8797
            ],
            [
                8797,
                8819
            ],
            [
                8819,
                8936
            ],
            [
                8936,
                8982
            ],
            [
                8982,
                9343
            ],
            [
                9343,
                9358
            ],
            [
                9358,
                9366
            ],
            [
                9366,
                9409
            ],
            [
                9409,
                9712
            ],
            [
                9712,
                9718
            ],
            [
                9718,
                9779
            ],
            [
                9779,
                9964
            ],
            [
                9964,
                9987
            ],
            [
                9987,
                10033
            ],
            [
                10033,
                10143
            ],
            [
                10143,
                10183
            ],
            [
                10183,
                10244
            ],
            [
                10244,
                10260
            ],
            [
                10260,
                10326
            ],
            [
                10326,
                10548
            ],
            [
                10548,
                10600
            ],
            [
                10600,
                10655
            ],
            [
                10655,
                10780
            ],
            [
                10780,
                10921
            ],
            [
                10921,
                11007
            ],
            [
                11007,
                11068
            ],
            [
                11068,
                11141
            ],
            [
                11141,
                11147
            ],
            [
                11147,
                11417
            ],
            [
                11417,
                11769
            ],
            [
                11769,
                12018
            ],
            [
                12018,
                12308
            ],
            [
                12308,
                12539
            ],
            [
                12539,
                12765
            ],
            [
                12765,
                13069
            ],
            [
                13069,
                13281
            ],
            [
                13281,
                13411
            ],
            [
                13411,
                13452
            ],
            [
                13452,
                13764
            ],
            [
                13764,
                13801
            ],
            [
                13801,
                13880
            ],
            [
                13880,
                14069
            ],
            [
                14069,
                14230
            ],
            [
                14230,
                14290
            ],
            [
                14290,
                14506
            ],
            [
                14506,
                14549
            ],
            [
                14549,
                14620
            ],
            [
                14620,
                14671
            ],
            [
                14671,
                14730
            ],
            [
                14730,
                14880
            ],
            [
                14880,
                15034
            ],
            [
                15034,
                15180
            ],
            [
                15180,
                15535
            ],
            [
                15535,
                15572
            ],
            [
                15572,
                15646
            ],
            [
                15646,
                15668
            ],
            [
                15668,
                15683
            ],
            [
                15683,
                15772
            ],
            [
                15772,
                15809
            ],
            [
                15809,
                15847
            ],
            [
                15847,
                15872
            ],
            [
                15872,
                15891
            ],
            [
                15891,
                15903
            ],
            [
                15903,
                15929
            ],
            [
                15929,
                15958
            ],
            [
                15958,
                15968
            ],
            [
                15968,
                15997
            ],
            [
                15997,
                16029
            ],
            [
                16029,
                16045
            ],
            [
                16045,
                16069
            ],
            [
                16069,
                16094
            ],
            [
                16094,
                16206
            ],
            [
                16206,
                16337
            ],
            [
                16337,
                16386
            ],
            [
                16386,
                16421
            ],
            [
                16421,
                16588
            ],
            [
                16588,
                16685
            ],
            [
                16685,
                16751
            ],
            [
                16751,
                16829
            ],
            [
                16829,
                16898
            ],
            [
                16898,
                16948
            ],
            [
                16948,
                16961
            ],
            [
                16961,
                17001
            ],
            [
                17001,
                17187
            ],
            [
                17187,
                17241
            ],
            [
                17241,
                17261
            ],
            [
                17261,
                17269
            ],
            [
                17269,
                17380
            ],
            [
                17380,
                17458
            ],
            [
                17458,
                17514
            ],
            [
                17514,
                17534
            ],
            [
                17534,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                17623
            ],
            [
                17623,
                17637
            ],
            [
                17637,
                17744
            ],
            [
                17744,
                17803
            ],
            [
                17803,
                17892
            ],
            [
                17892,
                17966
            ],
            [
                17966,
                17986
            ],
            [
                17986,
                18112
            ],
            [
                18112,
                18186
            ],
            [
                18186,
                18209
            ],
            [
                18209,
                18292
            ],
            [
                18292,
                18327
            ],
            [
                18327,
                18382
            ],
            [
                18382,
                18456
            ],
            [
                18456,
                18551
            ],
            [
                18551,
                18688
            ],
            [
                18688,
                18740
            ],
            [
                18740,
                18871
            ],
            [
                18871,
                18991
            ],
            [
                18991,
                19319
            ],
            [
                19319,
                19335
            ],
            [
                19335,
                19347
            ],
            [
                19347,
                19393
            ],
            [
                19393,
                19531
            ],
            [
                19531,
                19754
            ],
            [
                19754,
                19836
            ],
            [
                19836,
                19931
            ],
            [
                19931,
                20020
            ],
            [
                20020,
                20123
            ],
            [
                20123,
                20136
            ],
            [
                20136,
                20167
            ],
            [
                20167,
                20338
            ],
            [
                20338,
                20585
            ],
            [
                20585,
                20668
            ],
            [
                20668,
                20708
            ],
            [
                20708,
                20896
            ],
            [
                20896,
                21015
            ],
            [
                21015,
                21246
            ],
            [
                21246,
                21367
            ],
            [
                21367,
                21703
            ],
            [
                21703,
                21861
            ],
            [
                21861,
                22053
            ],
            [
                22053,
                22163
            ],
            [
                22163,
                22211
            ],
            [
                22211,
                22367
            ],
            [
                22367,
                22461
            ],
            [
                22461,
                22644
            ],
            [
                22644,
                22665
            ],
            [
                22665,
                22691
            ],
            [
                22691,
                22707
            ],
            [
                22707,
                22717
            ],
            [
                22717,
                22724
            ],
            [
                22724,
                22736
            ],
            [
                22736,
                22834
            ],
            [
                22834,
                22864
            ],
            [
                22864,
                22973
            ],
            [
                22973,
                23044
            ],
            [
                23044,
                23117
            ],
            [
                23117,
                23200
            ],
            [
                23200,
                23214
            ],
            [
                23214,
                23343
            ],
            [
                23343,
                23384
            ],
            [
                23384,
                23397
            ],
            [
                23397,
                23542
            ],
            [
                23542,
                23602
            ],
            [
                23602,
                23634
            ],
            [
                23634,
                23647
            ],
            [
                23647,
                23667
            ],
            [
                23667,
                23695
            ],
            [
                23695,
                23718
            ],
            [
                23718,
                23745
            ],
            [
                23745,
                23806
            ],
            [
                23806,
                23882
            ],
            [
                23882,
                23945
            ],
            [
                23945,
                23982
            ],
            [
                23982,
                24009
            ],
            [
                24009,
                24028
            ],
            [
                24028,
                24054
            ],
            [
                24054,
                24108
            ],
            [
                24108,
                24155
            ],
            [
                24155,
                24186
            ],
            [
                24186,
                24199
            ],
            [
                24199,
                24293
            ],
            [
                24293,
                24436
            ],
            [
                24436,
                24463
            ],
            [
                24463,
                24519
            ],
            [
                24519,
                24696
            ],
            [
                24696,
                24704
            ],
            [
                24704,
                24768
            ],
            [
                24768,
                24813
            ],
            [
                24813,
                24879
            ],
            [
                24879,
                25244
            ],
            [
                25244,
                25420
            ],
            [
                25420,
                25504
            ],
            [
                25504,
                25566
            ],
            [
                25566,
                25647
            ],
            [
                25647,
                25666
            ],
            [
                25666,
                25690
            ],
            [
                25690,
                25763
            ],
            [
                25763,
                25802
            ],
            [
                25802,
                25848
            ],
            [
                25848,
                25889
            ],
            [
                25889,
                25948
            ],
            [
                25948,
                25962
            ],
            [
                25962,
                26181
            ],
            [
                26181,
                26197
            ],
            [
                26197,
                26234
            ],
            [
                26234,
                26291
            ],
            [
                26291,
                26362
            ],
            [
                26362,
                26415
            ],
            [
                26415,
                26491
            ],
            [
                26491,
                26518
            ],
            [
                26518,
                26681
            ],
            [
                26681,
                26741
            ],
            [
                26741,
                26810
            ],
            [
                26810,
                26828
            ],
            [
                26828,
                26852
            ],
            [
                26852,
                27171
            ],
            [
                27171,
                27192
            ],
            [
                27192,
                27262
            ],
            [
                27262,
                27298
            ],
            [
                27298,
                27434
            ],
            [
                27434,
                27492
            ],
            [
                27492,
                27758
            ],
            [
                27758,
                28144
            ],
            [
                28144,
                28212
            ]
        ]
    },
    "abridged": {
        "text": "In Lincoln's Inn Fields, the evening is hot, and Mr. Tulkinghorn's windows are wide open. Plenty of dust comes in at them, and plenty more has generated among his furniture and papers. It lies thick everywhere.\nIn his atmosphere of dust, beneath the figure of Allegory, Mr. Tulkinghorn sits at one of the open windows enjoying a bottle of old port. Though a hard-grained man, close, dry, and silent, he can enjoy old wine with the best. He has a priceless bin of port in some artful cellar under the Fields, which is one of his many secrets. When he dines alone in chambers, as he has dined today, he descends with a candle to the echoing regions below the deserted mansion, and comes back with a bottle from which he pours a radiant nectar, fifty years old, that fills the whole room with the fragrance of southern grapes.\nMr. Tulkinghorn, sitting in the twilight, enjoys his wine. As if it whispered to him of its fifty years of silence and seclusion, it shuts him up the closer. He sits, and drinks, and ponders on all the mysteries he knows, associated with darkening woods in the country, and vast blank shut-up houses in town, and perhaps sparing a thought or two for himself, and his family history, and his money, and his will - all a mystery to everyone.\nBut Mr. Tulkinghorn is not alone tonight. Seated at the same table, though with his chair modestly drawn a little way from it, sits a bald, mild man who coughs respectfully behind his hand when the lawyer bids him fill his glass.\n\"Now, Snagsby,\" says Mr. Tulkinghorn, \"go over this odd story again.\"\n\"I remembered, sir, that you had taken an interest in that person, and I thought it possible that you might - just - wish-\"\nMr. Tulkinghorn does not help him. Mr. Snagsby trails off into saying, with an awkward cough, \"Excuse the liberty, sir.\"\n\"Not at all,\" says Mr. Tulkinghorn. \"You told me, Snagsby, that you came round without mentioning your intention to your wife. That was prudent, because it's not a matter of such importance that it needs to be mentioned.\"\n\"Well, sir,\" returns Mr. Snagsby, \"you see, my little woman is - not to put too fine a point upon it - inquisitive. My little woman has a very active mind, sir.\"\n\"Therefore you kept your visit to yourself?\" says Mr. Tulkinghorn.\n\"Yes, sir. My little woman is at present in a pious state, and attends the Evening Exertions of the Reverend Chadband. My little woman being engaged in that way made it easier for me to step round quietly.\"\n\"Fill your glass, Snagsby.\"\n\"Thank you, sir, I am sure,\" returns the stationer with his cough of deference. \"This is wonderfully fine wine, sir!\"\n\"It is fifty years old. Will you run over, once again, what the boy said?\" Mr. Tulkinghorn leans back in his chair.\n\"With pleasure, sir.\" The law-stationer repeats Jo's statement made to the guests at his house. On coming to the end of his narrative, he gives a great start and breaks off with, \"Dear me, sir, I wasn't aware there was any other gentleman present!\"\nMr. Snagsby is dismayed to see, standing attentively at a little distance from the table, a person with a hat and stick in his hand who was not there when he came in and who has not entered since. There is a wardrobe in the room, but its hinges have not creaked, nor has a step been audible. Yet this third person stands there with his hat and stick in his hands, a composed and quiet listener. He is a stoutly built, steady-looking, sharp-eyed middle-aged man in black. There is nothing remarkable about him but his ghostly manner of appearing.\n\"Don't mind this gentleman,\" says Mr. Tulkinghorn. \"This is only Mr. Bucket.\"\n\"Oh, indeed, sir?\" returns the stationer, expressing by a cough that he is quite in the dark as to who Mr. Bucket may be.\n\"I wanted him to hear this story,\" says the lawyer, \"because he is very intelligent in such things. What do you say to this, Bucket?\"\n\"It's very plain, sir. If Mr. Snagsby don't object to go down with me to Tom-all-Alone's and point this boy out, we can have him here in a couple of hours. I can do it without Mr. Snagsby, of course, but this is the shortest way.\"\n\"Mr. Bucket is a detective officer, Snagsby,\" says the lawyer in explanation.\n\"Is he indeed, sir?\" says Mr. Snagsby with some alarm.\n\"And if you have no objection to accompany Mr. Bucket to the place in question,\" pursues the lawyer, \"I shall feel obliged if you will do so.\"\nAs Mr. Snagsby hesitates, Bucket reads his mind.\n\"Don't you be afraid of hurting the boy,\" says Bucket. \"You won't do that. We shall only bring him here to ask him a question or so, and he'll be paid for his trouble and sent away again. It'll be a good job for him. I promise you, as a man, that you shall see the boy sent away all right. Don't you be afraid of hurting him.\"\n\"Very well, Mr. Tulkinghorn!\" cries Mr. Snagsby, reassured.\n\"And lookee here, Mr. Snagsby,\" resumes Bucket, taking him by the arm, and speaking in a confidential tone. \"You're a man of the world, and a man of business, and a man of sense.\"\n\"I am sure I am much obliged to you for your good opinion,\" returns the stationer with his cough of modesty, \"but-\"\n\"That's what you are, you know,\" says Bucket. \"Now, it an't necessary to say to a man like you that it's best and wisest to keep little matters like this quiet. Quiet!\"\n\"Certainly, certainly,\" returns the other.\n\"I don't mind telling you,\" says Bucket with an engaging appearance of frankness, \"that as far as I can understand, there seems to be a doubt whether this dead person wasn't entitled to a little property, and whether this female hasn't been up to some games respecting that property, don't you see?\"\n\"Oh!\" says Mr. Snagsby.\n\"Now, what you want,\" pursues Bucket, tapping Mr. Snagsby on the breast in a comfortable manner, \"is that every person should have their rights according to justice.\"\n\"To be sure,\" returns Mr. Snagsby.\n\"On account of which, and at the same time to oblige a good customer, you mean to go down with me, in confidence, to Tom-all-Alone's and to keep the whole thing quiet afterwards and never mention it to anyone. That's your intention, if I understand you?\"\n\"You are right, sir,\" says Mr. Snagsby.\n\"Then here's your hat,\" returns his new friend; \"and if you're ready, I am.\"\nThey leave Mr. Tulkinghorn drinking his old wine, and go down into the streets.\n\"You don't happen to know a good sort of person of the name of Gridley, do you?\" says Bucket in friendly converse as they descend the stairs.\n\"No,\" says Mr. Snagsby, considering. \"Why?\"\n\"Nothing particular,\" says Bucket; \"only having allowed his temper to get a little the better of him and having been threatening some respectable people, he is keeping out of the way of a warrant I have got against him.\"\nAs they walk along, Mr. Snagsby observes that however quick their pace may be, his companion still seems in some undefinable manner to lurk and lounge; also, that whenever he is going to turn right or left, he pretends to have a fixed purpose of going straight ahead, and wheels off sharply at the very last moment.\nNow and then, when they pass a police-constable on his beat, Mr. Snagsby notices that both the constable and his guide fall into a deep abstraction as they come towards each other, and appear entirely to overlook each other, and to gaze into space. In a few instances, Mr. Bucket, coming behind some under-sized young man with a shining hat on his sleek hair, almost without glancing at him touches him with his stick, upon which the young man, looking round, instantly evaporates.\nWhen they come at last to Tom-all-Alone's, Mr. Bucket stops for a moment at the corner and takes a lighted bull's-eye lantern from the constable on duty there, who then accompanies him. Between his two conductors, Mr. Snagsby passes along the middle of a villainous street, undrained, unventilated, deep in black mud, and filthy, reeking with such smells and sights that he, who has lived in London all his life, can scarce believe his senses. Branching from this street and its heaps of ruins are other streets and courts so infamous that Mr. Snagsby sickens in body and mind and feels as if he were going down into the infernal gulf.\n\"Draw off a bit here, Mr. Snagsby,\" says Bucket as a kind of shabby litter is carried towards them, surrounded by a noisy crowd. \"Here's the fever coming up the street!\"\nAs the unseen wretch goes by, the crowd hovers round the three visitors like a dream of horrible faces and then fades away up alleys and into ruins and behind walls.\n\"Are those the fever-houses, Darby?\" Mr. Bucket coolly asks.\nDarby replies that for months, the people \"have been down by dozens\" and have been carried out dead and dying \"like sheep with the rot.\" Mr. Snagsby feels as if he can't breathe.\nInquiry is made at various houses for a boy named Jo. Mr. Snagsby is asked whether he means Carrots, or the Colonel, or Gallows, or Young Chisel, or Terrier Tip, or Lanky, or the Brick. Mr. Snagsby describes him over and over again. Some think it must be Carrots, some say the Brick. Whenever the three are stationary, the crowd flows round them. Whenever they move, the crowd flits away up alleys, and into ruins, and behind walls, as before.\nAt last there is a lair found out where Toughy, or the Tough Subject, lays him down at night; it is thought that he may be Jo. The proprietress of the house says Toughy has gone to the doctor's to get a bottle of stuff for a sick woman but will be here soon.\n\"And who have we got here tonight?\" says Mr. Bucket, opening another door and glaring in with his lantern. \"Two drunken men, eh? And two women? Are these your good men, my dears?\"\n\"Yes, sir,\" returns one of the women. \"They are our husbands.\"\n\"Brickmakers, eh?\"\n\"Yes, sir.\"\n\"What are you doing here? You don't belong to London.\"\n\"No, sir. We belong to Hertfordshire.\"\n\"Come up on the tramp?\"\n\"We walked up yesterday. There's no work there, but we have done no good by coming here, and shall do none, I expect.\"\n\"That's not the way to do much good,\" says Mr. Bucket, turning his head towards the unconscious figures on the ground.\n\"It an't indeed,\" replies the woman with a sigh. \"Jenny and me knows it full well.\"\nThe room is so low that the head of the tallest visitor would touch the blackened ceiling if he stood upright. The candle burns sickly in the polluted air. There are a couple of benches and a table. The men lie asleep where they stumbled down, but the women sit by the candle. Lying in the arms of the woman who has spoken is a baby.\n\"What age is that little creature?\" says Bucket. \"It looks as if it was born yesterday.\" He turns his light gently on the infant.\n\"He is not three weeks old yet, sir,\" says the woman.\n\"Is he your child?\"\n\"Mine.\" The other woman stoops down and kisses it as it lies asleep.\n\"You seem as fond of it as if you were the mother yourself,\" says Mr. Bucket.\n\"I was the mother of one like it, master, and it died.\"\n\"Ah, Jenny, Jenny!\" says the other woman to her. \"Better so. Much better!\"\n\"Why, you an't such an unnatural woman, I hope,\" returns Bucket sternly, \"as to wish your own child dead?\"\n\"I am not, master,\" she returns. \"I'd stand between it and death with my own life if I could, as true as any lady.\"\n\"Then why do you talk in that wrong manner?\" says Mr. Bucket.\n\"If it was never to wake no more, you'd think me mad, I should take on so,\" returns the woman, her eyes filling with tears. \"I know that very well. I was with Jenny when she lost hers, and I know how she grieved. But look around you at this place. Look at the boy you're waiting for, who's gone out to do me a good turn. Think of the children that you come across in your business, and that you see grow up!\"\n\"Well, well,\" says Mr. Bucket, \"you train him respectable, and he'll be a comfort to you.\"\n\"I mean to try hard,\" she answers, wiping her eyes. \"But I have been a-thinking, being over-tired and ill with the ague, of all the things that'll come in his way. My master will be against it, and he'll be beat, and see me beat, and made to fear his home, and perhaps to stray wild. If I work for him ever so much, there's no one to help me; and if he should be turned bad in spite of all I could do, and made hard and changed, an't it likely I should think of him as he lies in my lap now and wish he had died!\"\n\"There, there!\" says Jenny. \"Liz, you're tired and ill. Let me take him.\" In doing so, she moves the mother's dress, but quickly readjusts it over the bruised bosom where the baby has been lying.\n\"It's my dead child,\" says Jenny, walking up and down as she nurses, \"that makes us both love this child so dear. She thinks of its being taken away from her, and I think what fortune would I give to have my darling back. But we mean the same thing in our poor hearts!\"\nAs Mr. Snagsby blows his nose and coughs his cough of sympathy, a step is heard outside. Mr. Bucket shines his light into the doorway and says to Mr. Snagsby, \"Now, what do you say to Toughy? Will he do?\"\n\"That's Jo,\" says Mr. Snagsby.\nJo stands amazed in the disk of light, trembling to think that he has offended against the law in not having moved on far enough. Mr. Snagsby, however, assuring him, \"It's only a job you will be paid for, Jo,\" he recovers; and on being taken outside by Mr. Bucket, tells his tale satisfactorily.\n\"I have squared it with the lad,\" says Mr. Bucket, returning, \"and it's all right. Now, Mr. Snagsby, we're ready to go.\"\nFirst, Jo has to complete his errand of good nature by handing over the medicine he has been to get, which he delivers with the instruction that \"it's to be all took d'rectly.\" Secondly, Mr. Snagsby has to lay upon the table half a crown. Thirdly, Mr. Bucket has to take Jo by the arm above the elbow and walk him on before him, so that he is professionally conducted to Lincoln's Inn Fields. They give the women good night and come out once more into black and foul Tom-all-Alone's.\nBy the noisome ways through which they descended into that pit, they gradually emerge from it, the crowd flitting and skulking about them until it turns back, yelling like a concourse of imprisoned demons, and is seen no more. Through the clearer and fresher streets, never so clear and fresh to Mr. Snagsby's mind as now, they walk and ride to Mr. Tulkinghorn's gate.\nAs they ascend the dim stairs to Mr. Tulkinghorn's chambers, Mr. Bucket mentions that he has the key and that there is no need to ring. He takes time to open the door and makes some noise too. It may be that he sounds a note of preparation.\nThey come at last into the hall, where a lamp is burning, and so into Mr. Tulkinghorn's usual room. He is not there, but his two old-fashioned candlesticks are, and the room is reasonably light.\nMr. Bucket, still having his professional hold of Jo, goes a little way into this room, when Jo starts and stops.\n\"What's the matter?\" says Bucket.\n\"There she is!\" cries Jo.\n\"Who!\"\n\"The lady!\"\nA female figure, closely veiled, stands in the middle of the room, where the light falls upon it. It is quite still and silent.\n\"Now, tell me,\" says Bucket, \"how you know that to be the lady.\"\n\"I know the wale,\" replies Jo, staring, \"and the bonnet, and the gownd.\"\n\"Be quite sure of what you say,\" returns Bucket, narrowly observing him. \"Look again.\"\n\"I am a-looking as hard as ever I can look,\" says Jo with starting eyes, \"and that there's the wale, the bonnet, and the gownd.\"\n\"What about those rings you told me of?\" asks Bucket.\n\"A-sparkling all over here,\" says Jo, rubbing the fingers of his left hand on the knuckles of his right. The figure removes the right-hand glove and shows the hand.\nJo shakes his head. \"Not rings a bit like them. Not a hand like that.\"\n\"What do you mean?\" says Bucket, evidently pleased though.\n\"Hand was a deal whiter, and delicater, and smaller,\" returns Jo.\n\"Why, you'll tell me I'm my own mother next,\" says Mr. Bucket. \"Do you recollect the lady's voice?\"\n\"I think I does,\" says Jo.\nThe figure speaks. \"Was it at all like this? I will speak as long as you like if you are not sure. Was it like this voice?\"\nJo looks aghast at Mr. Bucket. \"Not a bit!\"\n\"Then, what,\" he retorts, pointing to the figure, \"did you say it was the lady for?\"\n\"Cos,\" says Jo with a perplexed stare, \"cos that there's the wale, the bonnet, and the gownd. It is her and it an't her. It an't her hand, nor yet her rings, nor yet her woice. But that there's the wale, the bonnet, and the gownd, and they're wore the same way wot she wore 'em, and she giv me a sov'ring and hooked it.\"\n\"Well!\" says Mr. Bucket, \"we haven't got much good out of you. However, here's five shillings for you. Take care how you spend it, and don't get yourself into trouble.\" Bucket puts the coins into the boy's hand and takes him out, leaving Mr. Snagsby uncomfortably alone with the veiled figure.\nBut on Mr. Tulkinghorn's coming into the room, the veil is raised and a good-looking Frenchwoman is revealed, though her expression is somewhat intense.\n\"Thank you, Mademoiselle Hortense,\" says Mr. Tulkinghorn with his usual equanimity. \"I will give you no further trouble about this little wager.\"\n\"You will do me the kindness to remember, sir, that I am not at present employed?\" says mademoiselle.\n\"Certainly!\"\n\"And to give me the favour of your recommendation?\"\n\"By all means, Mademoiselle Hortense.\"\n\"A word from Mr. Tulkinghorn is so powerful.\"\n\"It shall not be lacking, mademoiselle.\"\n\"You have my devoted gratitude, dear sir.\"\n\"Good night.\"\nMademoiselle goes out; and Mr. Bucket shows her downstairs.\n\"Well, Bucket?\" says Mr. Tulkinghorn on his return.\n\"There an't a doubt that it was the other one with this one's dress on. The boy was exact respecting colours and everything. Mr. Snagsby, I promised you that he should be sent away all right!\"\n\"You have kept your word, sir,\" returns the stationer; \"and if I can be of no further use, Mr. Tulkinghorn, I think, as my little woman will be getting anxious-\"\n\"Thank you, Snagsby,\" says Mr. Tulkinghorn. \"I am indebted to you for the trouble you have taken.\"\n\"Not at all, sir. I wish you good night.\"\n\"You see, Mr. Snagsby,\" says Mr. Bucket, accompanying him to the door and shaking hands with him, \"what I like in you is that when you know you have done a right thing, you put it away, and there's an end of it. That's what you do.\"\n\"That is certainly what I try to do, sir,\" returns Mr. Snagsby.\n\"No, you don't do yourself justice. It an't what you try to do,\" says Mr. Bucket, still shaking hands, \"it's what you do.\"\nMr. Snagsby makes a suitable response and goes homeward so confused by the events of the evening that he is doubtful of his being awake - doubtful of the reality of the streets through which he goes. He is presently reassured by the unchallengeable reality of Mrs. Snagsby, sitting up with her head in a perfect beehive of curl-papers and night-cap. She has dispatched Guster to the police-station to tell them her husband has been made away with, and within the last two hours has passed through every stage of swooning. But as the little woman feelingly says, many thanks she gets for it!",
        "paragraph_chars": [
            [
                0,
                211
            ],
            [
                211,
                824
            ],
            [
                824,
                1264
            ],
            [
                1264,
                1494
            ],
            [
                1494,
                1564
            ],
            [
                1564,
                1688
            ],
            [
                1688,
                1809
            ],
            [
                1809,
                2031
            ],
            [
                2031,
                2193
            ],
            [
                2193,
                2260
            ],
            [
                2260,
                2467
            ],
            [
                2467,
                2495
            ],
            [
                2495,
                2613
            ],
            [
                2613,
                2729
            ],
            [
                2729,
                2978
            ],
            [
                2978,
                3524
            ],
            [
                3524,
                3602
            ],
            [
                3602,
                3724
            ],
            [
                3724,
                3858
            ],
            [
                3858,
                4089
            ],
            [
                4089,
                4167
            ],
            [
                4167,
                4222
            ],
            [
                4222,
                4365
            ],
            [
                4365,
                4414
            ],
            [
                4414,
                4741
            ],
            [
                4741,
                4801
            ],
            [
                4801,
                4981
            ],
            [
                4981,
                5097
            ],
            [
                5097,
                5266
            ],
            [
                5266,
                5309
            ],
            [
                5309,
                5609
            ],
            [
                5609,
                5633
            ],
            [
                5633,
                5800
            ],
            [
                5800,
                5835
            ],
            [
                5835,
                6090
            ],
            [
                6090,
                6130
            ],
            [
                6130,
                6207
            ],
            [
                6207,
                6287
            ],
            [
                6287,
                6429
            ],
            [
                6429,
                6473
            ],
            [
                6473,
                6694
            ],
            [
                6694,
                7010
            ],
            [
                7010,
                7492
            ],
            [
                7492,
                8128
            ],
            [
                8128,
                8298
            ],
            [
                8298,
                8464
            ],
            [
                8464,
                8525
            ],
            [
                8525,
                8704
            ],
            [
                8704,
                9148
            ],
            [
                9148,
                9407
            ],
            [
                9407,
                9587
            ],
            [
                9587,
                9650
            ],
            [
                9650,
                9669
            ],
            [
                9669,
                9681
            ],
            [
                9681,
                9736
            ],
            [
                9736,
                9775
            ],
            [
                9775,
                9799
            ],
            [
                9799,
                9918
            ],
            [
                9918,
                10037
            ],
            [
                10037,
                10121
            ],
            [
                10121,
                10455
            ],
            [
                10455,
                10585
            ],
            [
                10585,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10728
            ],
            [
                10728,
                10806
            ],
            [
                10806,
                10862
            ],
            [
                10862,
                10937
            ],
            [
                10937,
                11044
            ],
            [
                11044,
                11160
            ],
            [
                11160,
                11222
            ],
            [
                11222,
                11631
            ],
            [
                11631,
                11722
            ],
            [
                11722,
                12236
            ],
            [
                12236,
                12432
            ],
            [
                12432,
                12702
            ],
            [
                12702,
                12907
            ],
            [
                12907,
                12938
            ],
            [
                12938,
                13234
            ],
            [
                13234,
                13355
            ],
            [
                13355,
                13839
            ],
            [
                13839,
                14208
            ],
            [
                14208,
                14449
            ],
            [
                14449,
                14644
            ],
            [
                14644,
                14758
            ],
            [
                14758,
                14792
            ],
            [
                14792,
                14818
            ],
            [
                14818,
                14825
            ],
            [
                14825,
                14837
            ],
            [
                14837,
                14965
            ],
            [
                14965,
                15030
            ],
            [
                15030,
                15103
            ],
            [
                15103,
                15190
            ],
            [
                15190,
                15319
            ],
            [
                15319,
                15373
            ],
            [
                15373,
                15538
            ],
            [
                15538,
                15609
            ],
            [
                15609,
                15668
            ],
            [
                15668,
                15734
            ],
            [
                15734,
                15834
            ],
            [
                15834,
                15861
            ],
            [
                15861,
                15985
            ],
            [
                15985,
                16029
            ],
            [
                16029,
                16114
            ],
            [
                16114,
                16435
            ],
            [
                16435,
                16729
            ],
            [
                16729,
                16882
            ],
            [
                16882,
                17028
            ],
            [
                17028,
                17130
            ],
            [
                17130,
                17143
            ],
            [
                17143,
                17195
            ],
            [
                17195,
                17234
            ],
            [
                17234,
                17280
            ],
            [
                17280,
                17321
            ],
            [
                17321,
                17364
            ],
            [
                17364,
                17378
            ],
            [
                17378,
                17438
            ],
            [
                17438,
                17490
            ],
            [
                17490,
                17683
            ],
            [
                17683,
                17845
            ],
            [
                17845,
                17944
            ],
            [
                17944,
                17986
            ],
            [
                17986,
                18219
            ],
            [
                18219,
                18283
            ],
            [
                18283,
                18406
            ],
            [
                18406,
                18996
            ]
        ],
        "segment_chars": [
            [
                0,
                90
            ],
            [
                90,
                185
            ],
            [
                185,
                211
            ],
            [
                211,
                349
            ],
            [
                349,
                437
            ],
            [
                437,
                542
            ],
            [
                542,
                824
            ],
            [
                824,
                883
            ],
            [
                883,
                982
            ],
            [
                982,
                1264
            ],
            [
                1264,
                1306
            ],
            [
                1306,
                1494
            ],
            [
                1494,
                1564
            ],
            [
                1564,
                1688
            ],
            [
                1688,
                1723
            ],
            [
                1723,
                1809
            ],
            [
                1809,
                1845
            ],
            [
                1845,
                1936
            ],
            [
                1936,
                2031
            ],
            [
                2031,
                2147
            ],
            [
                2147,
                2193
            ],
            [
                2193,
                2238
            ],
            [
                2238,
                2260
            ],
            [
                2260,
                2271
            ],
            [
                2271,
                2379
            ],
            [
                2379,
                2467
            ],
            [
                2467,
                2495
            ],
            [
                2495,
                2575
            ],
            [
                2575,
                2613
            ],
            [
                2613,
                2637
            ],
            [
                2637,
                2688
            ],
            [
                2688,
                2729
            ],
            [
                2729,
                2751
            ],
            [
                2751,
                2825
            ],
            [
                2825,
                2978
            ],
            [
                2978,
                3175
            ],
            [
                3175,
                3270
            ],
            [
                3270,
                3373
            ],
            [
                3373,
                3449
            ],
            [
                3449,
                3524
            ],
            [
                3524,
                3575
            ],
            [
                3575,
                3602
            ],
            [
                3602,
                3621
            ],
            [
                3621,
                3724
            ],
            [
                3724,
                3824
            ],
            [
                3824,
                3858
            ],
            [
                3858,
                3881
            ],
            [
                3881,
                4014
            ],
            [
                4014,
                4089
            ],
            [
                4089,
                4167
            ],
            [
                4167,
                4188
            ],
            [
                4188,
                4222
            ],
            [
                4222,
                4365
            ],
            [
                4365,
                4414
            ],
            [
                4414,
                4469
            ],
            [
                4469,
                4489
            ],
            [
                4489,
                4602
            ],
            [
                4602,
                4631
            ],
            [
                4631,
                4704
            ],
            [
                4704,
                4741
            ],
            [
                4741,
                4771
            ],
            [
                4771,
                4801
            ],
            [
                4801,
                4909
            ],
            [
                4909,
                4981
            ],
            [
                4981,
                5097
            ],
            [
                5097,
                5143
            ],
            [
                5143,
                5258
            ],
            [
                5258,
                5266
            ],
            [
                5266,
                5309
            ],
            [
                5309,
                5609
            ],
            [
                5609,
                5615
            ],
            [
                5615,
                5633
            ],
            [
                5633,
                5800
            ],
            [
                5800,
                5835
            ],
            [
                5835,
                6045
            ],
            [
                6045,
                6090
            ],
            [
                6090,
                6130
            ],
            [
                6130,
                6207
            ],
            [
                6207,
                6287
            ],
            [
                6287,
                6368
            ],
            [
                6368,
                6429
            ],
            [
                6429,
                6466
            ],
            [
                6466,
                6473
            ],
            [
                6473,
                6694
            ],
            [
                6694,
                7010
            ],
            [
                7010,
                7259
            ],
            [
                7259,
                7492
            ],
            [
                7492,
                7678
            ],
            [
                7678,
                7936
            ],
            [
                7936,
                8128
            ],
            [
                8128,
                8257
            ],
            [
                8257,
                8298
            ],
            [
                8298,
                8464
            ],
            [
                8464,
                8501
            ],
            [
                8501,
                8525
            ],
            [
                8525,
                8662
            ],
            [
                8662,
                8704
            ],
            [
                8704,
                8758
            ],
            [
                8758,
                8890
            ],
            [
                8890,
                8937
            ],
            [
                8937,
                8988
            ],
            [
                8988,
                9051
            ],
            [
                9051,
                9148
            ],
            [
                9148,
                9275
            ],
            [
                9275,
                9407
            ],
            [
                9407,
                9443
            ],
            [
                9443,
                9514
            ],
            [
                9514,
                9536
            ],
            [
                9536,
                9551
            ],
            [
                9551,
                9587
            ],
            [
                9587,
                9625
            ],
            [
                9625,
                9650
            ],
            [
                9650,
                9669
            ],
            [
                9669,
                9681
            ],
            [
                9681,
                9707
            ],
            [
                9707,
                9736
            ],
            [
                9736,
                9746
            ],
            [
                9746,
                9775
            ],
            [
                9775,
                9799
            ],
            [
                9799,
                9824
            ],
            [
                9824,
                9918
            ],
            [
                9918,
                10037
            ],
            [
                10037,
                10086
            ],
            [
                10086,
                10121
            ],
            [
                10121,
                10232
            ],
            [
                10232,
                10277
            ],
            [
                10277,
                10320
            ],
            [
                10320,
                10398
            ],
            [
                10398,
                10455
            ],
            [
                10455,
                10491
            ],
            [
                10491,
                10504
            ],
            [
                10504,
                10544
            ],
            [
                10544,
                10585
            ],
            [
                10585,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10667
            ],
            [
                10667,
                10728
            ],
            [
                10728,
                10806
            ],
            [
                10806,
                10862
            ],
            [
                10862,
                10882
            ],
            [
                10882,
                10911
            ],
            [
                10911,
                10923
            ],
            [
                10923,
                10937
            ],
            [
                10937,
                11044
            ],
            [
                11044,
                11077
            ],
            [
                11077,
                11160
            ],
            [
                11160,
                11205
            ],
            [
                11205,
                11222
            ],
            [
                11222,
                11346
            ],
            [
                11346,
                11370
            ],
            [
                11370,
                11435
            ],
            [
                11435,
                11470
            ],
            [
                11470,
                11543
            ],
            [
                11543,
                11631
            ],
            [
                11631,
                11722
            ],
            [
                11722,
                11774
            ],
            [
                11774,
                11886
            ],
            [
                11886,
                12006
            ],
            [
                12006,
                12236
            ],
            [
                12236,
                12252
            ],
            [
                12252,
                12264
            ],
            [
                12264,
                12310
            ],
            [
                12310,
                12432
            ],
            [
                12432,
                12546
            ],
            [
                12546,
                12654
            ],
            [
                12654,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12894
            ],
            [
                12894,
                12907
            ],
            [
                12907,
                12938
            ],
            [
                12938,
                13068
            ],
            [
                13068,
                13234
            ],
            [
                13234,
                13317
            ],
            [
                13317,
                13355
            ],
            [
                13355,
                13532
            ],
            [
                13532,
                13594
            ],
            [
                13594,
                13748
            ],
            [
                13748,
                13839
            ],
            [
                13839,
                14066
            ],
            [
                14066,
                14208
            ],
            [
                14208,
                14344
            ],
            [
                14344,
                14401
            ],
            [
                14401,
                14449
            ],
            [
                14449,
                14549
            ],
            [
                14549,
                14644
            ],
            [
                14644,
                14758
            ],
            [
                14758,
                14779
            ],
            [
                14779,
                14792
            ],
            [
                14792,
                14808
            ],
            [
                14808,
                14818
            ],
            [
                14818,
                14825
            ],
            [
                14825,
                14837
            ],
            [
                14837,
                14935
            ],
            [
                14935,
                14965
            ],
            [
                14965,
                15030
            ],
            [
                15030,
                15103
            ],
            [
                15103,
                15176
            ],
            [
                15176,
                15190
            ],
            [
                15190,
                15319
            ],
            [
                15319,
                15360
            ],
            [
                15360,
                15373
            ],
            [
                15373,
                15478
            ],
            [
                15478,
                15538
            ],
            [
                15538,
                15558
            ],
            [
                15558,
                15586
            ],
            [
                15586,
                15609
            ],
            [
                15609,
                15629
            ],
            [
                15629,
                15668
            ],
            [
                15668,
                15734
            ],
            [
                15734,
                15797
            ],
            [
                15797,
                15834
            ],
            [
                15834,
                15861
            ],
            [
                15861,
                15880
            ],
            [
                15880,
                15906
            ],
            [
                15906,
                15960
            ],
            [
                15960,
                15985
            ],
            [
                15985,
                16016
            ],
            [
                16016,
                16029
            ],
            [
                16029,
                16114
            ],
            [
                16114,
                16208
            ],
            [
                16208,
                16235
            ],
            [
                16235,
                16291
            ],
            [
                16291,
                16435
            ],
            [
                16435,
                16443
            ],
            [
                16443,
                16498
            ],
            [
                16498,
                16538
            ],
            [
                16538,
                16604
            ],
            [
                16604,
                16729
            ],
            [
                16729,
                16882
            ],
            [
                16882,
                16966
            ],
            [
                16966,
                17028
            ],
            [
                17028,
                17111
            ],
            [
                17111,
                17130
            ],
            [
                17130,
                17143
            ],
            [
                17143,
                17195
            ],
            [
                17195,
                17234
            ],
            [
                17234,
                17280
            ],
            [
                17280,
                17321
            ],
            [
                17321,
                17364
            ],
            [
                17364,
                17378
            ],
            [
                17378,
                17438
            ],
            [
                17438,
                17454
            ],
            [
                17454,
                17490
            ],
            [
                17490,
                17562
            ],
            [
                17562,
                17615
            ],
            [
                17615,
                17683
            ],
            [
                17683,
                17845
            ],
            [
                17845,
                17889
            ],
            [
                17889,
                17944
            ],
            [
                17944,
                17962
            ],
            [
                17962,
                17986
            ],
            [
                17986,
                18198
            ],
            [
                18198,
                18219
            ],
            [
                18219,
                18283
            ],
            [
                18283,
                18319
            ],
            [
                18319,
                18406
            ],
            [
                18406,
                18606
            ],
            [
                18606,
                18756
            ],
            [
                18756,
                18928
            ],
            [
                18928,
                18996
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                25,
                44
            ],
            [
                45,
                48
            ],
            [
                49,
                88
            ],
            [
                88,
                90
            ],
            [
                90,
                116
            ],
            [
                121,
                185
            ],
            [
                185,
                210
            ],
            [
                211,
                217
            ],
            [
                229,
                237
            ],
            [
                246,
                249
            ],
            [
                257,
                259
            ],
            [
                268,
                349
            ],
            [
                349,
                437
            ],
            [
                437,
                542
            ],
            [
                542,
                590
            ],
            [
                596,
                678
            ],
            [
                679,
                684
            ],
            [
                685,
                689
            ],
            [
                695,
                741
            ],
            [
                748,
                763
            ],
            [
                764,
                824
            ],
            [
                824,
                864
            ],
            [
                864,
                883
            ],
            [
                883,
                982
            ],
            [
                982,
                1006
            ],
            [
                1007,
                1011
            ],
            [
                1015,
                1234
            ],
            [
                1235,
                1236
            ],
            [
                1237,
                1253
            ],
            [
                1262,
                1264
            ],
            [
                1264,
                1296
            ],
            [
                1304,
                1306
            ],
            [
                1306,
                1362
            ],
            [
                1363,
                1408
            ],
            [
                1409,
                1494
            ],
            [
                1494,
                1533
            ],
            [
                1533,
                1564
            ],
            [
                1564,
                1565
            ],
            [
                1565,
                1566
            ],
            [
                1577,
                1582
            ],
            [
                1584,
                1602
            ],
            [
                1603,
                1671
            ],
            [
                1674,
                1678
            ],
            [
                1688,
                1703
            ],
            [
                1709,
                1712
            ],
            [
                1713,
                1721
            ],
            [
                1721,
                1723
            ],
            [
                1725,
                1783
            ],
            [
                1790,
                1806
            ],
            [
                1806,
                1809
            ],
            [
                1809,
                1845
            ],
            [
                1845,
                1876
            ],
            [
                1877,
                1936
            ],
            [
                1936,
                1952
            ],
            [
                1952,
                2006
            ],
            [
                2013,
                2031
            ],
            [
                2031,
                2093
            ],
            [
                2096,
                2131
            ],
            [
                2134,
                2147
            ],
            [
                2147,
                2193
            ],
            [
                2193,
                2235
            ],
            [
                2235,
                2238
            ],
            [
                2238,
                2259
            ],
            [
                2260,
                2269
            ],
            [
                2269,
                2271
            ],
            [
                2271,
                2303
            ],
            [
                2304,
                2317
            ],
            [
                2317,
                2352
            ],
            [
                2353,
                2359
            ],
            [
                2360,
                2368
            ],
            [
                2369,
                2379
            ],
            [
                2379,
                2456
            ],
            [
                2464,
                2467
            ],
            [
                2467,
                2495
            ],
            [
                2495,
                2575
            ],
            [
                2575,
                2613
            ],
            [
                2613,
                2635
            ],
            [
                2637,
                2688
            ],
            [
                2690,
                2703
            ],
            [
                2710,
                2729
            ],
            [
                2729,
                2750
            ],
            [
                2751,
                2803
            ],
            [
                2804,
                2825
            ],
            [
                2825,
                2978
            ],
            [
                2978,
                3018
            ],
            [
                3031,
                3135
            ],
            [
                3136,
                3147
            ],
            [
                3152,
                3159
            ],
            [
                3160,
                3167
            ],
            [
                3168,
                3173
            ],
            [
                3173,
                3175
            ],
            [
                3175,
                3185
            ],
            [
                3195,
                3268
            ],
            [
                3268,
                3270
            ],
            [
                3270,
                3313
            ],
            [
                3314,
                3340
            ],
            [
                3340,
                3373
            ],
            [
                3373,
                3422
            ],
            [
                3423,
                3430
            ],
            [
                3435,
                3447
            ],
            [
                3447,
                3449
            ],
            [
                3449,
                3486
            ],
            [
                3487,
                3524
            ],
            [
                3524,
                3573
            ],
            [
                3573,
                3575
            ],
            [
                3575,
                3602
            ],
            [
                3602,
                3621
            ],
            [
                3621,
                3724
            ],
            [
                3724,
                3784
            ],
            [
                3785,
                3824
            ],
            [
                3824,
                3858
            ],
            [
                3858,
                3881
            ],
            [
                3881,
                3956
            ],
            [
                3957,
                3965
            ],
            [
                3966,
                3994
            ],
            [
                3995,
                4012
            ],
            [
                4012,
                4014
            ],
            [
                4014,
                4089
            ],
            [
                4089,
                4167
            ],
            [
                4167,
                4188
            ],
            [
                4188,
                4209
            ],
            [
                4220,
                4222
            ],
            [
                4222,
                4241
            ],
            [
                4242,
                4344
            ],
            [
                4345,
                4365
            ],
            [
                4368,
                4379
            ],
            [
                4389,
                4397
            ],
            [
                4404,
                4414
            ],
            [
                4414,
                4455
            ],
            [
                4456,
                4460
            ],
            [
                4467,
                4469
            ],
            [
                4469,
                4489
            ],
            [
                4489,
                4545
            ],
            [
                4545,
                4602
            ],
            [
                4602,
                4631
            ],
            [
                4631,
                4704
            ],
            [
                4704,
                4738
            ],
            [
                4738,
                4741
            ],
            [
                4741,
                4771
            ],
            [
                4771,
                4788
            ],
            [
                4788,
                4789
            ],
            [
                4790,
                4799
            ],
            [
                4799,
                4800
            ],
            [
                4802,
                4859
            ],
            [
                4860,
                4870
            ],
            [
                4870,
                4909
            ],
            [
                4909,
                4935
            ],
            [
                4935,
                4978
            ],
            [
                4981,
                5094
            ],
            [
                5097,
                5143
            ],
            [
                5143,
                5191
            ],
            [
                5192,
                5201
            ],
            [
                5202,
                5217
            ],
            [
                5218,
                5258
            ],
            [
                5258,
                5266
            ],
            [
                5266,
                5309
            ],
            [
                5309,
                5423
            ],
            [
                5423,
                5609
            ],
            [
                5609,
                5615
            ],
            [
                5615,
                5631
            ],
            [
                5631,
                5633
            ],
            [
                5633,
                5670
            ],
            [
                5671,
                5721
            ],
            [
                5722,
                5797
            ],
            [
                5800,
                5833
            ],
            [
                5833,
                5835
            ],
            [
                5836,
                5889
            ],
            [
                5890,
                6001
            ],
            [
                6002,
                6036
            ],
            [
                6043,
                6045
            ],
            [
                6045,
                6051
            ],
            [
                6052,
                6056
            ],
            [
                6066,
                6090
            ],
            [
                6090,
                6109
            ],
            [
                6109,
                6130
            ],
            [
                6130,
                6176
            ],
            [
                6176,
                6207
            ],
            [
                6207,
                6233
            ],
            [
                6234,
                6287
            ],
            [
                6287,
                6314
            ],
            [
                6315,
                6368
            ],
            [
                6368,
                6429
            ],
            [
                6429,
                6464
            ],
            [
                6464,
                6466
            ],
            [
                6467,
                6473
            ],
            [
                6473,
                6691
            ],
            [
                6691,
                6694
            ],
            [
                6694,
                6734
            ],
            [
                6735,
                6885
            ],
            [
                6886,
                6936
            ],
            [
                6937,
                6976
            ],
            [
                6977,
                6984
            ],
            [
                6985,
                7009
            ],
            [
                7010,
                7259
            ],
            [
                7259,
                7353
            ],
            [
                7354,
                7368
            ],
            [
                7368,
                7491
            ],
            [
                7492,
                7609
            ],
            [
                7618,
                7676
            ],
            [
                7676,
                7678
            ],
            [
                7678,
                7808
            ],
            [
                7810,
                7813
            ],
            [
                7822,
                7936
            ],
            [
                7936,
                8098
            ],
            [
                8099,
                8128
            ],
            [
                8128,
                8195
            ],
            [
                8203,
                8205
            ],
            [
                8214,
                8257
            ],
            [
                8257,
                8298
            ],
            [
                8298,
                8337
            ],
            [
                8338,
                8404
            ],
            [
                8410,
                8462
            ],
            [
                8462,
                8464
            ],
            [
                8464,
                8501
            ],
            [
                8501,
                8523
            ],
            [
                8523,
                8525
            ],
            [
                8525,
                8543
            ],
            [
                8544,
                8547
            ],
            [
                8548,
                8662
            ],
            [
                8664,
                8673
            ],
            [
                8674,
                8688
            ],
            [
                8692,
                8702
            ],
            [
                8702,
                8704
            ],
            [
                8712,
                8714
            ],
            [
                8715,
                8758
            ],
            [
                8760,
                8769
            ],
            [
                8770,
                8772
            ],
            [
                8779,
                8890
            ],
            [
                8890,
                8911
            ],
            [
                8916,
                8937
            ],
            [
                8937,
                8988
            ],
            [
                8988,
                8996
            ],
            [
                9007,
                9044
            ],
            [
                9049,
                9051
            ],
            [
                9051,
                9070
            ],
            [
                9071,
                9074
            ],
            [
                9081,
                9086
            ],
            [
                9087,
                9091
            ],
            [
                9092,
                9094
            ],
            [
                9095,
                9106
            ],
            [
                9112,
                9129
            ],
            [
                9130,
                9148
            ],
            [
                9148,
                9241
            ],
            [
                9242,
                9260
            ],
            [
                9264,
                9275
            ],
            [
                9275,
                9304
            ],
            [
                9310,
                9400
            ],
            [
                9405,
                9407
            ],
            [
                9407,
                9432
            ],
            [
                9440,
                9443
            ],
            [
                9443,
                9504
            ],
            [
                9512,
                9514
            ],
            [
                9514,
                9536
            ],
            [
                9536,
                9551
            ],
            [
                9551,
                9587
            ],
            [
                9587,
                9625
            ],
            [
                9625,
                9650
            ],
            [
                9650,
                9669
            ],
            [
                9669,
                9681
            ],
            [
                9681,
                9707
            ],
            [
                9707,
                9736
            ],
            [
                9736,
                9746
            ],
            [
                9746,
                9775
            ],
            [
                9775,
                9799
            ],
            [
                9799,
                9824
            ],
            [
                9824,
                9839
            ],
            [
                9845,
                9918
            ],
            [
                9918,
                9989
            ],
            [
                9998,
                10037
            ],
            [
                10037,
                10086
            ],
            [
                10086,
                10121
            ],
            [
                10121,
                10129
            ],
            [
                10130,
                10168
            ],
            [
                10177,
                10232
            ],
            [
                10232,
                10235
            ],
            [
                10236,
                10248
            ],
            [
                10249,
                10277
            ],
            [
                10277,
                10312
            ],
            [
                10313,
                10320
            ],
            [
                10320,
                10398
            ],
            [
                10398,
                10448
            ],
            [
                10453,
                10455
            ],
            [
                10455,
                10456
            ],
            [
                10456,
                10464
            ],
            [
                10468,
                10491
            ],
            [
                10491,
                10504
            ],
            [
                10504,
                10544
            ],
            [
                10544,
                10583
            ],
            [
                10583,
                10585
            ],
            [
                10585,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10666
            ],
            [
                10667,
                10682
            ],
            [
                10683,
                10694
            ],
            [
                10695,
                10728
            ],
            [
                10728,
                10806
            ],
            [
                10806,
                10862
            ],
            [
                10862,
                10882
            ],
            [
                10882,
                10911
            ],
            [
                10911,
                10923
            ],
            [
                10923,
                10934
            ],
            [
                10937,
                11044
            ],
            [
                11044,
                11053
            ],
            [
                11053,
                11076
            ],
            [
                11078,
                11152
            ],
            [
                11153,
                11160
            ],
            [
                11160,
                11165
            ],
            [
                11177,
                11202
            ],
            [
                11205,
                11220
            ],
            [
                11220,
                11221
            ],
            [
                11223,
                11295
            ],
            [
                11344,
                11346
            ],
            [
                11347,
                11370
            ],
            [
                11370,
                11405
            ],
            [
                11405,
                11406
            ],
            [
                11407,
                11435
            ],
            [
                11435,
                11470
            ],
            [
                11470,
                11543
            ],
            [
                11543,
                11569
            ],
            [
                11589,
                11602
            ],
            [
                11602,
                11631
            ],
            [
                11631,
                11719
            ],
            [
                11719,
                11722
            ],
            [
                11722,
                11774
            ],
            [
                11774,
                11819
            ],
            [
                11820,
                11823
            ],
            [
                11828,
                11853
            ],
            [
                11854,
                11886
            ],
            [
                11886,
                12006
            ],
            [
                12006,
                12036
            ],
            [
                12036,
                12095
            ],
            [
                12096,
                12098
            ],
            [
                12105,
                12127
            ],
            [
                12128,
                12233
            ],
            [
                12233,
                12236
            ],
            [
                12236,
                12252
            ],
            [
                12252,
                12264
            ],
            [
                12264,
                12309
            ],
            [
                12310,
                12326
            ],
            [
                12333,
                12386
            ],
            [
                12387,
                12432
            ],
            [
                12432,
                12512
            ],
            [
                12521,
                12544
            ],
            [
                12544,
                12546
            ],
            [
                12546,
                12556
            ],
            [
                12589,
                12590
            ],
            [
                12595,
                12654
            ],
            [
                12654,
                12680
            ],
            [
                12681,
                12702
            ],
            [
                12702,
                12781
            ],
            [
                12789,
                12791
            ],
            [
                12791,
                12801
            ],
            [
                12809,
                12894
            ],
            [
                12894,
                12907
            ],
            [
                12907,
                12938
            ],
            [
                12938,
                12975
            ],
            [
                12975,
                13068
            ],
            [
                13068,
                13089
            ],
            [
                13099,
                13102
            ],
            [
                13102,
                13201
            ],
            [
                13201,
                13232
            ],
            [
                13232,
                13234
            ],
            [
                13234,
                13317
            ],
            [
                13317,
                13346
            ],
            [
                13352,
                13355
            ],
            [
                13355,
                13426
            ],
            [
                13436,
                13482
            ],
            [
                13495,
                13532
            ],
            [
                13532,
                13592
            ],
            [
                13592,
                13594
            ],
            [
                13594,
                13639
            ],
            [
                13640,
                13683
            ],
            [
                13698,
                13748
            ],
            [
                13748,
                13839
            ],
            [
                13839,
                13952
            ],
            [
                13953,
                13982
            ],
            [
                13986,
                14005
            ],
            [
                14006,
                14044
            ],
            [
                14045,
                14066
            ],
            [
                14066,
                14180
            ],
            [
                14181,
                14208
            ],
            [
                14208,
                14237
            ],
            [
                14243,
                14267
            ],
            [
                14269,
                14308
            ],
            [
                14309,
                14344
            ],
            [
                14347,
                14401
            ],
            [
                14401,
                14449
            ],
            [
                14449,
                14547
            ],
            [
                14547,
                14549
            ],
            [
                14549,
                14625
            ],
            [
                14637,
                14644
            ],
            [
                14644,
                14696
            ],
            [
                14696,
                14697
            ],
            [
                14703,
                14758
            ],
            [
                14758,
                14779
            ],
            [
                14779,
                14790
            ],
            [
                14790,
                14792
            ],
            [
                14792,
                14808
            ],
            [
                14808,
                14818
            ],
            [
                14818,
                14825
            ],
            [
                14825,
                14837
            ],
            [
                14837,
                14935
            ],
            [
                14935,
                14964
            ],
            [
                14965,
                14992
            ],
            [
                14992,
                15030
            ],
            [
                15030,
                15103
            ],
            [
                15103,
                15133
            ],
            [
                15133,
                15160
            ],
            [
                15171,
                15176
            ],
            [
                15176,
                15190
            ],
            [
                15190,
                15319
            ],
            [
                15319,
                15360
            ],
            [
                15360,
                15373
            ],
            [
                15373,
                15476
            ],
            [
                15476,
                15477
            ],
            [
                15478,
                15538
            ],
            [
                15538,
                15558
            ],
            [
                15558,
                15586
            ],
            [
                15586,
                15609
            ],
            [
                15609,
                15614
            ],
            [
                15618,
                15621
            ],
            [
                15626,
                15629
            ],
            [
                15629,
                15666
            ],
            [
                15666,
                15668
            ],
            [
                15668,
                15692
            ],
            [
                15697,
                15711
            ],
            [
                15712,
                15734
            ],
            [
                15734,
                15797
            ],
            [
                15797,
                15834
            ],
            [
                15834,
                15861
            ],
            [
                15861,
                15880
            ],
            [
                15880,
                15906
            ],
            [
                15906,
                15960
            ],
            [
                15960,
                15966
            ],
            [
                15967,
                15985
            ],
            [
                15985,
                16016
            ],
            [
                16016,
                16029
            ],
            [
                16029,
                16042
            ],
            [
                16046,
                16053
            ],
            [
                16053,
                16114
            ],
            [
                16114,
                16151
            ],
            [
                16151,
                16208
            ],
            [
                16208,
                16235
            ],
            [
                16235,
                16291
            ],
            [
                16291,
                16396
            ],
            [
                16397,
                16435
            ],
            [
                16435,
                16443
            ],
            [
                16443,
                16458
            ],
            [
                16458,
                16498
            ],
            [
                16505,
                16538
            ],
            [
                16538,
                16604
            ],
            [
                16604,
                16610
            ],
            [
                16611,
                16615
            ],
            [
                16616,
                16625
            ],
            [
                16626,
                16663
            ],
            [
                16663,
                16684
            ],
            [
                16699,
                16728
            ],
            [
                16729,
                16800
            ],
            [
                16801,
                16863
            ],
            [
                16880,
                16882
            ],
            [
                16882,
                16966
            ],
            [
                16966,
                17028
            ],
            [
                17028,
                17099
            ],
            [
                17108,
                17111
            ],
            [
                17111,
                17130
            ],
            [
                17130,
                17140
            ],
            [
                17140,
                17143
            ],
            [
                17143,
                17150
            ],
            [
                17156,
                17177
            ],
            [
                17178,
                17195
            ],
            [
                17195,
                17234
            ],
            [
                17234,
                17280
            ],
            [
                17280,
                17296
            ],
            [
                17304,
                17321
            ],
            [
                17321,
                17322
            ],
            [
                17331,
                17364
            ],
            [
                17364,
                17378
            ],
            [
                17378,
                17399
            ],
            [
                17399,
                17415
            ],
            [
                17416,
                17436
            ],
            [
                17436,
                17438
            ],
            [
                17438,
                17454
            ],
            [
                17459,
                17490
            ],
            [
                17491,
                17562
            ],
            [
                17562,
                17615
            ],
            [
                17615,
                17642
            ],
            [
                17643,
                17680
            ],
            [
                17683,
                17842
            ],
            [
                17845,
                17864
            ],
            [
                17864,
                17889
            ],
            [
                17889,
                17894
            ],
            [
                17895,
                17941
            ],
            [
                17941,
                17944
            ],
            [
                17944,
                17962
            ],
            [
                17962,
                17986
            ],
            [
                17986,
                18082
            ],
            [
                18082,
                18111
            ],
            [
                18112,
                18175
            ],
            [
                18176,
                18198
            ],
            [
                18198,
                18219
            ],
            [
                18219,
                18244
            ],
            [
                18249,
                18283
            ],
            [
                18283,
                18319
            ],
            [
                18319,
                18335
            ],
            [
                18340,
                18364
            ],
            [
                18371,
                18384
            ],
            [
                18384,
                18403
            ],
            [
                18406,
                18541
            ],
            [
                18553,
                18604
            ],
            [
                18604,
                18606
            ],
            [
                18606,
                18631
            ],
            [
                18632,
                18754
            ],
            [
                18760,
                18803
            ],
            [
                18817,
                18828
            ],
            [
                18838,
                18857
            ],
            [
                18858,
                18926
            ],
            [
                18926,
                18928
            ],
            [
                18928,
                18996
            ]
        ],
        "row_chars": [
            [
                0,
                90
            ],
            [
                90,
                90
            ],
            [
                90,
                90
            ],
            [
                90,
                185
            ],
            [
                185,
                211
            ],
            [
                211,
                211
            ],
            [
                211,
                349
            ],
            [
                349,
                437
            ],
            [
                437,
                542
            ],
            [
                542,
                824
            ],
            [
                824,
                883
            ],
            [
                883,
                982
            ],
            [
                982,
                1264
            ],
            [
                1264,
                1306
            ],
            [
                1306,
                1494
            ],
            [
                1494,
                1564
            ],
            [
                1564,
                1564
            ],
            [
                1564,
                1564
            ],
            [
                1564,
                1688
            ],
            [
                1688,
                1723
            ],
            [
                1723,
                1809
            ],
            [
                1809,
                1845
            ],
            [
                1845,
                1936
            ],
            [
                1936,
                2031
            ],
            [
                2031,
                2147
            ],
            [
                2147,
                2147
            ],
            [
                2147,
                2147
            ],
            [
                2147,
                2147
            ],
            [
                2147,
                2193
            ],
            [
                2193,
                2193
            ],
            [
                2193,
                2238
            ],
            [
                2238,
                2260
            ],
            [
                2260,
                2260
            ],
            [
                2260,
                2271
            ],
            [
                2271,
                2379
            ],
            [
                2379,
                2379
            ],
            [
                2379,
                2379
            ],
            [
                2379,
                2467
            ],
            [
                2467,
                2467
            ],
            [
                2467,
                2495
            ],
            [
                2495,
                2575
            ],
            [
                2575,
                2613
            ],
            [
                2613,
                2613
            ],
            [
                2613,
                2637
            ],
            [
                2637,
                2637
            ],
            [
                2637,
                2637
            ],
            [
                2637,
                2637
            ],
            [
                2637,
                2637
            ],
            [
                2637,
                2688
            ],
            [
                2688,
                2729
            ],
            [
                2729,
                2751
            ],
            [
                2751,
                2825
            ],
            [
                2825,
                2978
            ],
            [
                2978,
                3175
            ],
            [
                3175,
                3270
            ],
            [
                3270,
                3373
            ],
            [
                3373,
                3449
            ],
            [
                3449,
                3524
            ],
            [
                3524,
                3575
            ],
            [
                3575,
                3602
            ],
            [
                3602,
                3621
            ],
            [
                3621,
                3724
            ],
            [
                3724,
                3824
            ],
            [
                3824,
                3858
            ],
            [
                3858,
                3881
            ],
            [
                3881,
                4014
            ],
            [
                4014,
                4089
            ],
            [
                4089,
                4167
            ],
            [
                4167,
                4188
            ],
            [
                4188,
                4222
            ],
            [
                4222,
                4365
            ],
            [
                4365,
                4414
            ],
            [
                4414,
                4469
            ],
            [
                4469,
                4489
            ],
            [
                4489,
                4489
            ],
            [
                4489,
                4602
            ],
            [
                4602,
                4631
            ],
            [
                4631,
                4704
            ],
            [
                4704,
                4741
            ],
            [
                4741,
                4771
            ],
            [
                4771,
                4801
            ],
            [
                4801,
                4801
            ],
            [
                4801,
                4909
            ],
            [
                4909,
                4981
            ],
            [
                4981,
                4981
            ],
            [
                4981,
                5097
            ],
            [
                5097,
                5143
            ],
            [
                5143,
                5258
            ],
            [
                5258,
                5258
            ],
            [
                5258,
                5266
            ],
            [
                5266,
                5309
            ],
            [
                5309,
                5609
            ],
            [
                5609,
                5615
            ],
            [
                5615,
                5633
            ],
            [
                5633,
                5800
            ],
            [
                5800,
                5800
            ],
            [
                5800,
                5835
            ],
            [
                5835,
                5835
            ],
            [
                5835,
                5835
            ],
            [
                5835,
                5835
            ],
            [
                5835,
                5835
            ],
            [
                5835,
                5835
            ],
            [
                5835,
                6045
            ],
            [
                6045,
                6090
            ],
            [
                6090,
                6130
            ],
            [
                6130,
                6207
            ],
            [
                6207,
                6287
            ],
            [
                6287,
                6368
            ],
            [
                6368,
                6429
            ],
            [
                6429,
                6466
            ],
            [
                6466,
                6473
            ],
            [
                6473,
                6694
            ],
            [
                6694,
                7010
            ],
            [
                7010,
                7259
            ],
            [
                7259,
                7492
            ],
            [
                7492,
                7492
            ],
            [
                7492,
                7678
            ],
            [
                7678,
                7936
            ],
            [
                7936,
                8128
            ],
            [
                8128,
                8257
            ],
            [
                8257,
                8298
            ],
            [
                8298,
                8464
            ],
            [
                8464,
                8501
            ],
            [
                8501,
                8525
            ],
            [
                8525,
                8662
            ],
            [
                8662,
                8704
            ],
            [
                8704,
                8758
            ],
            [
                8758,
                8890
            ],
            [
                8890,
                8937
            ],
            [
                8937,
                8937
            ],
            [
                8937,
                8988
            ],
            [
                8988,
                8988
            ],
            [
                8988,
                9051
            ],
            [
                9051,
                9148
            ],
            [
                9148,
                9275
            ],
            [
                9275,
                9407
            ],
            [
                9407,
                9443
            ],
            [
                9443,
                9514
            ],
            [
                9514,
                9536
            ],
            [
                9536,
                9551
            ],
            [
                9551,
                9551
            ],
            [
                9551,
                9587
            ],
            [
                9587,
                9625
            ],
            [
                9625,
                9650
            ],
            [
                9650,
                9669
            ],
            [
                9669,
                9681
            ],
            [
                9681,
                9707
            ],
            [
                9707,
                9736
            ],
            [
                9736,
                9746
            ],
            [
                9746,
                9775
            ],
            [
                9775,
                9775
            ],
            [
                9775,
                9775
            ],
            [
                9775,
                9799
            ],
            [
                9799,
                9824
            ],
            [
                9824,
                9918
            ],
            [
                9918,
                10037
            ],
            [
                10037,
                10086
            ],
            [
                10086,
                10121
            ],
            [
                10121,
                10232
            ],
            [
                10232,
                10277
            ],
            [
                10277,
                10320
            ],
            [
                10320,
                10398
            ],
            [
                10398,
                10455
            ],
            [
                10455,
                10491
            ],
            [
                10491,
                10504
            ],
            [
                10504,
                10544
            ],
            [
                10544,
                10585
            ],
            [
                10585,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10667
            ],
            [
                10667,
                10728
            ],
            [
                10728,
                10806
            ],
            [
                10806,
                10862
            ],
            [
                10862,
                10882
            ],
            [
                10882,
                10911
            ],
            [
                10911,
                10923
            ],
            [
                10923,
                10937
            ],
            [
                10937,
                10937
            ],
            [
                10937,
                11044
            ],
            [
                11044,
                11077
            ],
            [
                11077,
                11160
            ],
            [
                11160,
                11222
            ],
            [
                11222,
                11222
            ],
            [
                11222,
                11222
            ],
            [
                11222,
                11346
            ],
            [
                11346,
                11370
            ],
            [
                11370,
                11435
            ],
            [
                11435,
                11470
            ],
            [
                11470,
                11470
            ],
            [
                11470,
                11543
            ],
            [
                11543,
                11631
            ],
            [
                11631,
                11722
            ],
            [
                11722,
                11774
            ],
            [
                11774,
                11886
            ],
            [
                11886,
                12006
            ],
            [
                12006,
                12236
            ],
            [
                12236,
                12252
            ],
            [
                12252,
                12264
            ],
            [
                12264,
                12310
            ],
            [
                12310,
                12432
            ],
            [
                12432,
                12546
            ],
            [
                12546,
                12654
            ],
            [
                12654,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12894
            ],
            [
                12894,
                12907
            ],
            [
                12907,
                12938
            ],
            [
                12938,
                13068
            ],
            [
                13068,
                13234
            ],
            [
                13234,
                13317
            ],
            [
                13317,
                13355
            ],
            [
                13355,
                13532
            ],
            [
                13532,
                13594
            ],
            [
                13594,
                13748
            ],
            [
                13748,
                13839
            ],
            [
                13839,
                14066
            ],
            [
                14066,
                14208
            ],
            [
                14208,
                14344
            ],
            [
                14344,
                14401
            ],
            [
                14401,
                14449
            ],
            [
                14449,
                14549
            ],
            [
                14549,
                14644
            ],
            [
                14644,
                14758
            ],
            [
                14758,
                14779
            ],
            [
                14779,
                14792
            ],
            [
                14792,
                14808
            ],
            [
                14808,
                14818
            ],
            [
                14818,
                14825
            ],
            [
                14825,
                14837
            ],
            [
                14837,
                14935
            ],
            [
                14935,
                14965
            ],
            [
                14965,
                14965
            ],
            [
                14965,
                15030
            ],
            [
                15030,
                15103
            ],
            [
                15103,
                15176
            ],
            [
                15176,
                15190
            ],
            [
                15190,
                15319
            ],
            [
                15319,
                15360
            ],
            [
                15360,
                15373
            ],
            [
                15373,
                15478
            ],
            [
                15478,
                15538
            ],
            [
                15538,
                15538
            ],
            [
                15538,
                15538
            ],
            [
                15538,
                15558
            ],
            [
                15558,
                15586
            ],
            [
                15586,
                15609
            ],
            [
                15609,
                15629
            ],
            [
                15629,
                15668
            ],
            [
                15668,
                15734
            ],
            [
                15734,
                15797
            ],
            [
                15797,
                15834
            ],
            [
                15834,
                15861
            ],
            [
                15861,
                15880
            ],
            [
                15880,
                15906
            ],
            [
                15906,
                15960
            ],
            [
                15960,
                15985
            ],
            [
                15985,
                16016
            ],
            [
                16016,
                16029
            ],
            [
                16029,
                16114
            ],
            [
                16114,
                16208
            ],
            [
                16208,
                16235
            ],
            [
                16235,
                16291
            ],
            [
                16291,
                16435
            ],
            [
                16435,
                16443
            ],
            [
                16443,
                16498
            ],
            [
                16498,
                16538
            ],
            [
                16538,
                16604
            ],
            [
                16604,
                16729
            ],
            [
                16729,
                16882
            ],
            [
                16882,
                16966
            ],
            [
                16966,
                17028
            ],
            [
                17028,
                17111
            ],
            [
                17111,
                17130
            ],
            [
                17130,
                17143
            ],
            [
                17143,
                17195
            ],
            [
                17195,
                17234
            ],
            [
                17234,
                17280
            ],
            [
                17280,
                17321
            ],
            [
                17321,
                17364
            ],
            [
                17364,
                17378
            ],
            [
                17378,
                17438
            ],
            [
                17438,
                17454
            ],
            [
                17454,
                17490
            ],
            [
                17490,
                17490
            ],
            [
                17490,
                17562
            ],
            [
                17562,
                17615
            ],
            [
                17615,
                17683
            ],
            [
                17683,
                17683
            ],
            [
                17683,
                17845
            ],
            [
                17845,
                17889
            ],
            [
                17889,
                17944
            ],
            [
                17944,
                17962
            ],
            [
                17962,
                17986
            ],
            [
                17986,
                18198
            ],
            [
                18198,
                18219
            ],
            [
                18219,
                18283
            ],
            [
                18283,
                18319
            ],
            [
                18319,
                18406
            ],
            [
                18406,
                18406
            ],
            [
                18406,
                18606
            ],
            [
                18606,
                18928
            ],
            [
                18928,
                18996
            ]
        ]
    }
}