{
    "original": {
        "text": "There is disquietude in Cook's Court, Cursitor Street. Black suspicion hides in that peaceful region. The mass of Cook's Courtiers are in their usual state of mind, no better and no worse; but Mr. Snagsby is changed, and his little woman knows it.\nFor Tom-all-Alone's and Lincoln's Inn Fields persist in harnessing themselves, a pair of ungovernable coursers, to the chariot of Mr. Snagsby's imagination; and Mr. Bucket drives; and the passengers are Jo and Mr. Tulkinghorn; and the complete equipage whirls though the law-stationery business at wild speed all round the clock. Even in the little front kitchen where the family meals are taken, it rattles away at a smoking pace from the dinner-table, when Mr. Snagsby pauses in carving the first slice of the leg of mutton baked with potatoes and stares at the kitchen wall.\nMr. Snagsby cannot make out what it is that he has had to do with. Something is wrong somewhere, but what something, what may come of it, to whom, when, and from which unthought of and unheard of quarter is the puzzle of his life. His remote impressions of the robes and coronets, the stars and garters, that sparkle through the surface-dust of Mr. Tulkinghorn's chambers; his veneration for the mysteries presided over by that best and closest of his customers, whom all the Inns of Court, all Chancery Lane, and all the legal neighbourhood agree to hold in awe; his remembrance of Detective Mr. Bucket with his forefinger and his confidential manner, impossible to be evaded or declined, persuade him that he is a party to some dangerous secret without knowing what it is. And it is the fearful peculiarity of this condition that, at any hour of his daily life, at any opening of the shop-door, at any pull of the bell, at any entrance of a messenger, or any delivery of a letter, the secret may take air and fire, explode, and blow up--Mr. Bucket only knows whom.\nFor which reason, whenever a man unknown comes into the shop (as many men unknown do) and says, \"Is Mr. Snagsby in?\" or words to that innocent effect, Mr. Snagsby's heart knocks hard at his guilty breast. He undergoes so much from such inquiries that when they are made by boys he revenges himself by flipping at their ears over the counter and asking the young dogs what they mean by it and why they can't speak out at once? More impracticable men and boys persist in walking into Mr. Snagsby's sleep and terrifying him with unaccountable questions, so that often when the cock at the little dairy in Cursitor Street breaks out in his usual absurd way about the morning, Mr. Snagsby finds himself in a crisis of nightmare, with his little woman shaking him and saying \"What's the matter with the man!\"\nThe little woman herself is not the least item in his difficulty. To know that he is always keeping a secret from her, that he has under all circumstances to conceal and hold fast a tender double tooth, which her sharpness is ever ready to twist out of his head, gives Mr. Snagsby, in her dentistical presence, much of the air of a dog who has a reservation from his master and will look anywhere rather than meet his eye.\nThese various signs and tokens, marked by the little woman, are not lost upon her. They impel her to say, \"Snagsby has something on his mind!\" And thus suspicion gets into Cook's Court, Cursitor Street. From suspicion to jealousy, Mrs. Snagsby finds the road as natural and short as from Cook's Court to Chancery Lane. And thus jealousy gets into Cook's Court, Cursitor Street. Once there (and it was always lurking thereabout), it is very active and nimble in Mrs. Snagsby's breast, prompting her to nocturnal examinations of Mr. Snagsby's pockets; to secret perusals of Mr. Snagsby's letters; to private researches in the day book and ledger, till, cash-box, and iron safe; to watchings at windows, listenings behind doors, and a general putting of this and that together by the wrong end.\nMrs. Snagsby is so perpetually on the alert that the house becomes ghostly with creaking boards and rustling garments. The 'prentices think somebody may have been murdered there in bygone times. Guster holds certain loose atoms of an idea (picked up at Tooting, where they were found floating among the orphans) that there is buried money underneath the cellar, guarded by an old man with a white beard, who cannot get out for seven thousand years because he said the Lord's Prayer backwards.\n\"Who was Nimrod?\" Mrs. Snagsby repeatedly inquires of herself. \"Who was that lady--that creature? And who is that boy?\" Now, Nimrod being as dead as the mighty hunter whose name Mrs. Snagsby has appropriated, and the lady being unproducible, she directs her mental eye, for the present, with redoubled vigilance to the boy. \"And who,\" quoth Mrs. Snagsby for the thousand and first time, \"is that boy? Who is that--!\" And there Mrs. Snagsby is seized with an inspiration.\nHe has no respect for Mr. Chadband. No, to be sure, and he wouldn't have, of course. Naturally he wouldn't, under those contagious circumstances. He was invited and appointed by Mr. Chadband--why, Mrs. Snagsby heard it herself with her own ears!--to come back, and be told where he was to go, to be addressed by Mr. Chadband; and he never came! Why did he never come? Because he was told not to come. Who told him not to come? Who? Ha, ha! Mrs. Snagsby sees it all.\nBut happily (and Mrs. Snagsby tightly shakes her head and tightly smiles) that boy was met by Mr. Chadband yesterday in the streets; and that boy, as affording a subject which Mr. Chadband desires to improve for the spiritual delight of a select congregation, was seized by Mr. Chadband and threatened with being delivered over to the police unless he showed the reverend gentleman where he lived and unless he entered into, and fulfilled, an undertaking to appear in Cook's Court to-morrow night, \"to--mor--row--night,\" Mrs. Snagsby repeats for mere emphasis with another tight smile and another tight shake of her head; and to-morrow night that boy will be here, and to-morrow night Mrs. Snagsby will have her eye upon him and upon some one else; and oh, you may walk a long while in your secret ways (says Mrs. Snagsby with haughtiness and scorn), but you can't blind ME!\nMrs. Snagsby sounds no timbrel in anybody's ears, but holds her purpose quietly, and keeps her counsel. To-morrow comes, the savoury preparations for the Oil Trade come, the evening comes. Comes Mr. Snagsby in his black coat; come the Chadbands; come (when the gorging vessel is replete) the 'prentices and Guster, to be edified; comes at last, with his slouching head, and his shuffle backward, and his shuffle forward, and his shuffle to the right, and his shuffle to the left, and his bit of fur cap in his muddy hand, which he picks as if it were some mangy bird he had caught and was plucking before eating raw, Jo, the very, very tough subject Mr. Chadband is to improve.\nMrs. Snagsby screws a watchful glance on Jo as he is brought into the little drawing-room by Guster. He looks at Mr. Snagsby the moment he comes in. Aha! Why does he look at Mr. Snagsby? Mr. Snagsby looks at him. Why should he do that, but that Mrs. Snagsby sees it all? Why else should that look pass between them, why else should Mr. Snagsby be confused and cough a signal cough behind his hand? It is as clear as crystal that Mr. Snagsby is that boy's father.\n\"Peace, my friends,\" says Chadband, rising and wiping the oily exudations from his reverend visage. \"Peace be with us! My friends, why with us? Because,\" with his fat smile, \"it cannot be against us, because it must be for us; because it is not hardening, because it is softening; because it does not make war like the hawk, but comes home unto us like the dove. Therefore, my friends, peace be with us! My human boy, come forward!\"\nStretching forth his flabby paw, Mr. Chadband lays the same on Jo's arm and considers where to station him. Jo, very doubtful of his reverend friend's intentions and not at all clear but that something practical and painful is going to be done to him, mutters, \"You let me alone. I never said nothink to you. You let me alone.\"\n\"No, my young friend,\" says Chadband smoothly, \"I will not let you alone. And why? Because I am a harvest-labourer, because I am a toiler and a moiler, because you are delivered over unto me and are become as a precious instrument in my hands. My friends, may I so employ this instrument as to use it to your advantage, to your profit, to your gain, to your welfare, to your enrichment! My young friend, sit upon this stool.\"\nJo, apparently possessed by an impression that the reverend gentleman wants to cut his hair, shields his head with both arms and is got into the required position with great difficulty and every possible manifestation of reluctance.\nWhen he is at last adjusted like a lay-figure, Mr. Chadband, retiring behind the table, holds up his bear's-paw and says, \"My friends!\" This is the signal for a general settlement of the audience. The 'prentices giggle internally and nudge each other. Guster falls into a staring and vacant state, compounded of a stunned admiration of Mr. Chadband and pity for the friendless outcast whose condition touches her nearly. Mrs. Snagsby silently lays trains of gunpowder. Mrs. Chadband composes herself grimly by the fire and warms her knees, finding that sensation favourable to the reception of eloquence.\nIt happens that Mr. Chadband has a pulpit habit of fixing some member of his congregation with his eye and fatly arguing his points with that particular person, who is understood to be expected to be moved to an occasional grunt, groan, gasp, or other audible expression of inward working, which expression of inward working, being echoed by some elderly lady in the next pew and so communicated like a game of forfeits through a circle of the more fermentable sinners present, serves the purpose of parliamentary cheering and gets Mr. Chadband's steam up. From mere force of habit, Mr. Chadband in saying \"My friends!\" has rested his eye on Mr. Snagsby and proceeds to make that ill-starred stationer, already sufficiently confused, the immediate recipient of his discourse.\n\"We have here among us, my friends,\" says Chadband, \"a Gentile and a heathen, a dweller in the tents of Tom-all-Alone's and a mover-on upon the surface of the earth. We have here among us, my friends,\" and Mr. Chadband, untwisting the point with his dirty thumb-nail, bestows an oily smile on Mr. Snagsby, signifying that he will throw him an argumentative back-fall presently if he be not already down, \"a brother and a boy. Devoid of parents, devoid of relations, devoid of flocks and herds, devoid of gold and silver and of precious stones. Now, my friends, why do I say he is devoid of these possessions? Why? Why is he?\" Mr. Chadband states the question as if he were propounding an entirely new riddle of much ingenuity and merit to Mr. Snagsby and entreating him not to give it up.\nMr. Snagsby, greatly perplexed by the mysterious look he received just now from his little woman--at about the period when Mr. Chadband mentioned the word parents--is tempted into modestly remarking, \"I don't know, I'm sure, sir.\" On which interruption Mrs. Chadband glares and Mrs. Snagsby says, \"For shame!\"\n\"I hear a voice,\" says Chadband; \"is it a still small voice, my friends? I fear not, though I fain would hope so--\"\n\"Ah--h!\" from Mrs. Snagsby.\n\"Which says, 'I don't know.' Then I will tell you why. I say this brother present here among us is devoid of parents, devoid of relations, devoid of flocks and herds, devoid of gold, of silver, and of precious stones because he is devoid of the light that shines in upon some of us. What is that light? What is it? I ask you, what is that light?\"\nMr. Chadband draws back his head and pauses, but Mr. Snagsby is not to be lured on to his destruction again. Mr. Chadband, leaning forward over the table, pierces what he has got to follow directly into Mr. Snagsby with the thumb-nail already mentioned.\n\"It is,\" says Chadband, \"the ray of rays, the sun of suns, the moon of moons, the star of stars. It is the light of Terewth.\"\nMr. Chadband draws himself up again and looks triumphantly at Mr. Snagsby as if he would be glad to know how he feels after that.\n\"Of Terewth,\" says Mr. Chadband, hitting him again. \"Say not to me that it is NOT the lamp of lamps. I say to you it is. I say to you, a million of times over, it is. It is! I say to you that I will proclaim it to you, whether you like it or not; nay, that the less you like it, the more I will proclaim it to you. With a speaking-trumpet! I say to you that if you rear yourself against it, you shall fall, you shall be bruised, you shall be battered, you shall be flawed, you shall be smashed.\"\nThe present effect of this flight of oratory--much admired for its general power by Mr. Chadband's followers--being not only to make Mr. Chadband unpleasantly warm, but to represent the innocent Mr. Snagsby in the light of a determined enemy to virtue, with a forehead of brass and a heart of adamant, that unfortunate tradesman becomes yet more disconcerted and is in a very advanced state of low spirits and false position when Mr. Chadband accidentally finishes him.\n\"My friends,\" he resumes after dabbing his fat head for some time--and it smokes to such an extent that he seems to light his pocket-handkerchief at it, which smokes, too, after every dab--\"to pursue the subject we are endeavouring with our lowly gifts to improve, let us in a spirit of love inquire what is that Terewth to which I have alluded. For, my young friends,\" suddenly addressing the 'prentices and Guster, to their consternation, \"if I am told by the doctor that calomel or castor-oil is good for me, I may naturally ask what is calomel, and what is castor-oil. I may wish to be informed of that before I dose myself with either or with both. Now, my young friends, what is this Terewth then? Firstly (in a spirit of love), what is the common sort of Terewth--the working clothes--the every-day wear, my young friends? Is it deception?\"\n\"Ah--h!\" from Mrs. Snagsby.\n\"Is it suppression?\"\nA shiver in the negative from Mrs. Snagsby.\n\"Is it reservation?\"\nA shake of the head from Mrs. Snagsby--very long and very tight.\n\"No, my friends, it is neither of these. Neither of these names belongs to it. When this young heathen now among us--who is now, my friends, asleep, the seal of indifference and perdition being set upon his eyelids; but do not wake him, for it is right that I should have to wrestle, and to combat and to struggle, and to conquer, for his sake--when this young hardened heathen told us a story of a cock, and of a bull, and of a lady, and of a sovereign, was THAT the Terewth? No. Or if it was partly, was it wholly and entirely? No, my friends, no!\"\nIf Mr. Snagsby could withstand his little woman's look as it enters at his eyes, the windows of his soul, and searches the whole tenement, he were other than the man he is. He cowers and droops.\n\"Or, my juvenile friends,\" says Chadband, descending to the level of their comprehension with a very obtrusive demonstration in his greasily meek smile of coming a long way downstairs for the purpose, \"if the master of this house was to go forth into the city and there see an eel, and was to come back, and was to call unto him the mistress of this house, and was to say, 'Sarah, rejoice with me, for I have seen an elephant!' would THAT be Terewth?\"\nMrs. Snagsby in tears.\n\"Or put it, my juvenile friends, that he saw an elephant, and returning said 'Lo, the city is barren, I have seen but an eel,' would THAT be Terewth?\"\nMrs. Snagsby sobbing loudly.\n\"Or put it, my juvenile friends,\" said Chadband, stimulated by the sound, \"that the unnatural parents of this slumbering heathen--for parents he had, my juvenile friends, beyond a doubt--after casting him forth to the wolves and the vultures, and the wild dogs and the young gazelles, and the serpents, went back to their dwellings and had their pipes, and their pots, and their flutings and their dancings, and their malt liquors, and their butcher's meat and poultry, would THAT be Terewth?\"\nMrs. Snagsby replies by delivering herself a prey to spasms, not an unresisting prey, but a crying and a tearing one, so that Cook's Court re-echoes with her shrieks. Finally, becoming cataleptic, she has to be carried up the narrow staircase like a grand piano. After unspeakable suffering, productive of the utmost consternation, she is pronounced, by expresses from the bedroom, free from pain, though much exhausted, in which state of affairs Mr. Snagsby, trampled and crushed in the piano-forte removal, and extremely timid and feeble, ventures to come out from behind the door in the drawing-room.\nAll this time Jo has been standing on the spot where he woke up, ever picking his cap and putting bits of fur in his mouth. He spits them out with a remorseful air, for he feels that it is in his nature to be an unimprovable reprobate and that it's no good HIS trying to keep awake, for HE won't never know nothink. Though it may be, Jo, that there is a history so interesting and affecting even to minds as near the brutes as thine, recording deeds done on this earth for common men, that if the Chadbands, removing their own persons from the light, would but show it thee in simple reverence, would but leave it unimproved, would but regard it as being eloquent enough without their modest aid--it might hold thee awake, and thou might learn from it yet!\nJo never heard of any such book. Its compilers and the Reverend Chadband are all one to him, except that he knows the Reverend Chadband and would rather run away from him for an hour than hear him talk for five minutes. \"It an't no good my waiting here no longer,\" thinks Jo. \"Mr. Snagsby an't a-going to say nothink to me to-night.\" And downstairs he shuffles.\nBut downstairs is the charitable Guster, holding by the handrail of the kitchen stairs and warding off a fit, as yet doubtfully, the same having been induced by Mrs. Snagsby's screaming. She has her own supper of bread and cheese to hand to Jo, with whom she ventures to interchange a word or so for the first time.\n\"Here's something to eat, poor boy,\" says Guster.\n\"Thank'ee, mum,\" says Jo.\n\"Are you hungry?\"\n\"Jist!\" says Jo.\n\"What's gone of your father and your mother, eh?\"\nJo stops in the middle of a bite and looks petrified. For this orphan charge of the Christian saint whose shrine was at Tooting has patted him on the shoulder, and it is the first time in his life that any decent hand has been so laid upon him.\n\"I never know'd nothink about 'em,\" says Jo.\n\"No more didn't I of mine,\" cries Guster. She is repressing symptoms favourable to the fit when she seems to take alarm at something and vanishes down the stairs.\n\"Jo,\" whispers the law-stationer softly as the boy lingers on the step.\n\"Here I am, Mr. Snagsby!\"\n\"I didn't know you were gone--there's another half-crown, Jo. It was quite right of you to say nothing about the lady the other night when we were out together. It would breed trouble. You can't be too quiet, Jo.\"\n\"I am fly, master!\"\nAnd so, good night.\nA ghostly shade, frilled and night-capped, follows the law-stationer to the room he came from and glides higher up. And henceforth he begins, go where he will, to be attended by another shadow than his own, hardly less constant than his own, hardly less quiet than his own. And into whatsoever atmosphere of secrecy his own shadow may pass, let all concerned in the secrecy beware! For the watchful Mrs. Snagsby is there too--bone of his bone, flesh of his flesh, shadow of his shadow.",
        "paragraph_chars": [
            [
                0,
                248
            ],
            [
                248,
                826
            ],
            [
                826,
                1893
            ],
            [
                1893,
                2696
            ],
            [
                2696,
                3119
            ],
            [
                3119,
                3911
            ],
            [
                3911,
                4404
            ],
            [
                4404,
                4875
            ],
            [
                4875,
                5341
            ],
            [
                5341,
                6216
            ],
            [
                6216,
                6894
            ],
            [
                6894,
                7357
            ],
            [
                7357,
                7790
            ],
            [
                7790,
                8118
            ],
            [
                8118,
                8544
            ],
            [
                8544,
                8777
            ],
            [
                8777,
                9382
            ],
            [
                9382,
                10158
            ],
            [
                10158,
                10947
            ],
            [
                10947,
                11257
            ],
            [
                11257,
                11373
            ],
            [
                11373,
                11401
            ],
            [
                11401,
                11748
            ],
            [
                11748,
                12002
            ],
            [
                12002,
                12128
            ],
            [
                12128,
                12258
            ],
            [
                12258,
                12754
            ],
            [
                12754,
                13224
            ],
            [
                13224,
                14072
            ],
            [
                14072,
                14100
            ],
            [
                14100,
                14121
            ],
            [
                14121,
                14165
            ],
            [
                14165,
                14186
            ],
            [
                14186,
                14251
            ],
            [
                14251,
                14802
            ],
            [
                14802,
                14997
            ],
            [
                14997,
                15449
            ],
            [
                15449,
                15472
            ],
            [
                15472,
                15623
            ],
            [
                15623,
                15652
            ],
            [
                15652,
                16146
            ],
            [
                16146,
                16750
            ],
            [
                16750,
                17507
            ],
            [
                17507,
                17869
            ],
            [
                17869,
                18185
            ],
            [
                18185,
                18235
            ],
            [
                18235,
                18261
            ],
            [
                18261,
                18279
            ],
            [
                18279,
                18296
            ],
            [
                18296,
                18346
            ],
            [
                18346,
                18591
            ],
            [
                18591,
                18636
            ],
            [
                18636,
                18799
            ],
            [
                18799,
                18871
            ],
            [
                18871,
                18897
            ],
            [
                18897,
                19111
            ],
            [
                19111,
                19131
            ],
            [
                19131,
                19151
            ],
            [
                19151,
                19636
            ]
        ],
        "segment_chars": [
            [
                0,
                55
            ],
            [
                55,
                102
            ],
            [
                102,
                248
            ],
            [
                248,
                578
            ],
            [
                578,
                826
            ],
            [
                826,
                893
            ],
            [
                893,
                1057
            ],
            [
                1057,
                1601
            ],
            [
                1601,
                1893
            ],
            [
                1893,
                2010
            ],
            [
                2010,
                2098
            ],
            [
                2098,
                2319
            ],
            [
                2319,
                2696
            ],
            [
                2696,
                2762
            ],
            [
                2762,
                3119
            ],
            [
                3119,
                3202
            ],
            [
                3202,
                3262
            ],
            [
                3262,
                3322
            ],
            [
                3322,
                3438
            ],
            [
                3438,
                3497
            ],
            [
                3497,
                3911
            ],
            [
                3911,
                4030
            ],
            [
                4030,
                4106
            ],
            [
                4106,
                4404
            ],
            [
                4404,
                4422
            ],
            [
                4422,
                4467
            ],
            [
                4467,
                4502
            ],
            [
                4502,
                4524
            ],
            [
                4524,
                4728
            ],
            [
                4728,
                4805
            ],
            [
                4805,
                4821
            ],
            [
                4821,
                4875
            ],
            [
                4875,
                4911
            ],
            [
                4911,
                4960
            ],
            [
                4960,
                5021
            ],
            [
                5021,
                5220
            ],
            [
                5220,
                5243
            ],
            [
                5243,
                5276
            ],
            [
                5276,
                5302
            ],
            [
                5302,
                5307
            ],
            [
                5307,
                5315
            ],
            [
                5315,
                5341
            ],
            [
                5341,
                6216
            ],
            [
                6216,
                6320
            ],
            [
                6320,
                6405
            ],
            [
                6405,
                6894
            ],
            [
                6894,
                6995
            ],
            [
                6995,
                7043
            ],
            [
                7043,
                7048
            ],
            [
                7048,
                7081
            ],
            [
                7081,
                7107
            ],
            [
                7107,
                7165
            ],
            [
                7165,
                7292
            ],
            [
                7292,
                7357
            ],
            [
                7357,
                7457
            ],
            [
                7457,
                7476
            ],
            [
                7476,
                7501
            ],
            [
                7501,
                7720
            ],
            [
                7720,
                7761
            ],
            [
                7761,
                7790
            ],
            [
                7790,
                7898
            ],
            [
                7898,
                8070
            ],
            [
                8070,
                8099
            ],
            [
                8099,
                8118
            ],
            [
                8118,
                8192
            ],
            [
                8192,
                8201
            ],
            [
                8201,
                8362
            ],
            [
                8362,
                8505
            ],
            [
                8505,
                8544
            ],
            [
                8544,
                8777
            ],
            [
                8777,
                8913
            ],
            [
                8913,
                8974
            ],
            [
                8974,
                9029
            ],
            [
                9029,
                9198
            ],
            [
                9198,
                9246
            ],
            [
                9246,
                9382
            ],
            [
                9382,
                9939
            ],
            [
                9939,
                10002
            ],
            [
                10002,
                10158
            ],
            [
                10158,
                10324
            ],
            [
                10324,
                10584
            ],
            [
                10584,
                10702
            ],
            [
                10702,
                10767
            ],
            [
                10767,
                10772
            ],
            [
                10772,
                10784
            ],
            [
                10784,
                10947
            ],
            [
                10947,
                11178
            ],
            [
                11178,
                11257
            ],
            [
                11257,
                11330
            ],
            [
                11330,
                11373
            ],
            [
                11373,
                11382
            ],
            [
                11382,
                11401
            ],
            [
                11401,
                11430
            ],
            [
                11430,
                11456
            ],
            [
                11456,
                11684
            ],
            [
                11684,
                11704
            ],
            [
                11704,
                11716
            ],
            [
                11716,
                11748
            ],
            [
                11748,
                11857
            ],
            [
                11857,
                12002
            ],
            [
                12002,
                12099
            ],
            [
                12099,
                12128
            ],
            [
                12128,
                12258
            ],
            [
                12258,
                12310
            ],
            [
                12310,
                12359
            ],
            [
                12359,
                12379
            ],
            [
                12379,
                12425
            ],
            [
                12425,
                12432
            ],
            [
                12432,
                12573
            ],
            [
                12573,
                12598
            ],
            [
                12598,
                12754
            ],
            [
                12754,
                13224
            ],
            [
                13224,
                13570
            ],
            [
                13570,
                13797
            ],
            [
                13797,
                13878
            ],
            [
                13878,
                13928
            ],
            [
                13928,
                14054
            ],
            [
                14054,
                14072
            ],
            [
                14072,
                14081
            ],
            [
                14081,
                14100
            ],
            [
                14100,
                14121
            ],
            [
                14121,
                14165
            ],
            [
                14165,
                14186
            ],
            [
                14186,
                14251
            ],
            [
                14251,
                14292
            ],
            [
                14292,
                14330
            ],
            [
                14330,
                14728
            ],
            [
                14728,
                14732
            ],
            [
                14732,
                14781
            ],
            [
                14781,
                14802
            ],
            [
                14802,
                14975
            ],
            [
                14975,
                14997
            ],
            [
                14997,
                15425
            ],
            [
                15425,
                15449
            ],
            [
                15449,
                15472
            ],
            [
                15472,
                15623
            ],
            [
                15623,
                15652
            ],
            [
                15652,
                16146
            ],
            [
                16146,
                16313
            ],
            [
                16313,
                16409
            ],
            [
                16409,
                16750
            ],
            [
                16750,
                16874
            ],
            [
                16874,
                17066
            ],
            [
                17066,
                17507
            ],
            [
                17507,
                17540
            ],
            [
                17540,
                17727
            ],
            [
                17727,
                17783
            ],
            [
                17783,
                17841
            ],
            [
                17841,
                17869
            ],
            [
                17869,
                18056
            ],
            [
                18056,
                18185
            ],
            [
                18185,
                18235
            ],
            [
                18235,
                18261
            ],
            [
                18261,
                18279
            ],
            [
                18279,
                18287
            ],
            [
                18287,
                18296
            ],
            [
                18296,
                18346
            ],
            [
                18346,
                18400
            ],
            [
                18400,
                18591
            ],
            [
                18591,
                18636
            ],
            [
                18636,
                18678
            ],
            [
                18678,
                18799
            ],
            [
                18799,
                18871
            ],
            [
                18871,
                18897
            ],
            [
                18897,
                18959
            ],
            [
                18959,
                19058
            ],
            [
                19058,
                19082
            ],
            [
                19082,
                19111
            ],
            [
                19111,
                19131
            ],
            [
                19131,
                19151
            ],
            [
                19151,
                19267
            ],
            [
                19267,
                19425
            ],
            [
                19425,
                19533
            ],
            [
                19533,
                19636
            ]
        ],
        "overlap_chars": [
            [
                0,
                36
            ],
            [
                53,
                55
            ],
            [
                55,
                76
            ],
            [
                100,
                102
            ],
            [
                195,
                248
            ],
            [
                248,
                292
            ],
            [
                304,
                311
            ],
            [
                315,
                325
            ],
            [
                546,
                550
            ],
            [
                360,
                482
            ],
            [
                501,
                506
            ],
            [
                508,
                542
            ],
            [
                557,
                578
            ],
            [
                578,
                660
            ],
            [
                702,
                740
            ],
            [
                760,
                773
            ],
            [
                794,
                826
            ],
            [
                826,
                864
            ],
            [
                891,
                893
            ],
            [
                893,
                941
            ],
            [
                1030,
                1057
            ],
            [
                1199,
                1217
            ],
            [
                1171,
                1186
            ],
            [
                1334,
                1339
            ],
            [
                1390,
                1418
            ],
            [
                1423,
                1438
            ],
            [
                1458,
                1477
            ],
            [
                1514,
                1601
            ],
            [
                1659,
                1665
            ],
            [
                1688,
                1747
            ],
            [
                1780,
                1823
            ],
            [
                1843,
                1863
            ],
            [
                1867,
                1893
            ],
            [
                1893,
                1919
            ],
            [
                1926,
                1933
            ],
            [
                1922,
                1925
            ],
            [
                1934,
                1962
            ],
            [
                1975,
                2007
            ],
            [
                2044,
                2098
            ],
            [
                2338,
                2457
            ],
            [
                2472,
                2474
            ],
            [
                2467,
                2471
            ],
            [
                2565,
                2650
            ],
            [
                2651,
                2696
            ],
            [
                2696,
                2737
            ],
            [
                2746,
                2749
            ],
            [
                2760,
                2762
            ],
            [
                2762,
                2780
            ],
            [
                2788,
                2814
            ],
            [
                2876,
                2884
            ],
            [
                2892,
                2958
            ],
            [
                2965,
                2976
            ],
            [
                2851,
                2853
            ],
            [
                3105,
                3109
            ],
            [
                2981,
                2984
            ],
            [
                3114,
                3119
            ],
            [
                3119,
                3138
            ],
            [
                3179,
                3196
            ],
            [
                3161,
                3177
            ],
            [
                3200,
                3202
            ],
            [
                3202,
                3262
            ],
            [
                3262,
                3303
            ],
            [
                3320,
                3322
            ],
            [
                3337,
                3349
            ],
            [
                3551,
                3742
            ],
            [
                3756,
                3762
            ],
            [
                3793,
                3892
            ],
            [
                3896,
                3905
            ],
            [
                3909,
                3911
            ],
            [
                3911,
                4030
            ],
            [
                4467,
                4485
            ],
            [
                4487,
                4500
            ],
            [
                4422,
                4466
            ],
            [
                4502,
                4524
            ],
            [
                4617,
                4672
            ],
            [
                4691,
                4728
            ],
            [
                4821,
                4824
            ],
            [
                4844,
                4875
            ],
            [
                4875,
                4911
            ],
            [
                4911,
                4925
            ],
            [
                4958,
                4960
            ],
            [
                5021,
                5035
            ],
            [
                5050,
                5065
            ],
            [
                5122,
                5139
            ],
            [
                5187,
                5220
            ],
            [
                5220,
                5243
            ],
            [
                5243,
                5276
            ],
            [
                5276,
                5302
            ],
            [
                5302,
                5307
            ],
            [
                5307,
                5315
            ],
            [
                5315,
                5341
            ],
            [
                5341,
                5352
            ],
            [
                5415,
                5486
            ],
            [
                5601,
                5741
            ],
            [
                5796,
                5821
            ],
            [
                5832,
                5837
            ],
            [
                5361,
                5362
            ],
            [
                6216,
                6228
            ],
            [
                6276,
                6279
            ],
            [
                6295,
                6300
            ],
            [
                6318,
                6319
            ],
            [
                6307,
                6310
            ],
            [
                6264,
                6265
            ],
            [
                6247,
                6249
            ],
            [
                6266,
                6269
            ],
            [
                6390,
                6405
            ],
            [
                6405,
                6466
            ],
            [
                6504,
                6576
            ],
            [
                6586,
                6601
            ],
            [
                6694,
                6737
            ],
            [
                6833,
                6840
            ],
            [
                6847,
                6894
            ],
            [
                6894,
                6995
            ],
            [
                6995,
                7043
            ],
            [
                7043,
                7048
            ],
            [
                7048,
                7081
            ],
            [
                7081,
                7107
            ],
            [
                7139,
                7163
            ],
            [
                7292,
                7357
            ],
            [
                7357,
                7414
            ],
            [
                7431,
                7448
            ],
            [
                7455,
                7457
            ],
            [
                7457,
                7476
            ],
            [
                7476,
                7501
            ],
            [
                7501,
                7594
            ],
            [
                7649,
                7691
            ],
            [
                7697,
                7720
            ],
            [
                7720,
                7761
            ],
            [
                7761,
                7763
            ],
            [
                7770,
                7790
            ],
            [
                7790,
                7840
            ],
            [
                7850,
                7861
            ],
            [
                7896,
                7898
            ],
            [
                7898,
                7922
            ],
            [
                7941,
                7951
            ],
            [
                8040,
                8070
            ],
            [
                8070,
                8097
            ],
            [
                8118,
                8192
            ],
            [
                8192,
                8201
            ],
            [
                8201,
                8241
            ],
            [
                8278,
                8295
            ],
            [
                8301,
                8362
            ],
            [
                8505,
                8544
            ],
            [
                8544,
                8558
            ],
            [
                8586,
                8679
            ],
            [
                8685,
                8688
            ],
            [
                8707,
                8728
            ],
            [
                8775,
                8777
            ],
            [
                8826,
                8913
            ],
            [
                8974,
                9029
            ],
            [
                9029,
                9048
            ],
            [
                9061,
                9161
            ],
            [
                9196,
                9198
            ],
            [
                9198,
                9224
            ],
            [
                9232,
                9246
            ],
            [
                9246,
                9259
            ],
            [
                9300,
                9315
            ],
            [
                9277,
                9295
            ],
            [
                9380,
                9382
            ],
            [
                9400,
                9416
            ],
            [
                9424,
                9488
            ],
            [
                9495,
                9523
            ],
            [
                9535,
                9618
            ],
            [
                9625,
                9627
            ],
            [
                9619,
                9624
            ],
            [
                9714,
                9777
            ],
            [
                9802,
                9825
            ],
            [
                9843,
                9858
            ],
            [
                9937,
                9939
            ],
            [
                9939,
                9977
            ],
            [
                10002,
                10061
            ],
            [
                10106,
                10114
            ],
            [
                10062,
                10083
            ],
            [
                10116,
                10119
            ],
            [
                10130,
                10146
            ],
            [
                10156,
                10158
            ],
            [
                10158,
                10234
            ],
            [
                10322,
                10324
            ],
            [
                10584,
                10702
            ],
            [
                10702,
                10767
            ],
            [
                10772,
                10784
            ],
            [
                10784,
                10830
            ],
            [
                10897,
                10908
            ],
            [
                10843,
                10845
            ],
            [
                10859,
                10865
            ],
            [
                10945,
                10947
            ],
            [
                10947,
                11012
            ],
            [
                11022,
                11043
            ],
            [
                11065,
                11109
            ],
            [
                11145,
                11178
            ],
            [
                11178,
                11257
            ],
            [
                11257,
                11291
            ],
            [
                11402,
                11430
            ],
            [
                11430,
                11456
            ],
            [
                11456,
                11684
            ],
            [
                11684,
                11704
            ],
            [
                11704,
                11716
            ],
            [
                11716,
                11748
            ],
            [
                11748,
                11760
            ],
            [
                11785,
                11791
            ],
            [
                11781,
                11784
            ],
            [
                11797,
                11808
            ],
            [
                11855,
                11856
            ],
            [
                12002,
                12008
            ],
            [
                12027,
                12099
            ],
            [
                12099,
                12128
            ],
            [
                12128,
                12157
            ],
            [
                12164,
                12201
            ],
            [
                12256,
                12257
            ],
            [
                12258,
                12271
            ],
            [
                12272,
                12276
            ],
            [
                12308,
                12310
            ],
            [
                12379,
                12423
            ],
            [
                12432,
                12503
            ],
            [
                12508,
                12509
            ],
            [
                12573,
                12598
            ],
            [
                12598,
                12722
            ],
            [
                12744,
                12754
            ],
            [
                12754,
                12757
            ],
            [
                12766,
                12780
            ],
            [
                12791,
                12798
            ],
            [
                13117,
                13119
            ],
            [
                12870,
                12960
            ],
            [
                12977,
                13005
            ],
            [
                12840,
                12841
            ],
            [
                13056,
                13112
            ],
            [
                13179,
                13224
            ],
            [
                13224,
                13275
            ],
            [
                13375,
                13376
            ],
            [
                13413,
                13414
            ],
            [
                13489,
                13495
            ],
            [
                13516,
                13570
            ],
            [
                13878,
                13881
            ],
            [
                13573,
                13666
            ],
            [
                13901,
                13928
            ],
            [
                14054,
                14072
            ],
            [
                14072,
                14075
            ],
            [
                14078,
                14081
            ],
            [
                14081,
                14100
            ],
            [
                14100,
                14121
            ],
            [
                14121,
                14129
            ],
            [
                14146,
                14165
            ],
            [
                14165,
                14186
            ],
            [
                14186,
                14223
            ],
            [
                14249,
                14251
            ],
            [
                14251,
                14273
            ],
            [
                14282,
                14292
            ],
            [
                14330,
                14353
            ],
            [
                14368,
                14465
            ],
            [
                14596,
                14649
            ],
            [
                14680,
                14714
            ],
            [
                14715,
                14728
            ],
            [
                14781,
                14802
            ],
            [
                14807,
                14816
            ],
            [
                14881,
                14882
            ],
            [
                14870,
                14872
            ],
            [
                14833,
                14856
            ],
            [
                14906,
                14907
            ],
            [
                14978,
                14997
            ],
            [
                14997,
                15092
            ],
            [
                15129,
                15132
            ],
            [
                15143,
                15148
            ],
            [
                15196,
                15304
            ],
            [
                15365,
                15368
            ],
            [
                15309,
                15311
            ],
            [
                15326,
                15341
            ],
            [
                15185,
                15188
            ],
            [
                15347,
                15352
            ],
            [
                15368,
                15425
            ],
            [
                15425,
                15449
            ],
            [
                15623,
                15643
            ],
            [
                15650,
                15652
            ],
            [
                15652,
                15655
            ],
            [
                15662,
                15685
            ],
            [
                15691,
                15727
            ],
            [
                15732,
                15780
            ],
            [
                15839,
                15936
            ],
            [
                15955,
                16043
            ],
            [
                16050,
                16058
            ],
            [
                16120,
                16146
            ],
            [
                16146,
                16169
            ],
            [
                16199,
                16205
            ],
            [
                16262,
                16284
            ],
            [
                16295,
                16313
            ],
            [
                16313,
                16409
            ],
            [
                16409,
                16437
            ],
            [
                16478,
                16499
            ],
            [
                16510,
                16527
            ],
            [
                16528,
                16565
            ],
            [
                16570,
                16575
            ],
            [
                16593,
                16618
            ],
            [
                16669,
                16674
            ],
            [
                16685,
                16750
            ],
            [
                16754,
                16766
            ],
            [
                16776,
                16814
            ],
            [
                16820,
                16874
            ],
            [
                16919,
                16927
            ],
            [
                16989,
                17065
            ],
            [
                17727,
                17783
            ],
            [
                17783,
                17829
            ],
            [
                17838,
                17841
            ],
            [
                17841,
                17869
            ],
            [
                17869,
                17917
            ],
            [
                17921,
                17977
            ],
            [
                18019,
                18056
            ],
            [
                18056,
                18112
            ],
            [
                18183,
                18185
            ],
            [
                18185,
                18235
            ],
            [
                18235,
                18261
            ],
            [
                18261,
                18279
            ],
            [
                18279,
                18287
            ],
            [
                18287,
                18296
            ],
            [
                18296,
                18327
            ],
            [
                18333,
                18346
            ],
            [
                18346,
                18400
            ],
            [
                18400,
                18403
            ],
            [
                18474,
                18591
            ],
            [
                18591,
                18636
            ],
            [
                18636,
                18678
            ],
            [
                18678,
                18681
            ],
            [
                18736,
                18781
            ],
            [
                18797,
                18799
            ],
            [
                18799,
                18857
            ],
            [
                18869,
                18871
            ],
            [
                18871,
                18897
            ],
            [
                18897,
                18898
            ],
            [
                18927,
                18959
            ],
            [
                18959,
                19030
            ],
            [
                19056,
                19058
            ],
            [
                19058,
                19082
            ],
            [
                19082,
                19111
            ],
            [
                19111,
                19131
            ],
            [
                19131,
                19151
            ],
            [
                19151,
                19248
            ],
            [
                19249,
                19267
            ],
            [
                19267,
                19281
            ],
            [
                19291,
                19310
            ],
            [
                19282,
                19284
            ],
            [
                19317,
                19328
            ],
            [
                19337,
                19343
            ],
            [
                19358,
                19391
            ],
            [
                19423,
                19425
            ],
            [
                19425,
                19433
            ],
            [
                19459,
                19533
            ],
            [
                19533,
                19575
            ],
            [
                19577,
                19636
            ]
        ],
        "row_chars": [
            [
                0,
                55
            ],
            [
                55,
                102
            ],
            [
                102,
                248
            ],
            [
                248,
                578
            ],
            [
                578,
                826
            ],
            [
                826,
                893
            ],
            [
                893,
                1057
            ],
            [
                1057,
                1601
            ],
            [
                1601,
                1893
            ],
            [
                1893,
                2010
            ],
            [
                2010,
                2098
            ],
            [
                2098,
                2319
            ],
            [
                2319,
                2696
            ],
            [
                2696,
                2762
            ],
            [
                2762,
                3119
            ],
            [
                3119,
                3202
            ],
            [
                3202,
                3262
            ],
            [
                3262,
                3322
            ],
            [
                3322,
                3911
            ],
            [
                3911,
                4030
            ],
            [
                4030,
                4106
            ],
            [
                4106,
                4404
            ],
            [
                4404,
                4422
            ],
            [
                4422,
                4502
            ],
            [
                4502,
                4524
            ],
            [
                4524,
                4728
            ],
            [
                4728,
                4805
            ],
            [
                4805,
                4821
            ],
            [
                4821,
                4875
            ],
            [
                4875,
                4911
            ],
            [
                4911,
                4960
            ],
            [
                4960,
                5021
            ],
            [
                5021,
                5220
            ],
            [
                5220,
                5243
            ],
            [
                5243,
                5276
            ],
            [
                5276,
                5302
            ],
            [
                5302,
                5307
            ],
            [
                5307,
                5315
            ],
            [
                5315,
                5341
            ],
            [
                5341,
                6216
            ],
            [
                6216,
                6320
            ],
            [
                6320,
                6405
            ],
            [
                6405,
                6894
            ],
            [
                6894,
                6995
            ],
            [
                6995,
                7043
            ],
            [
                7043,
                7048
            ],
            [
                7048,
                7081
            ],
            [
                7081,
                7107
            ],
            [
                7107,
                7357
            ],
            [
                7357,
                7457
            ],
            [
                7457,
                7476
            ],
            [
                7476,
                7501
            ],
            [
                7501,
                7720
            ],
            [
                7720,
                7761
            ],
            [
                7761,
                7790
            ],
            [
                7790,
                7898
            ],
            [
                7898,
                8070
            ],
            [
                8070,
                8099
            ],
            [
                8099,
                8118
            ],
            [
                8118,
                8192
            ],
            [
                8192,
                8201
            ],
            [
                8201,
                8362
            ],
            [
                8362,
                8505
            ],
            [
                8505,
                8544
            ],
            [
                8544,
                8777
            ],
            [
                8777,
                8913
            ],
            [
                8913,
                8974
            ],
            [
                8974,
                9029
            ],
            [
                9029,
                9198
            ],
            [
                9198,
                9246
            ],
            [
                9246,
                9382
            ],
            [
                9382,
                9939
            ],
            [
                9939,
                10158
            ],
            [
                10158,
                10324
            ],
            [
                10324,
                10584
            ],
            [
                10584,
                10702
            ],
            [
                10702,
                10767
            ],
            [
                10767,
                10772
            ],
            [
                10772,
                10784
            ],
            [
                10784,
                10947
            ],
            [
                10947,
                11178
            ],
            [
                11178,
                11257
            ],
            [
                11257,
                11430
            ],
            [
                11430,
                11456
            ],
            [
                11456,
                11684
            ],
            [
                11684,
                11704
            ],
            [
                11704,
                11716
            ],
            [
                11716,
                11748
            ],
            [
                11748,
                12002
            ],
            [
                12002,
                12099
            ],
            [
                12099,
                12128
            ],
            [
                12128,
                12258
            ],
            [
                12258,
                12310
            ],
            [
                12310,
                12359
            ],
            [
                12359,
                12379
            ],
            [
                12379,
                12425
            ],
            [
                12425,
                12432
            ],
            [
                12432,
                12598
            ],
            [
                12598,
                12754
            ],
            [
                12754,
                13224
            ],
            [
                13224,
                13570
            ],
            [
                13570,
                13928
            ],
            [
                13928,
                14054
            ],
            [
                14054,
                14072
            ],
            [
                14072,
                14081
            ],
            [
                14081,
                14100
            ],
            [
                14100,
                14121
            ],
            [
                14121,
                14165
            ],
            [
                14165,
                14186
            ],
            [
                14186,
                14251
            ],
            [
                14251,
                14292
            ],
            [
                14292,
                14330
            ],
            [
                14330,
                14728
            ],
            [
                14728,
                14732
            ],
            [
                14732,
                14781
            ],
            [
                14781,
                14802
            ],
            [
                14802,
                14997
            ],
            [
                14997,
                15425
            ],
            [
                15425,
                15449
            ],
            [
                15449,
                15472
            ],
            [
                15472,
                15623
            ],
            [
                15623,
                15652
            ],
            [
                15652,
                16146
            ],
            [
                16146,
                16313
            ],
            [
                16313,
                16409
            ],
            [
                16409,
                16750
            ],
            [
                16750,
                16874
            ],
            [
                16874,
                17066
            ],
            [
                17066,
                17507
            ],
            [
                17507,
                17540
            ],
            [
                17540,
                17727
            ],
            [
                17727,
                17783
            ],
            [
                17783,
                17841
            ],
            [
                17841,
                17869
            ],
            [
                17869,
                18056
            ],
            [
                18056,
                18185
            ],
            [
                18185,
                18235
            ],
            [
                18235,
                18261
            ],
            [
                18261,
                18279
            ],
            [
                18279,
                18287
            ],
            [
                18287,
                18296
            ],
            [
                18296,
                18346
            ],
            [
                18346,
                18400
            ],
            [
                18400,
                18591
            ],
            [
                18591,
                18636
            ],
            [
                18636,
                18678
            ],
            [
                18678,
                18799
            ],
            [
                18799,
                18871
            ],
            [
                18871,
                18897
            ],
            [
                18897,
                18959
            ],
            [
                18959,
                19058
            ],
            [
                19058,
                19082
            ],
            [
                19082,
                19111
            ],
            [
                19111,
                19131
            ],
            [
                19131,
                19151
            ],
            [
                19151,
                19267
            ],
            [
                19267,
                19425
            ],
            [
                19425,
                19533
            ],
            [
                19533,
                19636
            ]
        ]
    },
    "abridged": {
        "text": "There is disquietude in Cook's Court. Black suspicion hides there. Mr. Snagsby is changed, and his little woman knows it.\nFor Tom-all-Alone's and Lincoln's Inn Fields have harnessed themselves like wild horses to the chariot of Mr. Snagsby's imagination; and Mr. Bucket drives; and the passengers are Jo and Mr. Tulkinghorn; and the whole lot whirl though the law-stationery business all round the clock. Even in the little front kitchen where the family meals are taken, it rattles away when Mr. Snagsby pauses in carving the leg of mutton and stares at the kitchen wall.\nMr. Snagsby cannot make out what it is all about. Something is wrong somewhere, but what something is the puzzle of his life. His veneration for Mr. Tulkinghorn, and his remembrance of Detective Bucket with his confidential manner, persuade him that he is a party to some dangerous secret without knowing what it is. At any moment, at any opening of the shop-door, at any pull of the bell, or any delivery of a letter, the secret may explode, and blow up - Mr. Bucket only knows whom.\nFor which reason, whenever an unknown man comes into the shop (as many do) and says, \"Is Mr. Snagsby in?\", Mr. Snagsby's heart knocks hard at his guilty breast. Men and boys persist in walking into Mr. Snagsby's sleep and terrifying him with unaccountable questions, so that often at cock-crow Mr. Snagsby finds himself in a crisis of nightmare, with his little woman shaking him awake and saying \"What's the matter with the man!\"\nThe little woman herself is not the least of his difficulties. To know that he is keeping a secret from her, like a tender tooth, which her sharpness is ever ready to twist out of his head, makes Mr. Snagsby unwilling to meet her eye.\nThese various signs are not lost upon the little woman. They impel her to say, \"Snagsby has something on his mind!\" And thus suspicion gets into Cook's Court. Suspicion leads naturally to jealousy, which is very active and nimble in Mrs. Snagsby's breast, prompting her to nocturnal examinations of Mr. Snagsby's pockets; to secret perusals of Mr. Snagsby's letters; to private researches in the ledger; to watchings at windows, listenings behind doors, and a general putting of this and that together in the wrong way.\nMrs. Snagsby is so perpetually on the alert that the house becomes ghostly with creaking boards and rustling garments. \"Who was that lady - that creature?\" Mrs. Snagsby repeatedly inquires of herself. \"And who is that boy?\" The lady being unproducible, she directs her mental eye with redoubled vigilance to the boy. And she is seized with an inspiration.\nHe has no respect for Mr. Chadband. No, to be sure. He was invited by Mr. Chadband to come back, and hear Mr. Chadband; and he never came! Why did he never come? Because he was told not to come. Who told him not to come? Who? Ha, ha! Mrs. Snagsby sees it all.\nBut happily that boy was met by Mr. Chadband yesterday in the streets; and that boy was seized by Mr. Chadband and threatened with being delivered over to the police unless he showed the reverend gentleman where he lived and promised to appear in Cook's Court tomorrow night. Mrs. Snagsby thinks with a tight smile and a tight shake of her head that tomorrow night that boy will be here, and Mrs. Snagsby will have her eye on him and on some one else; and oh, you may walk in your secret ways (says Mrs. Snagsby with scorn), but you can't blind me!\nTomorrow evening comes. Comes Mr. Snagsby in his black coat; come the Chadbands; come the 'prentices and Guster, to be edified; comes at last, with his slouch and his shuffle, and his bit of fur cap in his muddy hand, Jo, the very tough subject Mr. Chadband is to improve.\nMrs. Snagsby screws a watchful glance on Jo as he is brought into the little drawing-room by Guster. He looks at Mr. Snagsby the moment he comes in. Aha! Why does he look at Mr. Snagsby? Mr. Snagsby looks at him. Mrs. Snagsby sees it all - it is as clear as crystal that Mr. Snagsby is that boy's father.\n\"Peace, my friends,\" says Chadband, rising and wiping the oil from his reverend face. \"Peace be with us! My friends, why with us? Because,\" with his fat smile, \"it cannot be against us, because it must be for us; because it does not make war like the hawk, but comes unto us like the dove. Therefore, my friends, peace be with us! My boy, come forward!\"\nStretching forth his flabby paw, Mr. Chadband lays it on Jo's arm. Jo, very doubtful of his intentions, mutters, \"You let me alone. I never said nothink to you.\"\n\"No, my young friend,\" says Chadband smoothly, \"I will not let you alone. And why? Because I am a harvest-labourer, because you are delivered unto me and are become as a precious instrument in my hands. My young friend, sit upon this stool.\"\nJo, apparently convinced that the reverend gentleman wants to cut his hair, shields his head with both arms and is got onto the stool with great difficulty.\nMr. Chadband, retiring behind the table, holds up his bear's-paw and says, \"My friends!\" The 'prentices giggle internally and nudge each other. Guster falls into a vacant state, compounded of a stunned admiration of Mr. Chadband and pity for the friendless outcast. Mrs. Snagsby silently lays trails of gunpowder. Mrs. Chadband warms her knees grimly by the fire.\nMr. Chadband has a habit of fixing some member of his congregation with his eye and arguing his points with that person, who is understood to be expected to be moved to an occasional grunt, groan, or gasp, to be echoed by some elderly lady in the next pew and so communicated through a circle of the sinners present. From mere force of habit, Mr. Chadband has rested his eye on Mr. Snagsby and proceeds to make that confused and ill-starred stationer the recipient of his speech.\n\"We have here among us, my friends,\" says Chadband, \"a Gentile and a heathen. Devoid of parents, devoid of relations, devoid of flocks and herds, devoid of gold and silver and of precious stones. Now, my friends, why do I say he is devoid of these possessions? Why is he?\" Mr. Chadband states the question as if he were asking Mr. Snagsby an ingenious riddle.\nMr. Snagsby, greatly perplexed by the mysterious look he received from his little woman when Mr. Chadband mentioned the word parents, remarks, \"I don't know, I'm sure, sir.\" On which interruption Mrs. Chadband glares and Mrs. Snagsby says, \"For shame!\"\n\"I hear a voice,\" says Chadband; \"which says, 'I don't know.' Then I will tell you why. I say this brother present here among us is devoid of parents, devoid of relations, devoid of flocks and herds, devoid of gold, of silver, and of precious stones because he is devoid of the light that shines in upon some of us. What is that light? What is it? I ask you, what is that light?\"\nMr. Chadband pauses and addresses Mr. Snagsby. \"It is the ray of rays, the sun of suns, the moon of moons, the star of stars. It is the light of Terewth.\"\nMr. Chadband draws himself up and looks triumphantly at Mr. Snagsby. \"Of Terewth,\" he says. \"I say to you, a million of times over, it is! I say to you that I will proclaim it to you, whether you like it or not, with a speaking-trumpet! I say to you that if you rear yourself against it, you shall fall, you shall be bruised, you shall be battered, you shall be smashed.\"\nThe effect of this oratory is not only to make Mr. Chadband unpleasantly warm, but to represent the innocent Mr. Snagsby as a determined enemy to virtue. That unfortunate tradesman becomes yet more disconcerted when Mr. Chadband accidentally finishes him.\n\"My friends,\" he resumes after dabbing his fat head, \"let us inquire what is that Terewth to which I have alluded. Now, my young friends,\" suddenly addressing the 'prentices and Guster, to their consternation, \"what is this Terewth then? Is it deception?\"\n\"Ah!\" from Mrs. Snagsby.\n\"Is it suppression?\"\nA shiver from Mrs. Snagsby.\n\"Is it reservation?\"\nA shake of the head from Mrs. Snagsby.\n\"No, my friends, it is none of these. When this young heathen - who is now, my friends, asleep, the seal of indifference and perdition being set upon his eyelids - when this young hardened heathen told us a story of a lady, and of a sovereign, was that wholly the Terewth? No, my friends, no!\"\nMr. Snagsby, at his little woman's look, cowers and droops.\n\"Or, my juvenile friends,\" says Chadband, descending to the level of their comprehension with a greasy smile, \"if the master of this house was to go forth into the city and there see an eel, and was to come back, and say to the mistress of the house, 'Sarah, rejoice with me, for I have seen an elephant!' would that be Terewth?\"\nMrs. Snagsby sobbing.\n\"Or, my juvenile friends,\" says Chadband, stimulated by the sound, \"if the unnatural parents of this slumbering heathen. after casting him forth to the wolves and the vultures, and the wild dogs and the young gazelles, went back to their dwellings and had their pipes, and their pots, and their flutings and dancings, would that be Terewth?\"\nMrs. Snagsby replies by going into spasms, so that Cook's Court echoes with her shrieks. Finally, becoming cataleptic, she has to be carried up the narrow staircase like a grand piano. After unspeakable suffering, she is pronounced, by messages from the bedroom, to be free from pain, though much exhausted; at which Mr. Snagsby, trampled and timid, ventures to come out from behind the door in the drawing-room.\nBy this time Jo is standing on the spot where he woke up, picking his cap and putting bits of fur in his mouth. He feels that it's no good his trying to keep awake, for he won't never know nothink.\n\"It an't no good my waiting here no longer,\" thinks Jo. \"Mr. Snagsby an't a-going to say nothink to me tonight.\" And downstairs he shuffles.\nBut downstairs is the charitable Guster, holding the handrail of the kitchen stairs and warding off a fit induced by Mrs. Snagsby's screaming. She has her own supper of bread and cheese to hand to Jo.\n\"Here's something to eat, poor boy,\" says Guster.\n\"Thank'ee, mum,\" says Jo.\n\"Are you hungry?\"\n\"Jist!\" says Jo.\n\"What's gone of your father and mother, eh?\"\nJo stops in the middle of a bite and looks petrified. For Guster has patted him on the shoulder, and it is the first time in his life that any decent hand has been so laid upon him.\n\"I never know'd nothink about 'em,\" says Jo.\n\"No more didn't I of mine,\" cries Guster. She then seems to take alarm at something and vanishes.\n\"Jo,\" whispers the law-stationer softly as the boy lingers.\n\"Here I am, Mr. Snagsby!\"\n\"There's another half-crown, Jo. It was quite right of you to say nothing about the lady the other night. It would breed trouble. You can't be too quiet, Jo.\"\n\"I am fly, master!\"\nAnd so, good night.\nA ghostly shade, frilled and night-capped, follows the law-stationer to the room he came from and then glides higher up. And henceforth, go where he will, he is attended by a shadow hardly less constant than his own. And into whatever secrecy his own shadow may pass, let all concerned in the secrecy beware! For the watchful Mrs. Snagsby is there too - bone of his bone, flesh of his flesh, shadow of his shadow.",
        "paragraph_chars": [
            [
                0,
                122
            ],
            [
                122,
                573
            ],
            [
                573,
                1058
            ],
            [
                1058,
                1489
            ],
            [
                1489,
                1724
            ],
            [
                1724,
                2244
            ],
            [
                2244,
                2600
            ],
            [
                2600,
                2860
            ],
            [
                2860,
                3409
            ],
            [
                3409,
                3682
            ],
            [
                3682,
                3987
            ],
            [
                3987,
                4341
            ],
            [
                4341,
                4503
            ],
            [
                4503,
                4745
            ],
            [
                4745,
                4902
            ],
            [
                4902,
                5266
            ],
            [
                5266,
                5746
            ],
            [
                5746,
                6106
            ],
            [
                6106,
                6359
            ],
            [
                6359,
                6739
            ],
            [
                6739,
                6894
            ],
            [
                6894,
                7266
            ],
            [
                7266,
                7522
            ],
            [
                7522,
                7778
            ],
            [
                7778,
                7803
            ],
            [
                7803,
                7824
            ],
            [
                7824,
                7852
            ],
            [
                7852,
                7873
            ],
            [
                7873,
                7912
            ],
            [
                7912,
                8206
            ],
            [
                8206,
                8266
            ],
            [
                8266,
                8596
            ],
            [
                8596,
                8618
            ],
            [
                8618,
                8960
            ],
            [
                8960,
                9373
            ],
            [
                9373,
                9571
            ],
            [
                9571,
                9712
            ],
            [
                9712,
                9913
            ],
            [
                9913,
                9963
            ],
            [
                9963,
                9989
            ],
            [
                9989,
                10007
            ],
            [
                10007,
                10024
            ],
            [
                10024,
                10069
            ],
            [
                10069,
                10251
            ],
            [
                10251,
                10296
            ],
            [
                10296,
                10394
            ],
            [
                10394,
                10454
            ],
            [
                10454,
                10480
            ],
            [
                10480,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10679
            ],
            [
                10679,
                11092
            ]
        ],
        "segment_chars": [
            [
                0,
                38
            ],
            [
                38,
                67
            ],
            [
                67,
                122
            ],
            [
                122,
                405
            ],
            [
                405,
                573
            ],
            [
                573,
                623
            ],
            [
                623,
                699
            ],
            [
                699,
                890
            ],
            [
                890,
                1058
            ],
            [
                1058,
                1162
            ],
            [
                1162,
                1219
            ],
            [
                1219,
                1489
            ],
            [
                1489,
                1552
            ],
            [
                1552,
                1724
            ],
            [
                1724,
                1780
            ],
            [
                1780,
                1840
            ],
            [
                1840,
                1883
            ],
            [
                1883,
                2244
            ],
            [
                2244,
                2363
            ],
            [
                2363,
                2400
            ],
            [
                2400,
                2445
            ],
            [
                2445,
                2468
            ],
            [
                2468,
                2561
            ],
            [
                2561,
                2600
            ],
            [
                2600,
                2636
            ],
            [
                2636,
                2652
            ],
            [
                2652,
                2739
            ],
            [
                2739,
                2762
            ],
            [
                2762,
                2795
            ],
            [
                2795,
                2821
            ],
            [
                2821,
                2826
            ],
            [
                2826,
                2834
            ],
            [
                2834,
                2860
            ],
            [
                2860,
                3136
            ],
            [
                3136,
                3409
            ],
            [
                3409,
                3433
            ],
            [
                3433,
                3682
            ],
            [
                3682,
                3783
            ],
            [
                3783,
                3831
            ],
            [
                3831,
                3836
            ],
            [
                3836,
                3869
            ],
            [
                3869,
                3895
            ],
            [
                3895,
                3987
            ],
            [
                3987,
                4073
            ],
            [
                4073,
                4092
            ],
            [
                4092,
                4117
            ],
            [
                4117,
                4277
            ],
            [
                4277,
                4318
            ],
            [
                4318,
                4341
            ],
            [
                4341,
                4408
            ],
            [
                4408,
                4473
            ],
            [
                4473,
                4503
            ],
            [
                4503,
                4577
            ],
            [
                4577,
                4586
            ],
            [
                4586,
                4706
            ],
            [
                4706,
                4745
            ],
            [
                4745,
                4902
            ],
            [
                4902,
                4991
            ],
            [
                4991,
                5046
            ],
            [
                5046,
                5168
            ],
            [
                5168,
                5216
            ],
            [
                5216,
                5266
            ],
            [
                5266,
                5583
            ],
            [
                5583,
                5746
            ],
            [
                5746,
                5824
            ],
            [
                5824,
                5942
            ],
            [
                5942,
                6007
            ],
            [
                6007,
                6019
            ],
            [
                6019,
                6106
            ],
            [
                6106,
                6280
            ],
            [
                6280,
                6359
            ],
            [
                6359,
                6421
            ],
            [
                6421,
                6447
            ],
            [
                6447,
                6675
            ],
            [
                6675,
                6695
            ],
            [
                6695,
                6707
            ],
            [
                6707,
                6739
            ],
            [
                6739,
                6786
            ],
            [
                6786,
                6865
            ],
            [
                6865,
                6894
            ],
            [
                6894,
                6963
            ],
            [
                6963,
                6986
            ],
            [
                6986,
                7033
            ],
            [
                7033,
                7131
            ],
            [
                7131,
                7266
            ],
            [
                7266,
                7420
            ],
            [
                7420,
                7522
            ],
            [
                7522,
                7637
            ],
            [
                7637,
                7760
            ],
            [
                7760,
                7778
            ],
            [
                7778,
                7784
            ],
            [
                7784,
                7803
            ],
            [
                7803,
                7824
            ],
            [
                7824,
                7852
            ],
            [
                7852,
                7873
            ],
            [
                7873,
                7912
            ],
            [
                7912,
                7950
            ],
            [
                7950,
                8185
            ],
            [
                8185,
                8206
            ],
            [
                8206,
                8266
            ],
            [
                8266,
                8572
            ],
            [
                8572,
                8596
            ],
            [
                8596,
                8618
            ],
            [
                8618,
                8739
            ],
            [
                8739,
                8960
            ],
            [
                8960,
                9049
            ],
            [
                9049,
                9145
            ],
            [
                9145,
                9373
            ],
            [
                9373,
                9485
            ],
            [
                9485,
                9571
            ],
            [
                9571,
                9627
            ],
            [
                9627,
                9684
            ],
            [
                9684,
                9712
            ],
            [
                9712,
                9855
            ],
            [
                9855,
                9913
            ],
            [
                9913,
                9963
            ],
            [
                9963,
                9989
            ],
            [
                9989,
                10007
            ],
            [
                10007,
                10015
            ],
            [
                10015,
                10024
            ],
            [
                10024,
                10069
            ],
            [
                10069,
                10123
            ],
            [
                10123,
                10251
            ],
            [
                10251,
                10296
            ],
            [
                10296,
                10338
            ],
            [
                10338,
                10394
            ],
            [
                10394,
                10454
            ],
            [
                10454,
                10480
            ],
            [
                10480,
                10513
            ],
            [
                10513,
                10586
            ],
            [
                10586,
                10610
            ],
            [
                10610,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10679
            ],
            [
                10679,
                10800
            ],
            [
                10800,
                10896
            ],
            [
                10896,
                10988
            ],
            [
                10988,
                11092
            ]
        ],
        "overlap_chars": [
            [
                0,
                36
            ],
            [
                36,
                38
            ],
            [
                38,
                59
            ],
            [
                65,
                67
            ],
            [
                69,
                122
            ],
            [
                122,
                166
            ],
            [
                172,
                179
            ],
            [
                182,
                192
            ],
            [
                198,
                202
            ],
            [
                210,
                332
            ],
            [
                343,
                348
            ],
            [
                349,
                383
            ],
            [
                384,
                405
            ],
            [
                405,
                487
            ],
            [
                488,
                526
            ],
            [
                527,
                540
            ],
            [
                541,
                573
            ],
            [
                573,
                611
            ],
            [
                621,
                623
            ],
            [
                623,
                671
            ],
            [
                672,
                699
            ],
            [
                699,
                717
            ],
            [
                718,
                733
            ],
            [
                733,
                738
            ],
            [
                739,
                767
            ],
            [
                768,
                783
            ],
            [
                784,
                803
            ],
            [
                803,
                890
            ],
            [
                890,
                896
            ],
            [
                903,
                962
            ],
            [
                963,
                1006
            ],
            [
                1007,
                1027
            ],
            [
                1032,
                1058
            ],
            [
                1058,
                1084
            ],
            [
                1088,
                1095
            ],
            [
                1096,
                1099
            ],
            [
                1100,
                1128
            ],
            [
                1129,
                1161
            ],
            [
                1165,
                1219
            ],
            [
                1219,
                1338
            ],
            [
                1339,
                1341
            ],
            [
                1342,
                1346
            ],
            [
                1352,
                1437
            ],
            [
                1444,
                1489
            ],
            [
                1489,
                1530
            ],
            [
                1534,
                1537
            ],
            [
                1550,
                1552
            ],
            [
                1552,
                1570
            ],
            [
                1571,
                1597
            ],
            [
                1603,
                1611
            ],
            [
                1612,
                1678
            ],
            [
                1685,
                1696
            ],
            [
                1707,
                1709
            ],
            [
                1710,
                1714
            ],
            [
                1715,
                1718
            ],
            [
                1719,
                1724
            ],
            [
                1724,
                1743
            ],
            [
                1744,
                1761
            ],
            [
                1762,
                1778
            ],
            [
                1778,
                1780
            ],
            [
                1780,
                1840
            ],
            [
                1840,
                1881
            ],
            [
                1881,
                1883
            ],
            [
                1909,
                1921
            ],
            [
                1928,
                2119
            ],
            [
                2120,
                2126
            ],
            [
                2126,
                2225
            ],
            [
                2229,
                2238
            ],
            [
                2242,
                2244
            ],
            [
                2244,
                2363
            ],
            [
                2363,
                2381
            ],
            [
                2384,
                2397
            ],
            [
                2400,
                2444
            ],
            [
                2446,
                2468
            ],
            [
                2468,
                2523
            ],
            [
                2524,
                2561
            ],
            [
                2561,
                2564
            ],
            [
                2569,
                2600
            ],
            [
                2600,
                2636
            ],
            [
                2636,
                2650
            ],
            [
                2650,
                2652
            ],
            [
                2652,
                2666
            ],
            [
                2667,
                2682
            ],
            [
                2683,
                2700
            ],
            [
                2706,
                2739
            ],
            [
                2739,
                2762
            ],
            [
                2762,
                2795
            ],
            [
                2795,
                2821
            ],
            [
                2821,
                2826
            ],
            [
                2826,
                2834
            ],
            [
                2834,
                2860
            ],
            [
                2860,
                2871
            ],
            [
                2872,
                2943
            ],
            [
                2944,
                3084
            ],
            [
                3094,
                3119
            ],
            [
                3129,
                3134
            ],
            [
                3134,
                3135
            ],
            [
                3136,
                3148
            ],
            [
                3196,
                3199
            ],
            [
                3246,
                3251
            ],
            [
                3255,
                3256
            ],
            [
                3275,
                3278
            ],
            [
                3318,
                3319
            ],
            [
                3333,
                3335
            ],
            [
                3385,
                3388
            ],
            [
                3418,
                3433
            ],
            [
                3433,
                3494
            ],
            [
                3495,
                3567
            ],
            [
                3568,
                3583
            ],
            [
                3583,
                3626
            ],
            [
                3627,
                3634
            ],
            [
                3635,
                3682
            ],
            [
                3682,
                3783
            ],
            [
                3783,
                3831
            ],
            [
                3831,
                3836
            ],
            [
                3836,
                3869
            ],
            [
                3869,
                3895
            ],
            [
                3895,
                3919
            ],
            [
                3922,
                3987
            ],
            [
                3987,
                4044
            ],
            [
                4049,
                4066
            ],
            [
                4071,
                4073
            ],
            [
                4073,
                4092
            ],
            [
                4092,
                4117
            ],
            [
                4117,
                4210
            ],
            [
                4211,
                4253
            ],
            [
                4254,
                4277
            ],
            [
                4277,
                4318
            ],
            [
                4318,
                4320
            ],
            [
                4321,
                4341
            ],
            [
                4341,
                4391
            ],
            [
                4395,
                4406
            ],
            [
                4406,
                4408
            ],
            [
                4408,
                4432
            ],
            [
                4433,
                4443
            ],
            [
                4443,
                4473
            ],
            [
                4473,
                4500
            ],
            [
                4503,
                4577
            ],
            [
                4577,
                4586
            ],
            [
                4586,
                4626
            ],
            [
                4627,
                4644
            ],
            [
                4645,
                4706
            ],
            [
                4706,
                4745
            ],
            [
                4745,
                4759
            ],
            [
                4770,
                4863
            ],
            [
                4869,
                4872
            ],
            [
                4879,
                4900
            ],
            [
                4900,
                4902
            ],
            [
                4904,
                4991
            ],
            [
                4991,
                5046
            ],
            [
                5046,
                5065
            ],
            [
                5066,
                5166
            ],
            [
                5166,
                5168
            ],
            [
                5168,
                5194
            ],
            [
                5202,
                5216
            ],
            [
                5216,
                5229
            ],
            [
                5230,
                5245
            ],
            [
                5246,
                5264
            ],
            [
                5264,
                5266
            ],
            [
                5268,
                5284
            ],
            [
                5285,
                5349
            ],
            [
                5350,
                5378
            ],
            [
                5379,
                5462
            ],
            [
                5463,
                5465
            ],
            [
                5466,
                5471
            ],
            [
                5478,
                5541
            ],
            [
                5542,
                5565
            ],
            [
                5566,
                5581
            ],
            [
                5581,
                5583
            ],
            [
                5583,
                5621
            ],
            [
                5622,
                5681
            ],
            [
                5682,
                5690
            ],
            [
                5695,
                5716
            ],
            [
                5717,
                5720
            ],
            [
                5721,
                5737
            ],
            [
                5744,
                5746
            ],
            [
                5746,
                5822
            ],
            [
                5822,
                5824
            ],
            [
                5824,
                5942
            ],
            [
                5942,
                6007
            ],
            [
                6007,
                6019
            ],
            [
                6019,
                6065
            ],
            [
                6073,
                6084
            ],
            [
                6085,
                6087
            ],
            [
                6098,
                6104
            ],
            [
                6104,
                6106
            ],
            [
                6106,
                6171
            ],
            [
                6172,
                6193
            ],
            [
                6194,
                6238
            ],
            [
                6247,
                6280
            ],
            [
                6280,
                6359
            ],
            [
                6359,
                6393
            ],
            [
                6393,
                6421
            ],
            [
                6421,
                6447
            ],
            [
                6447,
                6675
            ],
            [
                6675,
                6695
            ],
            [
                6695,
                6707
            ],
            [
                6707,
                6739
            ],
            [
                6739,
                6751
            ],
            [
                6752,
                6758
            ],
            [
                6759,
                6762
            ],
            [
                6773,
                6784
            ],
            [
                6784,
                6785
            ],
            [
                6786,
                6792
            ],
            [
                6793,
                6865
            ],
            [
                6865,
                6894
            ],
            [
                6894,
                6923
            ],
            [
                6924,
                6961
            ],
            [
                6961,
                6962
            ],
            [
                6963,
                6976
            ],
            [
                6980,
                6984
            ],
            [
                6984,
                6986
            ],
            [
                6987,
                7031
            ],
            [
                7033,
                7104
            ],
            [
                7104,
                7105
            ],
            [
                7106,
                7131
            ],
            [
                7131,
                7255
            ],
            [
                7256,
                7266
            ],
            [
                7266,
                7269
            ],
            [
                7270,
                7284
            ],
            [
                7285,
                7292
            ],
            [
                7293,
                7295
            ],
            [
                7296,
                7386
            ],
            [
                7390,
                7418
            ],
            [
                7418,
                7419
            ],
            [
                7420,
                7476
            ],
            [
                7477,
                7522
            ],
            [
                7522,
                7573
            ],
            [
                7573,
                7574
            ],
            [
                7575,
                7576
            ],
            [
                7576,
                7582
            ],
            [
                7583,
                7637
            ],
            [
                7637,
                7640
            ],
            [
                7640,
                7733
            ],
            [
                7733,
                7760
            ],
            [
                7760,
                7778
            ],
            [
                7778,
                7781
            ],
            [
                7781,
                7784
            ],
            [
                7784,
                7803
            ],
            [
                7803,
                7824
            ],
            [
                7824,
                7832
            ],
            [
                7833,
                7852
            ],
            [
                7852,
                7873
            ],
            [
                7873,
                7910
            ],
            [
                7910,
                7912
            ],
            [
                7912,
                7934
            ],
            [
                7940,
                7950
            ],
            [
                7950,
                7973
            ],
            [
                7976,
                8073
            ],
            [
                8076,
                8129
            ],
            [
                8130,
                8164
            ],
            [
                8172,
                8185
            ],
            [
                8185,
                8206
            ],
            [
                8208,
                8217
            ],
            [
                8217,
                8218
            ],
            [
                8219,
                8221
            ],
            [
                8222,
                8245
            ],
            [
                8245,
                8246
            ],
            [
                8247,
                8266
            ],
            [
                8266,
                8361
            ],
            [
                8362,
                8365
            ],
            [
                8369,
                8374
            ],
            [
                8374,
                8482
            ],
            [
                8483,
                8486
            ],
            [
                8487,
                8489
            ],
            [
                8490,
                8505
            ],
            [
                8506,
                8509
            ],
            [
                8510,
                8515
            ],
            [
                8515,
                8572
            ],
            [
                8572,
                8596
            ],
            [
                8596,
                8616
            ],
            [
                8616,
                8618
            ],
            [
                8618,
                8621
            ],
            [
                8621,
                8644
            ],
            [
                8650,
                8686
            ],
            [
                8689,
                8737
            ],
            [
                8739,
                8836
            ],
            [
                8837,
                8925
            ],
            [
                8926,
                8934
            ],
            [
                8934,
                8960
            ],
            [
                8960,
                8983
            ],
            [
                8995,
                9001
            ],
            [
                9001,
                9023
            ],
            [
                9031,
                9049
            ],
            [
                9049,
                9145
            ],
            [
                9145,
                9173
            ],
            [
                9174,
                9195
            ],
            [
                9205,
                9222
            ],
            [
                9229,
                9266
            ],
            [
                9271,
                9276
            ],
            [
                9277,
                9302
            ],
            [
                9303,
                9308
            ],
            [
                9308,
                9373
            ],
            [
                9376,
                9388
            ],
            [
                9392,
                9430
            ],
            [
                9431,
                9485
            ],
            [
                9485,
                9493
            ],
            [
                9494,
                9570
            ],
            [
                9571,
                9627
            ],
            [
                9627,
                9673
            ],
            [
                9681,
                9684
            ],
            [
                9684,
                9712
            ],
            [
                9712,
                9760
            ],
            [
                9761,
                9817
            ],
            [
                9818,
                9855
            ],
            [
                9855,
                9911
            ],
            [
                9911,
                9913
            ],
            [
                9913,
                9963
            ],
            [
                9963,
                9989
            ],
            [
                9989,
                10007
            ],
            [
                10007,
                10015
            ],
            [
                10015,
                10024
            ],
            [
                10024,
                10055
            ],
            [
                10056,
                10069
            ],
            [
                10069,
                10123
            ],
            [
                10123,
                10126
            ],
            [
                10134,
                10251
            ],
            [
                10251,
                10296
            ],
            [
                10296,
                10338
            ],
            [
                10338,
                10341
            ],
            [
                10347,
                10392
            ],
            [
                10392,
                10394
            ],
            [
                10394,
                10452
            ],
            [
                10452,
                10454
            ],
            [
                10454,
                10480
            ],
            [
                10480,
                10481
            ],
            [
                10481,
                10513
            ],
            [
                10513,
                10584
            ],
            [
                10584,
                10586
            ],
            [
                10586,
                10610
            ],
            [
                10610,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10679
            ],
            [
                10679,
                10776
            ],
            [
                10782,
                10800
            ],
            [
                10800,
                10814
            ],
            [
                10814,
                10833
            ],
            [
                10834,
                10836
            ],
            [
                10840,
                10851
            ],
            [
                10854,
                10860
            ],
            [
                10861,
                10894
            ],
            [
                10894,
                10896
            ],
            [
                10896,
                10904
            ],
            [
                10914,
                10988
            ],
            [
                10988,
                11030
            ],
            [
                11033,
                11092
            ]
        ],
        "row_chars": [
            [
                0,
                38
            ],
            [
                38,
                67
            ],
            [
                67,
                122
            ],
            [
                122,
                405
            ],
            [
                405,
                573
            ],
            [
                573,
                623
            ],
            [
                623,
                699
            ],
            [
                699,
                890
            ],
            [
                890,
                1058
            ],
            [
                1058,
                1162
            ],
            [
                1162,
                1219
            ],
            [
                1219,
                1219
            ],
            [
                1219,
                1489
            ],
            [
                1489,
                1552
            ],
            [
                1552,
                1724
            ],
            [
                1724,
                1780
            ],
            [
                1780,
                1840
            ],
            [
                1840,
                1883
            ],
            [
                1883,
                2244
            ],
            [
                2244,
                2363
            ],
            [
                2363,
                2363
            ],
            [
                2363,
                2363
            ],
            [
                2363,
                2363
            ],
            [
                2363,
                2445
            ],
            [
                2445,
                2468
            ],
            [
                2468,
                2561
            ],
            [
                2561,
                2561
            ],
            [
                2561,
                2561
            ],
            [
                2561,
                2600
            ],
            [
                2600,
                2636
            ],
            [
                2636,
                2652
            ],
            [
                2652,
                2652
            ],
            [
                2652,
                2739
            ],
            [
                2739,
                2762
            ],
            [
                2762,
                2795
            ],
            [
                2795,
                2821
            ],
            [
                2821,
                2826
            ],
            [
                2826,
                2834
            ],
            [
                2834,
                2860
            ],
            [
                2860,
                3136
            ],
            [
                3136,
                3409
            ],
            [
                3409,
                3433
            ],
            [
                3433,
                3682
            ],
            [
                3682,
                3783
            ],
            [
                3783,
                3831
            ],
            [
                3831,
                3836
            ],
            [
                3836,
                3869
            ],
            [
                3869,
                3895
            ],
            [
                3895,
                3987
            ],
            [
                3987,
                4073
            ],
            [
                4073,
                4092
            ],
            [
                4092,
                4117
            ],
            [
                4117,
                4277
            ],
            [
                4277,
                4318
            ],
            [
                4318,
                4341
            ],
            [
                4341,
                4408
            ],
            [
                4408,
                4473
            ],
            [
                4473,
                4503
            ],
            [
                4503,
                4503
            ],
            [
                4503,
                4577
            ],
            [
                4577,
                4586
            ],
            [
                4586,
                4706
            ],
            [
                4706,
                4706
            ],
            [
                4706,
                4745
            ],
            [
                4745,
                4902
            ],
            [
                4902,
                4991
            ],
            [
                4991,
                4991
            ],
            [
                4991,
                5046
            ],
            [
                5046,
                5168
            ],
            [
                5168,
                5216
            ],
            [
                5216,
                5266
            ],
            [
                5266,
                5583
            ],
            [
                5583,
                5746
            ],
            [
                5746,
                5824
            ],
            [
                5824,
                5824
            ],
            [
                5824,
                5942
            ],
            [
                5942,
                6007
            ],
            [
                6007,
                6007
            ],
            [
                6007,
                6019
            ],
            [
                6019,
                6106
            ],
            [
                6106,
                6280
            ],
            [
                6280,
                6359
            ],
            [
                6359,
                6421
            ],
            [
                6421,
                6447
            ],
            [
                6447,
                6675
            ],
            [
                6675,
                6695
            ],
            [
                6695,
                6707
            ],
            [
                6707,
                6739
            ],
            [
                6739,
                6786
            ],
            [
                6786,
                6865
            ],
            [
                6865,
                6894
            ],
            [
                6894,
                6963
            ],
            [
                6963,
                6986
            ],
            [
                6986,
                6986
            ],
            [
                6986,
                6986
            ],
            [
                6986,
                7033
            ],
            [
                7033,
                7033
            ],
            [
                7033,
                7131
            ],
            [
                7131,
                7266
            ],
            [
                7266,
                7522
            ],
            [
                7522,
                7637
            ],
            [
                7637,
                7760
            ],
            [
                7760,
                7760
            ],
            [
                7760,
                7778
            ],
            [
                7778,
                7784
            ],
            [
                7784,
                7803
            ],
            [
                7803,
                7824
            ],
            [
                7824,
                7852
            ],
            [
                7852,
                7873
            ],
            [
                7873,
                7912
            ],
            [
                7912,
                7950
            ],
            [
                7950,
                7950
            ],
            [
                7950,
                8185
            ],
            [
                8185,
                8185
            ],
            [
                8185,
                8185
            ],
            [
                8185,
                8206
            ],
            [
                8206,
                8266
            ],
            [
                8266,
                8572
            ],
            [
                8572,
                8596
            ],
            [
                8596,
                8596
            ],
            [
                8596,
                8596
            ],
            [
                8596,
                8618
            ],
            [
                8618,
                8960
            ],
            [
                8960,
                9049
            ],
            [
                9049,
                9145
            ],
            [
                9145,
                9373
            ],
            [
                9373,
                9485
            ],
            [
                9485,
                9571
            ],
            [
                9571,
                9571
            ],
            [
                9571,
                9571
            ],
            [
                9571,
                9571
            ],
            [
                9571,
                9627
            ],
            [
                9627,
                9684
            ],
            [
                9684,
                9712
            ],
            [
                9712,
                9855
            ],
            [
                9855,
                9913
            ],
            [
                9913,
                9963
            ],
            [
                9963,
                9989
            ],
            [
                9989,
                10007
            ],
            [
                10007,
                10015
            ],
            [
                10015,
                10024
            ],
            [
                10024,
                10069
            ],
            [
                10069,
                10123
            ],
            [
                10123,
                10251
            ],
            [
                10251,
                10296
            ],
            [
                10296,
                10338
            ],
            [
                10338,
                10394
            ],
            [
                10394,
                10454
            ],
            [
                10454,
                10480
            ],
            [
                10480,
                10513
            ],
            [
                10513,
                10586
            ],
            [
                10586,
                10610
            ],
            [
                10610,
                10639
            ],
            [
                10639,
                10659
            ],
            [
                10659,
                10679
            ],
            [
                10679,
                10800
            ],
            [
                10800,
                10896
            ],
            [
                10896,
                10988
            ],
            [
                10988,
                11092
            ]
        ]
    }
}