{
    "original": {
        "text": "Chesney Wold is shut up, carpets are rolled into great scrolls in corners of comfortless rooms, bright damask does penance in brown holland, carving and gilding puts on mortification, and the Dedlock ancestors retire from the light of day again. Around and around the house the leaves fall thick, but never fast, for they come circling down with a dead lightness that is sombre and slow. Let the gardener sweep and sweep the turf as he will, and press the leaves into full barrows, and wheel them off, still they lie ankle-deep. Howls the shrill wind round Chesney Wold; the sharp rain beats, the windows rattle, and the chimneys growl. Mists hide in the avenues, veil the points of view, and move in funeral-wise across the rising grounds. On all the house there is a cold, blank smell like the smell of a little church, though something dryer, suggesting that the dead and buried Dedlocks walk there in the long nights and leave the flavour of their graves behind them.\nBut the house in town, which is rarely in the same mind as Chesney Wold at the same time, seldom rejoicing when it rejoices or mourning when it mourns, excepting when a Dedlock dies--the house in town shines out awakened. As warm and bright as so much state may be, as delicately redolent of pleasant scents that bear no trace of winter as hothouse flowers can make it, soft and hushed so that the ticking of the clocks and the crisp burning of the fires alone disturb the stillness in the rooms, it seems to wrap those chilled bones of Sir Leicester's in rainbow-coloured wool. And Sir Leicester is glad to repose in dignified contentment before the great fire in the library, condescendingly perusing the backs of his books or honouring the fine arts with a glance of approbation. For he has his pictures, ancient and modern. Some of the Fancy Ball School in which art occasionally condescends to become a master, which would be best catalogued like the miscellaneous articles in a sale. As \"Three high-backed chairs, a table and cover, long-necked bottle (containing wine), one flask, one Spanish female's costume, three-quarter face portrait of Miss Jogg the model, and a suit of armour containing Don Quixote.\" Or \"One stone terrace (cracked), one gondola in distance, one Venetian senator's dress complete, richly embroidered white satin costume with profile portrait of Miss Jogg the model, one Scimitar superbly mounted in gold with jewelled handle, elaborate Moorish dress (very rare), and Othello.\"\nMr. Tulkinghorn comes and goes pretty often, there being estate business to do, leases to be renewed, and so on. He sees my Lady pretty often, too; and he and she are as composed, and as indifferent, and take as little heed of one another, as ever. Yet it may be that my Lady fears this Mr. Tulkinghorn and that he knows it. It may be that he pursues her doggedly and steadily, with no touch of compunction, remorse, or pity. It may be that her beauty and all the state and brilliancy surrounding her only gives him the greater zest for what he is set upon and makes him the more inflexible in it. Whether he be cold and cruel, whether immovable in what he has made his duty, whether absorbed in love of power, whether determined to have nothing hidden from him in ground where he has burrowed among secrets all his life, whether he in his heart despises the splendour of which he is a distant beam, whether he is always treasuring up slights and offences in the affability of his gorgeous clients--whether he be any of this, or all of this, it may be that my Lady had better have five thousand pairs of fashionable eyes upon her, in distrustful vigilance, than the two eyes of this rusty lawyer with his wisp of neckcloth and his dull black breeches tied with ribbons at the knees.\nSir Leicester sits in my Lady's room--that room in which Mr. Tulkinghorn read the affidavit in Jarndyce and Jarndyce--particularly complacent. My Lady, as on that day, sits before the fire with her screen in her hand. Sir Leicester is particularly complacent because he has found in his newspaper some congenial remarks bearing directly on the floodgates and the framework of society. They apply so happily to the late case that Sir Leicester has come from the library to my Lady's room expressly to read them aloud. \"The man who wrote this article,\" he observes by way of preface, nodding at the fire as if he were nodding down at the man from a mount, \"has a well-balanced mind.\"\nThe man's mind is not so well balanced but that he bores my Lady, who, after a languid effort to listen, or rather a languid resignation of herself to a show of listening, becomes distraught and falls into a contemplation of the fire as if it were her fire at Chesney Wold, and she had never left it. Sir Leicester, quite unconscious, reads on through his double eye-glass, occasionally stopping to remove his glass and express approval, as \"Very true indeed,\" \"Very properly put,\" \"I have frequently made the same remark myself,\" invariably losing his place after each observation, and going up and down the column to find it again.\nSir Leicester is reading with infinite gravity and state when the door opens, and the Mercury in powder makes this strange announcement, \"The young man, my Lady, of the name of Guppy.\"\nSir Leicester pauses, stares, repeats in a killing voice, \"The young man of the name of Guppy?\"\nLooking round, he beholds the young man of the name of Guppy, much discomfited and not presenting a very impressive letter of introduction in his manner and appearance.\n\"Pray,\" says Sir Leicester to Mercury, \"what do you mean by announcing with this abruptness a young man of the name of Guppy?\"\n\"I beg your pardon, Sir Leicester, but my Lady said she would see the young man whenever he called. I was not aware that you were here, Sir Leicester.\"\nWith this apology, Mercury directs a scornful and indignant look at the young man of the name of Guppy which plainly says, \"What do you come calling here for and getting ME into a row?\"\n\"It's quite right. I gave him those directions,\" says my Lady. \"Let the young man wait.\"\n\"By no means, my Lady. Since he has your orders to come, I will not interrupt you.\" Sir Leicester in his gallantry retires, rather declining to accept a bow from the young man as he goes out and majestically supposing him to be some shoemaker of intrusive appearance.\nLady Dedlock looks imperiously at her visitor when the servant has left the room, casting her eyes over him from head to foot. She suffers him to stand by the door and asks him what he wants.\n\"That your ladyship would have the kindness to oblige me with a little conversation,\" returns Mr. Guppy, embarrassed.\n\"You are, of course, the person who has written me so many letters?\"\n\"Several, your ladyship. Several before your ladyship condescended to favour me with an answer.\"\n\"And could you not take the same means of rendering a Conversation unnecessary? Can you not still?\"\nMr. Guppy screws his mouth into a silent \"No!\" and shakes his head.\n\"You have been strangely importunate. If it should appear, after all, that what you have to say does not concern me--and I don't know how it can, and don't expect that it will--you will allow me to cut you short with but little ceremony. Say what you have to say, if you please.\"\nMy Lady, with a careless toss of her screen, turns herself towards the fire again, sitting almost with her back to the young man of the name of Guppy.\n\"With your ladyship's permission, then,\" says the young man, \"I will now enter on my business. Hem! I am, as I told your ladyship in my first letter, in the law. Being in the law, I have learnt the habit of not committing myself in writing, and therefore I did not mention to your ladyship the name of the firm with which I am connected and in which my standing--and I may add income--is tolerably good. I may now state to your ladyship, in confidence, that the name of that firm is Kenge and Carboy, of Lincoln's Inn, which may not be altogether unknown to your ladyship in connexion with the case in Chancery of Jarndyce and Jarndyce.\"\nMy Lady's figure begins to be expressive of some attention. She has ceased to toss the screen and holds it as if she were listening.\n\"Now, I may say to your ladyship at once,\" says Mr. Guppy, a little emboldened, \"it is no matter arising out of Jarndyce and Jarndyce that made me so desirous to speak to your ladyship, which conduct I have no doubt did appear, and does appear, obtrusive--in fact, almost blackguardly.\"\nAfter waiting for a moment to receive some assurance to the contrary, and not receiving any, Mr. Guppy proceeds, \"If it had been Jarndyce and Jarndyce, I should have gone at once to your ladyship's solicitor, Mr. Tulkinghorn, of the Fields. I have the pleasure of being acquainted with Mr. Tulkinghorn--at least we move when we meet one another--and if it had been any business of that sort, I should have gone to him.\"\nMy Lady turns a little round and says, \"You had better sit down.\"\n\"Thank your ladyship.\" Mr. Guppy does so. \"Now, your ladyship\"--Mr. Guppy refers to a little slip of paper on which he has made small notes of his line of argument and which seems to involve him in the densest obscurity whenever he looks at it--\"I--Oh, yes!--I place myself entirely in your ladyship's hands. If your ladyship was to make any complaint to Kenge and Carboy or to Mr. Tulkinghorn of the present visit, I should be placed in a very disagreeable situation. That, I openly admit. Consequently, I rely upon your ladyship's honour.\"\nMy Lady, with a disdainful gesture of the hand that holds the screen, assures him of his being worth no complaint from her.\n\"Thank your ladyship,\" says Mr. Guppy; \"quite satisfactory. Now--I--dash it!--The fact is that I put down a head or two here of the order of the points I thought of touching upon, and they're written short, and I can't quite make out what they mean. If your ladyship will excuse me taking it to the window half a moment, I--\"\nMr. Guppy, going to the window, tumbles into a pair of love-birds, to whom he says in his confusion, \"I beg your pardon, I am sure.\" This does not tend to the greater legibility of his notes. He murmurs, growing warm and red and holding the slip of paper now close to his eyes, now a long way off, \"C.S. What's C.S. for? Oh! C.S.! Oh, I know! Yes, to be sure!\" And comes back enlightened.\n\"I am not aware,\" says Mr. Guppy, standing midway between my Lady and his chair, \"whether your ladyship ever happened to hear of, or to see, a young lady of the name of Miss Esther Summerson.\"\nMy Lady's eyes look at him full. \"I saw a young lady of that name not long ago. This past autumn.\"\n\"Now, did it strike your ladyship that she was like anybody?\" asks Mr. Guppy, crossing his arms, holding his head on one side, and scratching the corner of his mouth with his memoranda.\nMy Lady removes her eyes from him no more.\n\"No.\"\n\"Not like your ladyship's family?\"\n\"No.\"\n\"I think your ladyship,\" says Mr. Guppy, \"can hardly remember Miss Summerson's face?\"\n\"I remember the young lady very well. What has this to do with me?\"\n\"Your ladyship, I do assure you that having Miss Summerson's image imprinted on my 'eart--which I mention in confidence--I found, when I had the honour of going over your ladyship's mansion of Chesney Wold while on a short out in the county of Lincolnshire with a friend, such a resemblance between Miss Esther Summerson and your ladyship's own portrait that it completely knocked me over, so much so that I didn't at the moment even know what it WAS that knocked me over. And now I have the honour of beholding your ladyship near (I have often, since that, taken the liberty of looking at your ladyship in your carriage in the park, when I dare say you was not aware of me, but I never saw your ladyship so near), it's really more surprising than I thought it.\"\nYoung man of the name of Guppy! There have been times, when ladies lived in strongholds and had unscrupulous attendants within call, when that poor life of yours would NOT have been worth a minute's purchase, with those beautiful eyes looking at you as they look at this moment.\nMy Lady, slowly using her little hand-screen as a fan, asks him again what he supposes that his taste for likenesses has to do with her.\n\"Your ladyship,\" replies Mr. Guppy, again referring to his paper, \"I am coming to that. Dash these notes! Oh! 'Mrs. Chadband.' Yes.\" Mr. Guppy draws his chair a little forward and seats himself again. My Lady reclines in her chair composedly, though with a trifle less of graceful ease than usual perhaps, and never falters in her steady gaze. \"A--stop a minute, though!\" Mr. Guppy refers again. \"E.S. twice? Oh, yes! Yes, I see my way now, right on.\"\nRolling up the slip of paper as an instrument to point his speech with, Mr. Guppy proceeds.\n\"Your ladyship, there is a mystery about Miss Esther Summerson's birth and bringing up. I am informed of that fact because--which I mention in confidence--I know it in the way of my profession at Kenge and Carboy's. Now, as I have already mentioned to your ladyship, Miss Summerson's image is imprinted on my 'eart. If I could clear this mystery for her, or prove her to be well related, or find that having the honour to be a remote branch of your ladyship's family she had a right to be made a party in Jarndyce and Jarndyce, why, I might make a sort of a claim upon Miss Summerson to look with an eye of more dedicated favour on my proposals than she has exactly done as yet. In fact, as yet she hasn't favoured them at all.\"\nA kind of angry smile just dawns upon my Lady's face.\n\"Now, it's a very singular circumstance, your ladyship,\" says Mr. Guppy, \"though one of those circumstances that do fall in the way of us professional men--which I may call myself, for though not admitted, yet I have had a present of my articles made to me by Kenge and Carboy, on my mother's advancing from the principal of her little income the money for the stamp, which comes heavy--that I have encountered the person who lived as servant with the lady who brought Miss Summerson up before Mr. Jarndyce took charge of her. That lady was a Miss Barbary, your ladyship.\"\nIs the dead colour on my Lady's face reflected from the screen which has a green silk ground and which she holds in her raised hand as if she had forgotten it, or is it a dreadful paleness that has fallen on her?\n\"Did your ladyship,\" says Mr. Guppy, \"ever happen to hear of Miss Barbary?\"\n\"I don't know. I think so. Yes.\"\n\"Was Miss Barbary at all connected with your ladyship's family?\"\nMy Lady's lips move, but they utter nothing. She shakes her head.\n\"NOT connected?\" says Mr. Guppy. \"Oh! Not to your ladyship's knowledge, perhaps? Ah! But might be? Yes.\" After each of these interrogatories, she has inclined her head. \"Very good! Now, this Miss Barbary was extremely close--seems to have been extraordinarily close for a female, females being generally (in common life at least) rather given to conversation--and my witness never had an idea whether she possessed a single relative. On one occasion, and only one, she seems to have been confidential to my witness on a single point, and she then told her that the little girl's real name was not Esther Summerson, but Esther Hawdon.\"\n\"My God!\"\nMr. Guppy stares. Lady Dedlock sits before him looking him through, with the same dark shade upon her face, in the same attitude even to the holding of the screen, with her lips a little apart, her brow a little contracted, but for the moment dead. He sees her consciousness return, sees a tremor pass across her frame like a ripple over water, sees her lips shake, sees her compose them by a great effort, sees her force herself back to the knowledge of his presence and of what he has said. All this, so quickly, that her exclamation and her dead condition seem to have passed away like the features of those long-preserved dead bodies sometimes opened up in tombs, which, struck by the air like lightning, vanish in a breath.\n\"Your ladyship is acquainted with the name of Hawdon?\"\n\"I have heard it before.\"\n\"Name of any collateral or remote branch of your ladyship's family?\"\n\"No.\"\n\"Now, your ladyship,\" says Mr. Guppy, \"I come to the last point of the case, so far as I have got it up. It's going on, and I shall gather it up closer and closer as it goes on. Your ladyship must know--if your ladyship don't happen, by any chance, to know already--that there was found dead at the house of a person named Krook, near Chancery Lane, some time ago, a law-writer in great distress. Upon which law-writer there was an inquest, and which law-writer was an anonymous character, his name being unknown. But, your ladyship, I have discovered very lately that that law-writer's name was Hawdon.\"\n\"And what is THAT to me?\"\n\"Aye, your ladyship, that's the question! Now, your ladyship, a queer thing happened after that man's death. A lady started up, a disguised lady, your ladyship, who went to look at the scene of action and went to look at his grave. She hired a crossing-sweeping boy to show it her. If your ladyship would wish to have the boy produced in corroboration of this statement, I can lay my hand upon him at any time.\"\nThe wretched boy is nothing to my Lady, and she does NOT wish to have him produced.\n\"Oh, I assure your ladyship it's a very queer start indeed,\" says Mr. Guppy. \"If you was to hear him tell about the rings that sparkled on her fingers when she took her glove off, you'd think it quite romantic.\"\nThere are diamonds glittering on the hand that holds the screen. My Lady trifles with the screen and makes them glitter more, again with that expression which in other times might have been so dangerous to the young man of the name of Guppy.\n\"It was supposed, your ladyship, that he left no rag or scrap behind him by which he could be possibly identified. But he did. He left a bundle of old letters.\"\nThe screen still goes, as before. All this time her eyes never once release him.\n\"They were taken and secreted. And to-morrow night, your ladyship, they will come into my possession.\"\n\"Still I ask you, what is this to me?\"\n\"Your ladyship, I conclude with that.\" Mr. Guppy rises. \"If you think there's enough in this chain of circumstances put together--in the undoubted strong likeness of this young lady to your ladyship, which is a positive fact for a jury; in her having been brought up by Miss Barbary; in Miss Barbary stating Miss Summerson's real name to be Hawdon; in your ladyship's knowing both these names VERY WELL; and in Hawdon's dying as he did--to give your ladyship a family interest in going further into the case, I will bring these papers here. I don't know what they are, except that they are old letters: I have never had them in my possession yet. I will bring those papers here as soon as I get them and go over them for the first time with your ladyship. I have told your ladyship my object. I have told your ladyship that I should be placed in a very disagreeable situation if any complaint was made, and all is in strict confidence.\"\nIs this the full purpose of the young man of the name of Guppy, or has he any other? Do his words disclose the length, breadth, depth, of his object and suspicion in coming here; or if not, what do they hide? He is a match for my Lady there. She may look at him, but he can look at the table and keep that witness-box face of his from telling anything.\n\"You may bring the letters,\" says my Lady, \"if you choose.\"\n\"Your ladyship is not very encouraging, upon my word and honour,\" says Mr. Guppy, a little injured.\n\"You may bring the letters,\" she repeats in the same tone, \"if you--please.\"\n\"It shall be done. I wish your ladyship good day.\"\nOn a table near her is a rich bauble of a casket, barred and clasped like an old strong-chest. She, looking at him still, takes it to her and unlocks it.\n\"Oh! I assure your ladyship I am not actuated by any motives of that sort,\" says Mr. Guppy, \"and I couldn't accept anything of the kind. I wish your ladyship good day, and am much obliged to you all the same.\"\nSo the young man makes his bow and goes downstairs, where the supercilious Mercury does not consider himself called upon to leave his Olympus by the hall-fire to let the young man out.\nAs Sir Leicester basks in his library and dozes over his newspaper, is there no influence in the house to startle him, not to say to make the very trees at Chesney Wold fling up their knotted arms, the very portraits frown, the very armour stir?\nNo. Words, sobs, and cries are but air, and air is so shut in and shut out throughout the house in town that sounds need be uttered trumpet-tongued indeed by my Lady in her chamber to carry any faint vibration to Sir Leicester's ears; and yet this cry is in the house, going upward from a wild figure on its knees.\n\"O my child, my child! Not dead in the first hours of her life, as my cruel sister told me, but sternly nurtured by her, after she had renounced me and my name! O my child, O my child!\"",
        "paragraph_chars": [
            [
                0,
                972
            ],
            [
                972,
                2481
            ],
            [
                2481,
                3764
            ],
            [
                3764,
                4446
            ],
            [
                4446,
                5080
            ],
            [
                5080,
                5265
            ],
            [
                5265,
                5361
            ],
            [
                5361,
                5530
            ],
            [
                5530,
                5657
            ],
            [
                5657,
                5809
            ],
            [
                5809,
                5995
            ],
            [
                5995,
                6084
            ],
            [
                6084,
                6352
            ],
            [
                6352,
                6544
            ],
            [
                6544,
                6662
            ],
            [
                6662,
                6731
            ],
            [
                6731,
                6828
            ],
            [
                6828,
                6928
            ],
            [
                6928,
                6996
            ],
            [
                6996,
                7276
            ],
            [
                7276,
                7427
            ],
            [
                7427,
                8065
            ],
            [
                8065,
                8198
            ],
            [
                8198,
                8485
            ],
            [
                8485,
                8905
            ],
            [
                8905,
                8971
            ],
            [
                8971,
                9513
            ],
            [
                9513,
                9637
            ],
            [
                9637,
                9963
            ],
            [
                9963,
                10352
            ],
            [
                10352,
                10545
            ],
            [
                10545,
                10644
            ],
            [
                10644,
                10830
            ],
            [
                10830,
                10873
            ],
            [
                10873,
                10879
            ],
            [
                10879,
                10914
            ],
            [
                10914,
                10920
            ],
            [
                10920,
                11006
            ],
            [
                11006,
                11074
            ],
            [
                11074,
                11837
            ],
            [
                11837,
                12116
            ],
            [
                12116,
                12253
            ],
            [
                12253,
                12705
            ],
            [
                12705,
                12797
            ],
            [
                12797,
                13526
            ],
            [
                13526,
                13580
            ],
            [
                13580,
                14153
            ],
            [
                14153,
                14366
            ],
            [
                14366,
                14442
            ],
            [
                14442,
                14475
            ],
            [
                14475,
                14540
            ],
            [
                14540,
                14606
            ],
            [
                14606,
                15241
            ],
            [
                15241,
                15251
            ],
            [
                15251,
                15980
            ],
            [
                15980,
                16035
            ],
            [
                16035,
                16061
            ],
            [
                16061,
                16130
            ],
            [
                16130,
                16136
            ],
            [
                16136,
                16741
            ],
            [
                16741,
                16767
            ],
            [
                16767,
                17179
            ],
            [
                17179,
                17263
            ],
            [
                17263,
                17475
            ],
            [
                17475,
                17717
            ],
            [
                17717,
                17878
            ],
            [
                17878,
                17959
            ],
            [
                17959,
                18062
            ],
            [
                18062,
                18101
            ],
            [
                18101,
                19038
            ],
            [
                19038,
                19391
            ],
            [
                19391,
                19451
            ],
            [
                19451,
                19551
            ],
            [
                19551,
                19628
            ],
            [
                19628,
                19679
            ],
            [
                19679,
                19833
            ],
            [
                19833,
                20043
            ],
            [
                20043,
                20228
            ],
            [
                20228,
                20474
            ],
            [
                20474,
                20789
            ],
            [
                20789,
                20974
            ]
        ],
        "segment_chars": [
            [
                0,
                246
            ],
            [
                246,
                388
            ],
            [
                388,
                529
            ],
            [
                529,
                637
            ],
            [
                637,
                741
            ],
            [
                741,
                972
            ],
            [
                972,
                1194
            ],
            [
                1194,
                1551
            ],
            [
                1551,
                1755
            ],
            [
                1755,
                1800
            ],
            [
                1800,
                1962
            ],
            [
                1962,
                2188
            ],
            [
                2188,
                2481
            ],
            [
                2481,
                2594
            ],
            [
                2594,
                2730
            ],
            [
                2730,
                2806
            ],
            [
                2806,
                2907
            ],
            [
                2907,
                3079
            ],
            [
                3079,
                3764
            ],
            [
                3764,
                3907
            ],
            [
                3907,
                3982
            ],
            [
                3982,
                4149
            ],
            [
                4149,
                4281
            ],
            [
                4281,
                4446
            ],
            [
                4446,
                4747
            ],
            [
                4747,
                5080
            ],
            [
                5080,
                5265
            ],
            [
                5265,
                5361
            ],
            [
                5361,
                5530
            ],
            [
                5530,
                5657
            ],
            [
                5657,
                5757
            ],
            [
                5757,
                5809
            ],
            [
                5809,
                5995
            ],
            [
                5995,
                6014
            ],
            [
                6014,
                6058
            ],
            [
                6058,
                6084
            ],
            [
                6084,
                6107
            ],
            [
                6107,
                6168
            ],
            [
                6168,
                6352
            ],
            [
                6352,
                6479
            ],
            [
                6479,
                6544
            ],
            [
                6544,
                6662
            ],
            [
                6662,
                6731
            ],
            [
                6731,
                6756
            ],
            [
                6756,
                6828
            ],
            [
                6828,
                6908
            ],
            [
                6908,
                6928
            ],
            [
                6928,
                6975
            ],
            [
                6975,
                6996
            ],
            [
                6996,
                7034
            ],
            [
                7034,
                7234
            ],
            [
                7234,
                7276
            ],
            [
                7276,
                7427
            ],
            [
                7427,
                7522
            ],
            [
                7522,
                7527
            ],
            [
                7527,
                7589
            ],
            [
                7589,
                7831
            ],
            [
                7831,
                8065
            ],
            [
                8065,
                8125
            ],
            [
                8125,
                8198
            ],
            [
                8198,
                8485
            ],
            [
                8485,
                8726
            ],
            [
                8726,
                8905
            ],
            [
                8905,
                8971
            ],
            [
                8971,
                8994
            ],
            [
                8994,
                9013
            ],
            [
                9013,
                9280
            ],
            [
                9280,
                9440
            ],
            [
                9440,
                9462
            ],
            [
                9462,
                9513
            ],
            [
                9513,
                9637
            ],
            [
                9637,
                9697
            ],
            [
                9697,
                9887
            ],
            [
                9887,
                9963
            ],
            [
                9963,
                10096
            ],
            [
                10096,
                10155
            ],
            [
                10155,
                10267
            ],
            [
                10267,
                10279
            ],
            [
                10279,
                10284
            ],
            [
                10284,
                10288
            ],
            [
                10288,
                10294
            ],
            [
                10294,
                10306
            ],
            [
                10306,
                10324
            ],
            [
                10324,
                10352
            ],
            [
                10352,
                10545
            ],
            [
                10545,
                10578
            ],
            [
                10578,
                10625
            ],
            [
                10625,
                10644
            ],
            [
                10644,
                10706
            ],
            [
                10706,
                10830
            ],
            [
                10830,
                10873
            ],
            [
                10873,
                10879
            ],
            [
                10879,
                10914
            ],
            [
                10914,
                10920
            ],
            [
                10920,
                11006
            ],
            [
                11006,
                11044
            ],
            [
                11044,
                11074
            ],
            [
                11074,
                11547
            ],
            [
                11547,
                11837
            ],
            [
                11837,
                11869
            ],
            [
                11869,
                12116
            ],
            [
                12116,
                12253
            ],
            [
                12253,
                12341
            ],
            [
                12341,
                12359
            ],
            [
                12359,
                12363
            ],
            [
                12363,
                12369
            ],
            [
                12369,
                12380
            ],
            [
                12380,
                12386
            ],
            [
                12386,
                12454
            ],
            [
                12454,
                12597
            ],
            [
                12597,
                12625
            ],
            [
                12625,
                12649
            ],
            [
                12649,
                12655
            ],
            [
                12655,
                12662
            ],
            [
                12662,
                12671
            ],
            [
                12671,
                12705
            ],
            [
                12705,
                12797
            ],
            [
                12797,
                12885
            ],
            [
                12885,
                13013
            ],
            [
                13013,
                13113
            ],
            [
                13113,
                13476
            ],
            [
                13476,
                13526
            ],
            [
                13526,
                13580
            ],
            [
                13580,
                14107
            ],
            [
                14107,
                14153
            ],
            [
                14153,
                14366
            ],
            [
                14366,
                14442
            ],
            [
                14442,
                14457
            ],
            [
                14457,
                14469
            ],
            [
                14469,
                14475
            ],
            [
                14475,
                14540
            ],
            [
                14540,
                14585
            ],
            [
                14585,
                14606
            ],
            [
                14606,
                14623
            ],
            [
                14623,
                14639
            ],
            [
                14639,
                14644
            ],
            [
                14644,
                14687
            ],
            [
                14687,
                14691
            ],
            [
                14691,
                14705
            ],
            [
                14705,
                14711
            ],
            [
                14711,
                14775
            ],
            [
                14775,
                14787
            ],
            [
                14787,
                15040
            ],
            [
                15040,
                15241
            ],
            [
                15241,
                15251
            ],
            [
                15251,
                15269
            ],
            [
                15269,
                15500
            ],
            [
                15500,
                15744
            ],
            [
                15744,
                15980
            ],
            [
                15980,
                16035
            ],
            [
                16035,
                16061
            ],
            [
                16061,
                16130
            ],
            [
                16130,
                16136
            ],
            [
                16136,
                16241
            ],
            [
                16241,
                16314
            ],
            [
                16314,
                16533
            ],
            [
                16533,
                16650
            ],
            [
                16650,
                16741
            ],
            [
                16741,
                16767
            ],
            [
                16767,
                16809
            ],
            [
                16809,
                16876
            ],
            [
                16876,
                16999
            ],
            [
                16999,
                17049
            ],
            [
                17049,
                17179
            ],
            [
                17179,
                17263
            ],
            [
                17263,
                17340
            ],
            [
                17340,
                17475
            ],
            [
                17475,
                17540
            ],
            [
                17540,
                17717
            ],
            [
                17717,
                17832
            ],
            [
                17832,
                17844
            ],
            [
                17844,
                17878
            ],
            [
                17878,
                17912
            ],
            [
                17912,
                17959
            ],
            [
                17959,
                17990
            ],
            [
                17990,
                18062
            ],
            [
                18062,
                18101
            ],
            [
                18101,
                18140
            ],
            [
                18140,
                18157
            ],
            [
                18157,
                18642
            ],
            [
                18642,
                18748
            ],
            [
                18748,
                18857
            ],
            [
                18857,
                18894
            ],
            [
                18894,
                19038
            ],
            [
                19038,
                19123
            ],
            [
                19123,
                19247
            ],
            [
                19247,
                19280
            ],
            [
                19280,
                19391
            ],
            [
                19391,
                19451
            ],
            [
                19451,
                19551
            ],
            [
                19551,
                19628
            ],
            [
                19628,
                19647
            ],
            [
                19647,
                19679
            ],
            [
                19679,
                19774
            ],
            [
                19774,
                19833
            ],
            [
                19833,
                19838
            ],
            [
                19838,
                19970
            ],
            [
                19970,
                20043
            ],
            [
                20043,
                20228
            ],
            [
                20228,
                20474
            ],
            [
                20474,
                20478
            ],
            [
                20478,
                20789
            ],
            [
                20789,
                20812
            ],
            [
                20812,
                20950
            ],
            [
                20950,
                20974
            ]
        ],
        "overlap_chars": [
            [
                0,
                62
            ],
            [
                94,
                109
            ],
            [
                123,
                131
            ],
            [
                182,
                246
            ],
            [
                257,
                388
            ],
            [
                392,
                404
            ],
            [
                500,
                529
            ],
            [
                529,
                592
            ],
            [
                613,
                616
            ],
            [
                593,
                611
            ],
            [
                635,
                637
            ],
            [
                637,
                672
            ],
            [
                687,
                697
            ],
            [
                701,
                724
            ],
            [
                732,
                741
            ],
            [
                741,
                766
            ],
            [
                792,
                795
            ],
            [
                769,
                786
            ],
            [
                802,
                806
            ],
            [
                814,
                820
            ],
            [
                844,
                972
            ],
            [
                972,
                975
            ],
            [
                1155,
                1194
            ],
            [
                1194,
                1215
            ],
            [
                1236,
                1240
            ],
            [
                1273,
                1275
            ],
            [
                1309,
                1485
            ],
            [
                1509,
                1524
            ],
            [
                1492,
                1505
            ],
            [
                1525,
                1551
            ],
            [
                1551,
                1729
            ],
            [
                1732,
                1738
            ],
            [
                1753,
                1755
            ],
            [
                1755,
                1798
            ],
            [
                1886,
                1887
            ],
            [
                1805,
                1807
            ],
            [
                1812,
                1817
            ],
            [
                2064,
                2071
            ],
            [
                2188,
                2190
            ],
            [
                2250,
                2258
            ],
            [
                1798,
                1799
            ],
            [
                2481,
                2524
            ],
            [
                2590,
                2592
            ],
            [
                2538,
                2553
            ],
            [
                2592,
                2594
            ],
            [
                2594,
                2679
            ],
            [
                2719,
                2730
            ],
            [
                2730,
                2762
            ],
            [
                2768,
                2806
            ],
            [
                2806,
                2875
            ],
            [
                2889,
                2896
            ],
            [
                2898,
                2907
            ],
            [
                2907,
                2936
            ],
            [
                2945,
                2950
            ],
            [
                2982,
                2986
            ],
            [
                2993,
                3041
            ],
            [
                3048,
                3051
            ],
            [
                3056,
                3071
            ],
            [
                3077,
                3079
            ],
            [
                3079,
                3086
            ],
            [
                3507,
                3509
            ],
            [
                3107,
                3108
            ],
            [
                3538,
                3610
            ],
            [
                3636,
                3703
            ],
            [
                3762,
                3764
            ],
            [
                3764,
                3800
            ],
            [
                3802,
                3880
            ],
            [
                3882,
                3907
            ],
            [
                3907,
                3982
            ],
            [
                3982,
                4149
            ],
            [
                4207,
                4281
            ],
            [
                4281,
                4326
            ],
            [
                4416,
                4446
            ],
            [
                4503,
                4510
            ],
            [
                4515,
                4560
            ],
            [
                4594,
                4596
            ],
            [
                4616,
                4625
            ],
            [
                4637,
                4679
            ],
            [
                4745,
                4747
            ],
            [
                4747,
                4789
            ],
            [
                4818,
                4844
            ],
            [
                4961,
                4967
            ],
            [
                4887,
                4906
            ],
            [
                4907,
                4925
            ],
            [
                4974,
                5080
            ],
            [
                5094,
                5126
            ],
            [
                5137,
                5165
            ],
            [
                5184,
                5265
            ],
            [
                5265,
                5286
            ],
            [
                5295,
                5302
            ],
            [
                5321,
                5361
            ],
            [
                5657,
                5755
            ],
            [
                5387,
                5421
            ],
            [
                5421,
                5439
            ],
            [
                5528,
                5530
            ],
            [
                5995,
                6014
            ],
            [
                6014,
                6058
            ],
            [
                6058,
                6084
            ],
            [
                6084,
                6107
            ],
            [
                6141,
                6168
            ],
            [
                6168,
                6181
            ],
            [
                6189,
                6193
            ],
            [
                6199,
                6207
            ],
            [
                6215,
                6326
            ],
            [
                6350,
                6352
            ],
            [
                6352,
                6432
            ],
            [
                6477,
                6479
            ],
            [
                6479,
                6482
            ],
            [
                6520,
                6544
            ],
            [
                6544,
                6662
            ],
            [
                6662,
                6670
            ],
            [
                6683,
                6731
            ],
            [
                6756,
                6763
            ],
            [
                6764,
                6828
            ],
            [
                6828,
                6846
            ],
            [
                6928,
                6937
            ],
            [
                6979,
                6996
            ],
            [
                6996,
                7034
            ],
            [
                7034,
                7111
            ],
            [
                7113,
                7118
            ],
            [
                7146,
                7171
            ],
            [
                7173,
                7207
            ],
            [
                7232,
                7234
            ],
            [
                7234,
                7259
            ],
            [
                7267,
                7276
            ],
            [
                7276,
                7283
            ],
            [
                7321,
                7404
            ],
            [
                7425,
                7427
            ],
            [
                7427,
                7472
            ],
            [
                7520,
                7521
            ],
            [
                7486,
                7489
            ],
            [
                7522,
                7527
            ],
            [
                7527,
                7587
            ],
            [
                7666,
                7671
            ],
            [
                7609,
                7666
            ],
            [
                7829,
                7831
            ],
            [
                7885,
                7896
            ],
            [
                7902,
                8065
            ],
            [
                8065,
                8081
            ],
            [
                8172,
                8198
            ],
            [
                8198,
                8199
            ],
            [
                8204,
                8213
            ],
            [
                8231,
                8284
            ],
            [
                8310,
                8336
            ],
            [
                8398,
                8399
            ],
            [
                8357,
                8382
            ],
            [
                8599,
                8613
            ],
            [
                8614,
                8655
            ],
            [
                8664,
                8709
            ],
            [
                8905,
                8912
            ],
            [
                8938,
                8971
            ],
            [
                8971,
                8977
            ],
            [
                8991,
                8994
            ],
            [
                8994,
                9013
            ],
            [
                9013,
                9033
            ],
            [
                9087,
                9089
            ],
            [
                9045,
                9077
            ],
            [
                9216,
                9217
            ],
            [
                9220,
                9227
            ],
            [
                9230,
                9280
            ],
            [
                9280,
                9367
            ],
            [
                9380,
                9440
            ],
            [
                9462,
                9513
            ],
            [
                9513,
                9547
            ],
            [
                9581,
                9637
            ],
            [
                9637,
                9677
            ],
            [
                9697,
                9700
            ],
            [
                9705,
                9712
            ],
            [
                9702,
                9703
            ],
            [
                9738,
                9742
            ],
            [
                9757,
                9761
            ],
            [
                9778,
                9820
            ],
            [
                9848,
                9866
            ],
            [
                9867,
                9870
            ],
            [
                10155,
                10157
            ],
            [
                10165,
                10166
            ],
            [
                10200,
                10217
            ],
            [
                10261,
                10267
            ],
            [
                10267,
                10277
            ],
            [
                10284,
                10288
            ],
            [
                10298,
                10306
            ],
            [
                10353,
                10367
            ],
            [
                10434,
                10545
            ],
            [
                10545,
                10578
            ],
            [
                10578,
                10623
            ],
            [
                10644,
                10706
            ],
            [
                10706,
                10740
            ],
            [
                10771,
                10774
            ],
            [
                10741,
                10769
            ],
            [
                10828,
                10830
            ],
            [
                10873,
                10879
            ],
            [
                10879,
                10914
            ],
            [
                10914,
                10920
            ],
            [
                10920,
                11006
            ],
            [
                11006,
                11044
            ],
            [
                11044,
                11074
            ],
            [
                11074,
                11162
            ],
            [
                11462,
                11463
            ],
            [
                11195,
                11279
            ],
            [
                11344,
                11462
            ],
            [
                11545,
                11547
            ],
            [
                11547,
                11604
            ],
            [
                11618,
                11619
            ],
            [
                11789,
                11831
            ],
            [
                11834,
                11837
            ],
            [
                12025,
                12026
            ],
            [
                12095,
                12099
            ],
            [
                12051,
                12071
            ],
            [
                11837,
                11868
            ],
            [
                12116,
                12123
            ],
            [
                12171,
                12207
            ],
            [
                12233,
                12253
            ],
            [
                12253,
                12341
            ],
            [
                12341,
                12359
            ],
            [
                12359,
                12363
            ],
            [
                12363,
                12369
            ],
            [
                12369,
                12380
            ],
            [
                12380,
                12385
            ],
            [
                12454,
                12521
            ],
            [
                12534,
                12596
            ],
            [
                12779,
                12796
            ],
            [
                12797,
                12885
            ],
            [
                12952,
                12958
            ],
            [
                12902,
                12911
            ],
            [
                12962,
                13013
            ],
            [
                13013,
                13113
            ],
            [
                13113,
                13329
            ],
            [
                13366,
                13380
            ],
            [
                13332,
                13337
            ],
            [
                13384,
                13393
            ],
            [
                13404,
                13408
            ],
            [
                13419,
                13476
            ],
            [
                13476,
                13526
            ],
            [
                13526,
                13547
            ],
            [
                13553,
                13580
            ],
            [
                13580,
                13585
            ],
            [
                13837,
                13839
            ],
            [
                13634,
                13654
            ],
            [
                13661,
                13692
            ],
            [
                13696,
                13734
            ],
            [
                13619,
                13620
            ],
            [
                13790,
                13796
            ],
            [
                13991,
                14066
            ],
            [
                14105,
                14107
            ],
            [
                14107,
                14153
            ],
            [
                14153,
                14204
            ],
            [
                14269,
                14272
            ],
            [
                14228,
                14238
            ],
            [
                14209,
                14215
            ],
            [
                14311,
                14366
            ],
            [
                14366,
                14408
            ],
            [
                14419,
                14442
            ],
            [
                14442,
                14457
            ],
            [
                14457,
                14467
            ],
            [
                14475,
                14479
            ],
            [
                14493,
                14540
            ],
            [
                14540,
                14585
            ],
            [
                14585,
                14606
            ],
            [
                14644,
                14687
            ],
            [
                14687,
                14691
            ],
            [
                14691,
                14705
            ],
            [
                14776,
                14785
            ],
            [
                14787,
                14829
            ],
            [
                14884,
                14885
            ],
            [
                14966,
                15040
            ],
            [
                15040,
                15055
            ],
            [
                15061,
                15065
            ],
            [
                15069,
                15074
            ],
            [
                15107,
                15241
            ],
            [
                15241,
                15251
            ],
            [
                15251,
                15269
            ],
            [
                15269,
                15297
            ],
            [
                15359,
                15379
            ],
            [
                15413,
                15500
            ],
            [
                15500,
                15502
            ],
            [
                15534,
                15657
            ],
            [
                15744,
                15747
            ],
            [
                15967,
                15971
            ],
            [
                15972,
                15980
            ],
            [
                15980,
                16035
            ],
            [
                16035,
                16061
            ],
            [
                16061,
                16073
            ],
            [
                16088,
                16130
            ],
            [
                16130,
                16136
            ],
            [
                16136,
                16211
            ],
            [
                16239,
                16241
            ],
            [
                16314,
                16337
            ],
            [
                16402,
                16485
            ],
            [
                16501,
                16533
            ],
            [
                16555,
                16576
            ],
            [
                16538,
                16543
            ],
            [
                16587,
                16650
            ],
            [
                16650,
                16741
            ],
            [
                16741,
                16767
            ],
            [
                16767,
                16809
            ],
            [
                16809,
                16876
            ],
            [
                16876,
                16882
            ],
            [
                16932,
                16957
            ],
            [
                16968,
                16999
            ],
            [
                16999,
                17049
            ],
            [
                17049,
                17101
            ],
            [
                17136,
                17179
            ],
            [
                17179,
                17263
            ],
            [
                17263,
                17264
            ],
            [
                17268,
                17295
            ],
            [
                17298,
                17308
            ],
            [
                17315,
                17340
            ],
            [
                17340,
                17472
            ],
            [
                17718,
                17754
            ],
            [
                17758,
                17765
            ],
            [
                17773,
                17810
            ],
            [
                17820,
                17832
            ],
            [
                17832,
                17844
            ],
            [
                17844,
                17878
            ],
            [
                17912,
                17959
            ],
            [
                17959,
                17979
            ],
            [
                17988,
                17990
            ],
            [
                17990,
                17993
            ],
            [
                18004,
                18062
            ],
            [
                18062,
                18101
            ],
            [
                18101,
                18118
            ],
            [
                18128,
                18140
            ],
            [
                18140,
                18157
            ],
            [
                18157,
                18216
            ],
            [
                18538,
                18642
            ],
            [
                18642,
                18716
            ],
            [
                18721,
                18725
            ],
            [
                18746,
                18748
            ],
            [
                18748,
                18857
            ],
            [
                18894,
                18919
            ],
            [
                19008,
                19011
            ],
            [
                19015,
                19038
            ],
            [
                19038,
                19123
            ],
            [
                19123,
                19144
            ],
            [
                19176,
                19179
            ],
            [
                19180,
                19247
            ],
            [
                19247,
                19272
            ],
            [
                19278,
                19280
            ],
            [
                19339,
                19367
            ],
            [
                19389,
                19391
            ],
            [
                19391,
                19451
            ],
            [
                19451,
                19503
            ],
            [
                19514,
                19551
            ],
            [
                19551,
                19617
            ],
            [
                19619,
                19628
            ],
            [
                19628,
                19647
            ],
            [
                19647,
                19679
            ],
            [
                19679,
                19727
            ],
            [
                19772,
                19774
            ],
            [
                19779,
                19793
            ],
            [
                19777,
                19778
            ],
            [
                19774,
                19777
            ],
            [
                19821,
                19833
            ],
            [
                19833,
                19838
            ],
            [
                19838,
                19860
            ],
            [
                19930,
                19968
            ],
            [
                19906,
                19923
            ],
            [
                19968,
                19970
            ],
            [
                19970,
                19999
            ],
            [
                20040,
                20043
            ],
            [
                20043,
                20077
            ],
            [
                20226,
                20228
            ],
            [
                20228,
                20244
            ],
            [
                20270,
                20294
            ],
            [
                20251,
                20253
            ],
            [
                20366,
                20369
            ],
            [
                20258,
                20265
            ],
            [
                20294,
                20346
            ],
            [
                20358,
                20365
            ],
            [
                20426,
                20474
            ],
            [
                20474,
                20478
            ],
            [
                20485,
                20489
            ],
            [
                20491,
                20504
            ],
            [
                20509,
                20535
            ],
            [
                20549,
                20582
            ],
            [
                20674,
                20683
            ],
            [
                20684,
                20748
            ],
            [
                20756,
                20789
            ],
            [
                20789,
                20812
            ],
            [
                20812,
                20950
            ],
            [
                20950,
                20974
            ]
        ],
        "row_chars": [
            [
                0,
                246
            ],
            [
                246,
                388
            ],
            [
                388,
                529
            ],
            [
                529,
                637
            ],
            [
                637,
                741
            ],
            [
                741,
                972
            ],
            [
                972,
                1194
            ],
            [
                1194,
                1551
            ],
            [
                1551,
                1755
            ],
            [
                1755,
                2481
            ],
            [
                2481,
                2594
            ],
            [
                2594,
                2730
            ],
            [
                2730,
                2806
            ],
            [
                2806,
                2907
            ],
            [
                2907,
                3079
            ],
            [
                3079,
                3764
            ],
            [
                3764,
                3907
            ],
            [
                3907,
                3982
            ],
            [
                3982,
                4149
            ],
            [
                4149,
                4281
            ],
            [
                4281,
                4446
            ],
            [
                4446,
                4747
            ],
            [
                4747,
                5080
            ],
            [
                5080,
                5265
            ],
            [
                5265,
                5361
            ],
            [
                5361,
                5757
            ],
            [
                5757,
                5809
            ],
            [
                5809,
                5995
            ],
            [
                5995,
                6014
            ],
            [
                6014,
                6058
            ],
            [
                6058,
                6084
            ],
            [
                6084,
                6107
            ],
            [
                6107,
                6168
            ],
            [
                6168,
                6352
            ],
            [
                6352,
                6479
            ],
            [
                6479,
                6544
            ],
            [
                6544,
                6662
            ],
            [
                6662,
                6731
            ],
            [
                6731,
                6756
            ],
            [
                6756,
                6828
            ],
            [
                6828,
                6908
            ],
            [
                6908,
                6928
            ],
            [
                6928,
                6996
            ],
            [
                6996,
                7034
            ],
            [
                7034,
                7234
            ],
            [
                7234,
                7276
            ],
            [
                7276,
                7427
            ],
            [
                7427,
                7527
            ],
            [
                7527,
                7831
            ],
            [
                7831,
                8065
            ],
            [
                8065,
                8198
            ],
            [
                8198,
                8485
            ],
            [
                8485,
                8726
            ],
            [
                8726,
                8905
            ],
            [
                8905,
                8971
            ],
            [
                8971,
                8994
            ],
            [
                8994,
                9013
            ],
            [
                9013,
                9280
            ],
            [
                9280,
                9440
            ],
            [
                9440,
                9462
            ],
            [
                9462,
                9513
            ],
            [
                9513,
                9637
            ],
            [
                9637,
                9887
            ],
            [
                9887,
                9963
            ],
            [
                9963,
                10096
            ],
            [
                10096,
                10155
            ],
            [
                10155,
                10267
            ],
            [
                10267,
                10284
            ],
            [
                10284,
                10288
            ],
            [
                10288,
                10294
            ],
            [
                10294,
                10306
            ],
            [
                10306,
                10324
            ],
            [
                10324,
                10352
            ],
            [
                10352,
                10545
            ],
            [
                10545,
                10578
            ],
            [
                10578,
                10625
            ],
            [
                10625,
                10644
            ],
            [
                10644,
                10706
            ],
            [
                10706,
                10830
            ],
            [
                10830,
                10873
            ],
            [
                10873,
                10879
            ],
            [
                10879,
                10914
            ],
            [
                10914,
                10920
            ],
            [
                10920,
                11006
            ],
            [
                11006,
                11044
            ],
            [
                11044,
                11074
            ],
            [
                11074,
                11547
            ],
            [
                11547,
                11837
            ],
            [
                11837,
                12116
            ],
            [
                12116,
                12253
            ],
            [
                12253,
                12341
            ],
            [
                12341,
                12359
            ],
            [
                12359,
                12363
            ],
            [
                12363,
                12369
            ],
            [
                12369,
                12380
            ],
            [
                12380,
                12386
            ],
            [
                12386,
                12454
            ],
            [
                12454,
                12597
            ],
            [
                12597,
                12625
            ],
            [
                12625,
                12649
            ],
            [
                12649,
                12655
            ],
            [
                12655,
                12662
            ],
            [
                12662,
                12671
            ],
            [
                12671,
                12705
            ],
            [
                12705,
                12797
            ],
            [
                12797,
                12885
            ],
            [
                12885,
                13013
            ],
            [
                13013,
                13113
            ],
            [
                13113,
                13476
            ],
            [
                13476,
                13526
            ],
            [
                13526,
                13580
            ],
            [
                13580,
                14107
            ],
            [
                14107,
                14153
            ],
            [
                14153,
                14366
            ],
            [
                14366,
                14442
            ],
            [
                14442,
                14457
            ],
            [
                14457,
                14469
            ],
            [
                14469,
                14475
            ],
            [
                14475,
                14540
            ],
            [
                14540,
                14585
            ],
            [
                14585,
                14606
            ],
            [
                14606,
                14623
            ],
            [
                14623,
                14639
            ],
            [
                14639,
                14644
            ],
            [
                14644,
                14687
            ],
            [
                14687,
                14691
            ],
            [
                14691,
                14705
            ],
            [
                14705,
                14711
            ],
            [
                14711,
                14775
            ],
            [
                14775,
                14787
            ],
            [
                14787,
                15040
            ],
            [
                15040,
                15241
            ],
            [
                15241,
                15251
            ],
            [
                15251,
                15269
            ],
            [
                15269,
                15500
            ],
            [
                15500,
                15980
            ],
            [
                15980,
                16035
            ],
            [
                16035,
                16061
            ],
            [
                16061,
                16130
            ],
            [
                16130,
                16136
            ],
            [
                16136,
                16241
            ],
            [
                16241,
                16314
            ],
            [
                16314,
                16533
            ],
            [
                16533,
                16650
            ],
            [
                16650,
                16741
            ],
            [
                16741,
                16767
            ],
            [
                16767,
                16809
            ],
            [
                16809,
                16876
            ],
            [
                16876,
                16999
            ],
            [
                16999,
                17049
            ],
            [
                17049,
                17179
            ],
            [
                17179,
                17263
            ],
            [
                17263,
                17340
            ],
            [
                17340,
                17475
            ],
            [
                17475,
                17540
            ],
            [
                17540,
                17717
            ],
            [
                17717,
                17832
            ],
            [
                17832,
                17844
            ],
            [
                17844,
                17878
            ],
            [
                17878,
                17912
            ],
            [
                17912,
                17959
            ],
            [
                17959,
                17990
            ],
            [
                17990,
                18062
            ],
            [
                18062,
                18101
            ],
            [
                18101,
                18140
            ],
            [
                18140,
                18157
            ],
            [
                18157,
                18642
            ],
            [
                18642,
                18748
            ],
            [
                18748,
                18857
            ],
            [
                18857,
                18894
            ],
            [
                18894,
                19038
            ],
            [
                19038,
                19123
            ],
            [
                19123,
                19247
            ],
            [
                19247,
                19280
            ],
            [
                19280,
                19391
            ],
            [
                19391,
                19451
            ],
            [
                19451,
                19551
            ],
            [
                19551,
                19628
            ],
            [
                19628,
                19647
            ],
            [
                19647,
                19679
            ],
            [
                19679,
                19774
            ],
            [
                19774,
                19833
            ],
            [
                19833,
                19838
            ],
            [
                19838,
                19970
            ],
            [
                19970,
                20043
            ],
            [
                20043,
                20228
            ],
            [
                20228,
                20474
            ],
            [
                20474,
                20478
            ],
            [
                20478,
                20789
            ],
            [
                20789,
                20812
            ],
            [
                20812,
                20950
            ],
            [
                20950,
                20974
            ]
        ]
    },
    "abridged": {
        "text": "Chesney Wold is shut up, carpets are rolled into great scrolls, bright damask is covered in brown dust-sheets, and the Dedlock ancestors retire from the light of day again. Around the house the leaves fall thick, but never fast, for they come circling down with a dead lightness that is sombre and slow. No matter how much the gardener sweeps up, still they lie ankle-deep. Howls the shrill wind round Chesney Wold; the sharp rain beats, and the windows rattle. Mists hide in the avenues, veil the views, and move funeral-wise across the grounds. On all the house there is the cold, blank smell of a church, suggesting that the dead and buried Dedlocks walk there in the long nights and leave the flavour of their graves behind them.\nBut the house in town shines out awakened. As warm and bright as possible, as pleasantly scented as hothouse flowers can make it, soft and hushed so that the ticking of the clocks and the crisp burning of the fires alone disturb the stillness in the rooms, it seems to wrap Sir Leicester's chilled bones in rainbow-coloured wool. And Sir Leicester is glad to repose in dignified contentment before the great fire in the library, condescendingly perusing the backs of his books or honouring the fine arts with an approving glance. For he has his pictures, ancient and modern, of fancy Spanish or Venetian scenes.\nMr. Tulkinghorn comes and goes pretty often on estate business. He sees my Lady pretty often, too; and he and she are as composed, and as indifferent to each other, as ever. Yet it may be that my Lady fears Mr. Tulkinghorn and that he knows it. It may be that he pursues her doggedly and steadily, with no touch of remorse or pity. It may be that her beauty and state only give him the greater zest for what he is set upon and make him more inflexible. Whether or no, my Lady had better have five thousand pairs of fashionable eyes upon her, than the two eyes of this rusty lawyer with his wisp of neckcloth.\nSir Leicester sits in my Lady's room - that room in which Mr. Tulkinghorn read the affidavit in Jarndyce and Jarndyce - particularly complacent. My Lady, as on that day, sits before the fire with her screen in her hand. Sir Leicester is particularly complacent because he has found in his newspaper some congenial remarks bearing directly on the floodgates and the framework of society. He has come from the library to my Lady's room expressly to read them aloud. \"The man who wrote this article,\" he observes, \"has a well-balanced mind.\"\nMy Lady, after a languid effort to listen, or rather pretend to listen, becomes distracted and falls into a contemplation of the fire. Sir Leicester, quite unconscious, reads on, occasionally stopping to remark \"Very true indeed,\" or \"Very properly put,\" invariably losing his place after each observation, and going up and down the column to find it again.\nHe is reading with infinite gravity when the door opens, and the footman makes this strange announcement, \"The young man, my Lady, of the name of Guppy.\"\nSir Leicester pauses, and repeats, \"The young man of the name of Guppy?\"\n\"I beg your pardon, Sir Leicester, but my Lady said she would see the young man whenever he called.\"\nThe young man of the name of Guppy stands there, much discomfited.\n\"It's quite right. I gave him those directions,\" says my Lady. \"Let the young man wait.\"\n\"By no means, my Lady. I will not interrupt you.\" Sir Leicester gallantly retires, declining to accept a bow from the young man as he goes out and majestically supposing him to be some shoemaker.\nLady Dedlock looks imperiously at her visitor when the servant has left the room. She asks him what he wants.\n\"That your ladyship would have the kindness to oblige me with a little conversation,\" returns Mr. Guppy, embarrassed.\n\"You are the person who has written me so many letters?\"\n\"Several, your ladyship, before your ladyship condescended to favour me with an answer.\"\n\"And could you not write this time?\"\nMr. Guppy shakes his head.\n\"You have been strangely importunate. If it should appear, after all, that what you have to say does not concern me - and I don't expect that it will - you will allow me to cut you short. Say what you have to say, please.\"\nMy Lady turns herself towards the fire again, sitting almost with her back to the young man.\n\"With your ladyship's permission, then,\" says Mr. Guppy, \"Hem! I am, as I told your ladyship in my first letter, in the law, and have learnt the habit of not committing myself in writing. The name of my firm is Kenge and Carboy, of Lincoln's Inn, which may not be altogether unknown to your ladyship in connexion with the case in Chancery of Jarndyce and Jarndyce.\"\nMy Lady's figure stills as if she were listening.\n\"I may say at once,\" says Mr. Guppy, a little emboldened, \"it is not about Jarndyce and Jarndyce that I wish to speak to your ladyship. If it had been about Jarndyce and Jarndyce, I should have gone to your ladyship's solicitor, Mr. Tulkinghorn.\"\nMy Lady says, \"You had better sit down.\"\n\"Thank you.\" Mr. Guppy does so. \"Now, your ladyship\" - he refers to a little slip of paper - \"Oh, yes! - I place myself entirely in your ladyship's hands. If your ladyship was to make any complaint to Kenge and Carboy or to Mr. Tulkinghorn of this visit, I should be placed in a very disagreeable situation. Consequently, I rely upon your ladyship's honour.\"\nMy Lady, with a disdainful gesture, assures him of his being worth no complaint from her.\n\"Thank your ladyship,\" says Mr. Guppy; \"Now - dash it! I wrote down here the points I thought of touching upon, and I can't quite make them out.\" He blushes, peering at the slip of paper. \"C.S. What's C.S.? Oh! I know! I am not aware whether your ladyship ever happened to hear of, or to see, a young lady of the name of Miss Esther Summerson.\"\nMy Lady's eyes look at him full. \"I saw a young lady of that name not long ago.\"\n\"Now, did it strike your ladyship that she was like anybody?\" asks Mr. Guppy, crossing his arms, and holding his head on one side.\n\"No.\"\n\"Not like your ladyship's family?\"\n\"No.\"\n\"I think your ladyship,\" says Mr. Guppy, \"can hardly remember Miss Summerson's face?\"\n\"I remember the young lady very well. What has this to do with me?\"\n\"Your ladyship, I do assure you that having Miss Summerson's image imprinted on my 'eart, I found, when I had the honour of going over your ladyship's mansion of Chesney Wold recently, such a resemblance between Miss Esther Summerson and your ladyship's own portrait that it completely knocked me over. And now I have the honour of beholding your ladyship near, it's really more surprising than I thought.\"\nWhat a deadly look those beautiful eyes give the young man of the name of Guppy! My Lady asks him again what he supposes that this has to do with her.\n\"Your ladyship,\" replies Mr. Guppy, again referring to his paper, \"I am coming to that. Dash these notes! Oh! 'Mrs. Chadband.' Yes.\"\nMy Lady reclines in her chair composedly, though with a trifle less ease than usual perhaps, and never falters in her steady gaze.\nMr. Guppy proceeds. \"Your ladyship, there is a mystery about Miss Esther Summerson's birth and bringing up. I know that fact in the way of my profession at Kenge and Carboy's. Now, as I have already mentioned to your ladyship, Miss Summerson's image is imprinted on my 'eart. If I could clear this mystery for her, or prove her to be well related, or find that having the honour to be a remote branch of your ladyship's family she had a right to be made a party in Jarndyce and Jarndyce, why, Miss Summerson might look with more favour on my proposals than she has exactly done as yet. In fact, as yet she hasn't favoured them at all.\"\nA kind of angry smile dawns upon my Lady's face.\n\"Now, by chance,\" says Mr. Guppy, \"through one of those circumstances that fall in the way of us professional men, I have met the person who lived as servant with the lady who brought Miss Summerson up. That lady was a Miss Barbary, your ladyship.\"\nIs the dead colour on my Lady's face reflected from her green silk screen, or is it a dreadful paleness that has fallen on her?\n\"Did your ladyship,\" says Mr. Guppy, \"ever hear of Miss Barbary?\"\n\"I don't know. I think so.\"\n\"Was she at all connected with your ladyship's family?\"\nMy Lady's lips move, but they utter nothing. She shakes her head.\n\"Not to your ladyship's knowledge, perhaps? Ah! But might be? Very good!\" says Mr. Guppy. \"Now, this Miss Barbary was extremely close and secretive, and my witness never had an idea whether she possessed a single relative. On one occasion only, she confided to my witness on a single point, and she then told her that the little girl's real name was not Esther Summerson, but Esther Hawdon.\"\n\"My God!\"\nMr. Guppy stares. Lady Dedlock sits before him in the same attitude, with her lips a little apart, her brow a little contracted, but for the moment dead. He sees a tremor pass across her frame like a ripple over water, sees her lips shake, sees her compose them by a great effort, all in a swift breath.\n\"Your ladyship is acquainted with the name of Hawdon?\"\n\"I have heard it before.\"\n\"Name of any remote branch of your ladyship's family?\"\n\"No.\"\n\"Now, your ladyship,\" says Mr. Guppy, \"I come to the last point of the case. Your ladyship must know that there was found dead at the house of a person named Krook, near Chancery Lane, a law-writer in great distress. There was an inquest, in which this law-writer was an anonymous character, his name being unknown. But, your ladyship, I have discovered very lately that that law-writer's name was Hawdon.\"\n\"And what is that to me?\"\n\"Aye, your ladyship, that's the question! Now, your ladyship, a queer thing happened after that man's death. A lady in disguise went to look at the scene and went to look at his grave. She hired a crossing-sweeping boy to show it her. If your ladyship would wish to have the boy produced, I can lay my hand upon him at any time.\"\nThe wretched boy is nothing to my Lady, and she does not wish to have him produced.\n\"I assure your ladyship it's very queer indeed,\" says Mr. Guppy. \"If you was to hear him tell about the rings that sparkled on her fingers when she took her glove off, you'd think it quite romantic. It was supposed, your ladyship, that Hawdon left no scrap behind him by which he could be identified. But he did. He left a bundle of old letters.\"\nAll this time her eyes never once release him.\n\"They were taken and hidden. And tomorrow night, your ladyship, they will come into my possession.\"\n\"Still I ask you, what is this to me?\"\n\"Your ladyship, I end with that.\" Mr. Guppy rises. \"If you think there's enough in this chain of circumstances to give your ladyship a family interest in going further into the case, I will bring these papers here. I don't know what they are, except that they are old letters: I have never seen them. I will bring those papers here as soon as I get them and go over them for the first time with your ladyship. I have told your ladyship all this in strict confidence.\"\nIs this the full purpose of the young man of the name of Guppy, or has he any other? Do his words disclose his full object and suspicion in coming here; or if not, what do they hide? He is a match for my Lady. That witness-box face of his tells her nothing.\n\"You may bring the letters,\" says my Lady, \"if you choose.\"\n\"Your ladyship is not very encouraging, upon my word,\" says Mr. Guppy, a little injured.\n\"You may bring the letters,\" she repeats in the same tone, \"if you please.\"\n\"It shall be done. I wish your ladyship good day.\"\nOn a table near her is a rich bauble of a casket. Looking at him, she unlocks it.\n\"Oh! I assure your ladyship I couldn't accept anything of the kind,\" says Mr. Guppy. \"I wish your ladyship good day.\"\nSo the young man makes his bow and leaves.\nAs Sir Leicester dozes over his newspaper in the library, is there no influence in the house to startle him, to make the very portraits frown, the very armour stir?\nNo. Sobs and cries are only air, and air is so shut in throughout the house in town that no vibration is carried to Sir Leicester's ears; and yet this cry is in the house, going from a wild figure on its knees.\n\"O my child, my child! Not dead in the first hours of her life, as my cruel sister told me, but sternly nurtured by her, after she had renounced me and my name! O my child, O my child!\"",
        "paragraph_chars": [
            [
                0,
                734
            ],
            [
                734,
                1346
            ],
            [
                1346,
                1955
            ],
            [
                1955,
                2494
            ],
            [
                2494,
                2852
            ],
            [
                2852,
                3006
            ],
            [
                3006,
                3079
            ],
            [
                3079,
                3180
            ],
            [
                3180,
                3247
            ],
            [
                3247,
                3336
            ],
            [
                3336,
                3532
            ],
            [
                3532,
                3642
            ],
            [
                3642,
                3760
            ],
            [
                3760,
                3817
            ],
            [
                3817,
                3906
            ],
            [
                3906,
                3943
            ],
            [
                3943,
                3970
            ],
            [
                3970,
                4193
            ],
            [
                4193,
                4286
            ],
            [
                4286,
                4652
            ],
            [
                4652,
                4702
            ],
            [
                4702,
                4949
            ],
            [
                4949,
                4990
            ],
            [
                4990,
                5349
            ],
            [
                5349,
                5439
            ],
            [
                5439,
                5784
            ],
            [
                5784,
                5865
            ],
            [
                5865,
                5996
            ],
            [
                5996,
                6002
            ],
            [
                6002,
                6037
            ],
            [
                6037,
                6043
            ],
            [
                6043,
                6129
            ],
            [
                6129,
                6197
            ],
            [
                6197,
                6604
            ],
            [
                6604,
                6755
            ],
            [
                6755,
                6888
            ],
            [
                6888,
                7019
            ],
            [
                7019,
                7655
            ],
            [
                7655,
                7704
            ],
            [
                7704,
                7953
            ],
            [
                7953,
                8081
            ],
            [
                8081,
                8147
            ],
            [
                8147,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8297
            ],
            [
                8297,
                8689
            ],
            [
                8689,
                8699
            ],
            [
                8699,
                9003
            ],
            [
                9003,
                9058
            ],
            [
                9058,
                9084
            ],
            [
                9084,
                9139
            ],
            [
                9139,
                9145
            ],
            [
                9145,
                9552
            ],
            [
                9552,
                9578
            ],
            [
                9578,
                9908
            ],
            [
                9908,
                9992
            ],
            [
                9992,
                10339
            ],
            [
                10339,
                10386
            ],
            [
                10386,
                10486
            ],
            [
                10486,
                10525
            ],
            [
                10525,
                10993
            ],
            [
                10993,
                11251
            ],
            [
                11251,
                11311
            ],
            [
                11311,
                11400
            ],
            [
                11400,
                11476
            ],
            [
                11476,
                11527
            ],
            [
                11527,
                11609
            ],
            [
                11609,
                11727
            ],
            [
                11727,
                11770
            ],
            [
                11770,
                11935
            ],
            [
                11935,
                12146
            ],
            [
                12146,
                12331
            ]
        ],
        "segment_chars": [
            [
                0,
                173
            ],
            [
                173,
                304
            ],
            [
                304,
                374
            ],
            [
                374,
                462
            ],
            [
                462,
                547
            ],
            [
                547,
                734
            ],
            [
                734,
                777
            ],
            [
                777,
                1064
            ],
            [
                1064,
                1264
            ],
            [
                1264,
                1346
            ],
            [
                1346,
                1410
            ],
            [
                1410,
                1520
            ],
            [
                1520,
                1591
            ],
            [
                1591,
                1678
            ],
            [
                1678,
                1799
            ],
            [
                1799,
                1955
            ],
            [
                1955,
                2100
            ],
            [
                2100,
                2175
            ],
            [
                2175,
                2342
            ],
            [
                2342,
                2419
            ],
            [
                2419,
                2494
            ],
            [
                2494,
                2629
            ],
            [
                2629,
                2852
            ],
            [
                2852,
                3006
            ],
            [
                3006,
                3079
            ],
            [
                3079,
                3180
            ],
            [
                3180,
                3247
            ],
            [
                3247,
                3266
            ],
            [
                3266,
                3310
            ],
            [
                3310,
                3336
            ],
            [
                3336,
                3359
            ],
            [
                3359,
                3386
            ],
            [
                3386,
                3532
            ],
            [
                3532,
                3614
            ],
            [
                3614,
                3642
            ],
            [
                3642,
                3760
            ],
            [
                3760,
                3817
            ],
            [
                3817,
                3906
            ],
            [
                3906,
                3943
            ],
            [
                3943,
                3970
            ],
            [
                3970,
                4008
            ],
            [
                4008,
                4158
            ],
            [
                4158,
                4193
            ],
            [
                4193,
                4286
            ],
            [
                4286,
                4349
            ],
            [
                4349,
                4474
            ],
            [
                4474,
                4652
            ],
            [
                4652,
                4702
            ],
            [
                4702,
                4838
            ],
            [
                4838,
                4949
            ],
            [
                4949,
                4990
            ],
            [
                4990,
                5003
            ],
            [
                5003,
                5022
            ],
            [
                5022,
                5093
            ],
            [
                5093,
                5145
            ],
            [
                5145,
                5298
            ],
            [
                5298,
                5349
            ],
            [
                5349,
                5439
            ],
            [
                5439,
                5494
            ],
            [
                5494,
                5585
            ],
            [
                5585,
                5627
            ],
            [
                5627,
                5633
            ],
            [
                5633,
                5646
            ],
            [
                5646,
                5650
            ],
            [
                5650,
                5658
            ],
            [
                5658,
                5784
            ],
            [
                5784,
                5817
            ],
            [
                5817,
                5865
            ],
            [
                5865,
                5927
            ],
            [
                5927,
                5996
            ],
            [
                5996,
                6002
            ],
            [
                6002,
                6037
            ],
            [
                6037,
                6043
            ],
            [
                6043,
                6129
            ],
            [
                6129,
                6167
            ],
            [
                6167,
                6197
            ],
            [
                6197,
                6500
            ],
            [
                6500,
                6604
            ],
            [
                6604,
                6685
            ],
            [
                6685,
                6755
            ],
            [
                6755,
                6843
            ],
            [
                6843,
                6861
            ],
            [
                6861,
                6865
            ],
            [
                6865,
                6871
            ],
            [
                6871,
                6882
            ],
            [
                6882,
                6888
            ],
            [
                6888,
                7019
            ],
            [
                7019,
                7039
            ],
            [
                7039,
                7127
            ],
            [
                7127,
                7195
            ],
            [
                7195,
                7295
            ],
            [
                7295,
                7605
            ],
            [
                7605,
                7655
            ],
            [
                7655,
                7704
            ],
            [
                7704,
                7907
            ],
            [
                7907,
                7953
            ],
            [
                7953,
                8081
            ],
            [
                8081,
                8147
            ],
            [
                8147,
                8162
            ],
            [
                8162,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8276
            ],
            [
                8276,
                8297
            ],
            [
                8297,
                8341
            ],
            [
                8341,
                8345
            ],
            [
                8345,
                8359
            ],
            [
                8359,
                8371
            ],
            [
                8371,
                8387
            ],
            [
                8387,
                8520
            ],
            [
                8520,
                8689
            ],
            [
                8689,
                8699
            ],
            [
                8699,
                8717
            ],
            [
                8717,
                8853
            ],
            [
                8853,
                9003
            ],
            [
                9003,
                9058
            ],
            [
                9058,
                9084
            ],
            [
                9084,
                9139
            ],
            [
                9139,
                9145
            ],
            [
                9145,
                9222
            ],
            [
                9222,
                9362
            ],
            [
                9362,
                9461
            ],
            [
                9461,
                9552
            ],
            [
                9552,
                9578
            ],
            [
                9578,
                9620
            ],
            [
                9620,
                9687
            ],
            [
                9687,
                9763
            ],
            [
                9763,
                9813
            ],
            [
                9813,
                9908
            ],
            [
                9908,
                9992
            ],
            [
                9992,
                10057
            ],
            [
                10057,
                10191
            ],
            [
                10191,
                10293
            ],
            [
                10293,
                10305
            ],
            [
                10305,
                10339
            ],
            [
                10339,
                10386
            ],
            [
                10386,
                10415
            ],
            [
                10415,
                10486
            ],
            [
                10486,
                10525
            ],
            [
                10525,
                10559
            ],
            [
                10559,
                10576
            ],
            [
                10576,
                10740
            ],
            [
                10740,
                10826
            ],
            [
                10826,
                10935
            ],
            [
                10935,
                10993
            ],
            [
                10993,
                11078
            ],
            [
                11078,
                11176
            ],
            [
                11176,
                11203
            ],
            [
                11203,
                11251
            ],
            [
                11251,
                11311
            ],
            [
                11311,
                11400
            ],
            [
                11400,
                11476
            ],
            [
                11476,
                11495
            ],
            [
                11495,
                11527
            ],
            [
                11527,
                11577
            ],
            [
                11577,
                11609
            ],
            [
                11609,
                11614
            ],
            [
                11614,
                11694
            ],
            [
                11694,
                11727
            ],
            [
                11727,
                11770
            ],
            [
                11770,
                11935
            ],
            [
                11935,
                11939
            ],
            [
                11939,
                12146
            ],
            [
                12146,
                12169
            ],
            [
                12169,
                12307
            ],
            [
                12307,
                12331
            ]
        ],
        "overlap_chars": [
            [
                0,
                62
            ],
            [
                62,
                77
            ],
            [
                89,
                97
            ],
            [
                109,
                173
            ],
            [
                173,
                304
            ],
            [
                323,
                335
            ],
            [
                345,
                374
            ],
            [
                374,
                437
            ],
            [
                438,
                441
            ],
            [
                442,
                460
            ],
            [
                460,
                462
            ],
            [
                462,
                497
            ],
            [
                503,
                513
            ],
            [
                514,
                537
            ],
            [
                538,
                547
            ],
            [
                547,
                572
            ],
            [
                573,
                576
            ],
            [
                577,
                594
            ],
            [
                595,
                599
            ],
            [
                600,
                606
            ],
            [
                606,
                734
            ],
            [
                734,
                737
            ],
            [
                738,
                777
            ],
            [
                777,
                798
            ],
            [
                807,
                811
            ],
            [
                823,
                825
            ],
            [
                831,
                1007
            ],
            [
                1008,
                1023
            ],
            [
                1024,
                1037
            ],
            [
                1038,
                1064
            ],
            [
                1064,
                1242
            ],
            [
                1256,
                1262
            ],
            [
                1262,
                1264
            ],
            [
                1264,
                1307
            ],
            [
                1307,
                1308
            ],
            [
                1309,
                1311
            ],
            [
                1312,
                1317
            ],
            [
                1318,
                1325
            ],
            [
                1326,
                1328
            ],
            [
                1329,
                1337
            ],
            [
                1344,
                1345
            ],
            [
                1346,
                1389
            ],
            [
                1390,
                1392
            ],
            [
                1393,
                1408
            ],
            [
                1408,
                1410
            ],
            [
                1410,
                1495
            ],
            [
                1509,
                1520
            ],
            [
                1520,
                1552
            ],
            [
                1553,
                1591
            ],
            [
                1591,
                1660
            ],
            [
                1661,
                1668
            ],
            [
                1669,
                1678
            ],
            [
                1678,
                1707
            ],
            [
                1708,
                1713
            ],
            [
                1714,
                1718
            ],
            [
                1724,
                1772
            ],
            [
                1778,
                1781
            ],
            [
                1782,
                1797
            ],
            [
                1797,
                1799
            ],
            [
                1799,
                1806
            ],
            [
                1807,
                1809
            ],
            [
                1812,
                1813
            ],
            [
                1814,
                1886
            ],
            [
                1886,
                1953
            ],
            [
                1953,
                1955
            ],
            [
                1955,
                1991
            ],
            [
                1994,
                2072
            ],
            [
                2075,
                2100
            ],
            [
                2100,
                2175
            ],
            [
                2175,
                2342
            ],
            [
                2345,
                2419
            ],
            [
                2419,
                2464
            ],
            [
                2464,
                2494
            ],
            [
                2494,
                2501
            ],
            [
                2501,
                2546
            ],
            [
                2555,
                2557
            ],
            [
                2564,
                2573
            ],
            [
                2585,
                2627
            ],
            [
                2627,
                2629
            ],
            [
                2629,
                2671
            ],
            [
                2671,
                2697
            ],
            [
                2698,
                2704
            ],
            [
                2705,
                2724
            ],
            [
                2728,
                2746
            ],
            [
                2746,
                2852
            ],
            [
                2855,
                2887
            ],
            [
                2888,
                2916
            ],
            [
                2925,
                3006
            ],
            [
                3006,
                3027
            ],
            [
                3032,
                3039
            ],
            [
                3039,
                3079
            ],
            [
                3079,
                3177
            ],
            [
                3180,
                3214
            ],
            [
                3227,
                3245
            ],
            [
                3245,
                3247
            ],
            [
                3247,
                3266
            ],
            [
                3266,
                3310
            ],
            [
                3310,
                3336
            ],
            [
                3336,
                3359
            ],
            [
                3359,
                3386
            ],
            [
                3386,
                3399
            ],
            [
                3400,
                3404
            ],
            [
                3410,
                3418
            ],
            [
                3419,
                3530
            ],
            [
                3530,
                3532
            ],
            [
                3532,
                3612
            ],
            [
                3612,
                3614
            ],
            [
                3614,
                3617
            ],
            [
                3618,
                3642
            ],
            [
                3642,
                3760
            ],
            [
                3760,
                3768
            ],
            [
                3769,
                3817
            ],
            [
                3818,
                3825
            ],
            [
                3842,
                3906
            ],
            [
                3906,
                3924
            ],
            [
                3943,
                3952
            ],
            [
                3953,
                3970
            ],
            [
                3970,
                4008
            ],
            [
                4008,
                4085
            ],
            [
                4088,
                4093
            ],
            [
                4094,
                4119
            ],
            [
                4122,
                4156
            ],
            [
                4156,
                4158
            ],
            [
                4158,
                4183
            ],
            [
                4184,
                4193
            ],
            [
                4193,
                4200
            ],
            [
                4201,
                4284
            ],
            [
                4284,
                4286
            ],
            [
                4286,
                4331
            ],
            [
                4334,
                4335
            ],
            [
                4341,
                4344
            ],
            [
                4344,
                4349
            ],
            [
                4349,
                4409
            ],
            [
                4409,
                4414
            ],
            [
                4415,
                4472
            ],
            [
                4472,
                4474
            ],
            [
                4474,
                4485
            ],
            [
                4489,
                4652
            ],
            [
                4652,
                4668
            ],
            [
                4676,
                4702
            ],
            [
                4702,
                4703
            ],
            [
                4703,
                4712
            ],
            [
                4713,
                4766
            ],
            [
                4777,
                4803
            ],
            [
                4804,
                4805
            ],
            [
                4811,
                4836
            ],
            [
                4838,
                4852
            ],
            [
                4859,
                4900
            ],
            [
                4901,
                4946
            ],
            [
                4949,
                4956
            ],
            [
                4957,
                4990
            ],
            [
                4990,
                4996
            ],
            [
                5000,
                5003
            ],
            [
                5003,
                5022
            ],
            [
                5022,
                5042
            ],
            [
                5045,
                5047
            ],
            [
                5048,
                5080
            ],
            [
                5083,
                5084
            ],
            [
                5084,
                5091
            ],
            [
                5095,
                5145
            ],
            [
                5145,
                5232
            ],
            [
                5238,
                5298
            ],
            [
                5298,
                5349
            ],
            [
                5349,
                5383
            ],
            [
                5383,
                5439
            ],
            [
                5439,
                5479
            ],
            [
                5479,
                5482
            ],
            [
                5485,
                5492
            ],
            [
                5494,
                5495
            ],
            [
                5502,
                5506
            ],
            [
                5507,
                5511
            ],
            [
                5512,
                5554
            ],
            [
                5555,
                5573
            ],
            [
                5579,
                5582
            ],
            [
                5585,
                5587
            ],
            [
                5595,
                5596
            ],
            [
                5608,
                5625
            ],
            [
                5627,
                5633
            ],
            [
                5633,
                5643
            ],
            [
                5646,
                5650
            ],
            [
                5650,
                5658
            ],
            [
                5658,
                5672
            ],
            [
                5673,
                5784
            ],
            [
                5784,
                5817
            ],
            [
                5817,
                5862
            ],
            [
                5865,
                5927
            ],
            [
                5927,
                5961
            ],
            [
                5962,
                5965
            ],
            [
                5966,
                5994
            ],
            [
                5994,
                5996
            ],
            [
                5996,
                6002
            ],
            [
                6002,
                6037
            ],
            [
                6037,
                6043
            ],
            [
                6043,
                6129
            ],
            [
                6129,
                6167
            ],
            [
                6167,
                6197
            ],
            [
                6197,
                6285
            ],
            [
                6285,
                6286
            ],
            [
                6287,
                6371
            ],
            [
                6380,
                6498
            ],
            [
                6498,
                6500
            ],
            [
                6500,
                6557
            ],
            [
                6557,
                6558
            ],
            [
                6559,
                6601
            ],
            [
                6601,
                6604
            ],
            [
                6609,
                6610
            ],
            [
                6618,
                6622
            ],
            [
                6623,
                6643
            ],
            [
                6653,
                6684
            ],
            [
                6685,
                6692
            ],
            [
                6693,
                6729
            ],
            [
                6735,
                6755
            ],
            [
                6755,
                6843
            ],
            [
                6843,
                6861
            ],
            [
                6861,
                6865
            ],
            [
                6865,
                6871
            ],
            [
                6871,
                6882
            ],
            [
                6882,
                6887
            ],
            [
                6888,
                6955
            ],
            [
                6956,
                7018
            ],
            [
                7021,
                7038
            ],
            [
                7039,
                7127
            ],
            [
                7127,
                7133
            ],
            [
                7134,
                7143
            ],
            [
                7144,
                7195
            ],
            [
                7195,
                7295
            ],
            [
                7295,
                7511
            ],
            [
                7512,
                7526
            ],
            [
                7527,
                7532
            ],
            [
                7533,
                7542
            ],
            [
                7543,
                7547
            ],
            [
                7548,
                7605
            ],
            [
                7605,
                7655
            ],
            [
                7655,
                7676
            ],
            [
                7677,
                7704
            ],
            [
                7704,
                7709
            ],
            [
                7710,
                7712
            ],
            [
                7719,
                7739
            ],
            [
                7747,
                7778
            ],
            [
                7779,
                7817
            ],
            [
                7817,
                7818
            ],
            [
                7819,
                7825
            ],
            [
                7830,
                7905
            ],
            [
                7905,
                7907
            ],
            [
                7907,
                7953
            ],
            [
                7953,
                8004
            ],
            [
                8005,
                8008
            ],
            [
                8009,
                8019
            ],
            [
                8020,
                8026
            ],
            [
                8026,
                8081
            ],
            [
                8081,
                8123
            ],
            [
                8124,
                8147
            ],
            [
                8147,
                8162
            ],
            [
                8162,
                8172
            ],
            [
                8175,
                8179
            ],
            [
                8184,
                8231
            ],
            [
                8231,
                8276
            ],
            [
                8276,
                8297
            ],
            [
                8298,
                8341
            ],
            [
                8341,
                8345
            ],
            [
                8345,
                8359
            ],
            [
                8359,
                8368
            ],
            [
                8388,
                8430
            ],
            [
                8444,
                8445
            ],
            [
                8446,
                8520
            ],
            [
                8520,
                8535
            ],
            [
                8536,
                8540
            ],
            [
                8540,
                8545
            ],
            [
                8555,
                8689
            ],
            [
                8689,
                8699
            ],
            [
                8699,
                8717
            ],
            [
                8717,
                8745
            ],
            [
                8746,
                8766
            ],
            [
                8766,
                8853
            ],
            [
                8853,
                8855
            ],
            [
                8856,
                8979
            ],
            [
                8980,
                8983
            ],
            [
                8984,
                8988
            ],
            [
                8995,
                9003
            ],
            [
                9003,
                9058
            ],
            [
                9058,
                9084
            ],
            [
                9084,
                9096
            ],
            [
                9097,
                9139
            ],
            [
                9139,
                9145
            ],
            [
                9145,
                9220
            ],
            [
                9220,
                9222
            ],
            [
                9222,
                9245
            ],
            [
                9246,
                9329
            ],
            [
                9330,
                9362
            ],
            [
                9362,
                9383
            ],
            [
                9387,
                9392
            ],
            [
                9398,
                9461
            ],
            [
                9461,
                9552
            ],
            [
                9552,
                9578
            ],
            [
                9578,
                9620
            ],
            [
                9620,
                9687
            ],
            [
                9687,
                9693
            ],
            [
                9706,
                9731
            ],
            [
                9732,
                9763
            ],
            [
                9763,
                9813
            ],
            [
                9813,
                9865
            ],
            [
                9865,
                9908
            ],
            [
                9908,
                9992
            ],
            [
                9992,
                9993
            ],
            [
                9993,
                10020
            ],
            [
                10021,
                10031
            ],
            [
                10032,
                10057
            ],
            [
                10057,
                10189
            ],
            [
                10191,
                10227
            ],
            [
                10235,
                10242
            ],
            [
                10243,
                10280
            ],
            [
                10281,
                10293
            ],
            [
                10293,
                10305
            ],
            [
                10305,
                10339
            ],
            [
                10339,
                10386
            ],
            [
                10386,
                10406
            ],
            [
                10413,
                10415
            ],
            [
                10415,
                10418
            ],
            [
                10428,
                10486
            ],
            [
                10486,
                10525
            ],
            [
                10525,
                10542
            ],
            [
                10547,
                10559
            ],
            [
                10559,
                10576
            ],
            [
                10576,
                10635
            ],
            [
                10636,
                10740
            ],
            [
                10740,
                10814
            ],
            [
                10820,
                10824
            ],
            [
                10824,
                10826
            ],
            [
                10826,
                10935
            ],
            [
                10935,
                10960
            ],
            [
                10961,
                10964
            ],
            [
                10970,
                10993
            ],
            [
                10993,
                11078
            ],
            [
                11078,
                11099
            ],
            [
                11100,
                11103
            ],
            [
                11109,
                11176
            ],
            [
                11176,
                11201
            ],
            [
                11201,
                11203
            ],
            [
                11203,
                11231
            ],
            [
                11249,
                11251
            ],
            [
                11251,
                11311
            ],
            [
                11311,
                11363
            ],
            [
                11363,
                11400
            ],
            [
                11400,
                11466
            ],
            [
                11467,
                11476
            ],
            [
                11476,
                11495
            ],
            [
                11495,
                11527
            ],
            [
                11527,
                11575
            ],
            [
                11575,
                11577
            ],
            [
                11577,
                11591
            ],
            [
                11591,
                11592
            ],
            [
                11593,
                11596
            ],
            [
                11597,
                11609
            ],
            [
                11609,
                11614
            ],
            [
                11614,
                11636
            ],
            [
                11637,
                11675
            ],
            [
                11675,
                11692
            ],
            [
                11692,
                11694
            ],
            [
                11695,
                11724
            ],
            [
                11724,
                11727
            ],
            [
                11727,
                11761
            ],
            [
                11768,
                11770
            ],
            [
                11770,
                11786
            ],
            [
                11787,
                11811
            ],
            [
                11812,
                11814
            ],
            [
                11815,
                11818
            ],
            [
                11819,
                11826
            ],
            [
                11826,
                11878
            ],
            [
                11879,
                11886
            ],
            [
                11887,
                11935
            ],
            [
                11935,
                11939
            ],
            [
                11939,
                11943
            ],
            [
                11944,
                11957
            ],
            [
                11963,
                11989
            ],
            [
                11990,
                12023
            ],
            [
                12027,
                12036
            ],
            [
                12048,
                12112
            ],
            [
                12113,
                12146
            ],
            [
                12146,
                12169
            ],
            [
                12169,
                12307
            ],
            [
                12307,
                12331
            ]
        ],
        "row_chars": [
            [
                0,
                173
            ],
            [
                173,
                304
            ],
            [
                304,
                374
            ],
            [
                374,
                462
            ],
            [
                462,
                547
            ],
            [
                547,
                734
            ],
            [
                734,
                777
            ],
            [
                777,
                1064
            ],
            [
                1064,
                1264
            ],
            [
                1264,
                1346
            ],
            [
                1346,
                1410
            ],
            [
                1410,
                1520
            ],
            [
                1520,
                1591
            ],
            [
                1591,
                1678
            ],
            [
                1678,
                1799
            ],
            [
                1799,
                1955
            ],
            [
                1955,
                2100
            ],
            [
                2100,
                2175
            ],
            [
                2175,
                2342
            ],
            [
                2342,
                2419
            ],
            [
                2419,
                2494
            ],
            [
                2494,
                2629
            ],
            [
                2629,
                2852
            ],
            [
                2852,
                3006
            ],
            [
                3006,
                3079
            ],
            [
                3079,
                3247
            ],
            [
                3247,
                3247
            ],
            [
                3247,
                3247
            ],
            [
                3247,
                3266
            ],
            [
                3266,
                3310
            ],
            [
                3310,
                3336
            ],
            [
                3336,
                3359
            ],
            [
                3359,
                3386
            ],
            [
                3386,
                3532
            ],
            [
                3532,
                3614
            ],
            [
                3614,
                3642
            ],
            [
                3642,
                3760
            ],
            [
                3760,
                3817
            ],
            [
                3817,
                3817
            ],
            [
                3817,
                3906
            ],
            [
                3906,
                3943
            ],
            [
                3943,
                3943
            ],
            [
                3943,
                3970
            ],
            [
                3970,
                4008
            ],
            [
                4008,
                4158
            ],
            [
                4158,
                4193
            ],
            [
                4193,
                4286
            ],
            [
                4286,
                4349
            ],
            [
                4349,
                4474
            ],
            [
                4474,
                4652
            ],
            [
                4652,
                4702
            ],
            [
                4702,
                4838
            ],
            [
                4838,
                4949
            ],
            [
                4949,
                4949
            ],
            [
                4949,
                4990
            ],
            [
                4990,
                5003
            ],
            [
                5003,
                5022
            ],
            [
                5022,
                5145
            ],
            [
                5145,
                5298
            ],
            [
                5298,
                5298
            ],
            [
                5298,
                5349
            ],
            [
                5349,
                5439
            ],
            [
                5439,
                5585
            ],
            [
                5585,
                5585
            ],
            [
                5585,
                5585
            ],
            [
                5585,
                5585
            ],
            [
                5585,
                5633
            ],
            [
                5633,
                5646
            ],
            [
                5646,
                5650
            ],
            [
                5650,
                5650
            ],
            [
                5650,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5784
            ],
            [
                5784,
                5817
            ],
            [
                5817,
                5865
            ],
            [
                5865,
                5865
            ],
            [
                5865,
                5927
            ],
            [
                5927,
                5996
            ],
            [
                5996,
                5996
            ],
            [
                5996,
                6002
            ],
            [
                6002,
                6037
            ],
            [
                6037,
                6043
            ],
            [
                6043,
                6129
            ],
            [
                6129,
                6167
            ],
            [
                6167,
                6197
            ],
            [
                6197,
                6500
            ],
            [
                6500,
                6604
            ],
            [
                6604,
                6685
            ],
            [
                6685,
                6755
            ],
            [
                6755,
                6843
            ],
            [
                6843,
                6861
            ],
            [
                6861,
                6865
            ],
            [
                6865,
                6871
            ],
            [
                6871,
                6882
            ],
            [
                6882,
                6888
            ],
            [
                6888,
                6888
            ],
            [
                6888,
                7019
            ],
            [
                7019,
                7019
            ],
            [
                7019,
                7019
            ],
            [
                7019,
                7019
            ],
            [
                7019,
                7019
            ],
            [
                7019,
                7019
            ],
            [
                7019,
                7019
            ],
            [
                7019,
                7039
            ],
            [
                7039,
                7127
            ],
            [
                7127,
                7195
            ],
            [
                7195,
                7295
            ],
            [
                7295,
                7605
            ],
            [
                7605,
                7655
            ],
            [
                7655,
                7704
            ],
            [
                7704,
                7907
            ],
            [
                7907,
                7953
            ],
            [
                7953,
                8081
            ],
            [
                8081,
                8147
            ],
            [
                8147,
                8162
            ],
            [
                8162,
                8175
            ],
            [
                8175,
                8175
            ],
            [
                8175,
                8231
            ],
            [
                8231,
                8276
            ],
            [
                8276,
                8297
            ],
            [
                8297,
                8297
            ],
            [
                8297,
                8297
            ],
            [
                8297,
                8297
            ],
            [
                8297,
                8341
            ],
            [
                8341,
                8345
            ],
            [
                8345,
                8359
            ],
            [
                8359,
                8359
            ],
            [
                8359,
                8359
            ],
            [
                8359,
                8387
            ],
            [
                8387,
                8520
            ],
            [
                8520,
                8689
            ],
            [
                8689,
                8699
            ],
            [
                8699,
                8717
            ],
            [
                8717,
                8853
            ],
            [
                8853,
                9003
            ],
            [
                9003,
                9058
            ],
            [
                9058,
                9084
            ],
            [
                9084,
                9139
            ],
            [
                9139,
                9145
            ],
            [
                9145,
                9222
            ],
            [
                9222,
                9222
            ],
            [
                9222,
                9362
            ],
            [
                9362,
                9461
            ],
            [
                9461,
                9552
            ],
            [
                9552,
                9578
            ],
            [
                9578,
                9620
            ],
            [
                9620,
                9687
            ],
            [
                9687,
                9763
            ],
            [
                9763,
                9813
            ],
            [
                9813,
                9908
            ],
            [
                9908,
                9992
            ],
            [
                9992,
                10057
            ],
            [
                10057,
                10191
            ],
            [
                10191,
                10191
            ],
            [
                10191,
                10191
            ],
            [
                10191,
                10293
            ],
            [
                10293,
                10305
            ],
            [
                10305,
                10339
            ],
            [
                10339,
                10339
            ],
            [
                10339,
                10386
            ],
            [
                10386,
                10415
            ],
            [
                10415,
                10486
            ],
            [
                10486,
                10525
            ],
            [
                10525,
                10559
            ],
            [
                10559,
                10576
            ],
            [
                10576,
                10740
            ],
            [
                10740,
                10826
            ],
            [
                10826,
                10935
            ],
            [
                10935,
                10935
            ],
            [
                10935,
                10993
            ],
            [
                10993,
                11078
            ],
            [
                11078,
                11176
            ],
            [
                11176,
                11203
            ],
            [
                11203,
                11251
            ],
            [
                11251,
                11311
            ],
            [
                11311,
                11400
            ],
            [
                11400,
                11476
            ],
            [
                11476,
                11495
            ],
            [
                11495,
                11527
            ],
            [
                11527,
                11577
            ],
            [
                11577,
                11609
            ],
            [
                11609,
                11614
            ],
            [
                11614,
                11694
            ],
            [
                11694,
                11727
            ],
            [
                11727,
                11770
            ],
            [
                11770,
                11935
            ],
            [
                11935,
                11939
            ],
            [
                11939,
                12146
            ],
            [
                12146,
                12169
            ],
            [
                12169,
                12307
            ],
            [
                12307,
                12331
            ]
        ]
    }
}