{
    "original": {
        "text": "Richard had been gone away some time when a visitor came to pass a few days with us. It was an elderly lady. It was Mrs. Woodcourt, who, having come from Wales to stay with Mrs. Bayham Badger and having written to my guardian, \"by her son Allan's desire,\" to report that she had heard from him and that he was well \"and sent his kind remembrances to all of us,\" had been invited by my guardian to make a visit to Bleak House. She stayed with us nearly three weeks. She took very kindly to me and was extremely confidential, so much so that sometimes she almost made me uncomfortable. I had no right, I knew very well, to be uncomfortable because she confided in me, and I felt it was unreasonable; still, with all I could do, I could not quite help it.\nShe was such a sharp little lady and used to sit with her hands folded in each other looking so very watchful while she talked to me that perhaps I found that rather irksome. Or perhaps it was her being so upright and trim, though I don't think it was that, because I thought that quaintly pleasant. Nor can it have been the general expression of her face, which was very sparkling and pretty for an old lady. I don't know what it was. Or at least if I do now, I thought I did not then. Or at least--but it don't matter.\nOf a night when I was going upstairs to bed, she would invite me into her room, where she sat before the fire in a great chair; and, dear me, she would tell me about Morgan ap-Kerrig until I was quite low-spirited! Sometimes she recited a few verses from Crumlinwallinwer and the Mewlinnwillinwodd (if those are the right names, which I dare say they are not), and would become quite fiery with the sentiments they expressed. Though I never knew what they were (being in Welsh), further than that they were highly eulogistic of the lineage of Morgan ap-Kerrig.\n\"So, Miss Summerson,\" she would say to me with stately triumph, \"this, you see, is the fortune inherited by my son. Wherever my son goes, he can claim kindred with Ap-Kerrig. He may not have money, but he always has what is much better--family, my dear.\"\nI had my doubts of their caring so very much for Morgan ap-Kerrig in India and China, but of course I never expressed them. I used to say it was a great thing to be so highly connected.\n\"It IS, my dear, a great thing,\" Mrs. Woodcourt would reply. \"It has its disadvantages; my son's choice of a wife, for instance, is limited by it, but the matrimonial choice of the royal family is limited in much the same manner.\"\nThen she would pat me on the arm and smooth my dress, as much as to assure me that she had a good opinion of me, the distance between us notwithstanding.\n\"Poor Mr. Woodcourt, my dear,\" she would say, and always with some emotion, for with her lofty pedigree she had a very affectionate heart, \"was descended from a great Highland family, the MacCoorts of MacCoort. He served his king and country as an officer in the Royal Highlanders, and he died on the field. My son is one of the last representatives of two old families. With the blessing of heaven he will set them up again and unite them with another old family.\"\nIt was in vain for me to try to change the subject, as I used to try, only for the sake of novelty or perhaps because--but I need not be so particular. Mrs. Woodcourt never would let me change it.\n\"My dear,\" she said one night, \"you have so much sense and you look at the world in a quiet manner so superior to your time of life that it is a comfort to me to talk to you about these family matters of mine. You don't know much of my son, my dear; but you know enough of him, I dare say, to recollect him?\"\n\"Yes, ma'am. I recollect him.\"\n\"Yes, my dear. Now, my dear, I think you are a judge of character, and I should like to have your opinion of him.\"\n\"Oh, Mrs. Woodcourt,\" said I, \"that is so difficult!\"\n\"Why is it so difficult, my dear?\" she returned. \"I don't see it myself.\"\n\"To give an opinion--\"\n\"On so slight an acquaintance, my dear. THAT'S true.\"\nI didn't mean that, because Mr. Woodcourt had been at our house a good deal altogether and had become quite intimate with my guardian. I said so, and added that he seemed to be very clever in his profession--we thought--and that his kindness and gentleness to Miss Flite were above all praise.\n\"You do him justice!\" said Mrs. Woodcourt, pressing my hand. \"You define him exactly. Allan is a dear fellow, and in his profession faultless. I say it, though I am his mother. Still, I must confess he is not without faults, love.\"\n\"None of us are,\" said I.\n\"Ah! But his really are faults that he might correct, and ought to correct,\" returned the sharp old lady, sharply shaking her head. \"I am so much attached to you that I may confide in you, my dear, as a third party wholly disinterested, that he is fickleness itself.\"\nI said I should have thought it hardly possible that he could have been otherwise than constant to his profession and zealous in the pursuit of it, judging from the reputation he had earned.\n\"You are right again, my dear,\" the old lady retorted, \"but I don't refer to his profession, look you.\"\n\"Oh!\" said I.\n\"No,\" said she. \"I refer, my dear, to his social conduct. He is always paying trivial attentions to young ladies, and always has been, ever since he was eighteen. Now, my dear, he has never really cared for any one of them and has never meant in doing this to do any harm or to express anything but politeness and good nature. Still, it's not right, you know; is it?\"\n\"No,\" said I, as she seemed to wait for me.\n\"And it might lead to mistaken notions, you see, my dear.\"\nI supposed it might.\n\"Therefore, I have told him many times that he really should be more careful, both in justice to himself and in justice to others. And he has always said, 'Mother, I will be; but you know me better than anybody else does, and you know I mean no harm--in short, mean nothing.' All of which is very true, my dear, but is no justification. However, as he is now gone so far away and for an indefinite time, and as he will have good opportunities and introductions, we may consider this past and gone. And you, my dear,\" said the old lady, who was now all nods and smiles, \"regarding your dear self, my love?\"\n\"Me, Mrs. Woodcourt?\"\n\"Not to be always selfish, talking of my son, who has gone to seek his fortune and to find a wife--when do you mean to seek YOUR fortune and to find a husband, Miss Summerson? Hey, look you! Now you blush!\"\nI don't think I did blush--at all events, it was not important if I did--and I said my present fortune perfectly contented me and I had no wish to change it.\n\"Shall I tell you what I always think of you and the fortune yet to come for you, my love?\" said Mrs. Woodcourt.\n\"If you believe you are a good prophet,\" said I.\n\"Why, then, it is that you will marry some one very rich and very worthy, much older--five and twenty years, perhaps--than yourself. And you will be an excellent wife, and much beloved, and very happy.\"\n\"That is a good fortune,\" said I. \"But why is it to be mine?\"\n\"My dear,\" she returned, \"there's suitability in it--you are so busy, and so neat, and so peculiarly situated altogether that there's suitability in it, and it will come to pass. And nobody, my love, will congratulate you more sincerely on such a marriage than I shall.\"\nIt was curious that this should make me uncomfortable, but I think it did. I know it did. It made me for some part of that night uncomfortable. I was so ashamed of my folly that I did not like to confess it even to Ada, and that made me more uncomfortable still. I would have given anything not to have been so much in the bright old lady's confidence if I could have possibly declined it. It gave me the most inconsistent opinions of her. At one time I thought she was a story-teller, and at another time that she was the pink of truth. Now I suspected that she was very cunning, next moment I believed her honest Welsh heart to be perfectly innocent and simple. And after all, what did it matter to me, and why did it matter to me? Why could not I, going up to bed with my basket of keys, stop to sit down by her fire and accommodate myself for a little while to her, at least as well as to anybody else, and not trouble myself about the harmless things she said to me? Impelled towards her, as I certainly was, for I was very anxious that she should like me and was very glad indeed that she did, why should I harp afterwards, with actual distress and pain, on every word she said and weigh it over and over again in twenty scales? Why was it so worrying to me to have her in our house, and confidential to me every night, when I yet felt that it was better and safer somehow that she should be there than anywhere else? These were perplexities and contradictions that I could not account for. At least, if I could--but I shall come to all that by and by, and it is mere idleness to go on about it now.\nSo when Mrs. Woodcourt went away, I was sorry to lose her but was relieved too. And then Caddy Jellyby came down, and Caddy brought such a packet of domestic news that it gave us abundant occupation.\nFirst Caddy declared (and would at first declare nothing else) that I was the best adviser that ever was known. This, my pet said, was no news at all; and this, I said, of course, was nonsense. Then Caddy told us that she was going to be married in a month and that if Ada and I would be her bridesmaids, she was the happiest girl in the world. To be sure, this was news indeed; and I thought we never should have done talking about it, we had so much to say to Caddy, and Caddy had so much to say to us.\nIt seemed that Caddy's unfortunate papa had got over his bankruptcy--\"gone through the Gazette,\" was the expression Caddy used, as if it were a tunnel--with the general clemency and commiseration of his creditors, and had got rid of his affairs in some blessed manner without succeeding in understanding them, and had given up everything he possessed (which was not worth much, I should think, to judge from the state of the furniture), and had satisfied every one concerned that he could do no more, poor man. So, he had been honourably dismissed to \"the office\" to begin the world again. What he did at the office, I never knew; Caddy said he was a \"custom-house and general agent,\" and the only thing I ever understood about that business was that when he wanted money more than usual he went to the docks to look for it, and hardly ever found it.\nAs soon as her papa had tranquillized his mind by becoming this shorn lamb, and they had removed to a furnished lodging in Hatton Garden (where I found the children, when I afterwards went there, cutting the horse hair out of the seats of the chairs and choking themselves with it), Caddy had brought about a meeting between him and old Mr. Turveydrop; and poor Mr. Jellyby, being very humble and meek, had deferred to Mr. Turveydrop's deportment so submissively that they had become excellent friends. By degrees, old Mr. Turveydrop, thus familiarized with the idea of his son's marriage, had worked up his parental feelings to the height of contemplating that event as being near at hand and had given his gracious consent to the young couple commencing housekeeping at the academy in Newman Street when they would.\n\"And your papa, Caddy. What did he say?\"\n\"Oh! Poor Pa,\" said Caddy, \"only cried and said he hoped we might get on better than he and Ma had got on. He didn't say so before Prince, he only said so to me. And he said, 'My poor girl, you have not been very well taught how to make a home for your husband, but unless you mean with all your heart to strive to do it, you had better murder him than marry him--if you really love him.'\"\n\"And how did you reassure him, Caddy?\"\n\"Why, it was very distressing, you know, to see poor Pa so low and hear him say such terrible things, and I couldn't help crying myself. But I told him that I DID mean it with all my heart and that I hoped our house would be a place for him to come and find some comfort in of an evening and that I hoped and thought I could be a better daughter to him there than at home. Then I mentioned Peepy's coming to stay with me, and then Pa began to cry again and said the children were Indians.\"\n\"Indians, Caddy?\"\n\"Yes,\" said Caddy, \"wild Indians. And Pa said\"--here she began to sob, poor girl, not at all like the happiest girl in the world--\"that he was sensible the best thing that could happen to them was their being all tomahawked together.\"\nAda suggested that it was comfortable to know that Mr. Jellyby did not mean these destructive sentiments.\n\"No, of course I know Pa wouldn't like his family to be weltering in their blood,\" said Caddy, \"but he means that they are very unfortunate in being Ma's children and that he is very unfortunate in being Ma's husband; and I am sure that's true, though it seems unnatural to say so.\"\nI asked Caddy if Mrs. Jellyby knew that her wedding-day was fixed.\n\"Oh! You know what Ma is, Esther,\" she returned. \"It's impossible to say whether she knows it or not. She has been told it often enough; and when she IS told it, she only gives me a placid look, as if I was I don't know what--a steeple in the distance,\" said Caddy with a sudden idea; \"and then she shakes her head and says 'Oh, Caddy, Caddy, what a tease you are!' and goes on with the Borrioboola letters.\"\n\"And about your wardrobe, Caddy?\" said I. For she was under no restraint with us.\n\"Well, my dear Esther,\" she returned, drying her eyes, \"I must do the best I can and trust to my dear Prince never to have an unkind remembrance of my coming so shabbily to him. If the question concerned an outfit for Borrioboola, Ma would know all about it and would be quite excited. Being what it is, she neither knows nor cares.\"\nCaddy was not at all deficient in natural affection for her mother, but mentioned this with tears as an undeniable fact, which I am afraid it was. We were sorry for the poor dear girl and found so much to admire in the good disposition which had survived under such discouragement that we both at once (I mean Ada and I) proposed a little scheme that made her perfectly joyful. This was her staying with us for three weeks, my staying with her for one, and our all three contriving and cutting out, and repairing, and sewing, and saving, and doing the very best we could think of to make the most of her stock. My guardian being as pleased with the idea as Caddy was, we took her home next day to arrange the matter and brought her out again in triumph with her boxes and all the purchases that could be squeezed out of a ten-pound note, which Mr. Jellyby had found in the docks I suppose, but which he at all events gave her. What my guardian would not have given her if we had encouraged him, it would be difficult to say, but we thought it right to compound for no more than her wedding-dress and bonnet. He agreed to this compromise, and if Caddy had ever been happy in her life, she was happy when we sat down to work.\nShe was clumsy enough with her needle, poor girl, and pricked her fingers as much as she had been used to ink them. She could not help reddening a little now and then, partly with the smart and partly with vexation at being able to do no better, but she soon got over that and began to improve rapidly. So day after day she, and my darling, and my little maid Charley, and a milliner out of the town, and I, sat hard at work, as pleasantly as possible.\nOver and above this, Caddy was very anxious \"to learn housekeeping,\" as she said. Now, mercy upon us! The idea of her learning housekeeping of a person of my vast experience was such a joke that I laughed, and coloured up, and fell into a comical confusion when she proposed it. However, I said, \"Caddy, I am sure you are very welcome to learn anything that you can learn of ME, my dear,\" and I showed her all my books and methods and all my fidgety ways. You would have supposed that I was showing her some wonderful inventions, by her study of them; and if you had seen her, whenever I jingled my housekeeping keys, get up and attend me, certainly you might have thought that there never was a greater imposter than I with a blinder follower than Caddy Jellyby.\nSo what with working and housekeeping, and lessons to Charley, and backgammon in the evening with my guardian, and duets with Ada, the three weeks slipped fast away. Then I went home with Caddy to see what could be done there, and Ada and Charley remained behind to take care of my guardian.\nWhen I say I went home with Caddy, I mean to the furnished lodging in Hatton Garden. We went to Newman Street two or three times, where preparations were in progress too--a good many, I observed, for enhancing the comforts of old Mr. Turveydrop, and a few for putting the newly married couple away cheaply at the top of the house--but our great point was to make the furnished lodging decent for the wedding-breakfast and to imbue Mrs. Jellyby beforehand with some faint sense of the occasion.\nThe latter was the more difficult thing of the two because Mrs. Jellyby and an unwholesome boy occupied the front sitting-room (the back one was a mere closet), and it was littered down with waste-paper and Borrioboolan documents, as an untidy stable might be littered with straw. Mrs. Jellyby sat there all day drinking strong coffee, dictating, and holding Borrioboolan interviews by appointment. The unwholesome boy, who seemed to me to be going into a decline, took his meals out of the house. When Mr. Jellyby came home, he usually groaned and went down into the kitchen. There he got something to eat if the servant would give him anything, and then, feeling that he was in the way, went out and walked about Hatton Garden in the wet. The poor children scrambled up and tumbled down the house as they had always been accustomed to do.\nThe production of these devoted little sacrifices in any presentable condition being quite out of the question at a week's notice, I proposed to Caddy that we should make them as happy as we could on her marriage morning in the attic where they all slept, and should confine our greatest efforts to her mama and her mama's room, and a clean breakfast. In truth Mrs. Jellyby required a good deal of attention, the lattice-work up her back having widened considerably since I first knew her and her hair looking like the mane of a dustman's horse.\nThinking that the display of Caddy's wardrobe would be the best means of approaching the subject, I invited Mrs. Jellyby to come and look at it spread out on Caddy's bed in the evening after the unwholesome boy was gone.\n\"My dear Miss Summerson,\" said she, rising from her desk with her usual sweetness of temper, \"these are really ridiculous preparations, though your assisting them is a proof of your kindness. There is something so inexpressibly absurd to me in the idea of Caddy being married! Oh, Caddy, you silly, silly, silly puss!\"\nShe came upstairs with us notwithstanding and looked at the clothes in her customary far-off manner. They suggested one distinct idea to her, for she said with her placid smile, and shaking her head, \"My good Miss Summerson, at half the cost, this weak child might have been equipped for Africa!\"\nOn our going downstairs again, Mrs. Jellyby asked me whether this troublesome business was really to take place next Wednesday. And on my replying yes, she said, \"Will my room be required, my dear Miss Summerson? For it's quite impossible that I can put my papers away.\"\nI took the liberty of saying that the room would certainly be wanted and that I thought we must put the papers away somewhere. \"Well, my dear Miss Summerson,\" said Mrs. Jellyby, \"you know best, I dare say. But by obliging me to employ a boy, Caddy has embarrassed me to that extent, overwhelmed as I am with public business, that I don't know which way to turn. We have a Ramification meeting, too, on Wednesday afternoon, and the inconvenience is very serious.\"\n\"It is not likely to occur again,\" said I, smiling. \"Caddy will be married but once, probably.\"\n\"That's true,\" Mrs. Jellyby replied; \"that's true, my dear. I suppose we must make the best of it!\"\nThe next question was how Mrs. Jellyby should be dressed on the occasion. I thought it very curious to see her looking on serenely from her writing-table while Caddy and I discussed it, occasionally shaking her head at us with a half-reproachful smile like a superior spirit who could just bear with our trifling.\nThe state in which her dresses were, and the extraordinary confusion in which she kept them, added not a little to our difficulty; but at length we devised something not very unlike what a common-place mother might wear on such an occasion. The abstracted manner in which Mrs. Jellyby would deliver herself up to having this attire tried on by the dressmaker, and the sweetness with which she would then observe to me how sorry she was that I had not turned my thoughts to Africa, were consistent with the rest of her behaviour.\nThe lodging was rather confined as to space, but I fancied that if Mrs. Jellyby's household had been the only lodgers in Saint Paul's or Saint Peter's, the sole advantage they would have found in the size of the building would have been its affording a great deal of room to be dirty in. I believe that nothing belonging to the family which it had been possible to break was unbroken at the time of those preparations for Caddy's marriage, that nothing which it had been possible to spoil in any way was unspoilt, and that no domestic object which was capable of collecting dirt, from a dear child's knee to the door-plate, was without as much dirt as could well accumulate upon it.\nPoor Mr. Jellyby, who very seldom spoke and almost always sat when he was at home with his head against the wall, became interested when he saw that Caddy and I were attempting to establish some order among all this waste and ruin and took off his coat to help. But such wonderful things came tumbling out of the closets when they were opened--bits of mouldy pie, sour bottles, Mrs. Jellyby's caps, letters, tea, forks, odd boots and shoes of children, firewood, wafers, saucepan-lids, damp sugar in odds and ends of paper bags, footstools, blacklead brushes, bread, Mrs. Jellyby's bonnets, books with butter sticking to the binding, guttered candle ends put out by being turned upside down in broken candlesticks, nutshells, heads and tails of shrimps, dinner-mats, gloves, coffee-grounds, umbrellas--that he looked frightened, and left off again. But he came regularly every evening and sat without his coat, with his head against the wall, as though he would have helped us if he had known how.\n\"Poor Pa!\" said Caddy to me on the night before the great day, when we really had got things a little to rights. \"It seems unkind to leave him, Esther. But what could I do if I stayed! Since I first knew you, I have tidied and tidied over and over again, but it's useless. Ma and Africa, together, upset the whole house directly. We never have a servant who don't drink. Ma's ruinous to everything.\"\nMr. Jellyby could not hear what she said, but he seemed very low indeed and shed tears, I thought.\n\"My heart aches for him; that it does!\" sobbed Caddy. \"I can't help thinking to-night, Esther, how dearly I hope to be happy with Prince, and how dearly Pa hoped, I dare say, to be happy with Ma. What a disappointed life!\"\n\"My dear Caddy!\" said Mr. Jellyby, looking slowly round from the wail. It was the first time, I think, I ever heard him say three words together.\n\"Yes, Pa!\" cried Caddy, going to him and embracing him affectionately.\n\"My dear Caddy,\" said Mr. Jellyby. \"Never have--\"\n\"Not Prince, Pa?\" faltered Caddy. \"Not have Prince?\"\n\"Yes, my dear,\" said Mr. Jellyby. \"Have him, certainly. But, never have--\"\nI mentioned in my account of our first visit in Thavies Inn that Richard described Mr. Jellyby as frequently opening his mouth after dinner without saying anything. It was a habit of his. He opened his mouth now a great many times and shook his head in a melancholy manner.\n\"What do you wish me not to have? Don't have what, dear Pa?\" asked Caddy, coaxing him, with her arms round his neck.\n\"Never have a mission, my dear child.\"\nMr. Jellyby groaned and laid his head against the wall again, and this was the only time I ever heard him make any approach to expressing his sentiments on the Borrioboolan question. I suppose he had been more talkative and lively once, but he seemed to have been completely exhausted long before I knew him.\nI thought Mrs. Jellyby never would have left off serenely looking over her papers and drinking coffee that night. It was twelve o'clock before we could obtain possession of the room, and the clearance it required then was so discouraging that Caddy, who was almost tired out, sat down in the middle of the dust and cried. But she soon cheered up, and we did wonders with it before we went to bed.\nIn the morning it looked, by the aid of a few flowers and a quantity of soap and water and a little arrangement, quite gay. The plain breakfast made a cheerful show, and Caddy was perfectly charming. But when my darling came, I thought--and I think now--that I never had seen such a dear face as my beautiful pet's.\nWe made a little feast for the children upstairs, and we put Peepy at the head of the table, and we showed them Caddy in her bridal dress, and they clapped their hands and hurrahed, and Caddy cried to think that she was going away from them and hugged them over and over again until we brought Prince up to fetch her away--when, I am sorry to say, Peepy bit him. Then there was old Mr. Turveydrop downstairs, in a state of deportment not to be expressed, benignly blessing Caddy and giving my guardian to understand that his son's happiness was his own parental work and that he sacrificed personal considerations to ensure it. \"My dear sir,\" said Mr. Turveydrop, \"these young people will live with me; my house is large enough for their accommodation, and they shall not want the shelter of my roof. I could have wished--you will understand the allusion, Mr. Jarndyce, for you remember my illustrious patron the Prince Regent--I could have wished that my son had married into a family where there was more deportment, but the will of heaven be done!\"\nMr. and Mrs. Pardiggle were of the party--Mr. Pardiggle, an obstinate-looking man with a large waistcoat and stubbly hair, who was always talking in a loud bass voice about his mite, or Mrs. Pardiggle's mite, or their five boys' mites. Mr. Quale, with his hair brushed back as usual and his knobs of temples shining very much, was also there, not in the character of a disappointed lover, but as the accepted of a young--at least, an unmarried--lady, a Miss Wisk, who was also there. Miss Wisk's mission, my guardian said, was to show the world that woman's mission was man's mission and that the only genuine mission of both man and woman was to be always moving declaratory resolutions about things in general at public meetings. The guests were few, but were, as one might expect at Mrs. Jellyby's, all devoted to public objects only. Besides those I have mentioned, there was an extremely dirty lady with her bonnet all awry and the ticketed price of her dress still sticking on it, whose neglected home, Caddy told me, was like a filthy wilderness, but whose church was like a fancy fair. A very contentious gentleman, who said it was his mission to be everybody's brother but who appeared to be on terms of coolness with the whole of his large family, completed the party.\nA party, having less in common with such an occasion, could hardly have been got together by any ingenuity. Such a mean mission as the domestic mission was the very last thing to be endured among them; indeed, Miss Wisk informed us, with great indignation, before we sat down to breakfast, that the idea of woman's mission lying chiefly in the narrow sphere of home was an outrageous slander on the part of her tyrant, man. One other singularity was that nobody with a mission--except Mr. Quale, whose mission, as I think I have formerly said, was to be in ecstasies with everybody's mission--cared at all for anybody's mission. Mrs. Pardiggle being as clear that the only one infallible course was her course of pouncing upon the poor and applying benevolence to them like a strait-waistcoat; as Miss Wisk was that the only practical thing for the world was the emancipation of woman from the thraldom of her tyrant, man. Mrs. Jellyby, all the while, sat smiling at the limited vision that could see anything but Borrioboola-Gha.\nBut I am anticipating now the purport of our conversation on the ride home instead of first marrying Caddy. We all went to church, and Mr. Jellyby gave her away. Of the air with which old Mr. Turveydrop, with his hat under his left arm (the inside presented at the clergyman like a cannon) and his eyes creasing themselves up into his wig, stood stiff and high-shouldered behind us bridesmaids during the ceremony, and afterwards saluted us, I could never say enough to do it justice. Miss Wisk, whom I cannot report as prepossessing in appearance, and whose manner was grim, listened to the proceedings, as part of woman's wrongs, with a disdainful face. Mrs. Jellyby, with her calm smile and her bright eyes, looked the least concerned of all the company.\nWe duly came back to breakfast, and Mrs. Jellyby sat at the head of the table and Mr. Jellyby at the foot. Caddy had previously stolen upstairs to hug the children again and tell them that her name was Turveydrop. But this piece of information, instead of being an agreeable surprise to Peepy, threw him on his back in such transports of kicking grief that I could do nothing on being sent for but accede to the proposal that he should be admitted to the breakfast table. So he came down and sat in my lap; and Mrs. Jellyby, after saying, in reference to the state of his pinafore, \"Oh, you naughty Peepy, what a shocking little pig you are!\" was not at all discomposed. He was very good except that he brought down Noah with him (out of an ark I had given him before we went to church) and WOULD dip him head first into the wine-glasses and then put him in his mouth.\nMy guardian, with his sweet temper and his quick perception and his amiable face, made something agreeable even out of the ungenial company. None of them seemed able to talk about anything but his, or her, own one subject, and none of them seemed able to talk about even that as part of a world in which there was anything else; but my guardian turned it all to the merry encouragement of Caddy and the honour of the occasion, and brought us through the breakfast nobly. What we should have done without him, I am afraid to think, for all the company despising the bride and bridegroom and old Mr. Turveydrop--and old Mr. Thurveydrop, in virtue of his deportment, considering himself vastly superior to all the company--it was a very unpromising case.\nAt last the time came when poor Caddy was to go and when all her property was packed on the hired coach and pair that was to take her and her husband to Gravesend. It affected us to see Caddy clinging, then, to her deplorable home and hanging on her mother's neck with the greatest tenderness.\n\"I am very sorry I couldn't go on writing from dictation, Ma,\" sobbed Caddy. \"I hope you forgive me now.\"\n\"Oh, Caddy, Caddy!\" said Mrs. Jellyby. \"I have told you over and over again that I have engaged a boy, and there's an end of it.\"\n\"You are sure you are not the least angry with me, Ma? Say you are sure before I go away, Ma?\"\n\"You foolish Caddy,\" returned Mrs. Jellyby, \"do I look angry, or have I inclination to be angry, or time to be angry? How CAN you?\"\n\"Take a little care of Pa while I am gone, Mama!\"\nMrs. Jellyby positively laughed at the fancy. \"You romantic child,\" said she, lightly patting Caddy's back. \"Go along. I am excellent friends with you. Now, good-bye, Caddy, and be very happy!\"\nThen Caddy hung upon her father and nursed his cheek against hers as if he were some poor dull child in pain. All this took place in the hall. Her father released her, took out his pocket handkerchief, and sat down on the stairs with his head against the wall. I hope he found some consolation in walls. I almost think he did.\nAnd then Prince took her arm in his and turned with great emotion and respect to his father, whose deportment at that moment was overwhelming.\n\"Thank you over and over again, father!\" said Prince, kissing his hand. \"I am very grateful for all your kindness and consideration regarding our marriage, and so, I can assure you, is Caddy.\"\n\"Very,\" sobbed Caddy. \"Ve-ry!\"\n\"My dear son,\" said Mr. Turveydrop, \"and dear daughter, I have done my duty. If the spirit of a sainted wooman hovers above us and looks down on the occasion, that, and your constant affection, will be my recompense. You will not fail in YOUR duty, my son and daughter, I believe?\"\n\"Dear father, never!\" cried Prince.\n\"Never, never, dear Mr. Turveydrop!\" said Caddy.\n\"This,\" returned Mr. Turveydrop, \"is as it should be. My children, my home is yours, my heart is yours, my all is yours. I will never leave you; nothing but death shall part us. My dear son, you contemplate an absence of a week, I think?\"\n\"A week, dear father. We shall return home this day week.\"\n\"My dear child,\" said Mr. Turveydrop, \"let me, even under the present exceptional circumstances, recommend strict punctuality. It is highly important to keep the connexion together; and schools, if at all neglected, are apt to take offence.\"\n\"This day week, father, we shall be sure to be home to dinner.\"\n\"Good!\" said Mr. Turveydrop. \"You will find fires, my dear Caroline, in your own room, and dinner prepared in my apartment. Yes, yes, Prince!\" anticipating some self-denying objection on his son's part with a great air. \"You and our Caroline will be strange in the upper part of the premises and will, therefore, dine that day in my apartment. Now, bless ye!\"\nThey drove away, and whether I wondered most at Mrs. Jellyby or at Mr. Turveydrop, I did not know. Ada and my guardian were in the same condition when we came to talk it over. But before we drove away too, I received a most unexpected and eloquent compliment from Mr. Jellyby. He came up to me in the hall, took both my hands, pressed them earnestly, and opened his mouth twice. I was so sure of his meaning that I said, quite flurried, \"You are very welcome, sir. Pray don't mention it!\"\n\"I hope this marriage is for the best, guardian,\" said I when we three were on our road home.\n\"I hope it is, little woman. Patience. We shall see.\"\n\"Is the wind in the east to-day?\" I ventured to ask him.\nHe laughed heartily and answered, \"No.\"\n\"But it must have been this morning, I think,\" said I.\nHe answered \"No\" again, and this time my dear girl confidently answered \"No\" too and shook the lovely head which, with its blooming flowers against the golden hair, was like the very spring. \"Much YOU know of east winds, my ugly darling,\" said I, kissing her in my admiration--I couldn't help it.\nWell! It was only their love for me, I know very well, and it is a long time ago. I must write it even if I rub it out again, because it gives me so much pleasure. They said there could be no east wind where Somebody was; they said that wherever Dame Durden went, there was sunshine and summer air.",
        "paragraph_chars": [
            [
                0,
                753
            ],
            [
                753,
                1274
            ],
            [
                1274,
                1835
            ],
            [
                1835,
                2090
            ],
            [
                2090,
                2276
            ],
            [
                2276,
                2507
            ],
            [
                2507,
                2661
            ],
            [
                2661,
                3127
            ],
            [
                3127,
                3324
            ],
            [
                3324,
                3633
            ],
            [
                3633,
                3664
            ],
            [
                3664,
                3779
            ],
            [
                3779,
                3833
            ],
            [
                3833,
                3907
            ],
            [
                3907,
                3930
            ],
            [
                3930,
                3984
            ],
            [
                3984,
                4278
            ],
            [
                4278,
                4510
            ],
            [
                4510,
                4536
            ],
            [
                4536,
                4804
            ],
            [
                4804,
                4995
            ],
            [
                4995,
                5099
            ],
            [
                5099,
                5113
            ],
            [
                5113,
                5481
            ],
            [
                5481,
                5525
            ],
            [
                5525,
                5584
            ],
            [
                5584,
                5605
            ],
            [
                5605,
                6211
            ],
            [
                6211,
                6233
            ],
            [
                6233,
                6440
            ],
            [
                6440,
                6598
            ],
            [
                6598,
                6711
            ],
            [
                6711,
                6760
            ],
            [
                6760,
                6963
            ],
            [
                6963,
                7025
            ],
            [
                7025,
                7296
            ],
            [
                7296,
                8902
            ],
            [
                8902,
                9102
            ],
            [
                9102,
                9607
            ],
            [
                9607,
                10458
            ],
            [
                10458,
                11276
            ],
            [
                11276,
                11317
            ],
            [
                11317,
                11707
            ],
            [
                11707,
                11746
            ],
            [
                11746,
                12236
            ],
            [
                12236,
                12254
            ],
            [
                12254,
                12489
            ],
            [
                12489,
                12595
            ],
            [
                12595,
                12878
            ],
            [
                12878,
                12945
            ],
            [
                12945,
                13354
            ],
            [
                13354,
                13436
            ],
            [
                13436,
                13770
            ],
            [
                13770,
                14994
            ],
            [
                14994,
                15447
            ],
            [
                15447,
                16211
            ],
            [
                16211,
                16503
            ],
            [
                16503,
                16997
            ],
            [
                16997,
                17838
            ],
            [
                17838,
                18384
            ],
            [
                18384,
                18605
            ],
            [
                18605,
                18924
            ],
            [
                18924,
                19221
            ],
            [
                19221,
                19492
            ],
            [
                19492,
                19955
            ],
            [
                19955,
                20051
            ],
            [
                20051,
                20151
            ],
            [
                20151,
                20465
            ],
            [
                20465,
                20994
            ],
            [
                20994,
                21677
            ],
            [
                21677,
                22675
            ],
            [
                22675,
                23075
            ],
            [
                23075,
                23174
            ],
            [
                23174,
                23397
            ],
            [
                23397,
                23543
            ],
            [
                23543,
                23614
            ],
            [
                23614,
                23664
            ],
            [
                23664,
                23717
            ],
            [
                23717,
                23792
            ],
            [
                23792,
                24066
            ],
            [
                24066,
                24183
            ],
            [
                24183,
                24222
            ],
            [
                24222,
                24531
            ],
            [
                24531,
                24928
            ],
            [
                24928,
                25244
            ],
            [
                25244,
                26296
            ],
            [
                26296,
                27575
            ],
            [
                27575,
                28606
            ],
            [
                28606,
                29364
            ],
            [
                29364,
                30233
            ],
            [
                30233,
                30985
            ],
            [
                30985,
                31279
            ],
            [
                31279,
                31385
            ],
            [
                31385,
                31515
            ],
            [
                31515,
                31610
            ],
            [
                31610,
                31742
            ],
            [
                31742,
                31792
            ],
            [
                31792,
                31986
            ],
            [
                31986,
                32313
            ],
            [
                32313,
                32456
            ],
            [
                32456,
                32649
            ],
            [
                32649,
                32680
            ],
            [
                32680,
                32962
            ],
            [
                32962,
                32998
            ],
            [
                32998,
                33047
            ],
            [
                33047,
                33286
            ],
            [
                33286,
                33345
            ],
            [
                33345,
                33587
            ],
            [
                33587,
                33651
            ],
            [
                33651,
                34011
            ],
            [
                34011,
                34500
            ],
            [
                34500,
                34594
            ],
            [
                34594,
                34648
            ],
            [
                34648,
                34705
            ],
            [
                34705,
                34745
            ],
            [
                34745,
                34800
            ],
            [
                34800,
                35097
            ],
            [
                35097,
                35395
            ]
        ],
        "segment_chars": [
            [
                0,
                85
            ],
            [
                85,
                109
            ],
            [
                109,
                426
            ],
            [
                426,
                465
            ],
            [
                465,
                584
            ],
            [
                584,
                753
            ],
            [
                753,
                928
            ],
            [
                928,
                1053
            ],
            [
                1053,
                1163
            ],
            [
                1163,
                1189
            ],
            [
                1189,
                1240
            ],
            [
                1240,
                1274
            ],
            [
                1274,
                1489
            ],
            [
                1489,
                1700
            ],
            [
                1700,
                1835
            ],
            [
                1835,
                1951
            ],
            [
                1951,
                2010
            ],
            [
                2010,
                2090
            ],
            [
                2090,
                2214
            ],
            [
                2214,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2337,
                2507
            ],
            [
                2507,
                2661
            ],
            [
                2661,
                2872
            ],
            [
                2872,
                2969
            ],
            [
                2969,
                3032
            ],
            [
                3032,
                3127
            ],
            [
                3127,
                3279
            ],
            [
                3279,
                3324
            ],
            [
                3324,
                3534
            ],
            [
                3534,
                3633
            ],
            [
                3633,
                3646
            ],
            [
                3646,
                3664
            ],
            [
                3664,
                3679
            ],
            [
                3679,
                3779
            ],
            [
                3779,
                3833
            ],
            [
                3833,
                3868
            ],
            [
                3868,
                3882
            ],
            [
                3882,
                3907
            ],
            [
                3907,
                3930
            ],
            [
                3930,
                3970
            ],
            [
                3970,
                3984
            ],
            [
                3984,
                4119
            ],
            [
                4119,
                4278
            ],
            [
                4278,
                4300
            ],
            [
                4300,
                4339
            ],
            [
                4339,
                4364
            ],
            [
                4364,
                4421
            ],
            [
                4421,
                4455
            ],
            [
                4455,
                4510
            ],
            [
                4510,
                4536
            ],
            [
                4536,
                4541
            ],
            [
                4541,
                4668
            ],
            [
                4668,
                4804
            ],
            [
                4804,
                4995
            ],
            [
                4995,
                5099
            ],
            [
                5099,
                5105
            ],
            [
                5105,
                5113
            ],
            [
                5113,
                5129
            ],
            [
                5129,
                5171
            ],
            [
                5171,
                5276
            ],
            [
                5276,
                5440
            ],
            [
                5440,
                5481
            ],
            [
                5481,
                5525
            ],
            [
                5525,
                5584
            ],
            [
                5584,
                5605
            ],
            [
                5605,
                5736
            ],
            [
                5736,
                5881
            ],
            [
                5881,
                5942
            ],
            [
                5942,
                6103
            ],
            [
                6103,
                6211
            ],
            [
                6211,
                6233
            ],
            [
                6233,
                6409
            ],
            [
                6409,
                6424
            ],
            [
                6424,
                6440
            ],
            [
                6440,
                6598
            ],
            [
                6598,
                6690
            ],
            [
                6690,
                6711
            ],
            [
                6711,
                6760
            ],
            [
                6760,
                6893
            ],
            [
                6893,
                6963
            ],
            [
                6963,
                6997
            ],
            [
                6997,
                7025
            ],
            [
                7025,
                7204
            ],
            [
                7204,
                7296
            ],
            [
                7296,
                7371
            ],
            [
                7371,
                7386
            ],
            [
                7386,
                7440
            ],
            [
                7440,
                7559
            ],
            [
                7559,
                7686
            ],
            [
                7686,
                7736
            ],
            [
                7736,
                7834
            ],
            [
                7834,
                7960
            ],
            [
                7960,
                8030
            ],
            [
                8030,
                8268
            ],
            [
                8268,
                8531
            ],
            [
                8531,
                8720
            ],
            [
                8720,
                8793
            ],
            [
                8793,
                8902
            ],
            [
                8902,
                8982
            ],
            [
                8982,
                9102
            ],
            [
                9102,
                9214
            ],
            [
                9214,
                9296
            ],
            [
                9296,
                9447
            ],
            [
                9447,
                9607
            ],
            [
                9607,
                10118
            ],
            [
                10118,
                10197
            ],
            [
                10197,
                10458
            ],
            [
                10458,
                10961
            ],
            [
                10961,
                11276
            ],
            [
                11276,
                11299
            ],
            [
                11299,
                11317
            ],
            [
                11317,
                11322
            ],
            [
                11322,
                11424
            ],
            [
                11424,
                11479
            ],
            [
                11479,
                11707
            ],
            [
                11707,
                11746
            ],
            [
                11746,
                11883
            ],
            [
                11883,
                12119
            ],
            [
                12119,
                12236
            ],
            [
                12236,
                12254
            ],
            [
                12254,
                12288
            ],
            [
                12288,
                12489
            ],
            [
                12489,
                12595
            ],
            [
                12595,
                12878
            ],
            [
                12878,
                12945
            ],
            [
                12945,
                12950
            ],
            [
                12950,
                12994
            ],
            [
                12994,
                13047
            ],
            [
                13047,
                13311
            ],
            [
                13311,
                13354
            ],
            [
                13354,
                13388
            ],
            [
                13388,
                13396
            ],
            [
                13396,
                13436
            ],
            [
                13436,
                13614
            ],
            [
                13614,
                13722
            ],
            [
                13722,
                13770
            ],
            [
                13770,
                13917
            ],
            [
                13917,
                14148
            ],
            [
                14148,
                14381
            ],
            [
                14381,
                14697
            ],
            [
                14697,
                14878
            ],
            [
                14878,
                14994
            ],
            [
                14994,
                15110
            ],
            [
                15110,
                15297
            ],
            [
                15297,
                15447
            ],
            [
                15447,
                15529
            ],
            [
                15529,
                15549
            ],
            [
                15549,
                15726
            ],
            [
                15726,
                15903
            ],
            [
                15903,
                16211
            ],
            [
                16211,
                16377
            ],
            [
                16377,
                16503
            ],
            [
                16503,
                16588
            ],
            [
                16588,
                16997
            ],
            [
                16997,
                17278
            ],
            [
                17278,
                17396
            ],
            [
                17396,
                17495
            ],
            [
                17495,
                17574
            ],
            [
                17574,
                17738
            ],
            [
                17738,
                17838
            ],
            [
                17838,
                18190
            ],
            [
                18190,
                18384
            ],
            [
                18384,
                18605
            ],
            [
                18605,
                18797
            ],
            [
                18797,
                18882
            ],
            [
                18882,
                18924
            ],
            [
                18924,
                19025
            ],
            [
                19025,
                19221
            ],
            [
                19221,
                19349
            ],
            [
                19349,
                19434
            ],
            [
                19434,
                19492
            ],
            [
                19492,
                19619
            ],
            [
                19619,
                19698
            ],
            [
                19698,
                19854
            ],
            [
                19854,
                19955
            ],
            [
                19955,
                20007
            ],
            [
                20007,
                20051
            ],
            [
                20051,
                20111
            ],
            [
                20111,
                20151
            ],
            [
                20151,
                20225
            ],
            [
                20225,
                20465
            ],
            [
                20465,
                20706
            ],
            [
                20706,
                20994
            ],
            [
                20994,
                21282
            ],
            [
                21282,
                21677
            ],
            [
                21677,
                21939
            ],
            [
                21939,
                22526
            ],
            [
                22526,
                22675
            ],
            [
                22675,
                22686
            ],
            [
                22686,
                22788
            ],
            [
                22788,
                22827
            ],
            [
                22827,
                22860
            ],
            [
                22860,
                22948
            ],
            [
                22948,
                23005
            ],
            [
                23005,
                23046
            ],
            [
                23046,
                23075
            ],
            [
                23075,
                23174
            ],
            [
                23174,
                23214
            ],
            [
                23214,
                23228
            ],
            [
                23228,
                23370
            ],
            [
                23370,
                23397
            ],
            [
                23397,
                23414
            ],
            [
                23414,
                23468
            ],
            [
                23468,
                23543
            ],
            [
                23543,
                23554
            ],
            [
                23554,
                23614
            ],
            [
                23614,
                23649
            ],
            [
                23649,
                23664
            ],
            [
                23664,
                23682
            ],
            [
                23682,
                23698
            ],
            [
                23698,
                23717
            ],
            [
                23717,
                23751
            ],
            [
                23751,
                23773
            ],
            [
                23773,
                23792
            ],
            [
                23792,
                23957
            ],
            [
                23957,
                23980
            ],
            [
                23980,
                24066
            ],
            [
                24066,
                24100
            ],
            [
                24100,
                24127
            ],
            [
                24127,
                24183
            ],
            [
                24183,
                24222
            ],
            [
                24222,
                24405
            ],
            [
                24405,
                24531
            ],
            [
                24531,
                24645
            ],
            [
                24645,
                24853
            ],
            [
                24853,
                24928
            ],
            [
                24928,
                25052
            ],
            [
                25052,
                25128
            ],
            [
                25128,
                25244
            ],
            [
                25244,
                25607
            ],
            [
                25607,
                25872
            ],
            [
                25872,
                26045
            ],
            [
                26045,
                26296
            ],
            [
                26296,
                26532
            ],
            [
                26532,
                26780
            ],
            [
                26780,
                27028
            ],
            [
                27028,
                27134
            ],
            [
                27134,
                27390
            ],
            [
                27390,
                27575
            ],
            [
                27575,
                27683
            ],
            [
                27683,
                27999
            ],
            [
                27999,
                28204
            ],
            [
                28204,
                28498
            ],
            [
                28498,
                28606
            ],
            [
                28606,
                28714
            ],
            [
                28714,
                28768
            ],
            [
                28768,
                29091
            ],
            [
                29091,
                29262
            ],
            [
                29262,
                29364
            ],
            [
                29364,
                29471
            ],
            [
                29471,
                29578
            ],
            [
                29578,
                29836
            ],
            [
                29836,
                30007
            ],
            [
                30007,
                30035
            ],
            [
                30035,
                30233
            ],
            [
                30233,
                30374
            ],
            [
                30374,
                30704
            ],
            [
                30704,
                30985
            ],
            [
                30985,
                31149
            ],
            [
                31149,
                31279
            ],
            [
                31279,
                31356
            ],
            [
                31356,
                31385
            ],
            [
                31385,
                31405
            ],
            [
                31405,
                31424
            ],
            [
                31424,
                31515
            ],
            [
                31515,
                31570
            ],
            [
                31570,
                31610
            ],
            [
                31610,
                31728
            ],
            [
                31728,
                31742
            ],
            [
                31742,
                31792
            ],
            [
                31792,
                31838
            ],
            [
                31838,
                31900
            ],
            [
                31900,
                31911
            ],
            [
                31911,
                31944
            ],
            [
                31944,
                31986
            ],
            [
                31986,
                32096
            ],
            [
                32096,
                32129
            ],
            [
                32129,
                32247
            ],
            [
                32247,
                32290
            ],
            [
                32290,
                32313
            ],
            [
                32313,
                32456
            ],
            [
                32456,
                32497
            ],
            [
                32497,
                32528
            ],
            [
                32528,
                32649
            ],
            [
                32649,
                32671
            ],
            [
                32671,
                32680
            ],
            [
                32680,
                32757
            ],
            [
                32757,
                32897
            ],
            [
                32897,
                32962
            ],
            [
                32962,
                32984
            ],
            [
                32984,
                32998
            ],
            [
                32998,
                33035
            ],
            [
                33035,
                33047
            ],
            [
                33047,
                33101
            ],
            [
                33101,
                33168
            ],
            [
                33168,
                33225
            ],
            [
                33225,
                33286
            ],
            [
                33286,
                33308
            ],
            [
                33308,
                33345
            ],
            [
                33345,
                33472
            ],
            [
                33472,
                33587
            ],
            [
                33587,
                33651
            ],
            [
                33651,
                33659
            ],
            [
                33659,
                33680
            ],
            [
                33680,
                33775
            ],
            [
                33775,
                33794
            ],
            [
                33794,
                33871
            ],
            [
                33871,
                33995
            ],
            [
                33995,
                34011
            ],
            [
                34011,
                34110
            ],
            [
                34110,
                34187
            ],
            [
                34187,
                34288
            ],
            [
                34288,
                34390
            ],
            [
                34390,
                34476
            ],
            [
                34476,
                34500
            ],
            [
                34500,
                34594
            ],
            [
                34594,
                34623
            ],
            [
                34623,
                34633
            ],
            [
                34633,
                34648
            ],
            [
                34648,
                34682
            ],
            [
                34682,
                34705
            ],
            [
                34705,
                34745
            ],
            [
                34745,
                34800
            ],
            [
                34800,
                34991
            ],
            [
                34991,
                35097
            ],
            [
                35097,
                35103
            ],
            [
                35103,
                35179
            ],
            [
                35179,
                35261
            ],
            [
                35261,
                35395
            ]
        ],
        "overlap_chars": [
            [
                0,
                85
            ],
            [
                109,
                115
            ],
            [
                242,
                244
            ],
            [
                116,
                191
            ],
            [
                225,
                226
            ],
            [
                362,
                426
            ],
            [
                426,
                465
            ],
            [
                465,
                584
            ],
            [
                670,
                696
            ],
            [
                662,
                664
            ],
            [
                696,
                703
            ],
            [
                724,
                737
            ],
            [
                744,
                753
            ],
            [
                753,
                823
            ],
            [
                838,
                879
            ],
            [
                886,
                928
            ],
            [
                984,
                997
            ],
            [
                939,
                976
            ],
            [
                1053,
                1056
            ],
            [
                1074,
                1077
            ],
            [
                1086,
                1163
            ],
            [
                1163,
                1189
            ],
            [
                1189,
                1215
            ],
            [
                1226,
                1240
            ],
            [
                1240,
                1251
            ],
            [
                1253,
                1259
            ],
            [
                1263,
                1274
            ],
            [
                1285,
                1489
            ],
            [
                1489,
                1573
            ],
            [
                1609,
                1619
            ],
            [
                1625,
                1632
            ],
            [
                1586,
                1601
            ],
            [
                1632,
                1700
            ],
            [
                1700,
                1734
            ],
            [
                1736,
                1750
            ],
            [
                1833,
                1835
            ],
            [
                1835,
                1951
            ],
            [
                1951,
                2010
            ],
            [
                2010,
                2039
            ],
            [
                2047,
                2050
            ],
            [
                2072,
                2090
            ],
            [
                2090,
                2121
            ],
            [
                2135,
                2214
            ],
            [
                2214,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2337,
                2338
            ],
            [
                2364,
                2389
            ],
            [
                2405,
                2426
            ],
            [
                2453,
                2507
            ],
            [
                2507,
                2539
            ],
            [
                2659,
                2660
            ],
            [
                2661,
                2662
            ],
            [
                2680,
                2705
            ],
            [
                2718,
                2740
            ],
            [
                2765,
                2872
            ],
            [
                2872,
                2969
            ],
            [
                2969,
                3032
            ],
            [
                3032,
                3067
            ],
            [
                3090,
                3127
            ],
            [
                3127,
                3177
            ],
            [
                3277,
                3279
            ],
            [
                3279,
                3312
            ],
            [
                3322,
                3324
            ],
            [
                3324,
                3378
            ],
            [
                3438,
                3442
            ],
            [
                3456,
                3534
            ],
            [
                3534,
                3581
            ],
            [
                3617,
                3633
            ],
            [
                3633,
                3646
            ],
            [
                3646,
                3664
            ],
            [
                3679,
                3779
            ],
            [
                3779,
                3810
            ],
            [
                3841,
                3843
            ],
            [
                3815,
                3830
            ],
            [
                3908,
                3926
            ],
            [
                3930,
                3970
            ],
            [
                3970,
                3984
            ],
            [
                3984,
                4059
            ],
            [
                4071,
                4119
            ],
            [
                4119,
                4190
            ],
            [
                4192,
                4202
            ],
            [
                4204,
                4278
            ],
            [
                4278,
                4300
            ],
            [
                4300,
                4339
            ],
            [
                4364,
                4421
            ],
            [
                4455,
                4501
            ],
            [
                4507,
                4510
            ],
            [
                4510,
                4536
            ],
            [
                4536,
                4541
            ],
            [
                4541,
                4574
            ],
            [
                4594,
                4640
            ],
            [
                4666,
                4668
            ],
            [
                4668,
                4733
            ],
            [
                4773,
                4801
            ],
            [
                5171,
                5230
            ],
            [
                5238,
                5246
            ],
            [
                5253,
                5276
            ],
            [
                5276,
                5323
            ],
            [
                5328,
                5355
            ],
            [
                5388,
                5411
            ],
            [
                5427,
                5440
            ],
            [
                5440,
                5481
            ],
            [
                5481,
                5525
            ],
            [
                5525,
                5584
            ],
            [
                5584,
                5605
            ],
            [
                5605,
                5606
            ],
            [
                5617,
                5681
            ],
            [
                5734,
                5736
            ],
            [
                5736,
                5792
            ],
            [
                5840,
                5854
            ],
            [
                5856,
                5881
            ],
            [
                5888,
                5942
            ],
            [
                5942,
                5980
            ],
            [
                6007,
                6103
            ],
            [
                6103,
                6140
            ],
            [
                6153,
                6211
            ],
            [
                6211,
                6233
            ],
            [
                6233,
                6330
            ],
            [
                6332,
                6409
            ],
            [
                6424,
                6440
            ],
            [
                6440,
                6465
            ],
            [
                6517,
                6598
            ],
            [
                6598,
                6638
            ],
            [
                6678,
                6690
            ],
            [
                6690,
                6711
            ],
            [
                6711,
                6760
            ],
            [
                6760,
                6844
            ],
            [
                6846,
                6876
            ],
            [
                6878,
                6893
            ],
            [
                6893,
                6963
            ],
            [
                6963,
                6997
            ],
            [
                6997,
                7025
            ],
            [
                7025,
                7051
            ],
            [
                7078,
                7134
            ],
            [
                7146,
                7150
            ],
            [
                7074,
                7076
            ],
            [
                7176,
                7204
            ],
            [
                7204,
                7296
            ],
            [
                7296,
                7354
            ],
            [
                7363,
                7371
            ],
            [
                7440,
                7514
            ],
            [
                7557,
                7559
            ],
            [
                7559,
                7647
            ],
            [
                7686,
                7736
            ],
            [
                7736,
                7785
            ],
            [
                7877,
                7959
            ],
            [
                7960,
                7974
            ],
            [
                8005,
                8030
            ],
            [
                8030,
                8033
            ],
            [
                8044,
                8045
            ],
            [
                8211,
                8260
            ],
            [
                8266,
                8268
            ],
            [
                8314,
                8319
            ],
            [
                8295,
                8304
            ],
            [
                8320,
                8374
            ],
            [
                8382,
                8395
            ],
            [
                8396,
                8430
            ],
            [
                8438,
                8531
            ],
            [
                8720,
                8743
            ],
            [
                8763,
                8793
            ],
            [
                8793,
                8813
            ],
            [
                8815,
                8853
            ],
            [
                8900,
                8902
            ],
            [
                8902,
                8963
            ],
            [
                8968,
                8982
            ],
            [
                8982,
                9014
            ],
            [
                9039,
                9064
            ],
            [
                9100,
                9102
            ],
            [
                9102,
                9122
            ],
            [
                9165,
                9214
            ],
            [
                9296,
                9300
            ],
            [
                9307,
                9447
            ],
            [
                9447,
                9479
            ],
            [
                9605,
                9607
            ],
            [
                9607,
                9674
            ],
            [
                9917,
                10061
            ],
            [
                9806,
                9819
            ],
            [
                10082,
                10118
            ],
            [
                10118,
                10120
            ],
            [
                10122,
                10197
            ],
            [
                10197,
                10257
            ],
            [
                10259,
                10289
            ],
            [
                10456,
                10458
            ],
            [
                10538,
                10546
            ],
            [
                10555,
                10687
            ],
            [
                10688,
                10693
            ],
            [
                10708,
                10738
            ],
            [
                10741,
                10961
            ],
            [
                10961,
                10991
            ],
            [
                11048,
                11086
            ],
            [
                11101,
                11114
            ],
            [
                11028,
                11046
            ],
            [
                11148,
                11202
            ],
            [
                11214,
                11219
            ],
            [
                11227,
                11258
            ],
            [
                11274,
                11276
            ],
            [
                11276,
                11299
            ],
            [
                11299,
                11317
            ],
            [
                11317,
                11322
            ],
            [
                11322,
                11424
            ],
            [
                11424,
                11437
            ],
            [
                11441,
                11455
            ],
            [
                11483,
                11490
            ],
            [
                11472,
                11477
            ],
            [
                11490,
                11679
            ],
            [
                11681,
                11707
            ],
            [
                11707,
                11746
            ],
            [
                11746,
                11846
            ],
            [
                11881,
                11883
            ],
            [
                11883,
                12016
            ],
            [
                12034,
                12050
            ],
            [
                12063,
                12119
            ],
            [
                12119,
                12171
            ],
            [
                12177,
                12225
            ],
            [
                12226,
                12233
            ],
            [
                12288,
                12300
            ],
            [
                12302,
                12334
            ],
            [
                12384,
                12389
            ],
            [
                12406,
                12489
            ],
            [
                12489,
                12507
            ],
            [
                12552,
                12564
            ],
            [
                12508,
                12510
            ],
            [
                12593,
                12595
            ],
            [
                12595,
                12609
            ],
            [
                12675,
                12878
            ],
            [
                12878,
                12945
            ],
            [
                12945,
                12950
            ],
            [
                12995,
                13047
            ],
            [
                13047,
                13081
            ],
            [
                13107,
                13139
            ],
            [
                13231,
                13280
            ],
            [
                13288,
                13311
            ],
            [
                13311,
                13354
            ],
            [
                13354,
                13388
            ],
            [
                13388,
                13395
            ],
            [
                13436,
                13544
            ],
            [
                13551,
                13553
            ],
            [
                13584,
                13614
            ],
            [
                13614,
                13616
            ],
            [
                13691,
                13693
            ],
            [
                13640,
                13675
            ],
            [
                13704,
                13722
            ],
            [
                13722,
                13770
            ],
            [
                13770,
                13775
            ],
            [
                13780,
                13783
            ],
            [
                13804,
                13917
            ],
            [
                13917,
                13957
            ],
            [
                14091,
                14129
            ],
            [
                14140,
                14148
            ],
            [
                14148,
                14299
            ],
            [
                14312,
                14340
            ],
            [
                14370,
                14380
            ],
            [
                14381,
                14625
            ],
            [
                14687,
                14697
            ],
            [
                14697,
                14821
            ],
            [
                14831,
                14878
            ],
            [
                14878,
                14994
            ],
            [
                14994,
                15047
            ],
            [
                15200,
                15203
            ],
            [
                15209,
                15252
            ],
            [
                15271,
                15297
            ],
            [
                15297,
                15377
            ],
            [
                15385,
                15418
            ],
            [
                15420,
                15447
            ],
            [
                15468,
                15529
            ],
            [
                15529,
                15549
            ],
            [
                15549,
                15651
            ],
            [
                15704,
                15726
            ],
            [
                15726,
                15750
            ],
            [
                15761,
                15812
            ],
            [
                15819,
                15902
            ],
            [
                16211,
                16377
            ],
            [
                16377,
                16473
            ],
            [
                16501,
                16503
            ],
            [
                16503,
                16588
            ],
            [
                16588,
                16672
            ],
            [
                16681,
                16832
            ],
            [
                16834,
                16841
            ],
            [
                16854,
                16997
            ],
            [
                16997,
                17047
            ],
            [
                17056,
                17123
            ],
            [
                17165,
                17177
            ],
            [
                17183,
                17203
            ],
            [
                17217,
                17278
            ],
            [
                17278,
                17331
            ],
            [
                17344,
                17347
            ],
            [
                17333,
                17342
            ],
            [
                17394,
                17396
            ],
            [
                17396,
                17415
            ],
            [
                17421,
                17460
            ],
            [
                17493,
                17495
            ],
            [
                17495,
                17572
            ],
            [
                17587,
                17603
            ],
            [
                17642,
                17652
            ],
            [
                17686,
                17738
            ],
            [
                17738,
                17838
            ],
            [
                17969,
                18008
            ],
            [
                17838,
                17841
            ],
            [
                18014,
                18189
            ],
            [
                18384,
                18553
            ],
            [
                18603,
                18605
            ],
            [
                18605,
                18747
            ],
            [
                18763,
                18767
            ],
            [
                18795,
                18797
            ],
            [
                18797,
                18818
            ],
            [
                18833,
                18882
            ],
            [
                18882,
                18909
            ],
            [
                18917,
                18924
            ],
            [
                18924,
                18998
            ],
            [
                19009,
                19025
            ],
            [
                19070,
                19101
            ],
            [
                19106,
                19221
            ],
            [
                19221,
                19270
            ],
            [
                19381,
                19408
            ],
            [
                19282,
                19307
            ],
            [
                19408,
                19434
            ],
            [
                19434,
                19492
            ],
            [
                19492,
                19493
            ],
            [
                19521,
                19618
            ],
            [
                19619,
                19698
            ],
            [
                19698,
                19701
            ],
            [
                19790,
                19794
            ],
            [
                19775,
                19786
            ],
            [
                19795,
                19854
            ],
            [
                19854,
                19955
            ],
            [
                19955,
                20007
            ],
            [
                20007,
                20029
            ],
            [
                20034,
                20051
            ],
            [
                20051,
                20086
            ],
            [
                20109,
                20110
            ],
            [
                20151,
                20207
            ],
            [
                20211,
                20214
            ],
            [
                20223,
                20225
            ],
            [
                20465,
                20474
            ],
            [
                20484,
                20495
            ],
            [
                20500,
                20563
            ],
            [
                20577,
                20653
            ],
            [
                20667,
                20684
            ],
            [
                20704,
                20706
            ],
            [
                20737,
                20749
            ],
            [
                20797,
                20805
            ],
            [
                20785,
                20796
            ],
            [
                20728,
                20730
            ],
            [
                20710,
                20727
            ],
            [
                20823,
                20824
            ],
            [
                20883,
                20944
            ],
            [
                20992,
                20994
            ],
            [
                20994,
                21025
            ],
            [
                21037,
                21042
            ],
            [
                21058,
                21060
            ],
            [
                21086,
                21098
            ],
            [
                21194,
                21201
            ],
            [
                21115,
                21127
            ],
            [
                21170,
                21175
            ],
            [
                21099,
                21103
            ],
            [
                21176,
                21180
            ],
            [
                21261,
                21282
            ],
            [
                21282,
                21296
            ],
            [
                21390,
                21392
            ],
            [
                21318,
                21328
            ],
            [
                21329,
                21380
            ],
            [
                21385,
                21389
            ],
            [
                21432,
                21433
            ],
            [
                21439,
                21482
            ],
            [
                21494,
                21572
            ],
            [
                21618,
                21621
            ],
            [
                21673,
                21677
            ],
            [
                21677,
                21738
            ],
            [
                21759,
                21877
            ],
            [
                21908,
                21939
            ],
            [
                21939,
                21997
            ],
            [
                22021,
                22053
            ],
            [
                22074,
                22116
            ],
            [
                22128,
                22138
            ],
            [
                22146,
                22162
            ],
            [
                22228,
                22236
            ],
            [
                22320,
                22331
            ],
            [
                22390,
                22401
            ],
            [
                22429,
                22477
            ],
            [
                22479,
                22509
            ],
            [
                22519,
                22526
            ],
            [
                22526,
                22569
            ],
            [
                22588,
                22675
            ],
            [
                22675,
                22686
            ],
            [
                22686,
                22736
            ],
            [
                22786,
                22788
            ],
            [
                22788,
                22827
            ],
            [
                22827,
                22858
            ],
            [
                22884,
                22890
            ],
            [
                22902,
                22948
            ],
            [
                22948,
                23005
            ],
            [
                23046,
                23075
            ],
            [
                23075,
                23123
            ],
            [
                23151,
                23174
            ],
            [
                23174,
                23197
            ],
            [
                23211,
                23214
            ],
            [
                23214,
                23228
            ],
            [
                23228,
                23250
            ],
            [
                23259,
                23370
            ],
            [
                23370,
                23397
            ],
            [
                23397,
                23414
            ],
            [
                23414,
                23452
            ],
            [
                23466,
                23468
            ],
            [
                23468,
                23543
            ],
            [
                23543,
                23554
            ],
            [
                23554,
                23614
            ],
            [
                23614,
                23649
            ],
            [
                23649,
                23660
            ],
            [
                23664,
                23682
            ],
            [
                23682,
                23698
            ],
            [
                23698,
                23717
            ],
            [
                23717,
                23751
            ],
            [
                23751,
                23773
            ],
            [
                23773,
                23788
            ],
            [
                24100,
                24127
            ],
            [
                24127,
                24138
            ],
            [
                24151,
                24183
            ],
            [
                24183,
                24221
            ],
            [
                24222,
                24282
            ],
            [
                24403,
                24405
            ],
            [
                24405,
                24531
            ],
            [
                24531,
                24570
            ],
            [
                24589,
                24645
            ],
            [
                24645,
                24717
            ],
            [
                24749,
                24853
            ],
            [
                24853,
                24928
            ],
            [
                24928,
                25014
            ],
            [
                25039,
                25052
            ],
            [
                25052,
                25128
            ],
            [
                25128,
                25163
            ],
            [
                25165,
                25180
            ],
            [
                25182,
                25244
            ],
            [
                25244,
                25297
            ],
            [
                25301,
                25441
            ],
            [
                25485,
                25500
            ],
            [
                25521,
                25565
            ],
            [
                25567,
                25606
            ],
            [
                25622,
                25651
            ],
            [
                25699,
                25707
            ],
            [
                25717,
                25722
            ],
            [
                25651,
                25652
            ],
            [
                25727,
                25764
            ],
            [
                25820,
                25822
            ],
            [
                25618,
                25621
            ],
            [
                25858,
                25867
            ],
            [
                25765,
                25784
            ],
            [
                25870,
                25871
            ],
            [
                25872,
                25946
            ],
            [
                26001,
                26015
            ],
            [
                26021,
                26045
            ],
            [
                26172,
                26296
            ],
            [
                26296,
                26323
            ],
            [
                26773,
                26778
            ],
            [
                26351,
                26352
            ],
            [
                26401,
                26404
            ],
            [
                26532,
                26569
            ],
            [
                26579,
                26586
            ],
            [
                26596,
                26709
            ],
            [
                26749,
                26758
            ],
            [
                26778,
                26780
            ],
            [
                27028,
                27127
            ],
            [
                27132,
                27133
            ],
            [
                27683,
                27764
            ],
            [
                27775,
                27830
            ],
            [
                27863,
                27966
            ],
            [
                27982,
                27998
            ],
            [
                28606,
                28627
            ],
            [
                28632,
                28635
            ],
            [
                28651,
                28680
            ],
            [
                28681,
                28714
            ],
            [
                28714,
                28768
            ],
            [
                28790,
                28841
            ],
            [
                28944,
                29046
            ],
            [
                28779,
                28783
            ],
            [
                29089,
                29091
            ],
            [
                29091,
                29100
            ],
            [
                29176,
                29180
            ],
            [
                29182,
                29262
            ],
            [
                29262,
                29295
            ],
            [
                29315,
                29364
            ],
            [
                29364,
                29399
            ],
            [
                29471,
                29476
            ],
            [
                29499,
                29578
            ],
            [
                29578,
                29720
            ],
            [
                29790,
                29792
            ],
            [
                29769,
                29771
            ],
            [
                29800,
                29836
            ],
            [
                29836,
                29874
            ],
            [
                30038,
                30084
            ],
            [
                30094,
                30124
            ],
            [
                30149,
                30233
            ],
            [
                30233,
                30267
            ],
            [
                30313,
                30351
            ],
            [
                30356,
                30374
            ],
            [
                30374,
                30442
            ],
            [
                30447,
                30454
            ],
            [
                30560,
                30594
            ],
            [
                30632,
                30704
            ],
            [
                30704,
                30762
            ],
            [
                30983,
                30985
            ],
            [
                30985,
                31022
            ],
            [
                31027,
                31032
            ],
            [
                31070,
                31088
            ],
            [
                31098,
                31149
            ],
            [
                31149,
                31170
            ],
            [
                31196,
                31199
            ],
            [
                31177,
                31185
            ],
            [
                31228,
                31279
            ],
            [
                31279,
                31356
            ],
            [
                31356,
                31378
            ],
            [
                31382,
                31385
            ],
            [
                31385,
                31405
            ],
            [
                31405,
                31424
            ],
            [
                31424,
                31515
            ],
            [
                31515,
                31570
            ],
            [
                31570,
                31610
            ],
            [
                31610,
                31681
            ],
            [
                31710,
                31726
            ],
            [
                31742,
                31747
            ],
            [
                31757,
                31792
            ],
            [
                31792,
                31838
            ],
            [
                31838,
                31900
            ],
            [
                31900,
                31911
            ],
            [
                31911,
                31944
            ],
            [
                31944,
                31948
            ],
            [
                31957,
                31986
            ],
            [
                31986,
                32017
            ],
            [
                32018,
                32096
            ],
            [
                32129,
                32166
            ],
            [
                32174,
                32247
            ],
            [
                32247,
                32289
            ],
            [
                32313,
                32341
            ],
            [
                32349,
                32456
            ],
            [
                32456,
                32497
            ],
            [
                32497,
                32528
            ],
            [
                32528,
                32649
            ],
            [
                32649,
                32670
            ],
            [
                32680,
                32757
            ],
            [
                32849,
                32872
            ],
            [
                32874,
                32897
            ],
            [
                32897,
                32962
            ],
            [
                32962,
                32984
            ],
            [
                32984,
                32998
            ],
            [
                32998,
                32999
            ],
            [
                33006,
                33035
            ],
            [
                33035,
                33047
            ],
            [
                33047,
                33101
            ],
            [
                33101,
                33168
            ],
            [
                33168,
                33225
            ],
            [
                33225,
                33241
            ],
            [
                33268,
                33286
            ],
            [
                33286,
                33306
            ],
            [
                33345,
                33390
            ],
            [
                33442,
                33472
            ],
            [
                33538,
                33587
            ],
            [
                33587,
                33622
            ],
            [
                33634,
                33638
            ],
            [
                33648,
                33651
            ],
            [
                33651,
                33659
            ],
            [
                33659,
                33680
            ],
            [
                33680,
                33775
            ],
            [
                33775,
                33791
            ],
            [
                33872,
                33879
            ],
            [
                33884,
                33897
            ],
            [
                33964,
                33995
            ],
            [
                33995,
                34011
            ],
            [
                34011,
                34026
            ],
            [
                34108,
                34110
            ],
            [
                34187,
                34245
            ],
            [
                34259,
                34288
            ],
            [
                34288,
                34390
            ],
            [
                34390,
                34476
            ],
            [
                34476,
                34500
            ],
            [
                34500,
                34594
            ],
            [
                34594,
                34623
            ],
            [
                34633,
                34648
            ],
            [
                34648,
                34672
            ],
            [
                34679,
                34682
            ],
            [
                34682,
                34699
            ],
            [
                34703,
                34705
            ],
            [
                34705,
                34715
            ],
            [
                34725,
                34745
            ],
            [
                34838,
                34890
            ],
            [
                34895,
                34906
            ],
            [
                34989,
                34991
            ],
            [
                34991,
                35058
            ],
            [
                35077,
                35097
            ],
            [
                35097,
                35103
            ],
            [
                35103,
                35133
            ],
            [
                35186,
                35191
            ],
            [
                35231,
                35242
            ],
            [
                35251,
                35261
            ],
            [
                35261,
                35395
            ]
        ],
        "row_chars": [
            [
                0,
                85
            ],
            [
                85,
                109
            ],
            [
                109,
                426
            ],
            [
                426,
                465
            ],
            [
                465,
                584
            ],
            [
                584,
                753
            ],
            [
                753,
                928
            ],
            [
                928,
                1163
            ],
            [
                1163,
                1189
            ],
            [
                1189,
                1240
            ],
            [
                1240,
                1274
            ],
            [
                1274,
                1489
            ],
            [
                1489,
                1700
            ],
            [
                1700,
                1835
            ],
            [
                1835,
                1951
            ],
            [
                1951,
                2010
            ],
            [
                2010,
                2090
            ],
            [
                2090,
                2214
            ],
            [
                2214,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2337,
                2507
            ],
            [
                2507,
                2661
            ],
            [
                2661,
                2872
            ],
            [
                2872,
                2969
            ],
            [
                2969,
                3032
            ],
            [
                3032,
                3127
            ],
            [
                3127,
                3279
            ],
            [
                3279,
                3324
            ],
            [
                3324,
                3534
            ],
            [
                3534,
                3633
            ],
            [
                3633,
                3646
            ],
            [
                3646,
                3664
            ],
            [
                3664,
                3679
            ],
            [
                3679,
                3779
            ],
            [
                3779,
                3930
            ],
            [
                3930,
                3970
            ],
            [
                3970,
                3984
            ],
            [
                3984,
                4119
            ],
            [
                4119,
                4278
            ],
            [
                4278,
                4300
            ],
            [
                4300,
                4339
            ],
            [
                4339,
                4364
            ],
            [
                4364,
                4421
            ],
            [
                4421,
                4455
            ],
            [
                4455,
                4510
            ],
            [
                4510,
                4536
            ],
            [
                4536,
                4541
            ],
            [
                4541,
                4668
            ],
            [
                4668,
                4804
            ],
            [
                4804,
                4995
            ],
            [
                4995,
                5099
            ],
            [
                5099,
                5105
            ],
            [
                5105,
                5113
            ],
            [
                5113,
                5129
            ],
            [
                5129,
                5171
            ],
            [
                5171,
                5276
            ],
            [
                5276,
                5440
            ],
            [
                5440,
                5481
            ],
            [
                5481,
                5525
            ],
            [
                5525,
                5584
            ],
            [
                5584,
                5605
            ],
            [
                5605,
                5736
            ],
            [
                5736,
                5881
            ],
            [
                5881,
                5942
            ],
            [
                5942,
                6103
            ],
            [
                6103,
                6211
            ],
            [
                6211,
                6233
            ],
            [
                6233,
                6409
            ],
            [
                6409,
                6424
            ],
            [
                6424,
                6440
            ],
            [
                6440,
                6598
            ],
            [
                6598,
                6690
            ],
            [
                6690,
                6711
            ],
            [
                6711,
                6760
            ],
            [
                6760,
                6893
            ],
            [
                6893,
                6963
            ],
            [
                6963,
                6997
            ],
            [
                6997,
                7025
            ],
            [
                7025,
                7204
            ],
            [
                7204,
                7296
            ],
            [
                7296,
                7371
            ],
            [
                7371,
                7386
            ],
            [
                7386,
                7440
            ],
            [
                7440,
                7559
            ],
            [
                7559,
                7736
            ],
            [
                7736,
                7960
            ],
            [
                7960,
                8030
            ],
            [
                8030,
                8268
            ],
            [
                8268,
                8531
            ],
            [
                8531,
                8720
            ],
            [
                8720,
                8793
            ],
            [
                8793,
                8902
            ],
            [
                8902,
                8982
            ],
            [
                8982,
                9102
            ],
            [
                9102,
                9214
            ],
            [
                9214,
                9296
            ],
            [
                9296,
                9447
            ],
            [
                9447,
                9607
            ],
            [
                9607,
                10118
            ],
            [
                10118,
                10197
            ],
            [
                10197,
                10458
            ],
            [
                10458,
                10961
            ],
            [
                10961,
                11276
            ],
            [
                11276,
                11299
            ],
            [
                11299,
                11317
            ],
            [
                11317,
                11322
            ],
            [
                11322,
                11424
            ],
            [
                11424,
                11707
            ],
            [
                11707,
                11746
            ],
            [
                11746,
                11883
            ],
            [
                11883,
                12119
            ],
            [
                12119,
                12236
            ],
            [
                12236,
                12254
            ],
            [
                12254,
                12288
            ],
            [
                12288,
                12489
            ],
            [
                12489,
                12595
            ],
            [
                12595,
                12878
            ],
            [
                12878,
                12945
            ],
            [
                12945,
                12950
            ],
            [
                12950,
                12994
            ],
            [
                12994,
                13047
            ],
            [
                13047,
                13311
            ],
            [
                13311,
                13354
            ],
            [
                13354,
                13388
            ],
            [
                13388,
                13396
            ],
            [
                13396,
                13436
            ],
            [
                13436,
                13614
            ],
            [
                13614,
                13722
            ],
            [
                13722,
                13770
            ],
            [
                13770,
                13917
            ],
            [
                13917,
                14148
            ],
            [
                14148,
                14381
            ],
            [
                14381,
                14697
            ],
            [
                14697,
                14878
            ],
            [
                14878,
                14994
            ],
            [
                14994,
                15297
            ],
            [
                15297,
                15447
            ],
            [
                15447,
                15529
            ],
            [
                15529,
                15549
            ],
            [
                15549,
                15726
            ],
            [
                15726,
                15903
            ],
            [
                15903,
                16211
            ],
            [
                16211,
                16377
            ],
            [
                16377,
                16503
            ],
            [
                16503,
                16588
            ],
            [
                16588,
                16997
            ],
            [
                16997,
                17278
            ],
            [
                17278,
                17396
            ],
            [
                17396,
                17495
            ],
            [
                17495,
                17738
            ],
            [
                17738,
                17838
            ],
            [
                17838,
                18190
            ],
            [
                18190,
                18384
            ],
            [
                18384,
                18605
            ],
            [
                18605,
                18797
            ],
            [
                18797,
                18882
            ],
            [
                18882,
                18924
            ],
            [
                18924,
                19025
            ],
            [
                19025,
                19221
            ],
            [
                19221,
                19434
            ],
            [
                19434,
                19492
            ],
            [
                19492,
                19619
            ],
            [
                19619,
                19698
            ],
            [
                19698,
                19854
            ],
            [
                19854,
                19955
            ],
            [
                19955,
                20007
            ],
            [
                20007,
                20051
            ],
            [
                20051,
                20111
            ],
            [
                20111,
                20151
            ],
            [
                20151,
                20225
            ],
            [
                20225,
                20465
            ],
            [
                20465,
                20706
            ],
            [
                20706,
                20994
            ],
            [
                20994,
                21282
            ],
            [
                21282,
                21677
            ],
            [
                21677,
                21939
            ],
            [
                21939,
                22526
            ],
            [
                22526,
                22675
            ],
            [
                22675,
                22686
            ],
            [
                22686,
                22788
            ],
            [
                22788,
                22827
            ],
            [
                22827,
                22860
            ],
            [
                22860,
                22948
            ],
            [
                22948,
                23005
            ],
            [
                23005,
                23046
            ],
            [
                23046,
                23075
            ],
            [
                23075,
                23174
            ],
            [
                23174,
                23214
            ],
            [
                23214,
                23228
            ],
            [
                23228,
                23370
            ],
            [
                23370,
                23397
            ],
            [
                23397,
                23414
            ],
            [
                23414,
                23468
            ],
            [
                23468,
                23543
            ],
            [
                23543,
                23554
            ],
            [
                23554,
                23614
            ],
            [
                23614,
                23649
            ],
            [
                23649,
                23664
            ],
            [
                23664,
                23682
            ],
            [
                23682,
                23698
            ],
            [
                23698,
                23717
            ],
            [
                23717,
                23751
            ],
            [
                23751,
                23773
            ],
            [
                23773,
                23792
            ],
            [
                23792,
                23957
            ],
            [
                23957,
                23980
            ],
            [
                23980,
                24066
            ],
            [
                24066,
                24100
            ],
            [
                24100,
                24127
            ],
            [
                24127,
                24183
            ],
            [
                24183,
                24222
            ],
            [
                24222,
                24405
            ],
            [
                24405,
                24531
            ],
            [
                24531,
                24645
            ],
            [
                24645,
                24853
            ],
            [
                24853,
                24928
            ],
            [
                24928,
                25052
            ],
            [
                25052,
                25128
            ],
            [
                25128,
                25244
            ],
            [
                25244,
                25607
            ],
            [
                25607,
                25872
            ],
            [
                25872,
                26045
            ],
            [
                26045,
                26296
            ],
            [
                26296,
                26780
            ],
            [
                26780,
                27028
            ],
            [
                27028,
                27134
            ],
            [
                27134,
                27390
            ],
            [
                27390,
                27575
            ],
            [
                27575,
                27683
            ],
            [
                27683,
                27999
            ],
            [
                27999,
                28204
            ],
            [
                28204,
                28498
            ],
            [
                28498,
                28606
            ],
            [
                28606,
                28714
            ],
            [
                28714,
                28768
            ],
            [
                28768,
                29091
            ],
            [
                29091,
                29262
            ],
            [
                29262,
                29364
            ],
            [
                29364,
                29578
            ],
            [
                29578,
                29836
            ],
            [
                29836,
                30233
            ],
            [
                30233,
                30374
            ],
            [
                30374,
                30704
            ],
            [
                30704,
                30985
            ],
            [
                30985,
                31149
            ],
            [
                31149,
                31279
            ],
            [
                31279,
                31356
            ],
            [
                31356,
                31385
            ],
            [
                31385,
                31405
            ],
            [
                31405,
                31424
            ],
            [
                31424,
                31515
            ],
            [
                31515,
                31570
            ],
            [
                31570,
                31610
            ],
            [
                31610,
                31728
            ],
            [
                31728,
                31742
            ],
            [
                31742,
                31792
            ],
            [
                31792,
                31838
            ],
            [
                31838,
                31900
            ],
            [
                31900,
                31911
            ],
            [
                31911,
                31944
            ],
            [
                31944,
                31986
            ],
            [
                31986,
                32096
            ],
            [
                32096,
                32129
            ],
            [
                32129,
                32247
            ],
            [
                32247,
                32290
            ],
            [
                32290,
                32313
            ],
            [
                32313,
                32456
            ],
            [
                32456,
                32497
            ],
            [
                32497,
                32528
            ],
            [
                32528,
                32649
            ],
            [
                32649,
                32671
            ],
            [
                32671,
                32680
            ],
            [
                32680,
                32757
            ],
            [
                32757,
                32897
            ],
            [
                32897,
                32962
            ],
            [
                32962,
                32984
            ],
            [
                32984,
                32998
            ],
            [
                32998,
                33035
            ],
            [
                33035,
                33047
            ],
            [
                33047,
                33101
            ],
            [
                33101,
                33168
            ],
            [
                33168,
                33225
            ],
            [
                33225,
                33286
            ],
            [
                33286,
                33308
            ],
            [
                33308,
                33345
            ],
            [
                33345,
                33472
            ],
            [
                33472,
                33587
            ],
            [
                33587,
                33651
            ],
            [
                33651,
                33659
            ],
            [
                33659,
                33680
            ],
            [
                33680,
                33775
            ],
            [
                33775,
                33794
            ],
            [
                33794,
                33871
            ],
            [
                33871,
                33995
            ],
            [
                33995,
                34011
            ],
            [
                34011,
                34110
            ],
            [
                34110,
                34187
            ],
            [
                34187,
                34288
            ],
            [
                34288,
                34390
            ],
            [
                34390,
                34476
            ],
            [
                34476,
                34500
            ],
            [
                34500,
                34594
            ],
            [
                34594,
                34623
            ],
            [
                34623,
                34633
            ],
            [
                34633,
                34648
            ],
            [
                34648,
                34682
            ],
            [
                34682,
                34705
            ],
            [
                34705,
                34745
            ],
            [
                34745,
                34800
            ],
            [
                34800,
                34991
            ],
            [
                34991,
                35097
            ],
            [
                35097,
                35103
            ],
            [
                35103,
                35261
            ],
            [
                35261,
                35395
            ]
        ]
    },
    "abridged": {
        "text": "Richard had been gone away some time when a visitor came to pass a few days with us. It was an elderly lady: Mrs. Woodcourt, who, having come from Wales to stay with Mrs. Bayham Badger, had been invited by my guardian to make a visit to Bleak House. She stayed with us nearly three weeks. She took very kindly to me and was extremely confidential, so much so that sometimes she almost made me uncomfortable. I felt it was unreasonable of me; still, I could not help it.\nShe was such a sharp little lady and used to sit with her hands folded, looking so very watchful while she talked that perhaps I found that rather irksome. I don't think it was her being so upright and trim, nor the expression of her face, which was very sparkling and pretty for an old lady. I don't know what it was. Or at least if I do now, I did not then. Or at least - but it doesn't matter.\nWhen I was going upstairs to bed, she would invite me into her room, where she sat before the fire in a great chair; and, dear me, she would tell me about Morgan ap-Kerrig until I was quite low-spirited! Sometimes she recited a few verses from Crumlinwallinwer and the Mewlinnwillinwodd (though I dare say these are not the right names), and would become quite fiery with the sentiments they expressed. Though I never knew what they were, being in Welsh.\n\"So, Miss Summerson,\" she would say to me with stately triumph, \"this, you see, is the fortune inherited by my son. Wherever my son goes, he can claim kindred with Ap-Kerrig. He may not have money, but he has family, my dear.\"\nI had my doubts of their caring for Morgan ap-Kerrig in India and China, but of course I never expressed them. I used to say it was a great thing to be so highly connected.\n\"It is, my dear, a great thing,\" Mrs. Woodcourt would reply. \"My son's choice of a wife is limited by it, but the royal family is limited in much the same manner.\"\nThen she would pat me on the arm. \"His father, my dear,\" she would say with some emotion, for she had a very affectionate heart, \"was descended from a great Highland family, the MacCoorts of MacCoort. He served his king and country as an officer in the Royal Highlanders, and he died on the field. My son is one of the last representatives of two old families. With the blessing of heaven he will unite them with another old family.\"\nIt was in vain for me to try to change the subject. Mrs. Woodcourt never would let me.\n\"My dear,\" she said one night, \"you have so much sense for your age that it is a comfort to me to talk to you about these family matters of mine. You don't know much of my son, my dear; but you recollect him?\"\n\"Yes, ma'am. I recollect him.\"\n\"Now, my dear, I think you are a judge of character, and I should like to have your opinion of him.\"\n\"Oh, Mrs. Woodcourt,\" said I, \"it is so difficult to give an opinion-\"\n\"On so slight an acquaintance, my dear. That's true.\"\nI didn't mean that, because Mr. Woodcourt had been at our house a good deal and had become quite intimate with my guardian. I said so, and added that he seemed to be very clever in his profession - we thought - and that his kindness and gentleness to Miss Flite were above all praise.\n\"You do him justice!\" said Mrs. Woodcourt, pressing my hand. \"Allan is a dear fellow, and in his profession faultless. Still, I must confess he is not without faults.\"\n\"None of us are,\" said I.\n\"Ah! But his really are faults that he ought to correct,\" returned the sharp old lady. \"I am so much attached to you that I may confide in you, my dear, that he is fickleness itself. He is always paying trivial attentions to young ladies, and has been since he was eighteen. Now, my dear, he has never really cared for any of them and has never meant to express anything but good nature. Still, it's not right, you know; is it?\"\n\"No,\" said I, as she seemed to wait for me.\n\"And it might lead to mistaken notions, you see, my dear.\"\nI supposed it might.\n\"I have told him many times that he really should be more careful. And he has always said, 'Mother, I will be; but you know I mean no harm - in short, mean nothing.' Which is very true, my dear, but is no justification. However, as he is now gone so far away, and as he will have good opportunities and introductions, we may consider this past and gone. And you, my dear,\" said the old lady, all nods and smiles, \"regarding your dear self, my love?\"\n\"Me, Mrs. Woodcourt?\"\n\"Not to be always selfish, talking of my son, who has gone to seek his fortune and to find a wife - when do you mean to seek your fortune and to find a husband, Miss Summerson? Now you blush!\"\nI don't think I did blush. I said my present fortune perfectly contented me and I had no wish to change it.\n\"Shall I tell you what I always think of your future, my love?\" said Mrs. Woodcourt.\n\"If you believe you are a good prophet,\" said I.\n\"Why, then, it is that you will marry some one very rich and very worthy, much older - five and twenty years, perhaps - than yourself. And you will be an excellent wife, and much beloved, and very happy.\"\n\"That is a good fortune,\" said I. \"But why is it to be mine?\"\n\"My dear,\" she returned, \"you are so busy, and so neat, and so peculiarly situated that it is suitable, and it will come to pass. And nobody, my love, will congratulate you more sincerely on such a marriage than I shall.\"\nIt was curious that this should make me uncomfortable, but it did. I was so ashamed of my folly that I did not like to confess it even to Ada. I would have given anything not to have been so much in the bright old lady's confidence; it gave me the most inconsistent opinions of her. At one time I thought she was a story-teller, and next moment I believed her honest Welsh heart to be perfectly innocent and simple.\nAnd after all, why did it matter to me? Why did I trouble myself about the harmless things she said? I was certainly very anxious that she should like me and was very glad that she did, but why should I harp afterwards, with distress and pain, on every word she said and weigh it over and over again in twenty scales? These were perplexities that I could not account for. At least, if I could - but I shall come to all that by and by.\nSo when Mrs. Woodcourt went away, I was sorry to lose her but relieved too. And then Caddy Jellyby came down with a packet of domestic news.\nFirst Caddy declared that I was the best adviser that ever was known. Then she told us that she was going to be married in a month and that if Ada and I would be her bridesmaids, she was the happiest girl in the world. To be sure, this was news indeed.\nIt seemed that Caddy's unfortunate papa had got over his bankruptcy and had given up everything he possessed (which was not worth much, I should think, to judge from the state of the furniture), and had satisfied his creditors that he could do no more, poor man. So he had been honourably dismissed to \"the office\" to begin the world again. What he did at the office, I never knew; Caddy said he was a custom-house and general agent.\nThey had moved to a furnished lodging in Hatton Garden (where I found the children, when I afterwards went there, cutting the horse hair out of the chair seats and choking themselves with it). Caddy had brought about a meeting between him and old Mr. Turveydrop; and poor Mr. Jellyby, being very humble and meek, had deferred to Mr. Turveydrop's deportment so submissively that they had become excellent friends. By degrees, old Mr. Turveydrop had worked up his parental feelings to contemplating his son's marriage and had given his gracious consent to the young couple setting up house at the academy in Newman Street.\n\"And your papa, Caddy. What did he say?\"\n\"Oh! Poor Pa,\" said Caddy, \"only cried and said he hoped we might get on better than he and Ma had got on. He didn't say it before Prince, but he said to me, 'My poor girl, you have not been very well taught how to make a home for your husband, but unless you mean with all your heart to strive to do it, you had better murder him than marry him - if you really love him.'\"\n\"And how did you reassure him, Caddy?\"\n\"Why, it was very distressing, you know, to see poor Pa so low and hear him say such terrible things. But I told him that I did mean it with all my heart and that I hoped our house would be a place for him to come and find some comfort and that I hoped I could be a better daughter to him there than at home. Then I mentioned Peepy's coming to stay with me, and Pa began to cry again and said the children were wild Indians. And Pa said\" - here she began to sob, poor girl - \"that the best thing that could happen to them was their being all tomahawked together.\"\nAda suggested that he did not mean it.\n\"No, of course not,\" said Caddy, \"but he means that they are very unfortunate in being Ma's children and that he is very unfortunate in being Ma's husband; and I am sure that's true, though it seems unnatural to say so.\"\nI asked Caddy if Mrs. Jellyby knew that her wedding-day was fixed.\n\"Oh! It's impossible to say whether she knows it or not. She has been told it often enough; but she only gives me a placid look, and then she shakes her head and says 'Oh, Caddy, what a tease you are!' and goes on with the Borrioboola letters.\"\n\"And about your wardrobe, Caddy?\" said I.\n\"Well, my dear Esther,\" she returned, drying her eyes, \"I must do the best I can and trust to my dear Prince not to mind my coming so shabbily to him. If it was an outfit for Borrioboola, Ma would be quite excited. Being what it is, she neither knows nor cares.\"\nCaddy did not lack natural affection for her mother, but mentioned this with tears as an undeniable fact, which I am afraid it was. We were sorry for the poor dear girl and proposed a little scheme that made her joyful. This was her staying with us for three weeks, my staying with her for one, and our all three contriving and cutting out, and repairing, and sewing, and doing the very best we could with her stock.\nMy guardian being as pleased with the idea as Caddy was, we took her home next day to arrange the matter and brought her out again in triumph with her boxes and all the purchases that could be squeezed out of a ten-pound note, which Mr. Jellyby gave her. What my guardian would not have given her if we had encouraged him, it would be difficult to say, but we thought it right to ask for no more than her wedding-dress and bonnet. He agreed to this compromise, and if Caddy had ever been happy in her life, she was happy when we sat down to work.\nShe was clumsy enough with her needle, poor girl, and vexed at being able to do no better, but she soon began to improve rapidly. So day after day she, and my darling, and my little maid Charley, and a milliner from the town, and I, sat hard at work as pleasantly as possible.\nCaddy was very anxious \"to learn housekeeping,\" as she said. Now, mercy upon us! The idea of her learning housekeeping of a person of my vast experience was such a joke that I laughed when she proposed it. However, I said, \"Caddy, you are very welcome to learn anything that you can of me, my dear,\" and I showed her all my books and methods and all my fidgety ways.\nSo what with working and housekeeping, and lessons to Charley, and backgammon in the evening with my guardian, and duets with Ada, the three weeks slipped fast away. Then I went home with Caddy to see what could be done there, and Ada and Charley remained behind.\nWhen I say I went home with Caddy, I mean to the furnished lodging in Hatton Garden. We went to Newman Street two or three times, where preparations were in progress too - many, I observed, for enhancing the comforts of old Mr. Turveydrop, and a few for putting the newly married couple away cheaply at the top of the house. But our aim was to make the furnished lodging decent for the wedding-breakfast and to imbue Mrs. Jellyby beforehand with some faint sense of the occasion.\nThe latter was the more difficult thing of the two. Mrs. Jellyby and an unwholesome boy occupied the front sitting-room, which was littered with waste-paper and documents, as an untidy stable might be littered with straw. Mrs. Jellyby sat there all day drinking strong coffee and dictating. The unwholesome boy seemed to me to be going into a decline. When Mr. Jellyby came home, he usually groaned and went down into the kitchen to get something to eat, and then went out and walked about Hatton Garden in the wet. The poor children scrambled up and tumbled down the house as they had always been accustomed to do.\nI proposed to Caddy that we should make the children as happy as we could on her marriage morning in the attic where they all slept, and should confine our greatest efforts to her mama and her mama's room, and a clean breakfast.\nThinking that the display of Caddy's wardrobe would be the best means of approaching the subject, I invited Mrs. Jellyby to come and look at it spread out on Caddy's bed.\n\"My dear Miss Summerson,\" said she, rising from her desk with her usual sweetness of temper, \"these are really ridiculous preparations, though you are kind to assist them. There is something so absurd to me in the idea of Caddy being married! Oh, Caddy, you silly, silly puss!\"\nShe came upstairs with us notwithstanding and looked at the clothes in her far-off manner. She said with her placid smile, shaking her head, \"My good Miss Summerson, at half the cost, this weak child might have been equipped for Africa!\"\nOn our going downstairs again, Mrs. Jellyby asked, \"Will my room be required for this troublesome business, my dear Miss Summerson? For it's quite impossible that I can put my papers away.\"\nI said that the room would certainly be wanted and that I thought we must put the papers away somewhere.\n\"Well, my dear Miss Summerson,\" said Mrs. Jellyby, \"you know best, I dare say. But I am so overwhelmed with public business, that I don't know which way to turn. We have a Ramification meeting, too, on Wednesday afternoon, and the inconvenience is very serious.\"\n\"It is not likely to occur again,\" said I, smiling. \"Caddy will be married only once, probably.\"\n\"That's true,\" Mrs. Jellyby replied.\nThe next question was how Mrs. Jellyby should be dressed for the wedding. The state of her dresses, and the extraordinary confusion in which she kept them, added to our difficulty; but at length we devised something not very unlike what a commonplace mother might wear. Mrs. Jellyby tried on this attire in an abstracted manner, observing how sorry she was that I had not turned my thoughts to Africa.\nThe lodging was rather confined, but if it had been the size of Saint Paul's it would only have afforded more room to be dirty in. I believe that none of the family possessions which it had been possible to break was unbroken at this time, nothing which it had been possible to spoil was unspoilt, and that no domestic object which was capable of collecting dirt was free of it.\nPoor Mr. Jellyby, who very seldom spoke and almost always sat with his head against the wall, became interested when he saw that Caddy and I were attempting to establish some order, and took off his coat to help. But such wonderful things came tumbling out of the closets - bits of mouldy pie, sour bottles, letters, tea, forks, odd boots and shoes, firewood, saucepan-lids, brushes, candle ends, nutshells, dinner-mats, gloves, coffee-grounds, umbrellas - that he looked frightened, and stopped again. But he came regularly every evening and sat with his head against the wall, as though he would have helped us if he had known how.\n\"Poor Pa!\" said Caddy to me on the night before the great day. \"It seems unkind to leave him, Esther. But what could I do if I stayed? I have tidied over and over again, but it's useless. Ma and Africa, together, upset the whole house directly. Ma's ruinous to everything.\"\nMr. Jellyby could not hear what she said, but he shed tears, I thought.\n\"My heart aches for him!\" sobbed Caddy. \"I can't help thinking, Esther, how dearly I hope to be happy with Prince, and how dearly Pa hoped, I dare say, to be happy with Ma. What a disappointed life!\"\n\"My dear Caddy!\" said Mr. Jellyby, looking slowly round. It was the first time, I think, I ever heard him say three words together.\n\"Yes, Pa!\" cried Caddy, going to him and embracing him affectionately.\n\"My dear Caddy,\" said Mr. Jellyby. \"Never have-\"\n\"Not Prince, Pa?\" faltered Caddy. \"Not have Prince?\"\n\"Yes, my dear,\" said Mr. Jellyby. \"Have him, certainly. But, never have-\"\n\"Don't have what, dear Pa?\" asked Caddy, with her arms round his neck.\n\"Never have a mission, my dear child.\" Mr. Jellyby groaned and laid his head against the wall again. I suppose he had been more talkative and lively once, but he seemed to have been completely exhausted long before I knew him.\nI thought Mrs. Jellyby never would have stopped looking over her papers and drinking coffee that night. It was twelve o'clock before we could obtain possession of the room, and its state was so discouraging that Caddy, who was almost tired out, sat down in the middle of the dust and cried. But she soon cheered up, and we did wonders with it before we went to bed.\nIn the morning it looked, by the aid of a few flowers and a quantity of soap and water, quite gay. The plain breakfast made a cheerful show, and Caddy was perfectly charming. But when my darling came, I thought - and I think now - that I never had seen such a dear face as my beautiful pet's.\nWe made a little feast for the children upstairs, and put Peepy at the head of the table, and we showed them Caddy in her bridal dress, and they clapped their hands and hurrahed, and Caddy cried and hugged them until we brought Prince up to fetch her away - when, I am sorry to say, Peepy bit him.\nOld Mr. Turveydrop downstairs benignly blessed Caddy, giving my guardian to understand that he was making sacrifices to ensure his son's happiness.\n\"My dear sir,\" said Mr. Turveydrop, \"these young people will live with me; they shall not lack the shelter of my roof. I could have wished that my son had married into a family where there was more deportment, but the will of heaven be done!\"\nMr. and Mrs. Pardiggle were there, and Mr. Quale, with his hair brushed back and his temples shining very much, was also there, not in the character of a disappointed lover, but as the accepted of a Miss Wisk. The guests were few, but were, as one might expect at Mrs. Jellyby's, all devoted to public objects.\nSuch a mean mission as the domestic mission was the very last thing to be endured by such a group; indeed, Miss Wisk informed us, with great indignation, that the idea of woman's mission lying chiefly in the narrow sphere of home was an outrageous slander by her tyrant, man.\nBut I am anticipating the conversation on the ride home, instead of first marrying Caddy. We all went to church, and Mr. Jellyby gave her away. Old Mr. Turveydrop, with his hat under his left arm, stood stiff and high-shouldered behind us bridesmaids during the ceremony, and afterwards saluted us with inexpressible deportment. Miss Wisk grimly listened to the proceedings, as part of woman's wrongs, with a disdainful face. Mrs. Jellyby, with her calm smile, looked the least concerned of all the company.\nWe duly came back to breakfast, and Caddy stole upstairs to hug the children again and tell them that her name was Turveydrop. But this piece of information, instead of being an agreeable surprise to Peepy, threw him on his back in such transports of kicking grief that he had to be admitted to the breakfast table. So he came down and sat in my lap; and was very good except that he brought down Noah (out of an ark I had given him) and would dip him head first into the wine-glasses and then put him in his mouth.\nMy guardian, with his sweet temper, made something agreeable even out of this ungenial company. None of them seemed able to talk about anything but his, or her, own subject; but my guardian turned it all to the honour of the occasion, and brought us through the breakfast nobly. What we should have done without him, I am afraid to think.\nAt last the time came when poor Caddy had to go on the hired coach that was to take her and her husband to Gravesend. It affected us to see her clinging on her mother's neck with the greatest tenderness.\n\"I am very sorry I couldn't go on writing from dictation, Ma,\" sobbed Caddy. \"I hope you forgive me.\"\n\"Oh, Caddy, Caddy!\" said Mrs. Jellyby. \"I have told you over and over again that I have engaged a boy, and there's an end of it.\"\n\"You are sure you are not the least angry with me, Ma? Say you are sure before I go away, Ma?\"\n\"You foolish Caddy,\" returned Mrs. Jellyby, \"do I look angry, or have I time to be angry?\"\n\"Take care of Pa while I am gone, Mama!\"\nMrs. Jellyby positively laughed at the fancy. \"You romantic child,\" said she, lightly patting Caddy's back. \"Go along. I am excellent friends with you. Now, goodbye, Caddy, and be very happy!\"\nThen Caddy hung upon her father in the hall and nursed his cheek against hers as if he were some poor dull child in pain. Her father released her, took out his handkerchief, and sat down on the stairs with his head against the wall. I hope he found some consolation in walls.\nAnd then Prince took her arm and turned with great emotion and respect to his father, whose deportment at that moment was overwhelming.\n\"Thank you over and over again, father!\" said Prince, kissing his hand. \"I am very grateful for all your kindness and consideration regarding our marriage, and so, I can assure you, is Caddy.\"\n\"Very,\" sobbed Caddy.\n\"My dear son,\" said Mr. Turveydrop, \"and dear daughter, I have done my duty. Your constant affection will be my recompense. You will not fail in your duty, my son and daughter, I believe?\"\n\"Dear father, never!\" cried Prince.\n\"Never, dear Mr. Turveydrop!\" said Caddy.\n\"This,\" returned Mr. Turveydrop, \"is as it should be. My children, my home is yours, my heart is yours, my all is yours. I will never leave you; nothing but death shall part us. My dear son, you are absent for a week, I think?\"\n\"A week, dear father.\"\n\"My dear child,\" said Mr. Turveydrop, \"let me recommend strict punctuality. Schools, if at all neglected, are apt to take offence.\"\n\"This day week, father, we shall be home.\"\n\"Good!\" said Mr. Turveydrop. \"You will find fires, my dear Caroline, in your own room, and dinner prepared in my apartment. Yes, yes, Prince! You and Caroline will dine that day in my apartment. Now, bless ye!\"\nThey drove away. But before we drove away too, I received a most unexpected compliment from Mr. Jellyby. He came up to me in the hall, took both my hands, pressed them earnestly, and opened his mouth twice. I was so sure of his meaning that I said, quite flurried, \"You are very welcome, sir. Pray don't mention it!\"\n\"I hope this marriage is for the best, guardian,\" said I when we three were on our road home.\n\"I hope it is, little woman. We shall see.\"\n\"Is the wind in the east today?\" I ventured to ask.\nHe laughed and answered, \"No.\"\nMy dear girl confidently answered \"No\" too and shook her lovely head. \"Much you know of east winds, my ugly darling,\" said I, kissing her - I couldn't help it.\nWell! It was only their love for me, but to write it gives me pleasure. They said there could be no east wind where Somebody was; they said that wherever Dame Durden went, there was sunshine and summer air.",
        "paragraph_chars": [
            [
                0,
                470
            ],
            [
                470,
                867
            ],
            [
                867,
                1322
            ],
            [
                1322,
                1549
            ],
            [
                1549,
                1722
            ],
            [
                1722,
                1886
            ],
            [
                1886,
                2320
            ],
            [
                2320,
                2407
            ],
            [
                2407,
                2617
            ],
            [
                2617,
                2648
            ],
            [
                2648,
                2749
            ],
            [
                2749,
                2820
            ],
            [
                2820,
                2874
            ],
            [
                2874,
                3159
            ],
            [
                3159,
                3327
            ],
            [
                3327,
                3353
            ],
            [
                3353,
                3782
            ],
            [
                3782,
                3826
            ],
            [
                3826,
                3885
            ],
            [
                3885,
                3906
            ],
            [
                3906,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4571
            ],
            [
                4571,
                4679
            ],
            [
                4679,
                4764
            ],
            [
                4764,
                4813
            ],
            [
                4813,
                5018
            ],
            [
                5018,
                5080
            ],
            [
                5080,
                5302
            ],
            [
                5302,
                5718
            ],
            [
                5718,
                6153
            ],
            [
                6153,
                6294
            ],
            [
                6294,
                6547
            ],
            [
                6547,
                6981
            ],
            [
                6981,
                7602
            ],
            [
                7602,
                7643
            ],
            [
                7643,
                8017
            ],
            [
                8017,
                8056
            ],
            [
                8056,
                8620
            ],
            [
                8620,
                8659
            ],
            [
                8659,
                8880
            ],
            [
                8880,
                8947
            ],
            [
                8947,
                9192
            ],
            [
                9192,
                9234
            ],
            [
                9234,
                9497
            ],
            [
                9497,
                9914
            ],
            [
                9914,
                10461
            ],
            [
                10461,
                10738
            ],
            [
                10738,
                11105
            ],
            [
                11105,
                11369
            ],
            [
                11369,
                11849
            ],
            [
                11849,
                12465
            ],
            [
                12465,
                12694
            ],
            [
                12694,
                12865
            ],
            [
                12865,
                13143
            ],
            [
                13143,
                13381
            ],
            [
                13381,
                13571
            ],
            [
                13571,
                13676
            ],
            [
                13676,
                13939
            ],
            [
                13939,
                14036
            ],
            [
                14036,
                14073
            ],
            [
                14073,
                14475
            ],
            [
                14475,
                14854
            ],
            [
                14854,
                15488
            ],
            [
                15488,
                15762
            ],
            [
                15762,
                15834
            ],
            [
                15834,
                16034
            ],
            [
                16034,
                16166
            ],
            [
                16166,
                16237
            ],
            [
                16237,
                16286
            ],
            [
                16286,
                16339
            ],
            [
                16339,
                16413
            ],
            [
                16413,
                16484
            ],
            [
                16484,
                16711
            ],
            [
                16711,
                17077
            ],
            [
                17077,
                17370
            ],
            [
                17370,
                17668
            ],
            [
                17668,
                17816
            ],
            [
                17816,
                18059
            ],
            [
                18059,
                18370
            ],
            [
                18370,
                18646
            ],
            [
                18646,
                19154
            ],
            [
                19154,
                19670
            ],
            [
                19670,
                20009
            ],
            [
                20009,
                20213
            ],
            [
                20213,
                20315
            ],
            [
                20315,
                20445
            ],
            [
                20445,
                20540
            ],
            [
                20540,
                20631
            ],
            [
                20631,
                20672
            ],
            [
                20672,
                20865
            ],
            [
                20865,
                21141
            ],
            [
                21141,
                21277
            ],
            [
                21277,
                21470
            ],
            [
                21470,
                21492
            ],
            [
                21492,
                21681
            ],
            [
                21681,
                21717
            ],
            [
                21717,
                21759
            ],
            [
                21759,
                21987
            ],
            [
                21987,
                22010
            ],
            [
                22010,
                22142
            ],
            [
                22142,
                22185
            ],
            [
                22185,
                22396
            ],
            [
                22396,
                22713
            ],
            [
                22713,
                22807
            ],
            [
                22807,
                22851
            ],
            [
                22851,
                22903
            ],
            [
                22903,
                22934
            ],
            [
                22934,
                23094
            ],
            [
                23094,
                23300
            ]
        ],
        "segment_chars": [
            [
                0,
                85
            ],
            [
                85,
                250
            ],
            [
                250,
                289
            ],
            [
                289,
                408
            ],
            [
                408,
                470
            ],
            [
                470,
                626
            ],
            [
                626,
                763
            ],
            [
                763,
                789
            ],
            [
                789,
                830
            ],
            [
                830,
                867
            ],
            [
                867,
                1071
            ],
            [
                1071,
                1270
            ],
            [
                1270,
                1322
            ],
            [
                1322,
                1438
            ],
            [
                1438,
                1497
            ],
            [
                1497,
                1549
            ],
            [
                1549,
                1660
            ],
            [
                1660,
                1722
            ],
            [
                1722,
                1783
            ],
            [
                1783,
                1886
            ],
            [
                1886,
                1920
            ],
            [
                1920,
                2087
            ],
            [
                2087,
                2184
            ],
            [
                2184,
                2247
            ],
            [
                2247,
                2320
            ],
            [
                2320,
                2372
            ],
            [
                2372,
                2407
            ],
            [
                2407,
                2553
            ],
            [
                2553,
                2617
            ],
            [
                2617,
                2630
            ],
            [
                2630,
                2648
            ],
            [
                2648,
                2749
            ],
            [
                2749,
                2820
            ],
            [
                2820,
                2860
            ],
            [
                2860,
                2874
            ],
            [
                2874,
                2998
            ],
            [
                2998,
                3159
            ],
            [
                3159,
                3181
            ],
            [
                3181,
                3220
            ],
            [
                3220,
                3278
            ],
            [
                3278,
                3327
            ],
            [
                3327,
                3353
            ],
            [
                3353,
                3358
            ],
            [
                3358,
                3440
            ],
            [
                3440,
                3536
            ],
            [
                3536,
                3628
            ],
            [
                3628,
                3741
            ],
            [
                3741,
                3782
            ],
            [
                3782,
                3826
            ],
            [
                3826,
                3885
            ],
            [
                3885,
                3906
            ],
            [
                3906,
                3973
            ],
            [
                3973,
                4072
            ],
            [
                4072,
                4126
            ],
            [
                4126,
                4260
            ],
            [
                4260,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4555
            ],
            [
                4555,
                4571
            ],
            [
                4571,
                4598
            ],
            [
                4598,
                4679
            ],
            [
                4679,
                4743
            ],
            [
                4743,
                4764
            ],
            [
                4764,
                4813
            ],
            [
                4813,
                4948
            ],
            [
                4948,
                5018
            ],
            [
                5018,
                5052
            ],
            [
                5052,
                5080
            ],
            [
                5080,
                5210
            ],
            [
                5210,
                5302
            ],
            [
                5302,
                5369
            ],
            [
                5369,
                5445
            ],
            [
                5445,
                5585
            ],
            [
                5585,
                5718
            ],
            [
                5718,
                5758
            ],
            [
                5758,
                5819
            ],
            [
                5819,
                6036
            ],
            [
                6036,
                6090
            ],
            [
                6090,
                6153
            ],
            [
                6153,
                6229
            ],
            [
                6229,
                6294
            ],
            [
                6294,
                6364
            ],
            [
                6364,
                6513
            ],
            [
                6513,
                6547
            ],
            [
                6547,
                6810
            ],
            [
                6810,
                6888
            ],
            [
                6888,
                6981
            ],
            [
                6981,
                7174
            ],
            [
                7174,
                7394
            ],
            [
                7394,
                7602
            ],
            [
                7602,
                7625
            ],
            [
                7625,
                7643
            ],
            [
                7643,
                7648
            ],
            [
                7648,
                7750
            ],
            [
                7750,
                8017
            ],
            [
                8017,
                8056
            ],
            [
                8056,
                8158
            ],
            [
                8158,
                8365
            ],
            [
                8365,
                8481
            ],
            [
                8481,
                8620
            ],
            [
                8620,
                8659
            ],
            [
                8659,
                8880
            ],
            [
                8880,
                8947
            ],
            [
                8947,
                8952
            ],
            [
                8952,
                9004
            ],
            [
                9004,
                9149
            ],
            [
                9149,
                9192
            ],
            [
                9192,
                9226
            ],
            [
                9226,
                9234
            ],
            [
                9234,
                9385
            ],
            [
                9385,
                9449
            ],
            [
                9449,
                9497
            ],
            [
                9497,
                9629
            ],
            [
                9629,
                9717
            ],
            [
                9717,
                9914
            ],
            [
                9914,
                10169
            ],
            [
                10169,
                10345
            ],
            [
                10345,
                10461
            ],
            [
                10461,
                10591
            ],
            [
                10591,
                10738
            ],
            [
                10738,
                10799
            ],
            [
                10799,
                10819
            ],
            [
                10819,
                10944
            ],
            [
                10944,
                11105
            ],
            [
                11105,
                11271
            ],
            [
                11271,
                11369
            ],
            [
                11369,
                11454
            ],
            [
                11454,
                11694
            ],
            [
                11694,
                11849
            ],
            [
                11849,
                11901
            ],
            [
                11901,
                12071
            ],
            [
                12071,
                12140
            ],
            [
                12140,
                12201
            ],
            [
                12201,
                12365
            ],
            [
                12365,
                12465
            ],
            [
                12465,
                12694
            ],
            [
                12694,
                12865
            ],
            [
                12865,
                13037
            ],
            [
                13037,
                13108
            ],
            [
                13108,
                13143
            ],
            [
                13143,
                13234
            ],
            [
                13234,
                13381
            ],
            [
                13381,
                13513
            ],
            [
                13513,
                13571
            ],
            [
                13571,
                13676
            ],
            [
                13676,
                13755
            ],
            [
                13755,
                13838
            ],
            [
                13838,
                13939
            ],
            [
                13939,
                13991
            ],
            [
                13991,
                14036
            ],
            [
                14036,
                14073
            ],
            [
                14073,
                14147
            ],
            [
                14147,
                14343
            ],
            [
                14343,
                14475
            ],
            [
                14475,
                14606
            ],
            [
                14606,
                14854
            ],
            [
                14854,
                15067
            ],
            [
                15067,
                15357
            ],
            [
                15357,
                15488
            ],
            [
                15488,
                15499
            ],
            [
                15499,
                15551
            ],
            [
                15551,
                15590
            ],
            [
                15590,
                15623
            ],
            [
                15623,
                15676
            ],
            [
                15676,
                15733
            ],
            [
                15733,
                15762
            ],
            [
                15762,
                15834
            ],
            [
                15834,
                15860
            ],
            [
                15860,
                15874
            ],
            [
                15874,
                16007
            ],
            [
                16007,
                16034
            ],
            [
                16034,
                16051
            ],
            [
                16051,
                16091
            ],
            [
                16091,
                16166
            ],
            [
                16166,
                16177
            ],
            [
                16177,
                16237
            ],
            [
                16237,
                16272
            ],
            [
                16272,
                16286
            ],
            [
                16286,
                16304
            ],
            [
                16304,
                16320
            ],
            [
                16320,
                16339
            ],
            [
                16339,
                16373
            ],
            [
                16373,
                16395
            ],
            [
                16395,
                16413
            ],
            [
                16413,
                16441
            ],
            [
                16441,
                16484
            ],
            [
                16484,
                16523
            ],
            [
                16523,
                16585
            ],
            [
                16585,
                16711
            ],
            [
                16711,
                16815
            ],
            [
                16815,
                17002
            ],
            [
                17002,
                17077
            ],
            [
                17077,
                17176
            ],
            [
                17176,
                17252
            ],
            [
                17252,
                17370
            ],
            [
                17370,
                17668
            ],
            [
                17668,
                17816
            ],
            [
                17816,
                17935
            ],
            [
                17935,
                18059
            ],
            [
                18059,
                18269
            ],
            [
                18269,
                18370
            ],
            [
                18370,
                18646
            ],
            [
                18646,
                18736
            ],
            [
                18736,
                18790
            ],
            [
                18790,
                18975
            ],
            [
                18975,
                19072
            ],
            [
                19072,
                19154
            ],
            [
                19154,
                19281
            ],
            [
                19281,
                19470
            ],
            [
                19470,
                19670
            ],
            [
                19670,
                19766
            ],
            [
                19766,
                19949
            ],
            [
                19949,
                20009
            ],
            [
                20009,
                20127
            ],
            [
                20127,
                20213
            ],
            [
                20213,
                20290
            ],
            [
                20290,
                20315
            ],
            [
                20315,
                20335
            ],
            [
                20335,
                20354
            ],
            [
                20354,
                20445
            ],
            [
                20445,
                20500
            ],
            [
                20500,
                20540
            ],
            [
                20540,
                20631
            ],
            [
                20631,
                20672
            ],
            [
                20672,
                20718
            ],
            [
                20718,
                20780
            ],
            [
                20780,
                20791
            ],
            [
                20791,
                20824
            ],
            [
                20824,
                20865
            ],
            [
                20865,
                20987
            ],
            [
                20987,
                21098
            ],
            [
                21098,
                21141
            ],
            [
                21141,
                21277
            ],
            [
                21277,
                21318
            ],
            [
                21318,
                21349
            ],
            [
                21349,
                21470
            ],
            [
                21470,
                21492
            ],
            [
                21492,
                21569
            ],
            [
                21569,
                21616
            ],
            [
                21616,
                21681
            ],
            [
                21681,
                21703
            ],
            [
                21703,
                21717
            ],
            [
                21717,
                21747
            ],
            [
                21747,
                21759
            ],
            [
                21759,
                21813
            ],
            [
                21813,
                21880
            ],
            [
                21880,
                21937
            ],
            [
                21937,
                21987
            ],
            [
                21987,
                22010
            ],
            [
                22010,
                22086
            ],
            [
                22086,
                22142
            ],
            [
                22142,
                22185
            ],
            [
                22185,
                22193
            ],
            [
                22193,
                22214
            ],
            [
                22214,
                22309
            ],
            [
                22309,
                22327
            ],
            [
                22327,
                22380
            ],
            [
                22380,
                22396
            ],
            [
                22396,
                22413
            ],
            [
                22413,
                22501
            ],
            [
                22501,
                22603
            ],
            [
                22603,
                22689
            ],
            [
                22689,
                22713
            ],
            [
                22713,
                22807
            ],
            [
                22807,
                22836
            ],
            [
                22836,
                22851
            ],
            [
                22851,
                22884
            ],
            [
                22884,
                22903
            ],
            [
                22903,
                22934
            ],
            [
                22934,
                23004
            ],
            [
                23004,
                23094
            ],
            [
                23094,
                23100
            ],
            [
                23100,
                23166
            ],
            [
                23166,
                23300
            ]
        ],
        "overlap_chars": [
            [
                0,
                85
            ],
            [
                85,
                91
            ],
            [
                92,
                94
            ],
            [
                109,
                184
            ],
            [
                184,
                185
            ],
            [
                186,
                250
            ],
            [
                250,
                289
            ],
            [
                289,
                408
            ],
            [
                408,
                434
            ],
            [
                438,
                440
            ],
            [
                440,
                447
            ],
            [
                447,
                460
            ],
            [
                461,
                470
            ],
            [
                470,
                540
            ],
            [
                542,
                583
            ],
            [
                584,
                626
            ],
            [
                626,
                639
            ],
            [
                640,
                677
            ],
            [
                678,
                681
            ],
            [
                682,
                685
            ],
            [
                686,
                763
            ],
            [
                763,
                789
            ],
            [
                789,
                815
            ],
            [
                816,
                830
            ],
            [
                830,
                841
            ],
            [
                844,
                850
            ],
            [
                856,
                867
            ],
            [
                867,
                1071
            ],
            [
                1071,
                1155
            ],
            [
                1162,
                1172
            ],
            [
                1179,
                1186
            ],
            [
                1187,
                1202
            ],
            [
                1202,
                1270
            ],
            [
                1270,
                1304
            ],
            [
                1306,
                1320
            ],
            [
                1320,
                1322
            ],
            [
                1322,
                1438
            ],
            [
                1438,
                1497
            ],
            [
                1497,
                1526
            ],
            [
                1527,
                1530
            ],
            [
                1531,
                1549
            ],
            [
                1549,
                1580
            ],
            [
                1581,
                1660
            ],
            [
                1660,
                1722
            ],
            [
                1722,
                1783
            ],
            [
                1783,
                1784
            ],
            [
                1784,
                1809
            ],
            [
                1810,
                1831
            ],
            [
                1832,
                1886
            ],
            [
                1886,
                1918
            ],
            [
                1918,
                1919
            ],
            [
                1920,
                1921
            ],
            [
                1931,
                1956
            ],
            [
                1957,
                1979
            ],
            [
                1980,
                2087
            ],
            [
                2087,
                2184
            ],
            [
                2184,
                2247
            ],
            [
                2247,
                2282
            ],
            [
                2283,
                2320
            ],
            [
                2320,
                2370
            ],
            [
                2370,
                2372
            ],
            [
                2372,
                2405
            ],
            [
                2405,
                2407
            ],
            [
                2407,
                2461
            ],
            [
                2466,
                2470
            ],
            [
                2475,
                2553
            ],
            [
                2553,
                2600
            ],
            [
                2601,
                2617
            ],
            [
                2617,
                2630
            ],
            [
                2630,
                2648
            ],
            [
                2649,
                2749
            ],
            [
                2749,
                2780
            ],
            [
                2780,
                2782
            ],
            [
                2783,
                2798
            ],
            [
                2799,
                2817
            ],
            [
                2820,
                2860
            ],
            [
                2860,
                2874
            ],
            [
                2874,
                2949
            ],
            [
                2950,
                2998
            ],
            [
                2998,
                3069
            ],
            [
                3072,
                3082
            ],
            [
                3085,
                3159
            ],
            [
                3159,
                3181
            ],
            [
                3181,
                3220
            ],
            [
                3221,
                3278
            ],
            [
                3278,
                3324
            ],
            [
                3324,
                3327
            ],
            [
                3327,
                3353
            ],
            [
                3353,
                3358
            ],
            [
                3358,
                3391
            ],
            [
                3392,
                3438
            ],
            [
                3438,
                3440
            ],
            [
                3440,
                3505
            ],
            [
                3506,
                3534
            ],
            [
                3536,
                3595
            ],
            [
                3596,
                3604
            ],
            [
                3605,
                3628
            ],
            [
                3628,
                3675
            ],
            [
                3676,
                3703
            ],
            [
                3704,
                3727
            ],
            [
                3728,
                3741
            ],
            [
                3741,
                3782
            ],
            [
                3782,
                3826
            ],
            [
                3826,
                3885
            ],
            [
                3885,
                3906
            ],
            [
                3906,
                3907
            ],
            [
                3907,
                3971
            ],
            [
                3971,
                3973
            ],
            [
                3973,
                4029
            ],
            [
                4030,
                4044
            ],
            [
                4047,
                4072
            ],
            [
                4072,
                4126
            ],
            [
                4126,
                4164
            ],
            [
                4164,
                4260
            ],
            [
                4260,
                4297
            ],
            [
                4298,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4475
            ],
            [
                4478,
                4555
            ],
            [
                4555,
                4571
            ],
            [
                4571,
                4596
            ],
            [
                4598,
                4679
            ],
            [
                4679,
                4719
            ],
            [
                4731,
                4743
            ],
            [
                4743,
                4764
            ],
            [
                4764,
                4813
            ],
            [
                4813,
                4897
            ],
            [
                4900,
                4930
            ],
            [
                4933,
                4948
            ],
            [
                4948,
                5018
            ],
            [
                5018,
                5052
            ],
            [
                5052,
                5080
            ],
            [
                5080,
                5106
            ],
            [
                5106,
                5162
            ],
            [
                5163,
                5167
            ],
            [
                5168,
                5170
            ],
            [
                5182,
                5210
            ],
            [
                5210,
                5302
            ],
            [
                5302,
                5360
            ],
            [
                5361,
                5369
            ],
            [
                5369,
                5443
            ],
            [
                5443,
                5445
            ],
            [
                5445,
                5533
            ],
            [
                5535,
                5585
            ],
            [
                5585,
                5634
            ],
            [
                5635,
                5717
            ],
            [
                5718,
                5732
            ],
            [
                5733,
                5758
            ],
            [
                5758,
                5761
            ],
            [
                5766,
                5767
            ],
            [
                5768,
                5817
            ],
            [
                5817,
                5819
            ],
            [
                5819,
                5824
            ],
            [
                5825,
                5834
            ],
            [
                5835,
                5889
            ],
            [
                5890,
                5903
            ],
            [
                5908,
                5942
            ],
            [
                5943,
                6036
            ],
            [
                6036,
                6059
            ],
            [
                6060,
                6090
            ],
            [
                6090,
                6110
            ],
            [
                6113,
                6151
            ],
            [
                6151,
                6153
            ],
            [
                6153,
                6214
            ],
            [
                6215,
                6229
            ],
            [
                6229,
                6261
            ],
            [
                6267,
                6292
            ],
            [
                6292,
                6294
            ],
            [
                6294,
                6314
            ],
            [
                6315,
                6364
            ],
            [
                6364,
                6368
            ],
            [
                6373,
                6513
            ],
            [
                6513,
                6545
            ],
            [
                6545,
                6547
            ],
            [
                6547,
                6614
            ],
            [
                6615,
                6759
            ],
            [
                6760,
                6773
            ],
            [
                6774,
                6810
            ],
            [
                6810,
                6812
            ],
            [
                6813,
                6888
            ],
            [
                6888,
                6948
            ],
            [
                6949,
                6979
            ],
            [
                6979,
                6981
            ],
            [
                6981,
                6989
            ],
            [
                6996,
                7128
            ],
            [
                7135,
                7140
            ],
            [
                7141,
                7171
            ],
            [
                7174,
                7394
            ],
            [
                7394,
                7424
            ],
            [
                7425,
                7463
            ],
            [
                7464,
                7477
            ],
            [
                7478,
                7496
            ],
            [
                7497,
                7551
            ],
            [
                7563,
                7568
            ],
            [
                7569,
                7600
            ],
            [
                7600,
                7602
            ],
            [
                7602,
                7625
            ],
            [
                7625,
                7643
            ],
            [
                7643,
                7648
            ],
            [
                7648,
                7750
            ],
            [
                7750,
                7763
            ],
            [
                7767,
                7781
            ],
            [
                7786,
                7793
            ],
            [
                7794,
                7799
            ],
            [
                7799,
                7988
            ],
            [
                7991,
                8017
            ],
            [
                8017,
                8056
            ],
            [
                8056,
                8156
            ],
            [
                8156,
                8158
            ],
            [
                8158,
                8291
            ],
            [
                8292,
                8308
            ],
            [
                8309,
                8365
            ],
            [
                8365,
                8417
            ],
            [
                8418,
                8466
            ],
            [
                8472,
                8479
            ],
            [
                8481,
                8493
            ],
            [
                8496,
                8528
            ],
            [
                8531,
                8536
            ],
            [
                8537,
                8620
            ],
            [
                8620,
                8638
            ],
            [
                8642,
                8654
            ],
            [
                8655,
                8657
            ],
            [
                8657,
                8659
            ],
            [
                8659,
                8673
            ],
            [
                8677,
                8880
            ],
            [
                8880,
                8947
            ],
            [
                8947,
                8952
            ],
            [
                8952,
                9004
            ],
            [
                9004,
                9038
            ],
            [
                9043,
                9075
            ],
            [
                9076,
                9125
            ],
            [
                9126,
                9149
            ],
            [
                9149,
                9192
            ],
            [
                9192,
                9226
            ],
            [
                9226,
                9233
            ],
            [
                9234,
                9342
            ],
            [
                9347,
                9349
            ],
            [
                9355,
                9385
            ],
            [
                9385,
                9387
            ],
            [
                9388,
                9390
            ],
            [
                9395,
                9430
            ],
            [
                9431,
                9449
            ],
            [
                9449,
                9497
            ],
            [
                9497,
                9502
            ],
            [
                9507,
                9510
            ],
            [
                9516,
                9629
            ],
            [
                9629,
                9669
            ],
            [
                9670,
                9708
            ],
            [
                9709,
                9717
            ],
            [
                9717,
                9868
            ],
            [
                9869,
                9897
            ],
            [
                9903,
                9913
            ],
            [
                9914,
                10158
            ],
            [
                10159,
                10169
            ],
            [
                10169,
                10293
            ],
            [
                10298,
                10345
            ],
            [
                10345,
                10461
            ],
            [
                10461,
                10514
            ],
            [
                10515,
                10518
            ],
            [
                10521,
                10564
            ],
            [
                10565,
                10591
            ],
            [
                10591,
                10671
            ],
            [
                10677,
                10710
            ],
            [
                10711,
                10738
            ],
            [
                10738,
                10799
            ],
            [
                10799,
                10819
            ],
            [
                10819,
                10921
            ],
            [
                10922,
                10944
            ],
            [
                10944,
                10968
            ],
            [
                10969,
                11020
            ],
            [
                11021,
                11104
            ],
            [
                11105,
                11271
            ],
            [
                11271,
                11367
            ],
            [
                11367,
                11369
            ],
            [
                11369,
                11454
            ],
            [
                11454,
                11538
            ],
            [
                11541,
                11692
            ],
            [
                11694,
                11701
            ],
            [
                11706,
                11849
            ],
            [
                11849,
                11899
            ],
            [
                11901,
                11968
            ],
            [
                11976,
                11988
            ],
            [
                11989,
                12009
            ],
            [
                12010,
                12071
            ],
            [
                12071,
                12124
            ],
            [
                12125,
                12128
            ],
            [
                12129,
                12138
            ],
            [
                12138,
                12140
            ],
            [
                12140,
                12159
            ],
            [
                12160,
                12199
            ],
            [
                12199,
                12201
            ],
            [
                12201,
                12278
            ],
            [
                12286,
                12302
            ],
            [
                12302,
                12312
            ],
            [
                12313,
                12365
            ],
            [
                12365,
                12465
            ],
            [
                12465,
                12504
            ],
            [
                12505,
                12508
            ],
            [
                12518,
                12693
            ],
            [
                12694,
                12863
            ],
            [
                12863,
                12865
            ],
            [
                12865,
                13007
            ],
            [
                13031,
                13035
            ],
            [
                13035,
                13037
            ],
            [
                13037,
                13058
            ],
            [
                13059,
                13108
            ],
            [
                13108,
                13135
            ],
            [
                13136,
                13143
            ],
            [
                13143,
                13217
            ],
            [
                13218,
                13234
            ],
            [
                13234,
                13265
            ],
            [
                13266,
                13381
            ],
            [
                13381,
                13430
            ],
            [
                13430,
                13457
            ],
            [
                13462,
                13487
            ],
            [
                13487,
                13513
            ],
            [
                13513,
                13571
            ],
            [
                13571,
                13572
            ],
            [
                13578,
                13675
            ],
            [
                13676,
                13755
            ],
            [
                13755,
                13758
            ],
            [
                13759,
                13763
            ],
            [
                13767,
                13778
            ],
            [
                13779,
                13838
            ],
            [
                13838,
                13939
            ],
            [
                13939,
                13991
            ],
            [
                13991,
                14013
            ],
            [
                14019,
                14036
            ],
            [
                14036,
                14071
            ],
            [
                14071,
                14072
            ],
            [
                14073,
                14129
            ],
            [
                14134,
                14137
            ],
            [
                14145,
                14147
            ],
            [
                14147,
                14156
            ],
            [
                14160,
                14171
            ],
            [
                14171,
                14234
            ],
            [
                14235,
                14311
            ],
            [
                14324,
                14341
            ],
            [
                14341,
                14343
            ],
            [
                14343,
                14355
            ],
            [
                14356,
                14364
            ],
            [
                14365,
                14376
            ],
            [
                14377,
                14379
            ],
            [
                14383,
                14400
            ],
            [
                14400,
                14401
            ],
            [
                14412,
                14473
            ],
            [
                14473,
                14475
            ],
            [
                14475,
                14506
            ],
            [
                14506,
                14511
            ],
            [
                14512,
                14514
            ],
            [
                14518,
                14530
            ],
            [
                14531,
                14538
            ],
            [
                14539,
                14551
            ],
            [
                14555,
                14560
            ],
            [
                14561,
                14565
            ],
            [
                14566,
                14570
            ],
            [
                14585,
                14606
            ],
            [
                14606,
                14620
            ],
            [
                14626,
                14628
            ],
            [
                14629,
                14639
            ],
            [
                14652,
                14703
            ],
            [
                14709,
                14713
            ],
            [
                14713,
                14714
            ],
            [
                14715,
                14758
            ],
            [
                14759,
                14837
            ],
            [
                14838,
                14841
            ],
            [
                14850,
                14854
            ],
            [
                14854,
                14915
            ],
            [
                14916,
                15034
            ],
            [
                15036,
                15067
            ],
            [
                15067,
                15125
            ],
            [
                15128,
                15160
            ],
            [
                15160,
                15202
            ],
            [
                15202,
                15212
            ],
            [
                15212,
                15228
            ],
            [
                15229,
                15237
            ],
            [
                15238,
                15249
            ],
            [
                15249,
                15260
            ],
            [
                15260,
                15308
            ],
            [
                15311,
                15341
            ],
            [
                15350,
                15357
            ],
            [
                15357,
                15400
            ],
            [
                15401,
                15488
            ],
            [
                15488,
                15499
            ],
            [
                15499,
                15549
            ],
            [
                15549,
                15551
            ],
            [
                15551,
                15590
            ],
            [
                15590,
                15621
            ],
            [
                15623,
                15629
            ],
            [
                15630,
                15676
            ],
            [
                15676,
                15733
            ],
            [
                15733,
                15762
            ],
            [
                15762,
                15810
            ],
            [
                15811,
                15834
            ],
            [
                15834,
                15857
            ],
            [
                15857,
                15860
            ],
            [
                15860,
                15874
            ],
            [
                15874,
                15896
            ],
            [
                15896,
                16007
            ],
            [
                16007,
                16034
            ],
            [
                16034,
                16051
            ],
            [
                16051,
                16089
            ],
            [
                16089,
                16091
            ],
            [
                16091,
                16166
            ],
            [
                16166,
                16177
            ],
            [
                16177,
                16237
            ],
            [
                16237,
                16272
            ],
            [
                16272,
                16283
            ],
            [
                16286,
                16304
            ],
            [
                16304,
                16320
            ],
            [
                16320,
                16339
            ],
            [
                16339,
                16373
            ],
            [
                16373,
                16395
            ],
            [
                16395,
                16410
            ],
            [
                16414,
                16441
            ],
            [
                16441,
                16452
            ],
            [
                16452,
                16484
            ],
            [
                16484,
                16522
            ],
            [
                16523,
                16583
            ],
            [
                16583,
                16585
            ],
            [
                16585,
                16711
            ],
            [
                16711,
                16750
            ],
            [
                16759,
                16815
            ],
            [
                16815,
                16887
            ],
            [
                16898,
                17002
            ],
            [
                17002,
                17077
            ],
            [
                17077,
                17163
            ],
            [
                17163,
                17176
            ],
            [
                17176,
                17252
            ],
            [
                17252,
                17287
            ],
            [
                17290,
                17305
            ],
            [
                17308,
                17370
            ],
            [
                17370,
                17423
            ],
            [
                17424,
                17564
            ],
            [
                17565,
                17580
            ],
            [
                17581,
                17625
            ],
            [
                17628,
                17667
            ],
            [
                17668,
                17697
            ],
            [
                17698,
                17706
            ],
            [
                17715,
                17720
            ],
            [
                17720,
                17721
            ],
            [
                17722,
                17759
            ],
            [
                17760,
                17762
            ],
            [
                17763,
                17766
            ],
            [
                17785,
                17794
            ],
            [
                17795,
                17814
            ],
            [
                17814,
                17815
            ],
            [
                17816,
                17890
            ],
            [
                17891,
                17905
            ],
            [
                17911,
                17935
            ],
            [
                17935,
                18059
            ],
            [
                18059,
                18086
            ],
            [
                18087,
                18092
            ],
            [
                18092,
                18093
            ],
            [
                18094,
                18097
            ],
            [
                18098,
                18135
            ],
            [
                18136,
                18143
            ],
            [
                18144,
                18257
            ],
            [
                18258,
                18267
            ],
            [
                18267,
                18269
            ],
            [
                18269,
                18368
            ],
            [
                18368,
                18369
            ],
            [
                18370,
                18451
            ],
            [
                18467,
                18522
            ],
            [
                18522,
                18625
            ],
            [
                18629,
                18645
            ],
            [
                18646,
                18667
            ],
            [
                18668,
                18671
            ],
            [
                18672,
                18701
            ],
            [
                18703,
                18736
            ],
            [
                18736,
                18790
            ],
            [
                18790,
                18841
            ],
            [
                18841,
                18943
            ],
            [
                18944,
                18948
            ],
            [
                18973,
                18975
            ],
            [
                18975,
                18984
            ],
            [
                18985,
                18989
            ],
            [
                18992,
                19072
            ],
            [
                19072,
                19105
            ],
            [
                19105,
                19154
            ],
            [
                19154,
                19189
            ],
            [
                19190,
                19195
            ],
            [
                19202,
                19281
            ],
            [
                19281,
                19423
            ],
            [
                19424,
                19426
            ],
            [
                19431,
                19433
            ],
            [
                19434,
                19470
            ],
            [
                19470,
                19508
            ],
            [
                19509,
                19555
            ],
            [
                19556,
                19586
            ],
            [
                19586,
                19670
            ],
            [
                19670,
                19704
            ],
            [
                19704,
                19742
            ],
            [
                19748,
                19766
            ],
            [
                19766,
                19834
            ],
            [
                19835,
                19842
            ],
            [
                19842,
                19876
            ],
            [
                19877,
                19949
            ],
            [
                19949,
                20007
            ],
            [
                20007,
                20009
            ],
            [
                20009,
                20046
            ],
            [
                20051,
                20056
            ],
            [
                20057,
                20075
            ],
            [
                20076,
                20127
            ],
            [
                20127,
                20148
            ],
            [
                20149,
                20152
            ],
            [
                20153,
                20161
            ],
            [
                20162,
                20213
            ],
            [
                20213,
                20290
            ],
            [
                20290,
                20312
            ],
            [
                20312,
                20315
            ],
            [
                20315,
                20335
            ],
            [
                20335,
                20354
            ],
            [
                20354,
                20445
            ],
            [
                20445,
                20500
            ],
            [
                20500,
                20540
            ],
            [
                20540,
                20611
            ],
            [
                20612,
                20628
            ],
            [
                20631,
                20636
            ],
            [
                20637,
                20672
            ],
            [
                20672,
                20718
            ],
            [
                20718,
                20780
            ],
            [
                20780,
                20791
            ],
            [
                20791,
                20824
            ],
            [
                20824,
                20828
            ],
            [
                20836,
                20865
            ],
            [
                20865,
                20896
            ],
            [
                20909,
                20987
            ],
            [
                20987,
                21024
            ],
            [
                21025,
                21098
            ],
            [
                21098,
                21140
            ],
            [
                21141,
                21169
            ],
            [
                21170,
                21277
            ],
            [
                21277,
                21318
            ],
            [
                21318,
                21349
            ],
            [
                21349,
                21470
            ],
            [
                21470,
                21491
            ],
            [
                21492,
                21569
            ],
            [
                21569,
                21592
            ],
            [
                21593,
                21616
            ],
            [
                21616,
                21681
            ],
            [
                21681,
                21703
            ],
            [
                21703,
                21717
            ],
            [
                21717,
                21718
            ],
            [
                21718,
                21747
            ],
            [
                21747,
                21759
            ],
            [
                21759,
                21813
            ],
            [
                21813,
                21880
            ],
            [
                21880,
                21937
            ],
            [
                21937,
                21953
            ],
            [
                21969,
                21987
            ],
            [
                21987,
                22007
            ],
            [
                22010,
                22055
            ],
            [
                22056,
                22086
            ],
            [
                22093,
                22142
            ],
            [
                22142,
                22177
            ],
            [
                22178,
                22182
            ],
            [
                22182,
                22185
            ],
            [
                22185,
                22193
            ],
            [
                22193,
                22214
            ],
            [
                22214,
                22309
            ],
            [
                22309,
                22325
            ],
            [
                22327,
                22334
            ],
            [
                22335,
                22348
            ],
            [
                22349,
                22380
            ],
            [
                22380,
                22396
            ],
            [
                22396,
                22411
            ],
            [
                22411,
                22413
            ],
            [
                22413,
                22471
            ],
            [
                22472,
                22501
            ],
            [
                22501,
                22603
            ],
            [
                22603,
                22689
            ],
            [
                22689,
                22713
            ],
            [
                22713,
                22807
            ],
            [
                22807,
                22836
            ],
            [
                22836,
                22851
            ],
            [
                22851,
                22875
            ],
            [
                22881,
                22884
            ],
            [
                22884,
                22901
            ],
            [
                22901,
                22903
            ],
            [
                22903,
                22913
            ],
            [
                22914,
                22934
            ],
            [
                22934,
                22986
            ],
            [
                22991,
                23002
            ],
            [
                23002,
                23004
            ],
            [
                23004,
                23071
            ],
            [
                23074,
                23094
            ],
            [
                23094,
                23100
            ],
            [
                23100,
                23130
            ],
            [
                23138,
                23143
            ],
            [
                23144,
                23155
            ],
            [
                23156,
                23166
            ],
            [
                23166,
                23300
            ]
        ],
        "row_chars": [
            [
                0,
                85
            ],
            [
                85,
                85
            ],
            [
                85,
                250
            ],
            [
                250,
                289
            ],
            [
                289,
                408
            ],
            [
                408,
                470
            ],
            [
                470,
                626
            ],
            [
                626,
                763
            ],
            [
                763,
                789
            ],
            [
                789,
                830
            ],
            [
                830,
                867
            ],
            [
                867,
                1071
            ],
            [
                1071,
                1270
            ],
            [
                1270,
                1322
            ],
            [
                1322,
                1438
            ],
            [
                1438,
                1497
            ],
            [
                1497,
                1549
            ],
            [
                1549,
                1660
            ],
            [
                1660,
                1722
            ],
            [
                1722,
                1783
            ],
            [
                1783,
                1886
            ],
            [
                1886,
                1920
            ],
            [
                1920,
                2087
            ],
            [
                2087,
                2184
            ],
            [
                2184,
                2247
            ],
            [
                2247,
                2320
            ],
            [
                2320,
                2372
            ],
            [
                2372,
                2407
            ],
            [
                2407,
                2553
            ],
            [
                2553,
                2617
            ],
            [
                2617,
                2630
            ],
            [
                2630,
                2648
            ],
            [
                2648,
                2648
            ],
            [
                2648,
                2749
            ],
            [
                2749,
                2820
            ],
            [
                2820,
                2860
            ],
            [
                2860,
                2874
            ],
            [
                2874,
                2998
            ],
            [
                2998,
                3159
            ],
            [
                3159,
                3181
            ],
            [
                3181,
                3220
            ],
            [
                3220,
                3220
            ],
            [
                3220,
                3278
            ],
            [
                3278,
                3278
            ],
            [
                3278,
                3327
            ],
            [
                3327,
                3353
            ],
            [
                3353,
                3358
            ],
            [
                3358,
                3440
            ],
            [
                3440,
                3536
            ],
            [
                3536,
                3536
            ],
            [
                3536,
                3536
            ],
            [
                3536,
                3536
            ],
            [
                3536,
                3536
            ],
            [
                3536,
                3536
            ],
            [
                3536,
                3536
            ],
            [
                3536,
                3628
            ],
            [
                3628,
                3741
            ],
            [
                3741,
                3782
            ],
            [
                3782,
                3826
            ],
            [
                3826,
                3885
            ],
            [
                3885,
                3906
            ],
            [
                3906,
                3973
            ],
            [
                3973,
                4072
            ],
            [
                4072,
                4126
            ],
            [
                4126,
                4260
            ],
            [
                4260,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4555
            ],
            [
                4555,
                4555
            ],
            [
                4555,
                4571
            ],
            [
                4571,
                4679
            ],
            [
                4679,
                4743
            ],
            [
                4743,
                4764
            ],
            [
                4764,
                4813
            ],
            [
                4813,
                4948
            ],
            [
                4948,
                5018
            ],
            [
                5018,
                5052
            ],
            [
                5052,
                5080
            ],
            [
                5080,
                5210
            ],
            [
                5210,
                5302
            ],
            [
                5302,
                5369
            ],
            [
                5369,
                5369
            ],
            [
                5369,
                5369
            ],
            [
                5369,
                5445
            ],
            [
                5445,
                5585
            ],
            [
                5585,
                5718
            ],
            [
                5718,
                5758
            ],
            [
                5758,
                5819
            ],
            [
                5819,
                6036
            ],
            [
                6036,
                6036
            ],
            [
                6036,
                6090
            ],
            [
                6090,
                6153
            ],
            [
                6153,
                6229
            ],
            [
                6229,
                6294
            ],
            [
                6294,
                6364
            ],
            [
                6364,
                6364
            ],
            [
                6364,
                6513
            ],
            [
                6513,
                6547
            ],
            [
                6547,
                6810
            ],
            [
                6810,
                6888
            ],
            [
                6888,
                6981
            ],
            [
                6981,
                7394
            ],
            [
                7394,
                7602
            ],
            [
                7602,
                7625
            ],
            [
                7625,
                7643
            ],
            [
                7643,
                7648
            ],
            [
                7648,
                7750
            ],
            [
                7750,
                8017
            ],
            [
                8017,
                8056
            ],
            [
                8056,
                8158
            ],
            [
                8158,
                8365
            ],
            [
                8365,
                8481
            ],
            [
                8481,
                8481
            ],
            [
                8481,
                8481
            ],
            [
                8481,
                8620
            ],
            [
                8620,
                8659
            ],
            [
                8659,
                8880
            ],
            [
                8880,
                8947
            ],
            [
                8947,
                8952
            ],
            [
                8952,
                8952
            ],
            [
                8952,
                9004
            ],
            [
                9004,
                9149
            ],
            [
                9149,
                9192
            ],
            [
                9192,
                9226
            ],
            [
                9226,
                9234
            ],
            [
                9234,
                9234
            ],
            [
                9234,
                9385
            ],
            [
                9385,
                9449
            ],
            [
                9449,
                9497
            ],
            [
                9497,
                9629
            ],
            [
                9629,
                9717
            ],
            [
                9717,
                9914
            ],
            [
                9914,
                10169
            ],
            [
                10169,
                10345
            ],
            [
                10345,
                10461
            ],
            [
                10461,
                10591
            ],
            [
                10591,
                10738
            ],
            [
                10738,
                10799
            ],
            [
                10799,
                10819
            ],
            [
                10819,
                10944
            ],
            [
                10944,
                11105
            ],
            [
                11105,
                11105
            ],
            [
                11105,
                11271
            ],
            [
                11271,
                11369
            ],
            [
                11369,
                11454
            ],
            [
                11454,
                11849
            ],
            [
                11849,
                12071
            ],
            [
                12071,
                12140
            ],
            [
                12140,
                12201
            ],
            [
                12201,
                12365
            ],
            [
                12365,
                12465
            ],
            [
                12465,
                12694
            ],
            [
                12694,
                12694
            ],
            [
                12694,
                12865
            ],
            [
                12865,
                13037
            ],
            [
                13037,
                13108
            ],
            [
                13108,
                13143
            ],
            [
                13143,
                13234
            ],
            [
                13234,
                13381
            ],
            [
                13381,
                13513
            ],
            [
                13513,
                13571
            ],
            [
                13571,
                13676
            ],
            [
                13676,
                13755
            ],
            [
                13755,
                13838
            ],
            [
                13838,
                13939
            ],
            [
                13939,
                13991
            ],
            [
                13991,
                14036
            ],
            [
                14036,
                14073
            ],
            [
                14073,
                14073
            ],
            [
                14073,
                14147
            ],
            [
                14147,
                14147
            ],
            [
                14147,
                14343
            ],
            [
                14343,
                14475
            ],
            [
                14475,
                14606
            ],
            [
                14606,
                14854
            ],
            [
                14854,
                15067
            ],
            [
                15067,
                15357
            ],
            [
                15357,
                15488
            ],
            [
                15488,
                15499
            ],
            [
                15499,
                15551
            ],
            [
                15551,
                15590
            ],
            [
                15590,
                15623
            ],
            [
                15623,
                15676
            ],
            [
                15676,
                15733
            ],
            [
                15733,
                15733
            ],
            [
                15733,
                15762
            ],
            [
                15762,
                15834
            ],
            [
                15834,
                15860
            ],
            [
                15860,
                15874
            ],
            [
                15874,
                16007
            ],
            [
                16007,
                16034
            ],
            [
                16034,
                16051
            ],
            [
                16051,
                16091
            ],
            [
                16091,
                16166
            ],
            [
                16166,
                16177
            ],
            [
                16177,
                16237
            ],
            [
                16237,
                16272
            ],
            [
                16272,
                16286
            ],
            [
                16286,
                16304
            ],
            [
                16304,
                16320
            ],
            [
                16320,
                16339
            ],
            [
                16339,
                16373
            ],
            [
                16373,
                16395
            ],
            [
                16395,
                16413
            ],
            [
                16413,
                16413
            ],
            [
                16413,
                16413
            ],
            [
                16413,
                16413
            ],
            [
                16413,
                16413
            ],
            [
                16413,
                16441
            ],
            [
                16441,
                16484
            ],
            [
                16484,
                16523
            ],
            [
                16523,
                16585
            ],
            [
                16585,
                16711
            ],
            [
                16711,
                16815
            ],
            [
                16815,
                17002
            ],
            [
                17002,
                17077
            ],
            [
                17077,
                17176
            ],
            [
                17176,
                17252
            ],
            [
                17252,
                17370
            ],
            [
                17370,
                17668
            ],
            [
                17668,
                17816
            ],
            [
                17816,
                17935
            ],
            [
                17935,
                18059
            ],
            [
                18059,
                18269
            ],
            [
                18269,
                18269
            ],
            [
                18269,
                18370
            ],
            [
                18370,
                18370
            ],
            [
                18370,
                18370
            ],
            [
                18370,
                18370
            ],
            [
                18370,
                18646
            ],
            [
                18646,
                18646
            ],
            [
                18646,
                18646
            ],
            [
                18646,
                18646
            ],
            [
                18646,
                18736
            ],
            [
                18736,
                18790
            ],
            [
                18790,
                18975
            ],
            [
                18975,
                19072
            ],
            [
                19072,
                19154
            ],
            [
                19154,
                19281
            ],
            [
                19281,
                19470
            ],
            [
                19470,
                19670
            ],
            [
                19670,
                19766
            ],
            [
                19766,
                19949
            ],
            [
                19949,
                20009
            ],
            [
                20009,
                20127
            ],
            [
                20127,
                20213
            ],
            [
                20213,
                20290
            ],
            [
                20290,
                20315
            ],
            [
                20315,
                20335
            ],
            [
                20335,
                20354
            ],
            [
                20354,
                20445
            ],
            [
                20445,
                20500
            ],
            [
                20500,
                20540
            ],
            [
                20540,
                20631
            ],
            [
                20631,
                20631
            ],
            [
                20631,
                20672
            ],
            [
                20672,
                20718
            ],
            [
                20718,
                20780
            ],
            [
                20780,
                20791
            ],
            [
                20791,
                20824
            ],
            [
                20824,
                20865
            ],
            [
                20865,
                20987
            ],
            [
                20987,
                20987
            ],
            [
                20987,
                21098
            ],
            [
                21098,
                21141
            ],
            [
                21141,
                21141
            ],
            [
                21141,
                21277
            ],
            [
                21277,
                21318
            ],
            [
                21318,
                21349
            ],
            [
                21349,
                21470
            ],
            [
                21470,
                21492
            ],
            [
                21492,
                21492
            ],
            [
                21492,
                21569
            ],
            [
                21569,
                21616
            ],
            [
                21616,
                21681
            ],
            [
                21681,
                21703
            ],
            [
                21703,
                21717
            ],
            [
                21717,
                21747
            ],
            [
                21747,
                21759
            ],
            [
                21759,
                21813
            ],
            [
                21813,
                21880
            ],
            [
                21880,
                21937
            ],
            [
                21937,
                21987
            ],
            [
                21987,
                22010
            ],
            [
                22010,
                22010
            ],
            [
                22010,
                22086
            ],
            [
                22086,
                22142
            ],
            [
                22142,
                22185
            ],
            [
                22185,
                22193
            ],
            [
                22193,
                22214
            ],
            [
                22214,
                22309
            ],
            [
                22309,
                22327
            ],
            [
                22327,
                22327
            ],
            [
                22327,
                22380
            ],
            [
                22380,
                22396
            ],
            [
                22396,
                22413
            ],
            [
                22413,
                22413
            ],
            [
                22413,
                22501
            ],
            [
                22501,
                22603
            ],
            [
                22603,
                22689
            ],
            [
                22689,
                22713
            ],
            [
                22713,
                22807
            ],
            [
                22807,
                22836
            ],
            [
                22836,
                22836
            ],
            [
                22836,
                22851
            ],
            [
                22851,
                22884
            ],
            [
                22884,
                22903
            ],
            [
                22903,
                22934
            ],
            [
                22934,
                22934
            ],
            [
                22934,
                23004
            ],
            [
                23004,
                23094
            ],
            [
                23094,
                23100
            ],
            [
                23100,
                23166
            ],
            [
                23166,
                23300
            ]
        ]
    }
}