{
    "original": {
        "text": "I had not been at home again many days when one evening I went upstairs into my own room to take a peep over Charley's shoulder and see how she was getting on with her copy-book. Writing was a trying business to Charley, who seemed to have no natural power over a pen, but in whose hand every pen appeared to become perversely animated, and to go wrong and crooked, and to stop, and splash, and sidle into corners like a saddle-donkey. It was very odd to see what old letters Charley's young hand had made, they so wrinkled, and shrivelled, and tottering, it so plump and round. Yet Charley was uncommonly expert at other things and had as nimble little fingers as I ever watched.\n\"Well, Charley,\" said I, looking over a copy of the letter O in which it was represented as square, triangular, pear-shaped, and collapsed in all kinds of ways, \"we are improving. If we only get to make it round, we shall be perfect, Charley.\"\nThen I made one, and Charley made one, and the pen wouldn't join Charley's neatly, but twisted it up into a knot.\n\"Never mind, Charley. We shall do it in time.\"\nCharley laid down her pen, the copy being finished, opened and shut her cramped little hand, looked gravely at the page, half in pride and half in doubt, and got up, and dropped me a curtsy.\n\"Thank you, miss. If you please, miss, did you know a poor person of the name of Jenny?\"\n\"A brickmaker's wife, Charley? Yes.\"\n\"She came and spoke to me when I was out a little while ago, and said you knew her, miss. She asked me if I wasn't the young lady's little maid--meaning you for the young lady, miss--and I said yes, miss.\"\n\"I thought she had left this neighbourhood altogether, Charley.\"\n\"So she had, miss, but she's come back again to where she used to live--she and Liz. Did you know another poor person of the name of Liz, miss?\"\n\"I think I do, Charley, though not by name.\"\n\"That's what she said!\" returned Charley. \"They have both come back, miss, and have been tramping high and low.\"\n\"Tramping high and low, have they, Charley?\"\n\"Yes, miss.\" If Charley could only have made the letters in her copy as round as the eyes with which she looked into my face, they would have been excellent. \"And this poor person came about the house three or four days, hoping to get a glimpse of you, miss--all she wanted, she said--but you were away. That was when she saw me. She saw me a-going about, miss,\" said Charley with a short laugh of the greatest delight and pride, \"and she thought I looked like your maid!\"\n\"Did she though, really, Charley?\"\n\"Yes, miss!\" said Charley. \"Really and truly.\" And Charley, with another short laugh of the purest glee, made her eyes very round again and looked as serious as became my maid. I was never tired of seeing Charley in the full enjoyment of that great dignity, standing before me with her youthful face and figure, and her steady manner, and her childish exultation breaking through it now and then in the pleasantest way.\n\"And where did you see her, Charley?\" said I.\nMy little maid's countenance fell as she replied, \"By the doctor's shop, miss.\" For Charley wore her black frock yet.\nI asked if the brickmaker's wife were ill, but Charley said no. It was some one else. Some one in her cottage who had tramped down to Saint Albans and was tramping he didn't know where. A poor boy, Charley said. No father, no mother, no any one. \"Like as Tom might have been, miss, if Emma and me had died after father,\" said Charley, her round eyes filling with tears.\n\"And she was getting medicine for him, Charley?\"\n\"She said, miss,\" returned Charley, \"how that he had once done as much for her.\"\nMy little maid's face was so eager and her quiet hands were folded so closely in one another as she stood looking at me that I had no great difficulty in reading her thoughts. \"Well, Charley,\" said I, \"it appears to me that you and I can do no better than go round to Jenny's and see what's the matter.\"\nThe alacrity with which Charley brought my bonnet and veil, and having dressed me, quaintly pinned herself into her warm shawl and made herself look like a little old woman, sufficiently expressed her readiness. So Charley and I, without saying anything to any one, went out.\nIt was a cold, wild night, and the trees shuddered in the wind. The rain had been thick and heavy all day, and with little intermission for many days. None was falling just then, however. The sky had partly cleared, but was very gloomy--even above us, where a few stars were shining. In the north and north-west, where the sun had set three hours before, there was a pale dead light both beautiful and awful; and into it long sullen lines of cloud waved up like a sea stricken immovable as it was heaving. Towards London a lurid glare overhung the whole dark waste, and the contrast between these two lights, and the fancy which the redder light engendered of an unearthly fire, gleaming on all the unseen buildings of the city and on all the faces of its many thousands of wondering inhabitants, was as solemn as might be.\nI had no thought that night--none, I am quite sure--of what was soon to happen to me. But I have always remembered since that when we had stopped at the garden-gate to look up at the sky, and when we went upon our way, I had for a moment an undefinable impression of myself as being something different from what I then was. I know it was then and there that I had it. I have ever since connected the feeling with that spot and time and with everything associated with that spot and time, to the distant voices in the town, the barking of a dog, and the sound of wheels coming down the miry hill.\nIt was Saturday night, and most of the people belonging to the place where we were going were drinking elsewhere. We found it quieter than I had previously seen it, though quite as miserable. The kilns were burning, and a stifling vapour set towards us with a pale-blue glare.\nWe came to the cottage, where there was a feeble candle in the patched window. We tapped at the door and went in. The mother of the little child who had died was sitting in a chair on one side of the poor fire by the bed; and opposite to her, a wretched boy, supported by the chimney-piece, was cowering on the floor. He held under his arm, like a little bundle, a fragment of a fur cap; and as he tried to warm himself, he shook until the crazy door and window shook. The place was closer than before and had an unhealthy and a very peculiar smell.\nI had not lifted my veil when I first spoke to the woman, which was at the moment of our going in. The boy staggered up instantly and stared at me with a remarkable expression of surprise and terror.\nHis action was so quick and my being the cause of it was so evident that I stood still instead of advancing nearer.\n\"I won't go no more to the berryin ground,\" muttered the boy; \"I ain't a-going there, so I tell you!\"\nI lifted my veil and spoke to the woman. She said to me in a low voice, \"Don't mind him, ma'am. He'll soon come back to his head,\" and said to him, \"Jo, Jo, what's the matter?\"\n\"I know wot she's come for!\" cried the boy.\n\"Who?\"\n\"The lady there. She's come to get me to go along with her to the berryin ground. I won't go to the berryin ground. I don't like the name on it. She might go a-berryin ME.\" His shivering came on again, and as he leaned against the wall, he shook the hovel.\n\"He has been talking off and on about such like all day, ma'am,\" said Jenny softly. \"Why, how you stare! This is MY lady, Jo.\"\n\"Is it?\" returned the boy doubtfully, and surveying me with his arm held out above his burning eyes. \"She looks to me the t'other one. It ain't the bonnet, nor yet it ain't the gownd, but she looks to me the t'other one.\"\nMy little Charley, with her premature experience of illness and trouble, had pulled off her bonnet and shawl and now went quietly up to him with a chair and sat him down in it like an old sick nurse. Except that no such attendant could have shown him Charley's youthful face, which seemed to engage his confidence.\n\"I say!\" said the boy. \"YOU tell me. Ain't the lady the t'other lady?\"\nCharley shook her head as she methodically drew his rags about him and made him as warm as she could.\n\"Oh!\" the boy muttered. \"Then I s'pose she ain't.\"\n\"I came to see if I could do you any good,\" said I. \"What is the matter with you?\"\n\"I'm a-being froze,\" returned the boy hoarsely, with his haggard gaze wandering about me, \"and then burnt up, and then froze, and then burnt up, ever so many times in a hour. And my head's all sleepy, and all a-going mad-like--and I'm so dry--and my bones isn't half so much bones as pain.\n\"When did he come here?\" I asked the woman.\n\"This morning, ma'am, I found him at the corner of the town. I had known him up in London yonder. Hadn't I, Jo?\"\n\"Tom-all-Alone's,\" the boy replied.\nWhenever he fixed his attention or his eyes, it was only for a very little while. He soon began to droop his head again, and roll it heavily, and speak as if he were half awake.\n\"When did he come from London?\" I asked.\n\"I come from London yes'day,\" said the boy himself, now flushed and hot. \"I'm a-going somewheres.\"\n\"Where is he going?\" I asked.\n\"Somewheres,\" repeated the boy in a louder tone. \"I have been moved on, and moved on, more nor ever I was afore, since the t'other one give me the sov'ring. Mrs. Snagsby, she's always a-watching, and a-driving of me--what have I done to her?--and they're all a-watching and a-driving of me. Every one of 'em's doing of it, from the time when I don't get up, to the time when I don't go to bed. And I'm a-going somewheres. That's where I'm a-going. She told me, down in Tom-all-Alone's, as she came from Stolbuns, and so I took the Stolbuns Road. It's as good as another.\"\nHe always concluded by addressing Charley.\n\"What is to be done with him?\" said I, taking the woman aside. \"He could not travel in this state even if he had a purpose and knew where he was going!\"\n\"I know no more, ma'am, than the dead,\" she replied, glancing compassionately at him. \"Perhaps the dead know better, if they could only tell us. I've kept him here all day for pity's sake, and I've given him broth and physic, and Liz has gone to try if any one will take him in (here's my pretty in the bed--her child, but I call it mine); but I can't keep him long, for if my husband was to come home and find him here, he'd be rough in putting him out and might do him a hurt. Hark! Here comes Liz back!\"\nThe other woman came hurriedly in as she spoke, and the boy got up with a half-obscured sense that he was expected to be going. When the little child awoke, and when and how Charley got at it, took it out of bed, and began to walk about hushing it, I don't know. There she was, doing all this in a quiet motherly manner as if she were living in Mrs. Blinder's attic with Tom and Emma again.\nThe friend had been here and there, and had been played about from hand to hand, and had come back as she went. At first it was too early for the boy to be received into the proper refuge, and at last it was too late. One official sent her to another, and the other sent her back again to the first, and so backward and forward, until it appeared to me as if both must have been appointed for their skill in evading their duties instead of performing them. And now, after all, she said, breathing quickly, for she had been running and was frightened too, \"Jenny, your master's on the road home, and mine's not far behind, and the Lord help the boy, for we can do no more for him!\" They put a few halfpence together and hurried them into his hand, and so, in an oblivious, half-thankful, half-insensible way, he shuffled out of the house.\n\"Give me the child, my dear,\" said its mother to Charley, \"and thank you kindly too! Jenny, woman dear, good night! Young lady, if my master don't fall out with me, I'll look down by the kiln by and by, where the boy will be most like, and again in the morning!\" She hurried off, and presently we passed her hushing and singing to her child at her own door and looking anxiously along the road for her drunken husband.\nI was afraid of staying then to speak to either woman, lest I should bring her into trouble. But I said to Charley that we must not leave the boy to die. Charley, who knew what to do much better than I did, and whose quickness equalled her presence of mind, glided on before me, and presently we came up with Jo, just short of the brick-kiln.\nI think he must have begun his journey with some small bundle under his arm and must have had it stolen or lost it. For he still carried his wretched fragment of fur cap like a bundle, though he went bare-headed through the rain, which now fell fast. He stopped when we called to him and again showed a dread of me when I came up, standing with his lustrous eyes fixed upon me, and even arrested in his shivering fit.\nI asked him to come with us, and we would take care that he had some shelter for the night.\n\"I don't want no shelter,\" he said; \"I can lay amongst the warm bricks.\"\n\"But don't you know that people die there?\" replied Charley.\n\"They dies everywheres,\" said the boy. \"They dies in their lodgings--she knows where; I showed her--and they dies down in Tom-all-Alone's in heaps. They dies more than they lives, according to what I see.\" Then he hoarsely whispered Charley, \"If she ain't the t'other one, she ain't the forrenner. Is there THREE of 'em then?\"\nCharley looked at me a little frightened. I felt half frightened at myself when the boy glared on me so.\nBut he turned and followed when I beckoned to him, and finding that he acknowledged that influence in me, I led the way straight home. It was not far, only at the summit of the hill. We passed but one man. I doubted if we should have got home without assistance, the boy's steps were so uncertain and tremulous. He made no complaint, however, and was strangely unconcerned about himself, if I may say so strange a thing.\nLeaving him in the hall for a moment, shrunk into the corner of the window-seat and staring with an indifference that scarcely could be called wonder at the comfort and brightness about him, I went into the drawing-room to speak to my guardian. There I found Mr. Skimpole, who had come down by the coach, as he frequently did without notice, and never bringing any clothes with him, but always borrowing everything he wanted.\nThey came out with me directly to look at the boy. The servants had gathered in the hall too, and he shivered in the window-seat with Charley standing by him, like some wounded animal that had been found in a ditch.\n\"This is a sorrowful case,\" said my guardian after asking him a question or two and touching him and examining his eyes. \"What do you say, Harold?\"\n\"You had better turn him out,\" said Mr. Skimpole.\n\"What do you mean?\" inquired my guardian, almost sternly.\n\"My dear Jarndyce,\" said Mr. Skimpole, \"you know what I am: I am a child. Be cross to me if I deserve it. But I have a constitutional objection to this sort of thing. I always had, when I was a medical man. He's not safe, you know. There's a very bad sort of fever about him.\"\nMr. Skimpole had retreated from the hall to the drawing-room again and said this in his airy way, seated on the music-stool as we stood by.\n\"You'll say it's childish,\" observed Mr. Skimpole, looking gaily at us. \"Well, I dare say it may be; but I AM a child, and I never pretend to be anything else. If you put him out in the road, you only put him where he was before. He will be no worse off than he was, you know. Even make him better off, if you like. Give him sixpence, or five shillings, or five pound ten--you are arithmeticians, and I am not--and get rid of him!\"\n\"And what is he to do then?\" asked my guardian.\n\"Upon my life,\" said Mr. Skimpole, shrugging his shoulders with his engaging smile, \"I have not the least idea what he is to do then. But I have no doubt he'll do it.\"\n\"Now, is it not a horrible reflection,\" said my guardian, to whom I had hastily explained the unavailing efforts of the two women, \"is it not a horrible reflection,\" walking up and down and rumpling his hair, \"that if this wretched creature were a convicted prisoner, his hospital would be wide open to him, and he would be as well taken care of as any sick boy in the kingdom?\"\n\"My dear Jarndyce,\" returned Mr. Skimpole, \"you'll pardon the simplicity of the question, coming as it does from a creature who is perfectly simple in worldly matters, but why ISN'T he a prisoner then?\"\nMy guardian stopped and looked at him with a whimsical mixture of amusement and indignation in his face.\n\"Our young friend is not to be suspected of any delicacy, I should imagine,\" said Mr. Skimpole, unabashed and candid. \"It seems to me that it would be wiser, as well as in a certain kind of way more respectable, if he showed some misdirected energy that got him into prison. There would be more of an adventurous spirit in it, and consequently more of a certain sort of poetry.\"\n\"I believe,\" returned my guardian, resuming his uneasy walk, \"that there is not such another child on earth as yourself.\"\n\"Do you really?\" said Mr. Skimpole. \"I dare say! But I confess I don't see why our young friend, in his degree, should not seek to invest himself with such poetry as is open to him. He is no doubt born with an appetite--probably, when he is in a safer state of health, he has an excellent appetite. Very well. At our young friend's natural dinner hour, most likely about noon, our young friend says in effect to society, 'I am hungry; will you have the goodness to produce your spoon and feed me?' Society, which has taken upon itself the general arrangement of the whole system of spoons and professes to have a spoon for our young friend, does NOT produce that spoon; and our young friend, therefore, says 'You really must excuse me if I seize it.' Now, this appears to me a case of misdirected energy, which has a certain amount of reason in it and a certain amount of romance; and I don't know but what I should be more interested in our young friend, as an illustration of such a case, than merely as a poor vagabond--which any one can be.\"\n\"In the meantime,\" I ventured to observe, \"he is getting worse.\"\n\"In the meantime,\" said Mr. Skimpole cheerfully, \"as Miss Summerson, with her practical good sense, observes, he is getting worse. Therefore I recommend your turning him out before he gets still worse.\"\nThe amiable face with which he said it, I think I shall never forget.\n\"Of course, little woman,\" observed my guardian, turning to me, \"I can ensure his admission into the proper place by merely going there to enforce it, though it's a bad state of things when, in his condition, that is necessary. But it's growing late, and is a very bad night, and the boy is worn out already. There is a bed in the wholesome loft-room by the stable; we had better keep him there till morning, when he can be wrapped up and removed. We'll do that.\"\n\"Oh!\" said Mr. Skimpole, with his hands upon the keys of the piano as we moved away. \"Are you going back to our young friend?\"\n\"Yes,\" said my guardian.\n\"How I envy you your constitution, Jarndyce!\" returned Mr. Skimpole with playful admiration. \"You don't mind these things; neither does Miss Summerson. You are ready at all times to go anywhere, and do anything. Such is will! I have no will at all--and no won't--simply can't.\"\n\"You can't recommend anything for the boy, I suppose?\" said my guardian, looking back over his shoulder half angrily; only half angrily, for he never seemed to consider Mr. Skimpole an accountable being.\n\"My dear Jarndyce, I observed a bottle of cooling medicine in his pocket, and it's impossible for him to do better than take it. You can tell them to sprinkle a little vinegar about the place where he sleeps and to keep it moderately cool and him moderately warm. But it is mere impertinence in me to offer any recommendation. Miss Summerson has such a knowledge of detail and such a capacity for the administration of detail that she knows all about it.\"\nWe went back into the hall and explained to Jo what we proposed to do, which Charley explained to him again and which he received with the languid unconcern I had already noticed, wearily looking on at what was done as if it were for somebody else. The servants compassionating his miserable state and being very anxious to help, we soon got the loft-room ready; and some of the men about the house carried him across the wet yard, well wrapped up. It was pleasant to observe how kind they were to him and how there appeared to be a general impression among them that frequently calling him \"Old Chap\" was likely to revive his spirits. Charley directed the operations and went to and fro between the loft-room and the house with such little stimulants and comforts as we thought it safe to give him. My guardian himself saw him before he was left for the night and reported to me when he returned to the growlery to write a letter on the boy's behalf, which a messenger was charged to deliver at day-light in the morning, that he seemed easier and inclined to sleep. They had fastened his door on the outside, he said, in case of his being delirious, but had so arranged that he could not make any noise without being heard.\nAda being in our room with a cold, Mr. Skimpole was left alone all this time and entertained himself by playing snatches of pathetic airs and sometimes singing to them (as we heard at a distance) with great expression and feeling. When we rejoined him in the drawing-room he said he would give us a little ballad which had come into his head \"apropos of our young friend,\" and he sang one about a peasant boy,\n\"Thrown on the wide world, doomed to wander and roam, Bereft of his parents, bereft of a home.\"\nquite exquisitely. It was a song that always made him cry, he told us.\nHe was extremely gay all the rest of the evening, for he absolutely chirped--those were his delighted words--when he thought by what a happy talent for business he was surrounded. He gave us, in his glass of negus, \"Better health to our young friend!\" and supposed and gaily pursued the case of his being reserved like Whittington to become Lord Mayor of London. In that event, no doubt, he would establish the Jarndyce Institution and the Summerson Almshouses, and a little annual Corporation Pilgrimage to St. Albans. He had no doubt, he said, that our young friend was an excellent boy in his way, but his way was not the Harold Skimpole way; what Harold Skimpole was, Harold Skimpole had found himself, to his considerable surprise, when he first made his own acquaintance; he had accepted himself with all his failings and had thought it sound philosophy to make the best of the bargain; and he hoped we would do the same.\nCharley's last report was that the boy was quiet. I could see, from my window, the lantern they had left him burning quietly; and I went to bed very happy to think that he was sheltered.\nThere was more movement and more talking than usual a little before daybreak, and it awoke me. As I was dressing, I looked out of my window and asked one of our men who had been among the active sympathizers last night whether there was anything wrong about the house. The lantern was still burning in the loft-window.\n\"It's the boy, miss,\" said he.\n\"Is he worse?\" I inquired.\n\"Gone, miss.\n\"Dead!\"\n\"Dead, miss? No. Gone clean off.\"\nAt what time of the night he had gone, or how, or why, it seemed hopeless ever to divine. The door remaining as it had been left, and the lantern standing in the window, it could only be supposed that he had got out by a trap in the floor which communicated with an empty cart-house below. But he had shut it down again, if that were so; and it looked as if it had not been raised. Nothing of any kind was missing. On this fact being clearly ascertained, we all yielded to the painful belief that delirium had come upon him in the night and that, allured by some imaginary object or pursued by some imaginary horror, he had strayed away in that worse than helpless state; all of us, that is to say, but Mr. Skimpole, who repeatedly suggested, in his usual easy light style, that it had occurred to our young friend that he was not a safe inmate, having a bad kind of fever upon him, and that he had with great natural politeness taken himself off.\nEvery possible inquiry was made, and every place was searched. The brick-kilns were examined, the cottages were visited, the two women were particularly questioned, but they knew nothing of him, and nobody could doubt that their wonder was genuine. The weather had for some time been too wet and the night itself had been too wet to admit of any tracing by footsteps. Hedge and ditch, and wall, and rick and stack, were examined by our men for a long distance round, lest the boy should be lying in such a place insensible or dead; but nothing was seen to indicate that he had ever been near. From the time when he was left in the loft-room, he vanished.\nThe search continued for five days. I do not mean that it ceased even then, but that my attention was then diverted into a current very memorable to me.\nAs Charley was at her writing again in my room in the evening, and as I sat opposite to her at work, I felt the table tremble. Looking up, I saw my little maid shivering from head to foot.\n\"Charley,\" said I, \"are you so cold?\"\n\"I think I am, miss,\" she replied. \"I don't know what it is. I can't hold myself still. I felt so yesterday at about this same time, miss. Don't be uneasy, I think I'm ill.\"\nI heard Ada's voice outside, and I hurried to the door of communication between my room and our pretty sitting-room, and locked it. Just in time, for she tapped at it while my hand was yet upon the key.\nAda called to me to let her in, but I said, \"Not now, my dearest. Go away. There's nothing the matter; I will come to you presently.\" Ah! It was a long, long time before my darling girl and I were companions again.\nCharley fell ill. In twelve hours she was very ill. I moved her to my room, and laid her in my bed, and sat down quietly to nurse her. I told my guardian all about it, and why I felt it was necessary that I should seclude myself, and my reason for not seeing my darling above all. At first she came very often to the door, and called to me, and even reproached me with sobs and tears; but I wrote her a long letter saying that she made me anxious and unhappy and imploring her, as she loved me and wished my mind to be at peace, to come no nearer than the garden. After that she came beneath the window even oftener than she had come to the door, and if I had learnt to love her dear sweet voice before when we were hardly ever apart, how did I learn to love it then, when I stood behind the window-curtain listening and replying, but not so much as looking out! How did I learn to love it afterwards, when the harder time came!\nThey put a bed for me in our sitting-room; and by keeping the door wide open, I turned the two rooms into one, now that Ada had vacated that part of the house, and kept them always fresh and airy. There was not a servant in or about the house but was so good that they would all most gladly have come to me at any hour of the day or night without the least fear or unwillingness, but I thought it best to choose one worthy woman who was never to see Ada and whom I could trust to come and go with all precaution. Through her means I got out to take the air with my guardian when there was no fear of meeting Ada, and wanted for nothing in the way of attendance, any more than in any other respect.\nAnd thus poor Charley sickened and grew worse, and fell into heavy danger of death, and lay severely ill for many a long round of day and night. So patient she was, so uncomplaining, and inspired by such a gentle fortitude that very often as I sat by Charley holding her head in my arms--repose would come to her, so, when it would come to her in no other attitude--I silently prayed to our Father in heaven that I might not forget the lesson which this little sister taught me.\nI was very sorrowful to think that Charley's pretty looks would change and be disfigured, even if she recovered--she was such a child with her dimpled face--but that thought was, for the greater part, lost in her greater peril. When she was at the worst, and her mind rambled again to the cares of her father's sick bed and the little children, she still knew me so far as that she would be quiet in my arms when she could lie quiet nowhere else, and murmur out the wanderings of her mind less restlessly. At those times I used to think, how should I ever tell the two remaining babies that the baby who had learned of her faithful heart to be a mother to them in their need was dead!\nThere were other times when Charley knew me well and talked to me, telling me that she sent her love to Tom and Emma and that she was sure Tom would grow up to be a good man. At those times Charley would speak to me of what she had read to her father as well as she could to comfort him, of that young man carried out to be buried who was the only son of his mother and she was a widow, of the ruler's daughter raised up by the gracious hand upon her bed of death. And Charley told me that when her father died she had kneeled down and prayed in her first sorrow that he likewise might be raised up and given back to his poor children, and that if she should never get better and should die too, she thought it likely that it might come into Tom's mind to offer the same prayer for her. Then would I show Tom how these people of old days had been brought back to life on earth, only that we might know our hope to be restored to heaven!\nBut of all the various times there were in Charley's illness, there was not one when she lost the gentle qualities I have spoken of. And there were many, many when I thought in the night of the last high belief in the watching angel, and the last higher trust in God, on the part of her poor despised father.\nAnd Charley did not die. She flutteringly and slowly turned the dangerous point, after long lingering there, and then began to mend. The hope that never had been given, from the first, of Charley being in outward appearance Charley any more soon began to be encouraged; and even that prospered, and I saw her growing into her old childish likeness again.\nIt was a great morning when I could tell Ada all this as she stood out in the garden; and it was a great evening when Charley and I at last took tea together in the next room. But on that same evening, I felt that I was stricken cold.\nHappily for both of us, it was not until Charley was safe in bed again and placidly asleep that I began to think the contagion of her illness was upon me. I had been able easily to hide what I felt at tea-time, but I was past that already now, and I knew that I was rapidly following in Charley's steps.\nI was well enough, however, to be up early in the morning, and to return my darling's cheerful blessing from the garden, and to talk with her as long as usual. But I was not free from an impression that I had been walking about the two rooms in the night, a little beside myself, though knowing where I was; and I felt confused at times--with a curious sense of fullness, as if I were becoming too large altogether.\nIn the evening I was so much worse that I resolved to prepare Charley, with which view I said, \"You're getting quite strong, Charley, are you not?'\n\"Oh, quite!\" said Charley.\n\"Strong enough to be told a secret, I think, Charley?\"\n\"Quite strong enough for that, miss!\" cried Charley. But Charley's face fell in the height of her delight, for she saw the secret in MY face; and she came out of the great chair, and fell upon my bosom, and said \"Oh, miss, it's my doing! It's my doing!\" and a great deal more out of the fullness of her grateful heart.\n\"Now, Charley,\" said I after letting her go on for a little while, \"if I am to be ill, my great trust, humanly speaking, is in you. And unless you are as quiet and composed for me as you always were for yourself, you can never fulfil it, Charley.\"\n\"If you'll let me cry a little longer, miss,\" said Charley. \"Oh, my dear, my dear! If you'll only let me cry a little longer. Oh, my dear!\"--how affectionately and devotedly she poured this out as she clung to my neck, I never can remember without tears--\"I'll be good.\"\nSo I let Charley cry a little longer, and it did us both good.\n\"Trust in me now, if you please, miss,\" said Charley quietly. \"I am listening to everything you say.\"\n\"It's very little at present, Charley. I shall tell your doctor to-night that I don't think I am well and that you are going to nurse me.\"\nFor that the poor child thanked me with her whole heart. \"And in the morning, when you hear Miss Ada in the garden, if I should not be quite able to go to the window-curtain as usual, do you go, Charley, and say I am asleep--that I have rather tired myself, and am asleep. At all times keep the room as I have kept it, Charley, and let no one come.\"\nCharley promised, and I lay down, for I was very heavy. I saw the doctor that night and asked the favour of him that I wished to ask relative to his saying nothing of my illness in the house as yet. I have a very indistinct remembrance of that night melting into day, and of day melting into night again; but I was just able on the first morning to get to the window and speak to my darling.\nOn the second morning I heard her dear voice--Oh, how dear now!--outside; and I asked Charley, with some difficulty (speech being painful to me), to go and say I was asleep. I heard her answer softly, \"Don't disturb her, Charley, for the world!\"\n\"How does my own Pride look, Charley?\" I inquired.\n\"Disappointed, miss,\" said Charley, peeping through the curtain.\n\"But I know she is very beautiful this morning.\"\n\"She is indeed, miss,\" answered Charley, peeping. \"Still looking up at the window.\"\nWith her blue clear eyes, God bless them, always loveliest when raised like that!\nI called Charley to me and gave her her last charge.\n\"Now, Charley, when she knows I am ill, she will try to make her way into the room. Keep her out, Charley, if you love me truly, to the last! Charley, if you let her in but once, only to look upon me for one moment as I lie here, I shall die.\"\n\"I never will! I never will!\" she promised me.\n\"I believe it, my dear Charley. And now come and sit beside me for a little while, and touch me with your hand. For I cannot see you, Charley; I am blind.\"",
        "paragraph_chars": [
            [
                0,
                681
            ],
            [
                681,
                925
            ],
            [
                925,
                1039
            ],
            [
                1039,
                1086
            ],
            [
                1086,
                1277
            ],
            [
                1277,
                1366
            ],
            [
                1366,
                1403
            ],
            [
                1403,
                1609
            ],
            [
                1609,
                1674
            ],
            [
                1674,
                1819
            ],
            [
                1819,
                1864
            ],
            [
                1864,
                1977
            ],
            [
                1977,
                2022
            ],
            [
                2022,
                2495
            ],
            [
                2495,
                2530
            ],
            [
                2530,
                2950
            ],
            [
                2950,
                2996
            ],
            [
                2996,
                3114
            ],
            [
                3114,
                3484
            ],
            [
                3484,
                3533
            ],
            [
                3533,
                3614
            ],
            [
                3614,
                3918
            ],
            [
                3918,
                4194
            ],
            [
                4194,
                5018
            ],
            [
                5018,
                5615
            ],
            [
                5615,
                5892
            ],
            [
                5892,
                6442
            ],
            [
                6442,
                6642
            ],
            [
                6642,
                6758
            ],
            [
                6758,
                6860
            ],
            [
                6860,
                7037
            ],
            [
                7037,
                7081
            ],
            [
                7081,
                7088
            ],
            [
                7088,
                7345
            ],
            [
                7345,
                7472
            ],
            [
                7472,
                7694
            ],
            [
                7694,
                8009
            ],
            [
                8009,
                8080
            ],
            [
                8080,
                8182
            ],
            [
                8182,
                8233
            ],
            [
                8233,
                8316
            ],
            [
                8316,
                8606
            ],
            [
                8606,
                8650
            ],
            [
                8650,
                8763
            ],
            [
                8763,
                8799
            ],
            [
                8799,
                8977
            ],
            [
                8977,
                9018
            ],
            [
                9018,
                9117
            ],
            [
                9117,
                9147
            ],
            [
                9147,
                9719
            ],
            [
                9719,
                9762
            ],
            [
                9762,
                9915
            ],
            [
                9915,
                10422
            ],
            [
                10422,
                10813
            ],
            [
                10813,
                11651
            ],
            [
                11651,
                12070
            ],
            [
                12070,
                12413
            ],
            [
                12413,
                12831
            ],
            [
                12831,
                12923
            ],
            [
                12923,
                12996
            ],
            [
                12996,
                13057
            ],
            [
                13057,
                13384
            ],
            [
                13384,
                13489
            ],
            [
                13489,
                13910
            ],
            [
                13910,
                14336
            ],
            [
                14336,
                14552
            ],
            [
                14552,
                14700
            ],
            [
                14700,
                14750
            ],
            [
                14750,
                14808
            ],
            [
                14808,
                15085
            ],
            [
                15085,
                15225
            ],
            [
                15225,
                15657
            ],
            [
                15657,
                15705
            ],
            [
                15705,
                15873
            ],
            [
                15873,
                16252
            ],
            [
                16252,
                16455
            ],
            [
                16455,
                16560
            ],
            [
                16560,
                16939
            ],
            [
                16939,
                17061
            ],
            [
                17061,
                18107
            ],
            [
                18107,
                18172
            ],
            [
                18172,
                18375
            ],
            [
                18375,
                18445
            ],
            [
                18445,
                18909
            ],
            [
                18909,
                19036
            ],
            [
                19036,
                19061
            ],
            [
                19061,
                19339
            ],
            [
                19339,
                19543
            ],
            [
                19543,
                19999
            ],
            [
                19999,
                21224
            ],
            [
                21224,
                21634
            ],
            [
                21634,
                21730
            ],
            [
                21730,
                21801
            ],
            [
                21801,
                22729
            ],
            [
                22729,
                22916
            ],
            [
                22916,
                23235
            ],
            [
                23235,
                23266
            ],
            [
                23266,
                23293
            ],
            [
                23293,
                23306
            ],
            [
                23306,
                23314
            ],
            [
                23314,
                23348
            ],
            [
                23348,
                24296
            ],
            [
                24296,
                24951
            ],
            [
                24951,
                25104
            ],
            [
                25104,
                25293
            ],
            [
                25293,
                25331
            ],
            [
                25331,
                25505
            ],
            [
                25505,
                25708
            ],
            [
                25708,
                25923
            ],
            [
                25923,
                26852
            ],
            [
                26852,
                27550
            ],
            [
                27550,
                28029
            ],
            [
                28029,
                28714
            ],
            [
                28714,
                29651
            ],
            [
                29651,
                29960
            ],
            [
                29960,
                30315
            ],
            [
                30315,
                30550
            ],
            [
                30550,
                30854
            ],
            [
                30854,
                31270
            ],
            [
                31270,
                31418
            ],
            [
                31418,
                31445
            ],
            [
                31445,
                31500
            ],
            [
                31500,
                31819
            ],
            [
                31819,
                32067
            ],
            [
                32067,
                32338
            ],
            [
                32338,
                32401
            ],
            [
                32401,
                32503
            ],
            [
                32503,
                32642
            ],
            [
                32642,
                32992
            ],
            [
                32992,
                33384
            ],
            [
                33384,
                33630
            ],
            [
                33630,
                33681
            ],
            [
                33681,
                33746
            ],
            [
                33746,
                33795
            ],
            [
                33795,
                33879
            ],
            [
                33879,
                33961
            ],
            [
                33961,
                34014
            ],
            [
                34014,
                34258
            ],
            [
                34258,
                34305
            ],
            [
                34305,
                34460
            ]
        ],
        "segment_chars": [
            [
                0,
                179
            ],
            [
                179,
                436
            ],
            [
                436,
                579
            ],
            [
                579,
                681
            ],
            [
                681,
                861
            ],
            [
                861,
                925
            ],
            [
                925,
                1039
            ],
            [
                1039,
                1061
            ],
            [
                1061,
                1086
            ],
            [
                1086,
                1277
            ],
            [
                1277,
                1295
            ],
            [
                1295,
                1366
            ],
            [
                1366,
                1397
            ],
            [
                1397,
                1403
            ],
            [
                1403,
                1493
            ],
            [
                1493,
                1609
            ],
            [
                1609,
                1674
            ],
            [
                1674,
                1759
            ],
            [
                1759,
                1819
            ],
            [
                1819,
                1864
            ],
            [
                1864,
                1888
            ],
            [
                1888,
                1906
            ],
            [
                1906,
                1977
            ],
            [
                1977,
                2022
            ],
            [
                2022,
                2035
            ],
            [
                2035,
                2180
            ],
            [
                2180,
                2326
            ],
            [
                2326,
                2352
            ],
            [
                2352,
                2495
            ],
            [
                2495,
                2530
            ],
            [
                2530,
                2543
            ],
            [
                2543,
                2557
            ],
            [
                2557,
                2577
            ],
            [
                2577,
                2707
            ],
            [
                2707,
                2950
            ],
            [
                2950,
                2988
            ],
            [
                2988,
                2996
            ],
            [
                2996,
                3076
            ],
            [
                3076,
                3114
            ],
            [
                3114,
                3178
            ],
            [
                3178,
                3200
            ],
            [
                3200,
                3300
            ],
            [
                3300,
                3326
            ],
            [
                3326,
                3360
            ],
            [
                3360,
                3484
            ],
            [
                3484,
                3533
            ],
            [
                3533,
                3614
            ],
            [
                3614,
                3790
            ],
            [
                3790,
                3918
            ],
            [
                3918,
                4130
            ],
            [
                4130,
                4194
            ],
            [
                4194,
                4258
            ],
            [
                4258,
                4345
            ],
            [
                4345,
                4382
            ],
            [
                4382,
                4478
            ],
            [
                4478,
                4700
            ],
            [
                4700,
                5018
            ],
            [
                5018,
                5104
            ],
            [
                5104,
                5343
            ],
            [
                5343,
                5387
            ],
            [
                5387,
                5615
            ],
            [
                5615,
                5729
            ],
            [
                5729,
                5807
            ],
            [
                5807,
                5892
            ],
            [
                5892,
                5971
            ],
            [
                5971,
                6006
            ],
            [
                6006,
                6210
            ],
            [
                6210,
                6361
            ],
            [
                6361,
                6442
            ],
            [
                6442,
                6541
            ],
            [
                6541,
                6642
            ],
            [
                6642,
                6758
            ],
            [
                6758,
                6860
            ],
            [
                6860,
                6901
            ],
            [
                6901,
                6956
            ],
            [
                6956,
                7037
            ],
            [
                7037,
                7066
            ],
            [
                7066,
                7081
            ],
            [
                7081,
                7088
            ],
            [
                7088,
                7105
            ],
            [
                7105,
                7170
            ],
            [
                7170,
                7204
            ],
            [
                7204,
                7233
            ],
            [
                7233,
                7261
            ],
            [
                7261,
                7345
            ],
            [
                7345,
                7429
            ],
            [
                7429,
                7450
            ],
            [
                7450,
                7472
            ],
            [
                7472,
                7481
            ],
            [
                7481,
                7573
            ],
            [
                7573,
                7607
            ],
            [
                7607,
                7694
            ],
            [
                7694,
                7894
            ],
            [
                7894,
                8009
            ],
            [
                8009,
                8018
            ],
            [
                8018,
                8032
            ],
            [
                8032,
                8046
            ],
            [
                8046,
                8080
            ],
            [
                8080,
                8182
            ],
            [
                8182,
                8188
            ],
            [
                8188,
                8206
            ],
            [
                8206,
                8233
            ],
            [
                8233,
                8285
            ],
            [
                8285,
                8316
            ],
            [
                8316,
                8491
            ],
            [
                8491,
                8606
            ],
            [
                8606,
                8631
            ],
            [
                8631,
                8650
            ],
            [
                8650,
                8711
            ],
            [
                8711,
                8748
            ],
            [
                8748,
                8763
            ],
            [
                8763,
                8799
            ],
            [
                8799,
                8881
            ],
            [
                8881,
                8977
            ],
            [
                8977,
                9009
            ],
            [
                9009,
                9018
            ],
            [
                9018,
                9091
            ],
            [
                9091,
                9117
            ],
            [
                9117,
                9138
            ],
            [
                9138,
                9147
            ],
            [
                9147,
                9196
            ],
            [
                9196,
                9304
            ],
            [
                9304,
                9438
            ],
            [
                9438,
                9541
            ],
            [
                9541,
                9569
            ],
            [
                9569,
                9595
            ],
            [
                9595,
                9693
            ],
            [
                9693,
                9719
            ],
            [
                9719,
                9762
            ],
            [
                9762,
                9793
            ],
            [
                9793,
                9825
            ],
            [
                9825,
                9915
            ],
            [
                9915,
                10001
            ],
            [
                10001,
                10060
            ],
            [
                10060,
                10394
            ],
            [
                10394,
                10400
            ],
            [
                10400,
                10422
            ],
            [
                10422,
                10550
            ],
            [
                10550,
                10685
            ],
            [
                10685,
                10813
            ],
            [
                10813,
                10925
            ],
            [
                10925,
                11031
            ],
            [
                11031,
                11270
            ],
            [
                11270,
                11494
            ],
            [
                11494,
                11651
            ],
            [
                11651,
                11736
            ],
            [
                11736,
                11767
            ],
            [
                11767,
                11914
            ],
            [
                11914,
                12070
            ],
            [
                12070,
                12163
            ],
            [
                12163,
                12224
            ],
            [
                12224,
                12413
            ],
            [
                12413,
                12529
            ],
            [
                12529,
                12664
            ],
            [
                12664,
                12831
            ],
            [
                12831,
                12923
            ],
            [
                12923,
                12996
            ],
            [
                12996,
                13040
            ],
            [
                13040,
                13057
            ],
            [
                13057,
                13096
            ],
            [
                13096,
                13205
            ],
            [
                13205,
                13263
            ],
            [
                13263,
                13355
            ],
            [
                13355,
                13384
            ],
            [
                13384,
                13426
            ],
            [
                13426,
                13489
            ],
            [
                13489,
                13624
            ],
            [
                13624,
                13672
            ],
            [
                13672,
                13695
            ],
            [
                13695,
                13801
            ],
            [
                13801,
                13910
            ],
            [
                13910,
                14155
            ],
            [
                14155,
                14336
            ],
            [
                14336,
                14387
            ],
            [
                14387,
                14552
            ],
            [
                14552,
                14673
            ],
            [
                14673,
                14700
            ],
            [
                14700,
                14750
            ],
            [
                14750,
                14770
            ],
            [
                14770,
                14808
            ],
            [
                14808,
                14882
            ],
            [
                14882,
                14914
            ],
            [
                14914,
                14975
            ],
            [
                14975,
                15015
            ],
            [
                15015,
                15040
            ],
            [
                15040,
                15085
            ],
            [
                15085,
                15225
            ],
            [
                15225,
                15297
            ],
            [
                15297,
                15385
            ],
            [
                15385,
                15455
            ],
            [
                15455,
                15502
            ],
            [
                15502,
                15541
            ],
            [
                15541,
                15657
            ],
            [
                15657,
                15686
            ],
            [
                15686,
                15705
            ],
            [
                15705,
                15839
            ],
            [
                15839,
                15873
            ],
            [
                15873,
                16252
            ],
            [
                16252,
                16455
            ],
            [
                16455,
                16560
            ],
            [
                16560,
                16678
            ],
            [
                16678,
                16835
            ],
            [
                16835,
                16939
            ],
            [
                16939,
                17061
            ],
            [
                17061,
                17078
            ],
            [
                17078,
                17097
            ],
            [
                17097,
                17110
            ],
            [
                17110,
                17243
            ],
            [
                17243,
                17360
            ],
            [
                17360,
                17371
            ],
            [
                17371,
                17559
            ],
            [
                17559,
                17812
            ],
            [
                17812,
                18107
            ],
            [
                18107,
                18172
            ],
            [
                18172,
                18303
            ],
            [
                18303,
                18375
            ],
            [
                18375,
                18445
            ],
            [
                18445,
                18673
            ],
            [
                18673,
                18754
            ],
            [
                18754,
                18893
            ],
            [
                18893,
                18909
            ],
            [
                18909,
                18915
            ],
            [
                18915,
                18994
            ],
            [
                18994,
                19036
            ],
            [
                19036,
                19061
            ],
            [
                19061,
                19107
            ],
            [
                19107,
                19154
            ],
            [
                19154,
                19213
            ],
            [
                19213,
                19273
            ],
            [
                19273,
                19287
            ],
            [
                19287,
                19339
            ],
            [
                19339,
                19394
            ],
            [
                19394,
                19543
            ],
            [
                19543,
                19672
            ],
            [
                19672,
                19807
            ],
            [
                19807,
                19870
            ],
            [
                19870,
                19999
            ],
            [
                19999,
                20248
            ],
            [
                20248,
                20448
            ],
            [
                20448,
                20635
            ],
            [
                20635,
                20799
            ],
            [
                20799,
                21066
            ],
            [
                21066,
                21224
            ],
            [
                21224,
                21455
            ],
            [
                21455,
                21634
            ],
            [
                21634,
                21730
            ],
            [
                21730,
                21749
            ],
            [
                21749,
                21801
            ],
            [
                21801,
                21981
            ],
            [
                21981,
                22053
            ],
            [
                22053,
                22164
            ],
            [
                22164,
                22321
            ],
            [
                22321,
                22729
            ],
            [
                22729,
                22779
            ],
            [
                22779,
                22916
            ],
            [
                22916,
                23011
            ],
            [
                23011,
                23185
            ],
            [
                23185,
                23235
            ],
            [
                23235,
                23266
            ],
            [
                23266,
                23281
            ],
            [
                23281,
                23293
            ],
            [
                23293,
                23306
            ],
            [
                23306,
                23314
            ],
            [
                23314,
                23327
            ],
            [
                23327,
                23331
            ],
            [
                23331,
                23348
            ],
            [
                23348,
                23438
            ],
            [
                23438,
                23638
            ],
            [
                23638,
                23730
            ],
            [
                23730,
                23763
            ],
            [
                23763,
                24296
            ],
            [
                24296,
                24359
            ],
            [
                24359,
                24545
            ],
            [
                24545,
                24664
            ],
            [
                24664,
                24889
            ],
            [
                24889,
                24951
            ],
            [
                24951,
                24987
            ],
            [
                24987,
                25104
            ],
            [
                25104,
                25231
            ],
            [
                25231,
                25293
            ],
            [
                25293,
                25331
            ],
            [
                25331,
                25366
            ],
            [
                25366,
                25392
            ],
            [
                25392,
                25419
            ],
            [
                25419,
                25470
            ],
            [
                25470,
                25505
            ],
            [
                25505,
                25637
            ],
            [
                25637,
                25708
            ],
            [
                25708,
                25774
            ],
            [
                25774,
                25783
            ],
            [
                25783,
                25842
            ],
            [
                25842,
                25846
            ],
            [
                25846,
                25923
            ],
            [
                25923,
                25941
            ],
            [
                25941,
                25975
            ],
            [
                25975,
                26058
            ],
            [
                26058,
                26204
            ],
            [
                26204,
                26487
            ],
            [
                26487,
                26786
            ],
            [
                26786,
                26852
            ],
            [
                26852,
                27049
            ],
            [
                27049,
                27365
            ],
            [
                27365,
                27550
            ],
            [
                27550,
                27695
            ],
            [
                27695,
                28029
            ],
            [
                28029,
                28257
            ],
            [
                28257,
                28535
            ],
            [
                28535,
                28714
            ],
            [
                28714,
                28889
            ],
            [
                28889,
                29179
            ],
            [
                29179,
                29501
            ],
            [
                29501,
                29651
            ],
            [
                29651,
                29784
            ],
            [
                29784,
                29960
            ],
            [
                29960,
                29985
            ],
            [
                29985,
                30093
            ],
            [
                30093,
                30315
            ],
            [
                30315,
                30491
            ],
            [
                30491,
                30550
            ],
            [
                30550,
                30705
            ],
            [
                30705,
                30854
            ],
            [
                30854,
                31014
            ],
            [
                31014,
                31270
            ],
            [
                31270,
                31418
            ],
            [
                31418,
                31431
            ],
            [
                31431,
                31445
            ],
            [
                31445,
                31500
            ],
            [
                31500,
                31538
            ],
            [
                31538,
                31553
            ],
            [
                31553,
                31738
            ],
            [
                31738,
                31754
            ],
            [
                31754,
                31819
            ],
            [
                31819,
                31951
            ],
            [
                31951,
                32067
            ],
            [
                32067,
                32127
            ],
            [
                32127,
                32150
            ],
            [
                32150,
                32193
            ],
            [
                32193,
                32206
            ],
            [
                32206,
                32338
            ],
            [
                32338,
                32401
            ],
            [
                32401,
                32463
            ],
            [
                32463,
                32503
            ],
            [
                32503,
                32542
            ],
            [
                32542,
                32642
            ],
            [
                32642,
                32699
            ],
            [
                32699,
                32915
            ],
            [
                32915,
                32992
            ],
            [
                32992,
                33048
            ],
            [
                33048,
                33191
            ],
            [
                33191,
                33384
            ],
            [
                33384,
                33558
            ],
            [
                33558,
                33630
            ],
            [
                33630,
                33669
            ],
            [
                33669,
                33681
            ],
            [
                33681,
                33746
            ],
            [
                33746,
                33795
            ],
            [
                33795,
                33845
            ],
            [
                33845,
                33879
            ],
            [
                33879,
                33961
            ],
            [
                33961,
                34014
            ],
            [
                34014,
                34098
            ],
            [
                34098,
                34156
            ],
            [
                34156,
                34258
            ],
            [
                34258,
                34273
            ],
            [
                34273,
                34288
            ],
            [
                34288,
                34305
            ],
            [
                34305,
                34337
            ],
            [
                34337,
                34417
            ],
            [
                34417,
                34460
            ]
        ],
        "overlap_chars": [
            [
                0,
                22
            ],
            [
                29,
                71
            ],
            [
                77,
                91
            ],
            [
                132,
                139
            ],
            [
                109,
                116
            ],
            [
                144,
                179
            ],
            [
                179,
                220
            ],
            [
                273,
                286
            ],
            [
                262,
                263
            ],
            [
                293,
                346
            ],
            [
                357,
                364
            ],
            [
                391,
                436
            ],
            [
                436,
                467
            ],
            [
                505,
                506
            ],
            [
                529,
                539
            ],
            [
                468,
                505
            ],
            [
                577,
                579
            ],
            [
                579,
                612
            ],
            [
                629,
                632
            ],
            [
                640,
                646
            ],
            [
                613,
                628
            ],
            [
                679,
                681
            ],
            [
                681,
                713
            ],
            [
                719,
                720
            ],
            [
                810,
                819
            ],
            [
                733,
                741
            ],
            [
                840,
                861
            ],
            [
                861,
                913
            ],
            [
                922,
                925
            ],
            [
                925,
                936
            ],
            [
                940,
                975
            ],
            [
                1012,
                1019
            ],
            [
                990,
                999
            ],
            [
                1023,
                1039
            ],
            [
                1039,
                1061
            ],
            [
                1061,
                1086
            ],
            [
                1086,
                1112
            ],
            [
                1154,
                1178
            ],
            [
                1240,
                1250
            ],
            [
                1252,
                1277
            ],
            [
                1277,
                1295
            ],
            [
                1295,
                1308
            ],
            [
                1314,
                1366
            ],
            [
                1366,
                1397
            ],
            [
                1397,
                1403
            ],
            [
                1403,
                1493
            ],
            [
                1493,
                1517
            ],
            [
                1542,
                1546
            ],
            [
                1606,
                1609
            ],
            [
                1609,
                1651
            ],
            [
                1662,
                1674
            ],
            [
                1674,
                1718
            ],
            [
                1746,
                1759
            ],
            [
                1759,
                1771
            ],
            [
                1807,
                1819
            ],
            [
                1819,
                1864
            ],
            [
                1864,
                1888
            ],
            [
                1888,
                1906
            ],
            [
                1906,
                1974
            ],
            [
                2181,
                2189
            ],
            [
                2202,
                2279
            ],
            [
                2281,
                2305
            ],
            [
                2307,
                2326
            ],
            [
                2352,
                2362
            ],
            [
                2382,
                2419
            ],
            [
                2433,
                2495
            ],
            [
                2950,
                2988
            ],
            [
                2988,
                2996
            ],
            [
                2996,
                3076
            ],
            [
                3076,
                3108
            ],
            [
                3112,
                3114
            ],
            [
                3114,
                3178
            ],
            [
                3178,
                3198
            ],
            [
                3209,
                3223
            ],
            [
                3224,
                3260
            ],
            [
                3298,
                3300
            ],
            [
                3300,
                3324
            ],
            [
                3324,
                3326
            ],
            [
                3326,
                3359
            ],
            [
                3484,
                3533
            ],
            [
                3533,
                3548
            ],
            [
                3567,
                3568
            ],
            [
                3574,
                3614
            ],
            [
                3614,
                3648
            ],
            [
                3734,
                3789
            ],
            [
                3790,
                3816
            ],
            [
                3858,
                3864
            ],
            [
                3870,
                3918
            ],
            [
                3942,
                3976
            ],
            [
                3931,
                3935
            ],
            [
                3922,
                3930
            ],
            [
                3976,
                4000
            ],
            [
                4010,
                4044
            ],
            [
                4067,
                4090
            ],
            [
                4128,
                4130
            ],
            [
                4148,
                4174
            ],
            [
                4146,
                4147
            ],
            [
                4184,
                4194
            ],
            [
                4194,
                4258
            ],
            [
                4258,
                4275
            ],
            [
                4286,
                4300
            ],
            [
                4345,
                4371
            ],
            [
                4380,
                4382
            ],
            [
                4491,
                4494
            ],
            [
                4478,
                4484
            ],
            [
                4495,
                4528
            ],
            [
                4547,
                4601
            ],
            [
                4615,
                4680
            ],
            [
                4698,
                4700
            ],
            [
                4700,
                4741
            ],
            [
                4748,
                4758
            ],
            [
                5016,
                5018
            ],
            [
                5018,
                5045
            ],
            [
                5070,
                5104
            ],
            [
                5104,
                5132
            ],
            [
                5139,
                5151
            ],
            [
                5156,
                5204
            ],
            [
                5235,
                5343
            ],
            [
                5387,
                5450
            ],
            [
                5613,
                5615
            ],
            [
                5615,
                5641
            ],
            [
                5674,
                5683
            ],
            [
                5805,
                5807
            ],
            [
                5807,
                5879
            ],
            [
                5880,
                5892
            ],
            [
                5892,
                5954
            ],
            [
                5963,
                5971
            ],
            [
                5971,
                6006
            ],
            [
                6006,
                6101
            ],
            [
                6112,
                6126
            ],
            [
                6130,
                6149
            ],
            [
                6183,
                6210
            ],
            [
                6210,
                6231
            ],
            [
                6255,
                6321
            ],
            [
                6359,
                6361
            ],
            [
                6361,
                6370
            ],
            [
                6398,
                6418
            ],
            [
                6421,
                6442
            ],
            [
                6442,
                6498
            ],
            [
                6539,
                6541
            ],
            [
                6541,
                6641
            ],
            [
                6715,
                6728
            ],
            [
                6756,
                6758
            ],
            [
                6758,
                6843
            ],
            [
                6847,
                6860
            ],
            [
                6860,
                6901
            ],
            [
                6901,
                6954
            ],
            [
                6988,
                7037
            ],
            [
                7037,
                7066
            ],
            [
                7066,
                7081
            ],
            [
                7081,
                7088
            ],
            [
                7088,
                7105
            ],
            [
                7105,
                7170
            ],
            [
                7170,
                7180
            ],
            [
                7202,
                7204
            ],
            [
                7233,
                7261
            ],
            [
                7261,
                7293
            ],
            [
                7297,
                7323
            ],
            [
                7343,
                7345
            ],
            [
                7345,
                7376
            ],
            [
                7388,
                7392
            ],
            [
                7393,
                7429
            ],
            [
                7450,
                7472
            ],
            [
                7472,
                7481
            ],
            [
                7481,
                7497
            ],
            [
                7508,
                7509
            ],
            [
                7514,
                7526
            ],
            [
                7498,
                7508
            ],
            [
                7571,
                7573
            ],
            [
                7573,
                7607
            ],
            [
                7607,
                7635
            ],
            [
                7645,
                7648
            ],
            [
                7654,
                7694
            ],
            [
                7694,
                7711
            ],
            [
                7767,
                7833
            ],
            [
                7847,
                7866
            ],
            [
                7839,
                7846
            ],
            [
                7870,
                7881
            ],
            [
                7887,
                7893
            ],
            [
                8009,
                8018
            ],
            [
                8018,
                8032
            ],
            [
                8046,
                8080
            ],
            [
                8080,
                8109
            ],
            [
                8151,
                8182
            ],
            [
                8182,
                8188
            ],
            [
                8188,
                8206
            ],
            [
                8206,
                8233
            ],
            [
                8233,
                8285
            ],
            [
                8285,
                8304
            ],
            [
                8313,
                8316
            ],
            [
                8316,
                8363
            ],
            [
                8369,
                8395
            ],
            [
                8404,
                8491
            ],
            [
                8491,
                8515
            ],
            [
                8526,
                8527
            ],
            [
                8543,
                8557
            ],
            [
                8536,
                8537
            ],
            [
                8559,
                8571
            ],
            [
                8521,
                8524
            ],
            [
                8600,
                8604
            ],
            [
                8606,
                8631
            ],
            [
                8631,
                8650
            ],
            [
                8650,
                8711
            ],
            [
                8711,
                8739
            ],
            [
                8746,
                8748
            ],
            [
                8748,
                8763
            ],
            [
                8763,
                8798
            ],
            [
                8881,
                8883
            ],
            [
                8889,
                8903
            ],
            [
                8920,
                8928
            ],
            [
                8904,
                8919
            ],
            [
                8951,
                8964
            ],
            [
                8965,
                8977
            ],
            [
                8977,
                9009
            ],
            [
                9009,
                9018
            ],
            [
                9018,
                9019
            ],
            [
                9038,
                9060
            ],
            [
                9089,
                9091
            ],
            [
                9091,
                9114
            ],
            [
                9197,
                9231
            ],
            [
                9302,
                9304
            ],
            [
                9304,
                9362
            ],
            [
                9407,
                9408
            ],
            [
                9394,
                9398
            ],
            [
                9402,
                9405
            ],
            [
                9436,
                9438
            ],
            [
                9541,
                9569
            ],
            [
                9595,
                9693
            ],
            [
                9693,
                9719
            ],
            [
                9762,
                9793
            ],
            [
                9793,
                9825
            ],
            [
                9825,
                9870
            ],
            [
                9889,
                9915
            ],
            [
                9915,
                9917
            ],
            [
                9918,
                9922
            ],
            [
                9930,
                9937
            ],
            [
                9952,
                10001
            ],
            [
                10060,
                10132
            ],
            [
                10139,
                10160
            ],
            [
                10165,
                10167
            ],
            [
                10176,
                10192
            ],
            [
                10255,
                10368
            ],
            [
                10392,
                10394
            ],
            [
                10394,
                10400
            ],
            [
                10400,
                10414
            ],
            [
                10419,
                10422
            ],
            [
                10422,
                10468
            ],
            [
                10548,
                10550
            ],
            [
                10915,
                10918
            ],
            [
                10824,
                10892
            ],
            [
                11031,
                11092
            ],
            [
                11099,
                11119
            ],
            [
                11140,
                11241
            ],
            [
                10923,
                10924
            ],
            [
                11270,
                11277
            ],
            [
                11290,
                11317
            ],
            [
                11366,
                11416
            ],
            [
                11363,
                11366
            ],
            [
                11433,
                11483
            ],
            [
                11491,
                11494
            ],
            [
                11494,
                11518
            ],
            [
                11545,
                11563
            ],
            [
                11568,
                11583
            ],
            [
                11616,
                11651
            ],
            [
                11651,
                11652
            ],
            [
                11714,
                11730
            ],
            [
                11681,
                11685
            ],
            [
                11697,
                11707
            ],
            [
                11710,
                11713
            ],
            [
                11657,
                11659
            ],
            [
                11736,
                11742
            ],
            [
                11749,
                11767
            ],
            [
                11767,
                11777
            ],
            [
                11814,
                11914
            ],
            [
                11914,
                11930
            ],
            [
                12012,
                12070
            ],
            [
                12070,
                12098
            ],
            [
                12161,
                12163
            ],
            [
                12163,
                12224
            ],
            [
                12224,
                12231
            ],
            [
                12328,
                12365
            ],
            [
                12371,
                12413
            ],
            [
                12413,
                12529
            ],
            [
                12529,
                12664
            ],
            [
                12664,
                12700
            ],
            [
                12800,
                12831
            ],
            [
                12831,
                12863
            ],
            [
                12864,
                12872
            ],
            [
                12900,
                12923
            ],
            [
                12923,
                12996
            ],
            [
                12996,
                13040
            ],
            [
                13040,
                13057
            ],
            [
                13057,
                13096
            ],
            [
                13096,
                13097
            ],
            [
                13161,
                13203
            ],
            [
                13263,
                13289
            ],
            [
                13290,
                13355
            ],
            [
                13355,
                13384
            ],
            [
                13384,
                13426
            ],
            [
                13489,
                13492
            ],
            [
                13507,
                13531
            ],
            [
                13535,
                13538
            ],
            [
                13595,
                13624
            ],
            [
                13752,
                13772
            ],
            [
                13776,
                13799
            ],
            [
                13750,
                13751
            ],
            [
                13708,
                13710
            ],
            [
                13830,
                13835
            ],
            [
                13801,
                13821
            ],
            [
                13908,
                13910
            ],
            [
                13910,
                13989
            ],
            [
                14099,
                14155
            ],
            [
                14155,
                14251
            ],
            [
                14256,
                14336
            ],
            [
                14336,
                14357
            ],
            [
                14367,
                14387
            ],
            [
                14387,
                14552
            ],
            [
                14552,
                14631
            ],
            [
                14671,
                14673
            ],
            [
                14673,
                14700
            ],
            [
                14700,
                14750
            ],
            [
                14750,
                14770
            ],
            [
                14770,
                14808
            ],
            [
                14808,
                14856
            ],
            [
                14868,
                14882
            ],
            [
                14914,
                14917
            ],
            [
                15015,
                15040
            ],
            [
                15040,
                15058
            ],
            [
                15067,
                15085
            ],
            [
                15085,
                15097
            ],
            [
                15102,
                15111
            ],
            [
                15126,
                15151
            ],
            [
                15209,
                15211
            ],
            [
                15156,
                15181
            ],
            [
                15223,
                15225
            ],
            [
                15225,
                15252
            ],
            [
                15253,
                15261
            ],
            [
                15274,
                15297
            ],
            [
                15297,
                15329
            ],
            [
                15385,
                15455
            ],
            [
                15455,
                15502
            ],
            [
                15541,
                15577
            ],
            [
                15636,
                15657
            ],
            [
                15657,
                15686
            ],
            [
                15686,
                15705
            ],
            [
                15705,
                15815
            ],
            [
                15873,
                15930
            ],
            [
                16039,
                16120
            ],
            [
                16131,
                16140
            ],
            [
                16185,
                16252
            ],
            [
                16252,
                16348
            ],
            [
                16360,
                16366
            ],
            [
                16393,
                16399
            ],
            [
                16418,
                16452
            ],
            [
                16679,
                16716
            ],
            [
                16772,
                16835
            ],
            [
                16835,
                16890
            ],
            [
                16912,
                16939
            ],
            [
                16939,
                17061
            ],
            [
                18107,
                18127
            ],
            [
                18147,
                18172
            ],
            [
                18172,
                18303
            ],
            [
                18303,
                18360
            ],
            [
                18367,
                18372
            ],
            [
                18361,
                18366
            ],
            [
                18372,
                18375
            ],
            [
                18375,
                18445
            ],
            [
                18445,
                18446
            ],
            [
                18677,
                18694
            ],
            [
                18469,
                18471
            ],
            [
                18481,
                18493
            ],
            [
                18509,
                18510
            ],
            [
                18696,
                18699
            ],
            [
                18592,
                18594
            ],
            [
                18700,
                18754
            ],
            [
                18754,
                18852
            ],
            [
                18891,
                18893
            ],
            [
                18893,
                18909
            ],
            [
                18909,
                18915
            ],
            [
                18915,
                18975
            ],
            [
                18992,
                18994
            ],
            [
                19061,
                19104
            ],
            [
                19155,
                19213
            ],
            [
                19213,
                19242
            ],
            [
                19260,
                19273
            ],
            [
                19273,
                19287
            ],
            [
                19287,
                19308
            ],
            [
                19310,
                19313
            ],
            [
                19331,
                19339
            ],
            [
                19999,
                20062
            ],
            [
                20068,
                20069
            ],
            [
                20111,
                20133
            ],
            [
                20138,
                20155
            ],
            [
                20246,
                20248
            ],
            [
                20248,
                20260
            ],
            [
                20312,
                20328
            ],
            [
                20297,
                20300
            ],
            [
                20329,
                20360
            ],
            [
                20366,
                20381
            ],
            [
                20398,
                20448
            ],
            [
                20448,
                20493
            ],
            [
                20567,
                20599
            ],
            [
                20635,
                20642
            ],
            [
                20671,
                20798
            ],
            [
                20799,
                20859
            ],
            [
                21019,
                21020
            ],
            [
                20860,
                20863
            ],
            [
                20887,
                20956
            ],
            [
                20969,
                20972
            ],
            [
                20873,
                20875
            ],
            [
                21005,
                21019
            ],
            [
                21029,
                21035
            ],
            [
                21047,
                21064
            ],
            [
                20884,
                20886
            ],
            [
                21064,
                21066
            ],
            [
                21066,
                21107
            ],
            [
                21116,
                21153
            ],
            [
                21109,
                21111
            ],
            [
                21193,
                21202
            ],
            [
                21175,
                21177
            ],
            [
                21217,
                21224
            ],
            [
                21261,
                21391
            ],
            [
                21420,
                21455
            ],
            [
                21455,
                21498
            ],
            [
                21604,
                21608
            ],
            [
                21518,
                21536
            ],
            [
                21613,
                21634
            ],
            [
                21634,
                21687
            ],
            [
                21692,
                21730
            ],
            [
                21749,
                21800
            ],
            [
                21801,
                21850
            ],
            [
                22016,
                22053
            ],
            [
                22070,
                22075
            ],
            [
                22057,
                22065
            ],
            [
                22115,
                22119
            ],
            [
                22120,
                22131
            ],
            [
                22135,
                22164
            ],
            [
                22164,
                22220
            ],
            [
                22233,
                22236
            ],
            [
                22241,
                22261
            ],
            [
                22311,
                22312
            ],
            [
                22729,
                22779
            ],
            [
                22779,
                22872
            ],
            [
                22878,
                22916
            ],
            [
                22916,
                22943
            ],
            [
                22949,
                22967
            ],
            [
                22977,
                23011
            ],
            [
                23011,
                23080
            ],
            [
                23135,
                23167
            ],
            [
                23183,
                23185
            ],
            [
                23185,
                23235
            ],
            [
                23235,
                23266
            ],
            [
                23266,
                23281
            ],
            [
                23281,
                23293
            ],
            [
                23293,
                23304
            ],
            [
                23306,
                23314
            ],
            [
                23314,
                23327
            ],
            [
                23327,
                23331
            ],
            [
                23331,
                23348
            ],
            [
                23348,
                23412
            ],
            [
                23427,
                23429
            ],
            [
                23436,
                23438
            ],
            [
                23518,
                23573
            ],
            [
                23442,
                23446
            ],
            [
                23574,
                23592
            ],
            [
                23611,
                23638
            ],
            [
                23638,
                23730
            ],
            [
                23730,
                23737
            ],
            [
                23750,
                23762
            ],
            [
                23803,
                23893
            ],
            [
                23965,
                23992
            ],
            [
                24004,
                24202
            ],
            [
                24215,
                24220
            ],
            [
                24229,
                24246
            ],
            [
                24277,
                24296
            ],
            [
                24296,
                24327
            ],
            [
                24357,
                24359
            ],
            [
                24359,
                24379
            ],
            [
                24390,
                24416
            ],
            [
                24461,
                24464
            ],
            [
                24417,
                24430
            ],
            [
                24470,
                24545
            ],
            [
                24592,
                24601
            ],
            [
                24609,
                24628
            ],
            [
                24638,
                24664
            ],
            [
                24664,
                24679
            ],
            [
                24711,
                24791
            ],
            [
                24808,
                24831
            ],
            [
                24866,
                24872
            ],
            [
                24887,
                24888
            ],
            [
                24951,
                24987
            ],
            [
                25006,
                25008
            ],
            [
                24992,
                24995
            ],
            [
                25016,
                25030
            ],
            [
                25036,
                25052
            ],
            [
                25058,
                25104
            ],
            [
                25104,
                25118
            ],
            [
                25126,
                25150
            ],
            [
                25165,
                25188
            ],
            [
                25122,
                25125
            ],
            [
                25203,
                25231
            ],
            [
                25231,
                25293
            ],
            [
                25293,
                25320
            ],
            [
                25324,
                25331
            ],
            [
                25331,
                25366
            ],
            [
                25366,
                25392
            ],
            [
                25392,
                25419
            ],
            [
                25470,
                25486
            ],
            [
                25487,
                25505
            ],
            [
                25505,
                25559
            ],
            [
                25577,
                25637
            ],
            [
                25637,
                25671
            ],
            [
                25712,
                25738
            ],
            [
                25706,
                25708
            ],
            [
                25744,
                25774
            ],
            [
                25774,
                25783
            ],
            [
                25783,
                25842
            ],
            [
                25842,
                25846
            ],
            [
                25846,
                25923
            ],
            [
                25923,
                25941
            ],
            [
                25941,
                25973
            ],
            [
                25973,
                25975
            ],
            [
                25975,
                26035
            ],
            [
                26044,
                26058
            ],
            [
                26058,
                26076
            ],
            [
                26095,
                26156
            ],
            [
                26171,
                26174
            ],
            [
                26182,
                26204
            ],
            [
                26204,
                26212
            ],
            [
                26217,
                26381
            ],
            [
                26382,
                26416
            ],
            [
                26450,
                26486
            ],
            [
                26487,
                26525
            ],
            [
                26570,
                26625
            ],
            [
                26656,
                26761
            ],
            [
                26773,
                26786
            ],
            [
                26786,
                26852
            ],
            [
                26852,
                26962
            ],
            [
                27012,
                27049
            ],
            [
                27085,
                27088
            ],
            [
                27103,
                27130
            ],
            [
                27136,
                27170
            ],
            [
                27230,
                27352
            ],
            [
                27363,
                27365
            ],
            [
                27383,
                27463
            ],
            [
                27548,
                27550
            ],
            [
                27559,
                27670
            ],
            [
                27680,
                27695
            ],
            [
                27695,
                27732
            ],
            [
                27773,
                27777
            ],
            [
                27783,
                27797
            ],
            [
                27809,
                27836
            ],
            [
                27894,
                27896
            ],
            [
                27906,
                27914
            ],
            [
                27916,
                28029
            ],
            [
                28029,
                28140
            ],
            [
                28186,
                28206
            ],
            [
                28230,
                28257
            ],
            [
                28257,
                28283
            ],
            [
                28407,
                28416
            ],
            [
                28480,
                28517
            ],
            [
                28327,
                28344
            ],
            [
                28345,
                28356
            ],
            [
                28357,
                28372
            ],
            [
                28533,
                28535
            ],
            [
                28535,
                28644
            ],
            [
                28667,
                28689
            ],
            [
                28704,
                28714
            ],
            [
                28714,
                28780
            ],
            [
                28806,
                28830
            ],
            [
                28887,
                28889
            ],
            [
                28976,
                28979
            ],
            [
                28912,
                28950
            ],
            [
                29053,
                29056
            ],
            [
                28951,
                28964
            ],
            [
                28986,
                29000
            ],
            [
                29177,
                29179
            ],
            [
                29651,
                29654
            ],
            [
                29736,
                29739
            ],
            [
                29740,
                29744
            ],
            [
                29749,
                29765
            ],
            [
                29782,
                29783
            ],
            [
                29960,
                29985
            ],
            [
                29985,
                30040
            ],
            [
                30069,
                30093
            ],
            [
                30234,
                30238
            ],
            [
                30206,
                30214
            ],
            [
                30097,
                30106
            ],
            [
                30173,
                30183
            ],
            [
                30127,
                30128
            ],
            [
                30259,
                30315
            ],
            [
                30315,
                30472
            ],
            [
                30489,
                30491
            ],
            [
                30491,
                30550
            ],
            [
                30574,
                30602
            ],
            [
                30634,
                30640
            ],
            [
                30608,
                30620
            ],
            [
                30641,
                30705
            ],
            [
                30798,
                30836
            ],
            [
                30847,
                30853
            ],
            [
                30854,
                30973
            ],
            [
                31012,
                31014
            ],
            [
                31014,
                31019
            ],
            [
                31057,
                31132
            ],
            [
                31160,
                31190
            ],
            [
                31192,
                31270
            ],
            [
                31270,
                31339
            ],
            [
                31357,
                31418
            ],
            [
                31418,
                31431
            ],
            [
                31431,
                31445
            ],
            [
                31445,
                31500
            ],
            [
                31500,
                31538
            ],
            [
                31538,
                31553
            ],
            [
                31553,
                31556
            ],
            [
                31594,
                31597
            ],
            [
                31567,
                31576
            ],
            [
                31611,
                31649
            ],
            [
                31679,
                31738
            ],
            [
                31738,
                31753
            ],
            [
                31819,
                31841
            ],
            [
                31884,
                31920
            ],
            [
                31940,
                31951
            ],
            [
                31951,
                32067
            ],
            [
                32067,
                32127
            ],
            [
                32127,
                32139
            ],
            [
                32148,
                32150
            ],
            [
                32323,
                32338
            ],
            [
                32338,
                32401
            ],
            [
                32401,
                32463
            ],
            [
                32463,
                32503
            ],
            [
                32503,
                32542
            ],
            [
                32542,
                32566
            ],
            [
                32576,
                32639
            ],
            [
                32704,
                32776
            ],
            [
                32783,
                32807
            ],
            [
                32816,
                32865
            ],
            [
                32913,
                32915
            ],
            [
                32915,
                32989
            ],
            [
                32989,
                32992
            ],
            [
                32992,
                33048
            ],
            [
                33048,
                33085
            ],
            [
                33100,
                33103
            ],
            [
                33118,
                33120
            ],
            [
                33148,
                33182
            ],
            [
                33186,
                33191
            ],
            [
                33191,
                33384
            ],
            [
                33384,
                33428
            ],
            [
                33449,
                33521
            ],
            [
                33527,
                33532
            ],
            [
                33540,
                33558
            ],
            [
                33558,
                33565
            ],
            [
                33570,
                33630
            ],
            [
                33961,
                33996
            ],
            [
                34001,
                34014
            ],
            [
                34014,
                34098
            ],
            [
                34098,
                34141
            ],
            [
                34154,
                34156
            ],
            [
                34156,
                34182
            ],
            [
                34187,
                34191
            ],
            [
                34242,
                34258
            ],
            [
                34258,
                34271
            ],
            [
                34288,
                34305
            ],
            [
                34305,
                34337
            ],
            [
                34337,
                34344
            ],
            [
                34354,
                34417
            ],
            [
                34417,
                34460
            ]
        ],
        "row_chars": [
            [
                0,
                179
            ],
            [
                179,
                436
            ],
            [
                436,
                579
            ],
            [
                579,
                681
            ],
            [
                681,
                861
            ],
            [
                861,
                925
            ],
            [
                925,
                1039
            ],
            [
                1039,
                1061
            ],
            [
                1061,
                1086
            ],
            [
                1086,
                1277
            ],
            [
                1277,
                1295
            ],
            [
                1295,
                1366
            ],
            [
                1366,
                1397
            ],
            [
                1397,
                1403
            ],
            [
                1403,
                1493
            ],
            [
                1493,
                1609
            ],
            [
                1609,
                1674
            ],
            [
                1674,
                1759
            ],
            [
                1759,
                1819
            ],
            [
                1819,
                1864
            ],
            [
                1864,
                1888
            ],
            [
                1888,
                1906
            ],
            [
                1906,
                1977
            ],
            [
                1977,
                2022
            ],
            [
                2022,
                2035
            ],
            [
                2035,
                2180
            ],
            [
                2180,
                2326
            ],
            [
                2326,
                2352
            ],
            [
                2352,
                2495
            ],
            [
                2495,
                2530
            ],
            [
                2530,
                2543
            ],
            [
                2543,
                2557
            ],
            [
                2557,
                2577
            ],
            [
                2577,
                2707
            ],
            [
                2707,
                2950
            ],
            [
                2950,
                2988
            ],
            [
                2988,
                2996
            ],
            [
                2996,
                3076
            ],
            [
                3076,
                3114
            ],
            [
                3114,
                3178
            ],
            [
                3178,
                3300
            ],
            [
                3300,
                3326
            ],
            [
                3326,
                3360
            ],
            [
                3360,
                3484
            ],
            [
                3484,
                3533
            ],
            [
                3533,
                3614
            ],
            [
                3614,
                3790
            ],
            [
                3790,
                3918
            ],
            [
                3918,
                4130
            ],
            [
                4130,
                4194
            ],
            [
                4194,
                4258
            ],
            [
                4258,
                4382
            ],
            [
                4382,
                4478
            ],
            [
                4478,
                4700
            ],
            [
                4700,
                5018
            ],
            [
                5018,
                5104
            ],
            [
                5104,
                5343
            ],
            [
                5343,
                5387
            ],
            [
                5387,
                5615
            ],
            [
                5615,
                5807
            ],
            [
                5807,
                5892
            ],
            [
                5892,
                5971
            ],
            [
                5971,
                6006
            ],
            [
                6006,
                6210
            ],
            [
                6210,
                6361
            ],
            [
                6361,
                6442
            ],
            [
                6442,
                6541
            ],
            [
                6541,
                6642
            ],
            [
                6642,
                6758
            ],
            [
                6758,
                6860
            ],
            [
                6860,
                6901
            ],
            [
                6901,
                7037
            ],
            [
                7037,
                7066
            ],
            [
                7066,
                7081
            ],
            [
                7081,
                7088
            ],
            [
                7088,
                7105
            ],
            [
                7105,
                7170
            ],
            [
                7170,
                7204
            ],
            [
                7204,
                7233
            ],
            [
                7233,
                7261
            ],
            [
                7261,
                7345
            ],
            [
                7345,
                7429
            ],
            [
                7429,
                7450
            ],
            [
                7450,
                7472
            ],
            [
                7472,
                7481
            ],
            [
                7481,
                7573
            ],
            [
                7573,
                7607
            ],
            [
                7607,
                7694
            ],
            [
                7694,
                7894
            ],
            [
                7894,
                8009
            ],
            [
                8009,
                8018
            ],
            [
                8018,
                8032
            ],
            [
                8032,
                8046
            ],
            [
                8046,
                8080
            ],
            [
                8080,
                8182
            ],
            [
                8182,
                8188
            ],
            [
                8188,
                8206
            ],
            [
                8206,
                8233
            ],
            [
                8233,
                8285
            ],
            [
                8285,
                8316
            ],
            [
                8316,
                8491
            ],
            [
                8491,
                8606
            ],
            [
                8606,
                8631
            ],
            [
                8631,
                8650
            ],
            [
                8650,
                8711
            ],
            [
                8711,
                8748
            ],
            [
                8748,
                8763
            ],
            [
                8763,
                8799
            ],
            [
                8799,
                8881
            ],
            [
                8881,
                8977
            ],
            [
                8977,
                9009
            ],
            [
                9009,
                9018
            ],
            [
                9018,
                9091
            ],
            [
                9091,
                9117
            ],
            [
                9117,
                9138
            ],
            [
                9138,
                9147
            ],
            [
                9147,
                9196
            ],
            [
                9196,
                9304
            ],
            [
                9304,
                9438
            ],
            [
                9438,
                9541
            ],
            [
                9541,
                9569
            ],
            [
                9569,
                9595
            ],
            [
                9595,
                9693
            ],
            [
                9693,
                9719
            ],
            [
                9719,
                9762
            ],
            [
                9762,
                9793
            ],
            [
                9793,
                9825
            ],
            [
                9825,
                9915
            ],
            [
                9915,
                10001
            ],
            [
                10001,
                10060
            ],
            [
                10060,
                10394
            ],
            [
                10394,
                10400
            ],
            [
                10400,
                10422
            ],
            [
                10422,
                10550
            ],
            [
                10550,
                10685
            ],
            [
                10685,
                10813
            ],
            [
                10813,
                11270
            ],
            [
                11270,
                11494
            ],
            [
                11494,
                11651
            ],
            [
                11651,
                11736
            ],
            [
                11736,
                11767
            ],
            [
                11767,
                11914
            ],
            [
                11914,
                12070
            ],
            [
                12070,
                12163
            ],
            [
                12163,
                12224
            ],
            [
                12224,
                12413
            ],
            [
                12413,
                12529
            ],
            [
                12529,
                12664
            ],
            [
                12664,
                12831
            ],
            [
                12831,
                12923
            ],
            [
                12923,
                12996
            ],
            [
                12996,
                13040
            ],
            [
                13040,
                13057
            ],
            [
                13057,
                13096
            ],
            [
                13096,
                13205
            ],
            [
                13205,
                13263
            ],
            [
                13263,
                13355
            ],
            [
                13355,
                13384
            ],
            [
                13384,
                13426
            ],
            [
                13426,
                13489
            ],
            [
                13489,
                13624
            ],
            [
                13624,
                13672
            ],
            [
                13672,
                13695
            ],
            [
                13695,
                13910
            ],
            [
                13910,
                14155
            ],
            [
                14155,
                14336
            ],
            [
                14336,
                14387
            ],
            [
                14387,
                14552
            ],
            [
                14552,
                14673
            ],
            [
                14673,
                14700
            ],
            [
                14700,
                14750
            ],
            [
                14750,
                14770
            ],
            [
                14770,
                14808
            ],
            [
                14808,
                14882
            ],
            [
                14882,
                14914
            ],
            [
                14914,
                15040
            ],
            [
                15040,
                15085
            ],
            [
                15085,
                15225
            ],
            [
                15225,
                15297
            ],
            [
                15297,
                15455
            ],
            [
                15455,
                15502
            ],
            [
                15502,
                15541
            ],
            [
                15541,
                15657
            ],
            [
                15657,
                15686
            ],
            [
                15686,
                15705
            ],
            [
                15705,
                15839
            ],
            [
                15839,
                15873
            ],
            [
                15873,
                16252
            ],
            [
                16252,
                16455
            ],
            [
                16455,
                16560
            ],
            [
                16560,
                16678
            ],
            [
                16678,
                16835
            ],
            [
                16835,
                16939
            ],
            [
                16939,
                17061
            ],
            [
                17061,
                17078
            ],
            [
                17078,
                17097
            ],
            [
                17097,
                17110
            ],
            [
                17110,
                17243
            ],
            [
                17243,
                17360
            ],
            [
                17360,
                17371
            ],
            [
                17371,
                17559
            ],
            [
                17559,
                17812
            ],
            [
                17812,
                18107
            ],
            [
                18107,
                18172
            ],
            [
                18172,
                18303
            ],
            [
                18303,
                18375
            ],
            [
                18375,
                18445
            ],
            [
                18445,
                18754
            ],
            [
                18754,
                18893
            ],
            [
                18893,
                18909
            ],
            [
                18909,
                18915
            ],
            [
                18915,
                18994
            ],
            [
                18994,
                19036
            ],
            [
                19036,
                19061
            ],
            [
                19061,
                19107
            ],
            [
                19107,
                19154
            ],
            [
                19154,
                19213
            ],
            [
                19213,
                19273
            ],
            [
                19273,
                19287
            ],
            [
                19287,
                19339
            ],
            [
                19339,
                19394
            ],
            [
                19394,
                19543
            ],
            [
                19543,
                19672
            ],
            [
                19672,
                19807
            ],
            [
                19807,
                19870
            ],
            [
                19870,
                19999
            ],
            [
                19999,
                20248
            ],
            [
                20248,
                20448
            ],
            [
                20448,
                20635
            ],
            [
                20635,
                20799
            ],
            [
                20799,
                21066
            ],
            [
                21066,
                21224
            ],
            [
                21224,
                21455
            ],
            [
                21455,
                21634
            ],
            [
                21634,
                21730
            ],
            [
                21730,
                21749
            ],
            [
                21749,
                21801
            ],
            [
                21801,
                22053
            ],
            [
                22053,
                22164
            ],
            [
                22164,
                22321
            ],
            [
                22321,
                22729
            ],
            [
                22729,
                22779
            ],
            [
                22779,
                22916
            ],
            [
                22916,
                23011
            ],
            [
                23011,
                23185
            ],
            [
                23185,
                23235
            ],
            [
                23235,
                23266
            ],
            [
                23266,
                23281
            ],
            [
                23281,
                23293
            ],
            [
                23293,
                23306
            ],
            [
                23306,
                23314
            ],
            [
                23314,
                23327
            ],
            [
                23327,
                23331
            ],
            [
                23331,
                23348
            ],
            [
                23348,
                23438
            ],
            [
                23438,
                23638
            ],
            [
                23638,
                23730
            ],
            [
                23730,
                23763
            ],
            [
                23763,
                24296
            ],
            [
                24296,
                24359
            ],
            [
                24359,
                24545
            ],
            [
                24545,
                24664
            ],
            [
                24664,
                24889
            ],
            [
                24889,
                24951
            ],
            [
                24951,
                24987
            ],
            [
                24987,
                25104
            ],
            [
                25104,
                25231
            ],
            [
                25231,
                25293
            ],
            [
                25293,
                25331
            ],
            [
                25331,
                25366
            ],
            [
                25366,
                25392
            ],
            [
                25392,
                25419
            ],
            [
                25419,
                25470
            ],
            [
                25470,
                25505
            ],
            [
                25505,
                25637
            ],
            [
                25637,
                25774
            ],
            [
                25774,
                25783
            ],
            [
                25783,
                25842
            ],
            [
                25842,
                25846
            ],
            [
                25846,
                25923
            ],
            [
                25923,
                25941
            ],
            [
                25941,
                25975
            ],
            [
                25975,
                26058
            ],
            [
                26058,
                26204
            ],
            [
                26204,
                26487
            ],
            [
                26487,
                26786
            ],
            [
                26786,
                26852
            ],
            [
                26852,
                27049
            ],
            [
                27049,
                27365
            ],
            [
                27365,
                27550
            ],
            [
                27550,
                27695
            ],
            [
                27695,
                28029
            ],
            [
                28029,
                28257
            ],
            [
                28257,
                28535
            ],
            [
                28535,
                28714
            ],
            [
                28714,
                28889
            ],
            [
                28889,
                29179
            ],
            [
                29179,
                29501
            ],
            [
                29501,
                29651
            ],
            [
                29651,
                29784
            ],
            [
                29784,
                29960
            ],
            [
                29960,
                29985
            ],
            [
                29985,
                30093
            ],
            [
                30093,
                30315
            ],
            [
                30315,
                30491
            ],
            [
                30491,
                30550
            ],
            [
                30550,
                30705
            ],
            [
                30705,
                30854
            ],
            [
                30854,
                31014
            ],
            [
                31014,
                31270
            ],
            [
                31270,
                31418
            ],
            [
                31418,
                31431
            ],
            [
                31431,
                31445
            ],
            [
                31445,
                31500
            ],
            [
                31500,
                31538
            ],
            [
                31538,
                31553
            ],
            [
                31553,
                31738
            ],
            [
                31738,
                31754
            ],
            [
                31754,
                31819
            ],
            [
                31819,
                31951
            ],
            [
                31951,
                32067
            ],
            [
                32067,
                32127
            ],
            [
                32127,
                32150
            ],
            [
                32150,
                32193
            ],
            [
                32193,
                32206
            ],
            [
                32206,
                32338
            ],
            [
                32338,
                32401
            ],
            [
                32401,
                32463
            ],
            [
                32463,
                32503
            ],
            [
                32503,
                32542
            ],
            [
                32542,
                32642
            ],
            [
                32642,
                32699
            ],
            [
                32699,
                32915
            ],
            [
                32915,
                32992
            ],
            [
                32992,
                33048
            ],
            [
                33048,
                33191
            ],
            [
                33191,
                33384
            ],
            [
                33384,
                33558
            ],
            [
                33558,
                33630
            ],
            [
                33630,
                33669
            ],
            [
                33669,
                33681
            ],
            [
                33681,
                33746
            ],
            [
                33746,
                33795
            ],
            [
                33795,
                33845
            ],
            [
                33845,
                33879
            ],
            [
                33879,
                33961
            ],
            [
                33961,
                34014
            ],
            [
                34014,
                34098
            ],
            [
                34098,
                34156
            ],
            [
                34156,
                34258
            ],
            [
                34258,
                34273
            ],
            [
                34273,
                34288
            ],
            [
                34288,
                34305
            ],
            [
                34305,
                34337
            ],
            [
                34337,
                34417
            ],
            [
                34417,
                34460
            ]
        ]
    },
    "abridged": {
        "text": "I had not been at home many days when one evening I went upstairs to my own room to see how Charley was getting on with her copy-book. Writing was a trying business to Charley, in whose hand a pen appeared to become perversely animated, and to go crooked and sidle into corners like a saddle-donkey. It was very odd to see what old, shrivelled letters Charley's young hand had made. Yet Charley was uncommonly expert and nimble at other things.\n\"Well, Charley,\" said I, looking at a collapsed letter O, \"we are improving. If we only get to make it round, we shall be perfect.\"\nThen I made an O, and Charley made one, and the pen twisted Charley's up into a knot.\n\"Never mind, Charley. We shall do it in time.\"\nCharley laid down her pen, flexed her cramped little hand, and got up and dropped me a curtsy.\n\"Thank you, miss. If you please, did you know a poor person of the name of Jenny?\"\n\"A brickmaker's wife, Charley? Yes.\"\n\"She came and spoke to me when I was out a little while ago, and said you knew her, miss. She asked me if I wasn't your maid.\"\n\"I thought she had left this neighbourhood, Charley.\"\n\"So she had, miss, but she's come back again - she and Liz. Did you know Liz, miss?\"\n\"I think I do, Charley, though not by name.\"\n\"That's what she said!\" returned Charley. \"They have both come back, miss, and have been tramping high and low. And this Jenny came about the house three or four days, hoping to get a glimpse of you, miss - all she wanted, she said - but you were away. Then she saw me,\" said Charley with a short laugh of delight and pride, \"and she thought I looked like your maid!\"\n\"And where did you see her, Charley?\" said I.\nMy little maid's countenance fell as she replied, \"By the doctor's shop, miss.\" For Charley wore her black frock still.\nI asked if the brickmaker's wife were ill, but Charley said no. It was some one else in her cottage, who had tramped down to Saint Albans. A poor boy, Charley said, her eyes filling with tears. No father, no mother, no any one.\n\"And she was getting medicine for him, Charley?\"\n\"She said, miss, that he had once done as much for her.\"\nMy little maid's face was so eager that I had no great difficulty in reading her thoughts.\n\"Well, Charley,\" said I, \"we had better go round to Jenny's and see what's the matter.\"\nCharley brought my bonnet and veil with alacrity, and having dressed me, pinned herself into her warm shawl like a little old woman. Without saying anything to anyone, we went out.\nIt was a cold, wild night, and the trees shuddered in the wind. The rain had been heavy all day, although none was falling just then. The gloomy sky had partly cleared, and in the north-west, where the sun had set, there was a pale dead light both beautiful and awful, with long sullen lines of cloud waved up like a sea stricken immovable. Towards London a lurid glare overhung the dark waste.\nI had no thought that night of what was soon to happen to me. But I have always remembered that when we stopped at the garden-gate to look up at the sky, I had for a moment an undefinable impression of myself as being something different from what I then was. I have ever since connected the feeling with that spot and time.\nIt was Saturday night, and the place was quiet. The kilns were burning, and a stifling vapour set towards us with a pale blue glare.\nWe came to the cottage, where there was a feeble candle in the window. We tapped at the door and went in. The mother of the little child who had died was sitting in a chair on one side of the poor fire; and opposite her, a wretched boy was cowering on the floor. He held under his arm a fragment of a fur cap; and as he tried to warm himself, he shook. The place had an unhealthy and very peculiar smell.\nI had not lifted my veil when I first spoke to the woman on entering. The boy staggered up instantly and stared at me with a remarkable expression of surprise and terror. I stood still.\n\"I won't go no more to the berryin ground,\" muttered the boy; \"I ain't a-going there, I tell you!\"\nI lifted my veil and spoke to the woman. She said to me in a low voice, \"Don't mind him, ma'am,\" and said to him, \"Jo, Jo, what's the matter?\"\n\"I know wot she's come for!\" cried the boy.\n\"Who?\"\n\"The lady there. She's come to get me to go along with her to the berryin ground. I won't go. She might go a-berryin me.\" His shivering came on again, and he leaned against the wall.\n\"He has been talking off and on like this all day, ma'am,\" said Jenny softly. \"This is my lady, Jo.\"\n\"Is it?\" returned the boy, surveying me doubtfully. \"She looks to me the t'other one. It ain't the bonnet, nor yet the gown, but she looks to me the t'other one.\"\nMy little Charley had pulled off her bonnet and shawl and now went quietly up to him and sat him down in a chair like an old nurse.\n\"I say!\" said the boy. \"Ain't the lady the t'other lady?\"\nCharley shook her head as she made him as warm as she could.\n\"Oh!\" the boy muttered. \"Then I s'pose she ain't.\"\n\"I came to see if I could do you any good,\" said I. \"What is the matter?\"\n\"I'm a-being froze,\" returned the boy hoarsely, his haggard gaze wandering, \"and then burnt up, and then froze, and then burnt up, ever so many times in a hour. And my head's all sleepy - and I'm so dry - and my bones is all pain.\"\n\"When did he come here?\" I asked the woman.\n\"This morning, ma'am, I found him at the corner of the town. I had known him up in London. Hadn't I, Jo?\"\n\"Tom-all-Alone's,\" the boy replied. He began to droop and roll his head again, as if he were only half awake.\n\"When did he come from London?\" I asked.\n\"Yes'day,\" said the boy. \"I'm a-going somewheres. I have been moved on, and moved on. Mrs. Snagsby, she's always a-watching, and a-driving of me - they all are. And I'm a-going somewheres. She told me, down in Tom-all-Alone's, as she came from Stolbuns, and so I took the Stolbuns Road. It's as good as another.\"\n\"What is to be done with him?\" said I, taking the woman aside. \"He could not travel in this state even if he knew where he was going!\"\n\"I don't know, ma'am,\" she replied, glancing compassionately at him. \"I've kept him here all day for pity's sake, and I've given him broth and medicine, and Liz has gone to see if anyone will take him in; but I can't keep him long, for if my husband was to come home and find him here, he'd be rough in putting him out. Hark! Here comes Liz!\"\nThe other woman came hurriedly in as she spoke. She had been here and there, and had been played about from hand to hand; one official sent her to another, and the other sent her back to the first, and so on, until it appeared to me as if both must have been appointed for their skill in evading their duties.\nAnd now she said, breathing quickly, \"Jenny, your master's on the road home, and mine too, and the Lord help the boy, for we can do no more!\" They put a few halfpence into his hand, and in an oblivious way, he shuffled out of the house.\n\"Thank you kindly!\" said Liz to Charley and me. \"Jenny, dear, good night! Young lady, I'll look down by the kiln by and by, where the boy will be most like, and again in the morning!\" She hurried off, looking anxiously along the road for her drunken husband.\nI was afraid of staying then. But I said to Charley that we must not leave the boy to die. Charley glided on before me, and presently we caught up with Jo, just short of the brick-kiln.\nI think he must have begun his journey with some small bundle under his arm and must have had it stolen or lost it. For he still carried his wretched fragment of fur cap like a bundle, though he went bare-headed through the rain, which now fell fast. He stopped when we called to him and stood arrested in his shivering fit.\nI asked him to come with us, and said we would give him shelter for the night.\n\"I don't want no shelter,\" he said; \"I can lay amongst the warm bricks.\"\n\"But don't you know that people die there?\" replied Charley.\n\"They dies everywheres,\" said the boy. \"They dies down in Tom-all-Alone's in heaps.\" Then he hoarsely whispered to Charley, \"If she ain't the t'other one, she ain't the forrenner. Is there three of 'em then?\"\nCharley looked at me a little frightened. But the boy followed when I beckoned him; so I led the way straight home. The boy's steps were uncertain and tremulous, but we had not far to go, and he made no complaint.\nLeaving him in the hall for a moment, shrunk into the corner of the window-seat, I went into the drawing-room to speak to my guardian. There I found Mr. Skimpole, who had come down by the coach, as he frequently did without notice, never bringing any clothes with him, but always borrowing everything he wanted.\nThey came out with me to look at the boy. The servants had gathered in the hall too, and he shivered in the window-seat with Charley standing by him, like some wounded animal that had been found in a ditch.\n\"This is a sorrowful case,\" said my guardian after asking him a question or two. \"What do you say, Harold?\"\n\"You had better turn him out,\" said Mr. Skimpole.\n\"What do you mean?\" inquired my guardian, almost sternly.\n\"My dear Jarndyce,\" said Mr. Skimpole, \"you know I am a child. But he's not safe, you know. There's a very bad fever about him.\"\nMr. Skimpole retreated to the drawing-room again as he said this in his airy way.\n\"You'll say it's childish,\" he observed, looking gaily at us. \"Well, I dare say it may be; but if you put him out in the road, you only put him where he was before. He will be no worse off than he was, you know. Give him sixpence, or five shillings - and get rid of him!\"\n\"And what is he to do then?\" asked my guardian.\n\"Upon my life,\" said Mr. Skimpole, shrugging his shoulders with his engaging smile, \"I have not the least idea.\"\n\"Now, is it not a horrible reflection,\" said my guardian, walking up and down and rumpling his hair, \"that if this wretched creature were a prisoner, he would be as well taken care of as any sick boy in the kingdom?\"\n\"My dear Jarndyce,\" returned Mr. Skimpole, \"you'll pardon the simplicity of the question, coming from a simple child, but why isn't he a prisoner then? It seems to me that it would be wiser if he showed some misdirected energy that got him into prison. There would be more of an adventurous spirit in it, and a certain sort of poetry.\"\n\"I believe,\" returned my guardian, resuming his uneasy walk, \"that there is not such another child on earth as yourself.\"\n\"In the meantime,\" I observed, \"he is getting worse.\"\n\"In the meantime,\" said Mr. Skimpole cheerfully, \"as Miss Summerson, with her practical good sense, observes, he is getting worse. Therefore I recommend your turning him out before he gets worse still.\"\nThe amiable face with which he said it, I think I shall never forget.\n\"It's growing late,\" said my guardian, \"and it is a very bad night, and the boy is worn out already. There is a bed in the wholesome loft-room by the stable; we had better keep him there till morning. We'll do that.\"\n\"Oh!\" said Mr. Skimpole, with his hands upon the keys of the piano. \"How I envy you your constitution, Jarndyce! You don't mind these things; neither does Miss Summerson. You are ready at all times to do anything. Such is will! I have no will at all, and simply can't.\"\nWe went back into the hall and explained to Jo what we proposed, which he received with languid unconcern. The servants were anxious to help, and we soon got the loft-room ready. Some of the men carried him across the wet yard, well wrapped up. It was pleasant to observe how kind they were, frequently calling him \"Old Chap.\" Charley went to and fro between the loft-room and the house with such little stimulants and comforts as we thought it safe to give him.\nMy guardian himself saw him before he was left for the night, and returned to the growlery to write a letter on the boy's behalf, which was to be delivered in the morning. The boy had seemed inclined to sleep, he said. They had fastened his door on the outside, in case of his being delirious, but if he made any noise he would be heard.\nMr. Skimpole was left alone all this time and entertained himself by playing snatches of pathetic airs and sometimes singing to them with great expression and feeling. When we rejoined him in the drawing-room he sang us a little ballad about a peasant boy,\n\"Thrown on the wide world, doomed to wander and roam,\nBereft of his parents, bereft of a home.\"\nIt was a song that always made him cry, he told us. He was extremely gay all the rest of the evening, and drank to \"Better health to our young friend!\" whom he gaily supposed would, like Dick Whittington, become Lord Mayor of London. In that event, no doubt, he would establish the Jarndyce and Summerson Almshouses.\nCharley's last report was that the boy was quiet. I could see, from my window, the lantern they had left him burning quietly; and I went to bed happy to think that he was sheltered.\nThere was more movement and talking than usual before daybreak, and it awoke me. As I was dressing, I looked out of my window and asked one of our men whether there was anything wrong. The lantern was still burning in the loft-window.\n\"It's the boy, miss,\" said he.\n\"Is he worse?\" I inquired.\n\"Gone, miss.\"\n\"Dead!\"\n\"Dead, miss? No. Gone clean off.\"\nAt what time of the night he had gone, or how, or why, it seemed impossible to learn. It could only be supposed that he had got out by a trapdoor in the floor which led to an empty cart-house below. But he had shut it down again, if that were so; and it looked as if it had not been raised. Nothing was missing.\nWe all yielded to the painful belief that delirium had come upon him in the night and that he had strayed away in that helpless state; all of us, that is to say, but Mr. Skimpole, who repeatedly suggested, in his usual easy light style, that it had occurred to our young friend that he was not a safe inmate, having a fever, and that he had politely taken himself off.\nEvery possible inquiry was made. The brick-kilns were searched and the cottages were visited, but the two women knew nothing of him, and nobody could doubt that their wonder was genuine. The night had been too wet to allow any tracing by footsteps. Hedge and ditch were examined by our men for a long distance round, lest the boy should be lying insensible or dead; but he had vanished.\nThe search continued for five days. It did not cease even then, but my attention was diverted into a current very memorable to me.\nAs Charley was writing again in my room, and as I sat opposite her, I felt the table tremble. Looking up, I saw my little maid shivering from head to foot.\n\"Charley,\" said I, \"are you cold?\"\n\"I think I am, miss,\" she replied. \"I don't know what it is. I can't hold myself still. Don't be uneasy, but I think I'm ill.\"\nI heard Ada's voice outside, and I hurried to the door between my room and our pretty sitting-room, and locked it. Just in time, for she tapped at it and called to me to let her in.\nI said, \"Not now, my dearest. Go away. There's nothing the matter; I will come to you presently.\" Ah! It was a long, long time before my darling girl and I were companions again.\nCharley fell ill. In twelve hours she was very ill with the smallpox. I moved her to my room, and laid her in my bed, and sat down to nurse her. I told my guardian why I felt it was necessary that I should seclude myself, and not see my darling above all. At first Ada came very often to the door, and called to me, and even reproached me with sobs and tears; but I wrote her a long letter saying that she made me anxious and unhappy, and imploring her, as she loved me, to come no nearer than the garden.\nAfter that she came beneath the window often; and if I had learnt to love her dear sweet voice before, how did I learn to love it then, when I stood behind the window-curtain listening and replying, but not looking out! How did I learn to love it afterwards, when the harder time came!\nThey put a bed for me in our sitting-room; and by keeping the door wide open, I turned the two rooms into one, and kept them always fresh and airy. The servants were so good that they would all gladly have come to me at any hour, but I thought it best to choose one worthy woman who was never to see Ada and whom I could trust to come and go with all precautions. Thus I got out to take the air with my guardian when there was no fear of meeting Ada.\nPoor Charley sickened and grew worse, and fell into heavy danger of death, and lay severely ill for many a long day and night. So patient she was, so uncomplaining, that often as I sat holding her head in my arms - for she could only sleep in that attitude - I silently prayed to our Father in heaven that I might not forget the lesson which this little sister taught me.\nI was very sorrowful to think that Charley's pretty looks would change and be disfigured, even if she recovered - but that thought was lost in her greater peril. When she was at the worst, she would murmur out the wanderings of her mind about her father's sick-bed and the two little children. At those times I used to think, how should I ever tell the two remaining babies that the baby who had learned to be a mother to them was dead!\nThere were other times when Charley knew me well and talked to me, sending her love to Tom and Emma. She would speak to me of what she had read from the Bible to her father to comfort him. But she never lost her gentle qualities.\nAnd Charley did not die. She flutteringly and slowly turned the dangerous point, and then began to mend. I even began to hope that her appearance would remain unchanged, as I saw her growing into her old childish likeness again.\nIt was a great morning when I could tell Ada all this as she stood out in the garden; and it was a great evening when Charley and I at last took tea together. But on that same evening, I felt that I was stricken cold.\nIt was not until Charley was asleep in bed again that I began to think the contagion of her illness was upon me. I knew that I was rapidly following in her steps. I was well enough, however, to be up early in the morning, and to return my darling's cheerful blessing from the garden. But I felt as if I had been walking about the two rooms in the night, a little beside myself; and I felt confused at times - with a curious sense of fullness, as if I were becoming too large altogether.\nIn the evening I was so much worse that I resolved to prepare Charley. So I said, \"You're getting quite strong, Charley, are you not?'\n\"Oh, quite!\" said Charley.\n\"Strong enough to be told a secret, I think, Charley?\"\n\"Quite strong enough for that, miss!\" cried Charley. But her face fell when she saw the secret in my face; and she jumped up and fell upon my bosom, and said \"Oh, miss, it's my doing! It's my doing!\"\n\"Now, Charley,\" said I, \"if I am to be ill, my great trust is in you. And unless you are as quiet and composed for me as you always were for yourself, you can never fulfil it, Charley.\"\n\"If you'll let me cry a little longer, miss,\" said Charley. \"Oh, my dear! - I'll be good.\"\nSo I let Charley cry a little longer, and it did us both good.\n\"Trust in me now, if you please, miss,\" said Charley quietly. \"I am listening to everything you say.\"\n\"It's very little at present, Charley. I shall tell your doctor tonight that I don't think I am well and that you are going to nurse me. In the morning, when you hear Miss Ada in the garden, if I should not be able to go to the window as usual, do you go, Charley, and say I am asleep. At all times keep the room as I have kept it, Charley, and let no one come in.\"\nCharley promised, and I lay down, for I was very heavy. I saw the doctor that night and asked him to say nothing of my illness in the house yet. I have a very indistinct remembrance of that night melting into day, and of day melting into night again; but I was just able on the first morning to get to the window and speak to my darling.\nOn the second morning I heard her dear voice outside; and I asked Charley, with some difficulty (speech being painful), to say I was asleep. I heard Ada answer softly, \"Don't disturb her, Charley, for the world!\"\nI called Charley to me and gave her a last charge.\n\"Now, Charley, when she knows I am ill, she will try to make her way into the room. Keep her out, Charley, if you love me truly! Charley, if you let her in once, I shall die.\"\n\"I never will!\" she promised me.\n\"I believe it, my dear Charley. And now sit beside me for a little while, and touch me with your hand. For I cannot see you, Charley; I am blind.\"",
        "paragraph_chars": [
            [
                0,
                445
            ],
            [
                445,
                577
            ],
            [
                577,
                663
            ],
            [
                663,
                710
            ],
            [
                710,
                805
            ],
            [
                805,
                888
            ],
            [
                888,
                925
            ],
            [
                925,
                1052
            ],
            [
                1052,
                1106
            ],
            [
                1106,
                1191
            ],
            [
                1191,
                1236
            ],
            [
                1236,
                1604
            ],
            [
                1604,
                1650
            ],
            [
                1650,
                1770
            ],
            [
                1770,
                1998
            ],
            [
                1998,
                2047
            ],
            [
                2047,
                2104
            ],
            [
                2104,
                2195
            ],
            [
                2195,
                2283
            ],
            [
                2283,
                2464
            ],
            [
                2464,
                2859
            ],
            [
                2859,
                3184
            ],
            [
                3184,
                3317
            ],
            [
                3317,
                3722
            ],
            [
                3722,
                3908
            ],
            [
                3908,
                4007
            ],
            [
                4007,
                4150
            ],
            [
                4150,
                4194
            ],
            [
                4194,
                4201
            ],
            [
                4201,
                4384
            ],
            [
                4384,
                4485
            ],
            [
                4485,
                4648
            ],
            [
                4648,
                4780
            ],
            [
                4780,
                4838
            ],
            [
                4838,
                4899
            ],
            [
                4899,
                4950
            ],
            [
                4950,
                5024
            ],
            [
                5024,
                5256
            ],
            [
                5256,
                5300
            ],
            [
                5300,
                5406
            ],
            [
                5406,
                5516
            ],
            [
                5516,
                5557
            ],
            [
                5557,
                5870
            ],
            [
                5870,
                6005
            ],
            [
                6005,
                6348
            ],
            [
                6348,
                6658
            ],
            [
                6658,
                6895
            ],
            [
                6895,
                7154
            ],
            [
                7154,
                7340
            ],
            [
                7340,
                7665
            ],
            [
                7665,
                7744
            ],
            [
                7744,
                7817
            ],
            [
                7817,
                7878
            ],
            [
                7878,
                8087
            ],
            [
                8087,
                8301
            ],
            [
                8301,
                8613
            ],
            [
                8613,
                8820
            ],
            [
                8820,
                8928
            ],
            [
                8928,
                8978
            ],
            [
                8978,
                9036
            ],
            [
                9036,
                9165
            ],
            [
                9165,
                9247
            ],
            [
                9247,
                9519
            ],
            [
                9519,
                9567
            ],
            [
                9567,
                9680
            ],
            [
                9680,
                9897
            ],
            [
                9897,
                10233
            ],
            [
                10233,
                10355
            ],
            [
                10355,
                10409
            ],
            [
                10409,
                10612
            ],
            [
                10612,
                10682
            ],
            [
                10682,
                10899
            ],
            [
                10899,
                11169
            ],
            [
                11169,
                11632
            ],
            [
                11632,
                11970
            ],
            [
                11970,
                12227
            ],
            [
                12227,
                12281
            ],
            [
                12281,
                12323
            ],
            [
                12323,
                12640
            ],
            [
                12640,
                12822
            ],
            [
                12822,
                13057
            ],
            [
                13057,
                13088
            ],
            [
                13088,
                13115
            ],
            [
                13115,
                13129
            ],
            [
                13129,
                13137
            ],
            [
                13137,
                13171
            ],
            [
                13171,
                13483
            ],
            [
                13483,
                13852
            ],
            [
                13852,
                14239
            ],
            [
                14239,
                14370
            ],
            [
                14370,
                14526
            ],
            [
                14526,
                14561
            ],
            [
                14561,
                14688
            ],
            [
                14688,
                14870
            ],
            [
                14870,
                15049
            ],
            [
                15049,
                15555
            ],
            [
                15555,
                15841
            ],
            [
                15841,
                16292
            ],
            [
                16292,
                16664
            ],
            [
                16664,
                17101
            ],
            [
                17101,
                17331
            ],
            [
                17331,
                17560
            ],
            [
                17560,
                17778
            ],
            [
                17778,
                18265
            ],
            [
                18265,
                18400
            ],
            [
                18400,
                18427
            ],
            [
                18427,
                18482
            ],
            [
                18482,
                18682
            ],
            [
                18682,
                18868
            ],
            [
                18868,
                18959
            ],
            [
                18959,
                19022
            ],
            [
                19022,
                19124
            ],
            [
                19124,
                19490
            ],
            [
                19490,
                19828
            ],
            [
                19828,
                20041
            ],
            [
                20041,
                20092
            ],
            [
                20092,
                20268
            ],
            [
                20268,
                20301
            ],
            [
                20301,
                20447
            ]
        ],
        "segment_chars": [
            [
                0,
                135
            ],
            [
                135,
                300
            ],
            [
                300,
                383
            ],
            [
                383,
                445
            ],
            [
                445,
                522
            ],
            [
                522,
                577
            ],
            [
                577,
                663
            ],
            [
                663,
                685
            ],
            [
                685,
                710
            ],
            [
                710,
                805
            ],
            [
                805,
                823
            ],
            [
                823,
                888
            ],
            [
                888,
                919
            ],
            [
                919,
                925
            ],
            [
                925,
                1015
            ],
            [
                1015,
                1052
            ],
            [
                1052,
                1106
            ],
            [
                1106,
                1166
            ],
            [
                1166,
                1191
            ],
            [
                1191,
                1236
            ],
            [
                1236,
                1260
            ],
            [
                1260,
                1278
            ],
            [
                1278,
                1348
            ],
            [
                1348,
                1489
            ],
            [
                1489,
                1604
            ],
            [
                1604,
                1642
            ],
            [
                1642,
                1650
            ],
            [
                1650,
                1730
            ],
            [
                1730,
                1770
            ],
            [
                1770,
                1834
            ],
            [
                1834,
                1909
            ],
            [
                1909,
                1964
            ],
            [
                1964,
                1998
            ],
            [
                1998,
                2047
            ],
            [
                2047,
                2104
            ],
            [
                2104,
                2195
            ],
            [
                2195,
                2283
            ],
            [
                2283,
                2416
            ],
            [
                2416,
                2464
            ],
            [
                2464,
                2528
            ],
            [
                2528,
                2598
            ],
            [
                2598,
                2805
            ],
            [
                2805,
                2859
            ],
            [
                2859,
                2921
            ],
            [
                2921,
                3119
            ],
            [
                3119,
                3184
            ],
            [
                3184,
                3232
            ],
            [
                3232,
                3317
            ],
            [
                3317,
                3388
            ],
            [
                3388,
                3423
            ],
            [
                3423,
                3580
            ],
            [
                3580,
                3670
            ],
            [
                3670,
                3722
            ],
            [
                3722,
                3792
            ],
            [
                3792,
                3893
            ],
            [
                3893,
                3908
            ],
            [
                3908,
                4007
            ],
            [
                4007,
                4048
            ],
            [
                4048,
                4150
            ],
            [
                4150,
                4179
            ],
            [
                4179,
                4194
            ],
            [
                4194,
                4201
            ],
            [
                4201,
                4218
            ],
            [
                4218,
                4283
            ],
            [
                4283,
                4295
            ],
            [
                4295,
                4323
            ],
            [
                4323,
                4384
            ],
            [
                4384,
                4462
            ],
            [
                4462,
                4485
            ],
            [
                4485,
                4494
            ],
            [
                4494,
                4537
            ],
            [
                4537,
                4571
            ],
            [
                4571,
                4648
            ],
            [
                4648,
                4780
            ],
            [
                4780,
                4789
            ],
            [
                4789,
                4803
            ],
            [
                4803,
                4838
            ],
            [
                4838,
                4899
            ],
            [
                4899,
                4905
            ],
            [
                4905,
                4923
            ],
            [
                4923,
                4950
            ],
            [
                4950,
                5002
            ],
            [
                5002,
                5024
            ],
            [
                5024,
                5185
            ],
            [
                5185,
                5256
            ],
            [
                5256,
                5281
            ],
            [
                5281,
                5300
            ],
            [
                5300,
                5361
            ],
            [
                5361,
                5391
            ],
            [
                5391,
                5406
            ],
            [
                5406,
                5442
            ],
            [
                5442,
                5516
            ],
            [
                5516,
                5548
            ],
            [
                5548,
                5557
            ],
            [
                5557,
                5582
            ],
            [
                5582,
                5607
            ],
            [
                5607,
                5643
            ],
            [
                5643,
                5718
            ],
            [
                5718,
                5746
            ],
            [
                5746,
                5844
            ],
            [
                5844,
                5870
            ],
            [
                5870,
                5901
            ],
            [
                5901,
                5933
            ],
            [
                5933,
                6005
            ],
            [
                6005,
                6074
            ],
            [
                6074,
                6325
            ],
            [
                6325,
                6331
            ],
            [
                6331,
                6348
            ],
            [
                6348,
                6396
            ],
            [
                6396,
                6658
            ],
            [
                6658,
                6800
            ],
            [
                6800,
                6895
            ],
            [
                6895,
                6915
            ],
            [
                6915,
                6943
            ],
            [
                6943,
                6969
            ],
            [
                6969,
                7079
            ],
            [
                7079,
                7154
            ],
            [
                7154,
                7184
            ],
            [
                7184,
                7245
            ],
            [
                7245,
                7340
            ],
            [
                7340,
                7456
            ],
            [
                7456,
                7591
            ],
            [
                7591,
                7665
            ],
            [
                7665,
                7744
            ],
            [
                7744,
                7817
            ],
            [
                7817,
                7861
            ],
            [
                7861,
                7878
            ],
            [
                7878,
                7917
            ],
            [
                7917,
                7963
            ],
            [
                7963,
                8058
            ],
            [
                8058,
                8087
            ],
            [
                8087,
                8129
            ],
            [
                8129,
                8203
            ],
            [
                8203,
                8301
            ],
            [
                8301,
                8436
            ],
            [
                8436,
                8613
            ],
            [
                8613,
                8655
            ],
            [
                8655,
                8820
            ],
            [
                8820,
                8901
            ],
            [
                8901,
                8928
            ],
            [
                8928,
                8978
            ],
            [
                8978,
                8998
            ],
            [
                8998,
                9036
            ],
            [
                9036,
                9099
            ],
            [
                9099,
                9128
            ],
            [
                9128,
                9165
            ],
            [
                9165,
                9247
            ],
            [
                9247,
                9309
            ],
            [
                9309,
                9412
            ],
            [
                9412,
                9459
            ],
            [
                9459,
                9519
            ],
            [
                9519,
                9548
            ],
            [
                9548,
                9567
            ],
            [
                9567,
                9680
            ],
            [
                9680,
                9897
            ],
            [
                9897,
                10049
            ],
            [
                10049,
                10150
            ],
            [
                10150,
                10233
            ],
            [
                10233,
                10355
            ],
            [
                10355,
                10409
            ],
            [
                10409,
                10540
            ],
            [
                10540,
                10612
            ],
            [
                10612,
                10682
            ],
            [
                10682,
                10783
            ],
            [
                10783,
                10883
            ],
            [
                10883,
                10899
            ],
            [
                10899,
                10905
            ],
            [
                10905,
                10967
            ],
            [
                10967,
                11012
            ],
            [
                11012,
                11070
            ],
            [
                11070,
                11113
            ],
            [
                11113,
                11127
            ],
            [
                11127,
                11169
            ],
            [
                11169,
                11276
            ],
            [
                11276,
                11348
            ],
            [
                11348,
                11414
            ],
            [
                11414,
                11496
            ],
            [
                11496,
                11632
            ],
            [
                11632,
                11804
            ],
            [
                11804,
                11851
            ],
            [
                11851,
                11970
            ],
            [
                11970,
                12138
            ],
            [
                12138,
                12227
            ],
            [
                12227,
                12281
            ],
            [
                12281,
                12323
            ],
            [
                12323,
                12375
            ],
            [
                12375,
                12475
            ],
            [
                12475,
                12557
            ],
            [
                12557,
                12640
            ],
            [
                12640,
                12690
            ],
            [
                12690,
                12822
            ],
            [
                12822,
                12903
            ],
            [
                12903,
                13007
            ],
            [
                13007,
                13057
            ],
            [
                13057,
                13088
            ],
            [
                13088,
                13103
            ],
            [
                13103,
                13115
            ],
            [
                13115,
                13129
            ],
            [
                13129,
                13137
            ],
            [
                13137,
                13150
            ],
            [
                13150,
                13154
            ],
            [
                13154,
                13171
            ],
            [
                13171,
                13257
            ],
            [
                13257,
                13370
            ],
            [
                13370,
                13462
            ],
            [
                13462,
                13483
            ],
            [
                13483,
                13852
            ],
            [
                13852,
                13885
            ],
            [
                13885,
                14039
            ],
            [
                14039,
                14101
            ],
            [
                14101,
                14239
            ],
            [
                14239,
                14275
            ],
            [
                14275,
                14370
            ],
            [
                14370,
                14464
            ],
            [
                14464,
                14526
            ],
            [
                14526,
                14561
            ],
            [
                14561,
                14596
            ],
            [
                14596,
                14622
            ],
            [
                14622,
                14649
            ],
            [
                14649,
                14688
            ],
            [
                14688,
                14803
            ],
            [
                14803,
                14870
            ],
            [
                14870,
                14900
            ],
            [
                14900,
                14909
            ],
            [
                14909,
                14968
            ],
            [
                14968,
                14972
            ],
            [
                14972,
                15049
            ],
            [
                15049,
                15067
            ],
            [
                15067,
                15119
            ],
            [
                15119,
                15194
            ],
            [
                15194,
                15305
            ],
            [
                15305,
                15555
            ],
            [
                15555,
                15775
            ],
            [
                15775,
                15841
            ],
            [
                15841,
                15989
            ],
            [
                15989,
                16205
            ],
            [
                16205,
                16292
            ],
            [
                16292,
                16419
            ],
            [
                16419,
                16664
            ],
            [
                16664,
                16826
            ],
            [
                16826,
                16958
            ],
            [
                16958,
                17101
            ],
            [
                17101,
                17202
            ],
            [
                17202,
                17290
            ],
            [
                17290,
                17331
            ],
            [
                17331,
                17356
            ],
            [
                17356,
                17436
            ],
            [
                17436,
                17560
            ],
            [
                17560,
                17719
            ],
            [
                17719,
                17778
            ],
            [
                17778,
                17891
            ],
            [
                17891,
                17941
            ],
            [
                17941,
                18062
            ],
            [
                18062,
                18265
            ],
            [
                18265,
                18336
            ],
            [
                18336,
                18400
            ],
            [
                18400,
                18413
            ],
            [
                18413,
                18427
            ],
            [
                18427,
                18482
            ],
            [
                18482,
                18520
            ],
            [
                18520,
                18535
            ],
            [
                18535,
                18666
            ],
            [
                18666,
                18682
            ],
            [
                18682,
                18752
            ],
            [
                18752,
                18868
            ],
            [
                18868,
                18928
            ],
            [
                18928,
                18942
            ],
            [
                18942,
                18959
            ],
            [
                18959,
                19022
            ],
            [
                19022,
                19084
            ],
            [
                19084,
                19124
            ],
            [
                19124,
                19163
            ],
            [
                19163,
                19261
            ],
            [
                19261,
                19410
            ],
            [
                19410,
                19490
            ],
            [
                19490,
                19546
            ],
            [
                19546,
                19635
            ],
            [
                19635,
                19828
            ],
            [
                19828,
                19969
            ],
            [
                19969,
                20041
            ],
            [
                20041,
                20092
            ],
            [
                20092,
                20176
            ],
            [
                20176,
                20221
            ],
            [
                20221,
                20268
            ],
            [
                20268,
                20284
            ],
            [
                20284,
                20301
            ],
            [
                20301,
                20333
            ],
            [
                20333,
                20404
            ],
            [
                20404,
                20447
            ]
        ],
        "overlap_chars": [
            [
                0,
                22
            ],
            [
                23,
                65
            ],
            [
                69,
                83
            ],
            [
                84,
                91
            ],
            [
                92,
                99
            ],
            [
                100,
                135
            ],
            [
                135,
                176
            ],
            [
                177,
                190
            ],
            [
                191,
                192
            ],
            [
                193,
                246
            ],
            [
                247,
                254
            ],
            [
                255,
                300
            ],
            [
                300,
                331
            ],
            [
                331,
                332
            ],
            [
                333,
                343
            ],
            [
                344,
                381
            ],
            [
                381,
                383
            ],
            [
                383,
                416
            ],
            [
                417,
                420
            ],
            [
                421,
                427
            ],
            [
                428,
                443
            ],
            [
                443,
                445
            ],
            [
                445,
                477
            ],
            [
                481,
                482
            ],
            [
                483,
                492
            ],
            [
                493,
                501
            ],
            [
                501,
                522
            ],
            [
                522,
                574
            ],
            [
                574,
                577
            ],
            [
                577,
                588
            ],
            [
                593,
                628
            ],
            [
                629,
                636
            ],
            [
                637,
                646
            ],
            [
                647,
                663
            ],
            [
                663,
                685
            ],
            [
                685,
                710
            ],
            [
                710,
                736
            ],
            [
                744,
                768
            ],
            [
                769,
                779
            ],
            [
                780,
                805
            ],
            [
                805,
                823
            ],
            [
                823,
                836
            ],
            [
                836,
                888
            ],
            [
                888,
                919
            ],
            [
                919,
                925
            ],
            [
                925,
                1015
            ],
            [
                1015,
                1039
            ],
            [
                1045,
                1049
            ],
            [
                1049,
                1052
            ],
            [
                1052,
                1094
            ],
            [
                1094,
                1106
            ],
            [
                1106,
                1150
            ],
            [
                1153,
                1166
            ],
            [
                1166,
                1178
            ],
            [
                1179,
                1191
            ],
            [
                1191,
                1236
            ],
            [
                1236,
                1260
            ],
            [
                1260,
                1278
            ],
            [
                1278,
                1346
            ],
            [
                1348,
                1356
            ],
            [
                1363,
                1440
            ],
            [
                1443,
                1467
            ],
            [
                1470,
                1489
            ],
            [
                1494,
                1504
            ],
            [
                1504,
                1541
            ],
            [
                1542,
                1604
            ],
            [
                1604,
                1642
            ],
            [
                1642,
                1650
            ],
            [
                1650,
                1730
            ],
            [
                1730,
                1762
            ],
            [
                1768,
                1770
            ],
            [
                1770,
                1834
            ],
            [
                1834,
                1854
            ],
            [
                1855,
                1869
            ],
            [
                1871,
                1907
            ],
            [
                1907,
                1909
            ],
            [
                1909,
                1933
            ],
            [
                1962,
                1964
            ],
            [
                1964,
                1997
            ],
            [
                1998,
                2047
            ],
            [
                2047,
                2062
            ],
            [
                2062,
                2063
            ],
            [
                2064,
                2104
            ],
            [
                2104,
                2138
            ],
            [
                2139,
                2194
            ],
            [
                2195,
                2221
            ],
            [
                2228,
                2234
            ],
            [
                2235,
                2283
            ],
            [
                2283,
                2317
            ],
            [
                2318,
                2322
            ],
            [
                2323,
                2331
            ],
            [
                2331,
                2355
            ],
            [
                2356,
                2390
            ],
            [
                2391,
                2414
            ],
            [
                2414,
                2416
            ],
            [
                2416,
                2442
            ],
            [
                2449,
                2450
            ],
            [
                2454,
                2464
            ],
            [
                2464,
                2528
            ],
            [
                2528,
                2545
            ],
            [
                2546,
                2560
            ],
            [
                2570,
                2596
            ],
            [
                2596,
                2598
            ],
            [
                2633,
                2636
            ],
            [
                2637,
                2643
            ],
            [
                2644,
                2677
            ],
            [
                2677,
                2731
            ],
            [
                2738,
                2803
            ],
            [
                2803,
                2805
            ],
            [
                2805,
                2846
            ],
            [
                2847,
                2857
            ],
            [
                2857,
                2859
            ],
            [
                2859,
                2886
            ],
            [
                2887,
                2921
            ],
            [
                2921,
                2949
            ],
            [
                2950,
                2962
            ],
            [
                2963,
                3011
            ],
            [
                3011,
                3119
            ],
            [
                3119,
                3182
            ],
            [
                3182,
                3184
            ],
            [
                3184,
                3210
            ],
            [
                3211,
                3220
            ],
            [
                3230,
                3232
            ],
            [
                3232,
                3304
            ],
            [
                3305,
                3317
            ],
            [
                3317,
                3379
            ],
            [
                3380,
                3388
            ],
            [
                3388,
                3423
            ],
            [
                3423,
                3518
            ],
            [
                3518,
                3532
            ],
            [
                3533,
                3552
            ],
            [
                3553,
                3580
            ],
            [
                3580,
                3601
            ],
            [
                3602,
                3668
            ],
            [
                3668,
                3670
            ],
            [
                3670,
                3679
            ],
            [
                3680,
                3700
            ],
            [
                3701,
                3722
            ],
            [
                3722,
                3778
            ],
            [
                3790,
                3792
            ],
            [
                3792,
                3892
            ],
            [
                3893,
                3906
            ],
            [
                3906,
                3908
            ],
            [
                3908,
                3993
            ],
            [
                3994,
                4007
            ],
            [
                4007,
                4048
            ],
            [
                4048,
                4101
            ],
            [
                4101,
                4150
            ],
            [
                4150,
                4179
            ],
            [
                4179,
                4194
            ],
            [
                4194,
                4201
            ],
            [
                4201,
                4218
            ],
            [
                4218,
                4283
            ],
            [
                4283,
                4293
            ],
            [
                4293,
                4295
            ],
            [
                4295,
                4323
            ],
            [
                4323,
                4355
            ],
            [
                4356,
                4382
            ],
            [
                4382,
                4384
            ],
            [
                4384,
                4415
            ],
            [
                4416,
                4420
            ],
            [
                4426,
                4462
            ],
            [
                4463,
                4485
            ],
            [
                4485,
                4494
            ],
            [
                4494,
                4510
            ],
            [
                4510,
                4511
            ],
            [
                4512,
                4524
            ],
            [
                4525,
                4535
            ],
            [
                4535,
                4537
            ],
            [
                4537,
                4571
            ],
            [
                4571,
                4599
            ],
            [
                4600,
                4603
            ],
            [
                4608,
                4648
            ],
            [
                4648,
                4665
            ],
            [
                4666,
                4732
            ],
            [
                4733,
                4752
            ],
            [
                4753,
                4760
            ],
            [
                4761,
                4772
            ],
            [
                4773,
                4779
            ],
            [
                4780,
                4789
            ],
            [
                4789,
                4803
            ],
            [
                4804,
                4838
            ],
            [
                4838,
                4867
            ],
            [
                4868,
                4899
            ],
            [
                4899,
                4905
            ],
            [
                4905,
                4923
            ],
            [
                4923,
                4950
            ],
            [
                4950,
                5002
            ],
            [
                5002,
                5021
            ],
            [
                5021,
                5024
            ],
            [
                5024,
                5071
            ],
            [
                5072,
                5098
            ],
            [
                5098,
                5185
            ],
            [
                5185,
                5209
            ],
            [
                5210,
                5211
            ],
            [
                5212,
                5226
            ],
            [
                5227,
                5228
            ],
            [
                5229,
                5241
            ],
            [
                5245,
                5248
            ],
            [
                5249,
                5253
            ],
            [
                5256,
                5281
            ],
            [
                5281,
                5300
            ],
            [
                5300,
                5361
            ],
            [
                5361,
                5389
            ],
            [
                5389,
                5391
            ],
            [
                5391,
                5406
            ],
            [
                5406,
                5441
            ],
            [
                5442,
                5444
            ],
            [
                5445,
                5459
            ],
            [
                5460,
                5468
            ],
            [
                5469,
                5484
            ],
            [
                5485,
                5498
            ],
            [
                5504,
                5516
            ],
            [
                5516,
                5548
            ],
            [
                5548,
                5557
            ],
            [
                5557,
                5558
            ],
            [
                5558,
                5580
            ],
            [
                5580,
                5582
            ],
            [
                5582,
                5605
            ],
            [
                5607,
                5641
            ],
            [
                5641,
                5643
            ],
            [
                5643,
                5701
            ],
            [
                5702,
                5703
            ],
            [
                5704,
                5708
            ],
            [
                5709,
                5712
            ],
            [
                5716,
                5718
            ],
            [
                5718,
                5746
            ],
            [
                5746,
                5844
            ],
            [
                5844,
                5870
            ],
            [
                5870,
                5901
            ],
            [
                5901,
                5933
            ],
            [
                5933,
                5978
            ],
            [
                5979,
                6005
            ],
            [
                6005,
                6007
            ],
            [
                6014,
                6018
            ],
            [
                6018,
                6025
            ],
            [
                6025,
                6074
            ],
            [
                6075,
                6147
            ],
            [
                6156,
                6177
            ],
            [
                6182,
                6184
            ],
            [
                6192,
                6208
            ],
            [
                6210,
                6323
            ],
            [
                6323,
                6325
            ],
            [
                6325,
                6331
            ],
            [
                6331,
                6345
            ],
            [
                6345,
                6348
            ],
            [
                6348,
                6394
            ],
            [
                6394,
                6396
            ],
            [
                6396,
                6399
            ],
            [
                6400,
                6468
            ],
            [
                6470,
                6531
            ],
            [
                6532,
                6552
            ],
            [
                6555,
                6656
            ],
            [
                6656,
                6657
            ],
            [
                6658,
                6665
            ],
            [
                6666,
                6693
            ],
            [
                6693,
                6743
            ],
            [
                6744,
                6747
            ],
            [
                6747,
                6797
            ],
            [
                6797,
                6800
            ],
            [
                6800,
                6824
            ],
            [
                6825,
                6843
            ],
            [
                6844,
                6859
            ],
            [
                6860,
                6895
            ],
            [
                6895,
                6896
            ],
            [
                6896,
                6912
            ],
            [
                6915,
                6919
            ],
            [
                6924,
                6934
            ],
            [
                6935,
                6938
            ],
            [
                6939,
                6941
            ],
            [
                6944,
                6950
            ],
            [
                6951,
                6969
            ],
            [
                6969,
                6979
            ],
            [
                6979,
                7079
            ],
            [
                7079,
                7095
            ],
            [
                7096,
                7154
            ],
            [
                7154,
                7182
            ],
            [
                7182,
                7184
            ],
            [
                7184,
                7245
            ],
            [
                7245,
                7252
            ],
            [
                7253,
                7290
            ],
            [
                7298,
                7340
            ],
            [
                7340,
                7456
            ],
            [
                7456,
                7591
            ],
            [
                7591,
                7627
            ],
            [
                7634,
                7665
            ],
            [
                7665,
                7697
            ],
            [
                7703,
                7711
            ],
            [
                7721,
                7744
            ],
            [
                7744,
                7817
            ],
            [
                7817,
                7861
            ],
            [
                7861,
                7878
            ],
            [
                7878,
                7917
            ],
            [
                7917,
                7918
            ],
            [
                7918,
                7960
            ],
            [
                7963,
                7989
            ],
            [
                7993,
                8058
            ],
            [
                8058,
                8087
            ],
            [
                8087,
                8129
            ],
            [
                8129,
                8132
            ],
            [
                8141,
                8165
            ],
            [
                8166,
                8169
            ],
            [
                8174,
                8203
            ],
            [
                8203,
                8223
            ],
            [
                8224,
                8247
            ],
            [
                8247,
                8248
            ],
            [
                8253,
                8255
            ],
            [
                8273,
                8278
            ],
            [
                8279,
                8299
            ],
            [
                8299,
                8301
            ],
            [
                8301,
                8380
            ],
            [
                8380,
                8436
            ],
            [
                8436,
                8532
            ],
            [
                8533,
                8613
            ],
            [
                8613,
                8634
            ],
            [
                8635,
                8655
            ],
            [
                8655,
                8820
            ],
            [
                8820,
                8899
            ],
            [
                8899,
                8901
            ],
            [
                8901,
                8928
            ],
            [
                8928,
                8978
            ],
            [
                8978,
                8998
            ],
            [
                8998,
                9036
            ],
            [
                9036,
                9084
            ],
            [
                9085,
                9099
            ],
            [
                9099,
                9102
            ],
            [
                9103,
                9128
            ],
            [
                9128,
                9146
            ],
            [
                9147,
                9165
            ],
            [
                9165,
                9177
            ],
            [
                9178,
                9187
            ],
            [
                9188,
                9213
            ],
            [
                9214,
                9216
            ],
            [
                9220,
                9245
            ],
            [
                9245,
                9247
            ],
            [
                9247,
                9274
            ],
            [
                9278,
                9286
            ],
            [
                9286,
                9309
            ],
            [
                9309,
                9341
            ],
            [
                9342,
                9412
            ],
            [
                9412,
                9459
            ],
            [
                9459,
                9495
            ],
            [
                9498,
                9519
            ],
            [
                9519,
                9548
            ],
            [
                9548,
                9567
            ],
            [
                9567,
                9677
            ],
            [
                9680,
                9737
            ],
            [
                9738,
                9819
            ],
            [
                9820,
                9829
            ],
            [
                9830,
                9897
            ],
            [
                9897,
                9993
            ],
            [
                9994,
                10000
            ],
            [
                10001,
                10007
            ],
            [
                10013,
                10047
            ],
            [
                10049,
                10086
            ],
            [
                10087,
                10150
            ],
            [
                10150,
                10205
            ],
            [
                10206,
                10233
            ],
            [
                10233,
                10355
            ],
            [
                10355,
                10375
            ],
            [
                10384,
                10409
            ],
            [
                10409,
                10540
            ],
            [
                10540,
                10597
            ],
            [
                10598,
                10603
            ],
            [
                10604,
                10609
            ],
            [
                10609,
                10612
            ],
            [
                10612,
                10682
            ],
            [
                10682,
                10683
            ],
            [
                10683,
                10700
            ],
            [
                10700,
                10702
            ],
            [
                10708,
                10720
            ],
            [
                10721,
                10722
            ],
            [
                10722,
                10725
            ],
            [
                10726,
                10728
            ],
            [
                10729,
                10783
            ],
            [
                10783,
                10881
            ],
            [
                10881,
                10883
            ],
            [
                10883,
                10899
            ],
            [
                10899,
                10905
            ],
            [
                10905,
                10965
            ],
            [
                10965,
                10967
            ],
            [
                10967,
                11010
            ],
            [
                11012,
                11070
            ],
            [
                11070,
                11099
            ],
            [
                11100,
                11113
            ],
            [
                11113,
                11127
            ],
            [
                11127,
                11148
            ],
            [
                11150,
                11153
            ],
            [
                11161,
                11169
            ],
            [
                11169,
                11232
            ],
            [
                11232,
                11233
            ],
            [
                11234,
                11256
            ],
            [
                11257,
                11274
            ],
            [
                11274,
                11276
            ],
            [
                11276,
                11288
            ],
            [
                11294,
                11310
            ],
            [
                11311,
                11314
            ],
            [
                11315,
                11346
            ],
            [
                11348,
                11363
            ],
            [
                11364,
                11414
            ],
            [
                11414,
                11459
            ],
            [
                11461,
                11493
            ],
            [
                11496,
                11503
            ],
            [
                11504,
                11631
            ],
            [
                11632,
                11692
            ],
            [
                11692,
                11693
            ],
            [
                11694,
                11697
            ],
            [
                11698,
                11767
            ],
            [
                11768,
                11771
            ],
            [
                11772,
                11774
            ],
            [
                11788,
                11802
            ],
            [
                11816,
                11822
            ],
            [
                11823,
                11840
            ],
            [
                11842,
                11844
            ],
            [
                11849,
                11851
            ],
            [
                11851,
                11892
            ],
            [
                11892,
                11929
            ],
            [
                11933,
                11935
            ],
            [
                11941,
                11950
            ],
            [
                11951,
                11953
            ],
            [
                11963,
                11970
            ],
            [
                11972,
                12102
            ],
            [
                12103,
                12138
            ],
            [
                12138,
                12181
            ],
            [
                12182,
                12186
            ],
            [
                12187,
                12205
            ],
            [
                12206,
                12227
            ],
            [
                12227,
                12280
            ],
            [
                12285,
                12323
            ],
            [
                12323,
                12374
            ],
            [
                12375,
                12424
            ],
            [
                12438,
                12475
            ],
            [
                12483,
                12488
            ],
            [
                12489,
                12497
            ],
            [
                12505,
                12509
            ],
            [
                12515,
                12526
            ],
            [
                12528,
                12557
            ],
            [
                12557,
                12613
            ],
            [
                12614,
                12617
            ],
            [
                12618,
                12638
            ],
            [
                12638,
                12639
            ],
            [
                12640,
                12690
            ],
            [
                12690,
                12783
            ],
            [
                12784,
                12822
            ],
            [
                12822,
                12849
            ],
            [
                12850,
                12868
            ],
            [
                12869,
                12903
            ],
            [
                12903,
                12972
            ],
            [
                12973,
                13005
            ],
            [
                13005,
                13007
            ],
            [
                13007,
                13057
            ],
            [
                13057,
                13088
            ],
            [
                13088,
                13103
            ],
            [
                13103,
                13115
            ],
            [
                13115,
                13126
            ],
            [
                13129,
                13137
            ],
            [
                13137,
                13150
            ],
            [
                13150,
                13154
            ],
            [
                13154,
                13171
            ],
            [
                13171,
                13235
            ],
            [
                13247,
                13249
            ],
            [
                13255,
                13257
            ],
            [
                13257,
                13312
            ],
            [
                13312,
                13316
            ],
            [
                13317,
                13335
            ],
            [
                13343,
                13370
            ],
            [
                13370,
                13462
            ],
            [
                13462,
                13469
            ],
            [
                13470,
                13482
            ],
            [
                13483,
                13573
            ],
            [
                13574,
                13601
            ],
            [
                13602,
                13800
            ],
            [
                13801,
                13806
            ],
            [
                13806,
                13823
            ],
            [
                13833,
                13852
            ],
            [
                13852,
                13883
            ],
            [
                13883,
                13885
            ],
            [
                13885,
                13905
            ],
            [
                13919,
                13945
            ],
            [
                13946,
                13949
            ],
            [
                13950,
                13963
            ],
            [
                13964,
                14039
            ],
            [
                14039,
                14048
            ],
            [
                14049,
                14068
            ],
            [
                14075,
                14101
            ],
            [
                14101,
                14116
            ],
            [
                14117,
                14197
            ],
            [
                14198,
                14221
            ],
            [
                14222,
                14228
            ],
            [
                14237,
                14238
            ],
            [
                14239,
                14275
            ],
            [
                14275,
                14277
            ],
            [
                14282,
                14285
            ],
            [
                14292,
                14306
            ],
            [
                14307,
                14323
            ],
            [
                14324,
                14370
            ],
            [
                14370,
                14384
            ],
            [
                14385,
                14409
            ],
            [
                14409,
                14432
            ],
            [
                14433,
                14436
            ],
            [
                14436,
                14464
            ],
            [
                14464,
                14526
            ],
            [
                14526,
                14553
            ],
            [
                14554,
                14561
            ],
            [
                14561,
                14596
            ],
            [
                14596,
                14622
            ],
            [
                14622,
                14649
            ],
            [
                14649,
                14665
            ],
            [
                14670,
                14688
            ],
            [
                14688,
                14742
            ],
            [
                14743,
                14803
            ],
            [
                14803,
                14837
            ],
            [
                14842,
                14868
            ],
            [
                14868,
                14870
            ],
            [
                14870,
                14900
            ],
            [
                14900,
                14909
            ],
            [
                14909,
                14968
            ],
            [
                14968,
                14972
            ],
            [
                14972,
                15049
            ],
            [
                15049,
                15067
            ],
            [
                15067,
                15099
            ],
            [
                15117,
                15119
            ],
            [
                15119,
                15179
            ],
            [
                15180,
                15194
            ],
            [
                15194,
                15212
            ],
            [
                15213,
                15274
            ],
            [
                15275,
                15278
            ],
            [
                15283,
                15305
            ],
            [
                15305,
                15313
            ],
            [
                15318,
                15482
            ],
            [
                15484,
                15518
            ],
            [
                15518,
                15554
            ],
            [
                15555,
                15593
            ],
            [
                15601,
                15656
            ],
            [
                15656,
                15761
            ],
            [
                15762,
                15775
            ],
            [
                15775,
                15841
            ],
            [
                15841,
                15951
            ],
            [
                15952,
                15989
            ],
            [
                15989,
                15992
            ],
            [
                16007,
                16034
            ],
            [
                16035,
                16069
            ],
            [
                16069,
                16191
            ],
            [
                16203,
                16205
            ],
            [
                16210,
                16290
            ],
            [
                16290,
                16292
            ],
            [
                16292,
                16403
            ],
            [
                16404,
                16419
            ],
            [
                16419,
                16456
            ],
            [
                16457,
                16461
            ],
            [
                16462,
                16476
            ],
            [
                16477,
                16504
            ],
            [
                16532,
                16534
            ],
            [
                16540,
                16548
            ],
            [
                16551,
                16664
            ],
            [
                16664,
                16775
            ],
            [
                16778,
                16798
            ],
            [
                16799,
                16826
            ],
            [
                16826,
                16852
            ],
            [
                16853,
                16862
            ],
            [
                16863,
                16900
            ],
            [
                16907,
                16924
            ],
            [
                16925,
                16936
            ],
            [
                16941,
                16956
            ],
            [
                16956,
                16958
            ],
            [
                16958,
                17067
            ],
            [
                17068,
                17090
            ],
            [
                17091,
                17101
            ],
            [
                17101,
                17167
            ],
            [
                17176,
                17200
            ],
            [
                17200,
                17202
            ],
            [
                17202,
                17205
            ],
            [
                17206,
                17244
            ],
            [
                17250,
                17253
            ],
            [
                17260,
                17273
            ],
            [
                17274,
                17288
            ],
            [
                17288,
                17290
            ],
            [
                17290,
                17293
            ],
            [
                17294,
                17297
            ],
            [
                17304,
                17308
            ],
            [
                17313,
                17329
            ],
            [
                17329,
                17330
            ],
            [
                17331,
                17356
            ],
            [
                17356,
                17411
            ],
            [
                17412,
                17436
            ],
            [
                17438,
                17442
            ],
            [
                17443,
                17451
            ],
            [
                17452,
                17461
            ],
            [
                17466,
                17476
            ],
            [
                17499,
                17500
            ],
            [
                17504,
                17560
            ],
            [
                17560,
                17717
            ],
            [
                17717,
                17719
            ],
            [
                17719,
                17778
            ],
            [
                17778,
                17806
            ],
            [
                17807,
                17813
            ],
            [
                17814,
                17826
            ],
            [
                17827,
                17891
            ],
            [
                17891,
                17929
            ],
            [
                17934,
                17940
            ],
            [
                17941,
                18060
            ],
            [
                18060,
                18062
            ],
            [
                18062,
                18067
            ],
            [
                18079,
                18154
            ],
            [
                18154,
                18184
            ],
            [
                18187,
                18265
            ],
            [
                18265,
                18334
            ],
            [
                18339,
                18400
            ],
            [
                18400,
                18413
            ],
            [
                18413,
                18427
            ],
            [
                18427,
                18482
            ],
            [
                18482,
                18520
            ],
            [
                18520,
                18535
            ],
            [
                18535,
                18538
            ],
            [
                18539,
                18542
            ],
            [
                18543,
                18552
            ],
            [
                18558,
                18596
            ],
            [
                18607,
                18666
            ],
            [
                18666,
                18681
            ],
            [
                18682,
                18704
            ],
            [
                18704,
                18740
            ],
            [
                18741,
                18752
            ],
            [
                18752,
                18868
            ],
            [
                18868,
                18928
            ],
            [
                18928,
                18940
            ],
            [
                18940,
                18942
            ],
            [
                18944,
                18959
            ],
            [
                18959,
                19022
            ],
            [
                19022,
                19084
            ],
            [
                19084,
                19124
            ],
            [
                19124,
                19163
            ],
            [
                19163,
                19187
            ],
            [
                19196,
                19259
            ],
            [
                19261,
                19333
            ],
            [
                19334,
                19358
            ],
            [
                19359,
                19408
            ],
            [
                19408,
                19410
            ],
            [
                19410,
                19484
            ],
            [
                19487,
                19490
            ],
            [
                19490,
                19546
            ],
            [
                19546,
                19583
            ],
            [
                19584,
                19587
            ],
            [
                19588,
                19590
            ],
            [
                19595,
                19629
            ],
            [
                19630,
                19635
            ],
            [
                19635,
                19828
            ],
            [
                19828,
                19872
            ],
            [
                19873,
                19945
            ],
            [
                19945,
                19950
            ],
            [
                19951,
                19969
            ],
            [
                19969,
                19976
            ],
            [
                19981,
                20041
            ],
            [
                20041,
                20076
            ],
            [
                20079,
                20092
            ],
            [
                20092,
                20176
            ],
            [
                20176,
                20219
            ],
            [
                20219,
                20221
            ],
            [
                20221,
                20247
            ],
            [
                20248,
                20252
            ],
            [
                20252,
                20268
            ],
            [
                20268,
                20281
            ],
            [
                20284,
                20301
            ],
            [
                20301,
                20333
            ],
            [
                20333,
                20340
            ],
            [
                20341,
                20404
            ],
            [
                20404,
                20447
            ]
        ],
        "row_chars": [
            [
                0,
                135
            ],
            [
                135,
                300
            ],
            [
                300,
                383
            ],
            [
                383,
                445
            ],
            [
                445,
                522
            ],
            [
                522,
                577
            ],
            [
                577,
                663
            ],
            [
                663,
                685
            ],
            [
                685,
                710
            ],
            [
                710,
                805
            ],
            [
                805,
                823
            ],
            [
                823,
                888
            ],
            [
                888,
                919
            ],
            [
                919,
                925
            ],
            [
                925,
                1015
            ],
            [
                1015,
                1052
            ],
            [
                1052,
                1106
            ],
            [
                1106,
                1166
            ],
            [
                1166,
                1191
            ],
            [
                1191,
                1236
            ],
            [
                1236,
                1260
            ],
            [
                1260,
                1278
            ],
            [
                1278,
                1348
            ],
            [
                1348,
                1348
            ],
            [
                1348,
                1348
            ],
            [
                1348,
                1348
            ],
            [
                1348,
                1489
            ],
            [
                1489,
                1489
            ],
            [
                1489,
                1604
            ],
            [
                1604,
                1604
            ],
            [
                1604,
                1604
            ],
            [
                1604,
                1604
            ],
            [
                1604,
                1604
            ],
            [
                1604,
                1604
            ],
            [
                1604,
                1604
            ],
            [
                1604,
                1642
            ],
            [
                1642,
                1650
            ],
            [
                1650,
                1730
            ],
            [
                1730,
                1770
            ],
            [
                1770,
                1834
            ],
            [
                1834,
                1909
            ],
            [
                1909,
                1964
            ],
            [
                1964,
                1998
            ],
            [
                1998,
                1998
            ],
            [
                1998,
                2047
            ],
            [
                2047,
                2104
            ],
            [
                2104,
                2195
            ],
            [
                2195,
                2283
            ],
            [
                2283,
                2416
            ],
            [
                2416,
                2464
            ],
            [
                2464,
                2528
            ],
            [
                2528,
                2598
            ],
            [
                2598,
                2598
            ],
            [
                2598,
                2805
            ],
            [
                2805,
                2859
            ],
            [
                2859,
                2921
            ],
            [
                2921,
                3119
            ],
            [
                3119,
                3119
            ],
            [
                3119,
                3184
            ],
            [
                3184,
                3232
            ],
            [
                3232,
                3317
            ],
            [
                3317,
                3388
            ],
            [
                3388,
                3423
            ],
            [
                3423,
                3580
            ],
            [
                3580,
                3670
            ],
            [
                3670,
                3722
            ],
            [
                3722,
                3792
            ],
            [
                3792,
                3893
            ],
            [
                3893,
                3908
            ],
            [
                3908,
                4007
            ],
            [
                4007,
                4048
            ],
            [
                4048,
                4150
            ],
            [
                4150,
                4179
            ],
            [
                4179,
                4194
            ],
            [
                4194,
                4201
            ],
            [
                4201,
                4218
            ],
            [
                4218,
                4283
            ],
            [
                4283,
                4295
            ],
            [
                4295,
                4295
            ],
            [
                4295,
                4323
            ],
            [
                4323,
                4384
            ],
            [
                4384,
                4462
            ],
            [
                4462,
                4462
            ],
            [
                4462,
                4485
            ],
            [
                4485,
                4494
            ],
            [
                4494,
                4537
            ],
            [
                4537,
                4571
            ],
            [
                4571,
                4648
            ],
            [
                4648,
                4780
            ],
            [
                4780,
                4780
            ],
            [
                4780,
                4789
            ],
            [
                4789,
                4803
            ],
            [
                4803,
                4803
            ],
            [
                4803,
                4838
            ],
            [
                4838,
                4899
            ],
            [
                4899,
                4905
            ],
            [
                4905,
                4923
            ],
            [
                4923,
                4950
            ],
            [
                4950,
                5002
            ],
            [
                5002,
                5024
            ],
            [
                5024,
                5185
            ],
            [
                5185,
                5256
            ],
            [
                5256,
                5281
            ],
            [
                5281,
                5300
            ],
            [
                5300,
                5361
            ],
            [
                5361,
                5391
            ],
            [
                5391,
                5406
            ],
            [
                5406,
                5442
            ],
            [
                5442,
                5442
            ],
            [
                5442,
                5516
            ],
            [
                5516,
                5548
            ],
            [
                5548,
                5557
            ],
            [
                5557,
                5582
            ],
            [
                5582,
                5607
            ],
            [
                5607,
                5607
            ],
            [
                5607,
                5607
            ],
            [
                5607,
                5607
            ],
            [
                5607,
                5643
            ],
            [
                5643,
                5718
            ],
            [
                5718,
                5718
            ],
            [
                5718,
                5746
            ],
            [
                5746,
                5746
            ],
            [
                5746,
                5844
            ],
            [
                5844,
                5870
            ],
            [
                5870,
                5870
            ],
            [
                5870,
                5901
            ],
            [
                5901,
                5933
            ],
            [
                5933,
                6005
            ],
            [
                6005,
                6074
            ],
            [
                6074,
                6074
            ],
            [
                6074,
                6325
            ],
            [
                6325,
                6331
            ],
            [
                6331,
                6348
            ],
            [
                6348,
                6396
            ],
            [
                6396,
                6396
            ],
            [
                6396,
                6396
            ],
            [
                6396,
                6658
            ],
            [
                6658,
                6800
            ],
            [
                6800,
                6895
            ],
            [
                6895,
                6943
            ],
            [
                6943,
                6969
            ],
            [
                6969,
                7079
            ],
            [
                7079,
                7154
            ],
            [
                7154,
                7184
            ],
            [
                7184,
                7245
            ],
            [
                7245,
                7340
            ],
            [
                7340,
                7456
            ],
            [
                7456,
                7591
            ],
            [
                7591,
                7665
            ],
            [
                7665,
                7744
            ],
            [
                7744,
                7817
            ],
            [
                7817,
                7861
            ],
            [
                7861,
                7878
            ],
            [
                7878,
                7917
            ],
            [
                7917,
                7963
            ],
            [
                7963,
                7963
            ],
            [
                7963,
                8058
            ],
            [
                8058,
                8087
            ],
            [
                8087,
                8129
            ],
            [
                8129,
                8129
            ],
            [
                8129,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8301
            ],
            [
                8301,
                8436
            ],
            [
                8436,
                8613
            ],
            [
                8613,
                8655
            ],
            [
                8655,
                8820
            ],
            [
                8820,
                8901
            ],
            [
                8901,
                8928
            ],
            [
                8928,
                8978
            ],
            [
                8978,
                8998
            ],
            [
                8998,
                9036
            ],
            [
                9036,
                9099
            ],
            [
                9099,
                9099
            ],
            [
                9099,
                9128
            ],
            [
                9128,
                9165
            ],
            [
                9165,
                9247
            ],
            [
                9247,
                9309
            ],
            [
                9309,
                9412
            ],
            [
                9412,
                9459
            ],
            [
                9459,
                9459
            ],
            [
                9459,
                9519
            ],
            [
                9519,
                9548
            ],
            [
                9548,
                9567
            ],
            [
                9567,
                9680
            ],
            [
                9680,
                9680
            ],
            [
                9680,
                9897
            ],
            [
                9897,
                10049
            ],
            [
                10049,
                10049
            ],
            [
                10049,
                10049
            ],
            [
                10049,
                10150
            ],
            [
                10150,
                10233
            ],
            [
                10233,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10409
            ],
            [
                10409,
                10540
            ],
            [
                10540,
                10612
            ],
            [
                10612,
                10682
            ],
            [
                10682,
                10783
            ],
            [
                10783,
                10883
            ],
            [
                10883,
                10899
            ],
            [
                10899,
                10905
            ],
            [
                10905,
                10967
            ],
            [
                10967,
                10967
            ],
            [
                10967,
                10967
            ],
            [
                10967,
                11012
            ],
            [
                11012,
                11012
            ],
            [
                11012,
                11070
            ],
            [
                11070,
                11113
            ],
            [
                11113,
                11127
            ],
            [
                11127,
                11169
            ],
            [
                11169,
                11169
            ],
            [
                11169,
                11169
            ],
            [
                11169,
                11169
            ],
            [
                11169,
                11169
            ],
            [
                11169,
                11169
            ],
            [
                11169,
                11169
            ],
            [
                11169,
                11276
            ],
            [
                11276,
                11414
            ],
            [
                11414,
                11496
            ],
            [
                11496,
                11632
            ],
            [
                11632,
                11851
            ],
            [
                11851,
                11970
            ],
            [
                11970,
                12138
            ],
            [
                12138,
                12227
            ],
            [
                12227,
                12323
            ],
            [
                12323,
                12323
            ],
            [
                12323,
                12375
            ],
            [
                12375,
                12475
            ],
            [
                12475,
                12557
            ],
            [
                12557,
                12640
            ],
            [
                12640,
                12640
            ],
            [
                12640,
                12690
            ],
            [
                12690,
                12822
            ],
            [
                12822,
                12903
            ],
            [
                12903,
                13007
            ],
            [
                13007,
                13057
            ],
            [
                13057,
                13088
            ],
            [
                13088,
                13103
            ],
            [
                13103,
                13115
            ],
            [
                13115,
                13129
            ],
            [
                13129,
                13137
            ],
            [
                13137,
                13150
            ],
            [
                13150,
                13154
            ],
            [
                13154,
                13171
            ],
            [
                13171,
                13257
            ],
            [
                13257,
                13370
            ],
            [
                13370,
                13462
            ],
            [
                13462,
                13483
            ],
            [
                13483,
                13852
            ],
            [
                13852,
                13885
            ],
            [
                13885,
                14039
            ],
            [
                14039,
                14101
            ],
            [
                14101,
                14239
            ],
            [
                14239,
                14239
            ],
            [
                14239,
                14275
            ],
            [
                14275,
                14370
            ],
            [
                14370,
                14464
            ],
            [
                14464,
                14526
            ],
            [
                14526,
                14561
            ],
            [
                14561,
                14596
            ],
            [
                14596,
                14622
            ],
            [
                14622,
                14649
            ],
            [
                14649,
                14649
            ],
            [
                14649,
                14688
            ],
            [
                14688,
                14803
            ],
            [
                14803,
                14900
            ],
            [
                14900,
                14909
            ],
            [
                14909,
                14968
            ],
            [
                14968,
                14972
            ],
            [
                14972,
                15049
            ],
            [
                15049,
                15067
            ],
            [
                15067,
                15119
            ],
            [
                15119,
                15194
            ],
            [
                15194,
                15305
            ],
            [
                15305,
                15555
            ],
            [
                15555,
                15775
            ],
            [
                15775,
                15841
            ],
            [
                15841,
                15989
            ],
            [
                15989,
                16205
            ],
            [
                16205,
                16292
            ],
            [
                16292,
                16419
            ],
            [
                16419,
                16664
            ],
            [
                16664,
                16826
            ],
            [
                16826,
                16958
            ],
            [
                16958,
                17101
            ],
            [
                17101,
                17202
            ],
            [
                17202,
                17290
            ],
            [
                17290,
                17290
            ],
            [
                17290,
                17290
            ],
            [
                17290,
                17331
            ],
            [
                17331,
                17331
            ],
            [
                17331,
                17356
            ],
            [
                17356,
                17436
            ],
            [
                17436,
                17560
            ],
            [
                17560,
                17719
            ],
            [
                17719,
                17778
            ],
            [
                17778,
                17891
            ],
            [
                17891,
                17941
            ],
            [
                17941,
                18062
            ],
            [
                18062,
                18265
            ],
            [
                18265,
                18400
            ],
            [
                18400,
                18413
            ],
            [
                18413,
                18427
            ],
            [
                18427,
                18482
            ],
            [
                18482,
                18520
            ],
            [
                18520,
                18535
            ],
            [
                18535,
                18666
            ],
            [
                18666,
                18682
            ],
            [
                18682,
                18682
            ],
            [
                18682,
                18752
            ],
            [
                18752,
                18868
            ],
            [
                18868,
                18928
            ],
            [
                18928,
                18942
            ],
            [
                18942,
                18942
            ],
            [
                18942,
                18942
            ],
            [
                18942,
                18959
            ],
            [
                18959,
                19022
            ],
            [
                19022,
                19084
            ],
            [
                19084,
                19124
            ],
            [
                19124,
                19163
            ],
            [
                19163,
                19261
            ],
            [
                19261,
                19261
            ],
            [
                19261,
                19410
            ],
            [
                19410,
                19490
            ],
            [
                19490,
                19546
            ],
            [
                19546,
                19635
            ],
            [
                19635,
                19828
            ],
            [
                19828,
                19969
            ],
            [
                19969,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20041
            ],
            [
                20041,
                20092
            ],
            [
                20092,
                20176
            ],
            [
                20176,
                20221
            ],
            [
                20221,
                20268
            ],
            [
                20268,
                20284
            ],
            [
                20284,
                20284
            ],
            [
                20284,
                20301
            ],
            [
                20301,
                20333
            ],
            [
                20333,
                20404
            ],
            [
                20404,
                20447
            ]
        ]
    }
}