{
    "original": {
        "text": "Now do those two gentlemen not very neat about the cuffs and buttons who attended the last coroner's inquest at the Sol's Arms reappear in the precincts with surprising swiftness (being, in fact, breathlessly fetched by the active and intelligent beadle), and institute perquisitions through the court, and dive into the Sol's parlour, and write with ravenous little pens on tissue-paper. Now do they note down, in the watches of the night, how the neighbourhood of Chancery Lane was yesterday, at about midnight, thrown into a state of the most intense agitation and excitement by the following alarming and horrible discovery. Now do they set forth how it will doubtless be remembered that some time back a painful sensation was created in the public mind by a case of mysterious death from opium occurring in the first floor of the house occupied as a rag, bottle, and general marine store shop, by an eccentric individual of intemperate habits, far advanced in life, named Krook; and how, by a remarkable coincidence, Krook was examined at the inquest, which it may be recollected was held on that occasion at the Sol's Arms, a well-conducted tavern immediately adjoining the premises in question on the west side and licensed to a highly respectable landlord, Mr. James George Bogsby. Now do they show (in as many words as possible) how during some hours of yesterday evening a very peculiar smell was observed by the inhabitants of the court, in which the tragical occurrence which forms the subject of that present account transpired; and which odour was at one time so powerful that Mr. Swills, a comic vocalist professionally engaged by Mr. J. G. Bogsby, has himself stated to our reporter that he mentioned to Miss M. Melvilleson, a lady of some pretensions to musical ability, likewise engaged by Mr. J. G. Bogsby to sing at a series of concerts called Harmonic Assemblies, or Meetings, which it would appear are held at the Sol's Arms under Mr. Bogsby's direction pursuant to the Act of George the Second, that he (Mr. Swills) found his voice seriously affected by the impure state of the atmosphere, his jocose expression at the time being that he was like an empty post-office, for he hadn't a single note in him. How this account of Mr. Swills is entirely corroborated by two intelligent married females residing in the same court and known respectively by the names of Mrs. Piper and Mrs. Perkins, both of whom observed the foetid effluvia and regarded them as being emitted from the premises in the occupation of Krook, the unfortunate deceased. All this and a great deal more the two gentlemen who have formed an amicable partnership in the melancholy catastrophe write down on the spot; and the boy population of the court (out of bed in a moment) swarm up the shutters of the Sol's Arms parlour, to behold the tops of their heads while they are about it.\nThe whole court, adult as well as boy, is sleepless for that night, and can do nothing but wrap up its many heads, and talk of the ill-fated house, and look at it. Miss Flite has been bravely rescued from her chamber, as if it were in flames, and accommodated with a bed at the Sol's Arms. The Sol neither turns off its gas nor shuts its door all night, for any kind of public excitement makes good for the Sol and causes the court to stand in need of comfort. The house has not done so much in the stomachic article of cloves or in brandy-and-water warm since the inquest. The moment the pot-boy heard what had happened, he rolled up his shirt-sleeves tight to his shoulders and said, \"There'll be a run upon us!\" In the first outcry, young Piper dashed off for the fire-engines and returned in triumph at a jolting gallop perched up aloft on the Phoenix and holding on to that fabulous creature with all his might in the midst of helmets and torches. One helmet remains behind after careful investigation of all chinks and crannies and slowly paces up and down before the house in company with one of the two policemen who have likewise been left in charge thereof. To this trio everybody in the court possessed of sixpence has an insatiate desire to exhibit hospitality in a liquid form.\nMr. Weevle and his friend Mr. Guppy are within the bar at the Sol and are worth anything to the Sol that the bar contains if they will only stay there. \"This is not a time,\" says Mr. Bogsby, \"to haggle about money,\" though he looks something sharply after it, over the counter; \"give your orders, you two gentlemen, and you're welcome to whatever you put a name to.\"\nThus entreated, the two gentlemen (Mr. Weevle especially) put names to so many things that in course of time they find it difficult to put a name to anything quite distinctly, though they still relate to all new-comers some version of the night they have had of it, and of what they said, and what they thought, and what they saw. Meanwhile, one or other of the policemen often flits about the door, and pushing it open a little way at the full length of his arm, looks in from outer gloom. Not that he has any suspicions, but that he may as well know what they are up to in there.\nThus night pursues its leaden course, finding the court still out of bed through the unwonted hours, still treating and being treated, still conducting itself similarly to a court that has had a little money left it unexpectedly. Thus night at length with slow-retreating steps departs, and the lamp-lighter going his rounds, like an executioner to a despotic king, strikes off the little heads of fire that have aspired to lessen the darkness. Thus the day cometh, whether or no.\nAnd the day may discern, even with its dim London eye, that the court has been up all night. Over and above the faces that have fallen drowsily on tables and the heels that lie prone on hard floors instead of beds, the brick and mortar physiognomy of the very court itself looks worn and jaded. And now the neighbourhood, waking up and beginning to hear of what has happened, comes streaming in, half dressed, to ask questions; and the two policemen and the helmet (who are far less impressible externally than the court) have enough to do to keep the door.\n\"Good gracious, gentlemen!\" says Mr. Snagsby, coming up. \"What's this I hear!\"\n\"Why, it's true,\" returns one of the policemen. \"That's what it is. Now move on here, come!\"\n\"Why, good gracious, gentlemen,\" says Mr. Snagsby, somewhat promptly backed away, \"I was at this door last night betwixt ten and eleven o'clock in conversation with the young man who lodges here.\"\n\"Indeed?\" returns the policeman. \"You will find the young man next door then. Now move on here, some of you.\"\n\"Not hurt, I hope?\" says Mr. Snagsby.\n\"Hurt? No. What's to hurt him!\"\nMr. Snagsby, wholly unable to answer this or any question in his troubled mind, repairs to the Sol's Arms and finds Mr. Weevle languishing over tea and toast with a considerable expression on him of exhausted excitement and exhausted tobacco-smoke.\n\"And Mr. Guppy likewise!\" quoth Mr. Snagsby. \"Dear, dear, dear! What a fate there seems in all this! And my lit--\"\nMr. Snagsby's power of speech deserts him in the formation of the words \"my little woman.\" For to see that injured female walk into the Sol's Arms at that hour of the morning and stand before the beer-engine, with her eyes fixed upon him like an accusing spirit, strikes him dumb.\n\"My dear,\" says Mr. Snagsby when his tongue is loosened, \"will you take anything? A little--not to put too fine a point upon it--drop of shrub?\"\n\"No,\" says Mrs. Snagsby.\n\"My love, you know these two gentlemen?\"\n\"Yes!\" says Mrs. Snagsby, and in a rigid manner acknowledges their presence, still fixing Mr. Snagsby with her eye.\nThe devoted Mr. Snagsby cannot bear this treatment. He takes Mrs. Snagsby by the hand and leads her aside to an adjacent cask.\n\"My little woman, why do you look at me in that way? Pray don't do it.\"\n\"I can't help my looks,\" says Mrs. Snagsby, \"and if I could I wouldn't.\"\nMr. Snagsby, with his cough of meekness, rejoins, \"Wouldn't you really, my dear?\" and meditates. Then coughs his cough of trouble and says, \"This is a dreadful mystery, my love!\" still fearfully disconcerted by Mrs. Snagsby's eye.\n\"It IS,\" returns Mrs. Snagsby, shaking her head, \"a dreadful mystery.\"\n\"My little woman,\" urges Mr. Snagsby in a piteous manner, \"don't for goodness' sake speak to me with that bitter expression and look at me in that searching way! I beg and entreat of you not to do it. Good Lord, you don't suppose that I would go spontaneously combusting any person, my dear?\"\n\"I can't say,\" returns Mrs. Snagsby.\nOn a hasty review of his unfortunate position, Mr. Snagsby \"can't say\" either. He is not prepared positively to deny that he may have had something to do with it. He has had something--he don't know what--to do with so much in this connexion that is mysterious that it is possible he may even be implicated, without knowing it, in the present transaction. He faintly wipes his forehead with his handkerchief and gasps.\n\"My life,\" says the unhappy stationer, \"would you have any objections to mention why, being in general so delicately circumspect in your conduct, you come into a wine-vaults before breakfast?\"\n\"Why do YOU come here?\" inquires Mrs. Snagsby.\n\"My dear, merely to know the rights of the fatal accident which has happened to the venerable party who has been--combusted.\" Mr. Snagsby has made a pause to suppress a groan. \"I should then have related them to you, my love, over your French roll.\"\n\"I dare say you would! You relate everything to me, Mr. Snagsby.\"\n\"Every--my lit--\"\n\"I should be glad,\" says Mrs. Snagsby after contemplating his increased confusion with a severe and sinister smile, \"if you would come home with me; I think you may be safer there, Mr. Snagsby, than anywhere else.\"\n\"My love, I don't know but what I may be, I am sure. I am ready to go.\"\nMr. Snagsby casts his eye forlornly round the bar, gives Messrs. Weevle and Guppy good morning, assures them of the satisfaction with which he sees them uninjured, and accompanies Mrs. Snagsby from the Sol's Arms. Before night his doubt whether he may not be responsible for some inconceivable part in the catastrophe which is the talk of the whole neighbourhood is almost resolved into certainty by Mrs. Snagsby's pertinacity in that fixed gaze. His mental sufferings are so great that he entertains wandering ideas of delivering himself up to justice and requiring to be cleared if innocent and punished with the utmost rigour of the law if guilty.\nMr. Weevle and Mr. Guppy, having taken their breakfast, step into Lincoln's Inn to take a little walk about the square and clear as many of the dark cobwebs out of their brains as a little walk may.\n\"There can be no more favourable time than the present, Tony,\" says Mr. Guppy after they have broodingly made out the four sides of the square, \"for a word or two between us upon a point on which we must, with very little delay, come to an understanding.\"\n\"Now, I tell you what, William G.!\" returns the other, eyeing his companion with a bloodshot eye. \"If it's a point of conspiracy, you needn't take the trouble to mention it. I have had enough of that, and I ain't going to have any more. We shall have YOU taking fire next or blowing up with a bang.\"\nThis supposititious phenomenon is so very disagreeable to Mr. Guppy that his voice quakes as he says in a moral way, \"Tony, I should have thought that what we went through last night would have been a lesson to you never to be personal any more as long as you lived.\" To which Mr. Weevle returns, \"William, I should have thought it would have been a lesson to YOU never to conspire any more as long as you lived.\" To which Mr. Guppy says, \"Who's conspiring?\" To which Mr. Jobling replies, \"Why, YOU are!\" To which Mr. Guppy retorts, \"No, I am not.\" To which Mr. Jobling retorts again, \"Yes, you are!\" To which Mr. Guppy retorts, \"Who says so?\" To which Mr. Jobling retorts, \"I say so!\" To which Mr. Guppy retorts, \"Oh, indeed?\" To which Mr. Jobling retorts, \"Yes, indeed!\" And both being now in a heated state, they walk on silently for a while to cool down again.\n\"Tony,\" says Mr. Guppy then, \"if you heard your friend out instead of flying at him, you wouldn't fall into mistakes. But your temper is hasty and you are not considerate. Possessing in yourself, Tony, all that is calculated to charm the eye--\"\n\"Oh! Blow the eye!\" cries Mr. Weevle, cutting him short. \"Say what you have got to say!\"\nFinding his friend in this morose and material condition, Mr. Guppy only expresses the finer feelings of his soul through the tone of injury in which he recommences, \"Tony, when I say there is a point on which we must come to an understanding pretty soon, I say so quite apart from any kind of conspiring, however innocent. You know it is professionally arranged beforehand in all cases that are tried what facts the witnesses are to prove. Is it or is it not desirable that we should know what facts we are to prove on the inquiry into the death of this unfortunate old mo--gentleman?\" (Mr. Guppy was going to say \"mogul,\" but thinks \"gentleman\" better suited to the circumstances.)\n\"What facts? THE facts.\"\n\"The facts bearing on that inquiry. Those are\"--Mr. Guppy tells them off on his fingers--\"what we knew of his habits, when you saw him last, what his condition was then, the discovery that we made, and how we made it.\"\n\"Yes,\" says Mr. Weevle. \"Those are about the facts.\"\n\"We made the discovery in consequence of his having, in his eccentric way, an appointment with you at twelve o'clock at night, when you were to explain some writing to him as you had often done before on account of his not being able to read. I, spending the evening with you, was called down--and so forth. The inquiry being only into the circumstances touching the death of the deceased, it's not necessary to go beyond these facts, I suppose you'll agree?\"\n\"No!\" returns Mr. Weevle. \"I suppose not.\"\n\"And this is not a conspiracy, perhaps?\" says the injured Guppy.\n\"No,\" returns his friend; \"if it's nothing worse than this, I withdraw the observation.\"\n\"Now, Tony,\" says Mr. Guppy, taking his arm again and walking him slowly on, \"I should like to know, in a friendly way, whether you have yet thought over the many advantages of your continuing to live at that place?\"\n\"What do you mean?\" says Tony, stopping.\n\"Whether you have yet thought over the many advantages of your continuing to live at that place?\" repeats Mr. Guppy, walking him on again.\n\"At what place? THAT place?\" pointing in the direction of the rag and bottle shop.\nMr. Guppy nods.\n\"Why, I wouldn't pass another night there for any consideration that you could offer me,\" says Mr. Weevle, haggardly staring.\n\"Do you mean it though, Tony?\"\n\"Mean it! Do I look as if I mean it? I feel as if I do; I know that,\" says Mr. Weevle with a very genuine shudder.\n\"Then the possibility or probability--for such it must be considered--of your never being disturbed in possession of those effects lately belonging to a lone old man who seemed to have no relation in the world, and the certainty of your being able to find out what he really had got stored up there, don't weigh with you at all against last night, Tony, if I understand you?\" says Mr. Guppy, biting his thumb with the appetite of vexation.\n\"Certainly not. Talk in that cool way of a fellow's living there?\" cries Mr. Weevle indignantly. \"Go and live there yourself.\"\n\"Oh! I, Tony!\" says Mr. Guppy, soothing him. \"I have never lived there and couldn't get a lodging there now, whereas you have got one.\"\n\"You are welcome to it,\" rejoins his friend, \"and--ugh!--you may make yourself at home in it.\"\n\"Then you really and truly at this point,\" says Mr. Guppy, \"give up the whole thing, if I understand you, Tony?\"\n\"You never,\" returns Tony with a most convincing steadfastness, \"said a truer word in all your life. I do!\"\nWhile they are so conversing, a hackney-coach drives into the square, on the box of which vehicle a very tall hat makes itself manifest to the public. Inside the coach, and consequently not so manifest to the multitude, though sufficiently so to the two friends, for the coach stops almost at their feet, are the venerable Mr. Smallweed and Mrs. Smallweed, accompanied by their granddaughter Judy.\nAn air of haste and excitement pervades the party, and as the tall hat (surmounting Mr. Smallweed the younger) alights, Mr. Smallweed the elder pokes his head out of window and bawls to Mr. Guppy, \"How de do, sir! How de do!\"\n\"What do Chick and his family want here at this time of the morning, I wonder!\" says Mr. Guppy, nodding to his familiar.\n\"My dear sir,\" cries Grandfather Smallweed, \"would you do me a favour? Would you and your friend be so very obleeging as to carry me into the public-house in the court, while Bart and his sister bring their grandmother along? Would you do an old man that good turn, sir?\"\nMr. Guppy looks at his friend, repeating inquiringly, \"The public-house in the court?\" And they prepare to bear the venerable burden to the Sol's Arms.\n\"There's your fare!\" says the patriarch to the coachman with a fierce grin and shaking his incapable fist at him. \"Ask me for a penny more, and I'll have my lawful revenge upon you. My dear young men, be easy with me, if you please. Allow me to catch you round the neck. I won't squeeze you tighter than I can help. Oh, Lord! Oh, dear me! Oh, my bones!\"\nIt is well that the Sol is not far off, for Mr. Weevle presents an apoplectic appearance before half the distance is accomplished. With no worse aggravation of his symptoms, however, than the utterance of divers croaking sounds expressive of obstructed respiration, he fulfils his share of the porterage and the benevolent old gentleman is deposited by his own desire in the parlour of the Sol's Arms.\n\"Oh, Lord!\" gasps Mr. Smallweed, looking about him, breathless, from an arm-chair. \"Oh, dear me! Oh, my bones and back! Oh, my aches and pains! Sit down, you dancing, prancing, shambling, scrambling poll-parrot! Sit down!\"\nThis little apostrophe to Mrs. Smallweed is occasioned by a propensity on the part of that unlucky old lady whenever she finds herself on her feet to amble about and \"set\" to inanimate objects, accompanying herself with a chattering noise, as in a witch dance. A nervous affection has probably as much to do with these demonstrations as any imbecile intention in the poor old woman, but on the present occasion they are so particularly lively in connexion with the Windsor arm-chair, fellow to that in which Mr. Smallweed is seated, that she only quite desists when her grandchildren have held her down in it, her lord in the meanwhile bestowing upon her, with great volubility, the endearing epithet of \"a pig-headed jackdaw,\" repeated a surprising number of times.\n\"My dear sir,\" Grandfather Smallweed then proceeds, addressing Mr. Guppy, \"there has been a calamity here. Have you heard of it, either of you?\"\n\"Heard of it, sir! Why, we discovered it.\"\n\"You discovered it. You two discovered it! Bart, THEY discovered it!\"\nThe two discoverers stare at the Smallweeds, who return the compliment.\n\"My dear friends,\" whines Grandfather Smallweed, putting out both his hands, \"I owe you a thousand thanks for discharging the melancholy office of discovering the ashes of Mrs. Smallweed's brother.\"\n\"Eh?\" says Mr. Guppy.\n\"Mrs. Smallweed's brother, my dear friend--her only relation. We were not on terms, which is to be deplored now, but he never WOULD be on terms. He was not fond of us. He was eccentric--he was very eccentric. Unless he has left a will (which is not at all likely) I shall take out letters of administration. I have come down to look after the property; it must be sealed up, it must be protected. I have come down,\" repeats Grandfather Smallweed, hooking the air towards him with all his ten fingers at once, \"to look after the property.\"\n\"I think, Small,\" says the disconsolate Mr. Guppy, \"you might have mentioned that the old man was your uncle.\"\n\"You two were so close about him that I thought you would like me to be the same,\" returns that old bird with a secretly glistening eye. \"Besides, I wasn't proud of him.\"\n\"Besides which, it was nothing to you, you know, whether he was or not,\" says Judy. Also with a secretly glistening eye.\n\"He never saw me in his life to know me,\" observed Small; \"I don't know why I should introduce HIM, I am sure!\"\n\"No, he never communicated with us, which is to be deplored,\" the old gentleman strikes in, \"but I have come to look after the property--to look over the papers, and to look after the property. We shall make good our title. It is in the hands of my solicitor. Mr. Tulkinghorn, of Lincoln's Inn Fields, over the way there, is so good as to act as my solicitor; and grass don't grow under HIS feet, I can tell ye. Krook was Mrs. Smallweed's only brother; she had no relation but Krook, and Krook had no relation but Mrs. Smallweed. I am speaking of your brother, you brimstone black-beetle, that was seventy-six years of age.\"\nMrs. Smallweed instantly begins to shake her head and pipe up, \"Seventy-six pound seven and sevenpence! Seventy-six thousand bags of money! Seventy-six hundred thousand million of parcels of bank-notes!\"\n\"Will somebody give me a quart pot?\" exclaims her exasperated husband, looking helplessly about him and finding no missile within his reach. \"Will somebody obleege me with a spittoon? Will somebody hand me anything hard and bruising to pelt at her? You hag, you cat, you dog, you brimstone barker!\" Here Mr. Smallweed, wrought up to the highest pitch by his own eloquence, actually throws Judy at her grandmother in default of anything else, by butting that young virgin at the old lady with such force as he can muster and then dropping into his chair in a heap.\n\"Shake me up, somebody, if you'll be so good,\" says the voice from within the faintly struggling bundle into which he has collapsed. \"I have come to look after the property. Shake me up, and call in the police on duty at the next house to be explained to about the property. My solicitor will be here presently to protect the property. Transportation or the gallows for anybody who shall touch the property!\" As his dutiful grandchildren set him up, panting, and putting him through the usual restorative process of shaking and punching, he still repeats like an echo, \"The--the property! The property! Property!\"\nMr. Weevle and Mr. Guppy look at each other, the former as having relinquished the whole affair, the latter with a discomfited countenance as having entertained some lingering expectations yet. But there is nothing to be done in opposition to the Smallweed interest. Mr. Tulkinghorn's clerk comes down from his official pew in the chambers to mention to the police that Mr. Tulkinghorn is answerable for its being all correct about the next of kin and that the papers and effects will be formally taken possession of in due time and course. Mr. Smallweed is at once permitted so far to assert his supremacy as to be carried on a visit of sentiment into the next house and upstairs into Miss Flite's deserted room, where he looks like a hideous bird of prey newly added to her aviary.\nThe arrival of this unexpected heir soon taking wind in the court still makes good for the Sol and keeps the court upon its mettle. Mrs. Piper and Mrs. Perkins think it hard upon the young man if there really is no will, and consider that a handsome present ought to be made him out of the estate. Young Piper and young Perkins, as members of that restless juvenile circle which is the terror of the foot-passengers in Chancery Lane, crumble into ashes behind the pump and under the archway all day long, where wild yells and hootings take place over their remains. Little Swills and Miss M. Melvilleson enter into affable conversation with their patrons, feeling that these unusual occurrences level the barriers between professionals and non-professionals. Mr. Bogsby puts up \"The popular song of King Death, with chorus by the whole strength of the company,\" as the great Harmonic feature of the week and announces in the bill that \"J. G. B. is induced to do so at a considerable extra expense in consequence of a wish which has been very generally expressed at the bar by a large body of respectable individuals and in homage to a late melancholy event which has aroused so much sensation.\" There is one point connected with the deceased upon which the court is particularly anxious, namely, that the fiction of a full-sized coffin should be preserved, though there is so little to put in it. Upon the undertaker's stating in the Sol's bar in the course of the day that he has received orders to construct \"a six-footer,\" the general solicitude is much relieved, and it is considered that Mr. Smallweed's conduct does him great honour.\nOut of the court, and a long way out of it, there is considerable excitement too, for men of science and philosophy come to look, and carriages set down doctors at the corner who arrive with the same intent, and there is more learned talk about inflammable gases and phosphuretted hydrogen than the court has ever imagined. Some of these authorities (of course the wisest) hold with indignation that the deceased had no business to die in the alleged manner; and being reminded by other authorities of a certain inquiry into the evidence for such deaths reprinted in the sixth volume of the Philosophical Transactions; and also of a book not quite unknown on English medical jurisprudence; and likewise of the Italian case of the Countess Cornelia Baudi as set forth in detail by one Bianchini, prebendary of Verona, who wrote a scholarly work or so and was occasionally heard of in his time as having gleams of reason in him; and also of the testimony of Messrs. Fodere and Mere, two pestilent Frenchmen who WOULD investigate the subject; and further, of the corroborative testimony of Monsieur Le Cat, a rather celebrated French surgeon once upon a time, who had the unpoliteness to live in a house where such a case occurred and even to write an account of it--still they regard the late Mr. Krook's obstinacy in going out of the world by any such by-way as wholly unjustifiable and personally offensive. The less the court understands of all this, the more the court likes it, and the greater enjoyment it has in the stock in trade of the Sol's Arms. Then there comes the artist of a picture newspaper, with a foreground and figures ready drawn for anything from a wreck on the Cornish coast to a review in Hyde Park or a meeting in Manchester, and in Mrs. Perkins' own room, memorable evermore, he then and there throws in upon the block Mr. Krook's house, as large as life; in fact, considerably larger, making a very temple of it. Similarly, being permitted to look in at the door of the fatal chamber, he depicts that apartment as three-quarters of a mile long by fifty yards high, at which the court is particularly charmed. All this time the two gentlemen before mentioned pop in and out of every house and assist at the philosophical disputations--go everywhere and listen to everybody--and yet are always diving into the Sol's parlour and writing with the ravenous little pens on the tissue-paper.\nAt last come the coroner and his inquiry, like as before, except that the coroner cherishes this case as being out of the common way and tells the gentlemen of the jury, in his private capacity, that \"that would seem to be an unlucky house next door, gentlemen, a destined house; but so we sometimes find it, and these are mysteries we can't account for!\" After which the six-footer comes into action and is much admired.\nIn all these proceedings Mr. Guppy has so slight a part, except when he gives his evidence, that he is moved on like a private individual and can only haunt the secret house on the outside, where he has the mortification of seeing Mr. Smallweed padlocking the door, and of bitterly knowing himself to be shut out. But before these proceedings draw to a close, that is to say, on the night next after the catastrophe, Mr. Guppy has a thing to say that must be said to Lady Dedlock.\nFor which reason, with a sinking heart and with that hang-dog sense of guilt upon him which dread and watching enfolded in the Sol's Arms have produced, the young man of the name of Guppy presents himself at the town mansion at about seven o'clock in the evening and requests to see her ladyship. Mercury replies that she is going out to dinner; don't he see the carriage at the door? Yes, he does see the carriage at the door; but he wants to see my Lady too.\nMercury is disposed, as he will presently declare to a fellow-gentleman in waiting, \"to pitch into the young man\"; but his instructions are positive. Therefore he sulkily supposes that the young man must come up into the library. There he leaves the young man in a large room, not over-light, while he makes report of him.\nMr. Guppy looks into the shade in all directions, discovering everywhere a certain charred and whitened little heap of coal or wood. Presently he hears a rustling. Is it--? No, it's no ghost, but fair flesh and blood, most brilliantly dressed.\n\"I have to beg your ladyship's pardon,\" Mr. Guppy stammers, very downcast. \"This is an inconvenient time--\"\n\"I told you, you could come at any time.\" She takes a chair, looking straight at him as on the last occasion.\n\"Thank your ladyship. Your ladyship is very affable.\"\n\"You can sit down.\" There is not much affability in her tone.\n\"I don't know, your ladyship, that it's worth while my sitting down and detaining you, for I--I have not got the letters that I mentioned when I had the honour of waiting on your ladyship.\"\n\"Have you come merely to say so?\"\n\"Merely to say so, your ladyship.\" Mr. Guppy besides being depressed, disappointed, and uneasy, is put at a further disadvantage by the splendour and beauty of her appearance.\nShe knows its influence perfectly, has studied it too well to miss a grain of its effect on any one. As she looks at him so steadily and coldly, he not only feels conscious that he has no guide in the least perception of what is really the complexion of her thoughts, but also that he is being every moment, as it were, removed further and further from her.\nShe will not speak, it is plain. So he must.\n\"In short, your ladyship,\" says Mr. Guppy like a meanly penitent thief, \"the person I was to have had the letters of, has come to a sudden end, and--\" He stops. Lady Dedlock calmly finishes the sentence.\n\"And the letters are destroyed with the person?\"\nMr. Guppy would say no if he could--as he is unable to hide.\n\"I believe so, your ladyship.\"\nIf he could see the least sparkle of relief in her face now? No, he could see no such thing, even if that brave outside did not utterly put him away, and he were not looking beyond it and about it.\nHe falters an awkward excuse or two for his failure.\n\"Is this all you have to say?\" inquires Lady Dedlock, having heard him out--or as nearly out as he can stumble.\nMr. Guppy thinks that's all.\n\"You had better be sure that you wish to say nothing more to me, this being the last time you will have the opportunity.\"\nMr. Guppy is quite sure. And indeed he has no such wish at present, by any means.\n\"That is enough. I will dispense with excuses. Good evening to you!\" And she rings for Mercury to show the young man of the name of Guppy out.\nBut in that house, in that same moment, there happens to be an old man of the name of Tulkinghorn. And that old man, coming with his quiet footstep to the library, has his hand at that moment on the handle of the door--comes in--and comes face to face with the young man as he is leaving the room.\nOne glance between the old man and the lady, and for an instant the blind that is always down flies up. Suspicion, eager and sharp, looks out. Another instant, close again.\n\"I beg your pardon, Lady Dedlock. I beg your pardon a thousand times. It is so very unusual to find you here at this hour. I supposed the room was empty. I beg your pardon!\"\n\"Stay!\" She negligently calls him back. \"Remain here, I beg. I am going out to dinner. I have nothing more to say to this young man!\"\nThe disconcerted young man bows, as he goes out, and cringingly hopes that Mr. Tulkinghorn of the Fields is well.\n\"Aye, aye?\" says the lawyer, looking at him from under his bent brows, though he has no need to look again--not he. \"From Kenge and Carboy's, surely?\"\n\"Kenge and Carboy's, Mr. Tulkinghorn. Name of Guppy, sir.\"\n\"To be sure. Why, thank you, Mr. Guppy, I am very well!\"\n\"Happy to hear it, sir. You can't be too well, sir, for the credit of the profession.\"\n\"Thank you, Mr. Guppy!\"\nMr. Guppy sneaks away. Mr. Tulkinghorn, such a foil in his old-fashioned rusty black to Lady Dedlock's brightness, hands her down the staircase to her carriage. He returns rubbing his chin, and rubs it a good deal in the course of the evening.",
        "paragraph_chars": [
            [
                0,
                2875
            ],
            [
                2875,
                4166
            ],
            [
                4166,
                4533
            ],
            [
                4533,
                5115
            ],
            [
                5115,
                5596
            ],
            [
                5596,
                6154
            ],
            [
                6154,
                6233
            ],
            [
                6233,
                6326
            ],
            [
                6326,
                6523
            ],
            [
                6523,
                6633
            ],
            [
                6633,
                6671
            ],
            [
                6671,
                6703
            ],
            [
                6703,
                6952
            ],
            [
                6952,
                7067
            ],
            [
                7067,
                7348
            ],
            [
                7348,
                7493
            ],
            [
                7493,
                7518
            ],
            [
                7518,
                7559
            ],
            [
                7559,
                7675
            ],
            [
                7675,
                7802
            ],
            [
                7802,
                7874
            ],
            [
                7874,
                7947
            ],
            [
                7947,
                8178
            ],
            [
                8178,
                8249
            ],
            [
                8249,
                8542
            ],
            [
                8542,
                8579
            ],
            [
                8579,
                8998
            ],
            [
                8998,
                9191
            ],
            [
                9191,
                9238
            ],
            [
                9238,
                9488
            ],
            [
                9488,
                9554
            ],
            [
                9554,
                9572
            ],
            [
                9572,
                9787
            ],
            [
                9787,
                9859
            ],
            [
                9859,
                10510
            ],
            [
                10510,
                10709
            ],
            [
                10709,
                10965
            ],
            [
                10965,
                11265
            ],
            [
                11265,
                12130
            ],
            [
                12130,
                12375
            ],
            [
                12375,
                12464
            ],
            [
                12464,
                13148
            ],
            [
                13148,
                13173
            ],
            [
                13173,
                13392
            ],
            [
                13392,
                13445
            ],
            [
                13445,
                13905
            ],
            [
                13905,
                13948
            ],
            [
                13948,
                14013
            ],
            [
                14013,
                14102
            ],
            [
                14102,
                14319
            ],
            [
                14319,
                14360
            ],
            [
                14360,
                14499
            ],
            [
                14499,
                14582
            ],
            [
                14582,
                14598
            ],
            [
                14598,
                14724
            ],
            [
                14724,
                14755
            ],
            [
                14755,
                14870
            ],
            [
                14870,
                15310
            ],
            [
                15310,
                15437
            ],
            [
                15437,
                15573
            ],
            [
                15573,
                15668
            ],
            [
                15668,
                15781
            ],
            [
                15781,
                15889
            ],
            [
                15889,
                16287
            ],
            [
                16287,
                16513
            ],
            [
                16513,
                16634
            ],
            [
                16634,
                16906
            ],
            [
                16906,
                17058
            ],
            [
                17058,
                17412
            ],
            [
                17412,
                17814
            ],
            [
                17814,
                18037
            ],
            [
                18037,
                18804
            ],
            [
                18804,
                18949
            ],
            [
                18949,
                18992
            ],
            [
                18992,
                19062
            ],
            [
                19062,
                19134
            ],
            [
                19134,
                19333
            ],
            [
                19333,
                19355
            ],
            [
                19355,
                19894
            ],
            [
                19894,
                20005
            ],
            [
                20005,
                20176
            ],
            [
                20176,
                20297
            ],
            [
                20297,
                20409
            ],
            [
                20409,
                21034
            ],
            [
                21034,
                21238
            ],
            [
                21238,
                21802
            ],
            [
                21802,
                22416
            ],
            [
                22416,
                23200
            ],
            [
                23200,
                24840
            ],
            [
                24840,
                27250
            ],
            [
                27250,
                27672
            ],
            [
                27672,
                28153
            ],
            [
                28153,
                28614
            ],
            [
                28614,
                28937
            ],
            [
                28937,
                29181
            ],
            [
                29181,
                29289
            ],
            [
                29289,
                29399
            ],
            [
                29399,
                29453
            ],
            [
                29453,
                29515
            ],
            [
                29515,
                29705
            ],
            [
                29705,
                29739
            ],
            [
                29739,
                29915
            ],
            [
                29915,
                30273
            ],
            [
                30273,
                30318
            ],
            [
                30318,
                30522
            ],
            [
                30522,
                30571
            ],
            [
                30571,
                30632
            ],
            [
                30632,
                30663
            ],
            [
                30663,
                30861
            ],
            [
                30861,
                30914
            ],
            [
                30914,
                31026
            ],
            [
                31026,
                31055
            ],
            [
                31055,
                31177
            ],
            [
                31177,
                31259
            ],
            [
                31259,
                31402
            ],
            [
                31402,
                31700
            ],
            [
                31700,
                31873
            ],
            [
                31873,
                32047
            ],
            [
                32047,
                32181
            ],
            [
                32181,
                32295
            ],
            [
                32295,
                32446
            ],
            [
                32446,
                32505
            ],
            [
                32505,
                32562
            ],
            [
                32562,
                32649
            ],
            [
                32649,
                32673
            ],
            [
                32673,
                32916
            ]
        ],
        "segment_chars": [
            [
                0,
                389
            ],
            [
                389,
                629
            ],
            [
                629,
                1290
            ],
            [
                1290,
                2228
            ],
            [
                2228,
                2563
            ],
            [
                2563,
                2875
            ],
            [
                2875,
                3039
            ],
            [
                3039,
                3165
            ],
            [
                3165,
                3336
            ],
            [
                3336,
                3449
            ],
            [
                3449,
                3590
            ],
            [
                3590,
                3828
            ],
            [
                3828,
                4043
            ],
            [
                4043,
                4166
            ],
            [
                4166,
                4318
            ],
            [
                4318,
                4533
            ],
            [
                4533,
                4864
            ],
            [
                4864,
                5024
            ],
            [
                5024,
                5115
            ],
            [
                5115,
                5345
            ],
            [
                5345,
                5560
            ],
            [
                5560,
                5596
            ],
            [
                5596,
                5689
            ],
            [
                5689,
                5891
            ],
            [
                5891,
                6154
            ],
            [
                6154,
                6182
            ],
            [
                6182,
                6211
            ],
            [
                6211,
                6233
            ],
            [
                6233,
                6281
            ],
            [
                6281,
                6301
            ],
            [
                6301,
                6326
            ],
            [
                6326,
                6523
            ],
            [
                6523,
                6533
            ],
            [
                6533,
                6556
            ],
            [
                6556,
                6601
            ],
            [
                6601,
                6633
            ],
            [
                6633,
                6653
            ],
            [
                6653,
                6671
            ],
            [
                6671,
                6678
            ],
            [
                6678,
                6682
            ],
            [
                6682,
                6703
            ],
            [
                6703,
                6952
            ],
            [
                6952,
                6978
            ],
            [
                6978,
                6997
            ],
            [
                6997,
                7016
            ],
            [
                7016,
                7053
            ],
            [
                7053,
                7067
            ],
            [
                7067,
                7158
            ],
            [
                7158,
                7348
            ],
            [
                7348,
                7430
            ],
            [
                7430,
                7493
            ],
            [
                7493,
                7518
            ],
            [
                7518,
                7559
            ],
            [
                7559,
                7566
            ],
            [
                7566,
                7675
            ],
            [
                7675,
                7727
            ],
            [
                7727,
                7802
            ],
            [
                7802,
                7855
            ],
            [
                7855,
                7874
            ],
            [
                7874,
                7947
            ],
            [
                7947,
                8029
            ],
            [
                8029,
                8044
            ],
            [
                8044,
                8126
            ],
            [
                8126,
                8178
            ],
            [
                8178,
                8249
            ],
            [
                8249,
                8411
            ],
            [
                8411,
                8450
            ],
            [
                8450,
                8542
            ],
            [
                8542,
                8579
            ],
            [
                8579,
                8658
            ],
            [
                8658,
                8742
            ],
            [
                8742,
                8935
            ],
            [
                8935,
                8998
            ],
            [
                8998,
                9191
            ],
            [
                9191,
                9215
            ],
            [
                9215,
                9238
            ],
            [
                9238,
                9364
            ],
            [
                9364,
                9414
            ],
            [
                9414,
                9488
            ],
            [
                9488,
                9511
            ],
            [
                9511,
                9554
            ],
            [
                9554,
                9572
            ],
            [
                9572,
                9787
            ],
            [
                9787,
                9840
            ],
            [
                9840,
                9859
            ],
            [
                9859,
                10073
            ],
            [
                10073,
                10306
            ],
            [
                10306,
                10510
            ],
            [
                10510,
                10709
            ],
            [
                10709,
                10965
            ],
            [
                10965,
                11001
            ],
            [
                11001,
                11063
            ],
            [
                11063,
                11139
            ],
            [
                11139,
                11202
            ],
            [
                11202,
                11265
            ],
            [
                11265,
                11533
            ],
            [
                11533,
                11679
            ],
            [
                11679,
                11724
            ],
            [
                11724,
                11770
            ],
            [
                11770,
                11814
            ],
            [
                11814,
                11866
            ],
            [
                11866,
                11909
            ],
            [
                11909,
                11951
            ],
            [
                11951,
                11993
            ],
            [
                11993,
                12038
            ],
            [
                12038,
                12130
            ],
            [
                12130,
                12248
            ],
            [
                12248,
                12302
            ],
            [
                12302,
                12375
            ],
            [
                12375,
                12380
            ],
            [
                12380,
                12395
            ],
            [
                12395,
                12432
            ],
            [
                12432,
                12464
            ],
            [
                12464,
                12788
            ],
            [
                12788,
                12905
            ],
            [
                12905,
                13051
            ],
            [
                13051,
                13148
            ],
            [
                13148,
                13161
            ],
            [
                13161,
                13173
            ],
            [
                13173,
                13209
            ],
            [
                13209,
                13392
            ],
            [
                13392,
                13416
            ],
            [
                13416,
                13445
            ],
            [
                13445,
                13688
            ],
            [
                13688,
                13753
            ],
            [
                13753,
                13905
            ],
            [
                13905,
                13911
            ],
            [
                13911,
                13931
            ],
            [
                13931,
                13948
            ],
            [
                13948,
                13989
            ],
            [
                13989,
                14013
            ],
            [
                14013,
                14102
            ],
            [
                14102,
                14319
            ],
            [
                14319,
                14339
            ],
            [
                14339,
                14360
            ],
            [
                14360,
                14458
            ],
            [
                14458,
                14499
            ],
            [
                14499,
                14515
            ],
            [
                14515,
                14528
            ],
            [
                14528,
                14582
            ],
            [
                14582,
                14598
            ],
            [
                14598,
                14724
            ],
            [
                14724,
                14755
            ],
            [
                14755,
                14765
            ],
            [
                14765,
                14792
            ],
            [
                14792,
                14870
            ],
            [
                14870,
                15246
            ],
            [
                15246,
                15310
            ],
            [
                15310,
                15326
            ],
            [
                15326,
                15377
            ],
            [
                15377,
                15407
            ],
            [
                15407,
                15437
            ],
            [
                15437,
                15442
            ],
            [
                15442,
                15452
            ],
            [
                15452,
                15482
            ],
            [
                15482,
                15573
            ],
            [
                15573,
                15668
            ],
            [
                15668,
                15781
            ],
            [
                15781,
                15882
            ],
            [
                15882,
                15889
            ],
            [
                15889,
                16040
            ],
            [
                16040,
                16287
            ],
            [
                16287,
                16501
            ],
            [
                16501,
                16513
            ],
            [
                16513,
                16593
            ],
            [
                16593,
                16634
            ],
            [
                16634,
                16705
            ],
            [
                16705,
                16860
            ],
            [
                16860,
                16906
            ],
            [
                16906,
                16993
            ],
            [
                16993,
                17058
            ],
            [
                17058,
                17079
            ],
            [
                17079,
                17172
            ],
            [
                17172,
                17240
            ],
            [
                17240,
                17291
            ],
            [
                17291,
                17329
            ],
            [
                17329,
                17374
            ],
            [
                17374,
                17384
            ],
            [
                17384,
                17397
            ],
            [
                17397,
                17412
            ],
            [
                17412,
                17543
            ],
            [
                17543,
                17814
            ],
            [
                17814,
                17826
            ],
            [
                17826,
                17897
            ],
            [
                17897,
                17911
            ],
            [
                17911,
                17934
            ],
            [
                17934,
                17958
            ],
            [
                17958,
                18026
            ],
            [
                18026,
                18037
            ],
            [
                18037,
                18298
            ],
            [
                18298,
                18804
            ],
            [
                18804,
                18911
            ],
            [
                18911,
                18949
            ],
            [
                18949,
                18968
            ],
            [
                18968,
                18992
            ],
            [
                18992,
                19012
            ],
            [
                19012,
                19035
            ],
            [
                19035,
                19062
            ],
            [
                19062,
                19134
            ],
            [
                19134,
                19333
            ],
            [
                19333,
                19339
            ],
            [
                19339,
                19355
            ],
            [
                19355,
                19417
            ],
            [
                19417,
                19500
            ],
            [
                19500,
                19523
            ],
            [
                19523,
                19564
            ],
            [
                19564,
                19663
            ],
            [
                19663,
                19752
            ],
            [
                19752,
                19894
            ],
            [
                19894,
                20005
            ],
            [
                20005,
                20142
            ],
            [
                20142,
                20176
            ],
            [
                20176,
                20260
            ],
            [
                20260,
                20297
            ],
            [
                20297,
                20409
            ],
            [
                20409,
                20603
            ],
            [
                20603,
                20633
            ],
            [
                20633,
                20669
            ],
            [
                20669,
                20821
            ],
            [
                20821,
                20939
            ],
            [
                20939,
                21034
            ],
            [
                21034,
                21138
            ],
            [
                21138,
                21174
            ],
            [
                21174,
                21238
            ],
            [
                21238,
                21275
            ],
            [
                21275,
                21379
            ],
            [
                21379,
                21422
            ],
            [
                21422,
                21487
            ],
            [
                21487,
                21537
            ],
            [
                21537,
                21802
            ],
            [
                21802,
                21935
            ],
            [
                21935,
                21976
            ],
            [
                21976,
                22077
            ],
            [
                22077,
                22138
            ],
            [
                22138,
                22211
            ],
            [
                22211,
                22391
            ],
            [
                22391,
                22405
            ],
            [
                22405,
                22416
            ],
            [
                22416,
                22610
            ],
            [
                22610,
                22683
            ],
            [
                22683,
                22957
            ],
            [
                22957,
                23200
            ],
            [
                23200,
                23332
            ],
            [
                23332,
                23498
            ],
            [
                23498,
                23766
            ],
            [
                23766,
                23959
            ],
            [
                23959,
                24395
            ],
            [
                24395,
                24597
            ],
            [
                24597,
                24840
            ],
            [
                24840,
                25164
            ],
            [
                25164,
                26248
            ],
            [
                26248,
                26395
            ],
            [
                26395,
                26778
            ],
            [
                26778,
                26974
            ],
            [
                26974,
                27250
            ],
            [
                27250,
                27606
            ],
            [
                27606,
                27672
            ],
            [
                27672,
                27986
            ],
            [
                27986,
                28153
            ],
            [
                28153,
                28450
            ],
            [
                28450,
                28538
            ],
            [
                28538,
                28614
            ],
            [
                28614,
                28764
            ],
            [
                28764,
                28844
            ],
            [
                28844,
                28937
            ],
            [
                28937,
                29070
            ],
            [
                29070,
                29101
            ],
            [
                29101,
                29110
            ],
            [
                29110,
                29181
            ],
            [
                29181,
                29256
            ],
            [
                29256,
                29289
            ],
            [
                29289,
                29331
            ],
            [
                29331,
                29399
            ],
            [
                29399,
                29421
            ],
            [
                29421,
                29453
            ],
            [
                29453,
                29473
            ],
            [
                29473,
                29515
            ],
            [
                29515,
                29705
            ],
            [
                29705,
                29739
            ],
            [
                29739,
                29774
            ],
            [
                29774,
                29915
            ],
            [
                29915,
                30016
            ],
            [
                30016,
                30273
            ],
            [
                30273,
                30306
            ],
            [
                30306,
                30318
            ],
            [
                30318,
                30479
            ],
            [
                30479,
                30522
            ],
            [
                30522,
                30571
            ],
            [
                30571,
                30632
            ],
            [
                30632,
                30663
            ],
            [
                30663,
                30724
            ],
            [
                30724,
                30861
            ],
            [
                30861,
                30914
            ],
            [
                30914,
                30945
            ],
            [
                30945,
                31026
            ],
            [
                31026,
                31055
            ],
            [
                31055,
                31177
            ],
            [
                31177,
                31202
            ],
            [
                31202,
                31259
            ],
            [
                31259,
                31276
            ],
            [
                31276,
                31306
            ],
            [
                31306,
                31328
            ],
            [
                31328,
                31402
            ],
            [
                31402,
                31501
            ],
            [
                31501,
                31700
            ],
            [
                31700,
                31804
            ],
            [
                31804,
                31843
            ],
            [
                31843,
                31873
            ],
            [
                31873,
                31907
            ],
            [
                31907,
                31943
            ],
            [
                31943,
                31996
            ],
            [
                31996,
                32027
            ],
            [
                32027,
                32047
            ],
            [
                32047,
                32055
            ],
            [
                32055,
                32087
            ],
            [
                32087,
                32108
            ],
            [
                32108,
                32134
            ],
            [
                32134,
                32181
            ],
            [
                32181,
                32295
            ],
            [
                32295,
                32307
            ],
            [
                32307,
                32411
            ],
            [
                32411,
                32446
            ],
            [
                32446,
                32484
            ],
            [
                32484,
                32505
            ],
            [
                32505,
                32518
            ],
            [
                32518,
                32562
            ],
            [
                32562,
                32586
            ],
            [
                32586,
                32649
            ],
            [
                32649,
                32673
            ],
            [
                32673,
                32696
            ],
            [
                32696,
                32834
            ],
            [
                32834,
                32916
            ]
        ],
        "overlap_chars": [
            [
                7,
                26
            ],
            [
                69,
                142
            ],
            [
                153,
                178
            ],
            [
                185,
                186
            ],
            [
                284,
                306
            ],
            [
                340,
                345
            ],
            [
                387,
                389
            ],
            [
                396,
                410
            ],
            [
                441,
                553
            ],
            [
                568,
                581
            ],
            [
                596,
                629
            ],
            [
                1297,
                1301
            ],
            [
                1307,
                1341
            ],
            [
                1381,
                1448
            ],
            [
                2284,
                2290
            ],
            [
                2303,
                2318
            ],
            [
                2350,
                2355
            ],
            [
                2385,
                2413
            ],
            [
                2460,
                2468
            ],
            [
                1458,
                1461
            ],
            [
                2447,
                2455
            ],
            [
                2474,
                2508
            ],
            [
                2527,
                2535
            ],
            [
                2561,
                2563
            ],
            [
                2563,
                2611
            ],
            [
                2682,
                2704
            ],
            [
                2873,
                2875
            ],
            [
                2875,
                2890
            ],
            [
                2914,
                2926
            ],
            [
                2931,
                2946
            ],
            [
                2994,
                3001
            ],
            [
                2954,
                2965
            ],
            [
                3002,
                3021
            ],
            [
                3037,
                3039
            ],
            [
                3039,
                3121
            ],
            [
                3140,
                3165
            ],
            [
                3165,
                3172
            ],
            [
                3307,
                3309
            ],
            [
                3297,
                3306
            ],
            [
                3327,
                3336
            ],
            [
                3346,
                3353
            ],
            [
                3359,
                3366
            ],
            [
                3408,
                3424
            ],
            [
                3430,
                3448
            ],
            [
                4166,
                4205
            ],
            [
                4221,
                4223
            ],
            [
                4213,
                4220
            ],
            [
                4224,
                4265
            ],
            [
                4288,
                4317
            ],
            [
                4318,
                4344
            ],
            [
                4431,
                4434
            ],
            [
                4355,
                4379
            ],
            [
                4442,
                4443
            ],
            [
                4445,
                4462
            ],
            [
                4471,
                4533
            ],
            [
                4533,
                4690
            ],
            [
                4697,
                4791
            ],
            [
                4862,
                4864
            ],
            [
                4864,
                4904
            ],
            [
                4911,
                4931
            ],
            [
                5022,
                5023
            ],
            [
                5115,
                5152
            ],
            [
                5356,
                5392
            ],
            [
                5328,
                5330
            ],
            [
                5393,
                5400
            ],
            [
                5558,
                5560
            ],
            [
                5891,
                6022
            ],
            [
                6152,
                6154
            ],
            [
                6154,
                6182
            ],
            [
                6182,
                6209
            ],
            [
                6209,
                6211
            ],
            [
                6211,
                6230
            ],
            [
                6327,
                6331
            ],
            [
                6409,
                6469
            ],
            [
                6491,
                6523
            ],
            [
                6523,
                6533
            ],
            [
                6533,
                6540
            ],
            [
                6545,
                6556
            ],
            [
                6556,
                6570
            ],
            [
                6585,
                6594
            ],
            [
                6599,
                6601
            ],
            [
                6601,
                6612
            ],
            [
                6630,
                6633
            ],
            [
                6703,
                6714
            ],
            [
                6783,
                6865
            ],
            [
                6881,
                6891
            ],
            [
                6899,
                6922
            ],
            [
                6950,
                6952
            ],
            [
                6952,
                6978
            ],
            [
                6984,
                6997
            ],
            [
                6997,
                7008
            ],
            [
                7014,
                7016
            ],
            [
                7016,
                7053
            ],
            [
                7053,
                7063
            ],
            [
                7067,
                7158
            ],
            [
                7158,
                7161
            ],
            [
                7169,
                7188
            ],
            [
                7194,
                7213
            ],
            [
                7276,
                7329
            ],
            [
                7338,
                7348
            ],
            [
                7348,
                7428
            ],
            [
                7493,
                7518
            ],
            [
                7518,
                7559
            ],
            [
                7559,
                7566
            ],
            [
                7566,
                7584
            ],
            [
                7636,
                7648
            ],
            [
                7661,
                7675
            ],
            [
                7675,
                7727
            ],
            [
                7727,
                7729
            ],
            [
                7765,
                7770
            ],
            [
                7736,
                7748
            ],
            [
                7775,
                7780
            ],
            [
                7800,
                7802
            ],
            [
                7802,
                7853
            ],
            [
                7874,
                7947
            ],
            [
                7947,
                7964
            ],
            [
                7978,
                7982
            ],
            [
                7969,
                7974
            ],
            [
                7986,
                7998
            ],
            [
                8011,
                8026
            ],
            [
                8088,
                8126
            ],
            [
                8126,
                8178
            ],
            [
                8178,
                8249
            ],
            [
                8249,
                8285
            ],
            [
                8291,
                8295
            ],
            [
                8305,
                8372
            ],
            [
                8409,
                8411
            ],
            [
                8450,
                8542
            ],
            [
                8542,
                8579
            ],
            [
                8579,
                8658
            ],
            [
                8742,
                8762
            ],
            [
                8764,
                8766
            ],
            [
                8770,
                8782
            ],
            [
                8784,
                8789
            ],
            [
                8803,
                8805
            ],
            [
                8790,
                8794
            ],
            [
                8806,
                8810
            ],
            [
                8905,
                8906
            ],
            [
                8845,
                8866
            ],
            [
                8872,
                8905
            ],
            [
                8933,
                8935
            ],
            [
                8935,
                8986
            ],
            [
                8996,
                8998
            ],
            [
                8998,
                9013
            ],
            [
                9035,
                9038
            ],
            [
                9079,
                9082
            ],
            [
                9048,
                9052
            ],
            [
                9144,
                9191
            ],
            [
                9191,
                9215
            ],
            [
                9215,
                9238
            ],
            [
                9238,
                9266
            ],
            [
                9274,
                9295
            ],
            [
                9415,
                9462
            ],
            [
                9485,
                9488
            ],
            [
                9488,
                9511
            ],
            [
                9511,
                9554
            ],
            [
                9554,
                9560
            ],
            [
                9562,
                9568
            ],
            [
                9572,
                9609
            ],
            [
                9616,
                9633
            ],
            [
                9644,
                9787
            ],
            [
                9787,
                9796
            ],
            [
                9840,
                9859
            ],
            [
                9859,
                9870
            ],
            [
                10027,
                10038
            ],
            [
                9877,
                9880
            ],
            [
                10052,
                10073
            ],
            [
                10073,
                10176
            ],
            [
                10222,
                10273
            ],
            [
                10294,
                10306
            ],
            [
                10346,
                10348
            ],
            [
                10360,
                10411
            ],
            [
                10508,
                10510
            ],
            [
                10510,
                10592
            ],
            [
                10607,
                10628
            ],
            [
                10707,
                10709
            ],
            [
                10709,
                10725
            ],
            [
                10742,
                10786
            ],
            [
                10851,
                10912
            ],
            [
                10962,
                10965
            ],
            [
                10965,
                11001
            ],
            [
                11001,
                11057
            ],
            [
                11061,
                11063
            ],
            [
                11063,
                11139
            ],
            [
                11139,
                11202
            ],
            [
                11202,
                11219
            ],
            [
                11227,
                11262
            ],
            [
                11572,
                11678
            ],
            [
                11690,
                11723
            ],
            [
                11754,
                11769
            ],
            [
                11798,
                11813
            ],
            [
                11850,
                11865
            ],
            [
                11894,
                11908
            ],
            [
                11939,
                11950
            ],
            [
                11979,
                11992
            ],
            [
                12023,
                12037
            ],
            [
                12014,
                12021
            ],
            [
                12002,
                12004
            ],
            [
                12006,
                12013
            ],
            [
                12004,
                12005
            ],
            [
                12038,
                12130
            ],
            [
                12130,
                12152
            ],
            [
                12157,
                12160
            ],
            [
                12173,
                12213
            ],
            [
                12246,
                12248
            ],
            [
                12252,
                12302
            ],
            [
                12332,
                12371
            ],
            [
                12375,
                12380
            ],
            [
                12380,
                12395
            ],
            [
                12395,
                12411
            ],
            [
                12430,
                12432
            ],
            [
                12432,
                12464
            ],
            [
                12630,
                12636
            ],
            [
                12642,
                12647
            ],
            [
                12486,
                12490
            ],
            [
                12729,
                12768
            ],
            [
                12786,
                12788
            ],
            [
                12788,
                12844
            ],
            [
                12866,
                12905
            ],
            [
                12914,
                13034
            ],
            [
                13048,
                13050
            ],
            [
                13148,
                13159
            ],
            [
                13262,
                13392
            ],
            [
                13392,
                13416
            ],
            [
                13416,
                13426
            ],
            [
                13433,
                13445
            ],
            [
                13445,
                13467
            ],
            [
                13496,
                13688
            ],
            [
                13688,
                13737
            ],
            [
                13739,
                13753
            ],
            [
                13835,
                13905
            ],
            [
                13931,
                13948
            ],
            [
                13948,
                13989
            ],
            [
                13989,
                14013
            ],
            [
                14013,
                14102
            ],
            [
                14102,
                14145
            ],
            [
                14152,
                14259
            ],
            [
                14265,
                14319
            ],
            [
                14319,
                14339
            ],
            [
                14339,
                14359
            ],
            [
                14598,
                14643
            ],
            [
                14870,
                14871
            ],
            [
                14908,
                14911
            ],
            [
                14876,
                14891
            ],
            [
                14940,
                14986
            ],
            [
                14993,
                15000
            ],
            [
                15021,
                15168
            ],
            [
                15243,
                15246
            ],
            [
                15246,
                15283
            ],
            [
                15300,
                15310
            ],
            [
                15310,
                15324
            ],
            [
                15377,
                15407
            ],
            [
                15407,
                15434
            ],
            [
                15889,
                15903
            ],
            [
                15917,
                15978
            ],
            [
                15987,
                16002
            ],
            [
                16038,
                16040
            ],
            [
                16040,
                16056
            ],
            [
                16166,
                16181
            ],
            [
                16094,
                16097
            ],
            [
                16188,
                16192
            ],
            [
                16135,
                16150
            ],
            [
                16194,
                16287
            ],
            [
                16342,
                16452
            ],
            [
                16327,
                16330
            ],
            [
                16453,
                16499
            ],
            [
                16513,
                16552
            ],
            [
                16580,
                16593
            ],
            [
                16593,
                16607
            ],
            [
                16632,
                16634
            ],
            [
                16634,
                16705
            ],
            [
                16705,
                16730
            ],
            [
                16758,
                16788
            ],
            [
                16801,
                16858
            ],
            [
                16906,
                16915
            ],
            [
                16993,
                16996
            ],
            [
                16925,
                16935
            ],
            [
                17056,
                17057
            ],
            [
                17412,
                17466
            ],
            [
                17476,
                17543
            ],
            [
                17720,
                17761
            ],
            [
                17780,
                17814
            ],
            [
                17814,
                17826
            ],
            [
                17826,
                17846
            ],
            [
                17866,
                17877
            ],
            [
                17883,
                17897
            ],
            [
                17897,
                17911
            ],
            [
                17911,
                17934
            ],
            [
                17958,
                18000
            ],
            [
                18013,
                18026
            ],
            [
                18026,
                18037
            ],
            [
                18037,
                18041
            ],
            [
                18078,
                18080
            ],
            [
                18060,
                18077
            ],
            [
                18229,
                18230
            ],
            [
                18095,
                18096
            ],
            [
                18184,
                18198
            ],
            [
                18145,
                18183
            ],
            [
                18296,
                18298
            ],
            [
                18603,
                18620
            ],
            [
                18631,
                18642
            ],
            [
                18498,
                18509
            ],
            [
                18514,
                18519
            ],
            [
                18645,
                18672
            ],
            [
                18688,
                18691
            ],
            [
                18741,
                18762
            ],
            [
                18804,
                18840
            ],
            [
                18846,
                18911
            ],
            [
                18911,
                18931
            ],
            [
                18946,
                18949
            ],
            [
                18949,
                18968
            ],
            [
                18968,
                18992
            ],
            [
                19134,
                19135
            ],
            [
                19135,
                19243
            ],
            [
                19281,
                19333
            ],
            [
                19333,
                19339
            ],
            [
                19339,
                19355
            ],
            [
                19355,
                19396
            ],
            [
                19398,
                19417
            ],
            [
                19472,
                19474
            ],
            [
                19425,
                19431
            ],
            [
                19432,
                19437
            ],
            [
                19498,
                19500
            ],
            [
                19523,
                19539
            ],
            [
                19562,
                19564
            ],
            [
                19564,
                19663
            ],
            [
                19663,
                19728
            ],
            [
                19741,
                19750
            ],
            [
                19894,
                20005
            ],
            [
                20142,
                20143
            ],
            [
                20152,
                20173
            ],
            [
                20176,
                20184
            ],
            [
                20190,
                20223
            ],
            [
                20246,
                20259
            ],
            [
                20297,
                20325
            ],
            [
                20336,
                20353
            ],
            [
                20409,
                20443
            ],
            [
                20468,
                20544
            ],
            [
                20601,
                20603
            ],
            [
                20603,
                20633
            ],
            [
                20633,
                20667
            ],
            [
                20684,
                20685
            ],
            [
                20669,
                20684
            ],
            [
                20767,
                20821
            ],
            [
                20821,
                20861
            ],
            [
                20866,
                20872
            ],
            [
                20873,
                20881
            ],
            [
                20937,
                20939
            ],
            [
                20939,
                21034
            ],
            [
                21034,
                21068
            ],
            [
                21088,
                21138
            ],
            [
                21138,
                21172
            ],
            [
                21238,
                21262
            ],
            [
                21269,
                21272
            ],
            [
                21471,
                21473
            ],
            [
                21479,
                21485
            ],
            [
                21272,
                21274
            ],
            [
                21275,
                21316
            ],
            [
                21328,
                21378
            ],
            [
                21487,
                21537
            ],
            [
                21537,
                21555
            ],
            [
                21611,
                21679
            ],
            [
                21709,
                21802
            ],
            [
                21802,
                21935
            ],
            [
                21935,
                21976
            ],
            [
                22156,
                22211
            ],
            [
                22211,
                22239
            ],
            [
                22244,
                22251
            ],
            [
                22340,
                22342
            ],
            [
                22349,
                22375
            ],
            [
                22381,
                22391
            ],
            [
                22395,
                22403
            ],
            [
                22416,
                22459
            ],
            [
                22608,
                22610
            ],
            [
                22610,
                22641
            ],
            [
                22681,
                22683
            ],
            [
                22683,
                22722
            ],
            [
                22743,
                22801
            ],
            [
                22802,
                22804
            ],
            [
                22830,
                22863
            ],
            [
                22864,
                22932
            ],
            [
                22955,
                22957
            ],
            [
                22957,
                22973
            ],
            [
                22982,
                22991
            ],
            [
                22999,
                23001
            ],
            [
                23045,
                23050
            ],
            [
                23069,
                23072
            ],
            [
                23078,
                23087
            ],
            [
                23088,
                23200
            ],
            [
                23215,
                23219
            ],
            [
                23278,
                23332
            ],
            [
                23332,
                23373
            ],
            [
                23393,
                23419
            ],
            [
                23496,
                23498
            ],
            [
                24395,
                24413
            ],
            [
                24442,
                24597
            ],
            [
                24597,
                24643
            ],
            [
                24669,
                24725
            ],
            [
                24749,
                24756
            ],
            [
                24838,
                24840
            ],
            [
                24840,
                24856
            ],
            [
                24882,
                24920
            ],
            [
                24922,
                24944
            ],
            [
                24993,
                25000
            ],
            [
                24956,
                24968
            ],
            [
                25046,
                25164
            ],
            [
                25164,
                25189
            ],
            [
                25213,
                25302
            ],
            [
                25309,
                25457
            ],
            [
                25802,
                25803
            ],
            [
                26104,
                26142
            ],
            [
                26156,
                26178
            ],
            [
                25607,
                25609
            ],
            [
                26047,
                26053
            ],
            [
                26194,
                26247
            ],
            [
                26248,
                26319
            ],
            [
                26393,
                26395
            ],
            [
                26400,
                26411
            ],
            [
                26426,
                26427
            ],
            [
                26436,
                26445
            ],
            [
                26416,
                26422
            ],
            [
                26445,
                26540
            ],
            [
                26566,
                26619
            ],
            [
                26640,
                26657
            ],
            [
                26548,
                26550
            ],
            [
                26683,
                26756
            ],
            [
                26774,
                26776
            ],
            [
                26808,
                26812
            ],
            [
                26879,
                26973
            ],
            [
                27250,
                27291
            ],
            [
                27297,
                27331
            ],
            [
                27387,
                27418
            ],
            [
                27445,
                27451
            ],
            [
                27555,
                27557
            ],
            [
                27456,
                27513
            ],
            [
                27523,
                27533
            ],
            [
                27563,
                27606
            ],
            [
                27606,
                27672
            ],
            [
                27697,
                27706
            ],
            [
                27871,
                27986
            ],
            [
                27986,
                28031
            ],
            [
                28089,
                28102
            ],
            [
                28032,
                28036
            ],
            [
                28123,
                28127
            ],
            [
                28043,
                28046
            ],
            [
                28136,
                28153
            ],
            [
                28169,
                28191
            ],
            [
                28304,
                28305
            ],
            [
                28335,
                28450
            ],
            [
                28777,
                28843
            ],
            [
                28937,
                29027
            ],
            [
                29041,
                29070
            ],
            [
                29070,
                29101
            ],
            [
                29101,
                29106
            ],
            [
                29108,
                29110
            ],
            [
                29110,
                29153
            ],
            [
                29179,
                29181
            ],
            [
                29181,
                29183
            ],
            [
                29192,
                29256
            ],
            [
                29256,
                29285
            ],
            [
                29289,
                29331
            ],
            [
                29331,
                29373
            ],
            [
                29397,
                29399
            ],
            [
                29399,
                29421
            ],
            [
                29516,
                29517
            ],
            [
                29609,
                29652
            ],
            [
                29702,
                29705
            ],
            [
                29705,
                29739
            ],
            [
                29739,
                29740
            ],
            [
                29756,
                29774
            ],
            [
                29774,
                29783
            ],
            [
                29807,
                29808
            ],
            [
                29784,
                29807
            ],
            [
                29823,
                29915
            ],
            [
                29915,
                30016
            ],
            [
                30016,
                30062
            ],
            [
                30072,
                30077
            ],
            [
                30088,
                30102
            ],
            [
                30166,
                30182
            ],
            [
                30187,
                30273
            ],
            [
                30273,
                30291
            ],
            [
                30304,
                30306
            ],
            [
                30306,
                30318
            ],
            [
                30390,
                30431
            ],
            [
                30434,
                30465
            ],
            [
                30469,
                30479
            ],
            [
                30479,
                30522
            ],
            [
                30522,
                30571
            ],
            [
                30632,
                30662
            ],
            [
                30666,
                30668
            ],
            [
                30675,
                30718
            ],
            [
                30914,
                30942
            ],
            [
                31056,
                31177
            ],
            [
                31177,
                31201
            ],
            [
                31259,
                31276
            ],
            [
                31306,
                31328
            ],
            [
                31328,
                31345
            ],
            [
                31362,
                31365
            ],
            [
                31372,
                31375
            ],
            [
                31354,
                31361
            ],
            [
                31391,
                31402
            ],
            [
                31402,
                31501
            ],
            [
                31501,
                31504
            ],
            [
                31676,
                31678
            ],
            [
                31621,
                31626
            ],
            [
                31553,
                31564
            ],
            [
                31673,
                31675
            ],
            [
                31659,
                31672
            ],
            [
                31679,
                31700
            ],
            [
                31700,
                31763
            ],
            [
                31804,
                31842
            ],
            [
                31873,
                31907
            ],
            [
                31996,
                32025
            ],
            [
                32047,
                32055
            ],
            [
                32055,
                32087
            ],
            [
                32087,
                32088
            ],
            [
                32095,
                32108
            ],
            [
                32108,
                32134
            ],
            [
                32134,
                32181
            ],
            [
                32181,
                32271
            ],
            [
                32286,
                32295
            ],
            [
                32295,
                32307
            ],
            [
                32307,
                32364
            ],
            [
                32409,
                32411
            ],
            [
                32411,
                32446
            ],
            [
                32446,
                32447
            ],
            [
                32465,
                32484
            ],
            [
                32484,
                32505
            ],
            [
                32505,
                32518
            ],
            [
                32518,
                32562
            ],
            [
                32562,
                32584
            ],
            [
                32673,
                32695
            ],
            [
                32696,
                32711
            ],
            [
                32788,
                32793
            ],
            [
                32761,
                32773
            ],
            [
                32798,
                32834
            ],
            [
                32834,
                32916
            ]
        ],
        "row_chars": [
            [
                0,
                389
            ],
            [
                389,
                629
            ],
            [
                629,
                1290
            ],
            [
                1290,
                2563
            ],
            [
                2563,
                2875
            ],
            [
                2875,
                3039
            ],
            [
                3039,
                3165
            ],
            [
                3165,
                3336
            ],
            [
                3336,
                3449
            ],
            [
                3449,
                3590
            ],
            [
                3590,
                3828
            ],
            [
                3828,
                4043
            ],
            [
                4043,
                4166
            ],
            [
                4166,
                4318
            ],
            [
                4318,
                4533
            ],
            [
                4533,
                4864
            ],
            [
                4864,
                5024
            ],
            [
                5024,
                5115
            ],
            [
                5115,
                5560
            ],
            [
                5560,
                5596
            ],
            [
                5596,
                5689
            ],
            [
                5689,
                5891
            ],
            [
                5891,
                6154
            ],
            [
                6154,
                6182
            ],
            [
                6182,
                6211
            ],
            [
                6211,
                6233
            ],
            [
                6233,
                6281
            ],
            [
                6281,
                6301
            ],
            [
                6301,
                6326
            ],
            [
                6326,
                6523
            ],
            [
                6523,
                6533
            ],
            [
                6533,
                6556
            ],
            [
                6556,
                6601
            ],
            [
                6601,
                6633
            ],
            [
                6633,
                6653
            ],
            [
                6653,
                6671
            ],
            [
                6671,
                6678
            ],
            [
                6678,
                6682
            ],
            [
                6682,
                6703
            ],
            [
                6703,
                6952
            ],
            [
                6952,
                6978
            ],
            [
                6978,
                6997
            ],
            [
                6997,
                7016
            ],
            [
                7016,
                7053
            ],
            [
                7053,
                7067
            ],
            [
                7067,
                7158
            ],
            [
                7158,
                7348
            ],
            [
                7348,
                7430
            ],
            [
                7430,
                7493
            ],
            [
                7493,
                7518
            ],
            [
                7518,
                7559
            ],
            [
                7559,
                7566
            ],
            [
                7566,
                7675
            ],
            [
                7675,
                7727
            ],
            [
                7727,
                7802
            ],
            [
                7802,
                7855
            ],
            [
                7855,
                7874
            ],
            [
                7874,
                7947
            ],
            [
                7947,
                8029
            ],
            [
                8029,
                8044
            ],
            [
                8044,
                8126
            ],
            [
                8126,
                8178
            ],
            [
                8178,
                8249
            ],
            [
                8249,
                8411
            ],
            [
                8411,
                8450
            ],
            [
                8450,
                8542
            ],
            [
                8542,
                8579
            ],
            [
                8579,
                8658
            ],
            [
                8658,
                8742
            ],
            [
                8742,
                8935
            ],
            [
                8935,
                8998
            ],
            [
                8998,
                9191
            ],
            [
                9191,
                9215
            ],
            [
                9215,
                9238
            ],
            [
                9238,
                9364
            ],
            [
                9364,
                9414
            ],
            [
                9414,
                9488
            ],
            [
                9488,
                9511
            ],
            [
                9511,
                9554
            ],
            [
                9554,
                9572
            ],
            [
                9572,
                9787
            ],
            [
                9787,
                9859
            ],
            [
                9859,
                10073
            ],
            [
                10073,
                10306
            ],
            [
                10306,
                10510
            ],
            [
                10510,
                10709
            ],
            [
                10709,
                10965
            ],
            [
                10965,
                11001
            ],
            [
                11001,
                11063
            ],
            [
                11063,
                11139
            ],
            [
                11139,
                11202
            ],
            [
                11202,
                11265
            ],
            [
                11265,
                11533
            ],
            [
                11533,
                11679
            ],
            [
                11679,
                11724
            ],
            [
                11724,
                11770
            ],
            [
                11770,
                11814
            ],
            [
                11814,
                11866
            ],
            [
                11866,
                11909
            ],
            [
                11909,
                11951
            ],
            [
                11951,
                11993
            ],
            [
                11993,
                12038
            ],
            [
                12038,
                12130
            ],
            [
                12130,
                12248
            ],
            [
                12248,
                12302
            ],
            [
                12302,
                12375
            ],
            [
                12375,
                12380
            ],
            [
                12380,
                12395
            ],
            [
                12395,
                12432
            ],
            [
                12432,
                12464
            ],
            [
                12464,
                12788
            ],
            [
                12788,
                12905
            ],
            [
                12905,
                13051
            ],
            [
                13051,
                13148
            ],
            [
                13148,
                13161
            ],
            [
                13161,
                13173
            ],
            [
                13173,
                13209
            ],
            [
                13209,
                13392
            ],
            [
                13392,
                13416
            ],
            [
                13416,
                13445
            ],
            [
                13445,
                13688
            ],
            [
                13688,
                13753
            ],
            [
                13753,
                13905
            ],
            [
                13905,
                13911
            ],
            [
                13911,
                13931
            ],
            [
                13931,
                13948
            ],
            [
                13948,
                13989
            ],
            [
                13989,
                14013
            ],
            [
                14013,
                14102
            ],
            [
                14102,
                14319
            ],
            [
                14319,
                14339
            ],
            [
                14339,
                14360
            ],
            [
                14360,
                14458
            ],
            [
                14458,
                14499
            ],
            [
                14499,
                14515
            ],
            [
                14515,
                14528
            ],
            [
                14528,
                14582
            ],
            [
                14582,
                14598
            ],
            [
                14598,
                14724
            ],
            [
                14724,
                14755
            ],
            [
                14755,
                14765
            ],
            [
                14765,
                14792
            ],
            [
                14792,
                14870
            ],
            [
                14870,
                15246
            ],
            [
                15246,
                15310
            ],
            [
                15310,
                15407
            ],
            [
                15407,
                15437
            ],
            [
                15437,
                15442
            ],
            [
                15442,
                15452
            ],
            [
                15452,
                15482
            ],
            [
                15482,
                15573
            ],
            [
                15573,
                15668
            ],
            [
                15668,
                15781
            ],
            [
                15781,
                15882
            ],
            [
                15882,
                15889
            ],
            [
                15889,
                16040
            ],
            [
                16040,
                16287
            ],
            [
                16287,
                16501
            ],
            [
                16501,
                16513
            ],
            [
                16513,
                16593
            ],
            [
                16593,
                16634
            ],
            [
                16634,
                16705
            ],
            [
                16705,
                16860
            ],
            [
                16860,
                16906
            ],
            [
                16906,
                17058
            ],
            [
                17058,
                17079
            ],
            [
                17079,
                17172
            ],
            [
                17172,
                17240
            ],
            [
                17240,
                17291
            ],
            [
                17291,
                17329
            ],
            [
                17329,
                17374
            ],
            [
                17374,
                17384
            ],
            [
                17384,
                17397
            ],
            [
                17397,
                17412
            ],
            [
                17412,
                17543
            ],
            [
                17543,
                17814
            ],
            [
                17814,
                17826
            ],
            [
                17826,
                17897
            ],
            [
                17897,
                17911
            ],
            [
                17911,
                17934
            ],
            [
                17934,
                17958
            ],
            [
                17958,
                18026
            ],
            [
                18026,
                18037
            ],
            [
                18037,
                18298
            ],
            [
                18298,
                18804
            ],
            [
                18804,
                18911
            ],
            [
                18911,
                18949
            ],
            [
                18949,
                18968
            ],
            [
                18968,
                18992
            ],
            [
                18992,
                19012
            ],
            [
                19012,
                19035
            ],
            [
                19035,
                19062
            ],
            [
                19062,
                19134
            ],
            [
                19134,
                19333
            ],
            [
                19333,
                19339
            ],
            [
                19339,
                19355
            ],
            [
                19355,
                19417
            ],
            [
                19417,
                19500
            ],
            [
                19500,
                19523
            ],
            [
                19523,
                19564
            ],
            [
                19564,
                19663
            ],
            [
                19663,
                19752
            ],
            [
                19752,
                19894
            ],
            [
                19894,
                20005
            ],
            [
                20005,
                20142
            ],
            [
                20142,
                20176
            ],
            [
                20176,
                20260
            ],
            [
                20260,
                20297
            ],
            [
                20297,
                20409
            ],
            [
                20409,
                20603
            ],
            [
                20603,
                20633
            ],
            [
                20633,
                20821
            ],
            [
                20821,
                20939
            ],
            [
                20939,
                21034
            ],
            [
                21034,
                21138
            ],
            [
                21138,
                21174
            ],
            [
                21174,
                21238
            ],
            [
                21238,
                21487
            ],
            [
                21487,
                21537
            ],
            [
                21537,
                21802
            ],
            [
                21802,
                21935
            ],
            [
                21935,
                21976
            ],
            [
                21976,
                22077
            ],
            [
                22077,
                22138
            ],
            [
                22138,
                22211
            ],
            [
                22211,
                22391
            ],
            [
                22391,
                22405
            ],
            [
                22405,
                22416
            ],
            [
                22416,
                22610
            ],
            [
                22610,
                22683
            ],
            [
                22683,
                22957
            ],
            [
                22957,
                23200
            ],
            [
                23200,
                23332
            ],
            [
                23332,
                23498
            ],
            [
                23498,
                23766
            ],
            [
                23766,
                23959
            ],
            [
                23959,
                24395
            ],
            [
                24395,
                24597
            ],
            [
                24597,
                24840
            ],
            [
                24840,
                25164
            ],
            [
                25164,
                26248
            ],
            [
                26248,
                26395
            ],
            [
                26395,
                26974
            ],
            [
                26974,
                27250
            ],
            [
                27250,
                27606
            ],
            [
                27606,
                27672
            ],
            [
                27672,
                27986
            ],
            [
                27986,
                28153
            ],
            [
                28153,
                28450
            ],
            [
                28450,
                28538
            ],
            [
                28538,
                28614
            ],
            [
                28614,
                28764
            ],
            [
                28764,
                28844
            ],
            [
                28844,
                28937
            ],
            [
                28937,
                29070
            ],
            [
                29070,
                29101
            ],
            [
                29101,
                29110
            ],
            [
                29110,
                29181
            ],
            [
                29181,
                29256
            ],
            [
                29256,
                29289
            ],
            [
                29289,
                29331
            ],
            [
                29331,
                29399
            ],
            [
                29399,
                29421
            ],
            [
                29421,
                29453
            ],
            [
                29453,
                29473
            ],
            [
                29473,
                29515
            ],
            [
                29515,
                29705
            ],
            [
                29705,
                29739
            ],
            [
                29739,
                29774
            ],
            [
                29774,
                29915
            ],
            [
                29915,
                30016
            ],
            [
                30016,
                30273
            ],
            [
                30273,
                30306
            ],
            [
                30306,
                30318
            ],
            [
                30318,
                30479
            ],
            [
                30479,
                30522
            ],
            [
                30522,
                30571
            ],
            [
                30571,
                30632
            ],
            [
                30632,
                30663
            ],
            [
                30663,
                30724
            ],
            [
                30724,
                30861
            ],
            [
                30861,
                30914
            ],
            [
                30914,
                30945
            ],
            [
                30945,
                31026
            ],
            [
                31026,
                31055
            ],
            [
                31055,
                31177
            ],
            [
                31177,
                31202
            ],
            [
                31202,
                31259
            ],
            [
                31259,
                31276
            ],
            [
                31276,
                31306
            ],
            [
                31306,
                31328
            ],
            [
                31328,
                31402
            ],
            [
                31402,
                31501
            ],
            [
                31501,
                31700
            ],
            [
                31700,
                31843
            ],
            [
                31843,
                31873
            ],
            [
                31873,
                31907
            ],
            [
                31907,
                31943
            ],
            [
                31943,
                31996
            ],
            [
                31996,
                32027
            ],
            [
                32027,
                32047
            ],
            [
                32047,
                32055
            ],
            [
                32055,
                32087
            ],
            [
                32087,
                32108
            ],
            [
                32108,
                32134
            ],
            [
                32134,
                32181
            ],
            [
                32181,
                32295
            ],
            [
                32295,
                32307
            ],
            [
                32307,
                32411
            ],
            [
                32411,
                32446
            ],
            [
                32446,
                32484
            ],
            [
                32484,
                32505
            ],
            [
                32505,
                32518
            ],
            [
                32518,
                32562
            ],
            [
                32562,
                32586
            ],
            [
                32586,
                32649
            ],
            [
                32649,
                32673
            ],
            [
                32673,
                32696
            ],
            [
                32696,
                32834
            ],
            [
                32834,
                32916
            ]
        ]
    },
    "abridged": {
        "text": "Those two gentlemen who attended the last coroner's inquest at the Sol's Arms reappear in the area with surprising swiftness, make enquiries through the court, and write notes. They note down how the neighbourhood of Chancery Lane was yesterday, at about midnight, thrown into a state of the most intense excitement by an alarming and horrible discovery. They write (in as many words as possible) how a very peculiar smell was observed by the inhabitants of the court, as confirmed by two married females known as Mrs. Piper and Mrs. Perkins, who regarded the foul effluvia as being emitted from the premises of Krook. All this and a great deal more the two gentlemen write down on the spot.\nThe whole court is sleepless that night, and talk of nothing but the ill-fated house. Miss Flite has been bravely rescued from her chamber, as if it were in flames, and given a bed at the Sol's Arms. The Sol stays open to offer the court comfort. It has not sold so much brandy-and-water since the inquest.\nMr. Weevle and his friend Mr. Guppy are at the bar in the Sol and are worth anything to the Sol if they will only stay there.\n\"This is not a time,\" says the landlord, \"to haggle about money; give your orders, gentlemen, and you're welcome to whatever you put a name to.\"\nThus entreated, the two gentlemen (Mr. Weevle especially) put names to so many things that in course of time they find it difficult to put a name to anything distinctly, though they still relate to all new-comers some version of the night they have had. Meanwhile, one or other of the policemen flits about the door.\nThus night pursues its leaden course, until at length with slow-retreating steps it departs. And now the neighbourhood, waking up and beginning to hear of what has happened, comes streaming in, half dressed, to ask questions.\n\"Good gracious, gentlemen!\" says Mr. Snagsby, coming up to the policemen. \"What's this I hear! Why, I was at this door last night betwixt ten and eleven o'clock talking to the young man who lodges here.\"\n\"Indeed?\" returns a policeman. \"You will find him next door. Now move on.\"\nMr. Snagsby repairs to the Sol's Arms and finds Mr. Weevle languishing over tea and toast with an expression of exhausted excitement.\n\"And Mr. Guppy likewise!\" says Mr. Snagsby. \"Dear, dear! What a fate there seems in all this! And my lit-\"\nMr. Snagsby's power of speech deserts him in the formation of the words \"my little woman.\" For that injured female walks into the Sol's Arms with her eyes fixed upon him like an accusing spirit, striking him dumb.\n\"My dear,\" says Mr. Snagsby when his tongue is loosened, \"will you take anything?\"\n\"No,\" says Mrs. Snagsby.\n\"My love, you know these two gentlemen?\"\n\"Yes!\" says Mrs. Snagsby, still fixing him with her eye.\nThe devoted Mr. Snagsby cannot bear this treatment. He leads Mrs. Snagsby aside.\n\"My little woman, why do you look at me in that way?\"\n\"I can't help my looks,\" says Mrs. Snagsby, \"and if I could I wouldn't.\"\nMr. Snagsby, with a meek cough, rejoins, \"Really, my dear? This is a dreadful mystery, my love!\" still fearfully disconcerted by Mrs. Snagsby's eye.\n\"It is,\" returns Mrs. Snagsby, shaking her head, \"a dreadful mystery.\"\n\"My little woman,\" urges Mr. Snagsby piteously, \"don't for goodness' sake speak to me with that bitter expression! Good Lord, you don't suppose that I would go spontaneously combusting any person, my dear?\"\n\"I can't say,\" returns Mrs. Snagsby.\nOn a hasty review of his unfortunate position, Mr. Snagsby \"can't say\" either. He has had something - he doesn't know what - to do in connection with this mystery, and it is possible he may be implicated, without knowing it. He faintly wipes his forehead with his handkerchief.\n\"My life,\" says he, \"why have you come into a wine-vaults before breakfast?\"\n\"Why do you come here?\" inquires Mrs. Snagsby.\n\"My dear, merely to know the facts of the fatal accident. I should then have related them to you, my love.\"\n\"I dare say you would! You relate everything to me, Mr. Snagsby.\"\n\"Every - my lit-\"\n\"I should be glad,\" says Mrs. Snagsby, contemplating his confusion with a severe and sinister smile, \"if you would come home with me; I think you may be safer there, Mr. Snagsby, than anywhere else.\"\n\"My love, I am ready to go.\"\nMr. Snagsby accompanies his wife from the Sol's Arms. Before night his doubt whether he may not be responsible for some inconceivable part in the catastrophe is almost resolved into certainty by Mrs. Snagsby's fixed gaze. He even has wandering ideas of delivering himself up to justice.\nMr. Weevle and Mr. Guppy, having taken their breakfast, step into Lincoln's Inn to walk about the square.\n\"There can be no better time than the present, Tony,\" says Mr. Guppy, \"for a word or two between us upon a point on which we must agree.\"\n\"Now, I tell you what, William G.!\" returns the other, eyeing his companion with a bloodshot gaze. \"If it's a point of conspiracy, you needn't take the trouble to mention it. I have had enough of that, and I ain't going to have any more. We shall have you catching fire next or blowing up with a bang. I should have thought it would have been a lesson to you never to conspire any more as long as you lived.\"\nMr. Guppy says, \"Who's conspiring?\"\n\"Why, you are!\"\n\"No, I am not.\"\n\"Yes, you are!\"\n\"Who says so?\"\n\"I say so!\"\n\"Oh, indeed?\"\n\"Yes, indeed!\" retorts Mr Jobling. And both being now in a heated state, they walk on silently for a while to cool down again.\n\"Tony,\" says Mr. Guppy, \"hear your friend out instead of flying at him. Your temper is hasty and you are not considerate. Although you possess all that is calculated to charm the eye-\"\n\"Oh! Blow the eye!\" cries Mr. Weevle. \"Say what you have got to say!\"\n\"Tony, I say this quite apart from any kind of conspiring. You know it is professionally arranged beforehand in all legal inquiries what facts the witnesses are to prove. Is it not desirable that we should know what facts we are to prove on the inquiry into the death of this unfortunate old gentleman?\"\n\"What facts?\"\n\"What we knew of his habits, when you saw him last, what his condition was then, the discovery that we made, and how we made it.\"\n\"Yes,\" says Mr. Weevle. \"Those are the facts.\"\n\"We made the discovery because he had, in his eccentric way, an appointment with you at twelve o'clock at night, when you were to explain some writing to him as you had often done before on account of his not being able to read. I, spending the evening with you, was called down - and so forth. It's not necessary to go beyond these facts, I suppose you'll agree?\"\n\"I suppose not.\"\n\"And this is not a conspiracy, perhaps?\" says the injured Guppy.\n\"No,\" returns his friend; \"if it's nothing worse than this, I withdraw the observation.\"\n\"Now, Tony,\" says Mr. Guppy, taking his arm and walking him slowly on, \"I should like to know, in a friendly way, whether you have yet thought over the advantages of your continuing to live at that place?\"\n\"What do you mean?\" says Tony, stopping. \"Why, I wouldn't pass another night there for anything.\"\n\"Not for the possibility of your never being disturbed in possession of the effects of a lone old man who seemed to have no relation in the world, and the certainty of your being able to find out what he really had got stored up there?\" says Mr. Guppy, biting his thumb with vexation.\n\"Certainly not,\" cries Mr. Weevle indignantly. \"Go and live there yourself!\"\nWhile they are talking, a hackney-coach drives into the square, on the box of which sits a very tall hat. Inside the coach - which stops almost at the feet of the two friends - are the venerable Mr. Smallweed and Mrs. Smallweed, accompanied by their granddaughter Judy.\nAs the tall hat (surmounting Mr. Smallweed the younger) alights, Mr. Smallweed the elder pokes his head out of the window and bawls to Mr. Guppy, \"How de do, sir!\"\n\"What do Chick and his family want here, I wonder!\" says Mr. Guppy.\n\"My dear sir,\" cries Grandfather Smallweed, \"would you do me a favour? Would you and your friend carry me into the public-house, while Bart and his sister bring their grandmother along?\"\nMr. Guppy and his friend do so. It is well that the Sol is not far off, for Mr. Weevle has an apoplectic appearance before half the distance is accomplished. But at last the benevolent old gentleman is deposited in the parlour of the Sol's Arms.\n\"Oh, Lord!\" gasps Mr. Smallweed, breathless, in an arm-chair. \"Oh, dear me! Oh, my bones and back! Sit down, you dancing, prancing, shambling poll-parrot! Sit down!\"\nThis is addressed to Mrs. Smallweed, who has a tendency to amble about whenever she finds herself on her feet. Her grandchildren hold her down in the Windsor chair, her lord in the meanwhile calling her \"a pig-headed jackdaw.\"\n\"My dear sir,\" Grandfather Smallweed proceeds, addressing Mr. Guppy, \"there has been a calamity here. Have you heard of it?\"\n\"Heard of it, sir! Why, we discovered it.\"\n\"Then, my dear friends,\" whines Grandfather Smallweed, putting out both his hands, \"I owe you a thousand thanks for discovering the ashes of Mrs. Smallweed's brother.\"\n\"Eh?\" says Mr. Guppy.\n\"Mrs. Smallweed's brother, my dear friend - her only relation. He was not on speaking terms with us. He was eccentric. Unless he has left a will (which is not at all likely) I shall take out letters of administration. I have come down to look after the property; it must be sealed up and protected.\"\n\"I think, Small,\" says the disconsolate Mr. Guppy, \"you might have mentioned that the old man was your uncle.\"\n\"I wasn't proud of him,\" says young Smallweed.\n\"Besides, it was nothing to you, you know,\" says Judy.\n\"He never saw me in his life,\" observed Small.\n\"No, he never communicated with us,\" the old gentleman strikes in, \"but I have come to look after the property. We shall make good our title. It is in the hands of my solicitor, Mr. Tulkinghorn; and grass don't grow under his feet, I can tell ye. Krook was Mrs. Smallweed's only brother; he had no other relation. I am speaking of your brother, you brimstone black-beetle, that was seventy-six years of age.\"\nMrs. Smallweed instantly begins to pipe up, \"Seventy-six pound seven and sevenpence! Seventy-six thousand bags of money!\"\n\"Will somebody give me a pot to throw at her?\" exclaims her exasperated husband, looking about him and finding no missile within his reach. \"You hag, you cat, you dog, you brimstone barker!\" Here Mr. Smallweed actually throws Judy at her grandmother in default of anything else, pushing her at the old lady with such force as he can muster and then dropping into his chair in a heap.\n\"Shake me up, somebody, if you'll be so good,\" says the voice from within the faintly struggling bundle into which he has collapsed. \"I have come to look after the property. The gallows for anybody who shall touch the property!\" As his dutiful grandchildren shake him up, he repeats like an echo, \"The property! Property!\"\nMr. Weevle and Mr. Guppy look at each other. But there is nothing to be done. Mr. Tulkinghorn's clerk comes down from the chambers to mention to the police that Mr. Tulkinghorn agrees it is all correct about the next of kin, and that the papers and effects will be formally taken possession of. Mr. Smallweed is permitted to visit the house and is taken upstairs into Miss Flite's deserted room, where he looks like a hideous bird of prey newly added to her aviary.\nThis news is good for the Sol and keeps the court upon its mettle. Mrs. Piper and Mrs. Perkins think it hard on Mr. Weevle if there really is no will. There is one point upon which the court is particularly anxious, namely, that the fiction of a full-sized coffin should be preserved, though there is so little to put in it. Upon the undertaker's stating in the Sol's bar that he has received orders to construct \"a six-footer,\" there is much relief.\nOut of the court, there is considerable excitement too; for men of science and doctors come to look, and there is more learned talk about inflammable gases and phosphuretted hydrogen than the court has ever imagined. Some of these authorities hold with indignation that the deceased had no business to die in the alleged manner; and are reminded by other authorities of a certain inquiry into the evidence for such deaths reprinted in the sixth volume of the Philosophical Transactions. Still they regard the late Mr. Krook's going out of the world in such a way as wholly unjustifiable and personally offensive.\nThe less the court understands of all this, the more the court likes it. There comes a newspaper artist, with a foreground and figures ready drawn for anything from a wreck on the Cornish coast to a meeting in Manchester, and in Mrs. Perkins' own room, he then and there adds in Mr. Krook's house, as large as life; in fact, considerably larger, making it look three-quarters of a mile long by fifty yards high, at which the court is particularly charmed.\nAt last come the coroner and his inquiry, as before, except that the coroner tells the gentlemen of the jury that \"it would seem to be an unlucky house next door, gentlemen, a fateful house; but these are mysteries we can't account for!\" After which the six-footer comes into action and is much admired.\nMeanwhile Mr. Guppy has the mortification of seeing Mr. Smallweed padlocking the door, and of bitterly knowing himself to be shut out. But before these proceedings draw to a close, Mr. Guppy has something that he must say to Lady Dedlock.\nSo, with a sinking heart, Mr. Guppy presents himself at the town mansion at about seven o'clock in the evening and requests to see her ladyship. The footman sulkily supposes that the young man must come up into the library.\nMr. Guppy looks into the shade in all directions, discovering everywhere a certain charred little heap of coal or wood. Presently he hears a rustling. Is it-? No, it's no ghost, but fair flesh and blood.\n\"I beg your ladyship's pardon,\" Mr. Guppy stammers, very downcast. \"This is an inconvenient time-\"\n\"I told you, you could come at any time.\" She takes a chair, looking straight at him.\n\"Thank your ladyship. I - I have not got the letters that I mentioned previously.\"\n\"Have you come merely to say so?\"\n\"Yes, your ladyship.\" Mr. Guppy, besides being depressed and uneasy, is put at a further disadvantage by the splendour and beauty of her appearance.\nShe knows its influence perfectly, has studied it too well to miss a grain of its effect on any one. As she looks at him so steadily and coldly, he feels that he has no idea of her thoughts, and also that he is being every moment, as it were, removed further and further from her.\nShe will not speak. So he must.\n\"The person I was to have had the letters from, has come to a sudden end, and-\" He stops. Lady Dedlock calmly finishes the sentence.\n\"And the letters are destroyed with the person?\"\n\"I believe so, your ladyship.\" He does not see the least sparkle of relief in her face.\n\"Is this all you have to say? You had better be sure that you wish to say nothing more to me, this being the last time you will have the opportunity.\"\nMr. Guppy is quite sure.\n\"That is enough. Good evening to you!\" And she rings for the footman to show Mr. Guppy out.\nBut in that house, in that same moment, there happens to be an old man of the name of Tulkinghorn. And he comes into the library just as the young man is leaving the room.\nOne glance between the old man and the lady, and for an instant suspicion, eager and sharp, looks out.\n\"I beg your pardon, Lady Dedlock. I supposed the room was empty.\"\n\"Stay!\" She negligently calls him back. \"Stay here, I beg. I am going out to dinner. I have nothing more to say to this young man!\"\nThe disconcerted young man bows, as he goes out, and cringingly hopes that Mr. Tulkinghorn is well.\n\"Aye, aye?\" says the lawyer, looking at him from under his bent brows. \"From Kenge and Carboy's, surely?\"\n\"Yes, Mr. Tulkinghorn. Name of Guppy, sir.\"\n\"To be sure. Why, thank you, Mr. Guppy, I am very well!\"\n\"Happy to hear it, sir.\" Mr. Guppy sneaks away.\nMr. Tulkinghorn hands Lady Dedlock down the staircase to her carriage. He returns rubbing his chin, and rubs it a good deal in the course of the evening.",
        "paragraph_chars": [
            [
                0,
                692
            ],
            [
                692,
                999
            ],
            [
                999,
                1125
            ],
            [
                1125,
                1270
            ],
            [
                1270,
                1587
            ],
            [
                1587,
                1813
            ],
            [
                1813,
                2017
            ],
            [
                2017,
                2092
            ],
            [
                2092,
                2226
            ],
            [
                2226,
                2333
            ],
            [
                2333,
                2547
            ],
            [
                2547,
                2630
            ],
            [
                2630,
                2655
            ],
            [
                2655,
                2696
            ],
            [
                2696,
                2753
            ],
            [
                2753,
                2834
            ],
            [
                2834,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                3110
            ],
            [
                3110,
                3181
            ],
            [
                3181,
                3388
            ],
            [
                3388,
                3425
            ],
            [
                3425,
                3703
            ],
            [
                3703,
                3780
            ],
            [
                3780,
                3827
            ],
            [
                3827,
                3935
            ],
            [
                3935,
                4001
            ],
            [
                4001,
                4019
            ],
            [
                4019,
                4219
            ],
            [
                4219,
                4248
            ],
            [
                4248,
                4535
            ],
            [
                4535,
                4641
            ],
            [
                4641,
                4779
            ],
            [
                4779,
                5188
            ],
            [
                5188,
                5224
            ],
            [
                5224,
                5240
            ],
            [
                5240,
                5256
            ],
            [
                5256,
                5272
            ],
            [
                5272,
                5287
            ],
            [
                5287,
                5299
            ],
            [
                5299,
                5313
            ],
            [
                5313,
                5440
            ],
            [
                5440,
                5625
            ],
            [
                5625,
                5695
            ],
            [
                5695,
                5999
            ],
            [
                5999,
                6013
            ],
            [
                6013,
                6143
            ],
            [
                6143,
                6190
            ],
            [
                6190,
                6555
            ],
            [
                6555,
                6572
            ],
            [
                6572,
                6637
            ],
            [
                6637,
                6726
            ],
            [
                6726,
                6932
            ],
            [
                6932,
                7030
            ],
            [
                7030,
                7315
            ],
            [
                7315,
                7392
            ],
            [
                7392,
                7662
            ],
            [
                7662,
                7826
            ],
            [
                7826,
                7894
            ],
            [
                7894,
                8081
            ],
            [
                8081,
                8327
            ],
            [
                8327,
                8493
            ],
            [
                8493,
                8720
            ],
            [
                8720,
                8845
            ],
            [
                8845,
                8888
            ],
            [
                8888,
                9056
            ],
            [
                9056,
                9078
            ],
            [
                9078,
                9378
            ],
            [
                9378,
                9489
            ],
            [
                9489,
                9536
            ],
            [
                9536,
                9591
            ],
            [
                9591,
                9638
            ],
            [
                9638,
                10047
            ],
            [
                10047,
                10169
            ],
            [
                10169,
                10553
            ],
            [
                10553,
                10876
            ],
            [
                10876,
                11342
            ],
            [
                11342,
                11793
            ],
            [
                11793,
                12406
            ],
            [
                12406,
                12862
            ],
            [
                12862,
                13166
            ],
            [
                13166,
                13405
            ],
            [
                13405,
                13629
            ],
            [
                13629,
                13833
            ],
            [
                13833,
                13932
            ],
            [
                13932,
                14018
            ],
            [
                14018,
                14101
            ],
            [
                14101,
                14135
            ],
            [
                14135,
                14284
            ],
            [
                14284,
                14565
            ],
            [
                14565,
                14597
            ],
            [
                14597,
                14730
            ],
            [
                14730,
                14779
            ],
            [
                14779,
                14867
            ],
            [
                14867,
                15018
            ],
            [
                15018,
                15043
            ],
            [
                15043,
                15135
            ],
            [
                15135,
                15307
            ],
            [
                15307,
                15410
            ],
            [
                15410,
                15476
            ],
            [
                15476,
                15608
            ],
            [
                15608,
                15708
            ],
            [
                15708,
                15814
            ],
            [
                15814,
                15858
            ],
            [
                15858,
                15915
            ],
            [
                15915,
                15963
            ],
            [
                15963,
                16116
            ]
        ],
        "segment_chars": [
            [
                0,
                177
            ],
            [
                177,
                355
            ],
            [
                355,
                619
            ],
            [
                619,
                692
            ],
            [
                692,
                778
            ],
            [
                778,
                892
            ],
            [
                892,
                939
            ],
            [
                939,
                999
            ],
            [
                999,
                1125
            ],
            [
                1125,
                1270
            ],
            [
                1270,
                1524
            ],
            [
                1524,
                1587
            ],
            [
                1587,
                1680
            ],
            [
                1680,
                1813
            ],
            [
                1813,
                1841
            ],
            [
                1841,
                1887
            ],
            [
                1887,
                1908
            ],
            [
                1908,
                2017
            ],
            [
                2017,
                2027
            ],
            [
                2027,
                2048
            ],
            [
                2048,
                2078
            ],
            [
                2078,
                2092
            ],
            [
                2092,
                2226
            ],
            [
                2226,
                2252
            ],
            [
                2252,
                2270
            ],
            [
                2270,
                2283
            ],
            [
                2283,
                2320
            ],
            [
                2320,
                2333
            ],
            [
                2333,
                2424
            ],
            [
                2424,
                2547
            ],
            [
                2547,
                2630
            ],
            [
                2630,
                2655
            ],
            [
                2655,
                2696
            ],
            [
                2696,
                2703
            ],
            [
                2703,
                2753
            ],
            [
                2753,
                2805
            ],
            [
                2805,
                2834
            ],
            [
                2834,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                3020
            ],
            [
                3020,
                3058
            ],
            [
                3058,
                3110
            ],
            [
                3110,
                3181
            ],
            [
                3181,
                3296
            ],
            [
                3296,
                3388
            ],
            [
                3388,
                3425
            ],
            [
                3425,
                3504
            ],
            [
                3504,
                3650
            ],
            [
                3650,
                3703
            ],
            [
                3703,
                3780
            ],
            [
                3780,
                3804
            ],
            [
                3804,
                3827
            ],
            [
                3827,
                3885
            ],
            [
                3885,
                3935
            ],
            [
                3935,
                3958
            ],
            [
                3958,
                4001
            ],
            [
                4001,
                4019
            ],
            [
                4019,
                4219
            ],
            [
                4219,
                4248
            ],
            [
                4248,
                4302
            ],
            [
                4302,
                4470
            ],
            [
                4470,
                4535
            ],
            [
                4535,
                4641
            ],
            [
                4641,
                4779
            ],
            [
                4779,
                4815
            ],
            [
                4815,
                4878
            ],
            [
                4878,
                4954
            ],
            [
                4954,
                5017
            ],
            [
                5017,
                5081
            ],
            [
                5081,
                5188
            ],
            [
                5188,
                5224
            ],
            [
                5224,
                5240
            ],
            [
                5240,
                5256
            ],
            [
                5256,
                5272
            ],
            [
                5272,
                5287
            ],
            [
                5287,
                5299
            ],
            [
                5299,
                5313
            ],
            [
                5313,
                5328
            ],
            [
                5328,
                5348
            ],
            [
                5348,
                5440
            ],
            [
                5440,
                5512
            ],
            [
                5512,
                5562
            ],
            [
                5562,
                5625
            ],
            [
                5625,
                5630
            ],
            [
                5630,
                5645
            ],
            [
                5645,
                5663
            ],
            [
                5663,
                5695
            ],
            [
                5695,
                5754
            ],
            [
                5754,
                5866
            ],
            [
                5866,
                5999
            ],
            [
                5999,
                6013
            ],
            [
                6013,
                6143
            ],
            [
                6143,
                6167
            ],
            [
                6167,
                6190
            ],
            [
                6190,
                6419
            ],
            [
                6419,
                6485
            ],
            [
                6485,
                6555
            ],
            [
                6555,
                6572
            ],
            [
                6572,
                6613
            ],
            [
                6613,
                6637
            ],
            [
                6637,
                6726
            ],
            [
                6726,
                6932
            ],
            [
                6932,
                6952
            ],
            [
                6952,
                6973
            ],
            [
                6973,
                7030
            ],
            [
                7030,
                7267
            ],
            [
                7267,
                7315
            ],
            [
                7315,
                7362
            ],
            [
                7362,
                7392
            ],
            [
                7392,
                7498
            ],
            [
                7498,
                7662
            ],
            [
                7662,
                7826
            ],
            [
                7826,
                7878
            ],
            [
                7878,
                7894
            ],
            [
                7894,
                7965
            ],
            [
                7965,
                8081
            ],
            [
                8081,
                8113
            ],
            [
                8113,
                8239
            ],
            [
                8239,
                8327
            ],
            [
                8327,
                8339
            ],
            [
                8339,
                8389
            ],
            [
                8389,
                8403
            ],
            [
                8403,
                8426
            ],
            [
                8426,
                8482
            ],
            [
                8482,
                8493
            ],
            [
                8493,
                8604
            ],
            [
                8604,
                8720
            ],
            [
                8720,
                8822
            ],
            [
                8822,
                8845
            ],
            [
                8845,
                8864
            ],
            [
                8864,
                8888
            ],
            [
                8888,
                9056
            ],
            [
                9056,
                9062
            ],
            [
                9062,
                9078
            ],
            [
                9078,
                9141
            ],
            [
                9141,
                9179
            ],
            [
                9179,
                9197
            ],
            [
                9197,
                9296
            ],
            [
                9296,
                9378
            ],
            [
                9378,
                9489
            ],
            [
                9489,
                9536
            ],
            [
                9536,
                9591
            ],
            [
                9591,
                9638
            ],
            [
                9638,
                9750
            ],
            [
                9750,
                9780
            ],
            [
                9780,
                9885
            ],
            [
                9885,
                9952
            ],
            [
                9952,
                10047
            ],
            [
                10047,
                10132
            ],
            [
                10132,
                10169
            ],
            [
                10169,
                10216
            ],
            [
                10216,
                10309
            ],
            [
                10309,
                10360
            ],
            [
                10360,
                10553
            ],
            [
                10553,
                10686
            ],
            [
                10686,
                10727
            ],
            [
                10727,
                10782
            ],
            [
                10782,
                10865
            ],
            [
                10865,
                10876
            ],
            [
                10876,
                10921
            ],
            [
                10921,
                10954
            ],
            [
                10954,
                11171
            ],
            [
                11171,
                11342
            ],
            [
                11342,
                11409
            ],
            [
                11409,
                11493
            ],
            [
                11493,
                11667
            ],
            [
                11667,
                11793
            ],
            [
                11793,
                12010
            ],
            [
                12010,
                12280
            ],
            [
                12280,
                12406
            ],
            [
                12406,
                12479
            ],
            [
                12479,
                12862
            ],
            [
                12862,
                13100
            ],
            [
                13100,
                13166
            ],
            [
                13166,
                13301
            ],
            [
                13301,
                13405
            ],
            [
                13405,
                13550
            ],
            [
                13550,
                13629
            ],
            [
                13629,
                13749
            ],
            [
                13749,
                13780
            ],
            [
                13780,
                13788
            ],
            [
                13788,
                13833
            ],
            [
                13833,
                13900
            ],
            [
                13900,
                13932
            ],
            [
                13932,
                13974
            ],
            [
                13974,
                14018
            ],
            [
                14018,
                14040
            ],
            [
                14040,
                14101
            ],
            [
                14101,
                14135
            ],
            [
                14135,
                14157
            ],
            [
                14157,
                14284
            ],
            [
                14284,
                14385
            ],
            [
                14385,
                14565
            ],
            [
                14565,
                14585
            ],
            [
                14585,
                14597
            ],
            [
                14597,
                14687
            ],
            [
                14687,
                14730
            ],
            [
                14730,
                14779
            ],
            [
                14779,
                14810
            ],
            [
                14810,
                14867
            ],
            [
                14867,
                14897
            ],
            [
                14897,
                15018
            ],
            [
                15018,
                15043
            ],
            [
                15043,
                15060
            ],
            [
                15060,
                15082
            ],
            [
                15082,
                15135
            ],
            [
                15135,
                15234
            ],
            [
                15234,
                15307
            ],
            [
                15307,
                15410
            ],
            [
                15410,
                15444
            ],
            [
                15444,
                15476
            ],
            [
                15476,
                15484
            ],
            [
                15484,
                15516
            ],
            [
                15516,
                15535
            ],
            [
                15535,
                15561
            ],
            [
                15561,
                15608
            ],
            [
                15608,
                15708
            ],
            [
                15708,
                15720
            ],
            [
                15720,
                15779
            ],
            [
                15779,
                15814
            ],
            [
                15814,
                15837
            ],
            [
                15837,
                15858
            ],
            [
                15858,
                15871
            ],
            [
                15871,
                15915
            ],
            [
                15915,
                15940
            ],
            [
                15940,
                15963
            ],
            [
                15963,
                16034
            ],
            [
                16034,
                16116
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                20,
                93
            ],
            [
                99,
                124
            ],
            [
                124,
                125
            ],
            [
                141,
                163
            ],
            [
                164,
                169
            ],
            [
                175,
                177
            ],
            [
                177,
                191
            ],
            [
                192,
                304
            ],
            [
                305,
                318
            ],
            [
                322,
                355
            ],
            [
                355,
                359
            ],
            [
                366,
                400
            ],
            [
                401,
                468
            ],
            [
                482,
                488
            ],
            [
                489,
                504
            ],
            [
                505,
                510
            ],
            [
                514,
                542
            ],
            [
                547,
                555
            ],
            [
                556,
                559
            ],
            [
                565,
                573
            ],
            [
                574,
                608
            ],
            [
                609,
                617
            ],
            [
                617,
                619
            ],
            [
                619,
                667
            ],
            [
                668,
                690
            ],
            [
                690,
                692
            ],
            [
                692,
                707
            ],
            [
                708,
                720
            ],
            [
                721,
                736
            ],
            [
                737,
                744
            ],
            [
                745,
                756
            ],
            [
                757,
                776
            ],
            [
                776,
                778
            ],
            [
                778,
                860
            ],
            [
                867,
                892
            ],
            [
                892,
                899
            ],
            [
                911,
                913
            ],
            [
                920,
                929
            ],
            [
                930,
                939
            ],
            [
                942,
                949
            ],
            [
                955,
                962
            ],
            [
                963,
                979
            ],
            [
                980,
                998
            ],
            [
                999,
                1038
            ],
            [
                1039,
                1041
            ],
            [
                1042,
                1049
            ],
            [
                1053,
                1094
            ],
            [
                1095,
                1124
            ],
            [
                1125,
                1151
            ],
            [
                1152,
                1155
            ],
            [
                1164,
                1188
            ],
            [
                1188,
                1189
            ],
            [
                1190,
                1207
            ],
            [
                1208,
                1270
            ],
            [
                1270,
                1427
            ],
            [
                1428,
                1522
            ],
            [
                1522,
                1524
            ],
            [
                1524,
                1564
            ],
            [
                1565,
                1585
            ],
            [
                1585,
                1586
            ],
            [
                1587,
                1624
            ],
            [
                1631,
                1667
            ],
            [
                1668,
                1670
            ],
            [
                1671,
                1678
            ],
            [
                1678,
                1680
            ],
            [
                1680,
                1811
            ],
            [
                1811,
                1813
            ],
            [
                1813,
                1841
            ],
            [
                1841,
                1868
            ],
            [
                1885,
                1887
            ],
            [
                1887,
                1906
            ],
            [
                1908,
                1912
            ],
            [
                1913,
                1973
            ],
            [
                1985,
                2017
            ],
            [
                2017,
                2027
            ],
            [
                2027,
                2034
            ],
            [
                2037,
                2048
            ],
            [
                2048,
                2062
            ],
            [
                2067,
                2076
            ],
            [
                2076,
                2078
            ],
            [
                2078,
                2089
            ],
            [
                2089,
                2092
            ],
            [
                2092,
                2103
            ],
            [
                2104,
                2186
            ],
            [
                2190,
                2200
            ],
            [
                2201,
                2224
            ],
            [
                2224,
                2226
            ],
            [
                2226,
                2252
            ],
            [
                2257,
                2270
            ],
            [
                2270,
                2281
            ],
            [
                2281,
                2283
            ],
            [
                2283,
                2320
            ],
            [
                2320,
                2330
            ],
            [
                2333,
                2424
            ],
            [
                2424,
                2427
            ],
            [
                2428,
                2447
            ],
            [
                2454,
                2473
            ],
            [
                2474,
                2527
            ],
            [
                2537,
                2547
            ],
            [
                2547,
                2627
            ],
            [
                2630,
                2655
            ],
            [
                2655,
                2696
            ],
            [
                2696,
                2703
            ],
            [
                2703,
                2721
            ],
            [
                2722,
                2734
            ],
            [
                2739,
                2753
            ],
            [
                2753,
                2805
            ],
            [
                2805,
                2807
            ],
            [
                2808,
                2813
            ],
            [
                2814,
                2826
            ],
            [
                2827,
                2832
            ],
            [
                2832,
                2834
            ],
            [
                2834,
                2885
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                2978
            ],
            [
                2981,
                2985
            ],
            [
                2986,
                2991
            ],
            [
                2991,
                3003
            ],
            [
                3003,
                3018
            ],
            [
                3020,
                3058
            ],
            [
                3058,
                3110
            ],
            [
                3110,
                3181
            ],
            [
                3181,
                3217
            ],
            [
                3218,
                3222
            ],
            [
                3227,
                3294
            ],
            [
                3294,
                3296
            ],
            [
                3296,
                3388
            ],
            [
                3388,
                3425
            ],
            [
                3425,
                3504
            ],
            [
                3504,
                3524
            ],
            [
                3527,
                3529
            ],
            [
                3535,
                3547
            ],
            [
                3550,
                3555
            ],
            [
                3556,
                3558
            ],
            [
                3570,
                3574
            ],
            [
                3575,
                3579
            ],
            [
                3587,
                3588
            ],
            [
                3593,
                3614
            ],
            [
                3615,
                3648
            ],
            [
                3648,
                3650
            ],
            [
                3650,
                3701
            ],
            [
                3701,
                3703
            ],
            [
                3703,
                3718
            ],
            [
                3721,
                3724
            ],
            [
                3724,
                3727
            ],
            [
                3728,
                3732
            ],
            [
                3733,
                3780
            ],
            [
                3780,
                3804
            ],
            [
                3804,
                3827
            ],
            [
                3827,
                3855
            ],
            [
                3862,
                3883
            ],
            [
                3885,
                3932
            ],
            [
                3932,
                3935
            ],
            [
                3935,
                3958
            ],
            [
                3958,
                4001
            ],
            [
                4001,
                4007
            ],
            [
                4010,
                4016
            ],
            [
                4019,
                4056
            ],
            [
                4058,
                4075
            ],
            [
                4076,
                4219
            ],
            [
                4219,
                4228
            ],
            [
                4229,
                4248
            ],
            [
                4248,
                4259
            ],
            [
                4260,
                4271
            ],
            [
                4272,
                4275
            ],
            [
                4281,
                4302
            ],
            [
                4302,
                4405
            ],
            [
                4406,
                4457
            ],
            [
                4458,
                4470
            ],
            [
                4470,
                4472
            ],
            [
                4482,
                4533
            ],
            [
                4533,
                4535
            ],
            [
                4535,
                4617
            ],
            [
                4618,
                4639
            ],
            [
                4639,
                4641
            ],
            [
                4641,
                4657
            ],
            [
                4665,
                4709
            ],
            [
                4709,
                4770
            ],
            [
                4776,
                4779
            ],
            [
                4779,
                4815
            ],
            [
                4815,
                4871
            ],
            [
                4876,
                4878
            ],
            [
                4878,
                4954
            ],
            [
                4954,
                5017
            ],
            [
                5017,
                5034
            ],
            [
                5044,
                5079
            ],
            [
                5081,
                5187
            ],
            [
                5190,
                5223
            ],
            [
                5224,
                5239
            ],
            [
                5240,
                5255
            ],
            [
                5256,
                5271
            ],
            [
                5272,
                5286
            ],
            [
                5287,
                5298
            ],
            [
                5299,
                5312
            ],
            [
                5313,
                5327
            ],
            [
                5328,
                5335
            ],
            [
                5336,
                5338
            ],
            [
                5339,
                5346
            ],
            [
                5346,
                5347
            ],
            [
                5348,
                5440
            ],
            [
                5440,
                5462
            ],
            [
                5462,
                5465
            ],
            [
                5470,
                5510
            ],
            [
                5510,
                5512
            ],
            [
                5512,
                5562
            ],
            [
                5583,
                5622
            ],
            [
                5625,
                5630
            ],
            [
                5630,
                5645
            ],
            [
                5645,
                5661
            ],
            [
                5661,
                5663
            ],
            [
                5663,
                5695
            ],
            [
                5695,
                5701
            ],
            [
                5702,
                5707
            ],
            [
                5708,
                5712
            ],
            [
                5713,
                5752
            ],
            [
                5752,
                5754
            ],
            [
                5754,
                5810
            ],
            [
                5827,
                5866
            ],
            [
                5866,
                5986
            ],
            [
                5996,
                5998
            ],
            [
                5999,
                6010
            ],
            [
                6013,
                6143
            ],
            [
                6143,
                6167
            ],
            [
                6167,
                6177
            ],
            [
                6178,
                6190
            ],
            [
                6190,
                6212
            ],
            [
                6227,
                6419
            ],
            [
                6419,
                6468
            ],
            [
                6471,
                6485
            ],
            [
                6485,
                6555
            ],
            [
                6555,
                6572
            ],
            [
                6572,
                6613
            ],
            [
                6613,
                6637
            ],
            [
                6637,
                6726
            ],
            [
                6726,
                6769
            ],
            [
                6770,
                6877
            ],
            [
                6878,
                6932
            ],
            [
                6932,
                6952
            ],
            [
                6952,
                6972
            ],
            [
                6973,
                7018
            ],
            [
                7030,
                7031
            ],
            [
                7035,
                7038
            ],
            [
                7039,
                7054
            ],
            [
                7055,
                7101
            ],
            [
                7106,
                7113
            ],
            [
                7117,
                7264
            ],
            [
                7264,
                7267
            ],
            [
                7267,
                7304
            ],
            [
                7305,
                7315
            ],
            [
                7315,
                7329
            ],
            [
                7332,
                7362
            ],
            [
                7362,
                7389
            ],
            [
                7392,
                7406
            ],
            [
                7414,
                7475
            ],
            [
                7481,
                7496
            ],
            [
                7496,
                7498
            ],
            [
                7498,
                7514
            ],
            [
                7523,
                7538
            ],
            [
                7539,
                7542
            ],
            [
                7543,
                7547
            ],
            [
                7551,
                7566
            ],
            [
                7569,
                7662
            ],
            [
                7662,
                7772
            ],
            [
                7773,
                7776
            ],
            [
                7777,
                7823
            ],
            [
                7826,
                7865
            ],
            [
                7865,
                7878
            ],
            [
                7878,
                7892
            ],
            [
                7892,
                7894
            ],
            [
                7894,
                7965
            ],
            [
                7965,
                7990
            ],
            [
                7991,
                8021
            ],
            [
                8021,
                8078
            ],
            [
                8081,
                8090
            ],
            [
                8091,
                8094
            ],
            [
                8095,
                8105
            ],
            [
                8111,
                8112
            ],
            [
                8113,
                8167
            ],
            [
                8172,
                8239
            ],
            [
                8251,
                8292
            ],
            [
                8293,
                8327
            ],
            [
                8327,
                8339
            ],
            [
                8339,
                8359
            ],
            [
                8360,
                8371
            ],
            [
                8375,
                8389
            ],
            [
                8389,
                8403
            ],
            [
                8403,
                8426
            ],
            [
                8426,
                8468
            ],
            [
                8469,
                8482
            ],
            [
                8482,
                8493
            ],
            [
                8493,
                8497
            ],
            [
                8498,
                8500
            ],
            [
                8511,
                8528
            ],
            [
                8528,
                8529
            ],
            [
                8538,
                8539
            ],
            [
                8549,
                8563
            ],
            [
                8564,
                8602
            ],
            [
                8602,
                8604
            ],
            [
                8604,
                8621
            ],
            [
                8627,
                8638
            ],
            [
                8639,
                8650
            ],
            [
                8651,
                8656
            ],
            [
                8656,
                8683
            ],
            [
                8692,
                8695
            ],
            [
                8696,
                8717
            ],
            [
                8720,
                8756
            ],
            [
                8757,
                8822
            ],
            [
                8822,
                8842
            ],
            [
                8842,
                8845
            ],
            [
                8845,
                8864
            ],
            [
                8864,
                8888
            ],
            [
                8888,
                8889
            ],
            [
                8895,
                9003
            ],
            [
                9004,
                9056
            ],
            [
                9056,
                9062
            ],
            [
                9062,
                9078
            ],
            [
                9078,
                9119
            ],
            [
                9122,
                9141
            ],
            [
                9141,
                9143
            ],
            [
                9148,
                9154
            ],
            [
                9164,
                9169
            ],
            [
                9177,
                9179
            ],
            [
                9179,
                9195
            ],
            [
                9195,
                9197
            ],
            [
                9197,
                9296
            ],
            [
                9296,
                9361
            ],
            [
                9366,
                9375
            ],
            [
                9378,
                9489
            ],
            [
                9489,
                9490
            ],
            [
                9490,
                9511
            ],
            [
                9536,
                9544
            ],
            [
                9544,
                9577
            ],
            [
                9577,
                9590
            ],
            [
                9591,
                9619
            ],
            [
                9619,
                9636
            ],
            [
                9638,
                9672
            ],
            [
                9672,
                9748
            ],
            [
                9748,
                9750
            ],
            [
                9750,
                9780
            ],
            [
                9780,
                9814
            ],
            [
                9814,
                9815
            ],
            [
                9816,
                9831
            ],
            [
                9831,
                9885
            ],
            [
                9885,
                9925
            ],
            [
                9929,
                9935
            ],
            [
                9942,
                9950
            ],
            [
                9950,
                9952
            ],
            [
                9952,
                10047
            ],
            [
                10047,
                10081
            ],
            [
                10082,
                10132
            ],
            [
                10132,
                10166
            ],
            [
                10169,
                10193
            ],
            [
                10194,
                10197
            ],
            [
                10198,
                10200
            ],
            [
                10207,
                10213
            ],
            [
                10213,
                10215
            ],
            [
                10216,
                10257
            ],
            [
                10258,
                10308
            ],
            [
                10310,
                10360
            ],
            [
                10360,
                10378
            ],
            [
                10379,
                10447
            ],
            [
                10460,
                10553
            ],
            [
                10553,
                10686
            ],
            [
                10686,
                10727
            ],
            [
                10727,
                10782
            ],
            [
                10782,
                10810
            ],
            [
                10817,
                10824
            ],
            [
                10825,
                10827
            ],
            [
                10828,
                10854
            ],
            [
                10855,
                10865
            ],
            [
                10865,
                10873
            ],
            [
                10876,
                10919
            ],
            [
                10919,
                10921
            ],
            [
                10921,
                10952
            ],
            [
                10952,
                10954
            ],
            [
                10954,
                10993
            ],
            [
                10994,
                11052
            ],
            [
                11063,
                11065
            ],
            [
                11066,
                11099
            ],
            [
                11101,
                11169
            ],
            [
                11169,
                11171
            ],
            [
                11171,
                11187
            ],
            [
                11188,
                11197
            ],
            [
                11198,
                11200
            ],
            [
                11201,
                11206
            ],
            [
                11207,
                11210
            ],
            [
                11211,
                11220
            ],
            [
                11230,
                11342
            ],
            [
                11342,
                11346
            ],
            [
                11355,
                11409
            ],
            [
                11409,
                11450
            ],
            [
                11465,
                11491
            ],
            [
                11491,
                11493
            ],
            [
                11493,
                11511
            ],
            [
                11512,
                11667
            ],
            [
                11667,
                11713
            ],
            [
                11714,
                11770
            ],
            [
                11777,
                11784
            ],
            [
                11791,
                11793
            ],
            [
                11793,
                11809
            ],
            [
                11809,
                11847
            ],
            [
                11849,
                11871
            ],
            [
                11872,
                11879
            ],
            [
                11880,
                11892
            ],
            [
                11892,
                12010
            ],
            [
                12010,
                12035
            ],
            [
                12036,
                12125
            ],
            [
                12130,
                12278
            ],
            [
                12278,
                12279
            ],
            [
                12280,
                12318
            ],
            [
                12319,
                12341
            ],
            [
                12342,
                12344
            ],
            [
                12345,
                12351
            ],
            [
                12352,
                12405
            ],
            [
                12406,
                12477
            ],
            [
                12477,
                12479
            ],
            [
                12479,
                12490
            ],
            [
                12491,
                12492
            ],
            [
                12493,
                12502
            ],
            [
                12503,
                12509
            ],
            [
                12509,
                12604
            ],
            [
                12605,
                12658
            ],
            [
                12659,
                12676
            ],
            [
                12682,
                12684
            ],
            [
                12685,
                12758
            ],
            [
                12759,
                12761
            ],
            [
                12762,
                12766
            ],
            [
                12767,
                12861
            ],
            [
                12862,
                12903
            ],
            [
                12904,
                12938
            ],
            [
                12939,
                12970
            ],
            [
                12971,
                12977
            ],
            [
                12977,
                12979
            ],
            [
                12980,
                13037
            ],
            [
                13046,
                13056
            ],
            [
                13057,
                13100
            ],
            [
                13100,
                13166
            ],
            [
                13176,
                13185
            ],
            [
                13186,
                13301
            ],
            [
                13301,
                13346
            ],
            [
                13347,
                13360
            ],
            [
                13371,
                13375
            ],
            [
                13379,
                13383
            ],
            [
                13384,
                13387
            ],
            [
                13388,
                13405
            ],
            [
                13407,
                13429
            ],
            [
                13429,
                13430
            ],
            [
                13435,
                13550
            ],
            [
                13562,
                13628
            ],
            [
                13629,
                13719
            ],
            [
                13720,
                13749
            ],
            [
                13749,
                13780
            ],
            [
                13780,
                13785
            ],
            [
                13786,
                13788
            ],
            [
                13788,
                13831
            ],
            [
                13831,
                13833
            ],
            [
                13833,
                13835
            ],
            [
                13836,
                13900
            ],
            [
                13900,
                13929
            ],
            [
                13932,
                13974
            ],
            [
                13974,
                14016
            ],
            [
                14016,
                14018
            ],
            [
                14018,
                14040
            ],
            [
                14040,
                14041
            ],
            [
                14044,
                14087
            ],
            [
                14098,
                14101
            ],
            [
                14101,
                14135
            ],
            [
                14135,
                14136
            ],
            [
                14139,
                14157
            ],
            [
                14157,
                14166
            ],
            [
                14166,
                14167
            ],
            [
                14168,
                14191
            ],
            [
                14192,
                14284
            ],
            [
                14284,
                14385
            ],
            [
                14385,
                14431
            ],
            [
                14432,
                14437
            ],
            [
                14438,
                14452
            ],
            [
                14458,
                14474
            ],
            [
                14479,
                14565
            ],
            [
                14565,
                14583
            ],
            [
                14583,
                14585
            ],
            [
                14585,
                14597
            ],
            [
                14597,
                14638
            ],
            [
                14643,
                14674
            ],
            [
                14677,
                14687
            ],
            [
                14687,
                14730
            ],
            [
                14730,
                14779
            ],
            [
                14779,
                14809
            ],
            [
                14810,
                14812
            ],
            [
                14822,
                14865
            ],
            [
                14867,
                14895
            ],
            [
                14897,
                15018
            ],
            [
                15018,
                15042
            ],
            [
                15043,
                15060
            ],
            [
                15060,
                15082
            ],
            [
                15082,
                15099
            ],
            [
                15100,
                15103
            ],
            [
                15108,
                15111
            ],
            [
                15112,
                15119
            ],
            [
                15124,
                15135
            ],
            [
                15135,
                15234
            ],
            [
                15234,
                15237
            ],
            [
                15238,
                15240
            ],
            [
                15241,
                15246
            ],
            [
                15252,
                15263
            ],
            [
                15269,
                15271
            ],
            [
                15272,
                15285
            ],
            [
                15286,
                15307
            ],
            [
                15307,
                15370
            ],
            [
                15371,
                15409
            ],
            [
                15410,
                15444
            ],
            [
                15444,
                15473
            ],
            [
                15476,
                15484
            ],
            [
                15484,
                15516
            ],
            [
                15516,
                15517
            ],
            [
                15522,
                15535
            ],
            [
                15535,
                15561
            ],
            [
                15561,
                15608
            ],
            [
                15608,
                15698
            ],
            [
                15699,
                15708
            ],
            [
                15708,
                15720
            ],
            [
                15720,
                15777
            ],
            [
                15777,
                15779
            ],
            [
                15779,
                15814
            ],
            [
                15814,
                15815
            ],
            [
                15818,
                15837
            ],
            [
                15837,
                15858
            ],
            [
                15858,
                15871
            ],
            [
                15871,
                15915
            ],
            [
                15915,
                15937
            ],
            [
                15940,
                15962
            ],
            [
                15963,
                15978
            ],
            [
                15979,
                15984
            ],
            [
                15985,
                15997
            ],
            [
                15998,
                16034
            ],
            [
                16034,
                16116
            ]
        ],
        "row_chars": [
            [
                0,
                177
            ],
            [
                177,
                355
            ],
            [
                355,
                355
            ],
            [
                355,
                619
            ],
            [
                619,
                692
            ],
            [
                692,
                778
            ],
            [
                778,
                892
            ],
            [
                892,
                939
            ],
            [
                939,
                999
            ],
            [
                999,
                999
            ],
            [
                999,
                999
            ],
            [
                999,
                999
            ],
            [
                999,
                999
            ],
            [
                999,
                1125
            ],
            [
                1125,
                1270
            ],
            [
                1270,
                1524
            ],
            [
                1524,
                1587
            ],
            [
                1587,
                1587
            ],
            [
                1587,
                1680
            ],
            [
                1680,
                1680
            ],
            [
                1680,
                1680
            ],
            [
                1680,
                1680
            ],
            [
                1680,
                1813
            ],
            [
                1813,
                1841
            ],
            [
                1841,
                1887
            ],
            [
                1887,
                1908
            ],
            [
                1908,
                1908
            ],
            [
                1908,
                1908
            ],
            [
                1908,
                1908
            ],
            [
                1908,
                2017
            ],
            [
                2017,
                2027
            ],
            [
                2027,
                2048
            ],
            [
                2048,
                2078
            ],
            [
                2078,
                2092
            ],
            [
                2092,
                2092
            ],
            [
                2092,
                2092
            ],
            [
                2092,
                2092
            ],
            [
                2092,
                2092
            ],
            [
                2092,
                2092
            ],
            [
                2092,
                2226
            ],
            [
                2226,
                2252
            ],
            [
                2252,
                2270
            ],
            [
                2270,
                2283
            ],
            [
                2283,
                2320
            ],
            [
                2320,
                2333
            ],
            [
                2333,
                2424
            ],
            [
                2424,
                2547
            ],
            [
                2547,
                2630
            ],
            [
                2630,
                2630
            ],
            [
                2630,
                2655
            ],
            [
                2655,
                2696
            ],
            [
                2696,
                2703
            ],
            [
                2703,
                2753
            ],
            [
                2753,
                2805
            ],
            [
                2805,
                2834
            ],
            [
                2834,
                2888
            ],
            [
                2888,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                3020
            ],
            [
                3020,
                3020
            ],
            [
                3020,
                3058
            ],
            [
                3058,
                3110
            ],
            [
                3110,
                3181
            ],
            [
                3181,
                3296
            ],
            [
                3296,
                3296
            ],
            [
                3296,
                3388
            ],
            [
                3388,
                3425
            ],
            [
                3425,
                3504
            ],
            [
                3504,
                3504
            ],
            [
                3504,
                3650
            ],
            [
                3650,
                3703
            ],
            [
                3703,
                3780
            ],
            [
                3780,
                3804
            ],
            [
                3804,
                3827
            ],
            [
                3827,
                3885
            ],
            [
                3885,
                3885
            ],
            [
                3885,
                3935
            ],
            [
                3935,
                3958
            ],
            [
                3958,
                4001
            ],
            [
                4001,
                4019
            ],
            [
                4019,
                4219
            ],
            [
                4219,
                4248
            ],
            [
                4248,
                4302
            ],
            [
                4302,
                4470
            ],
            [
                4470,
                4535
            ],
            [
                4535,
                4641
            ],
            [
                4641,
                4779
            ],
            [
                4779,
                4815
            ],
            [
                4815,
                4878
            ],
            [
                4878,
                4954
            ],
            [
                4954,
                5017
            ],
            [
                5017,
                5081
            ],
            [
                5081,
                5081
            ],
            [
                5081,
                5188
            ],
            [
                5188,
                5224
            ],
            [
                5224,
                5240
            ],
            [
                5240,
                5256
            ],
            [
                5256,
                5272
            ],
            [
                5272,
                5287
            ],
            [
                5287,
                5299
            ],
            [
                5299,
                5313
            ],
            [
                5313,
                5348
            ],
            [
                5348,
                5440
            ],
            [
                5440,
                5512
            ],
            [
                5512,
                5562
            ],
            [
                5562,
                5625
            ],
            [
                5625,
                5630
            ],
            [
                5630,
                5645
            ],
            [
                5645,
                5663
            ],
            [
                5663,
                5695
            ],
            [
                5695,
                5754
            ],
            [
                5754,
                5866
            ],
            [
                5866,
                5999
            ],
            [
                5999,
                5999
            ],
            [
                5999,
                6013
            ],
            [
                6013,
                6013
            ],
            [
                6013,
                6013
            ],
            [
                6013,
                6143
            ],
            [
                6143,
                6167
            ],
            [
                6167,
                6190
            ],
            [
                6190,
                6419
            ],
            [
                6419,
                6485
            ],
            [
                6485,
                6555
            ],
            [
                6555,
                6555
            ],
            [
                6555,
                6555
            ],
            [
                6555,
                6572
            ],
            [
                6572,
                6613
            ],
            [
                6613,
                6637
            ],
            [
                6637,
                6726
            ],
            [
                6726,
                6932
            ],
            [
                6932,
                6952
            ],
            [
                6952,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                6973
            ],
            [
                6973,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7267
            ],
            [
                7267,
                7315
            ],
            [
                7315,
                7362
            ],
            [
                7362,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7392
            ],
            [
                7392,
                7498
            ],
            [
                7498,
                7662
            ],
            [
                7662,
                7826
            ],
            [
                7826,
                7826
            ],
            [
                7826,
                7878
            ],
            [
                7878,
                7894
            ],
            [
                7894,
                7965
            ],
            [
                7965,
                8081
            ],
            [
                8081,
                8081
            ],
            [
                8081,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8113
            ],
            [
                8113,
                8239
            ],
            [
                8239,
                8327
            ],
            [
                8327,
                8339
            ],
            [
                8339,
                8389
            ],
            [
                8389,
                8403
            ],
            [
                8403,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8482
            ],
            [
                8482,
                8493
            ],
            [
                8493,
                8604
            ],
            [
                8604,
                8720
            ],
            [
                8720,
                8822
            ],
            [
                8822,
                8845
            ],
            [
                8845,
                8864
            ],
            [
                8864,
                8888
            ],
            [
                8888,
                8888
            ],
            [
                8888,
                8888
            ],
            [
                8888,
                8888
            ],
            [
                8888,
                8888
            ],
            [
                8888,
                9056
            ],
            [
                9056,
                9062
            ],
            [
                9062,
                9078
            ],
            [
                9078,
                9141
            ],
            [
                9141,
                9179
            ],
            [
                9179,
                9179
            ],
            [
                9179,
                9197
            ],
            [
                9197,
                9296
            ],
            [
                9296,
                9378
            ],
            [
                9378,
                9378
            ],
            [
                9378,
                9489
            ],
            [
                9489,
                9489
            ],
            [
                9489,
                9536
            ],
            [
                9536,
                9591
            ],
            [
                9591,
                9591
            ],
            [
                9591,
                9638
            ],
            [
                9638,
                9750
            ],
            [
                9750,
                9780
            ],
            [
                9780,
                9885
            ],
            [
                9885,
                9952
            ],
            [
                9952,
                10047
            ],
            [
                10047,
                10132
            ],
            [
                10132,
                10169
            ],
            [
                10169,
                10169
            ],
            [
                10169,
                10309
            ],
            [
                10309,
                10360
            ],
            [
                10360,
                10553
            ],
            [
                10553,
                10686
            ],
            [
                10686,
                10727
            ],
            [
                10727,
                10727
            ],
            [
                10727,
                10727
            ],
            [
                10727,
                10782
            ],
            [
                10782,
                10865
            ],
            [
                10865,
                10876
            ],
            [
                10876,
                10876
            ],
            [
                10876,
                10921
            ],
            [
                10921,
                10954
            ],
            [
                10954,
                11171
            ],
            [
                11171,
                11342
            ],
            [
                11342,
                11409
            ],
            [
                11409,
                11493
            ],
            [
                11493,
                11493
            ],
            [
                11493,
                11493
            ],
            [
                11493,
                11493
            ],
            [
                11493,
                11667
            ],
            [
                11667,
                11793
            ],
            [
                11793,
                12010
            ],
            [
                12010,
                12406
            ],
            [
                12406,
                12479
            ],
            [
                12479,
                12862
            ],
            [
                12862,
                12862
            ],
            [
                12862,
                13100
            ],
            [
                13100,
                13166
            ],
            [
                13166,
                13301
            ],
            [
                13301,
                13405
            ],
            [
                13405,
                13550
            ],
            [
                13550,
                13550
            ],
            [
                13550,
                13550
            ],
            [
                13550,
                13550
            ],
            [
                13550,
                13629
            ],
            [
                13629,
                13629
            ],
            [
                13629,
                13749
            ],
            [
                13749,
                13780
            ],
            [
                13780,
                13788
            ],
            [
                13788,
                13833
            ],
            [
                13833,
                13900
            ],
            [
                13900,
                13932
            ],
            [
                13932,
                13974
            ],
            [
                13974,
                14018
            ],
            [
                14018,
                14040
            ],
            [
                14040,
                14040
            ],
            [
                14040,
                14040
            ],
            [
                14040,
                14040
            ],
            [
                14040,
                14101
            ],
            [
                14101,
                14135
            ],
            [
                14135,
                14157
            ],
            [
                14157,
                14284
            ],
            [
                14284,
                14385
            ],
            [
                14385,
                14565
            ],
            [
                14565,
                14585
            ],
            [
                14585,
                14597
            ],
            [
                14597,
                14687
            ],
            [
                14687,
                14730
            ],
            [
                14730,
                14779
            ],
            [
                14779,
                14779
            ],
            [
                14779,
                14810
            ],
            [
                14810,
                14867
            ],
            [
                14867,
                14867
            ],
            [
                14867,
                14867
            ],
            [
                14867,
                14897
            ],
            [
                14897,
                14897
            ],
            [
                14897,
                14897
            ],
            [
                14897,
                15018
            ],
            [
                15018,
                15043
            ],
            [
                15043,
                15043
            ],
            [
                15043,
                15060
            ],
            [
                15060,
                15060
            ],
            [
                15060,
                15082
            ],
            [
                15082,
                15135
            ],
            [
                15135,
                15234
            ],
            [
                15234,
                15307
            ],
            [
                15307,
                15410
            ],
            [
                15410,
                15410
            ],
            [
                15410,
                15444
            ],
            [
                15444,
                15444
            ],
            [
                15444,
                15444
            ],
            [
                15444,
                15476
            ],
            [
                15476,
                15476
            ],
            [
                15476,
                15484
            ],
            [
                15484,
                15516
            ],
            [
                15516,
                15535
            ],
            [
                15535,
                15561
            ],
            [
                15561,
                15608
            ],
            [
                15608,
                15708
            ],
            [
                15708,
                15720
            ],
            [
                15720,
                15779
            ],
            [
                15779,
                15814
            ],
            [
                15814,
                15837
            ],
            [
                15837,
                15858
            ],
            [
                15858,
                15871
            ],
            [
                15871,
                15915
            ],
            [
                15915,
                15940
            ],
            [
                15940,
                15940
            ],
            [
                15940,
                15940
            ],
            [
                15940,
                15963
            ],
            [
                15963,
                16034
            ],
            [
                16034,
                16116
            ]
        ]
    }
}