{
    "original": {
        "text": "\"Now, what,\" says Mr. George, \"may this be? Is it blank cartridge or ball? A flash in the pan or a shot?\"\nAn open letter is the subject of the trooper's speculations, and it seems to perplex him mightily. He looks at it at arm's length, brings it close to him, holds it in his right hand, holds it in his left hand, reads it with his head on this side, with his head on that side, contracts his eyebrows, elevates them, still cannot satisfy himself. He smooths it out upon the table with his heavy palm, and thoughtfully walking up and down the gallery, makes a halt before it every now and then to come upon it with a fresh eye. Even that won't do. \"Is it,\" Mr. George still muses, \"blank cartridge or ball?\"\nPhil Squod, with the aid of a brush and paint-pot, is employed in the distance whitening the targets, softly whistling in quick-march time and in drum-and-fife manner that he must and will go back again to the girl he left behind him.\n\"Phil!\" The trooper beckons as he calls him.\nPhil approaches in his usual way, sidling off at first as if he were going anywhere else and then bearing down upon his commander like a bayonet-charge. Certain splashes of white show in high relief upon his dirty face, and he scrapes his one eyebrow with the handle of the brush.\n\"Attention, Phil! Listen to this.\"\n\"Steady, commander, steady.\"\n\"'Sir. Allow me to remind you (though there is no legal necessity for my doing so, as you are aware) that the bill at two months' date drawn on yourself by Mr. Matthew Bagnet, and by you accepted, for the sum of ninety-seven pounds four shillings and ninepence, will become due to-morrow, when you will please be prepared to take up the same on presentation. Yours, Joshua Smallweed.' What do you make of that, Phil?\"\n\"Mischief, guv'ner.\"\n\"Why?\"\n\"I think,\" replies Phil after pensively tracing out a cross-wrinkle in his forehead with the brush-handle, \"that mischeevious consequences is always meant when money's asked for.\"\n\"Lookye, Phil,\" says the trooper, sitting on the table. \"First and last, I have paid, I may say, half as much again as this principal in interest and one thing and another.\"\nPhil intimates by sidling back a pace or two, with a very unaccountable wrench of his wry face, that he does not regard the transaction as being made more promising by this incident.\n\"And lookye further, Phil,\" says the trooper, staying his premature conclusions with a wave of his hand. \"There has always been an understanding that this bill was to be what they call renewed. And it has been renewed no end of times. What do you say now?\"\n\"I say that I think the times is come to a end at last.\"\n\"You do? Humph! I am much of the same mind myself.\"\n\"Joshua Smallweed is him that was brought here in a chair?\"\n\"The same.\"\n\"Guv'ner,\" says Phil with exceeding gravity, \"he's a leech in his dispositions, he's a screw and a wice in his actions, a snake in his twistings, and a lobster in his claws.\"\nHaving thus expressively uttered his sentiments, Mr. Squod, after waiting a little to ascertain if any further remark be expected of him, gets back by his usual series of movements to the target he has in hand and vigorously signifies through his former musical medium that he must and he will return to that ideal young lady. George, having folded the letter, walks in that direction.\n\"There IS a way, commander,\" says Phil, looking cunningly at him, \"of settling this.\"\n\"Paying the money, I suppose? I wish I could.\"\nPhil shakes his head. \"No, guv'ner, no; not so bad as that. There IS a way,\" says Phil with a highly artistic turn of his brush; \"what I'm a-doing at present.\"\n\"Whitewashing.\"\nPhil nods.\n\"A pretty way that would be! Do you know what would become of the Bagnets in that case? Do you know they would be ruined to pay off my old scores? YOU'RE a moral character,\" says the trooper, eyeing him in his large way with no small indignation; \"upon my life you are, Phil!\"\nPhil, on one knee at the target, is in course of protesting earnestly, though not without many allegorical scoops of his brush and smoothings of the white surface round the rim with his thumb, that he had forgotten the Bagnet responsibility and would not so much as injure a hair of the head of any member of that worthy family when steps are audible in the long passage without, and a cheerful voice is heard to wonder whether George is at home. Phil, with a look at his master, hobbles up, saying, \"Here's the guv'ner, Mrs. Bagnet! Here he is!\" and the old girl herself, accompanied by Mr. Bagnet, appears.\nThe old girl never appears in walking trim, in any season of the year, without a grey cloth cloak, coarse and much worn but very clean, which is, undoubtedly, the identical garment rendered so interesting to Mr. Bagnet by having made its way home to Europe from another quarter of the globe in company with Mrs. Bagnet and an umbrella. The latter faithful appendage is also invariably a part of the old girl's presence out of doors. It is of no colour known in this life and has a corrugated wooden crook for a handle, with a metallic object let into its prow, or beak, resembling a little model of a fanlight over a street door or one of the oval glasses out of a pair of spectacles, which ornamental object has not that tenacious capacity of sticking to its post that might be desired in an article long associated with the British army. The old girl's umbrella is of a flabby habit of waist and seems to be in need of stays--an appearance that is possibly referable to its having served through a series of years at home as a cupboard and on journeys as a carpet bag. She never puts it up, having the greatest reliance on her well-proved cloak with its capacious hood, but generally uses the instrument as a wand with which to point out joints of meat or bunches of greens in marketing or to arrest the attention of tradesmen by a friendly poke. Without her market-basket, which is a sort of wicker well with two flapping lids, she never stirs abroad. Attended by these her trusty companions, therefore, her honest sunburnt face looking cheerily out of a rough straw bonnet, Mrs. Bagnet now arrives, fresh-coloured and bright, in George's Shooting Gallery.\n\"Well, George, old fellow,\" says she, \"and how do YOU do, this sunshiny morning?\"\nGiving him a friendly shake of the hand, Mrs. Bagnet draws a long breath after her walk and sits down to enjoy a rest. Having a faculty, matured on the tops of baggage-waggons and in other such positions, of resting easily anywhere, she perches on a rough bench, unties her bonnet-strings, pushes back her bonnet, crosses her arms, and looks perfectly comfortable.\nMr. Bagnet in the meantime has shaken hands with his old comrade and with Phil, on whom Mrs. Bagnet likewise bestows a good-humoured nod and smile.\n\"Now, George,\" said Mrs. Bagnet briskly, \"here we are, Lignum and myself\"--she often speaks of her husband by this appellation, on account, as it is supposed, of Lignum Vitae having been his old regimental nickname when they first became acquainted, in compliment to the extreme hardness and toughness of his physiognomy--\"just looked in, we have, to make it all correct as usual about that security. Give him the new bill to sign, George, and he'll sign it like a man.\"\n\"I was coming to you this morning,\" observes the trooper reluctantly.\n\"Yes, we thought you'd come to us this morning, but we turned out early and left Woolwich, the best of boys, to mind his sisters and came to you instead--as you see! For Lignum, he's tied so close now, and gets so little exercise, that a walk does him good. But what's the matter, George?\" asks Mrs. Bagnet, stopping in her cheerful talk. \"You don't look yourself.\"\n\"I am not quite myself,\" returns the trooper; \"I have been a little put out, Mrs. Bagnet.\"\nHer bright quick eye catches the truth directly. \"George!\" holding up her forefinger. \"Don't tell me there's anything wrong about that security of Lignum's! Don't do it, George, on account of the children!\"\nThe trooper looks at her with a troubled visage.\n\"George,\" says Mrs. Bagnet, using both her arms for emphasis and occasionally bringing down her open hands upon her knees. \"If you have allowed anything wrong to come to that security of Lignum's, and if you have let him in for it, and if you have put us in danger of being sold up--and I see sold up in your face, George, as plain as print--you have done a shameful action and have deceived us cruelly. I tell you, cruelly, George. There!\"\nMr. Bagnet, otherwise as immovable as a pump or a lamp-post, puts his large right hand on the top of his bald head as if to defend it from a shower-bath and looks with great uneasiness at Mrs. Bagnet.\n\"George,\" says that old girl, \"I wonder at you! George, I am ashamed of you! George, I couldn't have believed you would have done it! I always knew you to be a rolling stone that gathered no moss, but I never thought you would have taken away what little moss there was for Bagnet and the children to lie upon. You know what a hard-working, steady-going chap he is. You know what Quebec and Malta and Woolwich are, and I never did think you would, or could, have had the heart to serve us so. Oh, George!\" Mrs. Bagnet gathers up her cloak to wipe her eyes on in a very genuine manner, \"How could you do it?\"\nMrs. Bagnet ceasing, Mr. Bagnet removes his hand from his head as if the shower-bath were over and looks disconsolately at Mr. George, who has turned quite white and looks distressfully at the grey cloak and straw bonnet.\n\"Mat,\" says the trooper in a subdued voice, addressing him but still looking at his wife, \"I am sorry you take it so much to heart, because I do hope it's not so bad as that comes to. I certainly have, this morning, received this letter\"--which he reads aloud--\"but I hope it may be set right yet. As to a rolling stone, why, what you say is true. I AM a rolling stone, and I never rolled in anybody's way, I fully believe, that I rolled the least good to. But it's impossible for an old vagabond comrade to like your wife and family better than I like 'em, Mat, and I trust you'll look upon me as forgivingly as you can. Don't think I've kept anything from you. I haven't had the letter more than a quarter of an hour.\"\n\"Old girl,\" murmurs Mr. Bagnet after a short silence, \"will you tell him my opinion?\"\n\"Oh! Why didn't he marry,\" Mrs. Bagnet answers, half laughing and half crying, \"Joe Pouch's widder in North America? Then he wouldn't have got himself into these troubles.\"\n\"The old girl,\" says Mr. Bagnet, \"puts it correct--why didn't you?\"\n\"Well, she has a better husband by this time, I hope,\" returns the trooper. \"Anyhow, here I stand, this present day, NOT married to Joe Pouch's widder. What shall I do? You see all I have got about me. It's not mine; it's yours. Give the word, and I'll sell off every morsel. If I could have hoped it would have brought in nearly the sum wanted, I'd have sold all long ago. Don't believe that I'll leave you or yours in the lurch, Mat. I'd sell myself first. I only wish,\" says the trooper, giving himself a disparaging blow in the chest, \"that I knew of any one who'd buy such a second-hand piece of old stores.\"\n\"Old girl,\" murmurs Mr. Bagnet, \"give him another bit of my mind.\"\n\"George,\" says the old girl, \"you are not so much to be blamed, on full consideration, except for ever taking this business without the means.\"\n\"And that was like me!\" observes the penitent trooper, shaking his head. \"Like me, I know.\"\n\"Silence! The old girl,\" says Mr. Bagnet, \"is correct--in her way of giving my opinions--hear me out!\"\n\"That was when you never ought to have asked for the security, George, and when you never ought to have got it, all things considered. But what's done can't be undone. You are always an honourable and straightforward fellow, as far as lays in your power, though a little flighty. On the other hand, you can't admit but what it's natural in us to be anxious with such a thing hanging over our heads. So forget and forgive all round, George. Come! Forget and forgive all round!\"\nMrs. Bagnet, giving him one of her honest hands and giving her husband the other, Mr. George gives each of them one of his and holds them while he speaks.\n\"I do assure you both, there's nothing I wouldn't do to discharge this obligation. But whatever I have been able to scrape together has gone every two months in keeping it up. We have lived plainly enough here, Phil and I. But the gallery don't quite do what was expected of it, and it's not--in short, it's not the mint. It was wrong in me to take it? Well, so it was. But I was in a manner drawn into that step, and I thought it might steady me, and set me up, and you'll try to overlook my having such expectations, and upon my soul, I am very much obliged to you, and very much ashamed of myself.\" With these concluding words, Mr. George gives a shake to each of the hands he holds, and relinquishing them, backs a pace or two in a broad-chested, upright attitude, as if he had made a final confession and were immediately going to be shot with all military honours.\n\"George, hear me out!\" says Mr. Bagnet, glancing at his wife. \"Old girl, go on!\"\nMr. Bagnet, being in this singular manner heard out, has merely to observe that the letter must be attended to without any delay, that it is advisable that George and he should immediately wait on Mr. Smallweed in person, and that the primary object is to save and hold harmless Mr. Bagnet, who had none of the money. Mr. George, entirely assenting, puts on his hat and prepares to march with Mr. Bagnet to the enemy's camp.\n\"Don't you mind a woman's hasty word, George,\" says Mrs. Bagnet, patting him on the shoulder. \"I trust my old Lignum to you, and I am sure you'll bring him through it.\"\nThe trooper returns that this is kindly said and that he WILL bring Lignum through it somehow. Upon which Mrs. Bagnet, with her cloak, basket, and umbrella, goes home, bright-eyed again, to the rest of her family, and the comrades sally forth on the hopeful errand of mollifying Mr. Smallweed.\nWhether there are two people in England less likely to come satisfactorily out of any negotiation with Mr. Smallweed than Mr. George and Mr. Matthew Bagnet may be very reasonably questioned. Also, notwithstanding their martial appearance, broad square shoulders, and heavy tread, whether there are within the same limits two more simple and unaccustomed children in all the Smallweedy affairs of life. As they proceed with great gravity through the streets towards the region of Mount Pleasant, Mr. Bagnet, observing his companion to be thoughtful, considers it a friendly part to refer to Mrs. Bagnet's late sally.\n\"George, you know the old girl--she's as sweet and as mild as milk. But touch her on the children--or myself--and she's off like gunpowder.\"\n\"It does her credit, Mat!\"\n\"George,\" says Mr. Bagnet, looking straight before him, \"the old girl--can't do anything--that don't do her credit. More or less. I never say so. Discipline must be maintained.\"\n\"She's worth her weight in gold,\" says the trooper.\n\"In gold?\" says Mr. Bagnet. \"I'll tell you what. The old girl's weight--is twelve stone six. Would I take that weight--in any metal--for the old girl? No. Why not? Because the old girl's metal is far more precious--than the preciousest metal. And she's ALL metal!\"\n\"You are right, Mat!\"\n\"When she took me--and accepted of the ring--she 'listed under me and the children--heart and head, for life. She's that earnest,\" says Mr. Bagnet, \"and true to her colours--that, touch us with a finger--and she turns out--and stands to her arms. If the old girl fires wide--once in a way--at the call of duty--look over it, George. For she's loyal!\"\n\"Why, bless her, Mat,\" returns the trooper, \"I think the higher of her for it!\"\n\"You are right!\" says Mr. Bagnet with the warmest enthusiasm, though without relaxing the rigidity of a single muscle. \"Think as high of the old girl--as the rock of Gibraltar--and still you'll be thinking low--of such merits. But I never own to it before her. Discipline must be maintained.\"\nThese encomiums bring them to Mount Pleasant and to Grandfather Smallweed's house. The door is opened by the perennial Judy, who, having surveyed them from top to toe with no particular favour, but indeed with a malignant sneer, leaves them standing there while she consults the oracle as to their admission. The oracle may be inferred to give consent from the circumstance of her returning with the words on her honey lips that they can come in if they want to it. Thus privileged, they come in and find Mr. Smallweed with his feet in the drawer of his chair as if it were a paper foot-bath and Mrs. Smallweed obscured with the cushion like a bird that is not to sing.\n\"My dear friend,\" says Grandfather Smallweed with those two lean affectionate arms of his stretched forth. \"How de do? How de do? Who is our friend, my dear friend?\"\n\"Why this,\" returns George, not able to be very conciliatory at first, \"is Matthew Bagnet, who has obliged me in that matter of ours, you know.\"\n\"Oh! Mr. Bagnet? Surely!\" The old man looks at him under his hand.\n\"Hope you're well, Mr. Bagnet? Fine man, Mr. George! Military air, sir!\"\nNo chairs being offered, Mr. George brings one forward for Bagnet and one for himself. They sit down, Mr. Bagnet as if he had no power of bending himself, except at the hips, for that purpose.\n\"Judy,\" says Mr. Smallweed, \"bring the pipe.\"\n\"Why, I don't know,\" Mr. George interposes, \"that the young woman need give herself that trouble, for to tell you the truth, I am not inclined to smoke it to-day.\"\n\"Ain't you?\" returns the old man. \"Judy, bring the pipe.\"\n\"The fact is, Mr. Smallweed,\" proceeds George, \"that I find myself in rather an unpleasant state of mind. It appears to me, sir, that your friend in the city has been playing tricks.\"\n\"Oh, dear no!\" says Grandfather Smallweed. \"He never does that!\"\n\"Don't he? Well, I am glad to hear it, because I thought it might be HIS doing. This, you know, I am speaking of. This letter.\"\nGrandfather Smallweed smiles in a very ugly way in recognition of the letter.\n\"What does it mean?\" asks Mr. George.\n\"Judy,\" says the old man. \"Have you got the pipe? Give it to me. Did you say what does it mean, my good friend?\"\n\"Aye! Now, come, come, you know, Mr. Smallweed,\" urges the trooper, constraining himself to speak as smoothly and confidentially as he can, holding the open letter in one hand and resting the broad knuckles of the other on his thigh, \"a good lot of money has passed between us, and we are face to face at the present moment, and are both well aware of the understanding there has always been. I am prepared to do the usual thing which I have done regularly and to keep this matter going. I never got a letter like this from you before, and I have been a little put about by it this morning, because here's my friend Matthew Bagnet, who, you know, had none of the money--\"\n\"I DON'T know it, you know,\" says the old man quietly.\n\"Why, con-found you--it, I mean--I tell you so, don't I?\"\n\"Oh, yes, you tell me so,\" returns Grandfather Smallweed. \"But I don't know it.\"\n\"Well!\" says the trooper, swallowing his fire. \"I know it.\"\nMr. Smallweed replies with excellent temper, \"Ah! That's quite another thing!\" And adds, \"But it don't matter. Mr. Bagnet's situation is all one, whether or no.\"\nThe unfortunate George makes a great effort to arrange the affair comfortably and to propitiate Mr. Smallweed by taking him upon his own terms.\n\"That's just what I mean. As you say, Mr. Smallweed, here's Matthew Bagnet liable to be fixed whether or no. Now, you see, that makes his good lady very uneasy in her mind, and me too, for whereas I'm a harum-scarum sort of a good-for-nought that more kicks than halfpence come natural to, why he's a steady family man, don't you see? Now, Mr. Smallweed,\" says the trooper, gaining confidence as he proceeds in his soldierly mode of doing business, \"although you and I are good friends enough in a certain sort of a way, I am well aware that I can't ask you to let my friend Bagnet off entirely.\"\n\"Oh, dear, you are too modest. You can ASK me anything, Mr. George.\" (There is an ogreish kind of jocularity in Grandfather Smallweed to-day.)\n\"And you can refuse, you mean, eh? Or not you so much, perhaps, as your friend in the city? Ha ha ha!\"\n\"Ha ha ha!\" echoes Grandfather Smallweed. In such a very hard manner and with eyes so particularly green that Mr. Bagnet's natural gravity is much deepened by the contemplation of that venerable man.\n\"Come!\" says the sanguine George. \"I am glad to find we can be pleasant, because I want to arrange this pleasantly. Here's my friend Bagnet, and here am I. We'll settle the matter on the spot, if you please, Mr. Smallweed, in the usual way. And you'll ease my friend Bagnet's mind, and his family's mind, a good deal if you'll just mention to him what our understanding is.\"\nHere some shrill spectre cries out in a mocking manner, \"Oh, good gracious! Oh!\" Unless, indeed, it be the sportive Judy, who is found to be silent when the startled visitors look round, but whose chin has received a recent toss, expressive of derision and contempt. Mr. Bagnet's gravity becomes yet more profound.\n\"But I think you asked me, Mr. George\"--old Smallweed, who all this time has had the pipe in his hand, is the speaker now--\"I think you asked me, what did the letter mean?\"\n\"Why, yes, I did,\" returns the trooper in his off-hand way, \"but I don't care to know particularly, if it's all correct and pleasant.\"\nMr. Smallweed, purposely balking himself in an aim at the trooper's head, throws the pipe on the ground and breaks it to pieces.\n\"That's what it means, my dear friend. I'll smash you. I'll crumble you. I'll powder you. Go to the devil!\"\nThe two friends rise and look at one another. Mr. Bagnet's gravity has now attained its profoundest point.\n\"Go to the devil!\" repeats the old man. \"I'll have no more of your pipe-smokings and swaggerings. What? You're an independent dragoon, too! Go to my lawyer (you remember where; you have been there before) and show your independence now, will you? Come, my dear friend, there's a chance for you. Open the street door, Judy; put these blusterers out! Call in help if they don't go. Put 'em out!\"\nHe vociferates this so loudly that Mr. Bagnet, laying his hands on the shoulders of his comrade before the latter can recover from his amazement, gets him on the outside of the street door, which is instantly slammed by the triumphant Judy. Utterly confounded, Mr. George awhile stands looking at the knocker. Mr. Bagnet, in a perfect abyss of gravity, walks up and down before the little parlour window like a sentry and looks in every time he passes, apparently revolving something in his mind.\n\"Come, Mat,\" says Mr. George when he has recovered himself, \"we must try the lawyer. Now, what do you think of this rascal?\"\nMr. Bagnet, stopping to take a farewell look into the parlour, replies with one shake of his head directed at the interior, \"If my old girl had been here--I'd have told him!\" Having so discharged himself of the subject of his cogitations, he falls into step and marches off with the trooper, shoulder to shoulder.\nWhen they present themselves in Lincoln's Inn Fields, Mr. Tulkinghorn is engaged and not to be seen. He is not at all willing to see them, for when they have waited a full hour, and the clerk, on his bell being rung, takes the opportunity of mentioning as much, he brings forth no more encouraging message than that Mr. Tulkinghorn has nothing to say to them and they had better not wait. They do wait, however, with the perseverance of military tactics, and at last the bell rings again and the client in possession comes out of Mr. Tulkinghorn's room.\nThe client is a handsome old lady, no other than Mrs. Rouncewell, housekeeper at Chesney Wold. She comes out of the sanctuary with a fair old-fashioned curtsy and softly shuts the door. She is treated with some distinction there, for the clerk steps out of his pew to show her through the outer office and to let her out. The old lady is thanking him for his attention when she observes the comrades in waiting.\n\"I beg your pardon, sir, but I think those gentlemen are military?\"\nThe clerk referring the question to them with his eye, and Mr. George not turning round from the almanac over the fire-place. Mr. Bagnet takes upon himself to reply, \"Yes, ma'am. Formerly.\"\n\"I thought so. I was sure of it. My heart warms, gentlemen, at the sight of you. It always does at the sight of such. God bless you, gentlemen! You'll excuse an old woman, but I had a son once who went for a soldier. A fine handsome youth he was, and good in his bold way, though some people did disparage him to his poor mother. I ask your pardon for troubling you, sir. God bless you, gentlemen!\"\n\"Same to you, ma'am!\" returns Mr. Bagnet with right good will.\nThere is something very touching in the earnestness of the old lady's voice and in the tremble that goes through her quaint old figure. But Mr. George is so occupied with the almanac over the fire-place (calculating the coming months by it perhaps) that he does not look round until she has gone away and the door is closed upon her.\n\"George,\" Mr. Bagnet gruffly whispers when he does turn from the almanac at last. \"Don't be cast down! 'Why, soldiers, why--should we be melancholy, boys?' Cheer up, my hearty!\"\nThe clerk having now again gone in to say that they are still there and Mr. Tulkinghorn being heard to return with some irascibility, \"Let 'em come in then!\" they pass into the great room with the painted ceiling and find him standing before the fire.\n\"Now, you men, what do you want? Sergeant, I told you the last time I saw you that I don't desire your company here.\"\nSergeant replies--dashed within the last few minutes as to his usual manner of speech, and even as to his usual carriage--that he has received this letter, has been to Mr. Smallweed about it, and has been referred there.\n\"I have nothing to say to you,\" rejoins Mr. Tulkinghorn. \"If you get into debt, you must pay your debts or take the consequences. You have no occasion to come here to learn that, I suppose?\"\nSergeant is sorry to say that he is not prepared with the money.\n\"Very well! Then the other man--this man, if this is he--must pay it for you.\"\nSergeant is sorry to add that the other man is not prepared with the money either.\n\"Very well! Then you must pay it between you or you must both be sued for it and both suffer. You have had the money and must refund it. You are not to pocket other people's pounds, shillings, and pence and escape scot-free.\"\nThe lawyer sits down in his easy-chair and stirs the fire. Mr. George hopes he will have the goodness to--\"I tell you, sergeant, I have nothing to say to you. I don't like your associates and don't want you here. This matter is not at all in my course of practice and is not in my office. Mr. Smallweed is good enough to offer these affairs to me, but they are not in my way. You must go to Melchisedech's in Clifford's Inn.\"\n\"I must make an apology to you, sir,\" says Mr. George, \"for pressing myself upon you with so little encouragement--which is almost as unpleasant to me as it can be to you--but would you let me say a private word to you?\"\nMr. Tulkinghorn rises with his hands in his pockets and walks into one of the window recesses. \"Now! I have no time to waste.\" In the midst of his perfect assumption of indifference, he directs a sharp look at the trooper, taking care to stand with his own back to the light and to have the other with his face towards it.\n\"Well, sir,\" says Mr. George, \"this man with me is the other party implicated in this unfortunate affair--nominally, only nominally--and my sole object is to prevent his getting into trouble on my account. He is a most respectable man with a wife and family, formerly in the Royal Artillery--\"\n\"My friend, I don't care a pinch of snuff for the whole Royal Artillery establishment--officers, men, tumbrils, waggons, horses, guns, and ammunition.\"\n\"'Tis likely, sir. But I care a good deal for Bagnet and his wife and family being injured on my account. And if I could bring them through this matter, I should have no help for it but to give up without any other consideration what you wanted of me the other day.\"\n\"Have you got it here?\"\n\"I have got it here, sir.\"\n\"Sergeant,\" the lawyer proceeds in his dry passionless manner, far more hopeless in the dealing with than any amount of vehemence, \"make up your mind while I speak to you, for this is final. After I have finished speaking I have closed the subject, and I won't re-open it. Understand that. You can leave here, for a few days, what you say you have brought here if you choose; you can take it away at once if you choose. In case you choose to leave it here, I can do this for you--I can replace this matter on its old footing, and I can go so far besides as to give you a written undertaking that this man Bagnet shall never be troubled in any way until you have been proceeded against to the utmost, that your means shall be exhausted before the creditor looks to his. This is in fact all but freeing him. Have you decided?\"\nThe trooper puts his hand into his breast and answers with a long breath, \"I must do it, sir.\"\nSo Mr. Tulkinghorn, putting on his spectacles, sits down and writes the undertaking, which he slowly reads and explains to Bagnet, who has all this time been staring at the ceiling and who puts his hand on his bald head again, under this new verbal shower-bath, and seems exceedingly in need of the old girl through whom to express his sentiments. The trooper then takes from his breast-pocket a folded paper, which he lays with an unwilling hand at the lawyer's elbow. \"'Tis only a letter of instructions, sir. The last I ever had from him.\"\nLook at a millstone, Mr. George, for some change in its expression, and you will find it quite as soon as in the face of Mr. Tulkinghorn when he opens and reads the letter! He refolds it and lays it in his desk with a countenance as unperturbable as death.\nNor has he anything more to say or do but to nod once in the same frigid and discourteous manner and to say briefly, \"You can go. Show these men out, there!\" Being shown out, they repair to Mr. Bagnet's residence to dine.\nBoiled beef and greens constitute the day's variety on the former repast of boiled pork and greens, and Mrs. Bagnet serves out the meal in the same way and seasons it with the best of temper, being that rare sort of old girl that she receives Good to her arms without a hint that it might be Better and catches light from any little spot of darkness near her. The spot on this occasion is the darkened brow of Mr. George; he is unusually thoughtful and depressed. At first Mrs. Bagnet trusts to the combined endearments of Quebec and Malta to restore him, but finding those young ladies sensible that their existing Bluffy is not the Bluffy of their usual frolicsome acquaintance, she winks off the light infantry and leaves him to deploy at leisure on the open ground of the domestic hearth.\nBut he does not. He remains in close order, clouded and depressed. During the lengthy cleaning up and pattening process, when he and Mr. Bagnet are supplied with their pipes, he is no better than he was at dinner. He forgets to smoke, looks at the fire and ponders, lets his pipe out, fills the breast of Mr. Bagnet with perturbation and dismay by showing that he has no enjoyment of tobacco.\nTherefore when Mrs. Bagnet at last appears, rosy from the invigorating pail, and sits down to her work, Mr. Bagnet growls, \"Old girl!\" and winks monitions to her to find out what's the matter.\n\"Why, George!\" says Mrs. Bagnet, quietly threading her needle. \"How low you are!\"\n\"Am I? Not good company? Well, I am afraid I am not.\"\n\"He ain't at all like Bluffy, mother!\" cries little Malta.\n\"Because he ain't well, I think, mother,\" adds Quebec.\n\"Sure that's a bad sign not to be like Bluffy, too!\" returns the trooper, kissing the young damsels. \"But it's true,\" with a sigh, \"true, I am afraid. These little ones are always right!\"\n\"George,\" says Mrs. Bagnet, working busily, \"if I thought you cross enough to think of anything that a shrill old soldier's wife--who could have bitten her tongue off afterwards and ought to have done it almost--said this morning, I don't know what I shouldn't say to you now.\"\n\"My kind soul of a darling,\" returns the trooper. \"Not a morsel of it.\"\n\"Because really and truly, George, what I said and meant to say was that I trusted Lignum to you and was sure you'd bring him through it. And you HAVE brought him through it, noble!\"\n\"Thankee, my dear!\" says George. \"I am glad of your good opinion.\"\nIn giving Mrs. Bagnet's hand, with her work in it, a friendly shake--for she took her seat beside him--the trooper's attention is attracted to her face. After looking at it for a little while as she plies her needle, he looks to young Woolwich, sitting on his stool in the corner, and beckons that fifer to him.\n\"See there, my boy,\" says George, very gently smoothing the mother's hair with his hand, \"there's a good loving forehead for you! All bright with love of you, my boy. A little touched by the sun and the weather through following your father about and taking care of you, but as fresh and wholesome as a ripe apple on a tree.\"\nMr. Bagnet's face expresses, so far as in its wooden material lies, the highest approbation and acquiescence.\n\"The time will come, my boy,\" pursues the trooper, \"when this hair of your mother's will be grey, and this forehead all crossed and re-crossed with wrinkles, and a fine old lady she'll be then. Take care, while you are young, that you can think in those days, 'I never whitened a hair of her dear head--I never marked a sorrowful line in her face!' For of all the many things that you can think of when you are a man, you had better have THAT by you, Woolwich!\"\nMr. George concludes by rising from his chair, seating the boy beside his mother in it, and saying, with something of a hurry about him, that he'll smoke his pipe in the street a bit.",
        "paragraph_chars": [
            [
                0,
                106
            ],
            [
                106,
                710
            ],
            [
                710,
                945
            ],
            [
                945,
                990
            ],
            [
                990,
                1271
            ],
            [
                1271,
                1306
            ],
            [
                1306,
                1335
            ],
            [
                1335,
                1753
            ],
            [
                1753,
                1774
            ],
            [
                1774,
                1781
            ],
            [
                1781,
                1961
            ],
            [
                1961,
                2135
            ],
            [
                2135,
                2318
            ],
            [
                2318,
                2575
            ],
            [
                2575,
                2632
            ],
            [
                2632,
                2684
            ],
            [
                2684,
                2744
            ],
            [
                2744,
                2756
            ],
            [
                2756,
                2931
            ],
            [
                2931,
                3317
            ],
            [
                3317,
                3403
            ],
            [
                3403,
                3450
            ],
            [
                3450,
                3610
            ],
            [
                3610,
                3626
            ],
            [
                3626,
                3637
            ],
            [
                3637,
                3914
            ],
            [
                3914,
                4523
            ],
            [
                4523,
                6183
            ],
            [
                6183,
                6265
            ],
            [
                6265,
                6630
            ],
            [
                6630,
                6778
            ],
            [
                6778,
                7249
            ],
            [
                7249,
                7319
            ],
            [
                7319,
                7685
            ],
            [
                7685,
                7776
            ],
            [
                7776,
                7983
            ],
            [
                7983,
                8032
            ],
            [
                8032,
                8473
            ],
            [
                8473,
                8674
            ],
            [
                8674,
                9282
            ],
            [
                9282,
                9504
            ],
            [
                9504,
                10225
            ],
            [
                10225,
                10311
            ],
            [
                10311,
                10484
            ],
            [
                10484,
                10552
            ],
            [
                10552,
                11166
            ],
            [
                11166,
                11233
            ],
            [
                11233,
                11377
            ],
            [
                11377,
                11469
            ],
            [
                11469,
                11572
            ],
            [
                11572,
                12049
            ],
            [
                12049,
                12204
            ],
            [
                12204,
                13075
            ],
            [
                13075,
                13156
            ],
            [
                13156,
                13581
            ],
            [
                13581,
                13750
            ],
            [
                13750,
                14044
            ],
            [
                14044,
                14660
            ],
            [
                14660,
                14801
            ],
            [
                14801,
                14828
            ],
            [
                14828,
                15006
            ],
            [
                15006,
                15058
            ],
            [
                15058,
                15323
            ],
            [
                15323,
                15345
            ],
            [
                15345,
                15696
            ],
            [
                15696,
                15776
            ],
            [
                15776,
                16069
            ],
            [
                16069,
                16739
            ],
            [
                16739,
                16905
            ],
            [
                16905,
                17050
            ],
            [
                17050,
                17117
            ],
            [
                17117,
                17190
            ],
            [
                17190,
                17383
            ],
            [
                17383,
                17429
            ],
            [
                17429,
                17593
            ],
            [
                17593,
                17651
            ],
            [
                17651,
                17835
            ],
            [
                17835,
                17900
            ],
            [
                17900,
                18028
            ],
            [
                18028,
                18106
            ],
            [
                18106,
                18144
            ],
            [
                18144,
                18257
            ],
            [
                18257,
                18929
            ],
            [
                18929,
                18984
            ],
            [
                18984,
                19042
            ],
            [
                19042,
                19123
            ],
            [
                19123,
                19183
            ],
            [
                19183,
                19345
            ],
            [
                19345,
                19489
            ],
            [
                19489,
                20086
            ],
            [
                20086,
                20229
            ],
            [
                20229,
                20332
            ],
            [
                20332,
                20532
            ],
            [
                20532,
                20907
            ],
            [
                20907,
                21222
            ],
            [
                21222,
                21395
            ],
            [
                21395,
                21530
            ],
            [
                21530,
                21659
            ],
            [
                21659,
                21767
            ],
            [
                21767,
                21874
            ],
            [
                21874,
                22268
            ],
            [
                22268,
                22765
            ],
            [
                22765,
                22890
            ],
            [
                22890,
                23204
            ],
            [
                23204,
                23758
            ],
            [
                23758,
                24170
            ],
            [
                24170,
                24238
            ],
            [
                24238,
                24428
            ],
            [
                24428,
                24827
            ],
            [
                24827,
                24890
            ],
            [
                24890,
                25224
            ],
            [
                25224,
                25402
            ],
            [
                25402,
                25654
            ],
            [
                25654,
                25772
            ],
            [
                25772,
                25993
            ],
            [
                25993,
                26184
            ],
            [
                26184,
                26249
            ],
            [
                26249,
                26328
            ],
            [
                26328,
                26411
            ],
            [
                26411,
                26637
            ],
            [
                26637,
                27063
            ],
            [
                27063,
                27284
            ],
            [
                27284,
                27607
            ],
            [
                27607,
                27901
            ],
            [
                27901,
                28053
            ],
            [
                28053,
                28320
            ],
            [
                28320,
                28344
            ],
            [
                28344,
                28371
            ],
            [
                28371,
                29196
            ],
            [
                29196,
                29291
            ],
            [
                29291,
                29834
            ],
            [
                29834,
                30091
            ],
            [
                30091,
                30313
            ],
            [
                30313,
                31106
            ],
            [
                31106,
                31499
            ],
            [
                31499,
                31692
            ],
            [
                31692,
                31774
            ],
            [
                31774,
                31828
            ],
            [
                31828,
                31887
            ],
            [
                31887,
                31942
            ],
            [
                31942,
                32130
            ],
            [
                32130,
                32408
            ],
            [
                32408,
                32480
            ],
            [
                32480,
                32663
            ],
            [
                32663,
                32730
            ],
            [
                32730,
                33042
            ],
            [
                33042,
                33368
            ],
            [
                33368,
                33478
            ],
            [
                33478,
                33940
            ],
            [
                33940,
                34123
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                75
            ],
            [
                75,
                106
            ],
            [
                106,
                205
            ],
            [
                205,
                450
            ],
            [
                450,
                630
            ],
            [
                630,
                650
            ],
            [
                650,
                710
            ],
            [
                710,
                945
            ],
            [
                945,
                953
            ],
            [
                953,
                990
            ],
            [
                990,
                1143
            ],
            [
                1143,
                1271
            ],
            [
                1271,
                1289
            ],
            [
                1289,
                1306
            ],
            [
                1306,
                1335
            ],
            [
                1335,
                1342
            ],
            [
                1342,
                1694
            ],
            [
                1694,
                1720
            ],
            [
                1720,
                1753
            ],
            [
                1753,
                1774
            ],
            [
                1774,
                1781
            ],
            [
                1781,
                1961
            ],
            [
                1961,
                2017
            ],
            [
                2017,
                2135
            ],
            [
                2135,
                2318
            ],
            [
                2318,
                2423
            ],
            [
                2423,
                2512
            ],
            [
                2512,
                2553
            ],
            [
                2553,
                2575
            ],
            [
                2575,
                2632
            ],
            [
                2632,
                2641
            ],
            [
                2641,
                2648
            ],
            [
                2648,
                2684
            ],
            [
                2684,
                2744
            ],
            [
                2744,
                2756
            ],
            [
                2756,
                2931
            ],
            [
                2931,
                3258
            ],
            [
                3258,
                3317
            ],
            [
                3317,
                3403
            ],
            [
                3403,
                3433
            ],
            [
                3433,
                3450
            ],
            [
                3450,
                3472
            ],
            [
                3472,
                3510
            ],
            [
                3510,
                3610
            ],
            [
                3610,
                3626
            ],
            [
                3626,
                3637
            ],
            [
                3637,
                3666
            ],
            [
                3666,
                3725
            ],
            [
                3725,
                3784
            ],
            [
                3784,
                3914
            ],
            [
                3914,
                4361
            ],
            [
                4361,
                4448
            ],
            [
                4448,
                4461
            ],
            [
                4461,
                4523
            ],
            [
                4523,
                4859
            ],
            [
                4859,
                4956
            ],
            [
                4956,
                5363
            ],
            [
                5363,
                5594
            ],
            [
                5594,
                5872
            ],
            [
                5872,
                5978
            ],
            [
                5978,
                6183
            ],
            [
                6183,
                6265
            ],
            [
                6265,
                6384
            ],
            [
                6384,
                6630
            ],
            [
                6630,
                6778
            ],
            [
                6778,
                7179
            ],
            [
                7179,
                7249
            ],
            [
                7249,
                7319
            ],
            [
                7319,
                7485
            ],
            [
                7485,
                7577
            ],
            [
                7577,
                7609
            ],
            [
                7609,
                7658
            ],
            [
                7658,
                7685
            ],
            [
                7685,
                7776
            ],
            [
                7776,
                7825
            ],
            [
                7825,
                7835
            ],
            [
                7835,
                7862
            ],
            [
                7862,
                7933
            ],
            [
                7933,
                7983
            ],
            [
                7983,
                8032
            ],
            [
                8032,
                8155
            ],
            [
                8155,
                8436
            ],
            [
                8436,
                8465
            ],
            [
                8465,
                8473
            ],
            [
                8473,
                8674
            ],
            [
                8674,
                8722
            ],
            [
                8722,
                8751
            ],
            [
                8751,
                8808
            ],
            [
                8808,
                8985
            ],
            [
                8985,
                9040
            ],
            [
                9040,
                9167
            ],
            [
                9167,
                9180
            ],
            [
                9180,
                9282
            ],
            [
                9282,
                9504
            ],
            [
                9504,
                9688
            ],
            [
                9688,
                9802
            ],
            [
                9802,
                9852
            ],
            [
                9852,
                9961
            ],
            [
                9961,
                10126
            ],
            [
                10126,
                10167
            ],
            [
                10167,
                10225
            ],
            [
                10225,
                10311
            ],
            [
                10311,
                10316
            ],
            [
                10316,
                10428
            ],
            [
                10428,
                10484
            ],
            [
                10484,
                10552
            ],
            [
                10552,
                10628
            ],
            [
                10628,
                10704
            ],
            [
                10704,
                10721
            ],
            [
                10721,
                10754
            ],
            [
                10754,
                10781
            ],
            [
                10781,
                10828
            ],
            [
                10828,
                10926
            ],
            [
                10926,
                10988
            ],
            [
                10988,
                11011
            ],
            [
                11011,
                11166
            ],
            [
                11166,
                11233
            ],
            [
                11233,
                11377
            ],
            [
                11377,
                11401
            ],
            [
                11401,
                11450
            ],
            [
                11450,
                11469
            ],
            [
                11469,
                11479
            ],
            [
                11479,
                11572
            ],
            [
                11572,
                11707
            ],
            [
                11707,
                11740
            ],
            [
                11740,
                11852
            ],
            [
                11852,
                11971
            ],
            [
                11971,
                12012
            ],
            [
                12012,
                12018
            ],
            [
                12018,
                12049
            ],
            [
                12049,
                12204
            ],
            [
                12204,
                12287
            ],
            [
                12287,
                12380
            ],
            [
                12380,
                12427
            ],
            [
                12427,
                12526
            ],
            [
                12526,
                12557
            ],
            [
                12557,
                12574
            ],
            [
                12574,
                12806
            ],
            [
                12806,
                13075
            ],
            [
                13075,
                13098
            ],
            [
                13098,
                13137
            ],
            [
                13137,
                13156
            ],
            [
                13156,
                13474
            ],
            [
                13474,
                13581
            ],
            [
                13581,
                13675
            ],
            [
                13675,
                13750
            ],
            [
                13750,
                13845
            ],
            [
                13845,
                14044
            ],
            [
                14044,
                14235
            ],
            [
                14235,
                14446
            ],
            [
                14446,
                14660
            ],
            [
                14660,
                14728
            ],
            [
                14728,
                14801
            ],
            [
                14801,
                14828
            ],
            [
                14828,
                14944
            ],
            [
                14944,
                14958
            ],
            [
                14958,
                14974
            ],
            [
                14974,
                15006
            ],
            [
                15006,
                15058
            ],
            [
                15058,
                15069
            ],
            [
                15069,
                15086
            ],
            [
                15086,
                15107
            ],
            [
                15107,
                15151
            ],
            [
                15151,
                15209
            ],
            [
                15209,
                15213
            ],
            [
                15213,
                15222
            ],
            [
                15222,
                15301
            ],
            [
                15301,
                15323
            ],
            [
                15323,
                15345
            ],
            [
                15345,
                15455
            ],
            [
                15455,
                15592
            ],
            [
                15592,
                15678
            ],
            [
                15678,
                15696
            ],
            [
                15696,
                15776
            ],
            [
                15776,
                15793
            ],
            [
                15793,
                15895
            ],
            [
                15895,
                16003
            ],
            [
                16003,
                16037
            ],
            [
                16037,
                16069
            ],
            [
                16069,
                16152
            ],
            [
                16152,
                16378
            ],
            [
                16378,
                16535
            ],
            [
                16535,
                16739
            ],
            [
                16739,
                16846
            ],
            [
                16846,
                16858
            ],
            [
                16858,
                16869
            ],
            [
                16869,
                16905
            ],
            [
                16905,
                17050
            ],
            [
                17050,
                17055
            ],
            [
                17055,
                17067
            ],
            [
                17067,
                17076
            ],
            [
                17076,
                17117
            ],
            [
                17117,
                17148
            ],
            [
                17148,
                17170
            ],
            [
                17170,
                17190
            ],
            [
                17190,
                17277
            ],
            [
                17277,
                17383
            ],
            [
                17383,
                17429
            ],
            [
                17429,
                17593
            ],
            [
                17593,
                17606
            ],
            [
                17606,
                17627
            ],
            [
                17627,
                17651
            ],
            [
                17651,
                17757
            ],
            [
                17757,
                17835
            ],
            [
                17835,
                17850
            ],
            [
                17850,
                17878
            ],
            [
                17878,
                17900
            ],
            [
                17900,
                17911
            ],
            [
                17911,
                17980
            ],
            [
                17980,
                18014
            ],
            [
                18014,
                18028
            ],
            [
                18028,
                18106
            ],
            [
                18106,
                18127
            ],
            [
                18127,
                18144
            ],
            [
                18144,
                18170
            ],
            [
                18170,
                18194
            ],
            [
                18194,
                18209
            ],
            [
                18209,
                18257
            ],
            [
                18257,
                18263
            ],
            [
                18263,
                18650
            ],
            [
                18650,
                18745
            ],
            [
                18745,
                18929
            ],
            [
                18929,
                18984
            ],
            [
                18984,
                19042
            ],
            [
                19042,
                19100
            ],
            [
                19100,
                19123
            ],
            [
                19123,
                19131
            ],
            [
                19131,
                19170
            ],
            [
                19170,
                19183
            ],
            [
                19183,
                19233
            ],
            [
                19233,
                19262
            ],
            [
                19262,
                19294
            ],
            [
                19294,
                19345
            ],
            [
                19345,
                19489
            ],
            [
                19489,
                19515
            ],
            [
                19515,
                19598
            ],
            [
                19598,
                19824
            ],
            [
                19824,
                20086
            ],
            [
                20086,
                20117
            ],
            [
                20117,
                20155
            ],
            [
                20155,
                20229
            ],
            [
                20229,
                20264
            ],
            [
                20264,
                20321
            ],
            [
                20321,
                20332
            ],
            [
                20332,
                20344
            ],
            [
                20344,
                20374
            ],
            [
                20374,
                20532
            ],
            [
                20532,
                20540
            ],
            [
                20540,
                20566
            ],
            [
                20566,
                20648
            ],
            [
                20648,
                20688
            ],
            [
                20688,
                20773
            ],
            [
                20773,
                20907
            ],
            [
                20907,
                20983
            ],
            [
                20983,
                20988
            ],
            [
                20988,
                21174
            ],
            [
                21174,
                21222
            ],
            [
                21222,
                21395
            ],
            [
                21395,
                21530
            ],
            [
                21530,
                21659
            ],
            [
                21659,
                21698
            ],
            [
                21698,
                21714
            ],
            [
                21714,
                21732
            ],
            [
                21732,
                21749
            ],
            [
                21749,
                21767
            ],
            [
                21767,
                21813
            ],
            [
                21813,
                21874
            ],
            [
                21874,
                21893
            ],
            [
                21893,
                21914
            ],
            [
                21914,
                21972
            ],
            [
                21972,
                21978
            ],
            [
                21978,
                22014
            ],
            [
                22014,
                22121
            ],
            [
                22121,
                22169
            ],
            [
                22169,
                22223
            ],
            [
                22223,
                22254
            ],
            [
                22254,
                22268
            ],
            [
                22268,
                22509
            ],
            [
                22509,
                22578
            ],
            [
                22578,
                22765
            ],
            [
                22765,
                22850
            ],
            [
                22850,
                22890
            ],
            [
                22890,
                23065
            ],
            [
                23065,
                23204
            ],
            [
                23204,
                23305
            ],
            [
                23305,
                23593
            ],
            [
                23593,
                23758
            ],
            [
                23758,
                23853
            ],
            [
                23853,
                23944
            ],
            [
                23944,
                24080
            ],
            [
                24080,
                24170
            ],
            [
                24170,
                24238
            ],
            [
                24238,
                24364
            ],
            [
                24364,
                24417
            ],
            [
                24417,
                24428
            ],
            [
                24428,
                24443
            ],
            [
                24443,
                24461
            ],
            [
                24461,
                24509
            ],
            [
                24509,
                24546
            ],
            [
                24546,
                24572
            ],
            [
                24572,
                24645
            ],
            [
                24645,
                24758
            ],
            [
                24758,
                24800
            ],
            [
                24800,
                24827
            ],
            [
                24827,
                24849
            ],
            [
                24849,
                24890
            ],
            [
                24890,
                25026
            ],
            [
                25026,
                25224
            ],
            [
                25224,
                25306
            ],
            [
                25306,
                25327
            ],
            [
                25327,
                25380
            ],
            [
                25380,
                25402
            ],
            [
                25402,
                25560
            ],
            [
                25560,
                25654
            ],
            [
                25654,
                25687
            ],
            [
                25687,
                25772
            ],
            [
                25772,
                25993
            ],
            [
                25993,
                26050
            ],
            [
                26050,
                26123
            ],
            [
                26123,
                26184
            ],
            [
                26184,
                26249
            ],
            [
                26249,
                26261
            ],
            [
                26261,
                26328
            ],
            [
                26328,
                26411
            ],
            [
                26411,
                26423
            ],
            [
                26423,
                26505
            ],
            [
                26505,
                26548
            ],
            [
                26548,
                26637
            ],
            [
                26637,
                26696
            ],
            [
                26696,
                26796
            ],
            [
                26796,
                26850
            ],
            [
                26850,
                26926
            ],
            [
                26926,
                27013
            ],
            [
                27013,
                27063
            ],
            [
                27063,
                27284
            ],
            [
                27284,
                27379
            ],
            [
                27379,
                27385
            ],
            [
                27385,
                27411
            ],
            [
                27411,
                27607
            ],
            [
                27607,
                27813
            ],
            [
                27813,
                27901
            ],
            [
                27901,
                28053
            ],
            [
                28053,
                28072
            ],
            [
                28072,
                28159
            ],
            [
                28159,
                28320
            ],
            [
                28320,
                28344
            ],
            [
                28344,
                28371
            ],
            [
                28371,
                28562
            ],
            [
                28562,
                28644
            ],
            [
                28644,
                28661
            ],
            [
                28661,
                28791
            ],
            [
                28791,
                29140
            ],
            [
                29140,
                29177
            ],
            [
                29177,
                29196
            ],
            [
                29196,
                29291
            ],
            [
                29291,
                29639
            ],
            [
                29639,
                29761
            ],
            [
                29761,
                29803
            ],
            [
                29803,
                29834
            ],
            [
                29834,
                30007
            ],
            [
                30007,
                30091
            ],
            [
                30091,
                30221
            ],
            [
                30221,
                30249
            ],
            [
                30249,
                30313
            ],
            [
                30313,
                30673
            ],
            [
                30673,
                30777
            ],
            [
                30777,
                31106
            ],
            [
                31106,
                31123
            ],
            [
                31123,
                31173
            ],
            [
                31173,
                31320
            ],
            [
                31320,
                31499
            ],
            [
                31499,
                31634
            ],
            [
                31634,
                31692
            ],
            [
                31692,
                31707
            ],
            [
                31707,
                31755
            ],
            [
                31755,
                31774
            ],
            [
                31774,
                31781
            ],
            [
                31781,
                31799
            ],
            [
                31799,
                31828
            ],
            [
                31828,
                31867
            ],
            [
                31867,
                31887
            ],
            [
                31887,
                31942
            ],
            [
                31942,
                31995
            ],
            [
                31995,
                32043
            ],
            [
                32043,
                32093
            ],
            [
                32093,
                32130
            ],
            [
                32130,
                32408
            ],
            [
                32408,
                32458
            ],
            [
                32458,
                32480
            ],
            [
                32480,
                32618
            ],
            [
                32618,
                32663
            ],
            [
                32663,
                32683
            ],
            [
                32683,
                32696
            ],
            [
                32696,
                32730
            ],
            [
                32730,
                32883
            ],
            [
                32883,
                33042
            ],
            [
                33042,
                33172
            ],
            [
                33172,
                33209
            ],
            [
                33209,
                33368
            ],
            [
                33368,
                33478
            ],
            [
                33478,
                33672
            ],
            [
                33672,
                33827
            ],
            [
                33827,
                33940
            ],
            [
                33940,
                34123
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                68
            ],
            [
                139,
                150
            ],
            [
                121,
                123
            ],
            [
                106,
                120
            ],
            [
                165,
                166
            ],
            [
                174,
                205
            ],
            [
                205,
                252
            ],
            [
                314,
                341
            ],
            [
                375,
                404
            ],
            [
                420,
                450
            ],
            [
                450,
                482
            ],
            [
                502,
                553
            ],
            [
                567,
                595
            ],
            [
                628,
                629
            ],
            [
                710,
                775
            ],
            [
                789,
                848
            ],
            [
                943,
                945
            ],
            [
                945,
                953
            ],
            [
                953,
                972
            ],
            [
                988,
                990
            ],
            [
                990,
                1044
            ],
            [
                1079,
                1143
            ],
            [
                1151,
                1208
            ],
            [
                1269,
                1271
            ],
            [
                1271,
                1289
            ],
            [
                1289,
                1303
            ],
            [
                1338,
                1342
            ],
            [
                1342,
                1364
            ],
            [
                1436,
                1612
            ],
            [
                1622,
                1694
            ],
            [
                1694,
                1720
            ],
            [
                1720,
                1753
            ],
            [
                1753,
                1774
            ],
            [
                1961,
                1962
            ],
            [
                1968,
                2017
            ],
            [
                2017,
                2018
            ],
            [
                2034,
                2045
            ],
            [
                2058,
                2132
            ],
            [
                2424,
                2487
            ],
            [
                2503,
                2512
            ],
            [
                2512,
                2551
            ],
            [
                2575,
                2576
            ],
            [
                2587,
                2632
            ],
            [
                2632,
                2641
            ],
            [
                2641,
                2648
            ],
            [
                2648,
                2684
            ],
            [
                2684,
                2744
            ],
            [
                2744,
                2756
            ],
            [
                2756,
                2821
            ],
            [
                2867,
                2931
            ],
            [
                3666,
                3710
            ],
            [
                3723,
                3725
            ],
            [
                3737,
                3782
            ],
            [
                3914,
                3918
            ],
            [
                3947,
                3949
            ],
            [
                4242,
                4271
            ],
            [
                4277,
                4361
            ],
            [
                4361,
                4393
            ],
            [
                4412,
                4446
            ],
            [
                4461,
                4523
            ],
            [
                4523,
                4535
            ],
            [
                4550,
                4552
            ],
            [
                4604,
                4608
            ],
            [
                4615,
                4703
            ],
            [
                4752,
                4779
            ],
            [
                4814,
                4859
            ],
            [
                4859,
                4862
            ],
            [
                4870,
                4878
            ],
            [
                5378,
                5389
            ],
            [
                4892,
                4896
            ],
            [
                5040,
                5041
            ],
            [
                4954,
                4955
            ],
            [
                5589,
                5592
            ],
            [
                5598,
                5669
            ],
            [
                4994,
                4997
            ],
            [
                5689,
                5693
            ],
            [
                5361,
                5362
            ],
            [
                5594,
                5597
            ],
            [
                5699,
                5717
            ],
            [
                5729,
                5738
            ],
            [
                5750,
                5801
            ],
            [
                4918,
                4921
            ],
            [
                5870,
                5872
            ],
            [
                5872,
                5898
            ],
            [
                5908,
                5929
            ],
            [
                5952,
                5978
            ],
            [
                5978,
                5995
            ],
            [
                6000,
                6028
            ],
            [
                6099,
                6183
            ],
            [
                6183,
                6265
            ],
            [
                6265,
                6317
            ],
            [
                6357,
                6366
            ],
            [
                6382,
                6384
            ],
            [
                6630,
                6640
            ],
            [
                6730,
                6738
            ],
            [
                6668,
                6709
            ],
            [
                6778,
                6851
            ],
            [
                6853,
                6892
            ],
            [
                6969,
                6992
            ],
            [
                6904,
                6905
            ],
            [
                6940,
                6952
            ],
            [
                6916,
                6917
            ],
            [
                6937,
                6939
            ],
            [
                7100,
                7101
            ],
            [
                7117,
                7119
            ],
            [
                7101,
                7115
            ],
            [
                7126,
                7179
            ],
            [
                7179,
                7216
            ],
            [
                7246,
                7249
            ],
            [
                7249,
                7319
            ],
            [
                7581,
                7609
            ],
            [
                7609,
                7625
            ],
            [
                7656,
                7658
            ],
            [
                7658,
                7685
            ],
            [
                7685,
                7776
            ],
            [
                7776,
                7825
            ],
            [
                7825,
                7832
            ],
            [
                7863,
                7933
            ],
            [
                7933,
                7983
            ],
            [
                7983,
                8023
            ],
            [
                8030,
                8032
            ],
            [
                8032,
                8092
            ],
            [
                8153,
                8155
            ],
            [
                8155,
                8244
            ],
            [
                8280,
                8313
            ],
            [
                8315,
                8372
            ],
            [
                8374,
                8436
            ],
            [
                8448,
                8463
            ],
            [
                8473,
                8483
            ],
            [
                8534,
                8548
            ],
            [
                8555,
                8562
            ],
            [
                8567,
                8620
            ],
            [
                8626,
                8635
            ],
            [
                8647,
                8652
            ],
            [
                8658,
                8674
            ],
            [
                8674,
                8722
            ],
            [
                8722,
                8751
            ],
            [
                8808,
                8985
            ],
            [
                9167,
                9180
            ],
            [
                9180,
                9229
            ],
            [
                9259,
                9282
            ],
            [
                9407,
                9415
            ],
            [
                9421,
                9443
            ],
            [
                9502,
                9504
            ],
            [
                9504,
                9510
            ],
            [
                9511,
                9515
            ],
            [
                9528,
                9558
            ],
            [
                9563,
                9595
            ],
            [
                9644,
                9677
            ],
            [
                9686,
                9688
            ],
            [
                9688,
                9741
            ],
            [
                9743,
                9763
            ],
            [
                9765,
                9802
            ],
            [
                9830,
                9852
            ],
            [
                9852,
                9892
            ],
            [
                9942,
                9959
            ],
            [
                9896,
                9903
            ],
            [
                9959,
                9961
            ],
            [
                9961,
                9964
            ],
            [
                10071,
                10126
            ],
            [
                10126,
                10167
            ],
            [
                10167,
                10225
            ],
            [
                10225,
                10311
            ],
            [
                10311,
                10316
            ],
            [
                10316,
                10428
            ],
            [
                10428,
                10484
            ],
            [
                10484,
                10533
            ],
            [
                10535,
                10552
            ],
            [
                10552,
                10628
            ],
            [
                10628,
                10649
            ],
            [
                10702,
                10704
            ],
            [
                10721,
                10754
            ],
            [
                10754,
                10781
            ],
            [
                10781,
                10828
            ],
            [
                10828,
                10832
            ],
            [
                10850,
                10874
            ],
            [
                10896,
                10911
            ],
            [
                10912,
                10926
            ],
            [
                10926,
                10988
            ],
            [
                10988,
                11009
            ],
            [
                11166,
                11233
            ],
            [
                11233,
                11342
            ],
            [
                11343,
                11374
            ],
            [
                11587,
                11641
            ],
            [
                11705,
                11707
            ],
            [
                11707,
                11740
            ],
            [
                11740,
                11747
            ],
            [
                11755,
                11795
            ],
            [
                11825,
                11852
            ],
            [
                11852,
                11870
            ],
            [
                11896,
                11971
            ],
            [
                11971,
                12012
            ],
            [
                12012,
                12018
            ],
            [
                12018,
                12049
            ],
            [
                12049,
                12060
            ],
            [
                12142,
                12147
            ],
            [
                12069,
                12100
            ],
            [
                12108,
                12129
            ],
            [
                12202,
                12204
            ],
            [
                12204,
                12285
            ],
            [
                12285,
                12287
            ],
            [
                12380,
                12427
            ],
            [
                12427,
                12481
            ],
            [
                12497,
                12526
            ],
            [
                12622,
                12665
            ],
            [
                12721,
                12806
            ],
            [
                12837,
                12845
            ],
            [
                12875,
                12880
            ],
            [
                12889,
                12894
            ],
            [
                12915,
                12920
            ],
            [
                12921,
                12953
            ],
            [
                12963,
                13047
            ],
            [
                13073,
                13075
            ],
            [
                13075,
                13098
            ],
            [
                13098,
                13137
            ],
            [
                13137,
                13156
            ],
            [
                13158,
                13166
            ],
            [
                13231,
                13284
            ],
            [
                13307,
                13322
            ],
            [
                13435,
                13445
            ],
            [
                13326,
                13344
            ],
            [
                13353,
                13366
            ],
            [
                13472,
                13474
            ],
            [
                13474,
                13485
            ],
            [
                13495,
                13581
            ],
            [
                13581,
                13675
            ],
            [
                13675,
                13750
            ],
            [
                13750,
                13761
            ],
            [
                13799,
                13811
            ],
            [
                13843,
                13845
            ],
            [
                13856,
                13867
            ],
            [
                13907,
                13916
            ],
            [
                13937,
                13939
            ],
            [
                13952,
                14044
            ],
            [
                14044,
                14165
            ],
            [
                14200,
                14206
            ],
            [
                14223,
                14235
            ],
            [
                14257,
                14281
            ],
            [
                14307,
                14323
            ],
            [
                14332,
                14341
            ],
            [
                14365,
                14368
            ],
            [
                14398,
                14446
            ],
            [
                14446,
                14500
            ],
            [
                14537,
                14549
            ],
            [
                14658,
                14660
            ],
            [
                14660,
                14690
            ],
            [
                14692,
                14697
            ],
            [
                14711,
                14728
            ],
            [
                14728,
                14757
            ],
            [
                14759,
                14768
            ],
            [
                14770,
                14801
            ],
            [
                14801,
                14828
            ],
            [
                14828,
                14854
            ],
            [
                14884,
                14897
            ],
            [
                14899,
                14916
            ],
            [
                14918,
                14944
            ],
            [
                14958,
                14959
            ],
            [
                14966,
                14974
            ],
            [
                14974,
                15006
            ],
            [
                15006,
                15058
            ],
            [
                15254,
                15271
            ],
            [
                15273,
                15277
            ],
            [
                15323,
                15345
            ],
            [
                15493,
                15494
            ],
            [
                15455,
                15460
            ],
            [
                15498,
                15517
            ],
            [
                15568,
                15592
            ],
            [
                15592,
                15618
            ],
            [
                15620,
                15633
            ],
            [
                15635,
                15654
            ],
            [
                15666,
                15678
            ],
            [
                15678,
                15696
            ],
            [
                15696,
                15776
            ],
            [
                16121,
                16152
            ],
            [
                16152,
                16173
            ],
            [
                16188,
                16197
            ],
            [
                16215,
                16219
            ],
            [
                16274,
                16296
            ],
            [
                16376,
                16378
            ],
            [
                16562,
                16564
            ],
            [
                16550,
                16556
            ],
            [
                16569,
                16587
            ],
            [
                16602,
                16604
            ],
            [
                16619,
                16628
            ],
            [
                16661,
                16739
            ],
            [
                16739,
                16788
            ],
            [
                16825,
                16828
            ],
            [
                16799,
                16821
            ],
            [
                16829,
                16846
            ],
            [
                16846,
                16858
            ],
            [
                16869,
                16905
            ],
            [
                16905,
                16931
            ],
            [
                16974,
                17050
            ],
            [
                17050,
                17055
            ],
            [
                17055,
                17067
            ],
            [
                17118,
                17146
            ],
            [
                17190,
                17276
            ],
            [
                17383,
                17429
            ],
            [
                17429,
                17433
            ],
            [
                17447,
                17474
            ],
            [
                17554,
                17583
            ],
            [
                17652,
                17678
            ],
            [
                17696,
                17697
            ],
            [
                17699,
                17757
            ],
            [
                17757,
                17835
            ],
            [
                17835,
                17850
            ],
            [
                17850,
                17878
            ],
            [
                17878,
                17900
            ],
            [
                17917,
                17956
            ],
            [
                18014,
                18025
            ],
            [
                17960,
                17978
            ],
            [
                18025,
                18028
            ],
            [
                18028,
                18106
            ],
            [
                18106,
                18127
            ],
            [
                18127,
                18143
            ],
            [
                18280,
                18305
            ],
            [
                18355,
                18396
            ],
            [
                18491,
                18498
            ],
            [
                18503,
                18541
            ],
            [
                18586,
                18650
            ],
            [
                18650,
                18685
            ],
            [
                18718,
                18745
            ],
            [
                18745,
                18821
            ],
            [
                18828,
                18925
            ],
            [
                18929,
                18945
            ],
            [
                18955,
                18974
            ],
            [
                18982,
                18984
            ],
            [
                19123,
                19131
            ],
            [
                19131,
                19147
            ],
            [
                19168,
                19170
            ],
            [
                19170,
                19183
            ],
            [
                19228,
                19233
            ],
            [
                19294,
                19345
            ],
            [
                19345,
                19391
            ],
            [
                19430,
                19454
            ],
            [
                19487,
                19489
            ],
            [
                19515,
                19598
            ],
            [
                19598,
                19648
            ],
            [
                19660,
                19677
            ],
            [
                19783,
                19824
            ],
            [
                19824,
                19881
            ],
            [
                19936,
                19994
            ],
            [
                20005,
                20086
            ],
            [
                20117,
                20155
            ],
            [
                20155,
                20219
            ],
            [
                20226,
                20229
            ],
            [
                20229,
                20264
            ],
            [
                20264,
                20266
            ],
            [
                20284,
                20291
            ],
            [
                20296,
                20321
            ],
            [
                20321,
                20332
            ],
            [
                20332,
                20344
            ],
            [
                20344,
                20372
            ],
            [
                20374,
                20400
            ],
            [
                20437,
                20487
            ],
            [
                20530,
                20532
            ],
            [
                20532,
                20540
            ],
            [
                20540,
                20566
            ],
            [
                20566,
                20567
            ],
            [
                20613,
                20648
            ],
            [
                20688,
                20773
            ],
            [
                20773,
                20812
            ],
            [
                20849,
                20907
            ],
            [
                21222,
                21259
            ],
            [
                21366,
                21395
            ],
            [
                21395,
                21411
            ],
            [
                21527,
                21530
            ],
            [
                21530,
                21543
            ],
            [
                21604,
                21659
            ],
            [
                21659,
                21698
            ],
            [
                21698,
                21714
            ],
            [
                21714,
                21732
            ],
            [
                21732,
                21749
            ],
            [
                21749,
                21767
            ],
            [
                21767,
                21812
            ],
            [
                21874,
                21893
            ],
            [
                21893,
                21914
            ],
            [
                21914,
                21972
            ],
            [
                22031,
                22034
            ],
            [
                22014,
                22029
            ],
            [
                22191,
                22223
            ],
            [
                22223,
                22254
            ],
            [
                22254,
                22268
            ],
            [
                22268,
                22270
            ],
            [
                22283,
                22334
            ],
            [
                22352,
                22363
            ],
            [
                22339,
                22348
            ],
            [
                22412,
                22422
            ],
            [
                22430,
                22437
            ],
            [
                22441,
                22509
            ],
            [
                22509,
                22539
            ],
            [
                22547,
                22578
            ],
            [
                22578,
                22638
            ],
            [
                22672,
                22685
            ],
            [
                22719,
                22765
            ],
            [
                22765,
                22793
            ],
            [
                22823,
                22850
            ],
            [
                22850,
                22890
            ],
            [
                22890,
                22900
            ],
            [
                22953,
                22987
            ],
            [
                23012,
                23043
            ],
            [
                23045,
                23065
            ],
            [
                23129,
                23204
            ],
            [
                23204,
                23284
            ],
            [
                23303,
                23305
            ],
            [
                23305,
                23381
            ],
            [
                23386,
                23395
            ],
            [
                23515,
                23593
            ],
            [
                23593,
                23620
            ],
            [
                23641,
                23649
            ],
            [
                23625,
                23637
            ],
            [
                23657,
                23706
            ],
            [
                23721,
                23758
            ],
            [
                23758,
                23853
            ],
            [
                23853,
                23888
            ],
            [
                23896,
                23944
            ],
            [
                23992,
                24059
            ],
            [
                24078,
                24080
            ],
            [
                24080,
                24170
            ],
            [
                24170,
                24238
            ],
            [
                24299,
                24325
            ],
            [
                24291,
                24292
            ],
            [
                24364,
                24417
            ],
            [
                24417,
                24428
            ],
            [
                24428,
                24443
            ],
            [
                24461,
                24509
            ],
            [
                24509,
                24546
            ],
            [
                24546,
                24572
            ],
            [
                24572,
                24645
            ],
            [
                24645,
                24699
            ],
            [
                24756,
                24758
            ],
            [
                24758,
                24800
            ],
            [
                24800,
                24827
            ],
            [
                24827,
                24849
            ],
            [
                24849,
                24872
            ],
            [
                24879,
                24890
            ],
            [
                24890,
                24965
            ],
            [
                25024,
                25026
            ],
            [
                25026,
                25046
            ],
            [
                25047,
                25055
            ],
            [
                25139,
                25213
            ],
            [
                25222,
                25224
            ],
            [
                25224,
                25261
            ],
            [
                25304,
                25306
            ],
            [
                25306,
                25327
            ],
            [
                25380,
                25402
            ],
            [
                25402,
                25436
            ],
            [
                25474,
                25489
            ],
            [
                25496,
                25504
            ],
            [
                25440,
                25443
            ],
            [
                25512,
                25560
            ],
            [
                25560,
                25589
            ],
            [
                25615,
                25654
            ],
            [
                25654,
                25658
            ],
            [
                25667,
                25687
            ],
            [
                25687,
                25772
            ],
            [
                25772,
                25780
            ],
            [
                25954,
                25959
            ],
            [
                25804,
                25807
            ],
            [
                25920,
                25926
            ],
            [
                25991,
                25993
            ],
            [
                25993,
                26050
            ],
            [
                26050,
                26121
            ],
            [
                26184,
                26249
            ],
            [
                26249,
                26261
            ],
            [
                26261,
                26279
            ],
            [
                26306,
                26328
            ],
            [
                26328,
                26411
            ],
            [
                26411,
                26423
            ],
            [
                26423,
                26458
            ],
            [
                26468,
                26487
            ],
            [
                26637,
                26657
            ],
            [
                26676,
                26696
            ],
            [
                26696,
                26741
            ],
            [
                26743,
                26794
            ],
            [
                26825,
                26828
            ],
            [
                26796,
                26797
            ],
            [
                26829,
                26850
            ],
            [
                26850,
                26900
            ],
            [
                26924,
                26926
            ],
            [
                27013,
                27063
            ],
            [
                27063,
                27065
            ],
            [
                27093,
                27147
            ],
            [
                27235,
                27284
            ],
            [
                27284,
                27350
            ],
            [
                27362,
                27375
            ],
            [
                27377,
                27379
            ],
            [
                27379,
                27385
            ],
            [
                27385,
                27410
            ],
            [
                27607,
                27673
            ],
            [
                27722,
                27723
            ],
            [
                27740,
                27813
            ],
            [
                27813,
                27897
            ],
            [
                27901,
                27950
            ],
            [
                27957,
                27972
            ],
            [
                28050,
                28053
            ],
            [
                28072,
                28113
            ],
            [
                28123,
                28129
            ],
            [
                28157,
                28159
            ],
            [
                28163,
                28214
            ],
            [
                28242,
                28249
            ],
            [
                28282,
                28297
            ],
            [
                28304,
                28320
            ],
            [
                28320,
                28344
            ],
            [
                28344,
                28371
            ],
            [
                28371,
                28432
            ],
            [
                28500,
                28562
            ],
            [
                28562,
                28618
            ],
            [
                28642,
                28644
            ],
            [
                28644,
                28661
            ],
            [
                28661,
                28668
            ],
            [
                28679,
                28696
            ],
            [
                28669,
                28679
            ],
            [
                28697,
                28726
            ],
            [
                28789,
                28791
            ],
            [
                28799,
                28802
            ],
            [
                28834,
                28836
            ],
            [
                28803,
                28827
            ],
            [
                28851,
                28906
            ],
            [
                28917,
                28924
            ],
            [
                28931,
                29006
            ],
            [
                29018,
                29070
            ],
            [
                29076,
                29080
            ],
            [
                29081,
                29086
            ],
            [
                29096,
                29105
            ],
            [
                29138,
                29140
            ],
            [
                29177,
                29196
            ],
            [
                29196,
                29207
            ],
            [
                29242,
                29291
            ],
            [
                29291,
                29384
            ],
            [
                29392,
                29471
            ],
            [
                29637,
                29639
            ],
            [
                29639,
                29714
            ],
            [
                29738,
                29761
            ],
            [
                29761,
                29803
            ],
            [
                29803,
                29834
            ],
            [
                29957,
                29970
            ],
            [
                29979,
                30005
            ],
            [
                30010,
                30051
            ],
            [
                29947,
                29951
            ],
            [
                30064,
                30091
            ],
            [
                30099,
                30101
            ],
            [
                30140,
                30187
            ],
            [
                30208,
                30221
            ],
            [
                30221,
                30239
            ],
            [
                30246,
                30249
            ],
            [
                30249,
                30270
            ],
            [
                30278,
                30293
            ],
            [
                30304,
                30313
            ],
            [
                30417,
                30443
            ],
            [
                30389,
                30395
            ],
            [
                30320,
                30335
            ],
            [
                30411,
                30412
            ],
            [
                30543,
                30546
            ],
            [
                30469,
                30503
            ],
            [
                30671,
                30673
            ],
            [
                30723,
                30733
            ],
            [
                30738,
                30777
            ],
            [
                30777,
                30811
            ],
            [
                30821,
                30880
            ],
            [
                30909,
                30913
            ],
            [
                30936,
                30997
            ],
            [
                31027,
                31044
            ],
            [
                31085,
                31106
            ],
            [
                31123,
                31133
            ],
            [
                31150,
                31173
            ],
            [
                31173,
                31203
            ],
            [
                31218,
                31283
            ],
            [
                31323,
                31340
            ],
            [
                31411,
                31426
            ],
            [
                31444,
                31450
            ],
            [
                31497,
                31499
            ],
            [
                31499,
                31541
            ],
            [
                31576,
                31596
            ],
            [
                31601,
                31634
            ],
            [
                31634,
                31643
            ],
            [
                31657,
                31692
            ],
            [
                31692,
                31707
            ],
            [
                31707,
                31755
            ],
            [
                31755,
                31774
            ],
            [
                31774,
                31781
            ],
            [
                31799,
                31825
            ],
            [
                31785,
                31797
            ],
            [
                31825,
                31828
            ],
            [
                31887,
                31888
            ],
            [
                31896,
                31928
            ],
            [
                31934,
                31942
            ],
            [
                32130,
                32175
            ],
            [
                32178,
                32179
            ],
            [
                32188,
                32191
            ],
            [
                32192,
                32207
            ],
            [
                32374,
                32378
            ],
            [
                32231,
                32258
            ],
            [
                32342,
                32359
            ],
            [
                32405,
                32408
            ],
            [
                32408,
                32456
            ],
            [
                32458,
                32464
            ],
            [
                32472,
                32480
            ],
            [
                32480,
                32488
            ],
            [
                32500,
                32521
            ],
            [
                32531,
                32618
            ],
            [
                32618,
                32663
            ],
            [
                32663,
                32683
            ],
            [
                32683,
                32696
            ],
            [
                32696,
                32730
            ],
            [
                32947,
                32955
            ],
            [
                32897,
                32899
            ],
            [
                32765,
                32768
            ],
            [
                32959,
                33022
            ],
            [
                32828,
                32831
            ],
            [
                33040,
                33042
            ],
            [
                33042,
                33075
            ],
            [
                33131,
                33141
            ],
            [
                33102,
                33110
            ],
            [
                33172,
                33199
            ],
            [
                33207,
                33209
            ],
            [
                33209,
                33368
            ],
            [
                33368,
                33380
            ],
            [
                33436,
                33447
            ],
            [
                33476,
                33478
            ],
            [
                33478,
                33534
            ],
            [
                33548,
                33561
            ],
            [
                33540,
                33544
            ],
            [
                33562,
                33579
            ],
            [
                33585,
                33593
            ],
            [
                33598,
                33605
            ],
            [
                33621,
                33672
            ],
            [
                33672,
                33681
            ],
            [
                33704,
                33779
            ],
            [
                33781,
                33824
            ],
            [
                33940,
                33950
            ],
            [
                33971,
                33985
            ],
            [
                34028,
                34031
            ],
            [
                33995,
                34020
            ],
            [
                33985,
                33986
            ],
            [
                34032,
                34065
            ],
            [
                34075,
                34116
            ],
            [
                34122,
                34123
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                75
            ],
            [
                75,
                106
            ],
            [
                106,
                205
            ],
            [
                205,
                450
            ],
            [
                450,
                630
            ],
            [
                630,
                650
            ],
            [
                650,
                710
            ],
            [
                710,
                945
            ],
            [
                945,
                953
            ],
            [
                953,
                990
            ],
            [
                990,
                1143
            ],
            [
                1143,
                1271
            ],
            [
                1271,
                1289
            ],
            [
                1289,
                1306
            ],
            [
                1306,
                1335
            ],
            [
                1335,
                1342
            ],
            [
                1342,
                1694
            ],
            [
                1694,
                1720
            ],
            [
                1720,
                1753
            ],
            [
                1753,
                1774
            ],
            [
                1774,
                1781
            ],
            [
                1781,
                1961
            ],
            [
                1961,
                2017
            ],
            [
                2017,
                2135
            ],
            [
                2135,
                2318
            ],
            [
                2318,
                2423
            ],
            [
                2423,
                2512
            ],
            [
                2512,
                2553
            ],
            [
                2553,
                2575
            ],
            [
                2575,
                2632
            ],
            [
                2632,
                2641
            ],
            [
                2641,
                2648
            ],
            [
                2648,
                2684
            ],
            [
                2684,
                2744
            ],
            [
                2744,
                2756
            ],
            [
                2756,
                2931
            ],
            [
                2931,
                3258
            ],
            [
                3258,
                3317
            ],
            [
                3317,
                3403
            ],
            [
                3403,
                3433
            ],
            [
                3433,
                3450
            ],
            [
                3450,
                3472
            ],
            [
                3472,
                3510
            ],
            [
                3510,
                3610
            ],
            [
                3610,
                3626
            ],
            [
                3626,
                3637
            ],
            [
                3637,
                3666
            ],
            [
                3666,
                3725
            ],
            [
                3725,
                3784
            ],
            [
                3784,
                3914
            ],
            [
                3914,
                4361
            ],
            [
                4361,
                4448
            ],
            [
                4448,
                4461
            ],
            [
                4461,
                4523
            ],
            [
                4523,
                4859
            ],
            [
                4859,
                5872
            ],
            [
                5872,
                5978
            ],
            [
                5978,
                6183
            ],
            [
                6183,
                6265
            ],
            [
                6265,
                6384
            ],
            [
                6384,
                6630
            ],
            [
                6630,
                6778
            ],
            [
                6778,
                7179
            ],
            [
                7179,
                7249
            ],
            [
                7249,
                7319
            ],
            [
                7319,
                7485
            ],
            [
                7485,
                7577
            ],
            [
                7577,
                7609
            ],
            [
                7609,
                7658
            ],
            [
                7658,
                7685
            ],
            [
                7685,
                7776
            ],
            [
                7776,
                7825
            ],
            [
                7825,
                7835
            ],
            [
                7835,
                7862
            ],
            [
                7862,
                7933
            ],
            [
                7933,
                7983
            ],
            [
                7983,
                8032
            ],
            [
                8032,
                8155
            ],
            [
                8155,
                8436
            ],
            [
                8436,
                8465
            ],
            [
                8465,
                8473
            ],
            [
                8473,
                8674
            ],
            [
                8674,
                8722
            ],
            [
                8722,
                8751
            ],
            [
                8751,
                8808
            ],
            [
                8808,
                8985
            ],
            [
                8985,
                9040
            ],
            [
                9040,
                9167
            ],
            [
                9167,
                9180
            ],
            [
                9180,
                9282
            ],
            [
                9282,
                9504
            ],
            [
                9504,
                9688
            ],
            [
                9688,
                9802
            ],
            [
                9802,
                9852
            ],
            [
                9852,
                9961
            ],
            [
                9961,
                10126
            ],
            [
                10126,
                10167
            ],
            [
                10167,
                10225
            ],
            [
                10225,
                10311
            ],
            [
                10311,
                10316
            ],
            [
                10316,
                10428
            ],
            [
                10428,
                10484
            ],
            [
                10484,
                10552
            ],
            [
                10552,
                10628
            ],
            [
                10628,
                10704
            ],
            [
                10704,
                10721
            ],
            [
                10721,
                10754
            ],
            [
                10754,
                10781
            ],
            [
                10781,
                10828
            ],
            [
                10828,
                10926
            ],
            [
                10926,
                10988
            ],
            [
                10988,
                11011
            ],
            [
                11011,
                11166
            ],
            [
                11166,
                11233
            ],
            [
                11233,
                11377
            ],
            [
                11377,
                11401
            ],
            [
                11401,
                11450
            ],
            [
                11450,
                11469
            ],
            [
                11469,
                11479
            ],
            [
                11479,
                11572
            ],
            [
                11572,
                11707
            ],
            [
                11707,
                11740
            ],
            [
                11740,
                11852
            ],
            [
                11852,
                11971
            ],
            [
                11971,
                12012
            ],
            [
                12012,
                12018
            ],
            [
                12018,
                12049
            ],
            [
                12049,
                12204
            ],
            [
                12204,
                12287
            ],
            [
                12287,
                12380
            ],
            [
                12380,
                12427
            ],
            [
                12427,
                12526
            ],
            [
                12526,
                12557
            ],
            [
                12557,
                12574
            ],
            [
                12574,
                12806
            ],
            [
                12806,
                13075
            ],
            [
                13075,
                13098
            ],
            [
                13098,
                13137
            ],
            [
                13137,
                13156
            ],
            [
                13156,
                13474
            ],
            [
                13474,
                13581
            ],
            [
                13581,
                13675
            ],
            [
                13675,
                13750
            ],
            [
                13750,
                13845
            ],
            [
                13845,
                14044
            ],
            [
                14044,
                14235
            ],
            [
                14235,
                14446
            ],
            [
                14446,
                14660
            ],
            [
                14660,
                14728
            ],
            [
                14728,
                14801
            ],
            [
                14801,
                14828
            ],
            [
                14828,
                14944
            ],
            [
                14944,
                14958
            ],
            [
                14958,
                14974
            ],
            [
                14974,
                15006
            ],
            [
                15006,
                15058
            ],
            [
                15058,
                15069
            ],
            [
                15069,
                15086
            ],
            [
                15086,
                15107
            ],
            [
                15107,
                15151
            ],
            [
                15151,
                15209
            ],
            [
                15209,
                15213
            ],
            [
                15213,
                15222
            ],
            [
                15222,
                15301
            ],
            [
                15301,
                15323
            ],
            [
                15323,
                15345
            ],
            [
                15345,
                15455
            ],
            [
                15455,
                15592
            ],
            [
                15592,
                15678
            ],
            [
                15678,
                15696
            ],
            [
                15696,
                15776
            ],
            [
                15776,
                15793
            ],
            [
                15793,
                15895
            ],
            [
                15895,
                16003
            ],
            [
                16003,
                16037
            ],
            [
                16037,
                16069
            ],
            [
                16069,
                16152
            ],
            [
                16152,
                16378
            ],
            [
                16378,
                16535
            ],
            [
                16535,
                16739
            ],
            [
                16739,
                16846
            ],
            [
                16846,
                16858
            ],
            [
                16858,
                16869
            ],
            [
                16869,
                16905
            ],
            [
                16905,
                17050
            ],
            [
                17050,
                17055
            ],
            [
                17055,
                17067
            ],
            [
                17067,
                17076
            ],
            [
                17076,
                17117
            ],
            [
                17117,
                17148
            ],
            [
                17148,
                17170
            ],
            [
                17170,
                17190
            ],
            [
                17190,
                17277
            ],
            [
                17277,
                17383
            ],
            [
                17383,
                17429
            ],
            [
                17429,
                17593
            ],
            [
                17593,
                17606
            ],
            [
                17606,
                17627
            ],
            [
                17627,
                17651
            ],
            [
                17651,
                17757
            ],
            [
                17757,
                17835
            ],
            [
                17835,
                17850
            ],
            [
                17850,
                17878
            ],
            [
                17878,
                17900
            ],
            [
                17900,
                17911
            ],
            [
                17911,
                18028
            ],
            [
                18028,
                18106
            ],
            [
                18106,
                18127
            ],
            [
                18127,
                18144
            ],
            [
                18144,
                18170
            ],
            [
                18170,
                18194
            ],
            [
                18194,
                18209
            ],
            [
                18209,
                18257
            ],
            [
                18257,
                18263
            ],
            [
                18263,
                18650
            ],
            [
                18650,
                18745
            ],
            [
                18745,
                18929
            ],
            [
                18929,
                18984
            ],
            [
                18984,
                19042
            ],
            [
                19042,
                19100
            ],
            [
                19100,
                19123
            ],
            [
                19123,
                19131
            ],
            [
                19131,
                19170
            ],
            [
                19170,
                19183
            ],
            [
                19183,
                19233
            ],
            [
                19233,
                19262
            ],
            [
                19262,
                19294
            ],
            [
                19294,
                19345
            ],
            [
                19345,
                19489
            ],
            [
                19489,
                19515
            ],
            [
                19515,
                19598
            ],
            [
                19598,
                19824
            ],
            [
                19824,
                20086
            ],
            [
                20086,
                20117
            ],
            [
                20117,
                20155
            ],
            [
                20155,
                20229
            ],
            [
                20229,
                20264
            ],
            [
                20264,
                20321
            ],
            [
                20321,
                20332
            ],
            [
                20332,
                20344
            ],
            [
                20344,
                20532
            ],
            [
                20532,
                20540
            ],
            [
                20540,
                20566
            ],
            [
                20566,
                20648
            ],
            [
                20648,
                20688
            ],
            [
                20688,
                20773
            ],
            [
                20773,
                20907
            ],
            [
                20907,
                20983
            ],
            [
                20983,
                20988
            ],
            [
                20988,
                21174
            ],
            [
                21174,
                21222
            ],
            [
                21222,
                21395
            ],
            [
                21395,
                21530
            ],
            [
                21530,
                21659
            ],
            [
                21659,
                21698
            ],
            [
                21698,
                21714
            ],
            [
                21714,
                21732
            ],
            [
                21732,
                21749
            ],
            [
                21749,
                21767
            ],
            [
                21767,
                21813
            ],
            [
                21813,
                21874
            ],
            [
                21874,
                21893
            ],
            [
                21893,
                21914
            ],
            [
                21914,
                21972
            ],
            [
                21972,
                21978
            ],
            [
                21978,
                22014
            ],
            [
                22014,
                22121
            ],
            [
                22121,
                22169
            ],
            [
                22169,
                22223
            ],
            [
                22223,
                22254
            ],
            [
                22254,
                22268
            ],
            [
                22268,
                22509
            ],
            [
                22509,
                22578
            ],
            [
                22578,
                22765
            ],
            [
                22765,
                22850
            ],
            [
                22850,
                22890
            ],
            [
                22890,
                23065
            ],
            [
                23065,
                23204
            ],
            [
                23204,
                23305
            ],
            [
                23305,
                23593
            ],
            [
                23593,
                23758
            ],
            [
                23758,
                23853
            ],
            [
                23853,
                23944
            ],
            [
                23944,
                24080
            ],
            [
                24080,
                24170
            ],
            [
                24170,
                24238
            ],
            [
                24238,
                24417
            ],
            [
                24417,
                24428
            ],
            [
                24428,
                24443
            ],
            [
                24443,
                24461
            ],
            [
                24461,
                24509
            ],
            [
                24509,
                24546
            ],
            [
                24546,
                24572
            ],
            [
                24572,
                24645
            ],
            [
                24645,
                24758
            ],
            [
                24758,
                24800
            ],
            [
                24800,
                24827
            ],
            [
                24827,
                24849
            ],
            [
                24849,
                24890
            ],
            [
                24890,
                25026
            ],
            [
                25026,
                25224
            ],
            [
                25224,
                25306
            ],
            [
                25306,
                25327
            ],
            [
                25327,
                25380
            ],
            [
                25380,
                25402
            ],
            [
                25402,
                25560
            ],
            [
                25560,
                25654
            ],
            [
                25654,
                25687
            ],
            [
                25687,
                25772
            ],
            [
                25772,
                25993
            ],
            [
                25993,
                26050
            ],
            [
                26050,
                26123
            ],
            [
                26123,
                26184
            ],
            [
                26184,
                26249
            ],
            [
                26249,
                26261
            ],
            [
                26261,
                26328
            ],
            [
                26328,
                26411
            ],
            [
                26411,
                26423
            ],
            [
                26423,
                26505
            ],
            [
                26505,
                26548
            ],
            [
                26548,
                26637
            ],
            [
                26637,
                26696
            ],
            [
                26696,
                26850
            ],
            [
                26850,
                26926
            ],
            [
                26926,
                27013
            ],
            [
                27013,
                27063
            ],
            [
                27063,
                27284
            ],
            [
                27284,
                27379
            ],
            [
                27379,
                27385
            ],
            [
                27385,
                27411
            ],
            [
                27411,
                27607
            ],
            [
                27607,
                27813
            ],
            [
                27813,
                27901
            ],
            [
                27901,
                28053
            ],
            [
                28053,
                28072
            ],
            [
                28072,
                28159
            ],
            [
                28159,
                28320
            ],
            [
                28320,
                28344
            ],
            [
                28344,
                28371
            ],
            [
                28371,
                28562
            ],
            [
                28562,
                28644
            ],
            [
                28644,
                28661
            ],
            [
                28661,
                28791
            ],
            [
                28791,
                29140
            ],
            [
                29140,
                29177
            ],
            [
                29177,
                29196
            ],
            [
                29196,
                29291
            ],
            [
                29291,
                29639
            ],
            [
                29639,
                29761
            ],
            [
                29761,
                29803
            ],
            [
                29803,
                29834
            ],
            [
                29834,
                30091
            ],
            [
                30091,
                30221
            ],
            [
                30221,
                30249
            ],
            [
                30249,
                30313
            ],
            [
                30313,
                30673
            ],
            [
                30673,
                30777
            ],
            [
                30777,
                31106
            ],
            [
                31106,
                31123
            ],
            [
                31123,
                31173
            ],
            [
                31173,
                31499
            ],
            [
                31499,
                31634
            ],
            [
                31634,
                31692
            ],
            [
                31692,
                31707
            ],
            [
                31707,
                31755
            ],
            [
                31755,
                31774
            ],
            [
                31774,
                31781
            ],
            [
                31781,
                31828
            ],
            [
                31828,
                31867
            ],
            [
                31867,
                31887
            ],
            [
                31887,
                31942
            ],
            [
                31942,
                31995
            ],
            [
                31995,
                32043
            ],
            [
                32043,
                32093
            ],
            [
                32093,
                32130
            ],
            [
                32130,
                32408
            ],
            [
                32408,
                32480
            ],
            [
                32480,
                32618
            ],
            [
                32618,
                32663
            ],
            [
                32663,
                32683
            ],
            [
                32683,
                32696
            ],
            [
                32696,
                32730
            ],
            [
                32730,
                33042
            ],
            [
                33042,
                33209
            ],
            [
                33209,
                33368
            ],
            [
                33368,
                33478
            ],
            [
                33478,
                33672
            ],
            [
                33672,
                33827
            ],
            [
                33827,
                33940
            ],
            [
                33940,
                34123
            ]
        ]
    },
    "abridged": {
        "text": "\"Now, what,\" says Mr. George, \"may this be? Is it blank cartridge or bullet?\"\nThe trooper is holding an open letter, which seems to perplex him mightily. He looks at it at arm's length, brings it close, reads it with his head on one side, contracts his eyebrows, and still cannot satisfy himself. He smooths it out upon the table, and thoughtfully walking up and down the gallery, halts before it every now and then.\nPhil Squod, with the aid of a brush and paint-pot, is employed in whitening the targets, softly whistling in quick-march time.\n\"Phil!\" The trooper beckons.\nPhil approaches in his usual way, sidling off at first and then bearing down upon his commander like a bayonet-charge. Splashes of white show in high relief upon his dirty face.\n\"Attention, Phil! Listen to this. 'Sir. Allow me to remind you that the bill at two months' date drawn on yourself by Mr. Matthew Bagnet, and by you accepted, for the sum of ninety-seven pounds four shillings and ninepence, will become due tomorrow, when you will please be prepared to take up the same on presentation. Yours, Joshua Smallweed.' What do you make of that, Phil?\"\n\"Mischief, guv'ner.\"\n\"Lookee, Phil,\" says the trooper, sitting on the table. \"I have paid half as much again as this principal in interest and one thing and another. There has always been an understanding that this bill was to be renewed. And it has been renewed no end of times.\"\n\"I think the times is come to a end at last.\"\n\"You do? Humph! I am much of the same mind myself.\"\n\"Joshua Smallweed is him that was brought here in a chair?\"\n\"The same.\"\n\"Guv'ner,\" says Phil with exceeding gravity, \"he's a leech in his actions, a snake in his twistings, and a lobster in his claws.\"\n\"Do you know what would become of the Bagnets if I don't pay up? They would be ruined to pay off my old scores!\"\nPhil is starting to reply when steps are audible in the passage without, and a cheerful voice is heard to wonder whether George is at home. Phil, with a look at his master, says, \"Here's the guv'ner, Mrs. Bagnet!\" and the old girl herself, accompanied by Mr. Bagnet, appears.\nThe old girl is in her usual grey cloak, coarse and much worn but very clean, which is, undoubtedly, the identical garment which made its way home to Europe once in company with Mrs. Bagnet and an umbrella. The faithful umbrella is also present, though Mrs. Bagnet never puts it up, having the greatest reliance on her well-proved cloak and hood. She generally uses the umbrella as a wand to point out joints of meat or bunches of greens in the market. Without her market-basket, a sort of wicker well, she never stirs abroad. Attended by these trusty companions, therefore, Mrs. Bagnet now arrives, fresh-coloured and bright, in George's Shooting Gallery.\n\"Well, George, old fellow,\" says she, \"and how do you do, this sunshiny morning?\"\nGiving him a friendly shake of the hand, Mrs. Bagnet sits down. Mr. Bagnet likewise shakes hands with his old comrade and with Phil,\n\"Now, George,\" said Mrs. Bagnet briskly, \"here we are, Lignum and myself\" - she often speaks of her husband by this old regimental nickname, Lignum Vitae, after that toughest of timbers - \"We've just looked in to make it all correct as usual about that security. Give him the new bill to sign, George.\"\n\"I was coming to you this morning,\" observes the trooper reluctantly.\n\"What's the matter, George?\" asks Mrs. Bagnet. \"You don't look yourself.\"\n\"I am not quite myself,\" returns the trooper; \"I have been a little put out, Mrs. Bagnet.\"\nHer bright quick eye catches the truth directly. \"George! Don't tell me there's anything wrong about that security of Lignum's! Don't do it, George, on account of the children!\"\nThe trooper looks at her with a troubled face.\n\"George,\" says Mrs. Bagnet, using both her arms for emphasis. \"If you have allowed anything wrong to come to that security of Lignum's, and if you have put us in danger of being sold up - and I see sold up in your face, George, as plain as print - you have done a shameful action and have deceived us cruelly. Cruelly, George!\"\nMr. Bagnet puts his large hand on top of his bald head as if to defend it from a shower and looks uneasily at Mrs. Bagnet.\n\"George,\" says that old girl, \"I wonder at you! George, I am ashamed of you! I always knew you to be a rolling stone that gathered no moss, but I never thought you would have taken away what little moss there was for Bagnet and the children to lie upon. Oh, George!\" Mrs. Bagnet gathers up her cloak to wipe her eyes. \"How could you do it?\"\nMr. George has turned quite white.\n\"Mat,\" he says in a subdued voice, addressing Mr. Bagnet but still looking at his wife, \"I do hope it's not so bad as that. I certainly have, this morning, received this letter\" - which he reads aloud - \"but I hope it may be set right yet. What you say is true. I am a rolling stone, and I never rolled the least good to anybody. But I trust you'll look upon me as forgivingly as you can. Don't think I've kept anything from you. I haven't had the letter more than a quarter of an hour.\"\n\"Old girl,\" murmurs Mr. Bagnet after a short silence, \"will you tell him my opinion?\"\n\"Oh! Why didn't he marry,\" Mrs. Bagnet answers, half laughing and half crying, \"Joe Pouch's widder in North America? Then he wouldn't have got himself into these troubles.\"\n\"The old girl,\" says Mr. Bagnet, \"puts it correct - why didn't you?\"\n\"Well, she has a better husband by this time, I hope,\" returns the trooper. \"Anyhow, here I stand. You see all I have got about me. It's not mine; it's yours. Give the word, and I'll sell off every morsel. If I thought it would have brought in enough, I'd have sold it all long ago. Don't believe that I'll leave you or yours in the lurch, Mat. I'd sell myself first.\"\n\"Old girl,\" murmurs Mr. Bagnet, \"give him another bit of my mind.\"\n\"George,\" says the old girl, \"you are not so much to be blamed, on full consideration, except for ever taking on this business without the means. You never ought to have asked for the security, George. But what's done can't be undone. You are an honourable and straightforward fellow, though a little flighty. On the other hand, it's natural in us to be anxious with such a thing hanging over our heads. So forget and forgive all round, George. Come! Forget and forgive all round!\"\nMrs. Bagnet gives him one of her honest hands and gives her husband the other.\n\"I do assure you both, there's nothing I wouldn't do to discharge this obligation,\" says George. \"We have lived plainly enough here, Phil and I. But the gallery don't quite do what was expected of it - in short, it's not the mint. I thought it might steady me, and set me up, and upon my soul, I am very much obliged to you, and very much ashamed of myself.\" Mr. George shakes both their hands, and then backs up a pace or two in a broad-chested attitude, as if he had made a final confession and were immediately going to be shot.\n\"George, hear me out!\" says Mr. Bagnet, glancing at his wife. \"Old girl, go on!\"\nMrs. Bagnet observes that the letter must be attended to without any delay; that George and Mr. Bagnet should immediately visit Mr. Smallweed. Mr. George, assenting, puts on his hat and prepares to march with Mr. Bagnet to the enemy's camp.\n\"Don't you mind a woman's hasty word, George,\" says Mrs. Bagnet, patting him on the shoulder. \"I trust my old Lignum to you, and I am sure you'll bring him through it.\"\nThe trooper responds that he will. Mrs. Bagnet goes home to her family, and the comrades sally forth on the hopeful errand of mollifying Mr. Smallweed.\nWhether there are two people in England less likely to come satisfactorily out of any negotiation with Mr. Smallweed than this pair may be questioned. Despite their martial appearance and heavy tread, there are not two simpler children in all the Smallweedy affairs of life. As they proceed with great gravity through the streets, Mr. Bagnet speaks.\n\"George, you know the old girl - she's as mild as milk. But touch her on the children or myself - and she's off like gunpowder.\"\n\"It does her credit, Mat!\"\n\"George,\" says Mr. Bagnet, \"the old girl - can't do anything - that don't do her credit. Not that I ever say so. Discipline must be maintained.\"\n\"She's worth her weight in gold,\" says the trooper.\n\"Far more precious - than that!\"\n\"You are right, Mat!\"\n\"She's true to her colours - and stands to her arms. If the old girl fires wide - once in a way - at the call of duty - overlook it, George. For she's loyal!\"\n\"Why, bless her, Mat,\" returns the trooper, \"I think the higher of her for it!\"\nThey arrive at Grandfather Smallweed's house. The door is opened by Judy, who surveys them with a malignant sneer. Once she lets them in, they find Mr. Smallweed in his chair and Mrs. Smallweed obscured with the cushion like a bird that is not to sing.\n\"My dear friend,\" says Grandfather Smallweed with his lean affectionate arms stretched forth. \"How de do? Who is our friend, my dear friend?\"\n\"Why this,\" returns George, \"is Matthew Bagnet, who has obliged me in that matter of ours, you know.\"\n\"Oh! Mr. Bagnet? Hope you're well, Mr. Bagnet!\"\nNo chairs being offered, Mr. George brings one forward for Bagnet and one for himself.\n\"Judy,\" says Mr. Smallweed, \"bring the pipe.\"\n\"Why,\" Mr. George interposes, \"I am not inclined to smoke it today. The fact is, Mr. Smallweed, that I find myself in rather an unpleasant state of mind. It appears to me, sir, that your friend in the city has been playing tricks.\"\n\"Oh, dear no!\" says Grandfather Smallweed. \"He never does that!\"\n\"I am glad to hear it, because I thought this letter might be his doing.\"\nGrandfather Smallweed smiles in a very ugly way in recognition of the letter.\n\"What does it mean?\" asks Mr. George. \"You know, Mr. Smallweed,\" speaking as smoothly and confidentially as he can, \"a good deal of money has passed between us, and we are both well aware of the understanding there has always been. I am prepared to do the usual thing to keep this matter going. I never got a letter like this from you before, and I have been a little put out by it this morning, because here's my friend Matthew Bagnet, who, you know, had none of the money-\"\n\"I don't know it,\" says the old man.\n\"Well!\" says the trooper. \"I know it.\"\n\"Ah! Mr. Bagnet's situation is all one, whether or no.\"\nThe unfortunate George makes a great effort to propitiate Mr. Smallweed.\n\"As you say, Mr. Smallweed, here's Matthew Bagnet liable to be fixed whether or no. Now, you see, that makes his good lady very uneasy, and me too, for he's a steady family man, don't you see? Now, Mr. Smallweed,\" says the trooper, gaining confidence, \"although you and I are good friends enough in a certain way, I am well aware that I can't ask you to let my friend Bagnet off entirely.\"\n\"You can ask me anything, Mr. George.\" (There is an ogreish kind of jocularity in Grandfather Smallweed today.)\n\"And you can refuse, you mean, eh? Or perhaps your friend in the city? Ha ha ha!\"\n\"Ha ha ha!\" echoes Grandfather Smallweed, in such a very hard manner that Mr. Bagnet's natural gravity is much deepened.\n\"Come!\" says the sanguine George. \"I want to arrange this pleasantly. We'll settle the matter on the spot, if you please, Mr. Smallweed, in the usual way. And you'll ease my friend Bagnet's mind if you'll just mention to him what our understanding is.\"\n\"But I think you asked me, Mr. George, what did the letter mean?\"\n\"Why, yes, I did.\"\nMr. Smallweed throws the pipe on the ground and breaks it to pieces.\n\"That's what it means, my dear friend. I'll smash you. I'll crumble you. I'll powder you. Go to the devil!\"\nThe two friends rise and look at one another.\n\"Go to the devil!\" repeats the old man. \"I'll have no more of your pipe-smokings and swaggerings. You can go to my lawyer. Judy; put these blusterers out! Call in help if they don't go. Put 'em out!\"\nHe shouts this so loudly that Mr. Bagnet, laying his hands on his comrade's shoulders, gets him outside the street door, which is instantly slammed by the triumphant Judy. Utterly confounded, Mr. George stands looking at the knocker. Mr. Bagnet, in a perfect abyss of gravity, walks up and down like a sentry, apparently revolving something in his mind.\n\"Come, Mat,\" says Mr. George, \"we must try the lawyer. Now, what do you think of this rascal?\"\nMr. Bagnet replies with one shake of his head, \"If my old girl had been here - I'd have told him!\" Then he falls into step and marches off with the trooper, shoulder to shoulder.\nWhen they present themselves in Lincoln's Inn Fields, Mr. Tulkinghorn is engaged. He is not at all willing to see them, for when they have waited a full hour, the clerk tells them that Mr. Tulkinghorn has nothing to say to them and they had better not wait. They do wait, however, with military perseverance, and at last the bell rings again and the client comes out of Mr. Tulkinghorn's room.\nThe client is a handsome old lady, no other than Mrs. Rouncewell, housekeeper at Chesney Wold. She comes out of the sanctuary with an old-fashioned curtsy and softly shuts the door. The clerk steps out of his pew to show her through the outer office. The old lady is thanking him for his attention when she observes the comrades in waiting.\n\"I beg your pardon, sir, but I think those gentlemen are military?\"\nMr. George not turning round, Mr. Bagnet takes upon himself to reply, \"Yes, ma'am. Formerly.\"\n\"I thought so. My heart warms, gentlemen, at the sight of you. It always does at the sight of such. God bless you, gentlemen! You'll excuse an old woman, but I had a son once who went for a soldier. A fine handsome youth he was, and good in his bold way. I ask your pardon for troubling you, sir. God bless you, gentlemen!\"\n\"Same to you, ma'am!\" returns Mr. Bagnet with good will.\nThere is something very touching in the earnestness of the old lady's voice. But Mr. George is so preoccupied that he does not look round until she has gone away and the door is closed.\n\"George,\" Mr. Bagnet gruffly whispers. \"Don't be cast down! Cheer up, my hearty!\"\nThe clerk having now again gone in, Mr. Tulkinghorn is heard to say with some irascibility, \"Let 'em come in then!\" They pass into the great room and find him standing before the fire.\n\"Now, what do you want? Sergeant, I told you the last time I saw you that I don't desire your company here.\"\nSergeant explains about the letter.\n\"I have nothing to say to you,\" rejoins Mr. Tulkinghorn. \"If you get into debt, you must pay your debts or take the consequences.\"\nSergeant is sorry to say that he is not prepared with the money.\n\"Very well! Then the other man must pay it for you.\"\nSergeant is sorry to add that the other man is not prepared with the money either.\n\"Very well! Then you must pay it between you or both be sued for it.\"\nThe lawyer sits down and stirs the fire. Mr. George hopes he will have the goodness to-\n\"I tell you, sergeant, I have nothing to say to you, and I don't want you here. This matter is not at all in my course of practice. You must go to Melchisedech's in Clifford's Inn.\"\n\"I apologise, sir,\" says Mr. George, \"for pressing myself upon you - but would you let me say a private word to you?\"\nMr. Tulkinghorn rises with his hands in his pockets and walks into a window recess. \"Now! I have no time to waste.\"\n\"Well, sir,\" says Mr. George, \"this man with me is the other party, and my sole object is to prevent his getting into trouble on my account. He is a most respectable man with a wife and family, formerly in the Royal Artillery-\"\n\"My friend, I don't care a pinch of snuff for the Royal Artillery.\"\n\"But I care a good deal for Bagnet and his family, sir. If I could bring them through this matter, I should give up what you wanted the other day.\"\n\"Have you got it here?\"\n\"I have got it here, sir.\"\n\"Sergeant,\" the lawyer proceeds in his dry passionless manner, \"make up your mind while I speak to you, for this is final. After I have finished speaking I have closed the subject. Understand that. You can, for a few days, leave here what you say you have brought. If you do choose to leave it here, I can replace this matter on its old footing, and I can besides give you a written undertaking that this man Bagnet shall never be troubled until you have been proceeded against to the utmost, and your own means have been exhausted. Have you decided?\"\nThe trooper answers with a long breath, \"I must do it, sir.\"\nSo Mr. Tulkinghorn, putting on his spectacles, sits down and writes the undertaking, which he reads and explains to Bagnet, who has all this time been staring at the ceiling. The trooper then takes from his breast-pocket a folded paper, which he lays unwillingly at the lawyer's elbow. \"'Tis only a letter of instructions, sir. The last I ever had from him.\"\nMr. Tulkinghorn opens and reads the letter; refolds it and lays it in his desk with a face as unperturbable as death.\nHe nods once in the same frigid and discourteous manner. \"You can go. Show these men out!\" Being shown out, they return to Mr. Bagnet's house to dine.\nAs Mrs. Bagnet serves out the boiled beef and greens, she seasons it with the best of temper. But Mr. George is unusually thoughtful and depressed. At first Mrs. Bagnet trusts to the endearments of Quebec and Malta to restore him, but finding that he is not the Bluffy of their usual frolicsome acquaintance, she withdraws them and leaves him to the domestic hearth.\nHe remains clouded and depressed. During the lengthy cleaning up process, when he and Mr. Bagnet are supplied with their pipes, he forgets to smoke, filling Mr. Bagnet with dismay.\nTherefore when Mrs. Bagnet at last appears and sits down to her sewing, Mr. Bagnet growls, \"Old girl!\" and winks at her to find out what's the matter.\n\"Why, George!\" says Mrs. Bagnet, quietly threading her needle. \"How low you are!\"\n\"Am I? Well, I am afraid I am not good company.\"\n\"He ain't well, I think, mother,\" says Quebec.\n\"George,\" says Mrs. Bagnet, working busily, \"I hope you are not cross enough to care about what a shrill old soldier's wife said this morning.\"\n\"My kind soul of a darling,\" returns the trooper, \"not a bit of it.\"\n\"Because truly, George, what I meant to say was that I trusted Lignum to you and was sure you'd bring him through it. And you have brought him through it, noble!\"\n\"Thankee, my dear!\" says George. \"I am glad of your good opinion.\"\nHe looks at her and then at young Woolwich, sitting on his stool in the corner, and beckons him over.\n\"See there, my boy,\" says George, \"there's a mother's face all bright with love of you. A little touched by the sun and the weather through following your father about and taking care of you, but as fresh and wholesome as a ripe apple on a tree.\"\nMr. Bagnet's expression shows the highest approval.\n\"The time will come, my boy,\" pursues the trooper, \"when your mother's hair will be grey, and her forehead crossed with wrinkles, and a fine old lady she'll be then. Take care that you can think in those days, 'I never whitened a hair of her dear head - I never marked a sorrowful line in her face!'\"\nMr. George rises from his chair and seats the boy beside his mother, saying, with something of a hurry, that he'll smoke his pipe in the street.",
        "paragraph_chars": [
            [
                0,
                78
            ],
            [
                78,
                417
            ],
            [
                417,
                544
            ],
            [
                544,
                573
            ],
            [
                573,
                751
            ],
            [
                751,
                1130
            ],
            [
                1130,
                1151
            ],
            [
                1151,
                1411
            ],
            [
                1411,
                1457
            ],
            [
                1457,
                1509
            ],
            [
                1509,
                1569
            ],
            [
                1569,
                1581
            ],
            [
                1581,
                1711
            ],
            [
                1711,
                1824
            ],
            [
                1824,
                2100
            ],
            [
                2100,
                2757
            ],
            [
                2757,
                2839
            ],
            [
                2839,
                2972
            ],
            [
                2972,
                3275
            ],
            [
                3275,
                3345
            ],
            [
                3345,
                3419
            ],
            [
                3419,
                3510
            ],
            [
                3510,
                3688
            ],
            [
                3688,
                3735
            ],
            [
                3735,
                4063
            ],
            [
                4063,
                4186
            ],
            [
                4186,
                4527
            ],
            [
                4527,
                4562
            ],
            [
                4562,
                5050
            ],
            [
                5050,
                5136
            ],
            [
                5136,
                5309
            ],
            [
                5309,
                5378
            ],
            [
                5378,
                5747
            ],
            [
                5747,
                5814
            ],
            [
                5814,
                6296
            ],
            [
                6296,
                6375
            ],
            [
                6375,
                6907
            ],
            [
                6907,
                6988
            ],
            [
                6988,
                7229
            ],
            [
                7229,
                7398
            ],
            [
                7398,
                7550
            ],
            [
                7550,
                7900
            ],
            [
                7900,
                8029
            ],
            [
                8029,
                8056
            ],
            [
                8056,
                8201
            ],
            [
                8201,
                8253
            ],
            [
                8253,
                8286
            ],
            [
                8286,
                8308
            ],
            [
                8308,
                8467
            ],
            [
                8467,
                8547
            ],
            [
                8547,
                8800
            ],
            [
                8800,
                8942
            ],
            [
                8942,
                9044
            ],
            [
                9044,
                9092
            ],
            [
                9092,
                9179
            ],
            [
                9179,
                9225
            ],
            [
                9225,
                9457
            ],
            [
                9457,
                9522
            ],
            [
                9522,
                9596
            ],
            [
                9596,
                9674
            ],
            [
                9674,
                10150
            ],
            [
                10150,
                10187
            ],
            [
                10187,
                10226
            ],
            [
                10226,
                10282
            ],
            [
                10282,
                10355
            ],
            [
                10355,
                10745
            ],
            [
                10745,
                10857
            ],
            [
                10857,
                10939
            ],
            [
                10939,
                11060
            ],
            [
                11060,
                11313
            ],
            [
                11313,
                11379
            ],
            [
                11379,
                11398
            ],
            [
                11398,
                11467
            ],
            [
                11467,
                11575
            ],
            [
                11575,
                11621
            ],
            [
                11621,
                11821
            ],
            [
                11821,
                12175
            ],
            [
                12175,
                12270
            ],
            [
                12270,
                12449
            ],
            [
                12449,
                12843
            ],
            [
                12843,
                13184
            ],
            [
                13184,
                13252
            ],
            [
                13252,
                13346
            ],
            [
                13346,
                13670
            ],
            [
                13670,
                13727
            ],
            [
                13727,
                13913
            ],
            [
                13913,
                13995
            ],
            [
                13995,
                14180
            ],
            [
                14180,
                14289
            ],
            [
                14289,
                14325
            ],
            [
                14325,
                14456
            ],
            [
                14456,
                14521
            ],
            [
                14521,
                14574
            ],
            [
                14574,
                14657
            ],
            [
                14657,
                14727
            ],
            [
                14727,
                14815
            ],
            [
                14815,
                14997
            ],
            [
                14997,
                15115
            ],
            [
                15115,
                15231
            ],
            [
                15231,
                15459
            ],
            [
                15459,
                15527
            ],
            [
                15527,
                15675
            ],
            [
                15675,
                15699
            ],
            [
                15699,
                15726
            ],
            [
                15726,
                16278
            ],
            [
                16278,
                16339
            ],
            [
                16339,
                16698
            ],
            [
                16698,
                16816
            ],
            [
                16816,
                16967
            ],
            [
                16967,
                17334
            ],
            [
                17334,
                17515
            ],
            [
                17515,
                17666
            ],
            [
                17666,
                17748
            ],
            [
                17748,
                17797
            ],
            [
                17797,
                17844
            ],
            [
                17844,
                17988
            ],
            [
                17988,
                18057
            ],
            [
                18057,
                18220
            ],
            [
                18220,
                18287
            ],
            [
                18287,
                18389
            ],
            [
                18389,
                18636
            ],
            [
                18636,
                18688
            ],
            [
                18688,
                18989
            ],
            [
                18989,
                19133
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                78
            ],
            [
                78,
                154
            ],
            [
                154,
                297
            ],
            [
                297,
                417
            ],
            [
                417,
                544
            ],
            [
                544,
                552
            ],
            [
                552,
                573
            ],
            [
                573,
                692
            ],
            [
                692,
                751
            ],
            [
                751,
                769
            ],
            [
                769,
                785
            ],
            [
                785,
                791
            ],
            [
                791,
                1071
            ],
            [
                1071,
                1097
            ],
            [
                1097,
                1130
            ],
            [
                1130,
                1151
            ],
            [
                1151,
                1207
            ],
            [
                1207,
                1296
            ],
            [
                1296,
                1369
            ],
            [
                1369,
                1411
            ],
            [
                1411,
                1457
            ],
            [
                1457,
                1466
            ],
            [
                1466,
                1473
            ],
            [
                1473,
                1509
            ],
            [
                1509,
                1569
            ],
            [
                1569,
                1581
            ],
            [
                1581,
                1711
            ],
            [
                1711,
                1776
            ],
            [
                1776,
                1824
            ],
            [
                1824,
                1964
            ],
            [
                1964,
                2038
            ],
            [
                2038,
                2100
            ],
            [
                2100,
                2307
            ],
            [
                2307,
                2447
            ],
            [
                2447,
                2553
            ],
            [
                2553,
                2627
            ],
            [
                2627,
                2757
            ],
            [
                2757,
                2839
            ],
            [
                2839,
                2903
            ],
            [
                2903,
                2972
            ],
            [
                2972,
                3235
            ],
            [
                3235,
                3275
            ],
            [
                3275,
                3345
            ],
            [
                3345,
                3374
            ],
            [
                3374,
                3392
            ],
            [
                3392,
                3419
            ],
            [
                3419,
                3510
            ],
            [
                3510,
                3559
            ],
            [
                3559,
                3568
            ],
            [
                3568,
                3638
            ],
            [
                3638,
                3688
            ],
            [
                3688,
                3735
            ],
            [
                3735,
                3797
            ],
            [
                3797,
                4045
            ],
            [
                4045,
                4063
            ],
            [
                4063,
                4186
            ],
            [
                4186,
                4234
            ],
            [
                4234,
                4263
            ],
            [
                4263,
                4440
            ],
            [
                4440,
                4453
            ],
            [
                4453,
                4504
            ],
            [
                4504,
                4527
            ],
            [
                4527,
                4562
            ],
            [
                4562,
                4686
            ],
            [
                4686,
                4802
            ],
            [
                4802,
                4824
            ],
            [
                4824,
                4892
            ],
            [
                4892,
                4951
            ],
            [
                4951,
                4992
            ],
            [
                4992,
                5050
            ],
            [
                5050,
                5136
            ],
            [
                5136,
                5141
            ],
            [
                5141,
                5253
            ],
            [
                5253,
                5309
            ],
            [
                5309,
                5378
            ],
            [
                5378,
                5454
            ],
            [
                5454,
                5477
            ],
            [
                5477,
                5510
            ],
            [
                5510,
                5537
            ],
            [
                5537,
                5584
            ],
            [
                5584,
                5661
            ],
            [
                5661,
                5723
            ],
            [
                5723,
                5747
            ],
            [
                5747,
                5814
            ],
            [
                5814,
                5960
            ],
            [
                5960,
                6016
            ],
            [
                6016,
                6049
            ],
            [
                6049,
                6124
            ],
            [
                6124,
                6218
            ],
            [
                6218,
                6259
            ],
            [
                6259,
                6265
            ],
            [
                6265,
                6296
            ],
            [
                6296,
                6375
            ],
            [
                6375,
                6472
            ],
            [
                6472,
                6520
            ],
            [
                6520,
                6606
            ],
            [
                6606,
                6734
            ],
            [
                6734,
                6907
            ],
            [
                6907,
                6930
            ],
            [
                6930,
                6969
            ],
            [
                6969,
                6988
            ],
            [
                6988,
                7131
            ],
            [
                7131,
                7229
            ],
            [
                7229,
                7323
            ],
            [
                7323,
                7398
            ],
            [
                7398,
                7433
            ],
            [
                7433,
                7550
            ],
            [
                7550,
                7701
            ],
            [
                7701,
                7825
            ],
            [
                7825,
                7900
            ],
            [
                7900,
                7956
            ],
            [
                7956,
                8029
            ],
            [
                8029,
                8056
            ],
            [
                8056,
                8145
            ],
            [
                8145,
                8169
            ],
            [
                8169,
                8201
            ],
            [
                8201,
                8253
            ],
            [
                8253,
                8286
            ],
            [
                8286,
                8308
            ],
            [
                8308,
                8361
            ],
            [
                8361,
                8449
            ],
            [
                8449,
                8467
            ],
            [
                8467,
                8547
            ],
            [
                8547,
                8593
            ],
            [
                8593,
                8662
            ],
            [
                8662,
                8800
            ],
            [
                8800,
                8894
            ],
            [
                8894,
                8906
            ],
            [
                8906,
                8942
            ],
            [
                8942,
                9044
            ],
            [
                9044,
                9049
            ],
            [
                9049,
                9061
            ],
            [
                9061,
                9092
            ],
            [
                9092,
                9179
            ],
            [
                9179,
                9225
            ],
            [
                9225,
                9293
            ],
            [
                9293,
                9379
            ],
            [
                9379,
                9457
            ],
            [
                9457,
                9472
            ],
            [
                9472,
                9500
            ],
            [
                9500,
                9522
            ],
            [
                9522,
                9596
            ],
            [
                9596,
                9674
            ],
            [
                9674,
                9695
            ],
            [
                9695,
                9712
            ],
            [
                9712,
                9906
            ],
            [
                9906,
                9969
            ],
            [
                9969,
                10150
            ],
            [
                10150,
                10187
            ],
            [
                10187,
                10195
            ],
            [
                10195,
                10213
            ],
            [
                10213,
                10226
            ],
            [
                10226,
                10231
            ],
            [
                10231,
                10282
            ],
            [
                10282,
                10355
            ],
            [
                10355,
                10439
            ],
            [
                10439,
                10548
            ],
            [
                10548,
                10745
            ],
            [
                10745,
                10784
            ],
            [
                10784,
                10857
            ],
            [
                10857,
                10892
            ],
            [
                10892,
                10928
            ],
            [
                10928,
                10939
            ],
            [
                10939,
                10951
            ],
            [
                10951,
                11060
            ],
            [
                11060,
                11068
            ],
            [
                11068,
                11094
            ],
            [
                11094,
                11130
            ],
            [
                11130,
                11215
            ],
            [
                11215,
                11313
            ],
            [
                11313,
                11379
            ],
            [
                11379,
                11398
            ],
            [
                11398,
                11467
            ],
            [
                11467,
                11506
            ],
            [
                11506,
                11522
            ],
            [
                11522,
                11540
            ],
            [
                11540,
                11557
            ],
            [
                11557,
                11575
            ],
            [
                11575,
                11621
            ],
            [
                11621,
                11640
            ],
            [
                11640,
                11661
            ],
            [
                11661,
                11719
            ],
            [
                11719,
                11744
            ],
            [
                11744,
                11776
            ],
            [
                11776,
                11807
            ],
            [
                11807,
                11821
            ],
            [
                11821,
                11993
            ],
            [
                11993,
                12055
            ],
            [
                12055,
                12175
            ],
            [
                12175,
                12230
            ],
            [
                12230,
                12270
            ],
            [
                12270,
                12369
            ],
            [
                12369,
                12449
            ],
            [
                12449,
                12531
            ],
            [
                12531,
                12707
            ],
            [
                12707,
                12843
            ],
            [
                12843,
                12938
            ],
            [
                12938,
                13025
            ],
            [
                13025,
                13094
            ],
            [
                13094,
                13184
            ],
            [
                13184,
                13252
            ],
            [
                13252,
                13335
            ],
            [
                13335,
                13346
            ],
            [
                13346,
                13361
            ],
            [
                13361,
                13409
            ],
            [
                13409,
                13446
            ],
            [
                13446,
                13472
            ],
            [
                13472,
                13545
            ],
            [
                13545,
                13601
            ],
            [
                13601,
                13643
            ],
            [
                13643,
                13670
            ],
            [
                13670,
                13692
            ],
            [
                13692,
                13727
            ],
            [
                13727,
                13804
            ],
            [
                13804,
                13913
            ],
            [
                13913,
                13952
            ],
            [
                13952,
                13973
            ],
            [
                13973,
                13995
            ],
            [
                13995,
                14111
            ],
            [
                14111,
                14180
            ],
            [
                14180,
                14204
            ],
            [
                14204,
                14289
            ],
            [
                14289,
                14325
            ],
            [
                14325,
                14382
            ],
            [
                14382,
                14456
            ],
            [
                14456,
                14521
            ],
            [
                14521,
                14533
            ],
            [
                14533,
                14574
            ],
            [
                14574,
                14657
            ],
            [
                14657,
                14669
            ],
            [
                14669,
                14727
            ],
            [
                14727,
                14768
            ],
            [
                14768,
                14815
            ],
            [
                14815,
                14895
            ],
            [
                14895,
                14947
            ],
            [
                14947,
                14997
            ],
            [
                14997,
                15115
            ],
            [
                15115,
                15199
            ],
            [
                15199,
                15205
            ],
            [
                15205,
                15231
            ],
            [
                15231,
                15372
            ],
            [
                15372,
                15459
            ],
            [
                15459,
                15527
            ],
            [
                15527,
                15583
            ],
            [
                15583,
                15675
            ],
            [
                15675,
                15699
            ],
            [
                15699,
                15726
            ],
            [
                15726,
                15849
            ],
            [
                15849,
                15907
            ],
            [
                15907,
                15924
            ],
            [
                15924,
                15991
            ],
            [
                15991,
                16259
            ],
            [
                16259,
                16278
            ],
            [
                16278,
                16339
            ],
            [
                16339,
                16514
            ],
            [
                16514,
                16625
            ],
            [
                16625,
                16667
            ],
            [
                16667,
                16698
            ],
            [
                16698,
                16816
            ],
            [
                16816,
                16873
            ],
            [
                16873,
                16886
            ],
            [
                16886,
                16907
            ],
            [
                16907,
                16967
            ],
            [
                16967,
                17061
            ],
            [
                17061,
                17115
            ],
            [
                17115,
                17334
            ],
            [
                17334,
                17368
            ],
            [
                17368,
                17515
            ],
            [
                17515,
                17618
            ],
            [
                17618,
                17666
            ],
            [
                17666,
                17681
            ],
            [
                17681,
                17729
            ],
            [
                17729,
                17748
            ],
            [
                17748,
                17755
            ],
            [
                17755,
                17797
            ],
            [
                17797,
                17844
            ],
            [
                17844,
                17988
            ],
            [
                17988,
                18057
            ],
            [
                18057,
                18175
            ],
            [
                18175,
                18220
            ],
            [
                18220,
                18240
            ],
            [
                18240,
                18253
            ],
            [
                18253,
                18287
            ],
            [
                18287,
                18389
            ],
            [
                18389,
                18477
            ],
            [
                18477,
                18636
            ],
            [
                18636,
                18688
            ],
            [
                18688,
                18854
            ],
            [
                18854,
                18989
            ],
            [
                18989,
                19133
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                68
            ],
            [
                78,
                89
            ],
            [
                90,
                92
            ],
            [
                101,
                115
            ],
            [
                115,
                116
            ],
            [
                123,
                154
            ],
            [
                154,
                201
            ],
            [
                201,
                228
            ],
            [
                233,
                262
            ],
            [
                267,
                297
            ],
            [
                297,
                329
            ],
            [
                329,
                380
            ],
            [
                387,
                415
            ],
            [
                415,
                416
            ],
            [
                417,
                482
            ],
            [
                483,
                542
            ],
            [
                542,
                544
            ],
            [
                544,
                552
            ],
            [
                552,
                571
            ],
            [
                571,
                573
            ],
            [
                573,
                627
            ],
            [
                628,
                692
            ],
            [
                692,
                749
            ],
            [
                749,
                751
            ],
            [
                751,
                769
            ],
            [
                769,
                783
            ],
            [
                787,
                791
            ],
            [
                791,
                813
            ],
            [
                814,
                990
            ],
            [
                999,
                1071
            ],
            [
                1071,
                1097
            ],
            [
                1097,
                1130
            ],
            [
                1130,
                1151
            ],
            [
                1151,
                1152
            ],
            [
                1158,
                1207
            ],
            [
                1207,
                1208
            ],
            [
                1208,
                1219
            ],
            [
                1220,
                1294
            ],
            [
                1296,
                1359
            ],
            [
                1360,
                1369
            ],
            [
                1369,
                1408
            ],
            [
                1411,
                1412
            ],
            [
                1412,
                1457
            ],
            [
                1457,
                1466
            ],
            [
                1466,
                1473
            ],
            [
                1473,
                1509
            ],
            [
                1509,
                1569
            ],
            [
                1569,
                1581
            ],
            [
                1581,
                1646
            ],
            [
                1647,
                1711
            ],
            [
                1712,
                1756
            ],
            [
                1774,
                1776
            ],
            [
                1776,
                1821
            ],
            [
                1824,
                1828
            ],
            [
                1829,
                1831
            ],
            [
                1850,
                1879
            ],
            [
                1880,
                1964
            ],
            [
                1964,
                1996
            ],
            [
                2001,
                2035
            ],
            [
                2038,
                2100
            ],
            [
                2100,
                2112
            ],
            [
                2116,
                2118
            ],
            [
                2129,
                2133
            ],
            [
                2134,
                2222
            ],
            [
                2229,
                2256
            ],
            [
                2262,
                2307
            ],
            [
                2307,
                2310
            ],
            [
                2311,
                2319
            ],
            [
                2320,
                2331
            ],
            [
                2332,
                2336
            ],
            [
                2344,
                2345
            ],
            [
                2356,
                2357
            ],
            [
                2358,
                2361
            ],
            [
                2365,
                2436
            ],
            [
                2437,
                2440
            ],
            [
                2441,
                2445
            ],
            [
                2445,
                2446
            ],
            [
                2447,
                2450
            ],
            [
                2451,
                2469
            ],
            [
                2479,
                2488
            ],
            [
                2489,
                2540
            ],
            [
                2541,
                2544
            ],
            [
                2551,
                2553
            ],
            [
                2553,
                2579
            ],
            [
                2580,
                2601
            ],
            [
                2601,
                2627
            ],
            [
                2627,
                2644
            ],
            [
                2645,
                2673
            ],
            [
                2673,
                2757
            ],
            [
                2757,
                2839
            ],
            [
                2839,
                2891
            ],
            [
                2892,
                2901
            ],
            [
                2901,
                2903
            ],
            [
                2903,
                2913
            ],
            [
                2914,
                2922
            ],
            [
                2930,
                2971
            ],
            [
                2972,
                3045
            ],
            [
                3048,
                3087
            ],
            [
                3088,
                3111
            ],
            [
                3111,
                3112
            ],
            [
                3113,
                3125
            ],
            [
                3125,
                3126
            ],
            [
                3147,
                3149
            ],
            [
                3160,
                3161
            ],
            [
                3161,
                3163
            ],
            [
                3167,
                3181
            ],
            [
                3182,
                3235
            ],
            [
                3235,
                3272
            ],
            [
                3272,
                3275
            ],
            [
                3275,
                3345
            ],
            [
                3346,
                3374
            ],
            [
                3374,
                3390
            ],
            [
                3390,
                3392
            ],
            [
                3392,
                3419
            ],
            [
                3419,
                3510
            ],
            [
                3510,
                3559
            ],
            [
                3559,
                3566
            ],
            [
                3568,
                3638
            ],
            [
                3638,
                3688
            ],
            [
                3688,
                3728
            ],
            [
                3733,
                3735
            ],
            [
                3735,
                3795
            ],
            [
                3795,
                3797
            ],
            [
                3797,
                3886
            ],
            [
                3887,
                3920
            ],
            [
                3923,
                3980
            ],
            [
                3983,
                4045
            ],
            [
                4045,
                4060
            ],
            [
                4063,
                4073
            ],
            [
                4074,
                4088
            ],
            [
                4089,
                4096
            ],
            [
                4097,
                4150
            ],
            [
                4151,
                4160
            ],
            [
                4161,
                4166
            ],
            [
                4170,
                4186
            ],
            [
                4186,
                4234
            ],
            [
                4234,
                4263
            ],
            [
                4263,
                4440
            ],
            [
                4440,
                4453
            ],
            [
                4453,
                4502
            ],
            [
                4504,
                4527
            ],
            [
                4529,
                4537
            ],
            [
                4538,
                4560
            ],
            [
                4560,
                4562
            ],
            [
                4562,
                4568
            ],
            [
                4572,
                4576
            ],
            [
                4577,
                4607
            ],
            [
                4619,
                4651
            ],
            [
                4651,
                4684
            ],
            [
                4684,
                4686
            ],
            [
                4686,
                4739
            ],
            [
                4742,
                4762
            ],
            [
                4765,
                4802
            ],
            [
                4802,
                4824
            ],
            [
                4824,
                4864
            ],
            [
                4865,
                4882
            ],
            [
                4883,
                4890
            ],
            [
                4890,
                4892
            ],
            [
                4892,
                4895
            ],
            [
                4896,
                4951
            ],
            [
                4951,
                4992
            ],
            [
                4992,
                5050
            ],
            [
                5050,
                5136
            ],
            [
                5136,
                5141
            ],
            [
                5141,
                5253
            ],
            [
                5253,
                5309
            ],
            [
                5309,
                5358
            ],
            [
                5361,
                5378
            ],
            [
                5378,
                5454
            ],
            [
                5454,
                5475
            ],
            [
                5475,
                5477
            ],
            [
                5477,
                5510
            ],
            [
                5510,
                5537
            ],
            [
                5537,
                5584
            ],
            [
                5584,
                5588
            ],
            [
                5597,
                5621
            ],
            [
                5628,
                5643
            ],
            [
                5647,
                5661
            ],
            [
                5661,
                5723
            ],
            [
                5723,
                5744
            ],
            [
                5747,
                5814
            ],
            [
                5814,
                5923
            ],
            [
                5927,
                5958
            ],
            [
                5960,
                6014
            ],
            [
                6014,
                6016
            ],
            [
                6016,
                6049
            ],
            [
                6049,
                6056
            ],
            [
                6057,
                6097
            ],
            [
                6097,
                6124
            ],
            [
                6124,
                6142
            ],
            [
                6143,
                6218
            ],
            [
                6218,
                6259
            ],
            [
                6259,
                6265
            ],
            [
                6265,
                6296
            ],
            [
                6296,
                6307
            ],
            [
                6308,
                6313
            ],
            [
                6314,
                6345
            ],
            [
                6352,
                6373
            ],
            [
                6373,
                6375
            ],
            [
                6375,
                6456
            ],
            [
                6470,
                6472
            ],
            [
                6473,
                6520
            ],
            [
                6520,
                6574
            ],
            [
                6577,
                6606
            ],
            [
                6606,
                6649
            ],
            [
                6649,
                6734
            ],
            [
                6736,
                6744
            ],
            [
                6763,
                6768
            ],
            [
                6768,
                6773
            ],
            [
                6779,
                6784
            ],
            [
                6788,
                6820
            ],
            [
                6821,
                6905
            ],
            [
                6905,
                6907
            ],
            [
                6907,
                6930
            ],
            [
                6930,
                6969
            ],
            [
                6969,
                6988
            ],
            [
                6991,
                6999
            ],
            [
                7009,
                7062
            ],
            [
                7064,
                7079
            ],
            [
                7080,
                7090
            ],
            [
                7091,
                7109
            ],
            [
                7116,
                7129
            ],
            [
                7129,
                7131
            ],
            [
                7131,
                7142
            ],
            [
                7143,
                7229
            ],
            [
                7229,
                7323
            ],
            [
                7323,
                7398
            ],
            [
                7398,
                7409
            ],
            [
                7419,
                7431
            ],
            [
                7431,
                7433
            ],
            [
                7433,
                7444
            ],
            [
                7445,
                7454
            ],
            [
                7455,
                7457
            ],
            [
                7458,
                7550
            ],
            [
                7550,
                7671
            ],
            [
                7682,
                7688
            ],
            [
                7689,
                7701
            ],
            [
                7709,
                7733
            ],
            [
                7734,
                7750
            ],
            [
                7751,
                7760
            ],
            [
                7765,
                7768
            ],
            [
                7777,
                7825
            ],
            [
                7825,
                7879
            ],
            [
                7879,
                7891
            ],
            [
                7898,
                7900
            ],
            [
                7900,
                7930
            ],
            [
                7933,
                7938
            ],
            [
                7939,
                7956
            ],
            [
                7956,
                7985
            ],
            [
                7986,
                7995
            ],
            [
                7998,
                8029
            ],
            [
                8029,
                8056
            ],
            [
                8056,
                8082
            ],
            [
                8083,
                8096
            ],
            [
                8099,
                8116
            ],
            [
                8119,
                8145
            ],
            [
                8154,
                8155
            ],
            [
                8161,
                8169
            ],
            [
                8169,
                8201
            ],
            [
                8201,
                8253
            ],
            [
                8254,
                8271
            ],
            [
                8274,
                8278
            ],
            [
                8286,
                8308
            ],
            [
                8308,
                8309
            ],
            [
                8309,
                8314
            ],
            [
                8315,
                8334
            ],
            [
                8337,
                8361
            ],
            [
                8361,
                8387
            ],
            [
                8390,
                8403
            ],
            [
                8406,
                8425
            ],
            [
                8437,
                8449
            ],
            [
                8449,
                8467
            ],
            [
                8467,
                8547
            ],
            [
                8562,
                8593
            ],
            [
                8593,
                8614
            ],
            [
                8615,
                8624
            ],
            [
                8633,
                8637
            ],
            [
                8638,
                8660
            ],
            [
                8660,
                8662
            ],
            [
                8681,
                8683
            ],
            [
                8683,
                8689
            ],
            [
                8690,
                8708
            ],
            [
                8709,
                8711
            ],
            [
                8712,
                8721
            ],
            [
                8722,
                8800
            ],
            [
                8800,
                8849
            ],
            [
                8850,
                8853
            ],
            [
                8854,
                8876
            ],
            [
                8877,
                8894
            ],
            [
                8894,
                8906
            ],
            [
                8906,
                8942
            ],
            [
                8942,
                8968
            ],
            [
                8968,
                9044
            ],
            [
                9044,
                9049
            ],
            [
                9049,
                9061
            ],
            [
                9061,
                9089
            ],
            [
                9092,
                9178
            ],
            [
                9179,
                9225
            ],
            [
                9225,
                9229
            ],
            [
                9229,
                9256
            ],
            [
                9256,
                9285
            ],
            [
                9293,
                9319
            ],
            [
                9319,
                9320
            ],
            [
                9321,
                9379
            ],
            [
                9379,
                9457
            ],
            [
                9457,
                9472
            ],
            [
                9472,
                9500
            ],
            [
                9500,
                9522
            ],
            [
                9523,
                9562
            ],
            [
                9563,
                9574
            ],
            [
                9575,
                9593
            ],
            [
                9593,
                9596
            ],
            [
                9596,
                9674
            ],
            [
                9674,
                9695
            ],
            [
                9695,
                9711
            ],
            [
                9713,
                9738
            ],
            [
                9748,
                9789
            ],
            [
                9790,
                9797
            ],
            [
                9803,
                9841
            ],
            [
                9842,
                9906
            ],
            [
                9906,
                9941
            ],
            [
                9942,
                9969
            ],
            [
                9969,
                10045
            ],
            [
                10050,
                10147
            ],
            [
                10150,
                10166
            ],
            [
                10166,
                10185
            ],
            [
                10185,
                10187
            ],
            [
                10187,
                10195
            ],
            [
                10195,
                10211
            ],
            [
                10211,
                10213
            ],
            [
                10213,
                10226
            ],
            [
                10226,
                10231
            ],
            [
                10231,
                10282
            ],
            [
                10282,
                10328
            ],
            [
                10329,
                10353
            ],
            [
                10353,
                10355
            ],
            [
                10356,
                10439
            ],
            [
                10439,
                10489
            ],
            [
                10489,
                10506
            ],
            [
                10507,
                10548
            ],
            [
                10548,
                10605
            ],
            [
                10605,
                10663
            ],
            [
                10664,
                10745
            ],
            [
                10746,
                10784
            ],
            [
                10784,
                10848
            ],
            [
                10854,
                10857
            ],
            [
                10857,
                10892
            ],
            [
                10892,
                10894
            ],
            [
                10895,
                10902
            ],
            [
                10903,
                10928
            ],
            [
                10928,
                10939
            ],
            [
                10939,
                10951
            ],
            [
                10951,
                10979
            ],
            [
                10981,
                11007
            ],
            [
                11008,
                11058
            ],
            [
                11058,
                11060
            ],
            [
                11060,
                11068
            ],
            [
                11068,
                11094
            ],
            [
                11094,
                11095
            ],
            [
                11095,
                11130
            ],
            [
                11130,
                11215
            ],
            [
                11215,
                11254
            ],
            [
                11255,
                11313
            ],
            [
                11313,
                11350
            ],
            [
                11350,
                11379
            ],
            [
                11379,
                11395
            ],
            [
                11395,
                11398
            ],
            [
                11398,
                11411
            ],
            [
                11412,
                11467
            ],
            [
                11467,
                11506
            ],
            [
                11506,
                11522
            ],
            [
                11522,
                11540
            ],
            [
                11540,
                11557
            ],
            [
                11557,
                11575
            ],
            [
                11575,
                11620
            ],
            [
                11621,
                11640
            ],
            [
                11640,
                11661
            ],
            [
                11661,
                11719
            ],
            [
                11719,
                11722
            ],
            [
                11727,
                11742
            ],
            [
                11744,
                11776
            ],
            [
                11776,
                11807
            ],
            [
                11807,
                11821
            ],
            [
                11821,
                11823
            ],
            [
                11831,
                11882
            ],
            [
                11883,
                11894
            ],
            [
                11897,
                11906
            ],
            [
                11906,
                11916
            ],
            [
                11917,
                11924
            ],
            [
                11925,
                11993
            ],
            [
                11993,
                12023
            ],
            [
                12024,
                12055
            ],
            [
                12055,
                12115
            ],
            [
                12116,
                12129
            ],
            [
                12129,
                12175
            ],
            [
                12175,
                12203
            ],
            [
                12203,
                12230
            ],
            [
                12230,
                12270
            ],
            [
                12270,
                12280
            ],
            [
                12281,
                12315
            ],
            [
                12315,
                12346
            ],
            [
                12349,
                12369
            ],
            [
                12374,
                12449
            ],
            [
                12449,
                12529
            ],
            [
                12529,
                12531
            ],
            [
                12531,
                12607
            ],
            [
                12608,
                12617
            ],
            [
                12629,
                12707
            ],
            [
                12707,
                12734
            ],
            [
                12735,
                12743
            ],
            [
                12744,
                12756
            ],
            [
                12756,
                12805
            ],
            [
                12806,
                12843
            ],
            [
                12843,
                12938
            ],
            [
                12938,
                12973
            ],
            [
                12977,
                13025
            ],
            [
                13025,
                13092
            ],
            [
                13092,
                13094
            ],
            [
                13094,
                13184
            ],
            [
                13184,
                13252
            ],
            [
                13254,
                13280
            ],
            [
                13280,
                13281
            ],
            [
                13282,
                13335
            ],
            [
                13335,
                13346
            ],
            [
                13346,
                13361
            ],
            [
                13361,
                13409
            ],
            [
                13409,
                13446
            ],
            [
                13446,
                13472
            ],
            [
                13472,
                13545
            ],
            [
                13545,
                13599
            ],
            [
                13599,
                13601
            ],
            [
                13601,
                13643
            ],
            [
                13643,
                13670
            ],
            [
                13670,
                13692
            ],
            [
                13692,
                13715
            ],
            [
                13716,
                13727
            ],
            [
                13727,
                13802
            ],
            [
                13802,
                13804
            ],
            [
                13804,
                13824
            ],
            [
                13828,
                13836
            ],
            [
                13837,
                13911
            ],
            [
                13911,
                13913
            ],
            [
                13913,
                13950
            ],
            [
                13950,
                13952
            ],
            [
                13952,
                13973
            ],
            [
                13973,
                13995
            ],
            [
                13995,
                14029
            ],
            [
                14031,
                14046
            ],
            [
                14050,
                14058
            ],
            [
                14059,
                14062
            ],
            [
                14063,
                14111
            ],
            [
                14111,
                14140
            ],
            [
                14141,
                14180
            ],
            [
                14180,
                14184
            ],
            [
                14184,
                14204
            ],
            [
                14204,
                14289
            ],
            [
                14289,
                14297
            ],
            [
                14307,
                14312
            ],
            [
                14313,
                14316
            ],
            [
                14317,
                14323
            ],
            [
                14323,
                14325
            ],
            [
                14325,
                14382
            ],
            [
                14382,
                14453
            ],
            [
                14456,
                14521
            ],
            [
                14521,
                14533
            ],
            [
                14533,
                14551
            ],
            [
                14552,
                14574
            ],
            [
                14574,
                14657
            ],
            [
                14657,
                14669
            ],
            [
                14669,
                14704
            ],
            [
                14705,
                14724
            ],
            [
                14727,
                14747
            ],
            [
                14748,
                14768
            ],
            [
                14768,
                14813
            ],
            [
                14815,
                14866
            ],
            [
                14868,
                14871
            ],
            [
                14872,
                14873
            ],
            [
                14874,
                14895
            ],
            [
                14895,
                14945
            ],
            [
                14945,
                14947
            ],
            [
                14947,
                14997
            ],
            [
                14997,
                14999
            ],
            [
                15009,
                15063
            ],
            [
                15066,
                15115
            ],
            [
                15115,
                15181
            ],
            [
                15184,
                15197
            ],
            [
                15197,
                15199
            ],
            [
                15199,
                15205
            ],
            [
                15205,
                15230
            ],
            [
                15231,
                15297
            ],
            [
                15297,
                15298
            ],
            [
                15299,
                15372
            ],
            [
                15372,
                15456
            ],
            [
                15459,
                15508
            ],
            [
                15509,
                15524
            ],
            [
                15524,
                15527
            ],
            [
                15528,
                15569
            ],
            [
                15570,
                15576
            ],
            [
                15581,
                15583
            ],
            [
                15583,
                15634
            ],
            [
                15635,
                15642
            ],
            [
                15643,
                15658
            ],
            [
                15659,
                15675
            ],
            [
                15675,
                15699
            ],
            [
                15699,
                15726
            ],
            [
                15726,
                15787
            ],
            [
                15787,
                15849
            ],
            [
                15849,
                15905
            ],
            [
                15905,
                15907
            ],
            [
                15907,
                15924
            ],
            [
                15924,
                15931
            ],
            [
                15931,
                15948
            ],
            [
                15949,
                15959
            ],
            [
                15960,
                15989
            ],
            [
                15989,
                15991
            ],
            [
                15994,
                15997
            ],
            [
                15998,
                16000
            ],
            [
                16001,
                16025
            ],
            [
                16026,
                16081
            ],
            [
                16082,
                16089
            ],
            [
                16090,
                16165
            ],
            [
                16166,
                16218
            ],
            [
                16223,
                16227
            ],
            [
                16232,
                16237
            ],
            [
                16248,
                16257
            ],
            [
                16257,
                16259
            ],
            [
                16259,
                16278
            ],
            [
                16278,
                16289
            ],
            [
                16290,
                16339
            ],
            [
                16339,
                16432
            ],
            [
                16433,
                16512
            ],
            [
                16512,
                16514
            ],
            [
                16514,
                16589
            ],
            [
                16602,
                16625
            ],
            [
                16625,
                16667
            ],
            [
                16667,
                16698
            ],
            [
                16700,
                16713
            ],
            [
                16714,
                16740
            ],
            [
                16742,
                16783
            ],
            [
                16784,
                16788
            ],
            [
                16789,
                16816
            ],
            [
                16816,
                16818
            ],
            [
                16824,
                16871
            ],
            [
                16873,
                16886
            ],
            [
                16886,
                16904
            ],
            [
                16904,
                16907
            ],
            [
                16907,
                16928
            ],
            [
                16936,
                16951
            ],
            [
                16958,
                16967
            ],
            [
                16970,
                16996
            ],
            [
                16997,
                17003
            ],
            [
                17004,
                17019
            ],
            [
                17019,
                17020
            ],
            [
                17021,
                17024
            ],
            [
                17025,
                17059
            ],
            [
                17059,
                17061
            ],
            [
                17065,
                17075
            ],
            [
                17076,
                17115
            ],
            [
                17115,
                17149
            ],
            [
                17150,
                17209
            ],
            [
                17210,
                17214
            ],
            [
                17218,
                17279
            ],
            [
                17295,
                17312
            ],
            [
                17313,
                17334
            ],
            [
                17334,
                17344
            ],
            [
                17345,
                17368
            ],
            [
                17368,
                17398
            ],
            [
                17399,
                17464
            ],
            [
                17465,
                17482
            ],
            [
                17491,
                17506
            ],
            [
                17507,
                17513
            ],
            [
                17513,
                17515
            ],
            [
                17515,
                17557
            ],
            [
                17558,
                17578
            ],
            [
                17585,
                17618
            ],
            [
                17618,
                17627
            ],
            [
                17631,
                17666
            ],
            [
                17666,
                17681
            ],
            [
                17681,
                17729
            ],
            [
                17729,
                17748
            ],
            [
                17748,
                17755
            ],
            [
                17755,
                17781
            ],
            [
                17782,
                17794
            ],
            [
                17794,
                17797
            ],
            [
                17797,
                17798
            ],
            [
                17798,
                17830
            ],
            [
                17836,
                17844
            ],
            [
                17844,
                17889
            ],
            [
                17889,
                17890
            ],
            [
                17896,
                17899
            ],
            [
                17908,
                17923
            ],
            [
                17935,
                17939
            ],
            [
                17940,
                17967
            ],
            [
                17968,
                17985
            ],
            [
                17985,
                17988
            ],
            [
                17988,
                18036
            ],
            [
                18038,
                18044
            ],
            [
                18049,
                18057
            ],
            [
                18057,
                18065
            ],
            [
                18066,
                18087
            ],
            [
                18088,
                18175
            ],
            [
                18175,
                18220
            ],
            [
                18220,
                18240
            ],
            [
                18240,
                18253
            ],
            [
                18253,
                18287
            ],
            [
                18287,
                18295
            ],
            [
                18296,
                18298
            ],
            [
                18299,
                18302
            ],
            [
                18315,
                18378
            ],
            [
                18379,
                18382
            ],
            [
                18387,
                18389
            ],
            [
                18389,
                18422
            ],
            [
                18423,
                18433
            ],
            [
                18434,
                18442
            ],
            [
                18448,
                18475
            ],
            [
                18475,
                18477
            ],
            [
                18477,
                18636
            ],
            [
                18636,
                18648
            ],
            [
                18666,
                18677
            ],
            [
                18686,
                18688
            ],
            [
                18688,
                18744
            ],
            [
                18745,
                18758
            ],
            [
                18759,
                18763
            ],
            [
                18764,
                18781
            ],
            [
                18786,
                18794
            ],
            [
                18795,
                18802
            ],
            [
                18803,
                18854
            ],
            [
                18854,
                18863
            ],
            [
                18864,
                18939
            ],
            [
                18942,
                18985
            ],
            [
                18989,
                18999
            ],
            [
                19006,
                19020
            ],
            [
                19021,
                19024
            ],
            [
                19031,
                19056
            ],
            [
                19056,
                19057
            ],
            [
                19058,
                19091
            ],
            [
                19091,
                19132
            ],
            [
                19132,
                19133
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                78
            ],
            [
                78,
                78
            ],
            [
                78,
                154
            ],
            [
                154,
                297
            ],
            [
                297,
                417
            ],
            [
                417,
                417
            ],
            [
                417,
                417
            ],
            [
                417,
                544
            ],
            [
                544,
                552
            ],
            [
                552,
                573
            ],
            [
                573,
                692
            ],
            [
                692,
                751
            ],
            [
                751,
                769
            ],
            [
                769,
                785
            ],
            [
                785,
                785
            ],
            [
                785,
                791
            ],
            [
                791,
                1071
            ],
            [
                1071,
                1097
            ],
            [
                1097,
                1130
            ],
            [
                1130,
                1151
            ],
            [
                1151,
                1151
            ],
            [
                1151,
                1151
            ],
            [
                1151,
                1207
            ],
            [
                1207,
                1296
            ],
            [
                1296,
                1296
            ],
            [
                1296,
                1296
            ],
            [
                1296,
                1369
            ],
            [
                1369,
                1411
            ],
            [
                1411,
                1411
            ],
            [
                1411,
                1457
            ],
            [
                1457,
                1466
            ],
            [
                1466,
                1473
            ],
            [
                1473,
                1509
            ],
            [
                1509,
                1569
            ],
            [
                1569,
                1581
            ],
            [
                1581,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1776
            ],
            [
                1776,
                1824
            ],
            [
                1824,
                1824
            ],
            [
                1824,
                1964
            ],
            [
                1964,
                2038
            ],
            [
                2038,
                2038
            ],
            [
                2038,
                2100
            ],
            [
                2100,
                2307
            ],
            [
                2307,
                2553
            ],
            [
                2553,
                2627
            ],
            [
                2627,
                2757
            ],
            [
                2757,
                2839
            ],
            [
                2839,
                2903
            ],
            [
                2903,
                2903
            ],
            [
                2903,
                2972
            ],
            [
                2972,
                3235
            ],
            [
                3235,
                3275
            ],
            [
                3275,
                3345
            ],
            [
                3345,
                3345
            ],
            [
                3345,
                3345
            ],
            [
                3345,
                3374
            ],
            [
                3374,
                3392
            ],
            [
                3392,
                3419
            ],
            [
                3419,
                3510
            ],
            [
                3510,
                3559
            ],
            [
                3559,
                3568
            ],
            [
                3568,
                3568
            ],
            [
                3568,
                3638
            ],
            [
                3638,
                3688
            ],
            [
                3688,
                3735
            ],
            [
                3735,
                3797
            ],
            [
                3797,
                4045
            ],
            [
                4045,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4186
            ],
            [
                4186,
                4234
            ],
            [
                4234,
                4263
            ],
            [
                4263,
                4263
            ],
            [
                4263,
                4440
            ],
            [
                4440,
                4440
            ],
            [
                4440,
                4440
            ],
            [
                4440,
                4453
            ],
            [
                4453,
                4527
            ],
            [
                4527,
                4562
            ],
            [
                4562,
                4686
            ],
            [
                4686,
                4802
            ],
            [
                4802,
                4824
            ],
            [
                4824,
                4892
            ],
            [
                4892,
                4951
            ],
            [
                4951,
                4992
            ],
            [
                4992,
                5050
            ],
            [
                5050,
                5136
            ],
            [
                5136,
                5141
            ],
            [
                5141,
                5253
            ],
            [
                5253,
                5309
            ],
            [
                5309,
                5378
            ],
            [
                5378,
                5454
            ],
            [
                5454,
                5477
            ],
            [
                5477,
                5477
            ],
            [
                5477,
                5510
            ],
            [
                5510,
                5537
            ],
            [
                5537,
                5584
            ],
            [
                5584,
                5661
            ],
            [
                5661,
                5723
            ],
            [
                5723,
                5747
            ],
            [
                5747,
                5747
            ],
            [
                5747,
                5814
            ],
            [
                5814,
                5960
            ],
            [
                5960,
                5960
            ],
            [
                5960,
                5960
            ],
            [
                5960,
                5960
            ],
            [
                5960,
                5960
            ],
            [
                5960,
                5960
            ],
            [
                5960,
                6016
            ],
            [
                6016,
                6049
            ],
            [
                6049,
                6124
            ],
            [
                6124,
                6218
            ],
            [
                6218,
                6259
            ],
            [
                6259,
                6265
            ],
            [
                6265,
                6296
            ],
            [
                6296,
                6375
            ],
            [
                6375,
                6472
            ],
            [
                6472,
                6472
            ],
            [
                6472,
                6520
            ],
            [
                6520,
                6606
            ],
            [
                6606,
                6606
            ],
            [
                6606,
                6606
            ],
            [
                6606,
                6734
            ],
            [
                6734,
                6907
            ],
            [
                6907,
                6930
            ],
            [
                6930,
                6969
            ],
            [
                6969,
                6988
            ],
            [
                6988,
                7131
            ],
            [
                7131,
                7229
            ],
            [
                7229,
                7323
            ],
            [
                7323,
                7398
            ],
            [
                7398,
                7433
            ],
            [
                7433,
                7550
            ],
            [
                7550,
                7701
            ],
            [
                7701,
                7825
            ],
            [
                7825,
                7900
            ],
            [
                7900,
                7956
            ],
            [
                7956,
                8029
            ],
            [
                8029,
                8056
            ],
            [
                8056,
                8145
            ],
            [
                8145,
                8145
            ],
            [
                8145,
                8169
            ],
            [
                8169,
                8201
            ],
            [
                8201,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8253
            ],
            [
                8253,
                8286
            ],
            [
                8286,
                8286
            ],
            [
                8286,
                8308
            ],
            [
                8308,
                8308
            ],
            [
                8308,
                8361
            ],
            [
                8361,
                8449
            ],
            [
                8449,
                8467
            ],
            [
                8467,
                8547
            ],
            [
                8547,
                8547
            ],
            [
                8547,
                8547
            ],
            [
                8547,
                8547
            ],
            [
                8547,
                8547
            ],
            [
                8547,
                8547
            ],
            [
                8547,
                8593
            ],
            [
                8593,
                8662
            ],
            [
                8662,
                8662
            ],
            [
                8662,
                8800
            ],
            [
                8800,
                8894
            ],
            [
                8894,
                8906
            ],
            [
                8906,
                8906
            ],
            [
                8906,
                8942
            ],
            [
                8942,
                9044
            ],
            [
                9044,
                9049
            ],
            [
                9049,
                9061
            ],
            [
                9061,
                9061
            ],
            [
                9061,
                9061
            ],
            [
                9061,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9092
            ],
            [
                9092,
                9179
            ],
            [
                9179,
                9179
            ],
            [
                9179,
                9225
            ],
            [
                9225,
                9293
            ],
            [
                9293,
                9293
            ],
            [
                9293,
                9293
            ],
            [
                9293,
                9293
            ],
            [
                9293,
                9379
            ],
            [
                9379,
                9457
            ],
            [
                9457,
                9472
            ],
            [
                9472,
                9500
            ],
            [
                9500,
                9522
            ],
            [
                9522,
                9522
            ],
            [
                9522,
                9596
            ],
            [
                9596,
                9674
            ],
            [
                9674,
                9695
            ],
            [
                9695,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9906
            ],
            [
                9906,
                9969
            ],
            [
                9969,
                10150
            ],
            [
                10150,
                10187
            ],
            [
                10187,
                10187
            ],
            [
                10187,
                10187
            ],
            [
                10187,
                10187
            ],
            [
                10187,
                10195
            ],
            [
                10195,
                10213
            ],
            [
                10213,
                10226
            ],
            [
                10226,
                10231
            ],
            [
                10231,
                10231
            ],
            [
                10231,
                10231
            ],
            [
                10231,
                10282
            ],
            [
                10282,
                10355
            ],
            [
                10355,
                10355
            ],
            [
                10355,
                10439
            ],
            [
                10439,
                10548
            ],
            [
                10548,
                10745
            ],
            [
                10745,
                10745
            ],
            [
                10745,
                10784
            ],
            [
                10784,
                10857
            ],
            [
                10857,
                10892
            ],
            [
                10892,
                10928
            ],
            [
                10928,
                10939
            ],
            [
                10939,
                10951
            ],
            [
                10951,
                11060
            ],
            [
                11060,
                11068
            ],
            [
                11068,
                11094
            ],
            [
                11094,
                11130
            ],
            [
                11130,
                11130
            ],
            [
                11130,
                11215
            ],
            [
                11215,
                11313
            ],
            [
                11313,
                11313
            ],
            [
                11313,
                11313
            ],
            [
                11313,
                11313
            ],
            [
                11313,
                11313
            ],
            [
                11313,
                11379
            ],
            [
                11379,
                11398
            ],
            [
                11398,
                11467
            ],
            [
                11467,
                11506
            ],
            [
                11506,
                11522
            ],
            [
                11522,
                11540
            ],
            [
                11540,
                11557
            ],
            [
                11557,
                11575
            ],
            [
                11575,
                11621
            ],
            [
                11621,
                11621
            ],
            [
                11621,
                11640
            ],
            [
                11640,
                11661
            ],
            [
                11661,
                11719
            ],
            [
                11719,
                11719
            ],
            [
                11719,
                11719
            ],
            [
                11719,
                11744
            ],
            [
                11744,
                11744
            ],
            [
                11744,
                11776
            ],
            [
                11776,
                11807
            ],
            [
                11807,
                11821
            ],
            [
                11821,
                11993
            ],
            [
                11993,
                12055
            ],
            [
                12055,
                12175
            ],
            [
                12175,
                12230
            ],
            [
                12230,
                12270
            ],
            [
                12270,
                12369
            ],
            [
                12369,
                12449
            ],
            [
                12449,
                12531
            ],
            [
                12531,
                12707
            ],
            [
                12707,
                12843
            ],
            [
                12843,
                12938
            ],
            [
                12938,
                13025
            ],
            [
                13025,
                13094
            ],
            [
                13094,
                13184
            ],
            [
                13184,
                13252
            ],
            [
                13252,
                13335
            ],
            [
                13335,
                13346
            ],
            [
                13346,
                13361
            ],
            [
                13361,
                13361
            ],
            [
                13361,
                13409
            ],
            [
                13409,
                13446
            ],
            [
                13446,
                13472
            ],
            [
                13472,
                13545
            ],
            [
                13545,
                13601
            ],
            [
                13601,
                13643
            ],
            [
                13643,
                13670
            ],
            [
                13670,
                13692
            ],
            [
                13692,
                13727
            ],
            [
                13727,
                13804
            ],
            [
                13804,
                13913
            ],
            [
                13913,
                13952
            ],
            [
                13952,
                13973
            ],
            [
                13973,
                13973
            ],
            [
                13973,
                13995
            ],
            [
                13995,
                14111
            ],
            [
                14111,
                14180
            ],
            [
                14180,
                14204
            ],
            [
                14204,
                14289
            ],
            [
                14289,
                14325
            ],
            [
                14325,
                14382
            ],
            [
                14382,
                14456
            ],
            [
                14456,
                14456
            ],
            [
                14456,
                14521
            ],
            [
                14521,
                14533
            ],
            [
                14533,
                14574
            ],
            [
                14574,
                14657
            ],
            [
                14657,
                14669
            ],
            [
                14669,
                14727
            ],
            [
                14727,
                14727
            ],
            [
                14727,
                14727
            ],
            [
                14727,
                14768
            ],
            [
                14768,
                14895
            ],
            [
                14895,
                14947
            ],
            [
                14947,
                14947
            ],
            [
                14947,
                14997
            ],
            [
                14997,
                15115
            ],
            [
                15115,
                15199
            ],
            [
                15199,
                15205
            ],
            [
                15205,
                15231
            ],
            [
                15231,
                15231
            ],
            [
                15231,
                15372
            ],
            [
                15372,
                15459
            ],
            [
                15459,
                15527
            ],
            [
                15527,
                15527
            ],
            [
                15527,
                15583
            ],
            [
                15583,
                15675
            ],
            [
                15675,
                15699
            ],
            [
                15699,
                15726
            ],
            [
                15726,
                15849
            ],
            [
                15849,
                15907
            ],
            [
                15907,
                15924
            ],
            [
                15924,
                15991
            ],
            [
                15991,
                16259
            ],
            [
                16259,
                16259
            ],
            [
                16259,
                16278
            ],
            [
                16278,
                16339
            ],
            [
                16339,
                16514
            ],
            [
                16514,
                16625
            ],
            [
                16625,
                16667
            ],
            [
                16667,
                16698
            ],
            [
                16698,
                16816
            ],
            [
                16816,
                16886
            ],
            [
                16886,
                16907
            ],
            [
                16907,
                16967
            ],
            [
                16967,
                17061
            ],
            [
                17061,
                17115
            ],
            [
                17115,
                17334
            ],
            [
                17334,
                17334
            ],
            [
                17334,
                17368
            ],
            [
                17368,
                17515
            ],
            [
                17515,
                17618
            ],
            [
                17618,
                17666
            ],
            [
                17666,
                17681
            ],
            [
                17681,
                17729
            ],
            [
                17729,
                17748
            ],
            [
                17748,
                17755
            ],
            [
                17755,
                17797
            ],
            [
                17797,
                17797
            ],
            [
                17797,
                17797
            ],
            [
                17797,
                17844
            ],
            [
                17844,
                17844
            ],
            [
                17844,
                17844
            ],
            [
                17844,
                17844
            ],
            [
                17844,
                17844
            ],
            [
                17844,
                17988
            ],
            [
                17988,
                18057
            ],
            [
                18057,
                18175
            ],
            [
                18175,
                18220
            ],
            [
                18220,
                18240
            ],
            [
                18240,
                18253
            ],
            [
                18253,
                18287
            ],
            [
                18287,
                18389
            ],
            [
                18389,
                18477
            ],
            [
                18477,
                18636
            ],
            [
                18636,
                18688
            ],
            [
                18688,
                18854
            ],
            [
                18854,
                18989
            ],
            [
                18989,
                18989
            ],
            [
                18989,
                19133
            ]
        ]
    }
}