{
    "original": {
        "text": "I lay ill through several weeks, and the usual tenor of my life became like an old remembrance. But this was not the effect of time so much as of the change in all my habits made by the helplessness and inaction of a sick-room. Before I had been confined to it many days, everything else seemed to have retired into a remote distance where there was little or no separation between the various stages of my life which had been really divided by years. In falling ill, I seemed to have crossed a dark lake and to have left all my experiences, mingled together by the great distance, on the healthy shore.\nMy housekeeping duties, though at first it caused me great anxiety to think that they were unperformed, were soon as far off as the oldest of the old duties at Greenleaf or the summer afternoons when I went home from school with my portfolio under my arm, and my childish shadow at my side, to my godmother's house. I had never known before how short life really was and into how small a space the mind could put it.\nWhile I was very ill, the way in which these divisions of time became confused with one another distressed my mind exceedingly. At once a child, an elder girl, and the little woman I had been so happy as, I was not only oppressed by cares and difficulties adapted to each station, but by the great perplexity of endlessly trying to reconcile them. I suppose that few who have not been in such a condition can quite understand what I mean or what painful unrest arose from this source.\nFor the same reason I am almost afraid to hint at that time in my disorder--it seemed one long night, but I believe there were both nights and days in it--when I laboured up colossal staircases, ever striving to reach the top, and ever turned, as I have seen a worm in a garden path, by some obstruction, and labouring again. I knew perfectly at intervals, and I think vaguely at most times, that I was in my bed; and I talked with Charley, and felt her touch, and knew her very well; yet I would find myself complaining, \"Oh, more of these never-ending stairs, Charley--more and more--piled up to the sky', I think!\" and labouring on again.\nDare I hint at that worse time when, strung together somewhere in great black space, there was a flaming necklace, or ring, or starry circle of some kind, of which I was one of the beads! And when my only prayer was to be taken off from the rest and when it was such inexplicable agony and misery to be a part of the dreadful thing?\nPerhaps the less I say of these sick experiences, the less tedious and the more intelligible I shall be. I do not recall them to make others unhappy or because I am now the least unhappy in remembering them. It may be that if we knew more of such strange afflictions we might be the better able to alleviate their intensity.\nThe repose that succeeded, the long delicious sleep, the blissful rest, when in my weakness I was too calm to have any care for myself and could have heard (or so I think now) that I was dying, with no other emotion than with a pitying love for those I left behind--this state can be perhaps more widely understood. I was in this state when I first shrunk from the light as it twinkled on me once more, and knew with a boundless joy for which no words are rapturous enough that I should see again.\nI had heard my Ada crying at the door, day and night; I had heard her calling to me that I was cruel and did not love her; I had heard her praying and imploring to be let in to nurse and comfort me and to leave my bedside no more; but I had only said, when I could speak, \"Never, my sweet girl, never!\" and I had over and over again reminded Charley that she was to keep my darling from the room whether I lived or died. Charley had been true to me in that time of need, and with her little hand and her great heart had kept the door fast.\nBut now, my sight strengthening and the glorious light coming every day more fully and brightly on me, I could read the letters that my dear wrote to me every morning and evening and could put them to my lips and lay my cheek upon them with no fear of hurting her. I could see my little maid, so tender and so careful, going about the two rooms setting everything in order and speaking cheerfully to Ada from the open window again. I could understand the stillness in the house and the thoughtfulness it expressed on the part of all those who had always been so good to me. I could weep in the exquisite felicity of my heart and be as happy in my weakness as ever I had been in my strength.\nBy and by my strength began to be restored. Instead of lying, with so strange a calmness, watching what was done for me, as if it were done for some one else whom I was quietly sorry for, I helped it a little, and so on to a little more and much more, until I became useful to myself, and interested, and attached to life again.\nHow well I remember the pleasant afternoon when I was raised in bed with pillows for the first time to enjoy a great tea-drinking with Charley! The little creature--sent into the world, surely, to minister to the weak and sick--was so happy, and so busy, and stopped so often in her preparations to lay her head upon my bosom, and fondle me, and cry with joyful tears she was so glad, she was so glad, that I was obliged to say, \"Charley, if you go on in this way, I must lie down again, my darling, for I am weaker than I thought I was!\" So Charley became as quiet as a mouse and took her bright face here and there across and across the two rooms, out of the shade into the divine sunshine, and out of the sunshine into the shade, while I watched her peacefully. When all her preparations were concluded and the pretty tea-table with its little delicacies to tempt me, and its white cloth, and its flowers, and everything so lovingly and beautifully arranged for me by Ada downstairs, was ready at the bedside, I felt sure I was steady enough to say something to Charley that was not new to my thoughts.\nFirst I complimented Charley on the room, and indeed it was so fresh and airy, so spotless and neat, that I could scarce believe I had been lying there so long. This delighted Charley, and her face was brighter than before.\n\"Yet, Charley,\" said I, looking round, \"I miss something, surely, that I am accustomed to?\"\nPoor little Charley looked round too and pretended to shake her head as if there were nothing absent.\n\"Are the pictures all as they used to be?\" I asked her.\n\"Every one of them, miss,\" said Charley.\n\"And the furniture, Charley?\"\n\"Except where I have moved it about to make more room, miss.\"\n\"And yet,\" said I, \"I miss some familiar object. Ah, I know what it is, Charley! It's the looking-glass.\"\nCharley got up from the table, making as if she had forgotten something, and went into the next room; and I heard her sob there.\nI had thought of this very often. I was now certain of it. I could thank God that it was not a shock to me now. I called Charley back, and when she came--at first pretending to smile, but as she drew nearer to me, looking grieved--I took her in my arms and said, \"It matters very little, Charley. I hope I can do without my old face very well.\"\nI was presently so far advanced as to be able to sit up in a great chair and even giddily to walk into the adjoining room, leaning on Charley. The mirror was gone from its usual place in that room too, but what I had to bear was none the harder to bear for that.\nMy guardian had throughout been earnest to visit me, and there was now no good reason why I should deny myself that happiness. He came one morning, and when he first came in, could only hold me in his embrace and say, \"My dear, dear girl!\" I had long known--who could know better?--what a deep fountain of affection and generosity his heart was; and was it not worth my trivial suffering and change to fill such a place in it? \"Oh, yes!\" I thought. \"He has seen me, and he loves me better than he did; he has seen me and is even fonder of me than he was before; and what have I to mourn for!\"\nHe sat down by me on the sofa, supporting me with his arm. For a little while he sat with his hand over his face, but when he removed it, fell into his usual manner. There never can have been, there never can be, a pleasanter manner.\n\"My little woman,\" said he, \"what a sad time this has been. Such an inflexible little woman, too, through all!\"\n\"Only for the best, guardian,\" said I.\n\"For the best?\" he repeated tenderly. \"Of course, for the best. But here have Ada and I been perfectly forlorn and miserable; here has your friend Caddy been coming and going late and early; here has every one about the house been utterly lost and dejected; here has even poor Rick been writing--to ME too--in his anxiety for you!\"\nI had read of Caddy in Ada's letters, but not of Richard. I told him so.\n\"Why, no, my dear,\" he replied. \"I have thought it better not to mention it to her.\"\n\"And you speak of his writing to YOU,\" said I, repeating his emphasis. \"As if it were not natural for him to do so, guardian; as if he could write to a better friend!\"\n\"He thinks he could, my love,\" returned my guardian, \"and to many a better. The truth is, he wrote to me under a sort of protest while unable to write to you with any hope of an answer--wrote coldly, haughtily, distantly, resentfully. Well, dearest little woman, we must look forbearingly on it. He is not to blame. Jarndyce and Jarndyce has warped him out of himself and perverted me in his eyes. I have known it do as bad deeds, and worse, many a time. If two angels could be concerned in it, I believe it would change their nature.\"\n\"It has not changed yours, guardian.\"\n\"Oh, yes, it has, my dear,\" he said laughingly. \"It has made the south wind easterly, I don't know how often. Rick mistrusts and suspects me--goes to lawyers, and is taught to mistrust and suspect me. Hears I have conflicting interests, claims clashing against his and what not. Whereas, heaven knows that if I could get out of the mountains of wiglomeration on which my unfortunate name has been so long bestowed (which I can't) or could level them by the extinction of my own original right (which I can't either, and no human power ever can, anyhow, I believe, to such a pass have we got), I would do it this hour. I would rather restore to poor Rick his proper nature than be endowed with all the money that dead suitors, broken, heart and soul, upon the wheel of Chancery, have left unclaimed with the Accountant-General--and that's money enough, my dear, to be cast into a pyramid, in memory of Chancery's transcendent wickedness.\"\n\"IS it possible, guardian,\" I asked, amazed, \"that Richard can be suspicious of you?\"\n\"Ah, my love, my love,\" he said, \"it is in the subtle poison of such abuses to breed such diseases. His blood is infected, and objects lose their natural aspects in his sight. It is not HIS fault.\"\n\"But it is a terrible misfortune, guardian.\"\n\"It is a terrible misfortune, little woman, to be ever drawn within the influences of Jarndyce and Jarndyce. I know none greater. By little and little he has been induced to trust in that rotten reed, and it communicates some portion of its rottenness to everything around him. But again I say with all my soul, we must be patient with poor Rick and not blame him. What a troop of fine fresh hearts like his have I seen in my time turned by the same means!\"\nI could not help expressing something of my wonder and regret that his benevolent, disinterested intentions had prospered so little.\n\"We must not say so, Dame Durden,\" he cheerfully replied; \"Ada is the happier, I hope, and that is much. I did think that I and both these young creatures might be friends instead of distrustful foes and that we might so far counter-act the suit and prove too strong for it. But it was too much to expect. Jarndyce and Jarndyce was the curtain of Rick's cradle.\"\n\"But, guardian, may we not hope that a little experience will teach him what a false and wretched thing it is?\"\n\"We WILL hope so, my Esther,\" said Mr. Jarndyce, \"and that it may not teach him so too late. In any case we must not be hard on him. There are not many grown and matured men living while we speak, good men too, who if they were thrown into this same court as suitors would not be vitally changed and depreciated within three years--within two--within one. How can we stand amazed at poor Rick? A young man so unfortunate,\" here he fell into a lower tone, as if he were thinking aloud, \"cannot at first believe (who could?) that Chancery is what it is. He looks to it, flushed and fitfully, to do something with his interests and bring them to some settlement. It procrastinates, disappoints, tries, tortures him; wears out his sanguine hopes and patience, thread by thread; but he still looks to it, and hankers after it, and finds his whole world treacherous and hollow. Well, well, well! Enough of this, my dear!\"\nHe had supported me, as at first, all this time, and his tenderness was so precious to me that I leaned my head upon his shoulder and loved him as if he had been my father. I resolved in my own mind in this little pause, by some means, to see Richard when I grew strong and try to set him right.\n\"There are better subjects than these,\" said my guardian, \"for such a joyful time as the time of our dear girl's recovery. And I had a commission to broach one of them as soon as I should begin to talk. When shall Ada come to see you, my love?\"\nI had been thinking of that too. A little in connexion with the absent mirrors, but not much, for I knew my loving girl would be changed by no change in my looks.\n\"Dear guardian,\" said I, \"as I have shut her out so long--though indeed, indeed, she is like the light to me--\"\n\"I know it well, Dame Durden, well.\"\nHe was so good, his touch expressed such endearing compassion and affection, and the tone of his voice carried such comfort into my heart that I stopped for a little while, quite unable to go on. \"Yes, yes, you are tired,\" said he. \"Rest a little.\"\n\"As I have kept Ada out so long,\" I began afresh after a short while, \"I think I should like to have my own way a little longer, guardian. It would be best to be away from here before I see her. If Charley and I were to go to some country lodging as soon as I can move, and if I had a week there in which to grow stronger and to be revived by the sweet air and to look forward to the happiness of having Ada with me again, I think it would be better for us.\"\nI hope it was not a poor thing in me to wish to be a little more used to my altered self before I met the eyes of the dear girl I longed so ardently to see, but it is the truth. I did. He understood me, I was sure; but I was not afraid of that. If it were a poor thing, I knew he would pass it over.\n\"Our spoilt little woman,\" said my guardian, \"shall have her own way even in her inflexibility, though at the price, I know, of tears downstairs. And see here! Here is Boythorn, heart of chivalry, breathing such ferocious vows as never were breathed on paper before, that if you don't go and occupy his whole house, he having already turned out of it expressly for that purpose, by heaven and by earth he'll pull it down and not leave one brick standing on another!\"\nAnd my guardian put a letter in my hand, without any ordinary beginning such as \"My dear Jarndyce,\" but rushing at once into the words, \"I swear if Miss Summerson do not come down and take possession of my house, which I vacate for her this day at one o'clock, P.M.,\" and then with the utmost seriousness, and in the most emphatic terms, going on to make the extraordinary declaration he had quoted. We did not appreciate the writer the less for laughing heartily over it, and we settled that I should send him a letter of thanks on the morrow and accept his offer. It was a most agreeable one to me, for all the places I could have thought of, I should have liked to go to none so well as Chesney Wold.\n\"Now, little housewife,\" said my guardian, looking at his watch, \"I was strictly timed before I came upstairs, for you must not be tired too soon; and my time has waned away to the last minute. I have one other petition. Little Miss Flite, hearing a rumour that you were ill, made nothing of walking down here--twenty miles, poor soul, in a pair of dancing shoes--to inquire. It was heaven's mercy we were at home, or she would have walked back again.\"\nThe old conspiracy to make me happy! Everybody seemed to be in it!\n\"Now, pet,\" said my guardian, \"if it would not be irksome to you to admit the harmless little creature one afternoon before you save Boythorn's otherwise devoted house from demolition, I believe you would make her prouder and better pleased with herself than I--though my eminent name is Jarndyce--could do in a lifetime.\"\nI have no doubt he knew there would be something in the simple image of the poor afflicted creature that would fall like a gentle lesson on my mind at that time. I felt it as he spoke to me. I could not tell him heartily enough how ready I was to receive her. I had always pitied her, never so much as now. I had always been glad of my little power to soothe her under her calamity, but never, never, half so glad before.\nWe arranged a time for Miss Flite to come out by the coach and share my early dinner. When my guardian left me, I turned my face away upon my couch and prayed to be forgiven if I, surrounded by such blessings, had magnified to myself the little trial that I had to undergo. The childish prayer of that old birthday when I had aspired to be industrious, contented, and true-hearted and to do good to some one and win some love to myself if I could came back into my mind with a reproachful sense of all the happiness I had since enjoyed and all the affectionate hearts that had been turned towards me. If I were weak now, what had I profited by those mercies? I repeated the old childish prayer in its old childish words and found that its old peace had not departed from it.\nMy guardian now came every day. In a week or so more I could walk about our rooms and hold long talks with Ada from behind the window-curtain. Yet I never saw her, for I had not as yet the courage to look at the dear face, though I could have done so easily without her seeing me.\nOn the appointed day Miss Flite arrived. The poor little creature ran into my room quite forgetful of her usual dignity, and crying from her very heart of hearts, \"My dear Fitz Jarndyce!\" fell upon my neck and kissed me twenty times.\n\"Dear me!\" said she, putting her hand into her reticule, \"I have nothing here but documents, my dear Fitz Jarndyce; I must borrow a pocket handkerchief.\"\nCharley gave her one, and the good creature certainly made use of it, for she held it to her eyes with both hands and sat so, shedding tears for the next ten minutes.\n\"With pleasure, my dear Fitz Jarndyce,\" she was careful to explain. \"Not the least pain. Pleasure to see you well again. Pleasure at having the honour of being admitted to see you. I am so much fonder of you, my love, than of the Chancellor. Though I DO attend court regularly. By the by, my dear, mentioning pocket handkerchiefs--\"\nMiss Flite here looked at Charley, who had been to meet her at the place where the coach stopped. Charley glanced at me and looked unwilling to pursue the suggestion.\n\"Ve-ry right!\" said Miss Flite, \"Ve-ry correct. Truly! Highly indiscreet of me to mention it; but my dear Miss Fitz Jarndyce, I am afraid I am at times (between ourselves, you wouldn't think it) a little--rambling you know,\" said Miss Flite, touching her forehead. \"Nothing more.\"\n\"What were you going to tell me?\" said I, smiling, for I saw she wanted to go on. \"You have roused my curiosity, and now you must gratify it.\"\nMiss Flite looked at Charley for advice in this important crisis, who said, \"If you please, ma'am, you had better tell then,\" and therein gratified Miss Flite beyond measure.\n\"So sagacious, our young friend,\" said she to me in her mysterious way. \"Diminutive. But ve-ry sagacious! Well, my dear, it's a pretty anecdote. Nothing more. Still I think it charming. Who should follow us down the road from the coach, my dear, but a poor person in a very ungenteel bonnet--\"\n\"Jenny, if you please, miss,\" said Charley.\n\"Just so!\" Miss Flite acquiesced with the greatest suavity. \"Jenny. Ye-es! And what does she tell our young friend but that there has been a lady with a veil inquiring at her cottage after my dear Fitz Jarndyce's health and taking a handkerchief away with her as a little keepsake merely because it was my amiable Fitz Jarndyce's! Now, you know, so very prepossessing in the lady with the veil!\"\n\"If you please, miss,\" said Charley, to whom I looked in some astonishment, \"Jenny says that when her baby died, you left a handkerchief there, and that she put it away and kept it with the baby's little things. I think, if you please, partly because it was yours, miss, and partly because it had covered the baby.\"\n\"Diminutive,\" whispered Miss Flite, making a variety of motions about her own forehead to express intellect in Charley. \"But exceedingly sagacious! And so dear! My love, she's clearer than any counsel I ever heard!\"\n\"Yes, Charley,\" I returned. \"I remember it. Well?\"\n\"Well, miss,\" said Charley, \"and that's the handkerchief the lady took. And Jenny wants you to know that she wouldn't have made away with it herself for a heap of money but that the lady took it and left some money instead. Jenny don't know her at all, if you please, miss!\"\n\"Why, who can she be?\" said I.\n\"My love,\" Miss Flite suggested, advancing her lips to my ear with her most mysterious look, \"in MY opinion--don't mention this to our diminutive friend--she's the Lord Chancellor's wife. He's married, you know. And I understand she leads him a terrible life. Throws his lordship's papers into the fire, my dear, if he won't pay the jeweller!\"\nI did not think very much about this lady then, for I had an impression that it might be Caddy. Besides, my attention was diverted by my visitor, who was cold after her ride and looked hungry and who, our dinner being brought in, required some little assistance in arraying herself with great satisfaction in a pitiable old scarf and a much-worn and often-mended pair of gloves, which she had brought down in a paper parcel. I had to preside, too, over the entertainment, consisting of a dish of fish, a roast fowl, a sweetbread, vegetables, pudding, and Madeira; and it was so pleasant to see how she enjoyed it, and with what state and ceremony she did honour to it, that I was soon thinking of nothing else.\nWhen we had finished and had our little dessert before us, embellished by the hands of my dear, who would yield the superintendence of everything prepared for me to no one, Miss Flite was so very chatty and happy that I thought I would lead her to her own history, as she was always pleased to talk about herself. I began by saying \"You have attended on the Lord Chancellor many years, Miss Flite?\"\n\"Oh, many, many, many years, my dear. But I expect a judgment. Shortly.\"\nThere was an anxiety even in her hopefulness that made me doubtful if I had done right in approaching the subject. I thought I would say no more about it.\n\"My father expected a judgment,\" said Miss Flite. \"My brother. My sister. They all expected a judgment. The same that I expect.\"\n\"They are all--\"\n\"Ye-es. Dead of course, my dear,\" said she.\nAs I saw she would go on, I thought it best to try to be serviceable to her by meeting the theme rather than avoiding it.\n\"Would it not be wiser,\" said I, \"to expect this judgment no more?\"\n\"Why, my dear,\" she answered promptly, \"of course it would!\"\n\"And to attend the court no more?\"\n\"Equally of course,\" said she. \"Very wearing to be always in expectation of what never comes, my dear Fitz Jarndyce! Wearing, I assure you, to the bone!\"\nShe slightly showed me her arm, and it was fearfully thin indeed.\n\"But, my dear,\" she went on in her mysterious way, \"there's a dreadful attraction in the place. Hush! Don't mention it to our diminutive friend when she comes in. Or it may frighten her. With good reason. There's a cruel attraction in the place. You CAN'T leave it. And you MUST expect.\"\nI tried to assure her that this was not so. She heard me patiently and smilingly, but was ready with her own answer.\n\"Aye, aye, aye! You think so because I am a little rambling. Ve-ry absurd, to be a little rambling, is it not? Ve-ry confusing, too. To the head. I find it so. But, my dear, I have been there many years, and I have noticed. It's the mace and seal upon the table.\"\nWhat could they do, did she think? I mildly asked her.\n\"Draw,\" returned Miss Flite. \"Draw people on, my dear. Draw peace out of them. Sense out of them. Good looks out of them. Good qualities out of them. I have felt them even drawing my rest away in the night. Cold and glittering devils!\"\nShe tapped me several times upon the arm and nodded good-humouredly as if she were anxious I should understand that I had no cause to fear her, though she spoke so gloomily, and confided these awful secrets to me.\n\"Let me see,\" said she. \"I'll tell you my own case. Before they ever drew me--before I had ever seen them--what was it I used to do? Tambourine playing? No. Tambour work. I and my sister worked at tambour work. Our father and our brother had a builder's business. We all lived together. Ve-ry respectably, my dear! First, our father was drawn--slowly. Home was drawn with him. In a few years he was a fierce, sour, angry bankrupt without a kind word or a kind look for any one. He had been so different, Fitz Jarndyce. He was drawn to a debtors' prison. There he died. Then our brother was drawn--swiftly--to drunkenness. And rags. And death. Then my sister was drawn. Hush! Never ask to what! Then I was ill and in misery, and heard, as I had often heard before, that this was all the work of Chancery. When I got better, I went to look at the monster. And then I found out how it was, and I was drawn to stay there.\"\nHaving got over her own short narrative, in the delivery of which she had spoken in a low, strained voice, as if the shock were fresh upon her, she gradually resumed her usual air of amiable importance.\n\"You don't quite credit me, my dear! Well, well! You will, some day. I am a little rambling. But I have noticed. I have seen many new faces come, unsuspicious, within the influence of the mace and seal in these many years. As my father's came there. As my brother's. As my sister's. As my own. I hear Conversation Kenge and the rest of them say to the new faces, 'Here's little Miss Flite. Oh, you are new here; and you must come and be presented to little Miss Flite!' Ve-ry good. Proud I am sure to have the honour! And we all laugh. But, Fitz Jarndyce, I know what will happen. I know, far better than they do, when the attraction has begun. I know the signs, my dear. I saw them begin in Gridley. And I saw them end. Fitz Jarndyce, my love,\" speaking low again, \"I saw them beginning in our friend the ward in Jarndyce. Let some one hold him back. Or he'll be drawn to ruin.\"\nShe looked at me in silence for some moments, with her face gradually softening into a smile. Seeming to fear that she had been too gloomy, and seeming also to lose the connexion in her mind, she said politely as she sipped her glass of wine, \"Yes, my dear, as I was saying, I expect a judgment shortly. Then I shall release my birds, you know, and confer estates.\"\nI was much impressed by her allusion to Richard and by the sad meaning, so sadly illustrated in her poor pinched form, that made its way through all her incoherence. But happily for her, she was quite complacent again now and beamed with nods and smiles.\n\"But, my dear,\" she said, gaily, reaching another hand to put it upon mine. \"You have not congratulated me on my physician. Positively not once, yet!\"\nI was obliged to confess that I did not quite know what she meant.\n\"My physician, Mr. Woodcourt, my dear, who was so exceedingly attentive to me. Though his services were rendered quite gratuitously. Until the Day of Judgment. I mean THE judgment that will dissolve the spell upon me of the mace and seal.\"\n\"Mr. Woodcourt is so far away, now,\" said I, \"that I thought the time for such congratulation was past, Miss Flite.\"\n\"But, my child,\" she returned, \"is it possible that you don't know what has happened?\"\n\"No,\" said I.\n\"Not what everybody has been talking of, my beloved Fitz Jarndyce!\"\n\"No,\" said I. \"You forget how long I have been here.\"\n\"True! My dear, for the moment--true. I blame myself. But my memory has been drawn out of me, with everything else, by what I mentioned. Ve-ry strong influence, is it not? Well, my dear, there has been a terrible shipwreck over in those East Indian seas.\"\n\"Mr. Woodcourt shipwrecked!\"\n\"Don't be agitated, my dear. He is safe. An awful scene. Death in all shapes. Hundreds of dead and dying. Fire, storm, and darkness. Numbers of the drowning thrown upon a rock. There, and through it all, my dear physician was a hero. Calm and brave through everything. Saved many lives, never complained in hunger and thirst, wrapped naked people in his spare clothes, took the lead, showed them what to do, governed them, tended the sick, buried the dead, and brought the poor survivors safely off at last! My dear, the poor emaciated creatures all but worshipped him. They fell down at his feet when they got to the land and blessed him. The whole country rings with it. Stay! Where's my bag of documents? I have got it there, and you shall read it, you shall read it!\"\nAnd I DID read all the noble history, though very slowly and imperfectly then, for my eyes were so dimmed that I could not see the words, and I cried so much that I was many times obliged to lay down the long account she had cut out of the newspaper. I felt so triumphant ever to have known the man who had done such generous and gallant deeds, I felt such glowing exultation in his renown, I so admired and loved what he had done, that I envied the storm-worn people who had fallen at his feet and blessed him as their preserver. I could myself have kneeled down then, so far away, and blessed him in my rapture that he should be so truly good and brave. I felt that no one--mother, sister, wife--could honour him more than I. I did, indeed!\nMy poor little visitor made me a present of the account, and when as the evening began to close in she rose to take her leave, lest she should miss the coach by which she was to return, she was still full of the shipwreck, which I had not yet sufficiently composed myself to understand in all its details.\n\"My dear,\" said she as she carefully folded up her scarf and gloves, \"my brave physician ought to have a title bestowed upon him. And no doubt he will. You are of that opinion?\"\nThat he well deserved one, yes. That he would ever have one, no.\n\"Why not, Fitz Jarndyce?\" she asked rather sharply.\nI said it was not the custom in England to confer titles on men distinguished by peaceful services, however good and great, unless occasionally when they consisted of the accumulation of some very large amount of money.\n\"Why, good gracious,\" said Miss Flite, \"how can you say that? Surely you know, my dear, that all the greatest ornaments of England in knowledge, imagination, active humanity, and improvement of every sort are added to its nobility! Look round you, my dear, and consider. YOU must be rambling a little now, I think, if you don't know that this is the great reason why titles will always last in the land!\"\nI am afraid she believed what she said, for there were moments when she was very mad indeed.\nAnd now I must part with the little secret I have thus far tried to keep. I had thought, sometimes, that Mr. Woodcourt loved me and that if he had been richer he would perhaps have told me that he loved me before he went away. I had thought, sometimes, that if he had done so, I should have been glad of it. But how much better it was now that this had never happened! What should I have suffered if I had had to write to him and tell him that the poor face he had known as mine was quite gone from me and that I freely released him from his bondage to one whom he had never seen!\nOh, it was so much better as it was! With a great pang mercifully spared me, I could take back to my heart my childish prayer to be all he had so brightly shown himself; and there was nothing to be undone: no chain for me to break or for him to drag; and I could go, please God, my lowly way along the path of duty, and he could go his nobler way upon its broader road; and though we were apart upon the journey, I might aspire to meet him, unselfishly, innocently, better far than he had thought me when I found some favour in his eyes, at the journey's end.",
        "paragraph_chars": [
            [
                0,
                604
            ],
            [
                604,
                1021
            ],
            [
                1021,
                1506
            ],
            [
                1506,
                2148
            ],
            [
                2148,
                2481
            ],
            [
                2481,
                2806
            ],
            [
                2806,
                3304
            ],
            [
                3304,
                3844
            ],
            [
                3844,
                4535
            ],
            [
                4535,
                4864
            ],
            [
                4864,
                5970
            ],
            [
                5970,
                6194
            ],
            [
                6194,
                6286
            ],
            [
                6286,
                6388
            ],
            [
                6388,
                6444
            ],
            [
                6444,
                6485
            ],
            [
                6485,
                6515
            ],
            [
                6515,
                6577
            ],
            [
                6577,
                6683
            ],
            [
                6683,
                6812
            ],
            [
                6812,
                7157
            ],
            [
                7157,
                7420
            ],
            [
                7420,
                8013
            ],
            [
                8013,
                8247
            ],
            [
                8247,
                8359
            ],
            [
                8359,
                8398
            ],
            [
                8398,
                8730
            ],
            [
                8730,
                8803
            ],
            [
                8803,
                8888
            ],
            [
                8888,
                9056
            ],
            [
                9056,
                9592
            ],
            [
                9592,
                9630
            ],
            [
                9630,
                10568
            ],
            [
                10568,
                10654
            ],
            [
                10654,
                10852
            ],
            [
                10852,
                10897
            ],
            [
                10897,
                11355
            ],
            [
                11355,
                11488
            ],
            [
                11488,
                11851
            ],
            [
                11851,
                11963
            ],
            [
                11963,
                12879
            ],
            [
                12879,
                13175
            ],
            [
                13175,
                13420
            ],
            [
                13420,
                13583
            ],
            [
                13583,
                13695
            ],
            [
                13695,
                13732
            ],
            [
                13732,
                13981
            ],
            [
                13981,
                14440
            ],
            [
                14440,
                14740
            ],
            [
                14740,
                15207
            ],
            [
                15207,
                15911
            ],
            [
                15911,
                16364
            ],
            [
                16364,
                16431
            ],
            [
                16431,
                16754
            ],
            [
                16754,
                17176
            ],
            [
                17176,
                17951
            ],
            [
                17951,
                18232
            ],
            [
                18232,
                18466
            ],
            [
                18466,
                18620
            ],
            [
                18620,
                18787
            ],
            [
                18787,
                19120
            ],
            [
                19120,
                19287
            ],
            [
                19287,
                19568
            ],
            [
                19568,
                19711
            ],
            [
                19711,
                19886
            ],
            [
                19886,
                20180
            ],
            [
                20180,
                20224
            ],
            [
                20224,
                20620
            ],
            [
                20620,
                20936
            ],
            [
                20936,
                21152
            ],
            [
                21152,
                21203
            ],
            [
                21203,
                21478
            ],
            [
                21478,
                21509
            ],
            [
                21509,
                21853
            ],
            [
                21853,
                22564
            ],
            [
                22564,
                22963
            ],
            [
                22963,
                23036
            ],
            [
                23036,
                23191
            ],
            [
                23191,
                23320
            ],
            [
                23320,
                23337
            ],
            [
                23337,
                23381
            ],
            [
                23381,
                23503
            ],
            [
                23503,
                23571
            ],
            [
                23571,
                23632
            ],
            [
                23632,
                23667
            ],
            [
                23667,
                23821
            ],
            [
                23821,
                23887
            ],
            [
                23887,
                24175
            ],
            [
                24175,
                24292
            ],
            [
                24292,
                24556
            ],
            [
                24556,
                24611
            ],
            [
                24611,
                24847
            ],
            [
                24847,
                25061
            ],
            [
                25061,
                25980
            ],
            [
                25980,
                26183
            ],
            [
                26183,
                27063
            ],
            [
                27063,
                27429
            ],
            [
                27429,
                27684
            ],
            [
                27684,
                27835
            ],
            [
                27835,
                27902
            ],
            [
                27902,
                28142
            ],
            [
                28142,
                28259
            ],
            [
                28259,
                28346
            ],
            [
                28346,
                28360
            ],
            [
                28360,
                28428
            ],
            [
                28428,
                28482
            ],
            [
                28482,
                28738
            ],
            [
                28738,
                28767
            ],
            [
                28767,
                29539
            ],
            [
                29539,
                30282
            ],
            [
                30282,
                30588
            ],
            [
                30588,
                30766
            ],
            [
                30766,
                30831
            ],
            [
                30831,
                30883
            ],
            [
                30883,
                31103
            ],
            [
                31103,
                31508
            ],
            [
                31508,
                31601
            ],
            [
                31601,
                32182
            ],
            [
                32182,
                32741
            ]
        ],
        "segment_chars": [
            [
                0,
                96
            ],
            [
                96,
                228
            ],
            [
                228,
                452
            ],
            [
                452,
                604
            ],
            [
                604,
                920
            ],
            [
                920,
                1021
            ],
            [
                1021,
                1149
            ],
            [
                1149,
                1369
            ],
            [
                1369,
                1506
            ],
            [
                1506,
                1832
            ],
            [
                1832,
                2124
            ],
            [
                2124,
                2148
            ],
            [
                2148,
                2336
            ],
            [
                2336,
                2481
            ],
            [
                2481,
                2586
            ],
            [
                2586,
                2689
            ],
            [
                2689,
                2806
            ],
            [
                2806,
                3122
            ],
            [
                3122,
                3304
            ],
            [
                3304,
                3607
            ],
            [
                3607,
                3725
            ],
            [
                3725,
                3844
            ],
            [
                3844,
                4109
            ],
            [
                4109,
                4276
            ],
            [
                4276,
                4418
            ],
            [
                4418,
                4535
            ],
            [
                4535,
                4579
            ],
            [
                4579,
                4864
            ],
            [
                4864,
                5008
            ],
            [
                5008,
                5403
            ],
            [
                5403,
                5629
            ],
            [
                5629,
                5970
            ],
            [
                5970,
                6131
            ],
            [
                6131,
                6194
            ],
            [
                6194,
                6286
            ],
            [
                6286,
                6388
            ],
            [
                6388,
                6431
            ],
            [
                6431,
                6444
            ],
            [
                6444,
                6485
            ],
            [
                6485,
                6515
            ],
            [
                6515,
                6577
            ],
            [
                6577,
                6626
            ],
            [
                6626,
                6658
            ],
            [
                6658,
                6683
            ],
            [
                6683,
                6812
            ],
            [
                6812,
                6846
            ],
            [
                6846,
                6871
            ],
            [
                6871,
                6924
            ],
            [
                6924,
                7109
            ],
            [
                7109,
                7157
            ],
            [
                7157,
                7300
            ],
            [
                7300,
                7420
            ],
            [
                7420,
                7547
            ],
            [
                7547,
                7660
            ],
            [
                7660,
                7847
            ],
            [
                7847,
                7858
            ],
            [
                7858,
                7869
            ],
            [
                7869,
                8013
            ],
            [
                8013,
                8072
            ],
            [
                8072,
                8179
            ],
            [
                8179,
                8247
            ],
            [
                8247,
                8307
            ],
            [
                8307,
                8359
            ],
            [
                8359,
                8398
            ],
            [
                8398,
                8414
            ],
            [
                8414,
                8436
            ],
            [
                8436,
                8462
            ],
            [
                8462,
                8730
            ],
            [
                8730,
                8788
            ],
            [
                8788,
                8803
            ],
            [
                8803,
                8835
            ],
            [
                8835,
                8888
            ],
            [
                8888,
                8959
            ],
            [
                8959,
                9056
            ],
            [
                9056,
                9132
            ],
            [
                9132,
                9291
            ],
            [
                9291,
                9352
            ],
            [
                9352,
                9372
            ],
            [
                9372,
                9454
            ],
            [
                9454,
                9511
            ],
            [
                9511,
                9592
            ],
            [
                9592,
                9630
            ],
            [
                9630,
                9678
            ],
            [
                9678,
                9740
            ],
            [
                9740,
                9831
            ],
            [
                9831,
                9909
            ],
            [
                9909,
                10248
            ],
            [
                10248,
                10568
            ],
            [
                10568,
                10654
            ],
            [
                10654,
                10754
            ],
            [
                10754,
                10830
            ],
            [
                10830,
                10852
            ],
            [
                10852,
                10897
            ],
            [
                10897,
                11006
            ],
            [
                11006,
                11027
            ],
            [
                11027,
                11175
            ],
            [
                11175,
                11262
            ],
            [
                11262,
                11355
            ],
            [
                11355,
                11488
            ],
            [
                11488,
                11593
            ],
            [
                11593,
                11763
            ],
            [
                11763,
                11794
            ],
            [
                11794,
                11851
            ],
            [
                11851,
                11963
            ],
            [
                11963,
                12056
            ],
            [
                12056,
                12096
            ],
            [
                12096,
                12319
            ],
            [
                12319,
                12357
            ],
            [
                12357,
                12486
            ],
            [
                12486,
                12515
            ],
            [
                12515,
                12623
            ],
            [
                12623,
                12835
            ],
            [
                12835,
                12853
            ],
            [
                12853,
                12879
            ],
            [
                12879,
                13052
            ],
            [
                13052,
                13175
            ],
            [
                13175,
                13298
            ],
            [
                13298,
                13378
            ],
            [
                13378,
                13420
            ],
            [
                13420,
                13453
            ],
            [
                13453,
                13583
            ],
            [
                13583,
                13695
            ],
            [
                13695,
                13732
            ],
            [
                13732,
                13928
            ],
            [
                13928,
                13964
            ],
            [
                13964,
                13981
            ],
            [
                13981,
                14120
            ],
            [
                14120,
                14176
            ],
            [
                14176,
                14440
            ],
            [
                14440,
                14618
            ],
            [
                14618,
                14625
            ],
            [
                14625,
                14685
            ],
            [
                14685,
                14740
            ],
            [
                14740,
                14886
            ],
            [
                14886,
                14900
            ],
            [
                14900,
                15207
            ],
            [
                15207,
                15607
            ],
            [
                15607,
                15773
            ],
            [
                15773,
                15911
            ],
            [
                15911,
                16105
            ],
            [
                16105,
                16132
            ],
            [
                16132,
                16287
            ],
            [
                16287,
                16364
            ],
            [
                16364,
                16401
            ],
            [
                16401,
                16431
            ],
            [
                16431,
                16754
            ],
            [
                16754,
                16916
            ],
            [
                16916,
                16945
            ],
            [
                16945,
                17014
            ],
            [
                17014,
                17061
            ],
            [
                17061,
                17176
            ],
            [
                17176,
                17262
            ],
            [
                17262,
                17450
            ],
            [
                17450,
                17777
            ],
            [
                17777,
                17835
            ],
            [
                17835,
                17951
            ],
            [
                17951,
                17983
            ],
            [
                17983,
                18094
            ],
            [
                18094,
                18232
            ],
            [
                18232,
                18273
            ],
            [
                18273,
                18420
            ],
            [
                18420,
                18466
            ],
            [
                18466,
                18477
            ],
            [
                18477,
                18620
            ],
            [
                18620,
                18787
            ],
            [
                18787,
                18855
            ],
            [
                18855,
                18876
            ],
            [
                18876,
                18908
            ],
            [
                18908,
                18968
            ],
            [
                18968,
                19029
            ],
            [
                19029,
                19065
            ],
            [
                19065,
                19120
            ],
            [
                19120,
                19218
            ],
            [
                19218,
                19287
            ],
            [
                19287,
                19302
            ],
            [
                19302,
                19335
            ],
            [
                19335,
                19342
            ],
            [
                19342,
                19552
            ],
            [
                19552,
                19568
            ],
            [
                19568,
                19602
            ],
            [
                19602,
                19650
            ],
            [
                19650,
                19711
            ],
            [
                19711,
                19886
            ],
            [
                19886,
                19958
            ],
            [
                19958,
                19971
            ],
            [
                19971,
                19992
            ],
            [
                19992,
                20031
            ],
            [
                20031,
                20045
            ],
            [
                20045,
                20072
            ],
            [
                20072,
                20180
            ],
            [
                20180,
                20224
            ],
            [
                20224,
                20235
            ],
            [
                20235,
                20284
            ],
            [
                20284,
                20292
            ],
            [
                20292,
                20299
            ],
            [
                20299,
                20555
            ],
            [
                20555,
                20620
            ],
            [
                20620,
                20832
            ],
            [
                20832,
                20936
            ],
            [
                20936,
                21056
            ],
            [
                21056,
                21084
            ],
            [
                21084,
                21097
            ],
            [
                21097,
                21152
            ],
            [
                21152,
                21180
            ],
            [
                21180,
                21196
            ],
            [
                21196,
                21203
            ],
            [
                21203,
                21275
            ],
            [
                21275,
                21427
            ],
            [
                21427,
                21478
            ],
            [
                21478,
                21501
            ],
            [
                21501,
                21509
            ],
            [
                21509,
                21697
            ],
            [
                21697,
                21721
            ],
            [
                21721,
                21769
            ],
            [
                21769,
                21853
            ],
            [
                21853,
                21949
            ],
            [
                21949,
                22278
            ],
            [
                22278,
                22564
            ],
            [
                22564,
                22878
            ],
            [
                22878,
                22963
            ],
            [
                22963,
                23001
            ],
            [
                23001,
                23026
            ],
            [
                23026,
                23036
            ],
            [
                23036,
                23151
            ],
            [
                23151,
                23191
            ],
            [
                23191,
                23241
            ],
            [
                23241,
                23254
            ],
            [
                23254,
                23265
            ],
            [
                23265,
                23295
            ],
            [
                23295,
                23320
            ],
            [
                23320,
                23337
            ],
            [
                23337,
                23345
            ],
            [
                23345,
                23381
            ],
            [
                23381,
                23503
            ],
            [
                23503,
                23571
            ],
            [
                23571,
                23632
            ],
            [
                23632,
                23667
            ],
            [
                23667,
                23698
            ],
            [
                23698,
                23784
            ],
            [
                23784,
                23821
            ],
            [
                23821,
                23887
            ],
            [
                23887,
                23983
            ],
            [
                23983,
                23989
            ],
            [
                23989,
                24050
            ],
            [
                24050,
                24074
            ],
            [
                24074,
                24092
            ],
            [
                24092,
                24133
            ],
            [
                24133,
                24153
            ],
            [
                24153,
                24175
            ],
            [
                24175,
                24219
            ],
            [
                24219,
                24292
            ],
            [
                24292,
                24308
            ],
            [
                24308,
                24353
            ],
            [
                24353,
                24403
            ],
            [
                24403,
                24425
            ],
            [
                24425,
                24438
            ],
            [
                24438,
                24452
            ],
            [
                24452,
                24516
            ],
            [
                24516,
                24556
            ],
            [
                24556,
                24591
            ],
            [
                24591,
                24611
            ],
            [
                24611,
                24640
            ],
            [
                24640,
                24666
            ],
            [
                24666,
                24690
            ],
            [
                24690,
                24709
            ],
            [
                24709,
                24733
            ],
            [
                24733,
                24761
            ],
            [
                24761,
                24818
            ],
            [
                24818,
                24847
            ],
            [
                24847,
                25061
            ],
            [
                25061,
                25085
            ],
            [
                25085,
                25113
            ],
            [
                25113,
                25194
            ],
            [
                25194,
                25214
            ],
            [
                25214,
                25218
            ],
            [
                25218,
                25232
            ],
            [
                25232,
                25272
            ],
            [
                25272,
                25325
            ],
            [
                25325,
                25348
            ],
            [
                25348,
                25376
            ],
            [
                25376,
                25413
            ],
            [
                25413,
                25438
            ],
            [
                25438,
                25539
            ],
            [
                25539,
                25580
            ],
            [
                25580,
                25615
            ],
            [
                25615,
                25630
            ],
            [
                25630,
                25683
            ],
            [
                25683,
                25693
            ],
            [
                25693,
                25704
            ],
            [
                25704,
                25730
            ],
            [
                25730,
                25736
            ],
            [
                25736,
                25755
            ],
            [
                25755,
                25865
            ],
            [
                25865,
                25915
            ],
            [
                25915,
                25980
            ],
            [
                25980,
                26183
            ],
            [
                26183,
                26220
            ],
            [
                26220,
                26232
            ],
            [
                26232,
                26252
            ],
            [
                26252,
                26276
            ],
            [
                26276,
                26296
            ],
            [
                26296,
                26406
            ],
            [
                26406,
                26433
            ],
            [
                26433,
                26450
            ],
            [
                26450,
                26466
            ],
            [
                26466,
                26477
            ],
            [
                26477,
                26573
            ],
            [
                26573,
                26653
            ],
            [
                26653,
                26665
            ],
            [
                26665,
                26701
            ],
            [
                26701,
                26719
            ],
            [
                26719,
                26764
            ],
            [
                26764,
                26828
            ],
            [
                26828,
                26855
            ],
            [
                26855,
                26884
            ],
            [
                26884,
                26904
            ],
            [
                26904,
                27007
            ],
            [
                27007,
                27035
            ],
            [
                27035,
                27063
            ],
            [
                27063,
                27157
            ],
            [
                27157,
                27367
            ],
            [
                27367,
                27429
            ],
            [
                27429,
                27595
            ],
            [
                27595,
                27684
            ],
            [
                27684,
                27760
            ],
            [
                27760,
                27808
            ],
            [
                27808,
                27835
            ],
            [
                27835,
                27902
            ],
            [
                27902,
                27981
            ],
            [
                27981,
                28035
            ],
            [
                28035,
                28062
            ],
            [
                28062,
                28142
            ],
            [
                28142,
                28259
            ],
            [
                28259,
                28346
            ],
            [
                28346,
                28360
            ],
            [
                28360,
                28428
            ],
            [
                28428,
                28442
            ],
            [
                28442,
                28482
            ],
            [
                28482,
                28489
            ],
            [
                28489,
                28520
            ],
            [
                28520,
                28536
            ],
            [
                28536,
                28619
            ],
            [
                28619,
                28654
            ],
            [
                28654,
                28738
            ],
            [
                28738,
                28767
            ],
            [
                28767,
                28796
            ],
            [
                28796,
                28808
            ],
            [
                28808,
                28824
            ],
            [
                28824,
                28845
            ],
            [
                28845,
                28873
            ],
            [
                28873,
                28900
            ],
            [
                28900,
                28944
            ],
            [
                28944,
                29001
            ],
            [
                29001,
                29036
            ],
            [
                29036,
                29275
            ],
            [
                29275,
                29337
            ],
            [
                29337,
                29407
            ],
            [
                29407,
                29440
            ],
            [
                29440,
                29446
            ],
            [
                29446,
                29475
            ],
            [
                29475,
                29539
            ],
            [
                29539,
                29790
            ],
            [
                29790,
                30070
            ],
            [
                30070,
                30195
            ],
            [
                30195,
                30282
            ],
            [
                30282,
                30588
            ],
            [
                30588,
                30718
            ],
            [
                30718,
                30740
            ],
            [
                30740,
                30766
            ],
            [
                30766,
                30798
            ],
            [
                30798,
                30831
            ],
            [
                30831,
                30857
            ],
            [
                30857,
                30883
            ],
            [
                30883,
                31103
            ],
            [
                31103,
                31165
            ],
            [
                31165,
                31335
            ],
            [
                31335,
                31374
            ],
            [
                31374,
                31508
            ],
            [
                31508,
                31601
            ],
            [
                31601,
                31675
            ],
            [
                31675,
                31828
            ],
            [
                31828,
                31909
            ],
            [
                31909,
                31970
            ],
            [
                31970,
                32182
            ],
            [
                32182,
                32219
            ],
            [
                32219,
                32741
            ]
        ],
        "overlap_chars": [
            [
                0,
                94
            ],
            [
                157,
                159
            ],
            [
                182,
                194
            ],
            [
                203,
                228
            ],
            [
                228,
                234
            ],
            [
                261,
                411
            ],
            [
                450,
                452
            ],
            [
                452,
                604
            ],
            [
                604,
                626
            ],
            [
                708,
                731
            ],
            [
                777,
                827
            ],
            [
                895,
                920
            ],
            [
                920,
                1021
            ],
            [
                1021,
                1065
            ],
            [
                1084,
                1149
            ],
            [
                1149,
                1168
            ],
            [
                1175,
                1184
            ],
            [
                1196,
                1201
            ],
            [
                1224,
                1253
            ],
            [
                1185,
                1188
            ],
            [
                1254,
                1259
            ],
            [
                1288,
                1292
            ],
            [
                1300,
                1369
            ],
            [
                1369,
                1446
            ],
            [
                1493,
                1497
            ],
            [
                1504,
                1506
            ],
            [
                1506,
                1547
            ],
            [
                1556,
                1560
            ],
            [
                1566,
                1580
            ],
            [
                1666,
                1832
            ],
            [
                1832,
                1861
            ],
            [
                1898,
                1945
            ],
            [
                1965,
                2075
            ],
            [
                2098,
                2111
            ],
            [
                2121,
                2123
            ],
            [
                2148,
                2265
            ],
            [
                2275,
                2336
            ],
            [
                2336,
                2481
            ],
            [
                2586,
                2601
            ],
            [
                2607,
                2649
            ],
            [
                2660,
                2689
            ],
            [
                2704,
                2759
            ],
            [
                2764,
                2806
            ],
            [
                2806,
                2821
            ],
            [
                2831,
                2915
            ],
            [
                2925,
                2929
            ],
            [
                2987,
                2999
            ],
            [
                3032,
                3070
            ],
            [
                3072,
                3122
            ],
            [
                3122,
                3176
            ],
            [
                3207,
                3238
            ],
            [
                3279,
                3304
            ],
            [
                3304,
                3356
            ],
            [
                3374,
                3442
            ],
            [
                3455,
                3501
            ],
            [
                3533,
                3607
            ],
            [
                3607,
                3610
            ],
            [
                3613,
                3616
            ],
            [
                3637,
                3725
            ],
            [
                3725,
                3752
            ],
            [
                3775,
                3778
            ],
            [
                3820,
                3844
            ],
            [
                3844,
                3920
            ],
            [
                3931,
                3990
            ],
            [
                3991,
                3996
            ],
            [
                4023,
                4079
            ],
            [
                4107,
                4109
            ],
            [
                4109,
                4150
            ],
            [
                4154,
                4162
            ],
            [
                4189,
                4268
            ],
            [
                4274,
                4276
            ],
            [
                4276,
                4418
            ],
            [
                4418,
                4433
            ],
            [
                4460,
                4462
            ],
            [
                4438,
                4447
            ],
            [
                4469,
                4535
            ],
            [
                4535,
                4579
            ],
            [
                4579,
                4595
            ],
            [
                4772,
                4775
            ],
            [
                4625,
                4692
            ],
            [
                4721,
                4748
            ],
            [
                4758,
                4766
            ],
            [
                4781,
                4823
            ],
            [
                4840,
                4864
            ],
            [
                4864,
                4966
            ],
            [
                4981,
                4984
            ],
            [
                4994,
                5008
            ],
            [
                5008,
                5027
            ],
            [
                5092,
                5194
            ],
            [
                5210,
                5231
            ],
            [
                5264,
                5394
            ],
            [
                5400,
                5402
            ],
            [
                5403,
                5440
            ],
            [
                5450,
                5453
            ],
            [
                5627,
                5629
            ],
            [
                5629,
                5633
            ],
            [
                5674,
                5703
            ],
            [
                5711,
                5721
            ],
            [
                5733,
                5772
            ],
            [
                5804,
                5883
            ],
            [
                5895,
                5941
            ],
            [
                5957,
                5970
            ],
            [
                5970,
                6011
            ],
            [
                6026,
                6029
            ],
            [
                6043,
                6047
            ],
            [
                6061,
                6069
            ],
            [
                6129,
                6131
            ],
            [
                6131,
                6145
            ],
            [
                6159,
                6162
            ],
            [
                6192,
                6194
            ],
            [
                6194,
                6258
            ],
            [
                6283,
                6286
            ],
            [
                6286,
                6354
            ],
            [
                6386,
                6388
            ],
            [
                6388,
                6431
            ],
            [
                6431,
                6444
            ],
            [
                6444,
                6485
            ],
            [
                6485,
                6515
            ],
            [
                6515,
                6577
            ],
            [
                6577,
                6626
            ],
            [
                6626,
                6636
            ],
            [
                6647,
                6658
            ],
            [
                6658,
                6683
            ],
            [
                6683,
                6712
            ],
            [
                6721,
                6804
            ],
            [
                6810,
                6812
            ],
            [
                6846,
                6863
            ],
            [
                6869,
                6871
            ],
            [
                6871,
                6918
            ],
            [
                6922,
                6924
            ],
            [
                6924,
                6964
            ],
            [
                7024,
                7041
            ],
            [
                7043,
                7109
            ],
            [
                7109,
                7157
            ],
            [
                7157,
                7172
            ],
            [
                7198,
                7300
            ],
            [
                7300,
                7340
            ],
            [
                7357,
                7420
            ],
            [
                7420,
                7446
            ],
            [
                7452,
                7459
            ],
            [
                7460,
                7523
            ],
            [
                7545,
                7547
            ],
            [
                7547,
                7554
            ],
            [
                7591,
                7593
            ],
            [
                7555,
                7571
            ],
            [
                7580,
                7585
            ],
            [
                7595,
                7659
            ],
            [
                7660,
                7676
            ],
            [
                7702,
                7807
            ],
            [
                7819,
                7846
            ],
            [
                7847,
                7858
            ],
            [
                7858,
                7869
            ],
            [
                7869,
                7885
            ],
            [
                7937,
                8013
            ],
            [
                8013,
                8042
            ],
            [
                8070,
                8072
            ],
            [
                8072,
                8170
            ],
            [
                8171,
                8178
            ],
            [
                8247,
                8276
            ],
            [
                8480,
                8485
            ],
            [
                8471,
                8475
            ],
            [
                8486,
                8523
            ],
            [
                8533,
                8550
            ],
            [
                8529,
                8532
            ],
            [
                8551,
                8572
            ],
            [
                8587,
                8588
            ],
            [
                8608,
                8623
            ],
            [
                8594,
                8597
            ],
            [
                8624,
                8655
            ],
            [
                8665,
                8679
            ],
            [
                8297,
                8305
            ],
            [
                8685,
                8692
            ],
            [
                8694,
                8703
            ],
            [
                8705,
                8730
            ],
            [
                8888,
                8889
            ],
            [
                8893,
                8933
            ],
            [
                8957,
                8959
            ],
            [
                8959,
                9056
            ],
            [
                9056,
                9110
            ],
            [
                9114,
                9132
            ],
            [
                9132,
                9213
            ],
            [
                9242,
                9266
            ],
            [
                9278,
                9291
            ],
            [
                9291,
                9326
            ],
            [
                9350,
                9352
            ],
            [
                9352,
                9372
            ],
            [
                9372,
                9408
            ],
            [
                9424,
                9454
            ],
            [
                9454,
                9511
            ],
            [
                9511,
                9524
            ],
            [
                9544,
                9592
            ],
            [
                9592,
                9630
            ],
            [
                9630,
                9678
            ],
            [
                9678,
                9740
            ],
            [
                9740,
                9744
            ],
            [
                9777,
                9831
            ],
            [
                9831,
                9833
            ],
            [
                9837,
                9894
            ],
            [
                9907,
                9909
            ],
            [
                9909,
                9957
            ],
            [
                9962,
                9988
            ],
            [
                10044,
                10079
            ],
            [
                10123,
                10144
            ],
            [
                10220,
                10248
            ],
            [
                10248,
                10330
            ],
            [
                10418,
                10427
            ],
            [
                10331,
                10336
            ],
            [
                10518,
                10520
            ],
            [
                10398,
                10406
            ],
            [
                10565,
                10568
            ],
            [
                10568,
                10654
            ],
            [
                10654,
                10657
            ],
            [
                10666,
                10688
            ],
            [
                10697,
                10729
            ],
            [
                10739,
                10754
            ],
            [
                10830,
                10852
            ],
            [
                10852,
                10897
            ],
            [
                10897,
                11006
            ],
            [
                11006,
                11027
            ],
            [
                11048,
                11104
            ],
            [
                11134,
                11175
            ],
            [
                11209,
                11242
            ],
            [
                11355,
                11356
            ],
            [
                11396,
                11436
            ],
            [
                11452,
                11488
            ],
            [
                11488,
                11553
            ],
            [
                11558,
                11593
            ],
            [
                11593,
                11705
            ],
            [
                11738,
                11743
            ],
            [
                11725,
                11728
            ],
            [
                11761,
                11763
            ],
            [
                11763,
                11794
            ],
            [
                11794,
                11831
            ],
            [
                11835,
                11851
            ],
            [
                11851,
                11887
            ],
            [
                11897,
                11963
            ],
            [
                11963,
                12010
            ],
            [
                12054,
                12056
            ],
            [
                12056,
                12096
            ],
            [
                12096,
                12120
            ],
            [
                12133,
                12136
            ],
            [
                12158,
                12218
            ],
            [
                12230,
                12242
            ],
            [
                12251,
                12258
            ],
            [
                12275,
                12281
            ],
            [
                12317,
                12319
            ],
            [
                12319,
                12357
            ],
            [
                12357,
                12368
            ],
            [
                12456,
                12486
            ],
            [
                12486,
                12515
            ],
            [
                12515,
                12529
            ],
            [
                12553,
                12605
            ],
            [
                12611,
                12623
            ],
            [
                12623,
                12689
            ],
            [
                12699,
                12749
            ],
            [
                12767,
                12835
            ],
            [
                12841,
                12853
            ],
            [
                12853,
                12879
            ],
            [
                12974,
                13052
            ],
            [
                13052,
                13077
            ],
            [
                13115,
                13148
            ],
            [
                13098,
                13099
            ],
            [
                13149,
                13175
            ],
            [
                13175,
                13256
            ],
            [
                13296,
                13298
            ],
            [
                13378,
                13420
            ],
            [
                13420,
                13453
            ],
            [
                13518,
                13583
            ],
            [
                13583,
                13639
            ],
            [
                13641,
                13647
            ],
            [
                13656,
                13691
            ],
            [
                13695,
                13723
            ],
            [
                13729,
                13732
            ],
            [
                13732,
                13772
            ],
            [
                13783,
                13808
            ],
            [
                13870,
                13927
            ],
            [
                13981,
                14120
            ],
            [
                14120,
                14176
            ],
            [
                14176,
                14227
            ],
            [
                14239,
                14240
            ],
            [
                14249,
                14276
            ],
            [
                14286,
                14288
            ],
            [
                14303,
                14337
            ],
            [
                14385,
                14388
            ],
            [
                14397,
                14440
            ],
            [
                14440,
                14457
            ],
            [
                14477,
                14541
            ],
            [
                14554,
                14618
            ],
            [
                14625,
                14653
            ],
            [
                14683,
                14684
            ],
            [
                14740,
                14808
            ],
            [
                14834,
                14886
            ],
            [
                14886,
                14900
            ],
            [
                14900,
                14936
            ],
            [
                15007,
                15054
            ],
            [
                15117,
                15193
            ],
            [
                15204,
                15207
            ],
            [
                15211,
                15222
            ],
            [
                15227,
                15235
            ],
            [
                15248,
                15466
            ],
            [
                15475,
                15607
            ],
            [
                15684,
                15713
            ],
            [
                15718,
                15736
            ],
            [
                15751,
                15773
            ],
            [
                15773,
                15811
            ],
            [
                15852,
                15877
            ],
            [
                15886,
                15911
            ],
            [
                15911,
                15977
            ],
            [
                16026,
                16057
            ],
            [
                15977,
                15978
            ],
            [
                16092,
                16105
            ],
            [
                16105,
                16111
            ],
            [
                16122,
                16132
            ],
            [
                16132,
                16158
            ],
            [
                16168,
                16220
            ],
            [
                16229,
                16249
            ],
            [
                16260,
                16273
            ],
            [
                16275,
                16287
            ],
            [
                16287,
                16364
            ],
            [
                16945,
                17008
            ],
            [
                17012,
                17014
            ],
            [
                17176,
                17198
            ],
            [
                17210,
                17262
            ],
            [
                17262,
                17289
            ],
            [
                17328,
                17426
            ],
            [
                17432,
                17450
            ],
            [
                17450,
                17556
            ],
            [
                17557,
                17611
            ],
            [
                17623,
                17711
            ],
            [
                17775,
                17777
            ],
            [
                17835,
                17869
            ],
            [
                17896,
                17951
            ],
            [
                17951,
                17983
            ],
            [
                17983,
                17992
            ],
            [
                17999,
                18094
            ],
            [
                18094,
                18232
            ],
            [
                18232,
                18273
            ],
            [
                18298,
                18363
            ],
            [
                18395,
                18420
            ],
            [
                18420,
                18465
            ],
            [
                18482,
                18485
            ],
            [
                18738,
                18741
            ],
            [
                18746,
                18785
            ],
            [
                18640,
                18645
            ],
            [
                18706,
                18708
            ],
            [
                18620,
                18627
            ],
            [
                18690,
                18693
            ],
            [
                18596,
                18617
            ],
            [
                18785,
                18787
            ],
            [
                18787,
                18788
            ],
            [
                18793,
                18855
            ],
            [
                18855,
                18876
            ],
            [
                18876,
                18908
            ],
            [
                18908,
                18968
            ],
            [
                19065,
                19116
            ],
            [
                19120,
                19179
            ],
            [
                19199,
                19208
            ],
            [
                19216,
                19218
            ],
            [
                19218,
                19287
            ],
            [
                19287,
                19302
            ],
            [
                19512,
                19528
            ],
            [
                19342,
                19438
            ],
            [
                19482,
                19490
            ],
            [
                19457,
                19462
            ],
            [
                19505,
                19509
            ],
            [
                19568,
                19602
            ],
            [
                19602,
                19649
            ],
            [
                19711,
                19739
            ],
            [
                19775,
                19836
            ],
            [
                19849,
                19853
            ],
            [
                19859,
                19886
            ],
            [
                19886,
                19934
            ],
            [
                19956,
                19958
            ],
            [
                19992,
                20031
            ],
            [
                20031,
                20045
            ],
            [
                20045,
                20072
            ],
            [
                20072,
                20176
            ],
            [
                20180,
                20224
            ],
            [
                20224,
                20235
            ],
            [
                20235,
                20245
            ],
            [
                20282,
                20284
            ],
            [
                20284,
                20292
            ],
            [
                20299,
                20302
            ],
            [
                20313,
                20316
            ],
            [
                20322,
                20338
            ],
            [
                20343,
                20412
            ],
            [
                20437,
                20443
            ],
            [
                20444,
                20526
            ],
            [
                20553,
                20555
            ],
            [
                20555,
                20620
            ],
            [
                20665,
                20673
            ],
            [
                20674,
                20694
            ],
            [
                20620,
                20655
            ],
            [
                20694,
                20776
            ],
            [
                20793,
                20832
            ],
            [
                20832,
                20839
            ],
            [
                20856,
                20936
            ],
            [
                20936,
                20937
            ],
            [
                21073,
                21082
            ],
            [
                20950,
                20970
            ],
            [
                21054,
                21055
            ],
            [
                21203,
                21232
            ],
            [
                21236,
                21275
            ],
            [
                21275,
                21325
            ],
            [
                21341,
                21343
            ],
            [
                21352,
                21355
            ],
            [
                21344,
                21351
            ],
            [
                21372,
                21417
            ],
            [
                21425,
                21427
            ],
            [
                21427,
                21478
            ],
            [
                21478,
                21501
            ],
            [
                21501,
                21509
            ],
            [
                21509,
                21540
            ],
            [
                21571,
                21616
            ],
            [
                21663,
                21697
            ],
            [
                21725,
                21769
            ],
            [
                21769,
                21853
            ],
            [
                21853,
                21949
            ],
            [
                21949,
                21957
            ],
            [
                22058,
                22064
            ],
            [
                21971,
                21974
            ],
            [
                22071,
                22082
            ],
            [
                22027,
                22030
            ],
            [
                22278,
                22294
            ],
            [
                22301,
                22305
            ],
            [
                22339,
                22354
            ],
            [
                22357,
                22368
            ],
            [
                22371,
                22450
            ],
            [
                22455,
                22462
            ],
            [
                22518,
                22564
            ],
            [
                22564,
                22584
            ],
            [
                22735,
                22878
            ],
            [
                22878,
                22895
            ],
            [
                22896,
                22963
            ],
            [
                22963,
                22966
            ],
            [
                22972,
                23001
            ],
            [
                23001,
                23026
            ],
            [
                23026,
                23035
            ],
            [
                23036,
                23045
            ],
            [
                23049,
                23056
            ],
            [
                23062,
                23068
            ],
            [
                23149,
                23151
            ],
            [
                23191,
                23221
            ],
            [
                23239,
                23241
            ],
            [
                23242,
                23254
            ],
            [
                23254,
                23265
            ],
            [
                23265,
                23295
            ],
            [
                23295,
                23320
            ],
            [
                23320,
                23333
            ],
            [
                23345,
                23349
            ],
            [
                23350,
                23381
            ],
            [
                23503,
                23571
            ],
            [
                23571,
                23632
            ],
            [
                23632,
                23667
            ],
            [
                23667,
                23698
            ],
            [
                23698,
                23759
            ],
            [
                23782,
                23784
            ],
            [
                23784,
                23821
            ],
            [
                23821,
                23824
            ],
            [
                23834,
                23887
            ],
            [
                23887,
                23914
            ],
            [
                23936,
                23983
            ],
            [
                24133,
                24153
            ],
            [
                24153,
                24175
            ],
            [
                24175,
                24219
            ],
            [
                24219,
                24260
            ],
            [
                24292,
                24308
            ],
            [
                24308,
                24353
            ],
            [
                24452,
                24516
            ],
            [
                24516,
                24553
            ],
            [
                24567,
                24571
            ],
            [
                24641,
                24655
            ],
            [
                24664,
                24666
            ],
            [
                24666,
                24676
            ],
            [
                24690,
                24709
            ],
            [
                24761,
                24818
            ],
            [
                24818,
                24847
            ],
            [
                24847,
                24860
            ],
            [
                24875,
                24914
            ],
            [
                25059,
                25061
            ],
            [
                25061,
                25085
            ],
            [
                25085,
                25113
            ],
            [
                25139,
                25166
            ],
            [
                25168,
                25194
            ],
            [
                25194,
                25214
            ],
            [
                25214,
                25218
            ],
            [
                25218,
                25232
            ],
            [
                25232,
                25247
            ],
            [
                25258,
                25265
            ],
            [
                25270,
                25272
            ],
            [
                25272,
                25325
            ],
            [
                25376,
                25403
            ],
            [
                25411,
                25413
            ],
            [
                25438,
                25510
            ],
            [
                25526,
                25529
            ],
            [
                25537,
                25539
            ],
            [
                25539,
                25580
            ],
            [
                25580,
                25615
            ],
            [
                25615,
                25630
            ],
            [
                25630,
                25656
            ],
            [
                25667,
                25683
            ],
            [
                25683,
                25693
            ],
            [
                25693,
                25704
            ],
            [
                25704,
                25730
            ],
            [
                25730,
                25736
            ],
            [
                25736,
                25755
            ],
            [
                25755,
                25794
            ],
            [
                25825,
                25865
            ],
            [
                25865,
                25915
            ],
            [
                25915,
                25923
            ],
            [
                25952,
                25977
            ],
            [
                26252,
                26276
            ],
            [
                26276,
                26296
            ],
            [
                26729,
                26764
            ],
            [
                26764,
                26770
            ],
            [
                26797,
                26828
            ],
            [
                26828,
                26855
            ],
            [
                26888,
                26898
            ],
            [
                26926,
                26941
            ],
            [
                26947,
                27007
            ],
            [
                27007,
                27035
            ],
            [
                27035,
                27063
            ],
            [
                27063,
                27157
            ],
            [
                27157,
                27272
            ],
            [
                27304,
                27319
            ],
            [
                27336,
                27367
            ],
            [
                27367,
                27429
            ],
            [
                27647,
                27650
            ],
            [
                27616,
                27646
            ],
            [
                27651,
                27683
            ],
            [
                27684,
                27716
            ],
            [
                27760,
                27806
            ],
            [
                27835,
                27836
            ],
            [
                27860,
                27902
            ],
            [
                27902,
                27979
            ],
            [
                28142,
                28259
            ],
            [
                28259,
                28346
            ],
            [
                28346,
                28360
            ],
            [
                28360,
                28428
            ],
            [
                28428,
                28442
            ],
            [
                28442,
                28482
            ],
            [
                28482,
                28489
            ],
            [
                28654,
                28738
            ],
            [
                28738,
                28767
            ],
            [
                28767,
                28796
            ],
            [
                28796,
                28808
            ],
            [
                28808,
                28824
            ],
            [
                28824,
                28845
            ],
            [
                28845,
                28873
            ],
            [
                28873,
                28900
            ],
            [
                28900,
                28944
            ],
            [
                28955,
                29001
            ],
            [
                29001,
                29036
            ],
            [
                29036,
                29092
            ],
            [
                29136,
                29173
            ],
            [
                29188,
                29275
            ],
            [
                29275,
                29287
            ],
            [
                29303,
                29312
            ],
            [
                29342,
                29380
            ],
            [
                29385,
                29407
            ],
            [
                29407,
                29440
            ],
            [
                29440,
                29446
            ],
            [
                29446,
                29475
            ],
            [
                29475,
                29517
            ],
            [
                29536,
                29539
            ],
            [
                29539,
                29742
            ],
            [
                29775,
                29790
            ],
            [
                29790,
                29810
            ],
            [
                29816,
                29882
            ],
            [
                29928,
                30049
            ],
            [
                30068,
                30070
            ],
            [
                30070,
                30108
            ],
            [
                30122,
                30137
            ],
            [
                30170,
                30195
            ],
            [
                30195,
                30213
            ],
            [
                30237,
                30266
            ],
            [
                30282,
                30342
            ],
            [
                30385,
                30429
            ],
            [
                30434,
                30439
            ],
            [
                30586,
                30588
            ],
            [
                30588,
                30607
            ],
            [
                30655,
                30718
            ],
            [
                30718,
                30740
            ],
            [
                30740,
                30766
            ],
            [
                30766,
                30798
            ],
            [
                30798,
                30831
            ],
            [
                30831,
                30857
            ],
            [
                30857,
                30883
            ],
            [
                30883,
                31049
            ],
            [
                31075,
                31085
            ],
            [
                31093,
                31103
            ],
            [
                31103,
                31165
            ],
            [
                31200,
                31212
            ],
            [
                31223,
                31333
            ],
            [
                31508,
                31601
            ],
            [
                31601,
                31675
            ],
            [
                31675,
                31828
            ],
            [
                31828,
                31908
            ],
            [
                31909,
                31970
            ],
            [
                31970,
                32026
            ],
            [
                32027,
                32071
            ],
            [
                32080,
                32102
            ],
            [
                32103,
                32113
            ],
            [
                32121,
                32150
            ],
            [
                32180,
                32182
            ],
            [
                32182,
                32219
            ],
            [
                32356,
                32647
            ],
            [
                32720,
                32741
            ]
        ],
        "row_chars": [
            [
                0,
                228
            ],
            [
                228,
                452
            ],
            [
                452,
                604
            ],
            [
                604,
                920
            ],
            [
                920,
                1021
            ],
            [
                1021,
                1149
            ],
            [
                1149,
                1369
            ],
            [
                1369,
                1506
            ],
            [
                1506,
                1832
            ],
            [
                1832,
                2124
            ],
            [
                2124,
                2148
            ],
            [
                2148,
                2336
            ],
            [
                2336,
                2481
            ],
            [
                2481,
                2586
            ],
            [
                2586,
                2689
            ],
            [
                2689,
                2806
            ],
            [
                2806,
                3122
            ],
            [
                3122,
                3304
            ],
            [
                3304,
                3607
            ],
            [
                3607,
                3725
            ],
            [
                3725,
                3844
            ],
            [
                3844,
                4109
            ],
            [
                4109,
                4276
            ],
            [
                4276,
                4418
            ],
            [
                4418,
                4535
            ],
            [
                4535,
                4579
            ],
            [
                4579,
                4864
            ],
            [
                4864,
                5008
            ],
            [
                5008,
                5403
            ],
            [
                5403,
                5629
            ],
            [
                5629,
                5970
            ],
            [
                5970,
                6131
            ],
            [
                6131,
                6194
            ],
            [
                6194,
                6286
            ],
            [
                6286,
                6388
            ],
            [
                6388,
                6431
            ],
            [
                6431,
                6444
            ],
            [
                6444,
                6485
            ],
            [
                6485,
                6515
            ],
            [
                6515,
                6577
            ],
            [
                6577,
                6626
            ],
            [
                6626,
                6658
            ],
            [
                6658,
                6683
            ],
            [
                6683,
                6812
            ],
            [
                6812,
                6846
            ],
            [
                6846,
                6871
            ],
            [
                6871,
                6924
            ],
            [
                6924,
                7109
            ],
            [
                7109,
                7157
            ],
            [
                7157,
                7300
            ],
            [
                7300,
                7420
            ],
            [
                7420,
                7547
            ],
            [
                7547,
                7660
            ],
            [
                7660,
                7847
            ],
            [
                7847,
                7858
            ],
            [
                7858,
                7869
            ],
            [
                7869,
                8013
            ],
            [
                8013,
                8072
            ],
            [
                8072,
                8179
            ],
            [
                8179,
                8247
            ],
            [
                8247,
                8730
            ],
            [
                8730,
                8788
            ],
            [
                8788,
                8803
            ],
            [
                8803,
                8835
            ],
            [
                8835,
                8888
            ],
            [
                8888,
                8959
            ],
            [
                8959,
                9056
            ],
            [
                9056,
                9132
            ],
            [
                9132,
                9291
            ],
            [
                9291,
                9352
            ],
            [
                9352,
                9372
            ],
            [
                9372,
                9454
            ],
            [
                9454,
                9511
            ],
            [
                9511,
                9592
            ],
            [
                9592,
                9630
            ],
            [
                9630,
                9678
            ],
            [
                9678,
                9740
            ],
            [
                9740,
                9831
            ],
            [
                9831,
                9909
            ],
            [
                9909,
                10248
            ],
            [
                10248,
                10568
            ],
            [
                10568,
                10654
            ],
            [
                10654,
                10754
            ],
            [
                10754,
                10830
            ],
            [
                10830,
                10852
            ],
            [
                10852,
                10897
            ],
            [
                10897,
                11006
            ],
            [
                11006,
                11027
            ],
            [
                11027,
                11175
            ],
            [
                11175,
                11262
            ],
            [
                11262,
                11355
            ],
            [
                11355,
                11488
            ],
            [
                11488,
                11593
            ],
            [
                11593,
                11763
            ],
            [
                11763,
                11794
            ],
            [
                11794,
                11851
            ],
            [
                11851,
                11963
            ],
            [
                11963,
                12056
            ],
            [
                12056,
                12096
            ],
            [
                12096,
                12319
            ],
            [
                12319,
                12357
            ],
            [
                12357,
                12486
            ],
            [
                12486,
                12515
            ],
            [
                12515,
                12623
            ],
            [
                12623,
                12835
            ],
            [
                12835,
                12853
            ],
            [
                12853,
                12879
            ],
            [
                12879,
                13052
            ],
            [
                13052,
                13175
            ],
            [
                13175,
                13298
            ],
            [
                13298,
                13378
            ],
            [
                13378,
                13420
            ],
            [
                13420,
                13453
            ],
            [
                13453,
                13583
            ],
            [
                13583,
                13695
            ],
            [
                13695,
                13732
            ],
            [
                13732,
                13928
            ],
            [
                13928,
                13964
            ],
            [
                13964,
                13981
            ],
            [
                13981,
                14120
            ],
            [
                14120,
                14176
            ],
            [
                14176,
                14440
            ],
            [
                14440,
                14618
            ],
            [
                14618,
                14625
            ],
            [
                14625,
                14685
            ],
            [
                14685,
                14740
            ],
            [
                14740,
                14886
            ],
            [
                14886,
                14900
            ],
            [
                14900,
                15207
            ],
            [
                15207,
                15607
            ],
            [
                15607,
                15773
            ],
            [
                15773,
                15911
            ],
            [
                15911,
                16105
            ],
            [
                16105,
                16132
            ],
            [
                16132,
                16287
            ],
            [
                16287,
                16364
            ],
            [
                16364,
                16401
            ],
            [
                16401,
                16431
            ],
            [
                16431,
                16754
            ],
            [
                16754,
                16916
            ],
            [
                16916,
                16945
            ],
            [
                16945,
                17014
            ],
            [
                17014,
                17061
            ],
            [
                17061,
                17176
            ],
            [
                17176,
                17262
            ],
            [
                17262,
                17450
            ],
            [
                17450,
                17777
            ],
            [
                17777,
                17835
            ],
            [
                17835,
                17951
            ],
            [
                17951,
                17983
            ],
            [
                17983,
                18094
            ],
            [
                18094,
                18232
            ],
            [
                18232,
                18273
            ],
            [
                18273,
                18420
            ],
            [
                18420,
                18466
            ],
            [
                18466,
                18787
            ],
            [
                18787,
                18855
            ],
            [
                18855,
                18876
            ],
            [
                18876,
                18908
            ],
            [
                18908,
                18968
            ],
            [
                18968,
                19029
            ],
            [
                19029,
                19065
            ],
            [
                19065,
                19120
            ],
            [
                19120,
                19218
            ],
            [
                19218,
                19287
            ],
            [
                19287,
                19302
            ],
            [
                19302,
                19335
            ],
            [
                19335,
                19342
            ],
            [
                19342,
                19552
            ],
            [
                19552,
                19568
            ],
            [
                19568,
                19602
            ],
            [
                19602,
                19650
            ],
            [
                19650,
                19711
            ],
            [
                19711,
                19886
            ],
            [
                19886,
                19958
            ],
            [
                19958,
                19971
            ],
            [
                19971,
                19992
            ],
            [
                19992,
                20031
            ],
            [
                20031,
                20045
            ],
            [
                20045,
                20072
            ],
            [
                20072,
                20180
            ],
            [
                20180,
                20224
            ],
            [
                20224,
                20235
            ],
            [
                20235,
                20284
            ],
            [
                20284,
                20292
            ],
            [
                20292,
                20299
            ],
            [
                20299,
                20555
            ],
            [
                20555,
                20620
            ],
            [
                20620,
                20832
            ],
            [
                20832,
                20936
            ],
            [
                20936,
                21084
            ],
            [
                21084,
                21097
            ],
            [
                21097,
                21152
            ],
            [
                21152,
                21180
            ],
            [
                21180,
                21196
            ],
            [
                21196,
                21203
            ],
            [
                21203,
                21275
            ],
            [
                21275,
                21427
            ],
            [
                21427,
                21478
            ],
            [
                21478,
                21501
            ],
            [
                21501,
                21509
            ],
            [
                21509,
                21697
            ],
            [
                21697,
                21721
            ],
            [
                21721,
                21769
            ],
            [
                21769,
                21853
            ],
            [
                21853,
                21949
            ],
            [
                21949,
                22564
            ],
            [
                22564,
                22878
            ],
            [
                22878,
                22963
            ],
            [
                22963,
                23001
            ],
            [
                23001,
                23026
            ],
            [
                23026,
                23036
            ],
            [
                23036,
                23151
            ],
            [
                23151,
                23191
            ],
            [
                23191,
                23241
            ],
            [
                23241,
                23254
            ],
            [
                23254,
                23265
            ],
            [
                23265,
                23295
            ],
            [
                23295,
                23320
            ],
            [
                23320,
                23337
            ],
            [
                23337,
                23345
            ],
            [
                23345,
                23381
            ],
            [
                23381,
                23503
            ],
            [
                23503,
                23571
            ],
            [
                23571,
                23632
            ],
            [
                23632,
                23667
            ],
            [
                23667,
                23698
            ],
            [
                23698,
                23784
            ],
            [
                23784,
                23821
            ],
            [
                23821,
                23887
            ],
            [
                23887,
                23983
            ],
            [
                23983,
                23989
            ],
            [
                23989,
                24050
            ],
            [
                24050,
                24074
            ],
            [
                24074,
                24092
            ],
            [
                24092,
                24133
            ],
            [
                24133,
                24153
            ],
            [
                24153,
                24175
            ],
            [
                24175,
                24219
            ],
            [
                24219,
                24308
            ],
            [
                24308,
                24353
            ],
            [
                24353,
                24403
            ],
            [
                24403,
                24425
            ],
            [
                24425,
                24438
            ],
            [
                24438,
                24452
            ],
            [
                24452,
                24516
            ],
            [
                24516,
                24556
            ],
            [
                24556,
                24666
            ],
            [
                24666,
                24709
            ],
            [
                24709,
                24733
            ],
            [
                24733,
                24761
            ],
            [
                24761,
                24818
            ],
            [
                24818,
                24847
            ],
            [
                24847,
                25061
            ],
            [
                25061,
                25085
            ],
            [
                25085,
                25113
            ],
            [
                25113,
                25194
            ],
            [
                25194,
                25214
            ],
            [
                25214,
                25218
            ],
            [
                25218,
                25232
            ],
            [
                25232,
                25272
            ],
            [
                25272,
                25325
            ],
            [
                25325,
                25348
            ],
            [
                25348,
                25376
            ],
            [
                25376,
                25413
            ],
            [
                25413,
                25438
            ],
            [
                25438,
                25539
            ],
            [
                25539,
                25580
            ],
            [
                25580,
                25615
            ],
            [
                25615,
                25630
            ],
            [
                25630,
                25683
            ],
            [
                25683,
                25693
            ],
            [
                25693,
                25704
            ],
            [
                25704,
                25730
            ],
            [
                25730,
                25736
            ],
            [
                25736,
                25755
            ],
            [
                25755,
                25865
            ],
            [
                25865,
                25915
            ],
            [
                25915,
                25980
            ],
            [
                25980,
                26183
            ],
            [
                26183,
                26220
            ],
            [
                26220,
                26232
            ],
            [
                26232,
                26252
            ],
            [
                26252,
                26276
            ],
            [
                26276,
                26296
            ],
            [
                26296,
                26406
            ],
            [
                26406,
                26433
            ],
            [
                26433,
                26450
            ],
            [
                26450,
                26466
            ],
            [
                26466,
                26477
            ],
            [
                26477,
                26573
            ],
            [
                26573,
                26653
            ],
            [
                26653,
                26665
            ],
            [
                26665,
                26701
            ],
            [
                26701,
                26719
            ],
            [
                26719,
                26764
            ],
            [
                26764,
                26828
            ],
            [
                26828,
                26855
            ],
            [
                26855,
                26884
            ],
            [
                26884,
                27007
            ],
            [
                27007,
                27035
            ],
            [
                27035,
                27063
            ],
            [
                27063,
                27157
            ],
            [
                27157,
                27367
            ],
            [
                27367,
                27429
            ],
            [
                27429,
                27595
            ],
            [
                27595,
                27684
            ],
            [
                27684,
                27808
            ],
            [
                27808,
                27835
            ],
            [
                27835,
                27902
            ],
            [
                27902,
                27981
            ],
            [
                27981,
                28035
            ],
            [
                28035,
                28062
            ],
            [
                28062,
                28142
            ],
            [
                28142,
                28259
            ],
            [
                28259,
                28346
            ],
            [
                28346,
                28360
            ],
            [
                28360,
                28428
            ],
            [
                28428,
                28442
            ],
            [
                28442,
                28482
            ],
            [
                28482,
                28489
            ],
            [
                28489,
                28520
            ],
            [
                28520,
                28536
            ],
            [
                28536,
                28619
            ],
            [
                28619,
                28654
            ],
            [
                28654,
                28738
            ],
            [
                28738,
                28767
            ],
            [
                28767,
                28796
            ],
            [
                28796,
                28808
            ],
            [
                28808,
                28824
            ],
            [
                28824,
                28845
            ],
            [
                28845,
                28873
            ],
            [
                28873,
                28900
            ],
            [
                28900,
                28944
            ],
            [
                28944,
                29001
            ],
            [
                29001,
                29036
            ],
            [
                29036,
                29275
            ],
            [
                29275,
                29407
            ],
            [
                29407,
                29440
            ],
            [
                29440,
                29446
            ],
            [
                29446,
                29475
            ],
            [
                29475,
                29539
            ],
            [
                29539,
                29790
            ],
            [
                29790,
                30070
            ],
            [
                30070,
                30195
            ],
            [
                30195,
                30282
            ],
            [
                30282,
                30588
            ],
            [
                30588,
                30718
            ],
            [
                30718,
                30740
            ],
            [
                30740,
                30766
            ],
            [
                30766,
                30798
            ],
            [
                30798,
                30831
            ],
            [
                30831,
                30857
            ],
            [
                30857,
                30883
            ],
            [
                30883,
                31103
            ],
            [
                31103,
                31165
            ],
            [
                31165,
                31335
            ],
            [
                31335,
                31374
            ],
            [
                31374,
                31508
            ],
            [
                31508,
                31601
            ],
            [
                31601,
                31675
            ],
            [
                31675,
                31828
            ],
            [
                31828,
                31909
            ],
            [
                31909,
                31970
            ],
            [
                31970,
                32182
            ],
            [
                32182,
                32219
            ],
            [
                32219,
                32741
            ]
        ]
    },
    "abridged": {
        "text": "I lay ill through several weeks, and the usual tenor of my life became like an old remembrance in the helpless inaction of a sick-room. Before many days, everything else seemed to have retired into a remote distance where there was little or no separation between the various stages of my life. In falling ill, I seemed to have crossed a dark lake and to have left all my experiences, mingled together by the great distance, on the healthy shore.\nMy housekeeping duties were soon as far off as the summer afternoons when I went home from school to my godmother's house. I had never known before how short life really was and into how small a space the mind could put it.\nWhile I was very ill, the way in which these different times became confused with one another distressed my mind exceedingly. At once a child, an older girl, and a woman, I was not only oppressed by the cares of each stage, but by the great perplexity of endlessly trying to reconcile them. I suppose that few who have not been in such a condition can quite understand this.\nFor the same reason I am almost afraid to say that in my disorder I laboured up colossal staircases, ever striving to reach the top, and ever turned, as I have seen a worm in a garden path, by some obstruction, and labouring again. I knew perfectly at intervals that I was in my bed; and I talked with Charley, and knew her very well; yet I would find myself complaining, \"Oh, more of these never-ending stairs, Charley - piled up to the sky!\"\nDare I hint at that worse time when, strung together somewhere in great black space, there was a flaming necklace, or starry circle of some kind, of which I was one of the beads! And when my only prayer was to be taken off from the rest and when it was such inexplicable agony and misery to be a part of the dreadful thing?\nI do not recall these experiences to make others unhappy or because I am now unhappy in remembering them. If we knew more of such strange afflictions we might be better able to alleviate their intensity.\nThe repose that followed, the long delicious sleep, the blissful rest, when in my weakness I was too calm to care even if I was dying, apart from feeling a pitying love for those I left behind - this state can be perhaps more widely understood. I was in this state when I first shrunk from the light, and knew with a boundless joy that I should see again.\nI had heard my Ada crying at the door, day and night, calling to me that I was cruel and did not love her; I had heard her imploring to be let in to nurse and comfort me; but I had only said, when I could speak, \"Never, my sweet girl, never!\" and had reminded Charley that she was to keep my darling from the room whether I lived or died. Charley had been true to me and had kept the door fast.\nBut now, my sight strengthening and the glorious light coming every day more brightly on me, I could read the letters that my dear wrote daily to me and could put them to my lips and lay my cheek upon them. I could see my little maid, so tender and careful, setting everything in order and speaking cheerfully to Ada from the open window. I could understand the stillness in the house and the thoughtfulness it expressed on the part of all those who had always been so good to me. I could weep in my exquisite joy and be as happy in my weakness as ever I had been in my strength.\nBy and by my strength began to be restored. Instead of lying and watching what was done for me, as if it were done for some one else, I helped it a little, and a little more, until I became useful to myself, and attached to life again.\nHow well I remember the pleasant afternoon when I was raised in bed with pillows for the first time to take tea with Charley! The little creature was so happy, and so busy, and stopped so often in her preparations to lay her head upon my bosom, and cry with joyful tears, that I was obliged to say, \"Charley, if you go on in this way, I must lie down again, my darling, for I am weaker than I thought!\"\nSo Charley became as quiet as a mouse about her preparations. When the pretty tea-table with its tempting delicacies, and its white cloth, and its flowers, beautifully arranged for me by Ada downstairs, was ready at the bedside, I felt steady enough to say something to Charley that had been in my thoughts.\nFirst I complimented Charley on the room, which was airy and neat. This delighted her.\n\"Yet, Charley,\" said I, looking round, \"I miss something, surely?\"\nPoor little Charley looked round too and pretended to shake her head.\n\"Are the pictures all as they used to be?\" I asked her.\n\"Every one of them, miss,\" said Charley.\n\"And the furniture, Charley?\"\n\"Except where I have moved it about to make more room, miss.\"\n\"And yet,\" said I, \"I miss some familiar object. Ah, I know, Charley! It's the looking-glass.\"\nCharley got up from the table as if she had forgotten something, and went into the next room; and I heard her sob.\nI was now certain. I could thank God that it was not a shock to me. I called Charley back, and when she came, looking grieved - I took her in my arms and said, \"It matters very little, Charley. I hope I can do without my old face very well.\"\nI was presently able to sit up in a great chair and even giddily to walk into the adjoining room, leaning on Charley. The mirror was gone from its usual place, but what I had to bear was none the harder to bear for that.\nMy guardian had throughout wished earnestly to visit me, and there was now no good reason why I should deny him. He came in one morning, and at first could only hold me in his embrace and say, \"My dear, dear girl!\"\nI had long known what a deep fountain of affection and generosity his heart was; and was it not worth my trivial suffering to fill such a place in it?\n\"Oh, yes!\" I thought. \"He has seen me, and is even fonder of me than he was before; and what have I to mourn for!\"\nHe sat down by me on the sofa. For a little while he sat with his hand over his face, but when he removed it, fell into his usual pleasant manner.\n\"My little woman,\" said he, \"Ada and I have been perfectly forlorn and miserable; your friend Caddy has been coming and going; everyone about the house has been utterly lost and dejected; even poor Rick has been writing - to me too - in his anxiety for you!\"\n\"You speak of his writing to you,\" said I. \"As if it were not natural for him to do so, guardian; as if he could write to a better friend!\"\n\"He thinks he could, my love,\" returned my guardian, \"to many a better. The truth is, he wrote to me under a sort of protest while unable to write to you - wrote coldly, haughtily, resentfully. Well, dearest little woman, we must forgive him. He is not to blame. Jarndyce and Jarndyce has warped him and perverted me in his eyes. I have known it do as bad deeds, and worse, many a time. If two angels were caught up in it, I believe it would change their nature.\"\n\"It has not changed yours, guardian.\"\n\"Oh, yes, it has, my dear,\" he said laughingly. \"It has made the south wind easterly, I don't know how often. Rick goes to lawyers, and is taught to mistrust and suspect me. He hears I have conflicting interests, claims clashing against his. Whereas, heaven knows that if I could get out of those legal mountains of wiglomeration (which I can't) or could level them (which I can't either), I would do it this hour. I would rather restore to poor Rick his proper nature than be endowed with all the unclaimed money in Chancery.\"\n\"Is it possible, guardian,\" I asked, amazed, \"that Richard can be suspicious of you?\"\n\"Ah, my love,\" he said, \"the subtle poison of such abuses breeds such diseases. It is not his fault.\"\n\"But it is a terrible misfortune, guardian.\"\n\"It is a terrible misfortune, little woman, to be ever drawn within the influences of Jarndyce and Jarndyce. I know none greater. But he has been induced to trust in that rotten reed, and it transmits rottenness to everything around him. We must be patient with poor Rick.\"\nI expressed my wonder and regret that his benevolent intentions had prospered so little.\n\"We must not say so, Dame Durden,\" he cheerfully replied; \"Ada is happier, I hope, and that is much. I did think that I and both these young creatures might be friends instead of distrustful foes and that we might prove stronger than the lawsuit. But it was too much to expect. Jarndyce and Jarndyce was the curtain round Rick's cradle.\"\n\"But, guardian, may we not hope that experience will teach him what a false and wretched thing it is?\"\n\"We will hope so, my Esther,\" said Mr. Jarndyce. \"In any case we must not be hard on him. There are not many grown men, good men too, who if they were thrown into this same court would not be changed for the worse within a year. How can we stand amazed at poor Rick? A young man cannot at first believe (who could?) that Chancery is what it is. He looks to it to do something with his interests and bring them to a settlement. It procrastinates, disappoints, tries, tortures him; wears out his hopes and patience, thread by thread; but he still hankers after it, and finds his whole world treacherous and hollow. Well, well! Enough of this, my dear!\"\nI leaned my head upon his shoulder and loved him as if he had been my father. I resolved in my own mind to see Richard when I grew strong, and try to set him right.\n\"There are better subjects than these,\" said my guardian, \"for such a joyful time. When shall Ada come to see you, my love?\"\nI had been thinking of that too. I knew my loving girl would be changed by no change in my looks.\n\"Dear guardian,\" said I, \"as I have shut her out so long - though indeed, she is like the light to me-\"\n\"I know it well, Dame Durden.\"\nHe was so good, his touch expressed such compassion and affection, that I stopped for a little while, quite unable to go on.\n\"As I have kept Ada out so long,\" I began afresh after a short while, \"I think I should like to have my own way a little longer, guardian. It would be best to be away from here before I see her. If Charley and I were to go to some country lodging when I am strong enough, and if I had a week there to recover and to be revived by the sweet air before seeing Ada again, I think it would be better for us.\"\nI hope it was not weak to wish to be a little more used to my altered self before I met the dear girl I longed so ardently to see, but it is the truth. He understood me, I was sure.\n\"Our spoilt little woman,\" said my guardian, \"shall have her own way, though at the price, I know, of tears downstairs. And see here! Here is Boythorn, heart of chivalry, vowing that if you don't go and occupy his whole house, by heaven and by earth he'll pull it down and not leave one brick standing!\"\nMy guardian handed me a letter without any ordinary beginning such as \"My dear Jarndyce,\" but rushing at once into the words, \"I swear if Miss Summerson do not come down and take possession of my house, which I vacate for her this day at one o'clock,\" and then with the utmost seriousness, and in the most emphatic terms, going on to make the extraordinary declaration he had quoted. We settled that I should send Mr. Boythorn a letter of thanks and accept his offer. It was a most agreeable one to me, for there was nowhere I should have liked to go so well as Chesney Wold.\n\"Now, little housewife,\" said my guardian, looking at his watch, \"you must not be tired too soon; I have only one last minute. I have another petition. Little Miss Flite, hearing that you were ill, made nothing of walking down here - twenty miles, poor soul, in dancing shoes - to inquire. It was heaven's mercy we were at home, or she would have walked back again.\"\nI could not tell him heartily enough how ready I was to receive poor Miss Flite. We arranged a time for her to come out by the coach and share my early dinner. When my guardian left me, I prayed to be forgiven if I, surrounded by such blessings, had magnified to myself the little trial I had to undergo. The childish prayer of that old birthday when I had aspired to be industrious, contented, and true-hearted, and to do good to some one and win some love to myself, came back into my mind with a reproachful sense of all the happiness I had since enjoyed. I repeated the old childish prayer and found that its old peace had not departed from it.\nMy guardian now came every day. In a week more I could walk about our rooms and hold long talks with Ada from behind the window-curtain. Yet I never saw her, for I had not as yet the courage to look at the dear face, though I could have done so easily without her seeing me.\nOn the appointed day Miss Flite arrived. She ran into my room quite forgetful of her usual dignity, and crying \"My dear Fitz Jarndyce!\" fell upon my neck and kissed me twenty times. Then she sat shedding tears for the next ten minutes, and had to ask Charley for a pocket handkerchief.\n\"Tears of pleasure, my dear Fitz Jarndyce,\" she was careful to explain. \"Not the least pain. Pleasure to see you well again. Pleasure at having the honour of being admitted to see you. By the by, my dear, mentioning pocket handkerchiefs-\"\nMiss Flite here looked at Charley, who had been to meet her off the coach. Charley glanced at me and looked unwilling to pursue the suggestion.\n\"Ve-ry right!\" said Miss Flite, \"Highly indiscreet of me to mention it; but my dear Miss Fitz Jarndyce, I am afraid I am at times a little - rambling, you know.\"\n\"What were you going to tell me?\" said I, smiling, for I saw she wanted to go on.\nMiss Flite looked at Charley, who said, \"If you please, ma'am, you had better tell then,\" gratifying Miss Flite beyond measure.\n\"So sagacious, our young friend,\" said she to me. \"Well, my dear, it's a pretty anecdote. Nothing more. Still I think it charming. Who should follow us down the road from the coach, my dear, but a poor person in a very ungenteel bonnet-\"\n\"Jenny, if you please, miss,\" said Charley.\n\"Just so!\" Miss Flite agreed. \"Jenny. And she tells our young friend that there has been a lady with a veil inquiring at her cottage after your health, and taking a handkerchief away with her as a little keepsake merely because it was yours! Now, you know, so very prepossessing in the lady with the veil!\"\nI looked at Charley in some astonishment.\n\"If you please, miss,\" said Charley, \"Jenny says that when her baby died, you left a handkerchief there, and that she kept it with the baby's little things. I think partly because it was yours, miss, and partly because it had covered the baby.\"\n\"Exceedingly sagacious!\" whispered Miss Flite.\n\"Well, miss,\" said Charley, \"that's the handkerchief the lady took. And Jenny wants you to know that she wouldn't have sold it for herself but that the lady took it and left some money. Jenny don't know her at all, if you please, miss!\"\n\"Why, who can she be?\" said I.\n\"My love,\" Miss Flite suggested with her most mysterious look, \"in my opinion she's the Lord Chancellor's wife. I understand she leads him a terrible life. Throws his lordship's papers into the fire, my dear, if he won't pay the jeweller!\"\nI did not think very much about this lady then, for I had an impression that it might be Caddy. Besides, dinner was brought in, and I had to preside over a dish of fish, roast fowl, sweetbread, vegetables, pudding, and Madeira; and it was so pleasant to see how Miss Flite enjoyed it, that I was soon thinking of nothing else.\nWhen we had finished, Miss Flite was so very chatty and happy that I thought I would lead her to her own history, as she was always pleased to talk about herself. I began by saying, \"You have attended on the Lord Chancellor many years, Miss Flite?\"\n\"Oh, many, many years, my dear. But I expect a judgment. Shortly.\" There was some anxiety in her tone. \"My father expected a judgment. My brother. My sister. They all expected a judgment. The same that I expect.\"\n\"They are all-\"\n\"Dead, of course, my dear,\" said she.\n\"Would it not be wiser,\" said I, \"to expect this judgment no more?\"\n\"Why, my dear,\" she answered promptly, \"of course it would!\"\n\"And to attend the court no more?\"\n\"Equally of course,\" said she. \"Very wearing to be always in expectation of what never comes! Wearing, I assure you, to the bone!\"\nShe showed me her arm, and it was fearfully thin indeed.\n\"But, my dear,\" she went on, \"there's a dreadful attraction in the place. You can't leave it. And you must expect.\"\nI tried to assure her that this was not so. She heard me patiently and smilingly, but answered, \"Aye, aye, aye! You think so because I am a little rambling. But, my dear, I have been there many years, and I have noticed. It's the mace and seal upon the table. They draw people on. Draw peace and sense out of them. I have felt them even drawing my rest away in the night. Cold and glittering devils!\"\nShe tapped me upon the arm and nodded good-humouredly.\n\"Let me see,\" said she. \"I'll tell you my own case. Before I had ever seen them - what was it I used to do? Tambourine playing? No. Tambour work. I and my sister did tambour embroidery. Our father and our brother had a builder's business. First, our father was drawn - slowly. In a few years he was a fierce, sour, angry bankrupt without a kind word for anyone. He had been so different, Fitz Jarndyce. He was drawn to a debtors' prison. There he died. Then our brother was drawn - swiftly - to drunkenness. And rags. And death. Then my sister was drawn. Hush! Never ask to what! Then I was ill and in misery, and heard that this was all the work of Chancery. When I got better, I went to look at the monster. And then I was drawn to stay there. I am a little rambling. But I have noticed. Fitz Jarndyce, I know what will happen. I know when the attraction has begun. I know the signs, my dear. I saw them,\" speaking low, \"I saw them beginning in our friend the ward in Jarndyce. Let some one hold him back. Or he'll be drawn to ruin.\"\nShe looked at me in silence for some moments, with her face gradually softening into a smile. Seeming to fear that she had been too gloomy, and seeming also to lose the connexion in her mind, she said politely, \"Yes, my dear, I expect a judgment shortly. Then I shall release my birds, you know, and confer estates.\"\nNow she was quite complacent again and beamed with nods and smiles. \"But, my dear,\" she said, gaily, \"you have not congratulated me on my physician!\"\nI said that I did not quite know what she meant.\n\"My physician, Mr. Woodcourt, my dear, who was so exceedingly attentive to me.\"\n\"Mr. Woodcourt is so far away, now,\" said I, \"that I thought the time for such congratulation was past, Miss Flite.\"\n\"But, my child,\" she returned, \"is it possible that you don't know what has happened?\"\n\"No,\" said I.\n\"Not what everybody has been talking of, my beloved Fitz Jarndyce!\"\n\"No,\" said I. \"You forget how long I have been here.\"\n\"True! Well, my dear, there has been a terrible shipwreck over in those East Indian seas.\"\n\"Mr. Woodcourt shipwrecked!\"\n\"Don't be agitated, my dear. He is safe. An awful scene. Death in all shapes. Hundreds of dead and dying. Fire, storm, and darkness. Numbers of the drowning thrown upon a rock. Through it all, my dear physician was a hero. Calm and brave through everything. Saved many lives, never complained in hunger and thirst, took the lead, showed them what to do, tended the sick, buried the dead, and brought the poor survivors safely off at last! My dear, the creatures fell down at his feet when they got to land and blessed him. The whole country rings with it. Stay! Where's my bag of documents? I have got it there, and you shall read it!\"\nAnd I did read all the noble history, though very slowly and imperfectly then, for my eyes were so dimmed that I could not see the words, and I cried so much that I was many times obliged to lay down the cutting from the newspaper. I felt so triumphant to have known the man who had done such generous and gallant deeds, I so admired and loved what he had done, that I envied the storm-worn people who had fallen at his feet and blessed him. I could myself have kneeled down then, and blessed him for being so truly good and brave. I felt that no one could honour him more than I.\nMy poor little visitor made me a present of the account, and rose to take her leave, lest she should miss her coach.\n\"My dear,\" said she, \"my brave physician ought to have a title bestowed upon him. And no doubt he will. You are of that opinion?\"\nThat he well deserved one, yes. That he would ever have one, no.\n\"Why not, Fitz Jarndyce?\" she asked rather sharply.\nI said it was not the custom in England to confer titles on men distinguished by peaceful services, however good and great, unless occasionally when they consisted of making very large amounts of money.\n\"Why, good gracious,\" said Miss Flite, \"how can you say that? The greatest men of England in knowledge, imagination, active humanity, and improvement of every sort are added to its nobility!\"\nI am afraid she believed what she said, for there were moments when she was very mad indeed.\nAnd now I must part with the little secret I have thus far tried to keep. I had thought, sometimes, that Mr. Woodcourt loved me and that if he had been richer he would perhaps have told me that he loved me before he went away. I had thought, sometimes, that if he had done so, I should have been glad of it.\nBut how much better it was now that this had never happened! What should I have suffered if I had had to write to him, and tell him that the poor face he had known was quite gone from me, and that I released him from his bondage!\nOh, it was so much better as it was! There was nothing to be undone: no chain for me to break or for him to drag; and I could go, please God, my lowly way along the path of duty, and he could go his nobler way upon its broader road; and though we were apart upon the journey, I might aspire to meet him, unselfishly, innocently, at the journey's end.",
        "paragraph_chars": [
            [
                0,
                447
            ],
            [
                447,
                671
            ],
            [
                671,
                1046
            ],
            [
                1046,
                1490
            ],
            [
                1490,
                1814
            ],
            [
                1814,
                2018
            ],
            [
                2018,
                2374
            ],
            [
                2374,
                2769
            ],
            [
                2769,
                3349
            ],
            [
                3349,
                3585
            ],
            [
                3585,
                3988
            ],
            [
                3988,
                4296
            ],
            [
                4296,
                4383
            ],
            [
                4383,
                4450
            ],
            [
                4450,
                4520
            ],
            [
                4520,
                4576
            ],
            [
                4576,
                4617
            ],
            [
                4617,
                4647
            ],
            [
                4647,
                4709
            ],
            [
                4709,
                4804
            ],
            [
                4804,
                4919
            ],
            [
                4919,
                5161
            ],
            [
                5161,
                5382
            ],
            [
                5382,
                5597
            ],
            [
                5597,
                5748
            ],
            [
                5748,
                5863
            ],
            [
                5863,
                6010
            ],
            [
                6010,
                6269
            ],
            [
                6269,
                6409
            ],
            [
                6409,
                6873
            ],
            [
                6873,
                6911
            ],
            [
                6911,
                7439
            ],
            [
                7439,
                7525
            ],
            [
                7525,
                7627
            ],
            [
                7627,
                7672
            ],
            [
                7672,
                7946
            ],
            [
                7946,
                8035
            ],
            [
                8035,
                8373
            ],
            [
                8373,
                8476
            ],
            [
                8476,
                9127
            ],
            [
                9127,
                9292
            ],
            [
                9292,
                9417
            ],
            [
                9417,
                9515
            ],
            [
                9515,
                9619
            ],
            [
                9619,
                9650
            ],
            [
                9650,
                9775
            ],
            [
                9775,
                10180
            ],
            [
                10180,
                10362
            ],
            [
                10362,
                10666
            ],
            [
                10666,
                11242
            ],
            [
                11242,
                11609
            ],
            [
                11609,
                12258
            ],
            [
                12258,
                12533
            ],
            [
                12533,
                12819
            ],
            [
                12819,
                13058
            ],
            [
                13058,
                13202
            ],
            [
                13202,
                13364
            ],
            [
                13364,
                13446
            ],
            [
                13446,
                13574
            ],
            [
                13574,
                13812
            ],
            [
                13812,
                13856
            ],
            [
                13856,
                14163
            ],
            [
                14163,
                14205
            ],
            [
                14205,
                14450
            ],
            [
                14450,
                14497
            ],
            [
                14497,
                14734
            ],
            [
                14734,
                14765
            ],
            [
                14765,
                15005
            ],
            [
                15005,
                15332
            ],
            [
                15332,
                15581
            ],
            [
                15581,
                15794
            ],
            [
                15794,
                15810
            ],
            [
                15810,
                15848
            ],
            [
                15848,
                15916
            ],
            [
                15916,
                15977
            ],
            [
                15977,
                16012
            ],
            [
                16012,
                16143
            ],
            [
                16143,
                16200
            ],
            [
                16200,
                16316
            ],
            [
                16316,
                16717
            ],
            [
                16717,
                16772
            ],
            [
                16772,
                17808
            ],
            [
                17808,
                18125
            ],
            [
                18125,
                18275
            ],
            [
                18275,
                18324
            ],
            [
                18324,
                18404
            ],
            [
                18404,
                18521
            ],
            [
                18521,
                18608
            ],
            [
                18608,
                18622
            ],
            [
                18622,
                18690
            ],
            [
                18690,
                18744
            ],
            [
                18744,
                18835
            ],
            [
                18835,
                18864
            ],
            [
                18864,
                19500
            ],
            [
                19500,
                20081
            ],
            [
                20081,
                20198
            ],
            [
                20198,
                20328
            ],
            [
                20328,
                20393
            ],
            [
                20393,
                20445
            ],
            [
                20445,
                20648
            ],
            [
                20648,
                20840
            ],
            [
                20840,
                20933
            ],
            [
                20933,
                21241
            ],
            [
                21241,
                21471
            ],
            [
                21471,
                21821
            ]
        ],
        "segment_chars": [
            [
                0,
                136
            ],
            [
                136,
                295
            ],
            [
                295,
                447
            ],
            [
                447,
                570
            ],
            [
                570,
                671
            ],
            [
                671,
                797
            ],
            [
                797,
                962
            ],
            [
                962,
                1046
            ],
            [
                1046,
                1278
            ],
            [
                1278,
                1490
            ],
            [
                1490,
                1669
            ],
            [
                1669,
                1814
            ],
            [
                1814,
                1920
            ],
            [
                1920,
                2018
            ],
            [
                2018,
                2263
            ],
            [
                2263,
                2374
            ],
            [
                2374,
                2617
            ],
            [
                2617,
                2713
            ],
            [
                2713,
                2769
            ],
            [
                2769,
                2976
            ],
            [
                2976,
                3108
            ],
            [
                3108,
                3250
            ],
            [
                3250,
                3349
            ],
            [
                3349,
                3393
            ],
            [
                3393,
                3585
            ],
            [
                3585,
                3711
            ],
            [
                3711,
                3988
            ],
            [
                3988,
                4050
            ],
            [
                4050,
                4296
            ],
            [
                4296,
                4363
            ],
            [
                4363,
                4383
            ],
            [
                4383,
                4450
            ],
            [
                4450,
                4520
            ],
            [
                4520,
                4563
            ],
            [
                4563,
                4576
            ],
            [
                4576,
                4617
            ],
            [
                4617,
                4647
            ],
            [
                4647,
                4709
            ],
            [
                4709,
                4758
            ],
            [
                4758,
                4779
            ],
            [
                4779,
                4804
            ],
            [
                4804,
                4919
            ],
            [
                4919,
                4938
            ],
            [
                4938,
                4987
            ],
            [
                4987,
                5113
            ],
            [
                5113,
                5161
            ],
            [
                5161,
                5279
            ],
            [
                5279,
                5382
            ],
            [
                5382,
                5495
            ],
            [
                5495,
                5597
            ],
            [
                5597,
                5748
            ],
            [
                5748,
                5759
            ],
            [
                5759,
                5770
            ],
            [
                5770,
                5863
            ],
            [
                5863,
                5894
            ],
            [
                5894,
                6010
            ],
            [
                6010,
                6269
            ],
            [
                6269,
                6312
            ],
            [
                6312,
                6409
            ],
            [
                6409,
                6481
            ],
            [
                6481,
                6603
            ],
            [
                6603,
                6652
            ],
            [
                6652,
                6672
            ],
            [
                6672,
                6739
            ],
            [
                6739,
                6796
            ],
            [
                6796,
                6873
            ],
            [
                6873,
                6911
            ],
            [
                6911,
                6959
            ],
            [
                6959,
                7021
            ],
            [
                7021,
                7085
            ],
            [
                7085,
                7153
            ],
            [
                7153,
                7326
            ],
            [
                7326,
                7439
            ],
            [
                7439,
                7525
            ],
            [
                7525,
                7605
            ],
            [
                7605,
                7627
            ],
            [
                7627,
                7672
            ],
            [
                7672,
                7781
            ],
            [
                7781,
                7802
            ],
            [
                7802,
                7910
            ],
            [
                7910,
                7946
            ],
            [
                7946,
                8035
            ],
            [
                8035,
                8136
            ],
            [
                8136,
                8282
            ],
            [
                8282,
                8313
            ],
            [
                8313,
                8373
            ],
            [
                8373,
                8476
            ],
            [
                8476,
                8525
            ],
            [
                8525,
                8566
            ],
            [
                8566,
                8705
            ],
            [
                8705,
                8743
            ],
            [
                8743,
                8792
            ],
            [
                8792,
                8821
            ],
            [
                8821,
                8903
            ],
            [
                8903,
                9089
            ],
            [
                9089,
                9101
            ],
            [
                9101,
                9127
            ],
            [
                9127,
                9205
            ],
            [
                9205,
                9292
            ],
            [
                9292,
                9375
            ],
            [
                9375,
                9417
            ],
            [
                9417,
                9450
            ],
            [
                9450,
                9515
            ],
            [
                9515,
                9619
            ],
            [
                9619,
                9650
            ],
            [
                9650,
                9775
            ],
            [
                9775,
                9914
            ],
            [
                9914,
                9970
            ],
            [
                9970,
                10180
            ],
            [
                10180,
                10332
            ],
            [
                10332,
                10362
            ],
            [
                10362,
                10482
            ],
            [
                10482,
                10496
            ],
            [
                10496,
                10666
            ],
            [
                10666,
                11050
            ],
            [
                11050,
                11134
            ],
            [
                11134,
                11242
            ],
            [
                11242,
                11369
            ],
            [
                11369,
                11394
            ],
            [
                11394,
                11532
            ],
            [
                11532,
                11609
            ],
            [
                11609,
                11690
            ],
            [
                11690,
                11769
            ],
            [
                11769,
                11914
            ],
            [
                11914,
                12168
            ],
            [
                12168,
                12258
            ],
            [
                12258,
                12290
            ],
            [
                12290,
                12395
            ],
            [
                12395,
                12533
            ],
            [
                12533,
                12574
            ],
            [
                12574,
                12669
            ],
            [
                12669,
                12715
            ],
            [
                12715,
                12819
            ],
            [
                12819,
                12891
            ],
            [
                12891,
                12912
            ],
            [
                12912,
                12944
            ],
            [
                12944,
                13004
            ],
            [
                13004,
                13058
            ],
            [
                13058,
                13133
            ],
            [
                13133,
                13202
            ],
            [
                13202,
                13217
            ],
            [
                13217,
                13364
            ],
            [
                13364,
                13398
            ],
            [
                13398,
                13446
            ],
            [
                13446,
                13574
            ],
            [
                13574,
                13624
            ],
            [
                13624,
                13664
            ],
            [
                13664,
                13678
            ],
            [
                13678,
                13705
            ],
            [
                13705,
                13812
            ],
            [
                13812,
                13856
            ],
            [
                13856,
                13867
            ],
            [
                13867,
                13886
            ],
            [
                13886,
                13894
            ],
            [
                13894,
                14098
            ],
            [
                14098,
                14163
            ],
            [
                14163,
                14205
            ],
            [
                14205,
                14362
            ],
            [
                14362,
                14450
            ],
            [
                14450,
                14475
            ],
            [
                14475,
                14497
            ],
            [
                14497,
                14565
            ],
            [
                14565,
                14683
            ],
            [
                14683,
                14734
            ],
            [
                14734,
                14757
            ],
            [
                14757,
                14765
            ],
            [
                14765,
                14877
            ],
            [
                14877,
                14921
            ],
            [
                14921,
                15005
            ],
            [
                15005,
                15101
            ],
            [
                15101,
                15332
            ],
            [
                15332,
                15495
            ],
            [
                15495,
                15581
            ],
            [
                15581,
                15613
            ],
            [
                15613,
                15638
            ],
            [
                15638,
                15648
            ],
            [
                15648,
                15684
            ],
            [
                15684,
                15716
            ],
            [
                15716,
                15728
            ],
            [
                15728,
                15739
            ],
            [
                15739,
                15769
            ],
            [
                15769,
                15794
            ],
            [
                15794,
                15810
            ],
            [
                15810,
                15848
            ],
            [
                15848,
                15916
            ],
            [
                15916,
                15977
            ],
            [
                15977,
                16012
            ],
            [
                16012,
                16043
            ],
            [
                16043,
                16106
            ],
            [
                16106,
                16143
            ],
            [
                16143,
                16200
            ],
            [
                16200,
                16274
            ],
            [
                16274,
                16294
            ],
            [
                16294,
                16316
            ],
            [
                16316,
                16360
            ],
            [
                16360,
                16428
            ],
            [
                16428,
                16473
            ],
            [
                16473,
                16537
            ],
            [
                16537,
                16576
            ],
            [
                16576,
                16597
            ],
            [
                16597,
                16631
            ],
            [
                16631,
                16688
            ],
            [
                16688,
                16717
            ],
            [
                16717,
                16772
            ],
            [
                16772,
                16796
            ],
            [
                16796,
                16824
            ],
            [
                16824,
                16880
            ],
            [
                16880,
                16900
            ],
            [
                16900,
                16904
            ],
            [
                16904,
                16918
            ],
            [
                16918,
                16958
            ],
            [
                16958,
                17011
            ],
            [
                17011,
                17049
            ],
            [
                17049,
                17134
            ],
            [
                17134,
                17175
            ],
            [
                17175,
                17210
            ],
            [
                17210,
                17225
            ],
            [
                17225,
                17280
            ],
            [
                17280,
                17290
            ],
            [
                17290,
                17301
            ],
            [
                17301,
                17327
            ],
            [
                17327,
                17333
            ],
            [
                17333,
                17352
            ],
            [
                17352,
                17432
            ],
            [
                17432,
                17482
            ],
            [
                17482,
                17518
            ],
            [
                17518,
                17542
            ],
            [
                17542,
                17562
            ],
            [
                17562,
                17602
            ],
            [
                17602,
                17640
            ],
            [
                17640,
                17667
            ],
            [
                17667,
                17752
            ],
            [
                17752,
                17780
            ],
            [
                17780,
                17808
            ],
            [
                17808,
                17902
            ],
            [
                17902,
                18063
            ],
            [
                18063,
                18125
            ],
            [
                18125,
                18193
            ],
            [
                18193,
                18275
            ],
            [
                18275,
                18324
            ],
            [
                18324,
                18404
            ],
            [
                18404,
                18521
            ],
            [
                18521,
                18608
            ],
            [
                18608,
                18622
            ],
            [
                18622,
                18690
            ],
            [
                18690,
                18704
            ],
            [
                18704,
                18744
            ],
            [
                18744,
                18751
            ],
            [
                18751,
                18835
            ],
            [
                18835,
                18864
            ],
            [
                18864,
                18893
            ],
            [
                18893,
                18905
            ],
            [
                18905,
                18921
            ],
            [
                18921,
                18942
            ],
            [
                18942,
                18970
            ],
            [
                18970,
                18997
            ],
            [
                18997,
                19041
            ],
            [
                19041,
                19087
            ],
            [
                19087,
                19122
            ],
            [
                19122,
                19303
            ],
            [
                19303,
                19387
            ],
            [
                19387,
                19420
            ],
            [
                19420,
                19426
            ],
            [
                19426,
                19455
            ],
            [
                19455,
                19500
            ],
            [
                19500,
                19732
            ],
            [
                19732,
                19942
            ],
            [
                19942,
                20032
            ],
            [
                20032,
                20081
            ],
            [
                20081,
                20198
            ],
            [
                20198,
                20280
            ],
            [
                20280,
                20302
            ],
            [
                20302,
                20328
            ],
            [
                20328,
                20360
            ],
            [
                20360,
                20393
            ],
            [
                20393,
                20419
            ],
            [
                20419,
                20445
            ],
            [
                20445,
                20648
            ],
            [
                20648,
                20710
            ],
            [
                20710,
                20840
            ],
            [
                20840,
                20933
            ],
            [
                20933,
                21007
            ],
            [
                21007,
                21160
            ],
            [
                21160,
                21241
            ],
            [
                21241,
                21302
            ],
            [
                21302,
                21471
            ],
            [
                21471,
                21508
            ],
            [
                21508,
                21821
            ]
        ],
        "overlap_chars": [
            [
                0,
                94
            ],
            [
                95,
                97
            ],
            [
                98,
                110
            ],
            [
                111,
                136
            ],
            [
                136,
                142
            ],
            [
                143,
                293
            ],
            [
                293,
                295
            ],
            [
                295,
                447
            ],
            [
                447,
                469
            ],
            [
                470,
                493
            ],
            [
                494,
                544
            ],
            [
                545,
                570
            ],
            [
                570,
                671
            ],
            [
                671,
                715
            ],
            [
                732,
                797
            ],
            [
                797,
                816
            ],
            [
                823,
                832
            ],
            [
                835,
                840
            ],
            [
                840,
                869
            ],
            [
                870,
                873
            ],
            [
                874,
                879
            ],
            [
                883,
                887
            ],
            [
                893,
                962
            ],
            [
                962,
                1039
            ],
            [
                1040,
                1044
            ],
            [
                1044,
                1046
            ],
            [
                1046,
                1087
            ],
            [
                1092,
                1096
            ],
            [
                1097,
                1111
            ],
            [
                1112,
                1278
            ],
            [
                1278,
                1307
            ],
            [
                1308,
                1355
            ],
            [
                1355,
                1465
            ],
            [
                1474,
                1487
            ],
            [
                1487,
                1489
            ],
            [
                1490,
                1607
            ],
            [
                1608,
                1669
            ],
            [
                1669,
                1814
            ],
            [
                1814,
                1829
            ],
            [
                1848,
                1890
            ],
            [
                1891,
                1920
            ],
            [
                1920,
                1975
            ],
            [
                1976,
                2018
            ],
            [
                2018,
                2033
            ],
            [
                2042,
                2126
            ],
            [
                2127,
                2131
            ],
            [
                2140,
                2152
            ],
            [
                2172,
                2210
            ],
            [
                2213,
                2263
            ],
            [
                2263,
                2317
            ],
            [
                2317,
                2348
            ],
            [
                2349,
                2374
            ],
            [
                2374,
                2426
            ],
            [
                2428,
                2496
            ],
            [
                2497,
                2543
            ],
            [
                2543,
                2617
            ],
            [
                2617,
                2620
            ],
            [
                2621,
                2624
            ],
            [
                2625,
                2713
            ],
            [
                2713,
                2740
            ],
            [
                2741,
                2744
            ],
            [
                2745,
                2769
            ],
            [
                2769,
                2845
            ],
            [
                2846,
                2905
            ],
            [
                2912,
                2917
            ],
            [
                2918,
                2974
            ],
            [
                2974,
                2976
            ],
            [
                2976,
                3017
            ],
            [
                3018,
                3026
            ],
            [
                3027,
                3106
            ],
            [
                3106,
                3108
            ],
            [
                3108,
                3250
            ],
            [
                3250,
                3265
            ],
            [
                3266,
                3268
            ],
            [
                3269,
                3278
            ],
            [
                3283,
                3349
            ],
            [
                3349,
                3393
            ],
            [
                3393,
                3409
            ],
            [
                3410,
                3413
            ],
            [
                3414,
                3481
            ],
            [
                3481,
                3508
            ],
            [
                3509,
                3517
            ],
            [
                3518,
                3560
            ],
            [
                3561,
                3585
            ],
            [
                3585,
                3687
            ],
            [
                3693,
                3696
            ],
            [
                3697,
                3711
            ],
            [
                3711,
                3730
            ],
            [
                3731,
                3833
            ],
            [
                3834,
                3855
            ],
            [
                3855,
                3985
            ],
            [
                3985,
                3987
            ],
            [
                3988,
                4025
            ],
            [
                4032,
                4035
            ],
            [
                4048,
                4050
            ],
            [
                4050,
                4054
            ],
            [
                4055,
                4084
            ],
            [
                4094,
                4104
            ],
            [
                4104,
                4143
            ],
            [
                4144,
                4223
            ],
            [
                4224,
                4270
            ],
            [
                4283,
                4296
            ],
            [
                4296,
                4337
            ],
            [
                4344,
                4347
            ],
            [
                4348,
                4352
            ],
            [
                4353,
                4361
            ],
            [
                4361,
                4363
            ],
            [
                4363,
                4377
            ],
            [
                4378,
                4381
            ],
            [
                4381,
                4383
            ],
            [
                4383,
                4447
            ],
            [
                4447,
                4450
            ],
            [
                4450,
                4518
            ],
            [
                4518,
                4520
            ],
            [
                4520,
                4563
            ],
            [
                4563,
                4576
            ],
            [
                4576,
                4617
            ],
            [
                4617,
                4647
            ],
            [
                4647,
                4709
            ],
            [
                4709,
                4758
            ],
            [
                4758,
                4768
            ],
            [
                4768,
                4779
            ],
            [
                4779,
                4804
            ],
            [
                4804,
                4833
            ],
            [
                4834,
                4917
            ],
            [
                4917,
                4919
            ],
            [
                4919,
                4936
            ],
            [
                4936,
                4938
            ],
            [
                4938,
                4985
            ],
            [
                4985,
                4987
            ],
            [
                4987,
                5027
            ],
            [
                5027,
                5044
            ],
            [
                5047,
                5113
            ],
            [
                5113,
                5161
            ],
            [
                5161,
                5176
            ],
            [
                5177,
                5279
            ],
            [
                5279,
                5319
            ],
            [
                5319,
                5382
            ],
            [
                5382,
                5408
            ],
            [
                5416,
                5423
            ],
            [
                5426,
                5489
            ],
            [
                5493,
                5495
            ],
            [
                5495,
                5502
            ],
            [
                5503,
                5505
            ],
            [
                5506,
                5522
            ],
            [
                5526,
                5531
            ],
            [
                5532,
                5596
            ],
            [
                5597,
                5613
            ],
            [
                5614,
                5719
            ],
            [
                5720,
                5747
            ],
            [
                5748,
                5759
            ],
            [
                5759,
                5770
            ],
            [
                5770,
                5786
            ],
            [
                5787,
                5863
            ],
            [
                5863,
                5892
            ],
            [
                5892,
                5894
            ],
            [
                5894,
                5992
            ],
            [
                6002,
                6009
            ],
            [
                6010,
                6039
            ],
            [
                6043,
                6048
            ],
            [
                6049,
                6053
            ],
            [
                6054,
                6091
            ],
            [
                6092,
                6109
            ],
            [
                6110,
                6113
            ],
            [
                6114,
                6135
            ],
            [
                6135,
                6136
            ],
            [
                6146,
                6161
            ],
            [
                6162,
                6165
            ],
            [
                6166,
                6197
            ],
            [
                6198,
                6212
            ],
            [
                6213,
                6221
            ],
            [
                6222,
                6229
            ],
            [
                6232,
                6241
            ],
            [
                6244,
                6269
            ],
            [
                6269,
                6270
            ],
            [
                6270,
                6310
            ],
            [
                6310,
                6312
            ],
            [
                6312,
                6409
            ],
            [
                6409,
                6463
            ],
            [
                6463,
                6481
            ],
            [
                6481,
                6562
            ],
            [
                6565,
                6589
            ],
            [
                6590,
                6603
            ],
            [
                6603,
                6638
            ],
            [
                6650,
                6652
            ],
            [
                6652,
                6672
            ],
            [
                6672,
                6708
            ],
            [
                6709,
                6739
            ],
            [
                6739,
                6796
            ],
            [
                6796,
                6809
            ],
            [
                6825,
                6873
            ],
            [
                6873,
                6911
            ],
            [
                6911,
                6959
            ],
            [
                6959,
                7021
            ],
            [
                7021,
                7025
            ],
            [
                7031,
                7085
            ],
            [
                7085,
                7087
            ],
            [
                7094,
                7151
            ],
            [
                7151,
                7153
            ],
            [
                7153,
                7201
            ],
            [
                7214,
                7240
            ],
            [
                7241,
                7276
            ],
            [
                7277,
                7298
            ],
            [
                7298,
                7326
            ],
            [
                7326,
                7408
            ],
            [
                7409,
                7418
            ],
            [
                7419,
                7424
            ],
            [
                7425,
                7427
            ],
            [
                7428,
                7436
            ],
            [
                7436,
                7439
            ],
            [
                7439,
                7525
            ],
            [
                7525,
                7528
            ],
            [
                7528,
                7550
            ],
            [
                7550,
                7582
            ],
            [
                7590,
                7605
            ],
            [
                7605,
                7627
            ],
            [
                7627,
                7672
            ],
            [
                7672,
                7781
            ],
            [
                7781,
                7802
            ],
            [
                7806,
                7862
            ],
            [
                7869,
                7910
            ],
            [
                7910,
                7943
            ],
            [
                7946,
                7947
            ],
            [
                7958,
                7998
            ],
            [
                7999,
                8035
            ],
            [
                8035,
                8100
            ],
            [
                8101,
                8136
            ],
            [
                8136,
                8248
            ],
            [
                8249,
                8254
            ],
            [
                8269,
                8272
            ],
            [
                8280,
                8282
            ],
            [
                8282,
                8313
            ],
            [
                8313,
                8350
            ],
            [
                8357,
                8373
            ],
            [
                8373,
                8409
            ],
            [
                8410,
                8476
            ],
            [
                8476,
                8523
            ],
            [
                8523,
                8525
            ],
            [
                8526,
                8566
            ],
            [
                8566,
                8590
            ],
            [
                8591,
                8594
            ],
            [
                8594,
                8654
            ],
            [
                8655,
                8667
            ],
            [
                8668,
                8675
            ],
            [
                8690,
                8696
            ],
            [
                8703,
                8705
            ],
            [
                8705,
                8743
            ],
            [
                8743,
                8754
            ],
            [
                8762,
                8792
            ],
            [
                8792,
                8821
            ],
            [
                8821,
                8835
            ],
            [
                8836,
                8888
            ],
            [
                8891,
                8903
            ],
            [
                8903,
                8969
            ],
            [
                8970,
                9020
            ],
            [
                9021,
                9089
            ],
            [
                9089,
                9101
            ],
            [
                9101,
                9127
            ],
            [
                9127,
                9205
            ],
            [
                9205,
                9230
            ],
            [
                9231,
                9264
            ],
            [
                9264,
                9265
            ],
            [
                9266,
                9292
            ],
            [
                9292,
                9373
            ],
            [
                9373,
                9375
            ],
            [
                9375,
                9417
            ],
            [
                9417,
                9450
            ],
            [
                9450,
                9515
            ],
            [
                9515,
                9571
            ],
            [
                9574,
                9580
            ],
            [
                9581,
                9616
            ],
            [
                9619,
                9647
            ],
            [
                9647,
                9650
            ],
            [
                9650,
                9690
            ],
            [
                9691,
                9716
            ],
            [
                9717,
                9774
            ],
            [
                9775,
                9914
            ],
            [
                9914,
                9970
            ],
            [
                9970,
                10021
            ],
            [
                10027,
                10028
            ],
            [
                10045,
                10072
            ],
            [
                10073,
                10075
            ],
            [
                10084,
                10118
            ],
            [
                10133,
                10136
            ],
            [
                10137,
                10180
            ],
            [
                10180,
                10197
            ],
            [
                10203,
                10267
            ],
            [
                10268,
                10332
            ],
            [
                10332,
                10360
            ],
            [
                10360,
                10361
            ],
            [
                10362,
                10430
            ],
            [
                10430,
                10482
            ],
            [
                10482,
                10496
            ],
            [
                10496,
                10532
            ],
            [
                10540,
                10587
            ],
            [
                10587,
                10663
            ],
            [
                10663,
                10666
            ],
            [
                10666,
                10677
            ],
            [
                10688,
                10696
            ],
            [
                10697,
                10915
            ],
            [
                10918,
                11050
            ],
            [
                11050,
                11079
            ],
            [
                11093,
                11111
            ],
            [
                11112,
                11134
            ],
            [
                11134,
                11172
            ],
            [
                11191,
                11216
            ],
            [
                11217,
                11242
            ],
            [
                11242,
                11308
            ],
            [
                11308,
                11339
            ],
            [
                11340,
                11341
            ],
            [
                11356,
                11369
            ],
            [
                11369,
                11375
            ],
            [
                11384,
                11394
            ],
            [
                11394,
                11420
            ],
            [
                11421,
                11473
            ],
            [
                11483,
                11503
            ],
            [
                11504,
                11517
            ],
            [
                11520,
                11532
            ],
            [
                11532,
                11609
            ],
            [
                11609,
                11672
            ],
            [
                11688,
                11690
            ],
            [
                11690,
                11712
            ],
            [
                11717,
                11769
            ],
            [
                11769,
                11796
            ],
            [
                11797,
                11895
            ],
            [
                11896,
                11914
            ],
            [
                11914,
                12020
            ],
            [
                12022,
                12076
            ],
            [
                12078,
                12166
            ],
            [
                12166,
                12168
            ],
            [
                12168,
                12202
            ],
            [
                12203,
                12258
            ],
            [
                12258,
                12290
            ],
            [
                12290,
                12299
            ],
            [
                12300,
                12395
            ],
            [
                12395,
                12533
            ],
            [
                12533,
                12574
            ],
            [
                12578,
                12643
            ],
            [
                12644,
                12669
            ],
            [
                12669,
                12714
            ],
            [
                12720,
                12723
            ],
            [
                12724,
                12727
            ],
            [
                12728,
                12767
            ],
            [
                12767,
                12772
            ],
            [
                12777,
                12779
            ],
            [
                12784,
                12791
            ],
            [
                12792,
                12795
            ],
            [
                12796,
                12817
            ],
            [
                12817,
                12819
            ],
            [
                12819,
                12820
            ],
            [
                12829,
                12891
            ],
            [
                12891,
                12912
            ],
            [
                12912,
                12944
            ],
            [
                12944,
                13004
            ],
            [
                13004,
                13055
            ],
            [
                13058,
                13117
            ],
            [
                13122,
                13131
            ],
            [
                13131,
                13133
            ],
            [
                13133,
                13202
            ],
            [
                13202,
                13217
            ],
            [
                13217,
                13233
            ],
            [
                13235,
                13331
            ],
            [
                13332,
                13340
            ],
            [
                13351,
                13356
            ],
            [
                13357,
                13361
            ],
            [
                13364,
                13398
            ],
            [
                13398,
                13445
            ],
            [
                13446,
                13474
            ],
            [
                13474,
                13535
            ],
            [
                13536,
                13540
            ],
            [
                13547,
                13574
            ],
            [
                13574,
                13622
            ],
            [
                13622,
                13624
            ],
            [
                13625,
                13664
            ],
            [
                13664,
                13678
            ],
            [
                13678,
                13705
            ],
            [
                13705,
                13809
            ],
            [
                13812,
                13856
            ],
            [
                13856,
                13867
            ],
            [
                13867,
                13877
            ],
            [
                13884,
                13886
            ],
            [
                13886,
                13894
            ],
            [
                13894,
                13897
            ],
            [
                13898,
                13901
            ],
            [
                13908,
                13924
            ],
            [
                13925,
                13994
            ],
            [
                14000,
                14006
            ],
            [
                14008,
                14090
            ],
            [
                14096,
                14098
            ],
            [
                14098,
                14163
            ],
            [
                14163,
                14171
            ],
            [
                14183,
                14203
            ],
            [
                14205,
                14240
            ],
            [
                14240,
                14322
            ],
            [
                14323,
                14362
            ],
            [
                14362,
                14369
            ],
            [
                14370,
                14450
            ],
            [
                14450,
                14451
            ],
            [
                14463,
                14472
            ],
            [
                14475,
                14495
            ],
            [
                14495,
                14496
            ],
            [
                14497,
                14526
            ],
            [
                14526,
                14565
            ],
            [
                14565,
                14615
            ],
            [
                14621,
                14623
            ],
            [
                14624,
                14627
            ],
            [
                14628,
                14635
            ],
            [
                14636,
                14681
            ],
            [
                14681,
                14683
            ],
            [
                14683,
                14734
            ],
            [
                14734,
                14757
            ],
            [
                14757,
                14765
            ],
            [
                14765,
                14796
            ],
            [
                14797,
                14842
            ],
            [
                14843,
                14877
            ],
            [
                14877,
                14921
            ],
            [
                14921,
                15005
            ],
            [
                15005,
                15101
            ],
            [
                15101,
                15109
            ],
            [
                15110,
                15116
            ],
            [
                15117,
                15120
            ],
            [
                15121,
                15132
            ],
            [
                15133,
                15136
            ],
            [
                15137,
                15153
            ],
            [
                15154,
                15158
            ],
            [
                15159,
                15174
            ],
            [
                15175,
                15186
            ],
            [
                15187,
                15266
            ],
            [
                15278,
                15285
            ],
            [
                15286,
                15332
            ],
            [
                15332,
                15352
            ],
            [
                15352,
                15495
            ],
            [
                15495,
                15512
            ],
            [
                15514,
                15581
            ],
            [
                15581,
                15584
            ],
            [
                15584,
                15613
            ],
            [
                15613,
                15638
            ],
            [
                15638,
                15647
            ],
            [
                15648,
                15657
            ],
            [
                15663,
                15670
            ],
            [
                15671,
                15677
            ],
            [
                15682,
                15684
            ],
            [
                15684,
                15714
            ],
            [
                15714,
                15716
            ],
            [
                15716,
                15728
            ],
            [
                15728,
                15739
            ],
            [
                15739,
                15769
            ],
            [
                15769,
                15794
            ],
            [
                15794,
                15807
            ],
            [
                15811,
                15815
            ],
            [
                15817,
                15848
            ],
            [
                15848,
                15916
            ],
            [
                15916,
                15977
            ],
            [
                15977,
                16012
            ],
            [
                16012,
                16043
            ],
            [
                16043,
                16104
            ],
            [
                16104,
                16106
            ],
            [
                16106,
                16143
            ],
            [
                16143,
                16146
            ],
            [
                16147,
                16200
            ],
            [
                16200,
                16227
            ],
            [
                16227,
                16274
            ],
            [
                16274,
                16294
            ],
            [
                16294,
                16316
            ],
            [
                16316,
                16360
            ],
            [
                16360,
                16401
            ],
            [
                16412,
                16428
            ],
            [
                16428,
                16473
            ],
            [
                16473,
                16537
            ],
            [
                16537,
                16574
            ],
            [
                16576,
                16580
            ],
            [
                16581,
                16595
            ],
            [
                16595,
                16597
            ],
            [
                16597,
                16607
            ],
            [
                16612,
                16631
            ],
            [
                16631,
                16688
            ],
            [
                16688,
                16717
            ],
            [
                16717,
                16730
            ],
            [
                16731,
                16770
            ],
            [
                16770,
                16772
            ],
            [
                16772,
                16796
            ],
            [
                16796,
                16824
            ],
            [
                16824,
                16851
            ],
            [
                16854,
                16880
            ],
            [
                16880,
                16900
            ],
            [
                16900,
                16904
            ],
            [
                16904,
                16918
            ],
            [
                16918,
                16933
            ],
            [
                16938,
                16945
            ],
            [
                16956,
                16958
            ],
            [
                16958,
                17011
            ],
            [
                17011,
                17038
            ],
            [
                17047,
                17049
            ],
            [
                17049,
                17121
            ],
            [
                17122,
                17125
            ],
            [
                17132,
                17134
            ],
            [
                17134,
                17175
            ],
            [
                17175,
                17210
            ],
            [
                17210,
                17225
            ],
            [
                17225,
                17251
            ],
            [
                17264,
                17280
            ],
            [
                17280,
                17290
            ],
            [
                17290,
                17301
            ],
            [
                17301,
                17327
            ],
            [
                17327,
                17333
            ],
            [
                17333,
                17352
            ],
            [
                17352,
                17391
            ],
            [
                17392,
                17432
            ],
            [
                17432,
                17482
            ],
            [
                17482,
                17490
            ],
            [
                17491,
                17516
            ],
            [
                17518,
                17542
            ],
            [
                17542,
                17562
            ],
            [
                17567,
                17602
            ],
            [
                17602,
                17608
            ],
            [
                17609,
                17640
            ],
            [
                17640,
                17667
            ],
            [
                17667,
                17677
            ],
            [
                17677,
                17692
            ],
            [
                17692,
                17752
            ],
            [
                17752,
                17780
            ],
            [
                17780,
                17808
            ],
            [
                17808,
                17902
            ],
            [
                17902,
                18017
            ],
            [
                18017,
                18032
            ],
            [
                18032,
                18063
            ],
            [
                18063,
                18125
            ],
            [
                18125,
                18128
            ],
            [
                18129,
                18159
            ],
            [
                18160,
                18192
            ],
            [
                18193,
                18225
            ],
            [
                18226,
                18272
            ],
            [
                18275,
                18276
            ],
            [
                18282,
                18324
            ],
            [
                18324,
                18401
            ],
            [
                18404,
                18521
            ],
            [
                18521,
                18608
            ],
            [
                18608,
                18622
            ],
            [
                18622,
                18690
            ],
            [
                18690,
                18704
            ],
            [
                18704,
                18744
            ],
            [
                18744,
                18751
            ],
            [
                18751,
                18835
            ],
            [
                18835,
                18864
            ],
            [
                18864,
                18893
            ],
            [
                18893,
                18905
            ],
            [
                18905,
                18921
            ],
            [
                18921,
                18942
            ],
            [
                18942,
                18970
            ],
            [
                18970,
                18997
            ],
            [
                18997,
                19041
            ],
            [
                19041,
                19087
            ],
            [
                19087,
                19122
            ],
            [
                19122,
                19178
            ],
            [
                19179,
                19216
            ],
            [
                19216,
                19303
            ],
            [
                19303,
                19315
            ],
            [
                19316,
                19325
            ],
            [
                19326,
                19364
            ],
            [
                19365,
                19387
            ],
            [
                19387,
                19420
            ],
            [
                19420,
                19426
            ],
            [
                19426,
                19455
            ],
            [
                19455,
                19497
            ],
            [
                19497,
                19500
            ],
            [
                19500,
                19703
            ],
            [
                19717,
                19732
            ],
            [
                19732,
                19752
            ],
            [
                19753,
                19819
            ],
            [
                19819,
                19940
            ],
            [
                19940,
                19942
            ],
            [
                19942,
                19980
            ],
            [
                19981,
                19996
            ],
            [
                20007,
                20032
            ],
            [
                20032,
                20050
            ],
            [
                20051,
                20080
            ],
            [
                20081,
                20141
            ],
            [
                20142,
                20186
            ],
            [
                20191,
                20196
            ],
            [
                20196,
                20198
            ],
            [
                20198,
                20217
            ],
            [
                20217,
                20280
            ],
            [
                20280,
                20302
            ],
            [
                20302,
                20328
            ],
            [
                20328,
                20360
            ],
            [
                20360,
                20393
            ],
            [
                20393,
                20419
            ],
            [
                20419,
                20445
            ],
            [
                20445,
                20611
            ],
            [
                20619,
                20629
            ],
            [
                20638,
                20648
            ],
            [
                20648,
                20710
            ],
            [
                20710,
                20722
            ],
            [
                20727,
                20837
            ],
            [
                20840,
                20933
            ],
            [
                20933,
                21007
            ],
            [
                21007,
                21160
            ],
            [
                21160,
                21240
            ],
            [
                21241,
                21302
            ],
            [
                21302,
                21358
            ],
            [
                21360,
                21404
            ],
            [
                21405,
                21427
            ],
            [
                21429,
                21439
            ],
            [
                21440,
                21469
            ],
            [
                21469,
                21471
            ],
            [
                21471,
                21508
            ],
            [
                21508,
                21799
            ],
            [
                21800,
                21821
            ]
        ],
        "row_chars": [
            [
                0,
                136
            ],
            [
                136,
                295
            ],
            [
                295,
                447
            ],
            [
                447,
                570
            ],
            [
                570,
                671
            ],
            [
                671,
                797
            ],
            [
                797,
                962
            ],
            [
                962,
                1046
            ],
            [
                1046,
                1278
            ],
            [
                1278,
                1490
            ],
            [
                1490,
                1490
            ],
            [
                1490,
                1669
            ],
            [
                1669,
                1814
            ],
            [
                1814,
                1814
            ],
            [
                1814,
                1920
            ],
            [
                1920,
                2018
            ],
            [
                2018,
                2263
            ],
            [
                2263,
                2374
            ],
            [
                2374,
                2617
            ],
            [
                2617,
                2713
            ],
            [
                2713,
                2769
            ],
            [
                2769,
                2976
            ],
            [
                2976,
                3108
            ],
            [
                3108,
                3250
            ],
            [
                3250,
                3349
            ],
            [
                3349,
                3393
            ],
            [
                3393,
                3585
            ],
            [
                3585,
                3711
            ],
            [
                3711,
                3988
            ],
            [
                3988,
                4050
            ],
            [
                4050,
                4296
            ],
            [
                4296,
                4363
            ],
            [
                4363,
                4383
            ],
            [
                4383,
                4450
            ],
            [
                4450,
                4520
            ],
            [
                4520,
                4563
            ],
            [
                4563,
                4576
            ],
            [
                4576,
                4617
            ],
            [
                4617,
                4647
            ],
            [
                4647,
                4709
            ],
            [
                4709,
                4758
            ],
            [
                4758,
                4779
            ],
            [
                4779,
                4804
            ],
            [
                4804,
                4919
            ],
            [
                4919,
                4919
            ],
            [
                4919,
                4938
            ],
            [
                4938,
                4987
            ],
            [
                4987,
                5113
            ],
            [
                5113,
                5161
            ],
            [
                5161,
                5279
            ],
            [
                5279,
                5382
            ],
            [
                5382,
                5495
            ],
            [
                5495,
                5597
            ],
            [
                5597,
                5748
            ],
            [
                5748,
                5759
            ],
            [
                5759,
                5770
            ],
            [
                5770,
                5863
            ],
            [
                5863,
                5894
            ],
            [
                5894,
                6010
            ],
            [
                6010,
                6010
            ],
            [
                6010,
                6269
            ],
            [
                6269,
                6269
            ],
            [
                6269,
                6269
            ],
            [
                6269,
                6269
            ],
            [
                6269,
                6269
            ],
            [
                6269,
                6312
            ],
            [
                6312,
                6409
            ],
            [
                6409,
                6481
            ],
            [
                6481,
                6603
            ],
            [
                6603,
                6652
            ],
            [
                6652,
                6672
            ],
            [
                6672,
                6739
            ],
            [
                6739,
                6796
            ],
            [
                6796,
                6873
            ],
            [
                6873,
                6911
            ],
            [
                6911,
                6959
            ],
            [
                6959,
                7021
            ],
            [
                7021,
                7085
            ],
            [
                7085,
                7153
            ],
            [
                7153,
                7326
            ],
            [
                7326,
                7439
            ],
            [
                7439,
                7525
            ],
            [
                7525,
                7605
            ],
            [
                7605,
                7605
            ],
            [
                7605,
                7627
            ],
            [
                7627,
                7672
            ],
            [
                7672,
                7781
            ],
            [
                7781,
                7802
            ],
            [
                7802,
                7910
            ],
            [
                7910,
                7946
            ],
            [
                7946,
                7946
            ],
            [
                7946,
                8035
            ],
            [
                8035,
                8136
            ],
            [
                8136,
                8282
            ],
            [
                8282,
                8313
            ],
            [
                8313,
                8373
            ],
            [
                8373,
                8476
            ],
            [
                8476,
                8525
            ],
            [
                8525,
                8566
            ],
            [
                8566,
                8705
            ],
            [
                8705,
                8743
            ],
            [
                8743,
                8792
            ],
            [
                8792,
                8821
            ],
            [
                8821,
                8903
            ],
            [
                8903,
                9089
            ],
            [
                9089,
                9101
            ],
            [
                9101,
                9127
            ],
            [
                9127,
                9205
            ],
            [
                9205,
                9292
            ],
            [
                9292,
                9375
            ],
            [
                9375,
                9375
            ],
            [
                9375,
                9417
            ],
            [
                9417,
                9450
            ],
            [
                9450,
                9515
            ],
            [
                9515,
                9619
            ],
            [
                9619,
                9650
            ],
            [
                9650,
                9775
            ],
            [
                9775,
                9775
            ],
            [
                9775,
                9775
            ],
            [
                9775,
                9914
            ],
            [
                9914,
                9970
            ],
            [
                9970,
                10180
            ],
            [
                10180,
                10332
            ],
            [
                10332,
                10332
            ],
            [
                10332,
                10362
            ],
            [
                10362,
                10362
            ],
            [
                10362,
                10482
            ],
            [
                10482,
                10496
            ],
            [
                10496,
                10666
            ],
            [
                10666,
                11050
            ],
            [
                11050,
                11134
            ],
            [
                11134,
                11242
            ],
            [
                11242,
                11369
            ],
            [
                11369,
                11394
            ],
            [
                11394,
                11532
            ],
            [
                11532,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11690
            ],
            [
                11690,
                11690
            ],
            [
                11690,
                11690
            ],
            [
                11690,
                11769
            ],
            [
                11769,
                11914
            ],
            [
                11914,
                12168
            ],
            [
                12168,
                12168
            ],
            [
                12168,
                12258
            ],
            [
                12258,
                12290
            ],
            [
                12290,
                12395
            ],
            [
                12395,
                12533
            ],
            [
                12533,
                12574
            ],
            [
                12574,
                12669
            ],
            [
                12669,
                12715
            ],
            [
                12715,
                12819
            ],
            [
                12819,
                12891
            ],
            [
                12891,
                12912
            ],
            [
                12912,
                12944
            ],
            [
                12944,
                13004
            ],
            [
                13004,
                13004
            ],
            [
                13004,
                13004
            ],
            [
                13004,
                13058
            ],
            [
                13058,
                13133
            ],
            [
                13133,
                13202
            ],
            [
                13202,
                13217
            ],
            [
                13217,
                13217
            ],
            [
                13217,
                13217
            ],
            [
                13217,
                13364
            ],
            [
                13364,
                13364
            ],
            [
                13364,
                13398
            ],
            [
                13398,
                13446
            ],
            [
                13446,
                13446
            ],
            [
                13446,
                13574
            ],
            [
                13574,
                13624
            ],
            [
                13624,
                13624
            ],
            [
                13624,
                13624
            ],
            [
                13624,
                13664
            ],
            [
                13664,
                13678
            ],
            [
                13678,
                13705
            ],
            [
                13705,
                13812
            ],
            [
                13812,
                13856
            ],
            [
                13856,
                13867
            ],
            [
                13867,
                13886
            ],
            [
                13886,
                13894
            ],
            [
                13894,
                13894
            ],
            [
                13894,
                14098
            ],
            [
                14098,
                14163
            ],
            [
                14163,
                14362
            ],
            [
                14362,
                14450
            ],
            [
                14450,
                14497
            ],
            [
                14497,
                14497
            ],
            [
                14497,
                14497
            ],
            [
                14497,
                14497
            ],
            [
                14497,
                14497
            ],
            [
                14497,
                14497
            ],
            [
                14497,
                14565
            ],
            [
                14565,
                14683
            ],
            [
                14683,
                14734
            ],
            [
                14734,
                14757
            ],
            [
                14757,
                14765
            ],
            [
                14765,
                14877
            ],
            [
                14877,
                14877
            ],
            [
                14877,
                14921
            ],
            [
                14921,
                15005
            ],
            [
                15005,
                15101
            ],
            [
                15101,
                15332
            ],
            [
                15332,
                15495
            ],
            [
                15495,
                15581
            ],
            [
                15581,
                15613
            ],
            [
                15613,
                15638
            ],
            [
                15638,
                15648
            ],
            [
                15648,
                15684
            ],
            [
                15684,
                15684
            ],
            [
                15684,
                15716
            ],
            [
                15716,
                15728
            ],
            [
                15728,
                15739
            ],
            [
                15739,
                15769
            ],
            [
                15769,
                15794
            ],
            [
                15794,
                15810
            ],
            [
                15810,
                15810
            ],
            [
                15810,
                15848
            ],
            [
                15848,
                15848
            ],
            [
                15848,
                15916
            ],
            [
                15916,
                15977
            ],
            [
                15977,
                16012
            ],
            [
                16012,
                16043
            ],
            [
                16043,
                16106
            ],
            [
                16106,
                16143
            ],
            [
                16143,
                16200
            ],
            [
                16200,
                16274
            ],
            [
                16274,
                16274
            ],
            [
                16274,
                16274
            ],
            [
                16274,
                16274
            ],
            [
                16274,
                16274
            ],
            [
                16274,
                16274
            ],
            [
                16274,
                16294
            ],
            [
                16294,
                16316
            ],
            [
                16316,
                16360
            ],
            [
                16360,
                16428
            ],
            [
                16428,
                16473
            ],
            [
                16473,
                16473
            ],
            [
                16473,
                16473
            ],
            [
                16473,
                16473
            ],
            [
                16473,
                16473
            ],
            [
                16473,
                16537
            ],
            [
                16537,
                16576
            ],
            [
                16576,
                16597
            ],
            [
                16597,
                16631
            ],
            [
                16631,
                16631
            ],
            [
                16631,
                16631
            ],
            [
                16631,
                16688
            ],
            [
                16688,
                16717
            ],
            [
                16717,
                16772
            ],
            [
                16772,
                16796
            ],
            [
                16796,
                16824
            ],
            [
                16824,
                16880
            ],
            [
                16880,
                16900
            ],
            [
                16900,
                16904
            ],
            [
                16904,
                16918
            ],
            [
                16918,
                16958
            ],
            [
                16958,
                17011
            ],
            [
                17011,
                17011
            ],
            [
                17011,
                17011
            ],
            [
                17011,
                17049
            ],
            [
                17049,
                17049
            ],
            [
                17049,
                17134
            ],
            [
                17134,
                17175
            ],
            [
                17175,
                17210
            ],
            [
                17210,
                17225
            ],
            [
                17225,
                17280
            ],
            [
                17280,
                17290
            ],
            [
                17290,
                17301
            ],
            [
                17301,
                17327
            ],
            [
                17327,
                17333
            ],
            [
                17333,
                17352
            ],
            [
                17352,
                17432
            ],
            [
                17432,
                17482
            ],
            [
                17482,
                17518
            ],
            [
                17518,
                17518
            ],
            [
                17518,
                17518
            ],
            [
                17518,
                17518
            ],
            [
                17518,
                17518
            ],
            [
                17518,
                17542
            ],
            [
                17542,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17602
            ],
            [
                17602,
                17640
            ],
            [
                17640,
                17667
            ],
            [
                17667,
                17667
            ],
            [
                17667,
                17752
            ],
            [
                17752,
                17780
            ],
            [
                17780,
                17808
            ],
            [
                17808,
                17902
            ],
            [
                17902,
                18063
            ],
            [
                18063,
                18125
            ],
            [
                18125,
                18125
            ],
            [
                18125,
                18193
            ],
            [
                18193,
                18275
            ],
            [
                18275,
                18275
            ],
            [
                18275,
                18324
            ],
            [
                18324,
                18404
            ],
            [
                18404,
                18404
            ],
            [
                18404,
                18404
            ],
            [
                18404,
                18404
            ],
            [
                18404,
                18521
            ],
            [
                18521,
                18608
            ],
            [
                18608,
                18622
            ],
            [
                18622,
                18690
            ],
            [
                18690,
                18704
            ],
            [
                18704,
                18744
            ],
            [
                18744,
                18751
            ],
            [
                18751,
                18751
            ],
            [
                18751,
                18751
            ],
            [
                18751,
                18751
            ],
            [
                18751,
                18751
            ],
            [
                18751,
                18835
            ],
            [
                18835,
                18864
            ],
            [
                18864,
                18893
            ],
            [
                18893,
                18905
            ],
            [
                18905,
                18921
            ],
            [
                18921,
                18942
            ],
            [
                18942,
                18970
            ],
            [
                18970,
                18997
            ],
            [
                18997,
                19041
            ],
            [
                19041,
                19087
            ],
            [
                19087,
                19122
            ],
            [
                19122,
                19303
            ],
            [
                19303,
                19387
            ],
            [
                19387,
                19420
            ],
            [
                19420,
                19426
            ],
            [
                19426,
                19455
            ],
            [
                19455,
                19500
            ],
            [
                19500,
                19732
            ],
            [
                19732,
                19942
            ],
            [
                19942,
                20032
            ],
            [
                20032,
                20081
            ],
            [
                20081,
                20198
            ],
            [
                20198,
                20280
            ],
            [
                20280,
                20302
            ],
            [
                20302,
                20328
            ],
            [
                20328,
                20360
            ],
            [
                20360,
                20393
            ],
            [
                20393,
                20419
            ],
            [
                20419,
                20445
            ],
            [
                20445,
                20648
            ],
            [
                20648,
                20710
            ],
            [
                20710,
                20840
            ],
            [
                20840,
                20840
            ],
            [
                20840,
                20840
            ],
            [
                20840,
                20933
            ],
            [
                20933,
                21007
            ],
            [
                21007,
                21160
            ],
            [
                21160,
                21241
            ],
            [
                21241,
                21302
            ],
            [
                21302,
                21471
            ],
            [
                21471,
                21508
            ],
            [
                21508,
                21821
            ]
        ]
    }
}