{
    "original": {
        "text": "Charley and I did not set off alone upon our expedition into Lincolnshire. My guardian had made up his mind not to lose sight of me until I was safe in Mr. Boythorn's house, so he accompanied us, and we were two days upon the road. I found every breath of air, and every scent, and every flower and leaf and blade of grass, and every passing cloud, and everything in nature, more beautiful and wonderful to me than I had ever found it yet. This was my first gain from my illness. How little I had lost, when the wide world was so full of delight for me.\nMy guardian intending to go back immediately, we appointed, on our way down, a day when my dear girl should come. I wrote her a letter, of which he took charge, and he left us within half an hour of our arrival at our destination, on a delightful evening in the early summer-time.\nIf a good fairy had built the house for me with a wave of her wand, and I had been a princess and her favoured god-child, I could not have been more considered in it. So many preparations were made for me and such an endearing remembrance was shown of all my little tastes and likings that I could have sat down, overcome, a dozen times before I had revisited half the rooms. I did better than that, however, by showing them all to Charley instead. Charley's delight calmed mine; and after we had had a walk in the garden, and Charley had exhausted her whole vocabulary of admiring expressions, I was as tranquilly happy as I ought to have been. It was a great comfort to be able to say to myself after tea, \"Esther, my dear, I think you are quite sensible enough to sit down now and write a note of thanks to your host.\" He had left a note of welcome for me, as sunny as his own face, and had confided his bird to my care, which I knew to be his highest mark of confidence. Accordingly I wrote a little note to him in London, telling him how all his favourite plants and trees were looking, and how the most astonishing of birds had chirped the honours of the house to me in the most hospitable manner, and how, after singing on my shoulder, to the inconceivable rapture of my little maid, he was then at roost in the usual corner of his cage, but whether dreaming or no I could not report. My note finished and sent off to the post, I made myself very busy in unpacking and arranging; and I sent Charley to bed in good time and told her I should want her no more that night.\nFor I had not yet looked in the glass and had never asked to have my own restored to me. I knew this to be a weakness which must be overcome, but I had always said to myself that I would begin afresh when I got to where I now was. Therefore I had wanted to be alone, and therefore I said, now alone, in my own room, \"Esther, if you are to be happy, if you are to have any right to pray to be true-hearted, you must keep your word, my dear.\" I was quite resolved to keep it, but I sat down for a little while first to reflect upon all my blessings. And then I said my prayers and thought a little more.\nMy hair had not been cut off, though it had been in danger more than once. It was long and thick. I let it down, and shook it out, and went up to the glass upon the dressing-table. There was a little muslin curtain drawn across it. I drew it back and stood for a moment looking through such a veil of my own hair that I could see nothing else. Then I put my hair aside and looked at the reflection in the mirror, encouraged by seeing how placidly it looked at me. I was very much changed--oh, very, very much. At first my face was so strange to me that I think I should have put my hands before it and started back but for the encouragement I have mentioned. Very soon it became more familiar, and then I knew the extent of the alteration in it better than I had done at first. It was not like what I had expected, but I had expected nothing definite, and I dare say anything definite would have surprised me.\nI had never been a beauty and had never thought myself one, but I had been very different from this. It was all gone now. Heaven was so good to me that I could let it go with a few not bitter tears and could stand there arranging my hair for the night quite thankfully.\nOne thing troubled me, and I considered it for a long time before I went to sleep. I had kept Mr. Woodcourt's flowers. When they were withered I had dried them and put them in a book that I was fond of. Nobody knew this, not even Ada. I was doubtful whether I had a right to preserve what he had sent to one so different--whether it was generous towards him to do it. I wished to be generous to him, even in the secret depths of my heart, which he would never know, because I could have loved him--could have been devoted to him. At last I came to the conclusion that I might keep them if I treasured them only as a remembrance of what was irrevocably past and gone, never to be looked back on any more, in any other light. I hope this may not seem trivial. I was very much in earnest.\nI took care to be up early in the morning and to be before the glass when Charley came in on tiptoe.\n\"Dear, dear, miss!\" cried Charley, starting. \"Is that you?\"\n\"Yes, Charley,\" said I, quietly putting up my hair. \"And I am very well indeed, and very happy.\"\nI saw it was a weight off Charley's mind, but it was a greater weight off mine. I knew the worst now and was composed to it. I shall not conceal, as I go on, the weaknesses I could not quite conquer, but they always passed from me soon and the happier frame of mind stayed by me faithfully.\nWishing to be fully re-established in my strength and my good spirits before Ada came, I now laid down a little series of plans with Charley for being in the fresh air all day long. We were to be out before breakfast, and were to dine early, and were to be out again before and after dinner, and were to talk in the garden after tea, and were to go to rest betimes, and were to climb every hill and explore every road, lane, and field in the neighbourhood. As to restoratives and strengthening delicacies, Mr. Boythorn's good housekeeper was for ever trotting about with something to eat or drink in her hand; I could not even be heard of as resting in the park but she would come trotting after me with a basket, her cheerful face shining with a lecture on the importance of frequent nourishment. Then there was a pony expressly for my riding, a chubby pony with a short neck and a mane all over his eyes who could canter--when he would--so easily and quietly that he was a treasure. In a very few days he would come to me in the paddock when I called him, and eat out of my hand, and follow me about. We arrived at such a capital understanding that when he was jogging with me lazily, and rather obstinately, down some shady lane, if I patted his neck and said, \"Stubbs, I am surprised you don't canter when you know how much I like it; and I think you might oblige me, for you are only getting stupid and going to sleep,\" he would give his head a comical shake or two and set off directly, while Charley would stand still and laugh with such enjoyment that her laughter was like music. I don't know who had given Stubbs his name, but it seemed to belong to him as naturally as his rough coat. Once we put him in a little chaise and drove him triumphantly through the green lanes for five miles; but all at once, as we were extolling him to the skies, he seemed to take it ill that he should have been accompanied so far by the circle of tantalizing little gnats that had been hovering round and round his ears the whole way without appearing to advance an inch, and stopped to think about it. I suppose he came to the decision that it was not to be borne, for he steadily refused to move until I gave the reins to Charley and got out and walked, when he followed me with a sturdy sort of good humour, putting his head under my arm and rubbing his ear against my sleeve. It was in vain for me to say, \"Now, Stubbs, I feel quite sure from what I know of you that you will go on if I ride a little while,\" for the moment I left him, he stood stock still again. Consequently I was obliged to lead the way, as before; and in this order we returned home, to the great delight of the village.\nCharley and I had reason to call it the most friendly of villages, I am sure, for in a week's time the people were so glad to see us go by, though ever so frequently in the course of a day, that there were faces of greeting in every cottage. I had known many of the grown people before and almost all the children, but now the very steeple began to wear a familiar and affectionate look. Among my new friends was an old old woman who lived in such a little thatched and whitewashed dwelling that when the outside shutter was turned up on its hinges, it shut up the whole house-front. This old lady had a grandson who was a sailor, and I wrote a letter to him for her and drew at the top of it the chimney-corner in which she had brought him up and where his old stool yet occupied its old place. This was considered by the whole village the most wonderful achievement in the world, but when an answer came back all the way from Plymouth, in which he mentioned that he was going to take the picture all the way to America, and from America would write again, I got all the credit that ought to have been given to the post-office and was invested with the merit of the whole system.\nThus, what with being so much in the air, playing with so many children, gossiping with so many people, sitting on invitation in so many cottages, going on with Charley's education, and writing long letters to Ada every day, I had scarcely any time to think about that little loss of mine and was almost always cheerful. If I did think of it at odd moments now and then, I had only to be busy and forget it. I felt it more than I had hoped I should once when a child said, \"Mother, why is the lady not a pretty lady now like she used to be?\" But when I found the child was not less fond of me, and drew its soft hand over my face with a kind of pitying protection in its touch, that soon set me up again. There were many little occurrences which suggested to me, with great consolation, how natural it is to gentle hearts to be considerate and delicate towards any inferiority. One of these particularly touched me. I happened to stroll into the little church when a marriage was just concluded, and the young couple had to sign the register.\nThe bridegroom, to whom the pen was handed first, made a rude cross for his mark; the bride, who came next, did the same. Now, I had known the bride when I was last there, not only as the prettiest girl in the place, but as having quite distinguished herself in the school, and I could not help looking at her with some surprise. She came aside and whispered to me, while tears of honest love and admiration stood in her bright eyes, \"He's a dear good fellow, miss; but he can't write yet--he's going to learn of me--and I wouldn't shame him for the world!\" Why, what had I to fear, I thought, when there was this nobility in the soul of a labouring man's daughter!\nThe air blew as freshly and revivingly upon me as it had ever blown, and the healthy colour came into my new face as it had come into my old one. Charley was wonderful to see, she was so radiant and so rosy; and we both enjoyed the whole day and slept soundly the whole night.\nThere was a favourite spot of mine in the park-woods of Chesney Wold where a seat had been erected commanding a lovely view. The wood had been cleared and opened to improve this point of sight, and the bright sunny landscape beyond was so beautiful that I rested there at least once every day. A picturesque part of the Hall, called the Ghost's Walk, was seen to advantage from this higher ground; and the startling name, and the old legend in the Dedlock family which I had heard from Mr. Boythorn accounting for it, mingled with the view and gave it something of a mysterious interest in addition to its real charms. There was a bank here, too, which was a famous one for violets; and as it was a daily delight of Charley's to gather wild flowers, she took as much to the spot as I did.\nIt would be idle to inquire now why I never went close to the house or never went inside it. The family were not there, I had heard on my arrival, and were not expected. I was far from being incurious or uninterested about the building; on the contrary, I often sat in this place wondering how the rooms ranged and whether any echo like a footstep really did resound at times, as the story said, upon the lonely Ghost's Walk. The indefinable feeling with which Lady Dedlock had impressed me may have had some influence in keeping me from the house even when she was absent. I am not sure. Her face and figure were associated with it, naturally; but I cannot say that they repelled me from it, though something did. For whatever reason or no reason, I had never once gone near it, down to the day at which my story now arrives.\nI was resting at my favourite point after a long ramble, and Charley was gathering violets at a little distance from me. I had been looking at the Ghost's Walk lying in a deep shade of masonry afar off and picturing to myself the female shape that was said to haunt it when I became aware of a figure approaching through the wood. The perspective was so long and so darkened by leaves, and the shadows of the branches on the ground made it so much more intricate to the eye, that at first I could not discern what figure it was. By little and little it revealed itself to be a woman's--a lady's--Lady Dedlock's. She was alone and coming to where I sat with a much quicker step, I observed to my surprise, than was usual with her.\nI was fluttered by her being unexpectedly so near (she was almost within speaking distance before I knew her) and would have risen to continue my walk. But I could not. I was rendered motionless. Not so much by her hurried gesture of entreaty, not so much by her quick advance and outstretched hands, not so much by the great change in her manner and the absence of her haughty self-restraint, as by a something in her face that I had pined for and dreamed of when I was a little child, something I had never seen in any face, something I had never seen in hers before.\nA dread and faintness fell upon me, and I called to Charley. Lady Dedlock stopped upon the instant and changed back almost to what I had known her.\n\"Miss Summerson, I am afraid I have startled you,\" she said, now advancing slowly. \"You can scarcely be strong yet. You have been very ill, I know. I have been much concerned to hear it.\"\nI could no more have removed my eyes from her pale face than I could have stirred from the bench on which I sat. She gave me her hand, and its deadly coldness, so at variance with the enforced composure of her features, deepened the fascination that overpowered me. I cannot say what was in my whirling thoughts.\n\"You are recovering again?\" she asked kindly.\n\"I was quite well but a moment ago, Lady Dedlock.\"\n\"Is this your young attendant?\"\n\"Yes.\"\n\"Will you send her on before and walk towards your house with me?\"\n\"Charley,\" said I, \"take your flowers home, and I will follow you directly.\"\nCharley, with her best curtsy, blushingly tied on her bonnet and went her way. When she was gone, Lady Dedlock sat down on the seat beside me.\nI cannot tell in any words what the state of my mind was when I saw in her hand my handkerchief with which I had covered the dead baby.\nI looked at her, but I could not see her, I could not hear her, I could not draw my breath. The beating of my heart was so violent and wild that I felt as if my life were breaking from me. But when she caught me to her breast, kissed me, wept over me, compassionated me, and called me back to myself; when she fell down on her knees and cried to me, \"Oh, my child, my child, I am your wicked and unhappy mother! Oh, try to forgive me!\"--when I saw her at my feet on the bare earth in her great agony of mind, I felt, through all my tumult of emotion, a burst of gratitude to the providence of God that I was so changed as that I never could disgrace her by any trace of likeness, as that nobody could ever now look at me and look at her and remotely think of any near tie between us.\nI raised my mother up, praying and beseeching her not to stoop before me in such affliction and humiliation. I did so in broken, incoherent words, for besides the trouble I was in, it frightened me to see her at MY feet. I told her--or I tried to tell her--that if it were for me, her child, under any circumstances to take upon me to forgive her, I did it, and had done it, many, many years. I told her that my heart overflowed with love for her, that it was natural love which nothing in the past had changed or could change. That it was not for me, then resting for the first time on my mother's bosom, to take her to account for having given me life, but that my duty was to bless her and receive her, though the whole world turned from her, and that I only asked her leave to do it. I held my mother in my embrace, and she held me in hers, and among the still woods in the silence of the summer day there seemed to be nothing but our two troubled minds that was not at peace.\n\"To bless and receive me,\" groaned my mother, \"it is far too late. I must travel my dark road alone, and it will lead me where it will. From day to day, sometimes from hour to hour, I do not see the way before my guilty feet. This is the earthly punishment I have brought upon myself. I bear it, and I hide it.\"\nEven in the thinking of her endurance, she drew her habitual air of proud indifference about her like a veil, though she soon cast it off again.\n\"I must keep this secret, if by any means it can be kept, not wholly for myself. I have a husband, wretched and dishonouring creature that I am!\"\nThese words she uttered with a suppressed cry of despair, more terrible in its sound than any shriek. Covering her face with her hands, she shrank down in my embrace as if she were unwilling that I should touch her; nor could I, by my utmost persuasions or by any endearments I could use, prevail upon her to rise. She said, no, no, no, she could only speak to me so; she must be proud and disdainful everywhere else; she would be humbled and ashamed there, in the only natural moments of her life.\nMy unhappy mother told me that in my illness she had been nearly frantic. She had but then known that her child was living. She could not have suspected me to be that child before. She had followed me down here to speak to me but once in all her life. We never could associate, never could communicate, never probably from that time forth could interchange another word on earth. She put into my hands a letter she had written for my reading only and said when I had read it and destroyed it--but not so much for her sake, since she asked nothing, as for her husband's and my own--I must evermore consider her as dead. If I could believe that she loved me, in this agony in which I saw her, with a mother's love, she asked me to do that, for then I might think of her with a greater pity, imagining what she suffered. She had put herself beyond all hope and beyond all help. Whether she preserved her secret until death or it came to be discovered and she brought dishonour and disgrace upon the name she had taken, it was her solitary struggle always; and no affection could come near her, and no human creature could render her any aid.\n\"But is the secret safe so far?\" I asked. \"Is it safe now, dearest mother?\"\n\"No,\" replied my mother. \"It has been very near discovery. It was saved by an accident. It may be lost by another accident--to-morrow, any day.\"\n\"Do you dread a particular person?\"\n\"Hush! Do not tremble and cry so much for me. I am not worthy of these tears,\" said my mother, kissing my hands. \"I dread one person very much.\"\n\"An enemy?\"\n\"Not a friend. One who is too passionless to be either. He is Sir Leicester Dedlock's lawyer, mechanically faithful without attachment, and very jealous of the profit, privilege, and reputation of being master of the mysteries of great houses.\"\n\"Has he any suspicions?\"\n\"Many.\"\n\"Not of you?\" I said alarmed.\n\"Yes! He is always vigilant and always near me. I may keep him at a standstill, but I can never shake him off.\"\n\"Has he so little pity or compunction?\"\n\"He has none, and no anger. He is indifferent to everything but his calling. His calling is the acquisition of secrets and the holding possession of such power as they give him, with no sharer or opponent in it.\"\n\"Could you trust in him?\"\n\"I shall never try. The dark road I have trodden for so many years will end where it will. I follow it alone to the end, whatever the end be. It may be near, it may be distant; while the road lasts, nothing turns me.\"\n\"Dear mother, are you so resolved?\"\n\"I AM resolved. I have long outbidden folly with folly, pride with pride, scorn with scorn, insolence with insolence, and have outlived many vanities with many more. I will outlive this danger, and outdie it, if I can. It has closed around me almost as awfully as if these woods of Chesney Wold had closed around the house, but my course through it is the same. I have but one; I can have but one.\"\n\"Mr. Jarndyce--\" I was beginning when my mother hurriedly inquired, \"Does HE suspect?\"\n\"No,\" said I. \"No, indeed! Be assured that he does not!\" And I told her what he had related to me as his knowledge of my story. \"But he is so good and sensible,\" said I, \"that perhaps if he knew--\"\nMy mother, who until this time had made no change in her position, raised her hand up to my lips and stopped me.\n\"Confide fully in him,\" she said after a little while. \"You have my free consent--a small gift from such a mother to her injured child!--but do not tell me of it. Some pride is left in me even yet.\"\nI explained, as nearly as I could then, or can recall now--for my agitation and distress throughout were so great that I scarcely understood myself, though every word that was uttered in the mother's voice, so unfamiliar and so melancholy to me, which in my childhood I had never learned to love and recognize, had never been sung to sleep with, had never heard a blessing from, had never had a hope inspired by, made an enduring impression on my memory--I say I explained, or tried to do it, how I had only hoped that Mr. Jarndyce, who had been the best of fathers to me, might be able to afford some counsel and support to her. But my mother answered no, it was impossible; no one could help her. Through the desert that lay before her, she must go alone.\n\"My child, my child!\" she said. \"For the last time! These kisses for the last time! These arms upon my neck for the last time! We shall meet no more. To hope to do what I seek to do, I must be what I have been so long. Such is my reward and doom. If you hear of Lady Dedlock, brilliant, prosperous, and flattered, think of your wretched mother, conscience-stricken, underneath that mask! Think that the reality is in her suffering, in her useless remorse, in her murdering within her breast the only love and truth of which it is capable! And then forgive her if you can, and cry to heaven to forgive her, which it never can!\"\nWe held one another for a little space yet, but she was so firm that she took my hands away, and put them back against my breast, and with a last kiss as she held them there, released them, and went from me into the wood. I was alone, and calm and quiet below me in the sun and shade lay the old house, with its terraces and turrets, on which there had seemed to me to be such complete repose when I first saw it, but which now looked like the obdurate and unpitying watcher of my mother's misery.\nStunned as I was, as weak and helpless at first as I had ever been in my sick chamber, the necessity of guarding against the danger of discovery, or even of the remotest suspicion, did me service. I took such precautions as I could to hide from Charley that I had been crying, and I constrained myself to think of every sacred obligation that there was upon me to be careful and collected. It was not a little while before I could succeed or could even restrain bursts of grief, but after an hour or so I was better and felt that I might return. I went home very slowly and told Charley, whom I found at the gate looking for me, that I had been tempted to extend my walk after Lady Dedlock had left me and that I was over-tired and would lie down. Safe in my own room, I read the letter. I clearly derived from it--and that was much then--that I had not been abandoned by my mother. Her elder and only sister, the godmother of my childhood, discovering signs of life in me when I had been laid aside as dead, had in her stern sense of duty, with no desire or willingness that I should live, reared me in rigid secrecy and had never again beheld my mother's face from within a few hours of my birth. So strangely did I hold my place in this world that until within a short time back I had never, to my own mother's knowledge, breathed--had been buried--had never been endowed with life--had never borne a name. When she had first seen me in the church she had been startled and had thought of what would have been like me if it had ever lived, and had lived on, but that was all then.\nWhat more the letter told me needs not to be repeated here. It has its own times and places in my story.\nMy first care was to burn what my mother had written and to consume even its ashes. I hope it may not appear very unnatural or bad in me that I then became heavily sorrowful to think I had ever been reared. That I felt as if I knew it would have been better and happier for many people if indeed I had never breathed. That I had a terror of myself as the danger and the possible disgrace of my own mother and of a proud family name. That I was so confused and shaken as to be possessed by a belief that it was right and had been intended that I should die in my birth, and that it was wrong and not intended that I should be then alive.\nThese are the real feelings that I had. I fell asleep worn out, and when I awoke I cried afresh to think that I was back in the world with my load of trouble for others. I was more than ever frightened of myself, thinking anew of her against whom I was a witness, of the owner of Chesney Wold, of the new and terrible meaning of the old words now moaning in my ear like a surge upon the shore, \"Your mother, Esther, was your disgrace, and you are hers. The time will come--and soon enough--when you will understand this better, and will feel it too, as no one save a woman can.\" With them, those other words returned, \"Pray daily that the sins of others be not visited upon your head.\" I could not disentangle all that was about me, and I felt as if the blame and the shame were all in me, and the visitation had come down.\nThe day waned into a gloomy evening, overcast and sad, and I still contended with the same distress. I went out alone, and after walking a little in the park, watching the dark shades falling on the trees and the fitful flight of the bats, which sometimes almost touched me, was attracted to the house for the first time. Perhaps I might not have gone near it if I had been in a stronger frame of mind. As it was, I took the path that led close by it.\nI did not dare to linger or to look up, but I passed before the terrace garden with its fragrant odours, and its broad walks, and its well-kept beds and smooth turf; and I saw how beautiful and grave it was, and how the old stone balustrades and parapets, and wide flights of shallow steps, were seamed by time and weather; and how the trained moss and ivy grew about them, and around the old stone pedestal of the sun-dial; and I heard the fountain falling. Then the way went by long lines of dark windows diversified by turreted towers and porches of eccentric shapes, where old stone lions and grotesque monsters bristled outside dens of shadow and snarled at the evening gloom over the escutcheons they held in their grip. Thence the path wound underneath a gateway, and through a court-yard where the principal entrance was (I hurried quickly on), and by the stables where none but deep voices seemed to be, whether in the murmuring of the wind through the strong mass of ivy holding to a high red wall, or in the low complaining of the weathercock, or in the barking of the dogs, or in the slow striking of a clock. So, encountering presently a sweet smell of limes, whose rustling I could hear, I turned with the turning of the path to the south front, and there above me were the balustrades of the Ghost's Walk and one lighted window that might be my mother's.\nThe way was paved here, like the terrace overhead, and my footsteps from being noiseless made an echoing sound upon the flags. Stopping to look at nothing, but seeing all I did see as I went, I was passing quickly on, and in a few moments should have passed the lighted window, when my echoing footsteps brought it suddenly into my mind that there was a dreadful truth in the legend of the Ghost's Walk, that it was I who was to bring calamity upon the stately house and that my warning feet were haunting it even then. Seized with an augmented terror of myself which turned me cold, I ran from myself and everything, retraced the way by which I had come, and never paused until I had gained the lodge-gate, and the park lay sullen and black behind me.\nNot before I was alone in my own room for the night and had again been dejected and unhappy there did I begin to know how wrong and thankless this state was. But from my darling who was coming on the morrow, I found a joyful letter, full of such loving anticipation that I must have been of marble if it had not moved me; from my guardian, too, I found another letter, asking me to tell Dame Durden, if I should see that little woman anywhere, that they had moped most pitiably without her, that the housekeeping was going to rack and ruin, that nobody else could manage the keys, and that everybody in and about the house declared it was not the same house and was becoming rebellious for her return. Two such letters together made me think how far beyond my deserts I was beloved and how happy I ought to be. That made me think of all my past life; and that brought me, as it ought to have done before, into a better condition.\nFor I saw very well that I could not have been intended to die, or I should never have lived; not to say should never have been reserved for such a happy life. I saw very well how many things had worked together for my welfare, and that if the sins of the fathers were sometimes visited upon the children, the phrase did not mean what I had in the morning feared it meant. I knew I was as innocent of my birth as a queen of hers and that before my Heavenly Father I should not be punished for birth nor a queen rewarded for it. I had had experience, in the shock of that very day, that I could, even thus soon, find comforting reconcilements to the change that had fallen on me. I renewed my resolutions and prayed to be strengthened in them, pouring out my heart for myself and for my unhappy mother and feeling that the darkness of the morning was passing away. It was not upon my sleep; and when the next day's light awoke me, it was gone.\nMy dear girl was to arrive at five o'clock in the afternoon. How to help myself through the intermediate time better than by taking a long walk along the road by which she was to come, I did not know; so Charley and I and Stubbs--Stubbs saddled, for we never drove him after the one great occasion--made a long expedition along that road and back. On our return, we held a great review of the house and garden and saw that everything was in its prettiest condition, and had the bird out ready as an important part of the establishment.\nThere were more than two full hours yet to elapse before she could come, and in that interval, which seemed a long one, I must confess I was nervously anxious about my altered looks. I loved my darling so well that I was more concerned for their effect on her than on any one. I was not in this slight distress because I at all repined--I am quite certain I did not, that day--but, I thought, would she be wholly prepared? When she first saw me, might she not be a little shocked and disappointed? Might it not prove a little worse than she expected? Might she not look for her old Esther and not find her? Might she not have to grow used to me and to begin all over again?\nI knew the various expressions of my sweet girl's face so well, and it was such an honest face in its loveliness, that I was sure beforehand she could not hide that first look from me. And I considered whether, if it should signify any one of these meanings, which was so very likely, could I quite answer for myself?\nWell, I thought I could. After last night, I thought I could. But to wait and wait, and expect and expect, and think and think, was such bad preparation that I resolved to go along the road again and meet her.\nSo I said to Charley, \"Charley, I will go by myself and walk along the road until she comes.\" Charley highly approving of anything that pleased me, I went and left her at home.\nBut before I got to the second milestone, I had been in so many palpitations from seeing dust in the distance (though I knew it was not, and could not, be the coach yet) that I resolved to turn back and go home again. And when I had turned, I was in such fear of the coach coming up behind me (though I still knew that it neither would, nor could, do any such thing) that I ran the greater part of the way to avoid being overtaken.\nThen, I considered, when I had got safe back again, this was a nice thing to have done! Now I was hot and had made the worst of it instead of the best.\nAt last, when I believed there was at least a quarter of an hour more yet, Charley all at once cried out to me as I was trembling in the garden, \"Here she comes, miss! Here she is!\"\nI did not mean to do it, but I ran upstairs into my room and hid myself behind the door. There I stood trembling, even when I heard my darling calling as she came upstairs, \"Esther, my dear, my love, where are you? Little woman, dear Dame Durden!\"\nShe ran in, and was running out again when she saw me. Ah, my angel girl! The old dear look, all love, all fondness, all affection. Nothing else in it--no, nothing, nothing!\nOh, how happy I was, down upon the floor, with my sweet beautiful girl down upon the floor too, holding my scarred face to her lovely cheek, bathing it with tears and kisses, rocking me to and fro like a child, calling me by every tender name that she could think of, and pressing me to her faithful heart.",
        "paragraph_chars": [
            [
                0,
                554
            ],
            [
                554,
                835
            ],
            [
                835,
                2412
            ],
            [
                2412,
                3014
            ],
            [
                3014,
                3924
            ],
            [
                3924,
                4194
            ],
            [
                4194,
                4980
            ],
            [
                4980,
                5081
            ],
            [
                5081,
                5141
            ],
            [
                5141,
                5238
            ],
            [
                5238,
                5529
            ],
            [
                5529,
                8218
            ],
            [
                8218,
                9399
            ],
            [
                9399,
                10442
            ],
            [
                10442,
                11108
            ],
            [
                11108,
                11385
            ],
            [
                11385,
                12174
            ],
            [
                12174,
                13001
            ],
            [
                13001,
                13731
            ],
            [
                13731,
                14301
            ],
            [
                14301,
                14449
            ],
            [
                14449,
                14637
            ],
            [
                14637,
                14950
            ],
            [
                14950,
                14996
            ],
            [
                14996,
                15047
            ],
            [
                15047,
                15079
            ],
            [
                15079,
                15086
            ],
            [
                15086,
                15153
            ],
            [
                15153,
                15230
            ],
            [
                15230,
                15373
            ],
            [
                15373,
                15509
            ],
            [
                15509,
                16293
            ],
            [
                16293,
                17274
            ],
            [
                17274,
                17586
            ],
            [
                17586,
                17731
            ],
            [
                17731,
                17877
            ],
            [
                17877,
                18376
            ],
            [
                18376,
                19515
            ],
            [
                19515,
                19591
            ],
            [
                19591,
                19736
            ],
            [
                19736,
                19772
            ],
            [
                19772,
                19917
            ],
            [
                19917,
                19929
            ],
            [
                19929,
                20174
            ],
            [
                20174,
                20199
            ],
            [
                20199,
                20207
            ],
            [
                20207,
                20237
            ],
            [
                20237,
                20349
            ],
            [
                20349,
                20389
            ],
            [
                20389,
                20602
            ],
            [
                20602,
                20628
            ],
            [
                20628,
                20846
            ],
            [
                20846,
                20882
            ],
            [
                20882,
                21281
            ],
            [
                21281,
                21368
            ],
            [
                21368,
                21566
            ],
            [
                21566,
                21679
            ],
            [
                21679,
                21878
            ],
            [
                21878,
                22636
            ],
            [
                22636,
                23263
            ],
            [
                23263,
                23761
            ],
            [
                23761,
                25345
            ],
            [
                25345,
                25450
            ],
            [
                25450,
                26087
            ],
            [
                26087,
                26911
            ],
            [
                26911,
                27363
            ],
            [
                27363,
                28733
            ],
            [
                28733,
                29486
            ],
            [
                29486,
                30416
            ],
            [
                30416,
                31359
            ],
            [
                31359,
                31895
            ],
            [
                31895,
                32569
            ],
            [
                32569,
                32887
            ],
            [
                32887,
                33097
            ],
            [
                33097,
                33274
            ],
            [
                33274,
                33706
            ],
            [
                33706,
                33858
            ],
            [
                33858,
                34040
            ],
            [
                34040,
                34288
            ],
            [
                34288,
                34462
            ],
            [
                34462,
                34768
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                232
            ],
            [
                232,
                440
            ],
            [
                440,
                480
            ],
            [
                480,
                554
            ],
            [
                554,
                668
            ],
            [
                668,
                835
            ],
            [
                835,
                1002
            ],
            [
                1002,
                1211
            ],
            [
                1211,
                1284
            ],
            [
                1284,
                1481
            ],
            [
                1481,
                1657
            ],
            [
                1657,
                1810
            ],
            [
                1810,
                2227
            ],
            [
                2227,
                2412
            ],
            [
                2412,
                2501
            ],
            [
                2501,
                2643
            ],
            [
                2643,
                2853
            ],
            [
                2853,
                2960
            ],
            [
                2960,
                3014
            ],
            [
                3014,
                3089
            ],
            [
                3089,
                3112
            ],
            [
                3112,
                3195
            ],
            [
                3195,
                3246
            ],
            [
                3246,
                3358
            ],
            [
                3358,
                3478
            ],
            [
                3478,
                3524
            ],
            [
                3524,
                3673
            ],
            [
                3673,
                3792
            ],
            [
                3792,
                3924
            ],
            [
                3924,
                4025
            ],
            [
                4025,
                4046
            ],
            [
                4046,
                4194
            ],
            [
                4194,
                4277
            ],
            [
                4277,
                4313
            ],
            [
                4313,
                4397
            ],
            [
                4397,
                4429
            ],
            [
                4429,
                4562
            ],
            [
                4562,
                4724
            ],
            [
                4724,
                4918
            ],
            [
                4918,
                4952
            ],
            [
                4952,
                4980
            ],
            [
                4980,
                5081
            ],
            [
                5081,
                5101
            ],
            [
                5101,
                5126
            ],
            [
                5126,
                5141
            ],
            [
                5141,
                5193
            ],
            [
                5193,
                5238
            ],
            [
                5238,
                5318
            ],
            [
                5318,
                5363
            ],
            [
                5363,
                5529
            ],
            [
                5529,
                5711
            ],
            [
                5711,
                5986
            ],
            [
                5986,
                6327
            ],
            [
                6327,
                6514
            ],
            [
                6514,
                6632
            ],
            [
                6632,
                7118
            ],
            [
                7118,
                7225
            ],
            [
                7225,
                7625
            ],
            [
                7625,
                7902
            ],
            [
                7902,
                8090
            ],
            [
                8090,
                8218
            ],
            [
                8218,
                8460
            ],
            [
                8460,
                8606
            ],
            [
                8606,
                8802
            ],
            [
                8802,
                9014
            ],
            [
                9014,
                9399
            ],
            [
                9399,
                9720
            ],
            [
                9720,
                9807
            ],
            [
                9807,
                9941
            ],
            [
                9941,
                10104
            ],
            [
                10104,
                10277
            ],
            [
                10277,
                10315
            ],
            [
                10315,
                10442
            ],
            [
                10442,
                10564
            ],
            [
                10564,
                10772
            ],
            [
                10772,
                11000
            ],
            [
                11000,
                11108
            ],
            [
                11108,
                11254
            ],
            [
                11254,
                11385
            ],
            [
                11385,
                11510
            ],
            [
                11510,
                11679
            ],
            [
                11679,
                12004
            ],
            [
                12004,
                12174
            ],
            [
                12174,
                12267
            ],
            [
                12267,
                12344
            ],
            [
                12344,
                12600
            ],
            [
                12600,
                12748
            ],
            [
                12748,
                12763
            ],
            [
                12763,
                12889
            ],
            [
                12889,
                13001
            ],
            [
                13001,
                13122
            ],
            [
                13122,
                13332
            ],
            [
                13332,
                13530
            ],
            [
                13530,
                13613
            ],
            [
                13613,
                13731
            ],
            [
                13731,
                13883
            ],
            [
                13883,
                13900
            ],
            [
                13900,
                13927
            ],
            [
                13927,
                14301
            ],
            [
                14301,
                14362
            ],
            [
                14362,
                14449
            ],
            [
                14449,
                14532
            ],
            [
                14532,
                14565
            ],
            [
                14565,
                14597
            ],
            [
                14597,
                14637
            ],
            [
                14637,
                14750
            ],
            [
                14750,
                14903
            ],
            [
                14903,
                14950
            ],
            [
                14950,
                14978
            ],
            [
                14978,
                14996
            ],
            [
                14996,
                15047
            ],
            [
                15047,
                15079
            ],
            [
                15079,
                15086
            ],
            [
                15086,
                15153
            ],
            [
                15153,
                15230
            ],
            [
                15230,
                15309
            ],
            [
                15309,
                15373
            ],
            [
                15373,
                15509
            ],
            [
                15509,
                15601
            ],
            [
                15601,
                15698
            ],
            [
                15698,
                15921
            ],
            [
                15921,
                15944
            ],
            [
                15944,
                16293
            ],
            [
                16293,
                16402
            ],
            [
                16402,
                16514
            ],
            [
                16514,
                16686
            ],
            [
                16686,
                16821
            ],
            [
                16821,
                17081
            ],
            [
                17081,
                17274
            ],
            [
                17274,
                17341
            ],
            [
                17341,
                17410
            ],
            [
                17410,
                17500
            ],
            [
                17500,
                17559
            ],
            [
                17559,
                17586
            ],
            [
                17586,
                17731
            ],
            [
                17731,
                17812
            ],
            [
                17812,
                17877
            ],
            [
                17877,
                17979
            ],
            [
                17979,
                18192
            ],
            [
                18192,
                18376
            ],
            [
                18376,
                18450
            ],
            [
                18450,
                18500
            ],
            [
                18500,
                18557
            ],
            [
                18557,
                18628
            ],
            [
                18628,
                18756
            ],
            [
                18756,
                18995
            ],
            [
                18995,
                19194
            ],
            [
                19194,
                19251
            ],
            [
                19251,
                19515
            ],
            [
                19515,
                19548
            ],
            [
                19548,
                19557
            ],
            [
                19557,
                19591
            ],
            [
                19591,
                19616
            ],
            [
                19616,
                19650
            ],
            [
                19650,
                19679
            ],
            [
                19679,
                19736
            ],
            [
                19736,
                19772
            ],
            [
                19772,
                19779
            ],
            [
                19779,
                19818
            ],
            [
                19818,
                19885
            ],
            [
                19885,
                19917
            ],
            [
                19917,
                19929
            ],
            [
                19929,
                19944
            ],
            [
                19944,
                19985
            ],
            [
                19985,
                20174
            ],
            [
                20174,
                20199
            ],
            [
                20199,
                20207
            ],
            [
                20207,
                20221
            ],
            [
                20221,
                20237
            ],
            [
                20237,
                20243
            ],
            [
                20243,
                20285
            ],
            [
                20285,
                20349
            ],
            [
                20349,
                20389
            ],
            [
                20389,
                20417
            ],
            [
                20417,
                20466
            ],
            [
                20466,
                20602
            ],
            [
                20602,
                20628
            ],
            [
                20628,
                20648
            ],
            [
                20648,
                20719
            ],
            [
                20719,
                20770
            ],
            [
                20770,
                20846
            ],
            [
                20846,
                20882
            ],
            [
                20882,
                20898
            ],
            [
                20898,
                21048
            ],
            [
                21048,
                21101
            ],
            [
                21101,
                21244
            ],
            [
                21244,
                21281
            ],
            [
                21281,
                21368
            ],
            [
                21368,
                21382
            ],
            [
                21382,
                21395
            ],
            [
                21395,
                21425
            ],
            [
                21425,
                21496
            ],
            [
                21496,
                21566
            ],
            [
                21566,
                21679
            ],
            [
                21679,
                21734
            ],
            [
                21734,
                21842
            ],
            [
                21842,
                21878
            ],
            [
                21878,
                22508
            ],
            [
                22508,
                22577
            ],
            [
                22577,
                22636
            ],
            [
                22636,
                22658
            ],
            [
                22658,
                22668
            ],
            [
                22668,
                22688
            ],
            [
                22688,
                22720
            ],
            [
                22720,
                22763
            ],
            [
                22763,
                22786
            ],
            [
                22786,
                22855
            ],
            [
                22855,
                22883
            ],
            [
                22883,
                23024
            ],
            [
                23024,
                23175
            ],
            [
                23175,
                23263
            ],
            [
                23263,
                23485
            ],
            [
                23485,
                23761
            ],
            [
                23761,
                23958
            ],
            [
                23958,
                24151
            ],
            [
                24151,
                24307
            ],
            [
                24307,
                24509
            ],
            [
                24509,
                24549
            ],
            [
                24549,
                24644
            ],
            [
                24644,
                24960
            ],
            [
                24960,
                25171
            ],
            [
                25171,
                25345
            ],
            [
                25345,
                25405
            ],
            [
                25405,
                25450
            ],
            [
                25450,
                25534
            ],
            [
                25534,
                25657
            ],
            [
                25657,
                25768
            ],
            [
                25768,
                25883
            ],
            [
                25883,
                26087
            ],
            [
                26087,
                26127
            ],
            [
                26127,
                26257
            ],
            [
                26257,
                26540
            ],
            [
                26540,
                26666
            ],
            [
                26666,
                26773
            ],
            [
                26773,
                26911
            ],
            [
                26911,
                27012
            ],
            [
                27012,
                27233
            ],
            [
                27233,
                27314
            ],
            [
                27314,
                27363
            ],
            [
                27363,
                27822
            ],
            [
                27822,
                28090
            ],
            [
                28090,
                28485
            ],
            [
                28485,
                28733
            ],
            [
                28733,
                28860
            ],
            [
                28860,
                29253
            ],
            [
                29253,
                29486
            ],
            [
                29486,
                29644
            ],
            [
                29644,
                30188
            ],
            [
                30188,
                30297
            ],
            [
                30297,
                30416
            ],
            [
                30416,
                30576
            ],
            [
                30576,
                30789
            ],
            [
                30789,
                30944
            ],
            [
                30944,
                31095
            ],
            [
                31095,
                31280
            ],
            [
                31280,
                31359
            ],
            [
                31359,
                31420
            ],
            [
                31420,
                31707
            ],
            [
                31707,
                31895
            ],
            [
                31895,
                32078
            ],
            [
                32078,
                32172
            ],
            [
                32172,
                32318
            ],
            [
                32318,
                32393
            ],
            [
                32393,
                32446
            ],
            [
                32446,
                32502
            ],
            [
                32502,
                32569
            ],
            [
                32569,
                32754
            ],
            [
                32754,
                32887
            ],
            [
                32887,
                32912
            ],
            [
                32912,
                32949
            ],
            [
                32949,
                33097
            ],
            [
                33097,
                33191
            ],
            [
                33191,
                33274
            ],
            [
                33274,
                33492
            ],
            [
                33492,
                33706
            ],
            [
                33706,
                33794
            ],
            [
                33794,
                33858
            ],
            [
                33858,
                34026
            ],
            [
                34026,
                34040
            ],
            [
                34040,
                34129
            ],
            [
                34129,
                34255
            ],
            [
                34255,
                34288
            ],
            [
                34288,
                34343
            ],
            [
                34343,
                34362
            ],
            [
                34362,
                34420
            ],
            [
                34420,
                34462
            ],
            [
                34462,
                34768
            ]
        ],
        "overlap_chars": [
            [
                0,
                75
            ],
            [
                75,
                86
            ],
            [
                180,
                232
            ],
            [
                232,
                303
            ],
            [
                322,
                347
            ],
            [
                373,
                440
            ],
            [
                440,
                480
            ],
            [
                480,
                552
            ],
            [
                554,
                565
            ],
            [
                576,
                586
            ],
            [
                598,
                602
            ],
            [
                612,
                668
            ],
            [
                668,
                689
            ],
            [
                693,
                706
            ],
            [
                765,
                783
            ],
            [
                833,
                835
            ],
            [
                835,
                902
            ],
            [
                957,
                1002
            ],
            [
                1002,
                1039
            ],
            [
                1040,
                1043
            ],
            [
                1087,
                1119
            ],
            [
                1120,
                1171
            ],
            [
                1209,
                1211
            ],
            [
                1211,
                1284
            ],
            [
                1284,
                1480
            ],
            [
                1660,
                1810
            ],
            [
                1822,
                1843
            ],
            [
                1844,
                2007
            ],
            [
                2037,
                2178
            ],
            [
                2225,
                2226
            ],
            [
                2227,
                2234
            ],
            [
                2248,
                2327
            ],
            [
                2365,
                2369
            ],
            [
                2333,
                2340
            ],
            [
                2374,
                2412
            ],
            [
                2412,
                2443
            ],
            [
                2499,
                2501
            ],
            [
                2558,
                2622
            ],
            [
                2641,
                2643
            ],
            [
                2643,
                2677
            ],
            [
                2693,
                2699
            ],
            [
                2701,
                2704
            ],
            [
                2726,
                2735
            ],
            [
                2816,
                2853
            ],
            [
                2853,
                2960
            ],
            [
                2960,
                3014
            ],
            [
                3014,
                3042
            ],
            [
                3089,
                3112
            ],
            [
                3112,
                3195
            ],
            [
                3195,
                3246
            ],
            [
                3246,
                3357
            ],
            [
                3358,
                3478
            ],
            [
                3478,
                3501
            ],
            [
                3503,
                3524
            ],
            [
                3524,
                3544
            ],
            [
                3548,
                3561
            ],
            [
                3671,
                3673
            ],
            [
                3673,
                3752
            ],
            [
                3790,
                3792
            ],
            [
                3792,
                3864
            ],
            [
                3922,
                3924
            ],
            [
                3924,
                4025
            ],
            [
                4025,
                4046
            ],
            [
                4046,
                4194
            ],
            [
                4194,
                4277
            ],
            [
                4277,
                4313
            ],
            [
                4313,
                4397
            ],
            [
                4397,
                4429
            ],
            [
                4429,
                4514
            ],
            [
                4516,
                4562
            ],
            [
                4562,
                4690
            ],
            [
                4692,
                4723
            ],
            [
                4724,
                4774
            ],
            [
                4780,
                4896
            ],
            [
                4916,
                4918
            ],
            [
                4918,
                4952
            ],
            [
                4952,
                4980
            ],
            [
                4980,
                5031
            ],
            [
                5032,
                5081
            ],
            [
                5081,
                5101
            ],
            [
                5101,
                5126
            ],
            [
                5126,
                5141
            ],
            [
                5141,
                5193
            ],
            [
                5193,
                5238
            ],
            [
                5238,
                5318
            ],
            [
                5318,
                5362
            ],
            [
                5529,
                5582
            ],
            [
                5586,
                5631
            ],
            [
                5651,
                5711
            ],
            [
                5711,
                5874
            ],
            [
                5928,
                5986
            ],
            [
                5986,
                5991
            ],
            [
                6009,
                6138
            ],
            [
                6139,
                6140
            ],
            [
                6171,
                6190
            ],
            [
                6195,
                6268
            ],
            [
                6325,
                6326
            ],
            [
                6327,
                6341
            ],
            [
                6374,
                6392
            ],
            [
                6410,
                6434
            ],
            [
                6349,
                6373
            ],
            [
                6468,
                6470
            ],
            [
                6406,
                6409
            ],
            [
                6490,
                6514
            ],
            [
                6514,
                6590
            ],
            [
                6615,
                6632
            ],
            [
                7152,
                7160
            ],
            [
                6688,
                6691
            ],
            [
                7145,
                7151
            ],
            [
                7223,
                7225
            ],
            [
                7225,
                7330
            ],
            [
                7344,
                7385
            ],
            [
                7335,
                7337
            ],
            [
                7455,
                7468
            ],
            [
                7481,
                7493
            ],
            [
                7533,
                7541
            ],
            [
                7592,
                7605
            ],
            [
                7623,
                7625
            ],
            [
                7692,
                7802
            ],
            [
                7805,
                7811
            ],
            [
                7820,
                7832
            ],
            [
                7867,
                7902
            ],
            [
                8039,
                8090
            ],
            [
                8090,
                8132
            ],
            [
                8143,
                8218
            ],
            [
                8251,
                8253
            ],
            [
                8254,
                8356
            ],
            [
                8408,
                8460
            ],
            [
                8460,
                8483
            ],
            [
                8490,
                8503
            ],
            [
                8531,
                8606
            ],
            [
                8606,
                8660
            ],
            [
                8666,
                8667
            ],
            [
                8675,
                8708
            ],
            [
                8939,
                8942
            ],
            [
                8816,
                8884
            ],
            [
                8800,
                8801
            ],
            [
                8894,
                8910
            ],
            [
                8766,
                8767
            ],
            [
                8889,
                8893
            ],
            [
                8911,
                8938
            ],
            [
                8972,
                8989
            ],
            [
                9012,
                9014
            ],
            [
                9014,
                9128
            ],
            [
                9141,
                9239
            ],
            [
                9276,
                9345
            ],
            [
                9397,
                9399
            ],
            [
                9405,
                9428
            ],
            [
                9439,
                9501
            ],
            [
                9544,
                9720
            ],
            [
                9720,
                9755
            ],
            [
                9768,
                9807
            ],
            [
                9807,
                9847
            ],
            [
                9853,
                9900
            ],
            [
                9903,
                9909
            ],
            [
                9919,
                9941
            ],
            [
                9941,
                9992
            ],
            [
                10077,
                10103
            ],
            [
                10104,
                10138
            ],
            [
                10239,
                10242
            ],
            [
                10275,
                10277
            ],
            [
                10281,
                10315
            ],
            [
                10315,
                10344
            ],
            [
                10352,
                10442
            ],
            [
                10442,
                10456
            ],
            [
                10492,
                10533
            ],
            [
                10550,
                10564
            ],
            [
                10564,
                10672
            ],
            [
                10679,
                10772
            ],
            [
                10772,
                10807
            ],
            [
                10814,
                10834
            ],
            [
                10856,
                10930
            ],
            [
                10932,
                10957
            ],
            [
                10959,
                11000
            ],
            [
                11000,
                11081
            ],
            [
                11095,
                11108
            ],
            [
                11181,
                11254
            ],
            [
                11254,
                11265
            ],
            [
                11295,
                11306
            ],
            [
                11310,
                11385
            ],
            [
                11385,
                11466
            ],
            [
                11495,
                11510
            ],
            [
                11510,
                11535
            ],
            [
                11547,
                11586
            ],
            [
                11600,
                11609
            ],
            [
                11617,
                11679
            ],
            [
                11679,
                11825
            ],
            [
                11899,
                11901
            ],
            [
                11848,
                11883
            ],
            [
                11901,
                11902
            ],
            [
                11929,
                11936
            ],
            [
                11950,
                11971
            ],
            [
                12002,
                12004
            ],
            [
                12004,
                12031
            ],
            [
                12044,
                12050
            ],
            [
                12055,
                12081
            ],
            [
                12101,
                12110
            ],
            [
                12090,
                12097
            ],
            [
                12111,
                12174
            ],
            [
                12267,
                12286
            ],
            [
                12292,
                12305
            ],
            [
                12319,
                12344
            ],
            [
                12344,
                12349
            ],
            [
                12391,
                12409
            ],
            [
                12426,
                12427
            ],
            [
                12430,
                12549
            ],
            [
                12570,
                12600
            ],
            [
                12600,
                12721
            ],
            [
                12746,
                12748
            ],
            [
                12748,
                12763
            ],
            [
                12889,
                12901
            ],
            [
                12915,
                13001
            ],
            [
                13001,
                13036
            ],
            [
                13056,
                13091
            ],
            [
                13095,
                13112
            ],
            [
                13120,
                13122
            ],
            [
                13122,
                13160
            ],
            [
                13194,
                13202
            ],
            [
                13270,
                13332
            ],
            [
                13481,
                13530
            ],
            [
                13530,
                13585
            ],
            [
                13587,
                13595
            ],
            [
                13602,
                13613
            ],
            [
                13613,
                13677
            ],
            [
                13706,
                13710
            ],
            [
                13715,
                13720
            ],
            [
                13677,
                13704
            ],
            [
                13729,
                13731
            ],
            [
                13731,
                13883
            ],
            [
                13883,
                13900
            ],
            [
                13900,
                13927
            ],
            [
                13927,
                14077
            ],
            [
                14123,
                14256
            ],
            [
                14293,
                14301
            ],
            [
                14301,
                14362
            ],
            [
                14362,
                14374
            ],
            [
                14375,
                14382
            ],
            [
                14400,
                14449
            ],
            [
                14449,
                14532
            ],
            [
                14532,
                14565
            ],
            [
                14565,
                14597
            ],
            [
                14597,
                14637
            ],
            [
                14637,
                14644
            ],
            [
                14748,
                14750
            ],
            [
                14750,
                14771
            ],
            [
                14780,
                14791
            ],
            [
                14901,
                14903
            ],
            [
                14903,
                14950
            ],
            [
                14950,
                14969
            ],
            [
                14975,
                14978
            ],
            [
                14978,
                14996
            ],
            [
                14996,
                15047
            ],
            [
                15047,
                15079
            ],
            [
                15079,
                15086
            ],
            [
                15086,
                15114
            ],
            [
                15115,
                15153
            ],
            [
                15153,
                15230
            ],
            [
                15230,
                15260
            ],
            [
                15295,
                15309
            ],
            [
                15333,
                15373
            ],
            [
                15373,
                15468
            ],
            [
                15469,
                15509
            ],
            [
                15509,
                15601
            ],
            [
                15601,
                15698
            ],
            [
                15698,
                15756
            ],
            [
                15776,
                15921
            ],
            [
                15921,
                15944
            ],
            [
                15946,
                15971
            ],
            [
                15990,
                16083
            ],
            [
                16102,
                16127
            ],
            [
                16131,
                16169
            ],
            [
                16179,
                16187
            ],
            [
                16197,
                16209
            ],
            [
                16215,
                16226
            ],
            [
                16230,
                16233
            ],
            [
                16259,
                16271
            ],
            [
                16277,
                16293
            ],
            [
                16293,
                16323
            ],
            [
                16339,
                16384
            ],
            [
                16400,
                16402
            ],
            [
                16402,
                16514
            ],
            [
                16529,
                16548
            ],
            [
                16550,
                16584
            ],
            [
                16625,
                16686
            ],
            [
                16686,
                16740
            ],
            [
                16753,
                16779
            ],
            [
                16807,
                16821
            ],
            [
                16952,
                16977
            ],
            [
                16982,
                17081
            ],
            [
                17081,
                17274
            ],
            [
                17274,
                17275
            ],
            [
                17321,
                17326
            ],
            [
                17331,
                17339
            ],
            [
                17275,
                17321
            ],
            [
                17341,
                17374
            ],
            [
                17456,
                17500
            ],
            [
                17500,
                17559
            ],
            [
                17559,
                17583
            ],
            [
                17732,
                17759
            ],
            [
                17776,
                17779
            ],
            [
                17787,
                17812
            ],
            [
                17812,
                17877
            ],
            [
                17877,
                17933
            ],
            [
                17977,
                17979
            ],
            [
                17979,
                18092
            ],
            [
                18153,
                18160
            ],
            [
                18179,
                18192
            ],
            [
                18192,
                18262
            ],
            [
                18278,
                18376
            ],
            [
                18376,
                18450
            ],
            [
                18450,
                18457
            ],
            [
                18462,
                18498
            ],
            [
                18500,
                18503
            ],
            [
                18519,
                18528
            ],
            [
                18549,
                18557
            ],
            [
                18557,
                18601
            ],
            [
                18606,
                18626
            ],
            [
                18628,
                18630
            ],
            [
                18637,
                18642
            ],
            [
                18631,
                18636
            ],
            [
                18666,
                18677
            ],
            [
                18626,
                18627
            ],
            [
                18756,
                18831
            ],
            [
                18832,
                18867
            ],
            [
                18897,
                18898
            ],
            [
                18957,
                18995
            ],
            [
                18995,
                19066
            ],
            [
                19089,
                19148
            ],
            [
                19151,
                19163
            ],
            [
                19192,
                19194
            ],
            [
                19194,
                19251
            ],
            [
                19251,
                19295
            ],
            [
                19296,
                19298
            ],
            [
                19299,
                19339
            ],
            [
                19354,
                19367
            ],
            [
                19502,
                19505
            ],
            [
                19372,
                19376
            ],
            [
                19390,
                19470
            ],
            [
                19489,
                19494
            ],
            [
                19513,
                19515
            ],
            [
                19515,
                19533
            ],
            [
                19564,
                19591
            ],
            [
                19591,
                19616
            ],
            [
                19616,
                19650
            ],
            [
                19650,
                19679
            ],
            [
                19679,
                19713
            ],
            [
                19724,
                19736
            ],
            [
                19736,
                19772
            ],
            [
                19772,
                19779
            ],
            [
                19779,
                19801
            ],
            [
                19810,
                19818
            ],
            [
                19818,
                19885
            ],
            [
                19885,
                19914
            ],
            [
                19985,
                20022
            ],
            [
                20036,
                20068
            ],
            [
                20074,
                20095
            ],
            [
                20108,
                20111
            ],
            [
                20097,
                20106
            ],
            [
                20156,
                20174
            ],
            [
                20174,
                20199
            ],
            [
                20199,
                20207
            ],
            [
                20207,
                20221
            ],
            [
                20221,
                20237
            ],
            [
                20237,
                20243
            ],
            [
                20243,
                20285
            ],
            [
                20285,
                20349
            ],
            [
                20349,
                20389
            ],
            [
                20389,
                20401
            ],
            [
                20415,
                20417
            ],
            [
                20417,
                20452
            ],
            [
                20481,
                20515
            ],
            [
                20543,
                20548
            ],
            [
                20552,
                20565
            ],
            [
                20599,
                20602
            ],
            [
                20602,
                20628
            ],
            [
                20628,
                20648
            ],
            [
                20648,
                20719
            ],
            [
                20773,
                20843
            ],
            [
                21048,
                21101
            ],
            [
                21101,
                21242
            ],
            [
                21281,
                21294
            ],
            [
                21298,
                21368
            ],
            [
                21382,
                21393
            ],
            [
                21374,
                21381
            ],
            [
                21425,
                21465
            ],
            [
                21469,
                21496
            ],
            [
                21496,
                21562
            ],
            [
                21566,
                21575
            ],
            [
                21633,
                21648
            ],
            [
                21652,
                21679
            ],
            [
                21679,
                21711
            ],
            [
                21732,
                21734
            ],
            [
                21734,
                21759
            ],
            [
                21816,
                21842
            ],
            [
                21842,
                21878
            ],
            [
                22034,
                22064
            ],
            [
                22133,
                22135
            ],
            [
                22069,
                22123
            ],
            [
                22291,
                22331
            ],
            [
                22339,
                22363
            ],
            [
                22027,
                22033
            ],
            [
                21941,
                21966
            ],
            [
                21978,
                22025
            ],
            [
                22371,
                22409
            ],
            [
                22451,
                22456
            ],
            [
                22503,
                22506
            ],
            [
                22480,
                22499
            ],
            [
                22506,
                22508
            ],
            [
                22508,
                22577
            ],
            [
                22577,
                22636
            ],
            [
                22636,
                22658
            ],
            [
                22658,
                22668
            ],
            [
                22668,
                22688
            ],
            [
                22688,
                22720
            ],
            [
                22720,
                22763
            ],
            [
                22763,
                22786
            ],
            [
                22819,
                22855
            ],
            [
                22883,
                23024
            ],
            [
                23024,
                23090
            ],
            [
                23173,
                23175
            ],
            [
                23192,
                23263
            ],
            [
                23263,
                23295
            ],
            [
                23302,
                23310
            ],
            [
                23332,
                23413
            ],
            [
                23438,
                23485
            ],
            [
                23485,
                23496
            ],
            [
                23502,
                23525
            ],
            [
                23547,
                23706
            ],
            [
                23720,
                23761
            ],
            [
                23761,
                23777
            ],
            [
                23846,
                23917
            ],
            [
                23931,
                23958
            ],
            [
                23958,
                23964
            ],
            [
                23970,
                23981
            ],
            [
                23985,
                24041
            ],
            [
                24122,
                24151
            ],
            [
                24151,
                24157
            ],
            [
                24162,
                24163
            ],
            [
                24171,
                24191
            ],
            [
                24214,
                24306
            ],
            [
                24307,
                24508
            ],
            [
                24509,
                24549
            ],
            [
                24549,
                24550
            ],
            [
                24567,
                24574
            ],
            [
                24576,
                24598
            ],
            [
                24600,
                24644
            ],
            [
                24644,
                24800
            ],
            [
                24852,
                24878
            ],
            [
                24958,
                24960
            ],
            [
                25012,
                25017
            ],
            [
                25025,
                25061
            ],
            [
                25066,
                25094
            ],
            [
                25147,
                25171
            ],
            [
                25171,
                25257
            ],
            [
                25258,
                25278
            ],
            [
                25282,
                25291
            ],
            [
                25297,
                25302
            ],
            [
                25320,
                25338
            ],
            [
                25343,
                25345
            ],
            [
                25345,
                25405
            ],
            [
                25405,
                25450
            ],
            [
                25450,
                25502
            ],
            [
                25532,
                25534
            ],
            [
                25534,
                25657
            ],
            [
                25662,
                25674
            ],
            [
                25682,
                25707
            ],
            [
                25720,
                25738
            ],
            [
                25746,
                25768
            ],
            [
                25773,
                25883
            ],
            [
                25888,
                25916
            ],
            [
                25988,
                25994
            ],
            [
                25995,
                26001
            ],
            [
                26012,
                26040
            ],
            [
                26058,
                26074
            ],
            [
                26080,
                26087
            ],
            [
                26087,
                26127
            ],
            [
                26127,
                26257
            ],
            [
                26257,
                26262
            ],
            [
                26278,
                26308
            ],
            [
                26381,
                26451
            ],
            [
                26481,
                26540
            ],
            [
                26540,
                26558
            ],
            [
                26577,
                26635
            ],
            [
                26663,
                26666
            ],
            [
                26666,
                26773
            ],
            [
                26773,
                26875
            ],
            [
                26909,
                26911
            ],
            [
                26911,
                27012
            ],
            [
                27012,
                27033
            ],
            [
                27048,
                27149
            ],
            [
                27231,
                27232
            ],
            [
                27241,
                27242
            ],
            [
                27186,
                27231
            ],
            [
                27149,
                27150
            ],
            [
                27327,
                27363
            ],
            [
                27363,
                27390
            ],
            [
                27394,
                27511
            ],
            [
                27527,
                27528
            ],
            [
                27533,
                27698
            ],
            [
                27707,
                27761
            ],
            [
                27778,
                27822
            ],
            [
                27822,
                27869
            ],
            [
                27885,
                27912
            ],
            [
                27932,
                27939
            ],
            [
                27944,
                27959
            ],
            [
                27970,
                28043
            ],
            [
                28088,
                28089
            ],
            [
                28097,
                28168
            ],
            [
                28179,
                28219
            ],
            [
                28223,
                28234
            ],
            [
                28483,
                28485
            ],
            [
                28502,
                28528
            ],
            [
                28534,
                28578
            ],
            [
                28594,
                28733
            ],
            [
                28733,
                28755
            ],
            [
                28782,
                28852
            ],
            [
                28858,
                28860
            ],
            [
                28925,
                29208
            ],
            [
                29230,
                29241
            ],
            [
                29251,
                29253
            ],
            [
                29253,
                29264
            ],
            [
                29278,
                29294
            ],
            [
                29315,
                29413
            ],
            [
                29425,
                29457
            ],
            [
                29469,
                29486
            ],
            [
                29503,
                29537
            ],
            [
                29497,
                29498
            ],
            [
                29596,
                29627
            ],
            [
                29557,
                29565
            ],
            [
                29633,
                29644
            ],
            [
                29644,
                29663
            ],
            [
                30065,
                30066
            ],
            [
                29664,
                29773
            ],
            [
                29774,
                29806
            ],
            [
                29808,
                30026
            ],
            [
                30067,
                30088
            ],
            [
                30099,
                30108
            ],
            [
                30172,
                30188
            ],
            [
                30197,
                30204
            ],
            [
                30214,
                30231
            ],
            [
                30260,
                30267
            ],
            [
                30254,
                30259
            ],
            [
                30268,
                30295
            ],
            [
                30335,
                30340
            ],
            [
                30346,
                30356
            ],
            [
                30391,
                30416
            ],
            [
                30416,
                30508
            ],
            [
                30574,
                30576
            ],
            [
                30789,
                30844
            ],
            [
                30845,
                30944
            ],
            [
                31095,
                31216
            ],
            [
                31278,
                31280
            ],
            [
                31304,
                31359
            ],
            [
                31359,
                31420
            ],
            [
                31542,
                31545
            ],
            [
                31424,
                31426
            ],
            [
                31491,
                31492
            ],
            [
                31498,
                31542
            ],
            [
                31558,
                31587
            ],
            [
                31658,
                31662
            ],
            [
                31670,
                31707
            ],
            [
                31707,
                31823
            ],
            [
                31893,
                31895
            ],
            [
                31895,
                31919
            ],
            [
                31925,
                31934
            ],
            [
                31945,
                31988
            ],
            [
                32015,
                32078
            ],
            [
                32078,
                32162
            ],
            [
                32170,
                32172
            ],
            [
                32277,
                32318
            ],
            [
                32318,
                32357
            ],
            [
                32367,
                32374
            ],
            [
                32391,
                32393
            ],
            [
                32446,
                32455
            ],
            [
                32460,
                32501
            ],
            [
                32569,
                32663
            ],
            [
                32681,
                32698
            ],
            [
                32710,
                32754
            ],
            [
                32754,
                32792
            ],
            [
                32801,
                32804
            ],
            [
                32809,
                32827
            ],
            [
                32834,
                32837
            ],
            [
                32846,
                32887
            ],
            [
                32887,
                32892
            ],
            [
                32912,
                32949
            ],
            [
                32949,
                32969
            ],
            [
                32992,
                33096
            ],
            [
                33191,
                33198
            ],
            [
                33243,
                33244
            ],
            [
                33245,
                33251
            ],
            [
                33261,
                33274
            ],
            [
                33274,
                33401
            ],
            [
                33415,
                33424
            ],
            [
                33426,
                33492
            ],
            [
                33492,
                33566
            ],
            [
                33641,
                33651
            ],
            [
                33669,
                33706
            ],
            [
                33858,
                33940
            ],
            [
                33953,
                33968
            ],
            [
                34001,
                34024
            ],
            [
                34040,
                34104
            ],
            [
                34112,
                34129
            ],
            [
                34129,
                34253
            ],
            [
                34288,
                34303
            ],
            [
                34335,
                34343
            ],
            [
                34343,
                34362
            ],
            [
                34362,
                34420
            ],
            [
                34420,
                34438
            ],
            [
                34440,
                34462
            ],
            [
                34462,
                34502
            ],
            [
                34504,
                34532
            ],
            [
                34558,
                34647
            ],
            [
                34659,
                34704
            ],
            [
                34728,
                34768
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                232
            ],
            [
                232,
                440
            ],
            [
                440,
                480
            ],
            [
                480,
                554
            ],
            [
                554,
                668
            ],
            [
                668,
                835
            ],
            [
                835,
                1002
            ],
            [
                1002,
                1211
            ],
            [
                1211,
                1284
            ],
            [
                1284,
                1481
            ],
            [
                1481,
                1657
            ],
            [
                1657,
                1810
            ],
            [
                1810,
                2227
            ],
            [
                2227,
                2412
            ],
            [
                2412,
                2501
            ],
            [
                2501,
                2643
            ],
            [
                2643,
                2853
            ],
            [
                2853,
                2960
            ],
            [
                2960,
                3014
            ],
            [
                3014,
                3112
            ],
            [
                3112,
                3195
            ],
            [
                3195,
                3246
            ],
            [
                3246,
                3358
            ],
            [
                3358,
                3478
            ],
            [
                3478,
                3524
            ],
            [
                3524,
                3673
            ],
            [
                3673,
                3792
            ],
            [
                3792,
                3924
            ],
            [
                3924,
                4025
            ],
            [
                4025,
                4046
            ],
            [
                4046,
                4194
            ],
            [
                4194,
                4277
            ],
            [
                4277,
                4313
            ],
            [
                4313,
                4397
            ],
            [
                4397,
                4429
            ],
            [
                4429,
                4562
            ],
            [
                4562,
                4724
            ],
            [
                4724,
                4918
            ],
            [
                4918,
                4952
            ],
            [
                4952,
                4980
            ],
            [
                4980,
                5081
            ],
            [
                5081,
                5101
            ],
            [
                5101,
                5126
            ],
            [
                5126,
                5141
            ],
            [
                5141,
                5193
            ],
            [
                5193,
                5238
            ],
            [
                5238,
                5318
            ],
            [
                5318,
                5363
            ],
            [
                5363,
                5529
            ],
            [
                5529,
                5711
            ],
            [
                5711,
                5986
            ],
            [
                5986,
                6327
            ],
            [
                6327,
                6514
            ],
            [
                6514,
                6632
            ],
            [
                6632,
                7225
            ],
            [
                7225,
                7625
            ],
            [
                7625,
                7902
            ],
            [
                7902,
                8090
            ],
            [
                8090,
                8218
            ],
            [
                8218,
                8460
            ],
            [
                8460,
                8606
            ],
            [
                8606,
                9014
            ],
            [
                9014,
                9399
            ],
            [
                9399,
                9720
            ],
            [
                9720,
                9807
            ],
            [
                9807,
                9941
            ],
            [
                9941,
                10104
            ],
            [
                10104,
                10277
            ],
            [
                10277,
                10315
            ],
            [
                10315,
                10442
            ],
            [
                10442,
                10564
            ],
            [
                10564,
                10772
            ],
            [
                10772,
                11000
            ],
            [
                11000,
                11108
            ],
            [
                11108,
                11254
            ],
            [
                11254,
                11385
            ],
            [
                11385,
                11510
            ],
            [
                11510,
                11679
            ],
            [
                11679,
                12004
            ],
            [
                12004,
                12174
            ],
            [
                12174,
                12267
            ],
            [
                12267,
                12344
            ],
            [
                12344,
                12600
            ],
            [
                12600,
                12748
            ],
            [
                12748,
                12763
            ],
            [
                12763,
                12889
            ],
            [
                12889,
                13001
            ],
            [
                13001,
                13122
            ],
            [
                13122,
                13332
            ],
            [
                13332,
                13530
            ],
            [
                13530,
                13613
            ],
            [
                13613,
                13731
            ],
            [
                13731,
                13883
            ],
            [
                13883,
                13900
            ],
            [
                13900,
                13927
            ],
            [
                13927,
                14301
            ],
            [
                14301,
                14362
            ],
            [
                14362,
                14449
            ],
            [
                14449,
                14532
            ],
            [
                14532,
                14565
            ],
            [
                14565,
                14597
            ],
            [
                14597,
                14637
            ],
            [
                14637,
                14750
            ],
            [
                14750,
                14903
            ],
            [
                14903,
                14950
            ],
            [
                14950,
                14978
            ],
            [
                14978,
                14996
            ],
            [
                14996,
                15047
            ],
            [
                15047,
                15079
            ],
            [
                15079,
                15086
            ],
            [
                15086,
                15153
            ],
            [
                15153,
                15230
            ],
            [
                15230,
                15309
            ],
            [
                15309,
                15373
            ],
            [
                15373,
                15509
            ],
            [
                15509,
                15601
            ],
            [
                15601,
                15698
            ],
            [
                15698,
                15921
            ],
            [
                15921,
                15944
            ],
            [
                15944,
                16293
            ],
            [
                16293,
                16402
            ],
            [
                16402,
                16514
            ],
            [
                16514,
                16686
            ],
            [
                16686,
                16821
            ],
            [
                16821,
                17081
            ],
            [
                17081,
                17274
            ],
            [
                17274,
                17500
            ],
            [
                17500,
                17559
            ],
            [
                17559,
                17586
            ],
            [
                17586,
                17731
            ],
            [
                17731,
                17812
            ],
            [
                17812,
                17877
            ],
            [
                17877,
                17979
            ],
            [
                17979,
                18192
            ],
            [
                18192,
                18376
            ],
            [
                18376,
                18450
            ],
            [
                18450,
                18557
            ],
            [
                18557,
                18756
            ],
            [
                18756,
                18995
            ],
            [
                18995,
                19194
            ],
            [
                19194,
                19251
            ],
            [
                19251,
                19515
            ],
            [
                19515,
                19591
            ],
            [
                19591,
                19616
            ],
            [
                19616,
                19650
            ],
            [
                19650,
                19679
            ],
            [
                19679,
                19736
            ],
            [
                19736,
                19772
            ],
            [
                19772,
                19779
            ],
            [
                19779,
                19818
            ],
            [
                19818,
                19885
            ],
            [
                19885,
                19917
            ],
            [
                19917,
                19929
            ],
            [
                19929,
                19944
            ],
            [
                19944,
                19985
            ],
            [
                19985,
                20174
            ],
            [
                20174,
                20199
            ],
            [
                20199,
                20207
            ],
            [
                20207,
                20221
            ],
            [
                20221,
                20237
            ],
            [
                20237,
                20243
            ],
            [
                20243,
                20285
            ],
            [
                20285,
                20349
            ],
            [
                20349,
                20389
            ],
            [
                20389,
                20417
            ],
            [
                20417,
                20602
            ],
            [
                20602,
                20628
            ],
            [
                20628,
                20648
            ],
            [
                20648,
                20719
            ],
            [
                20719,
                20770
            ],
            [
                20770,
                20846
            ],
            [
                20846,
                20882
            ],
            [
                20882,
                20898
            ],
            [
                20898,
                21048
            ],
            [
                21048,
                21101
            ],
            [
                21101,
                21244
            ],
            [
                21244,
                21281
            ],
            [
                21281,
                21368
            ],
            [
                21368,
                21395
            ],
            [
                21395,
                21425
            ],
            [
                21425,
                21496
            ],
            [
                21496,
                21566
            ],
            [
                21566,
                21679
            ],
            [
                21679,
                21734
            ],
            [
                21734,
                21842
            ],
            [
                21842,
                21878
            ],
            [
                21878,
                22508
            ],
            [
                22508,
                22577
            ],
            [
                22577,
                22636
            ],
            [
                22636,
                22658
            ],
            [
                22658,
                22668
            ],
            [
                22668,
                22688
            ],
            [
                22688,
                22720
            ],
            [
                22720,
                22763
            ],
            [
                22763,
                22786
            ],
            [
                22786,
                22855
            ],
            [
                22855,
                22883
            ],
            [
                22883,
                23024
            ],
            [
                23024,
                23175
            ],
            [
                23175,
                23263
            ],
            [
                23263,
                23485
            ],
            [
                23485,
                23761
            ],
            [
                23761,
                23958
            ],
            [
                23958,
                24151
            ],
            [
                24151,
                24307
            ],
            [
                24307,
                24509
            ],
            [
                24509,
                24549
            ],
            [
                24549,
                24644
            ],
            [
                24644,
                24960
            ],
            [
                24960,
                25171
            ],
            [
                25171,
                25345
            ],
            [
                25345,
                25405
            ],
            [
                25405,
                25450
            ],
            [
                25450,
                25534
            ],
            [
                25534,
                25657
            ],
            [
                25657,
                25768
            ],
            [
                25768,
                25883
            ],
            [
                25883,
                26087
            ],
            [
                26087,
                26127
            ],
            [
                26127,
                26257
            ],
            [
                26257,
                26540
            ],
            [
                26540,
                26666
            ],
            [
                26666,
                26773
            ],
            [
                26773,
                26911
            ],
            [
                26911,
                27012
            ],
            [
                27012,
                27363
            ],
            [
                27363,
                27822
            ],
            [
                27822,
                28090
            ],
            [
                28090,
                28485
            ],
            [
                28485,
                28733
            ],
            [
                28733,
                28860
            ],
            [
                28860,
                29253
            ],
            [
                29253,
                29486
            ],
            [
                29486,
                29644
            ],
            [
                29644,
                30188
            ],
            [
                30188,
                30416
            ],
            [
                30416,
                30576
            ],
            [
                30576,
                30789
            ],
            [
                30789,
                30944
            ],
            [
                30944,
                31095
            ],
            [
                31095,
                31280
            ],
            [
                31280,
                31359
            ],
            [
                31359,
                31420
            ],
            [
                31420,
                31707
            ],
            [
                31707,
                31895
            ],
            [
                31895,
                32078
            ],
            [
                32078,
                32172
            ],
            [
                32172,
                32318
            ],
            [
                32318,
                32393
            ],
            [
                32393,
                32446
            ],
            [
                32446,
                32502
            ],
            [
                32502,
                32569
            ],
            [
                32569,
                32754
            ],
            [
                32754,
                32887
            ],
            [
                32887,
                32949
            ],
            [
                32949,
                33097
            ],
            [
                33097,
                33191
            ],
            [
                33191,
                33274
            ],
            [
                33274,
                33492
            ],
            [
                33492,
                33706
            ],
            [
                33706,
                33794
            ],
            [
                33794,
                33858
            ],
            [
                33858,
                34026
            ],
            [
                34026,
                34040
            ],
            [
                34040,
                34129
            ],
            [
                34129,
                34255
            ],
            [
                34255,
                34288
            ],
            [
                34288,
                34343
            ],
            [
                34343,
                34362
            ],
            [
                34362,
                34420
            ],
            [
                34420,
                34462
            ],
            [
                34462,
                34768
            ]
        ]
    },
    "abridged": {
        "text": "Charley and I did not set off alone upon our expedition into Lincolnshire. My guardian accompanied us, and we were two days upon the road. I found every breath of air, and every scent, and every flower and leaf, and every passing cloud, more beautiful and wonderful to me than I had ever found it yet. This was my first gain from my illness. How little I had lost, when the wide world was so full of delight for me!\nSince my guardian intended to go back directly, we agreed, on our way down, a day when my dear girl should come. I wrote her a letter, which he took back with him once we had arrived at our destination.\nIf a good fairy had built the house for me with a wave of her wand, I could not have been more considered in it. So many preparations were made for me, and all my little tastes and likings, that I could have sat down, overcome, a dozen times. I did better than that, however, by showing them all to Charley instead. Charley's delight calmed mine; and after we had had a walk in the garden, and Charley had exhausted her whole vocabulary of admiring expressions, I was as tranquilly happy as I ought to have been.\nOur host had left a note of welcome for me, as sunny as his own face, and had confided his bird to my care, which I knew to be his highest mark of confidence. I wrote a little note of thanks to him in London, telling him how all his favourite plants and trees were looking, and how the most astonishing of birds had chirped the honours of the house to me, and how, after singing on my shoulder, to the inconceivable rapture of my little maid, he was then at roost in the usual corner of his cage.\nWith my note sent off to the post, I made myself very busy in unpacking and arranging; and I told Charley I should want her no more that night.\nFor I had not yet looked in the mirror. I had always said to myself that I would begin afresh when I got here. Therefore I had wanted to be alone. I said now, \"Esther, you must keep your word, my dear.\" I was quite resolved to keep it, but I sat down for a little while first to reflect upon all my blessings. And then I said my prayers and thought a little more.\nMy hair had not been cut off; it was long and thick. I let it down, and shook it out, and went up to the glass upon the dressing-table. There was a little muslin curtain drawn across it. I drew it back and stood for a moment looking through such a veil of my own hair that I could see nothing else.\nThen I put my hair aside and looked at the reflection in the mirror, encouraged by seeing how placidly it looked at me. I was very much changed - oh, very, very much. At first my face was quite strange to me. Very soon it became more familiar, and then I knew the extent of the alteration. It was not like what I had expected, but I had expected nothing definite.\nI had never been a beauty and had never thought myself one, but I had been very different from this. It was all gone now. Heaven was so good to me that I could let it go with a few not bitter tears and could stand there arranging my hair for the night quite thankfully.\nOne thing troubled me, and I considered it for a long time before I went to sleep. I had kept Mr. Woodcourt's flowers. When they were withered I had dried them and put them in a book that I was fond of. Nobody knew this, not even Ada. I was doubtful whether I had a right to preserve what he had sent to one so different - whether it was generous towards him to do it. I wished to be generous to him, even in the secret depths of my heart, which he would never know, because I could have loved him - could have been devoted to him.\nAt last I came to the conclusion that I might keep the flowers if I treasured them only as a remembrance of what was irrevocably past and gone, never to be looked back on any more. I hope this may not seem trivial. I was very much in earnest.\nI took care to be up early in the morning and to be sitting before the glass when Charley came in on tiptoe.\n\"Dear, dear, miss!\" cried Charley, starting. \"Is that you?\"\n\"Yes, Charley,\" said I, quietly putting up my hair. \"And I am very well indeed, and very happy.\"\nI saw it was a weight off Charley's mind, but it was a greater weight off mine. I knew the worst now and was composed to it.\nWishing to be fully re-established in my strength and good spirits before Ada came, I now laid down plans with Charley for being in the fresh air all day long. We were to be out before breakfast, and were to dine early, and were to be out again before and after dinner, and were to talk in the garden after tea, and were to explore every road, lane, and field in the neighbourhood. As to strengthening delicacies, Mr. Boythorn's good housekeeper was for ever trotting about with something to eat or drink in her hand; if I was resting in the park she would come trotting after me with a basket, her cheerful face shining.\nThen there was a chubby pony with a mane all over his eyes expressly for my riding, so easy and quiet that he was a treasure. In a very few days he would come to me in the paddock when I called him, and follow me about. His name was Stubbs. Once we put him in a little chaise and drove him triumphantly through the green lanes for five miles; but just as we were extolling him to the skies, he took umbrage at the circle of little gnats around his ears, and stopped. He steadily refused to move until I gave the reins to Charley and got out and walked, when he followed me with sturdy good humour, rubbing his ear against my sleeve. The moment I left him, he stood stock still again. Consequently I was obliged to lead the way; and in this order we returned home, to the great delight of the village.\nIt was the most friendly of villages, I am sure, for in a week's time the people were so glad to see us go by that there were faces of greeting in every cottage. I had known many of the people before, but now the very steeple began to wear a familiar and affectionate look. Among my new friends was an old old woman who lived in a tiny thatched and whitewashed dwelling; she had a grandson who was a sailor, and I wrote a letter to him for her. At the top of it, I drew the chimney-corner in which his old stool yet stood. This was considered by the whole village the most wonderful achievement in the world, but when an answer came back from Plymouth, in which he mentioned that he was going to take the picture all the way to America, I got all the credit that ought to have been given to the post-office.\nWhat with being so much outside, playing with so many children, gossiping with so many people, going on with Charley's education, and writing long letters to Ada every day, I had scarcely any time to think about that little loss of mine and was almost always cheerful. If I did think of it at odd moments, I had only to be busy and forget it. I felt it more than I had hoped I should, when a child said, \"Mother, why is the lady not pretty like she used to be?\" But when I found the child was not less fond of me, that soon set me up again.\nThere were many little occurrences of consideration and delicacy. Once of these particularly touched me. I happened to stroll into the church when a marriage was just concluded, and the young couple had to sign the register.\nThe bridegroom made a rude cross for his mark; the bride did the same. Now, I had known the bride when I was last there, not only as the prettiest girl in the place, but as having distinguished herself in the school, and I could not help looking at her with some surprise. She came aside and whispered to me, with tears of honest love in her bright eyes, \"He's a dear good fellow, miss; but he can't write yet - he's going to learn of me - and I wouldn't shame him for the world!\" Why, what had I to fear, I thought, when there was this nobility in the soul of a labourer's daughter!\nThe healthy colour came into my new face as it had come into my old one. Charley was radiant and rosy; and we both enjoyed the whole day and slept soundly the whole night.\nThere was a favourite spot of mine in the park-woods of Chesney Wold where a seat commanded a lovely view. The wood had been cleared to improve this point of sight, and the landscape was so beautiful that I rested there at least once every day. A picturesque part of the Hall, called the Ghost's Walk, was seen to advantage from this higher ground; and the startling name, and the old legend about it which I had heard from Mr. Boythorn, gave it a mysterious interest. There was a bank here, too, famous for violets; and as it was Charley's delight to gather wild flowers, she took as much to the spot as I did.\nThe family were not at the house, I had heard, and were not expected. I was curious about the building, and often sat in this place wondering how the rooms ranged and whether any echo like a footstep really did resound at times upon the lonely Ghost's Walk. The indefinable feeling with which Lady Dedlock had impressed me may have had some influence in keeping me from the house. I am not sure. For whatever reason, I had never once gone near it, down to the day at which my story now arrives.\nI was resting at my favourite point, and Charley was gathering violets a little distance away. I had been looking at the Ghost's Walk afar off when I became aware of a figure approaching through the wood. At first I could not discern what figure it was. By little and little it revealed itself to be a woman's - a lady's - Lady Dedlock's. She was alone and coming to where I sat with a much quicker step than usual, I observed to my surprise.\nI was fluttered by her being unexpectedly so near (she was almost within speaking distance before I knew her) and would have risen to continue my walk. But I could not. I was rendered motionless. Not so much by her hurried gesture of entreaty, not so much by her quick advance and outstretched hands, not so much by the great change in her manner, as by a something in her face that I had pined for and dreamed of when I was a little child, something I had never seen in any face before.\nA dread and faintness fell upon me, and I called to Charley. Lady Dedlock instantly stopped and changed back almost to what I had known her.\n\"Miss Summerson, I am afraid I have startled you,\" she said, now advancing slowly. \"You can scarcely be strong yet. You have been very ill, I know. I have been much concerned to hear it.\"\nI could not stir. She gave me her hand, which was deadly cold. I cannot say what was in my whirling thoughts.\n\"You are recovering?\" she asked kindly.\n\"I was quite well but a moment ago, Lady Dedlock.\"\n\"Is this your young attendant?\"\n\"Yes.\"\n\"Will you send her on before us and walk towards your house with me?\"\n\"Charley,\" said I, \"take your flowers home, and I will follow you directly.\"\nCharley, with her best curtsy, went her way. Lady Dedlock sat down on the seat beside me.\nI cannot tell in any words what the state of my mind was when I saw in her hand my handkerchief, with which I had covered the dead baby.\nI looked at her, but I could not see her, I could not hear her, I could not draw my breath. The beating of my heart was so violent and wild that I felt as if my life were breaking from me. But when she caught me to her breast, kissed me, wept over me, and called me back to myself; when she fell down on her knees and cried to me, \"Oh, my child, my child, I am your wicked and unhappy mother! Oh, try to forgive me!\" - when I saw her at my feet in her great agony of mind, I felt, through all my tumult of emotion, a burst of gratitude to God that I was so changed that I never could disgrace her by any likeness. Nobody could now look at us and think of any tie between us.\nI raised my mother up, praying her not to stoop before me in such affliction. I did so in broken, incoherent words, for besides the trouble I was in, it frightened me to see her at my feet. I tried to tell her that if it were for me, her child, to forgive her, I did it, and had done it, many, many years. I told her that my heart overflowed with love for her, natural love which nothing could change. That my duty was to bless and receive her, though the whole world turned from her, and that I only asked her leave to do it. I held my mother in my embrace, and she held me in hers, and among the still woods in the silence of the summer day there seemed to be nothing but our two troubled minds that was not at peace.\n\"It is too late to bless and receive me,\" groaned my mother, \"I must travel my dark road alone, though I do not see the way before my guilty feet. This is the earthly punishment I have brought upon myself. I bear it, and I hide it. I must keep this secret, if I can, not wholly for myself. I have a husband, wretched and dishonouring creature that I am!\"\nThese words she uttered with a suppressed cry of despair. Covering her face with her hands, she shrank down in my embrace as if she were unwilling that I should touch her; and I could not persuade her to rise. She said, no, no, no, she could only speak to me so; she must be proud everywhere else; she would be humbled and ashamed there, in the only natural moments of her life.\nMy unhappy mother told me that in my illness she had been nearly frantic. She had only then known that her child was living; she had never suspected it before. She had followed me down here to speak to me just once in all her life: we could never meet or communicate again.\nShe put into my hands a letter she had written for my reading only and said that when I had read it and destroyed it, I must evermore consider her as dead. If I could believe that she loved me, in this agony in which I saw her, she asked me to do that, for then I might think of her with greater pity. She had put herself beyond all hope and beyond all help. Whether she preserved her secret until death, or whether it came to be discovered and she brought disgrace upon her name, it was her solitary struggle always; and no affection could come near her, and nobody could help her.\n\"But is the secret safe now, dearest mother?\"\n\"No,\" replied my mother. \"It has been very near discovery. It was saved by an accident. It may be lost by another accident, any day.\"\n\"Do you dread a particular person?\"\n\"Hush! Do not tremble and cry for me. I am not worthy of these tears,\" said my mother, kissing my hands. \"I dread one person very much. He is Sir Leicester Dedlock's lawyer, faithful without attachment, and jealous of the profit and privilege of great houses.\"\n\"Has he any suspicions?\"\n\"Many.\"\n\"Not of you?\" I said alarmed.\n\"Yes! He is always vigilant and always near me. I may keep him at a standstill, but I can never shake him off.\"\n\"Has he so little pity or compunction?\"\n\"He has none. He is indifferent to everything but the acquisition of secrets and the power they give him.\"\n\"Could you trust in him?\"\n\"I shall never try. The dark road I have trodden for so many years will end where it will. The end may be near, it may be distant; while the road lasts, nothing turns me. I will outlive this danger, and outdie it, if I can. It has closed around me almost as awfully as if these woods of Chesney Wold had closed around the house, but my course through it is the same.\"\n\"Mr. Jarndyce-\" I was beginning when my mother hurriedly inquired, \"Does he suspect?\"\n\"No, indeed!\" said I. And I told her what he had related to me about his knowledge of my story. \"But he is so good and sensible,\" said I, \"that perhaps if he knew-\"\nMy mother raised her hand to my lips and stopped me.\n\"Confide fully in him,\" she said. \"You have my free consent - but do not tell me of it. Some pride is left in me even yet.\"\nEvery word that was uttered in my mother's voice, so unfamiliar and so melancholy to me, made an enduring impression on my memory. I explained, or tried to - though my agitation and distress were so great that I scarcely understood myself - how I had only hoped that Mr. Jarndyce might give her counsel and support. But my mother answered no, it was impossible; no one could help her. Through the desert that lay before her, she must go alone.\n\"My child, my child!\" she said. \"For the last time! These kisses for the last time! These arms upon my neck for the last time! We shall meet no more. I must be what I have been so long. If you hear of Lady Dedlock, brilliant, prosperous, and flattered, think of your wretched mother, conscience-stricken, underneath that mask! Think that the reality is in her suffering, in her useless remorse! Forgive her if you can, and cry to heaven to forgive her, which it never can!\"\nWe held one another for a little while yet, but then she took my hands away, and put them back against my breast, and with a last kiss released them, and went from me into the wood. I was alone; calm and quiet below me lay the old house, with its terraces and turrets, on which there had seemed to me to be such complete repose when I first saw it, but which now looked like the unpitying watcher of my mother's misery.\nStunned as I was, the necessity of guarding against the danger of discovery, or even of suspicion, did me service. I took what precautions I could to hide from Charley that I had been crying, and endeavoured to be careful and collected. It was a while before I could restrain bursts of grief, but after an hour or so I was better and felt that I might return.\nI went home very slowly and told Charley, whom I found at the gate looking for me, that I had been tempted to extend my walk after Lady Dedlock had left me and that I was over-tired and would lie down.\nSafe in my own room, I read the letter. I learnt from it - and that was much then - that I had not been abandoned by my mother. Her elder and only sister, the godmother of my childhood, discovering signs of life in me when I had been laid aside as dead, had in her stern sense of duty reared me in rigid secrecy. Until a short time back I had never, to my mother's knowledge, breathed - had never borne a name. When she had first seen me in the church she had been startled and had thought of what her child would have been like if it had lived, but that was all.\nWhat more the letter told me needs not to be repeated here. It has its own times and places in my story.\nMy first care was to burn what my mother had written. I hope it may not appear very unnatural or bad in me that I then became heavily sorrowful to think I had ever been reared. I felt as if it would have been better for many people if I had never breathed. I had a terror of myself as the danger and the possible disgrace of my own mother and of a proud family name. I was so confused and shaken that I believed I should have died at birth, and that it was wrong that I should be alive.\nThese are the real feelings that I had. I fell asleep worn out, and when I awoke I cried afresh to think that I was back in the world with my load of trouble for others. I was frightened of myself, thinking of the new and terrible meaning of the old words now moaning in my ear: \"Your mother, Esther, was your disgrace, and you are hers. The time will come when you will understand this better, and will feel it too.\" With them, those other words returned, \"Pray daily that the sins of others be not visited upon your head.\" I could not disentangle all that was about me, and I felt as if the blame and the shame were all in me.\nThe day waned into a gloomy evening, overcast and sad, and I still contended with the same distress. I went out alone, and walked a little in the park, watching the dark shades falling on the trees and the fitful flight of the bats. I was attracted to the house for the first time, and took the path that led close by it.\nI did not dare to linger or look up, but I passed before the terrace garden with its fragrant odours, and its broad walks, and its well-kept beds; I saw how beautiful and grave it was, and how the old stone balustrades and parapets, and wide flights of shallow steps, were seamed by time and weather; and how the moss and ivy grew about them, and around the old stone sun-dial; and I heard the fountain falling. Then the way went by long lines of dark windows, turreted towers and porches, where stone lions and monsters bristled outside dens of shadow and snarled at the evening gloom.\nFrom there the path wound underneath a gateway, and through a court-yard where the main entrance was (I hurried quickly on), and past the stables. Encountering presently a sweet smell of lime trees, whose rustling I could hear, I turned with the path to the south front, and there above me were the balustrades of the Ghost's Walk and one lighted window that might be my mother's.\nThe way was paved here, and my footsteps from being noiseless made an echoing sound upon the flagstones. I was passing quickly on, and in a few moments should have passed the lighted window, when my echoing footsteps brought it suddenly into my mind that there was a dreadful truth in the legend of the Ghost's Walk, that it was I who was to bring calamity upon the stately house and that was haunting it now. Seized with a greater terror of myself, I ran from myself and everything, retraced the way by which I had come, and never paused until I reached the lodge-gate, and the park lay black behind me.\nAlone in my own room for the night, I began to know how wrong and thankless my dejected state was. But from my darling, who was coming on the morrow, I found a joyful letter, full of such loving anticipation that I must have been made of marble if it had not moved me. From my guardian, too, I found another letter, asking me to tell Dame Durden, if I should see that little woman anywhere, that they had moped most pitiably without her, that the housekeeping was going to rack and ruin, and that everybody in the house longed for her return. These letters made me think how beloved I was and how happy I ought to be; and brought me into a better condition.\nFor I saw very well that I could not have been intended to die, or I should never have lived. I knew I was as innocent of my birth as a queen of hers, and that before my Heavenly Father I should not be punished for birth nor a queen rewarded for it. I renewed my resolutions and prayed to be strengthened in them, pouring out my heart for myself and for my unhappy mother. The darkness of the morning passed away; and when the next day's light awoke me, it was gone.\nMy dear girl was to arrive at five o'clock in the afternoon. While waiting, I decided to take a walk along the road by which she was to come; so Charley and I and Stubbs made an expedition along that road and back. On our return, we held a great review of the house and garden and saw that everything was in its prettiest condition.\nThere were more than two hours yet before she could come, and in that interval I must confess I was nervously anxious about my altered looks. I loved my darling so well that I was more concerned for their effect on her than on anyone. I thought, would she be wholly prepared? When she first saw me, might she not be shocked? Might she look for her old Esther and not find her?\nI knew the various expressions of my sweet girl's face so well, and it was such an honest face, that I was sure she could not hide that first look from me. And I considered whether, if it should show any of these meanings, as was likely, could I quite answer for myself?\nWell, after last night, I thought I could. But to wait and wait, and think and think, was such bad preparation that I resolved to go along the road again and meet her. Charley approved, so I went, leaving her at home.\nBut before I got to the second milestone, I had been in so many palpitations from seeing dust in the distance (though I knew it could not be the coach yet) that I resolved to turn back and go home again. And when I had turned, I was in such fear of the coach coming up behind me that I ran most of the way to avoid being overtaken.\nAt last, when I believed there was at least a quarter of an hour more yet, Charley cried out to me, \"Here she comes, miss!\"\nI did not mean to do it, but I ran upstairs into my room and hid behind the door. There I stood trembling, even when I heard my darling calling as she came upstairs, \"Esther, my dear, my love, where are you?\"\nShe ran in, and saw me. Ah, my angel girl! The old dear look, all love, all fondness, all affection. Nothing else in it - no, nothing, nothing!\nOh, how happy I was, down upon the floor with my sweet beautiful girl holding my scarred face to her lovely cheek, bathing it with tears and kisses, rocking me like a child, calling me by every tender name, and pressing me to her faithful heart.",
        "paragraph_chars": [
            [
                0,
                416
            ],
            [
                416,
                619
            ],
            [
                619,
                1132
            ],
            [
                1132,
                1629
            ],
            [
                1629,
                1773
            ],
            [
                1773,
                2137
            ],
            [
                2137,
                2436
            ],
            [
                2436,
                2800
            ],
            [
                2800,
                3070
            ],
            [
                3070,
                3602
            ],
            [
                3602,
                3845
            ],
            [
                3845,
                3954
            ],
            [
                3954,
                4014
            ],
            [
                4014,
                4111
            ],
            [
                4111,
                4236
            ],
            [
                4236,
                4858
            ],
            [
                4858,
                5659
            ],
            [
                5659,
                6467
            ],
            [
                6467,
                7008
            ],
            [
                7008,
                7233
            ],
            [
                7233,
                7817
            ],
            [
                7817,
                7989
            ],
            [
                7989,
                8601
            ],
            [
                8601,
                9096
            ],
            [
                9096,
                9539
            ],
            [
                9539,
                10027
            ],
            [
                10027,
                10168
            ],
            [
                10168,
                10356
            ],
            [
                10356,
                10466
            ],
            [
                10466,
                10506
            ],
            [
                10506,
                10557
            ],
            [
                10557,
                10589
            ],
            [
                10589,
                10596
            ],
            [
                10596,
                10666
            ],
            [
                10666,
                10743
            ],
            [
                10743,
                10833
            ],
            [
                10833,
                10970
            ],
            [
                10970,
                11645
            ],
            [
                11645,
                12365
            ],
            [
                12365,
                12720
            ],
            [
                12720,
                13099
            ],
            [
                13099,
                13373
            ],
            [
                13373,
                13956
            ],
            [
                13956,
                14002
            ],
            [
                14002,
                14136
            ],
            [
                14136,
                14172
            ],
            [
                14172,
                14433
            ],
            [
                14433,
                14458
            ],
            [
                14458,
                14466
            ],
            [
                14466,
                14496
            ],
            [
                14496,
                14608
            ],
            [
                14608,
                14648
            ],
            [
                14648,
                14755
            ],
            [
                14755,
                14781
            ],
            [
                14781,
                15149
            ],
            [
                15149,
                15235
            ],
            [
                15235,
                15400
            ],
            [
                15400,
                15453
            ],
            [
                15453,
                15577
            ],
            [
                15577,
                16021
            ],
            [
                16021,
                16495
            ],
            [
                16495,
                16915
            ],
            [
                16915,
                17275
            ],
            [
                17275,
                17477
            ],
            [
                17477,
                18041
            ],
            [
                18041,
                18146
            ],
            [
                18146,
                18633
            ],
            [
                18633,
                19262
            ],
            [
                19262,
                19584
            ],
            [
                19584,
                20171
            ],
            [
                20171,
                20552
            ],
            [
                20552,
                21157
            ],
            [
                21157,
                21815
            ],
            [
                21815,
                22282
            ],
            [
                22282,
                22615
            ],
            [
                22615,
                22992
            ],
            [
                22992,
                23263
            ],
            [
                23263,
                23481
            ],
            [
                23481,
                23813
            ],
            [
                23813,
                23937
            ],
            [
                23937,
                24146
            ],
            [
                24146,
                24290
            ],
            [
                24290,
                24535
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                139
            ],
            [
                139,
                302
            ],
            [
                302,
                342
            ],
            [
                342,
                416
            ],
            [
                416,
                529
            ],
            [
                529,
                619
            ],
            [
                619,
                732
            ],
            [
                732,
                862
            ],
            [
                862,
                935
            ],
            [
                935,
                1132
            ],
            [
                1132,
                1291
            ],
            [
                1291,
                1629
            ],
            [
                1629,
                1773
            ],
            [
                1773,
                1813
            ],
            [
                1813,
                1884
            ],
            [
                1884,
                1920
            ],
            [
                1920,
                1976
            ],
            [
                1976,
                2083
            ],
            [
                2083,
                2137
            ],
            [
                2137,
                2190
            ],
            [
                2190,
                2273
            ],
            [
                2273,
                2324
            ],
            [
                2324,
                2436
            ],
            [
                2436,
                2556
            ],
            [
                2556,
                2603
            ],
            [
                2603,
                2645
            ],
            [
                2645,
                2726
            ],
            [
                2726,
                2800
            ],
            [
                2800,
                2901
            ],
            [
                2901,
                2922
            ],
            [
                2922,
                3070
            ],
            [
                3070,
                3153
            ],
            [
                3153,
                3189
            ],
            [
                3189,
                3273
            ],
            [
                3273,
                3305
            ],
            [
                3305,
                3439
            ],
            [
                3439,
                3602
            ],
            [
                3602,
                3783
            ],
            [
                3783,
                3817
            ],
            [
                3817,
                3845
            ],
            [
                3845,
                3954
            ],
            [
                3954,
                3974
            ],
            [
                3974,
                3999
            ],
            [
                3999,
                4014
            ],
            [
                4014,
                4066
            ],
            [
                4066,
                4111
            ],
            [
                4111,
                4191
            ],
            [
                4191,
                4236
            ],
            [
                4236,
                4396
            ],
            [
                4396,
                4618
            ],
            [
                4618,
                4858
            ],
            [
                4858,
                4984
            ],
            [
                4984,
                5078
            ],
            [
                5078,
                5099
            ],
            [
                5099,
                5325
            ],
            [
                5325,
                5491
            ],
            [
                5491,
                5542
            ],
            [
                5542,
                5659
            ],
            [
                5659,
                5821
            ],
            [
                5821,
                5933
            ],
            [
                5933,
                6104
            ],
            [
                6104,
                6182
            ],
            [
                6182,
                6467
            ],
            [
                6467,
                6736
            ],
            [
                6736,
                6810
            ],
            [
                6810,
                6929
            ],
            [
                6929,
                7008
            ],
            [
                7008,
                7074
            ],
            [
                7074,
                7113
            ],
            [
                7113,
                7233
            ],
            [
                7233,
                7304
            ],
            [
                7304,
                7506
            ],
            [
                7506,
                7714
            ],
            [
                7714,
                7817
            ],
            [
                7817,
                7890
            ],
            [
                7890,
                7989
            ],
            [
                7989,
                8096
            ],
            [
                8096,
                8234
            ],
            [
                8234,
                8458
            ],
            [
                8458,
                8601
            ],
            [
                8601,
                8671
            ],
            [
                8671,
                8859
            ],
            [
                8859,
                8982
            ],
            [
                8982,
                8997
            ],
            [
                8997,
                9096
            ],
            [
                9096,
                9191
            ],
            [
                9191,
                9301
            ],
            [
                9301,
                9350
            ],
            [
                9350,
                9435
            ],
            [
                9435,
                9539
            ],
            [
                9539,
                9691
            ],
            [
                9691,
                9708
            ],
            [
                9708,
                9735
            ],
            [
                9735,
                10027
            ],
            [
                10027,
                10088
            ],
            [
                10088,
                10168
            ],
            [
                10168,
                10251
            ],
            [
                10251,
                10284
            ],
            [
                10284,
                10316
            ],
            [
                10316,
                10356
            ],
            [
                10356,
                10374
            ],
            [
                10374,
                10419
            ],
            [
                10419,
                10466
            ],
            [
                10466,
                10488
            ],
            [
                10488,
                10506
            ],
            [
                10506,
                10557
            ],
            [
                10557,
                10589
            ],
            [
                10589,
                10596
            ],
            [
                10596,
                10666
            ],
            [
                10666,
                10743
            ],
            [
                10743,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10970
            ],
            [
                10970,
                11062
            ],
            [
                11062,
                11159
            ],
            [
                11159,
                11363
            ],
            [
                11363,
                11387
            ],
            [
                11387,
                11584
            ],
            [
                11584,
                11645
            ],
            [
                11645,
                11723
            ],
            [
                11723,
                11835
            ],
            [
                11835,
                11951
            ],
            [
                11951,
                12047
            ],
            [
                12047,
                12172
            ],
            [
                12172,
                12365
            ],
            [
                12365,
                12512
            ],
            [
                12512,
                12571
            ],
            [
                12571,
                12597
            ],
            [
                12597,
                12655
            ],
            [
                12655,
                12720
            ],
            [
                12720,
                12778
            ],
            [
                12778,
                12930
            ],
            [
                12930,
                13099
            ],
            [
                13099,
                13173
            ],
            [
                13173,
                13259
            ],
            [
                13259,
                13373
            ],
            [
                13373,
                13529
            ],
            [
                13529,
                13675
            ],
            [
                13675,
                13732
            ],
            [
                13732,
                13956
            ],
            [
                13956,
                14002
            ],
            [
                14002,
                14027
            ],
            [
                14027,
                14061
            ],
            [
                14061,
                14090
            ],
            [
                14090,
                14136
            ],
            [
                14136,
                14172
            ],
            [
                14172,
                14179
            ],
            [
                14179,
                14210
            ],
            [
                14210,
                14277
            ],
            [
                14277,
                14308
            ],
            [
                14308,
                14433
            ],
            [
                14433,
                14458
            ],
            [
                14458,
                14466
            ],
            [
                14466,
                14480
            ],
            [
                14480,
                14496
            ],
            [
                14496,
                14502
            ],
            [
                14502,
                14544
            ],
            [
                14544,
                14608
            ],
            [
                14608,
                14648
            ],
            [
                14648,
                14662
            ],
            [
                14662,
                14755
            ],
            [
                14755,
                14781
            ],
            [
                14781,
                14801
            ],
            [
                14801,
                14872
            ],
            [
                14872,
                14952
            ],
            [
                14952,
                15005
            ],
            [
                15005,
                15149
            ],
            [
                15149,
                15235
            ],
            [
                15235,
                15249
            ],
            [
                15249,
                15257
            ],
            [
                15257,
                15331
            ],
            [
                15331,
                15400
            ],
            [
                15400,
                15453
            ],
            [
                15453,
                15487
            ],
            [
                15487,
                15541
            ],
            [
                15541,
                15577
            ],
            [
                15577,
                15708
            ],
            [
                15708,
                15893
            ],
            [
                15893,
                15962
            ],
            [
                15962,
                16021
            ],
            [
                16021,
                16043
            ],
            [
                16043,
                16053
            ],
            [
                16053,
                16073
            ],
            [
                16073,
                16105
            ],
            [
                16105,
                16148
            ],
            [
                16148,
                16171
            ],
            [
                16171,
                16207
            ],
            [
                16207,
                16348
            ],
            [
                16348,
                16416
            ],
            [
                16416,
                16495
            ],
            [
                16495,
                16677
            ],
            [
                16677,
                16915
            ],
            [
                16915,
                17030
            ],
            [
                17030,
                17152
            ],
            [
                17152,
                17275
            ],
            [
                17275,
                17477
            ],
            [
                17477,
                17517
            ],
            [
                17517,
                17605
            ],
            [
                17605,
                17790
            ],
            [
                17790,
                17888
            ],
            [
                17888,
                18041
            ],
            [
                18041,
                18101
            ],
            [
                18101,
                18146
            ],
            [
                18146,
                18200
            ],
            [
                18200,
                18323
            ],
            [
                18323,
                18403
            ],
            [
                18403,
                18513
            ],
            [
                18513,
                18633
            ],
            [
                18633,
                18673
            ],
            [
                18673,
                18803
            ],
            [
                18803,
                18971
            ],
            [
                18971,
                19051
            ],
            [
                19051,
                19158
            ],
            [
                19158,
                19262
            ],
            [
                19262,
                19363
            ],
            [
                19363,
                19495
            ],
            [
                19495,
                19584
            ],
            [
                19584,
                19996
            ],
            [
                19996,
                20171
            ],
            [
                20171,
                20318
            ],
            [
                20318,
                20552
            ],
            [
                20552,
                20657
            ],
            [
                20657,
                20962
            ],
            [
                20962,
                21157
            ],
            [
                21157,
                21256
            ],
            [
                21256,
                21426
            ],
            [
                21426,
                21700
            ],
            [
                21700,
                21815
            ],
            [
                21815,
                21909
            ],
            [
                21909,
                22065
            ],
            [
                22065,
                22188
            ],
            [
                22188,
                22282
            ],
            [
                22282,
                22343
            ],
            [
                22343,
                22497
            ],
            [
                22497,
                22615
            ],
            [
                22615,
                22757
            ],
            [
                22757,
                22850
            ],
            [
                22850,
                22891
            ],
            [
                22891,
                22940
            ],
            [
                22940,
                22992
            ],
            [
                22992,
                23148
            ],
            [
                23148,
                23263
            ],
            [
                23263,
                23306
            ],
            [
                23306,
                23431
            ],
            [
                23431,
                23481
            ],
            [
                23481,
                23685
            ],
            [
                23685,
                23813
            ],
            [
                23813,
                23937
            ],
            [
                23937,
                24019
            ],
            [
                24019,
                24146
            ],
            [
                24146,
                24170
            ],
            [
                24170,
                24189
            ],
            [
                24189,
                24247
            ],
            [
                24247,
                24290
            ],
            [
                24290,
                24535
            ]
        ],
        "overlap_chars": [
            [
                0,
                75
            ],
            [
                75,
                86
            ],
            [
                87,
                139
            ],
            [
                139,
                210
            ],
            [
                210,
                235
            ],
            [
                235,
                302
            ],
            [
                302,
                342
            ],
            [
                342,
                414
            ],
            [
                422,
                433
            ],
            [
                443,
                453
            ],
            [
                462,
                466
            ],
            [
                473,
                529
            ],
            [
                529,
                550
            ],
            [
                551,
                564
            ],
            [
                599,
                617
            ],
            [
                617,
                619
            ],
            [
                619,
                686
            ],
            [
                687,
                732
            ],
            [
                732,
                769
            ],
            [
                771,
                774
            ],
            [
                775,
                807
            ],
            [
                809,
                860
            ],
            [
                860,
                862
            ],
            [
                862,
                935
            ],
            [
                935,
                1131
            ],
            [
                1141,
                1291
            ],
            [
                1291,
                1312
            ],
            [
                1323,
                1486
            ],
            [
                1486,
                1627
            ],
            [
                1627,
                1628
            ],
            [
                1634,
                1641
            ],
            [
                1642,
                1721
            ],
            [
                1722,
                1726
            ],
            [
                1727,
                1734
            ],
            [
                1735,
                1773
            ],
            [
                1773,
                1804
            ],
            [
                1811,
                1813
            ],
            [
                1813,
                1877
            ],
            [
                1882,
                1884
            ],
            [
                1884,
                1918
            ],
            [
                1920,
                1926
            ],
            [
                1927,
                1930
            ],
            [
                1930,
                1939
            ],
            [
                1939,
                1976
            ],
            [
                1976,
                2083
            ],
            [
                2083,
                2137
            ],
            [
                2137,
                2165
            ],
            [
                2167,
                2190
            ],
            [
                2190,
                2273
            ],
            [
                2273,
                2324
            ],
            [
                2324,
                2435
            ],
            [
                2436,
                2556
            ],
            [
                2556,
                2579
            ],
            [
                2582,
                2603
            ],
            [
                2603,
                2623
            ],
            [
                2630,
                2643
            ],
            [
                2643,
                2645
            ],
            [
                2645,
                2724
            ],
            [
                2724,
                2726
            ],
            [
                2726,
                2798
            ],
            [
                2798,
                2800
            ],
            [
                2800,
                2901
            ],
            [
                2901,
                2922
            ],
            [
                2922,
                3070
            ],
            [
                3070,
                3153
            ],
            [
                3153,
                3189
            ],
            [
                3189,
                3273
            ],
            [
                3273,
                3305
            ],
            [
                3305,
                3390
            ],
            [
                3393,
                3439
            ],
            [
                3439,
                3567
            ],
            [
                3570,
                3601
            ],
            [
                3602,
                3652
            ],
            [
                3665,
                3781
            ],
            [
                3781,
                3783
            ],
            [
                3783,
                3817
            ],
            [
                3817,
                3845
            ],
            [
                3845,
                3896
            ],
            [
                3905,
                3954
            ],
            [
                3954,
                3974
            ],
            [
                3974,
                3999
            ],
            [
                3999,
                4014
            ],
            [
                4014,
                4066
            ],
            [
                4066,
                4111
            ],
            [
                4111,
                4191
            ],
            [
                4191,
                4235
            ],
            [
                4236,
                4289
            ],
            [
                4290,
                4335
            ],
            [
                4336,
                4396
            ],
            [
                4396,
                4559
            ],
            [
                4560,
                4618
            ],
            [
                4618,
                4623
            ],
            [
                4624,
                4753
            ],
            [
                4757,
                4758
            ],
            [
                4763,
                4782
            ],
            [
                4783,
                4856
            ],
            [
                4856,
                4857
            ],
            [
                4858,
                4872
            ],
            [
                4873,
                4891
            ],
            [
                4892,
                4916
            ],
            [
                4917,
                4941
            ],
            [
                4942,
                4944
            ],
            [
                4950,
                4953
            ],
            [
                4960,
                4984
            ],
            [
                4984,
                5060
            ],
            [
                5061,
                5078
            ],
            [
                5078,
                5086
            ],
            [
                5087,
                5090
            ],
            [
                5091,
                5097
            ],
            [
                5097,
                5099
            ],
            [
                5099,
                5204
            ],
            [
                5210,
                5251
            ],
            [
                5265,
                5267
            ],
            [
                5268,
                5281
            ],
            [
                5282,
                5294
            ],
            [
                5302,
                5310
            ],
            [
                5310,
                5323
            ],
            [
                5323,
                5325
            ],
            [
                5325,
                5435
            ],
            [
                5436,
                5442
            ],
            [
                5443,
                5455
            ],
            [
                5456,
                5491
            ],
            [
                5491,
                5542
            ],
            [
                5542,
                5584
            ],
            [
                5584,
                5659
            ],
            [
                5659,
                5661
            ],
            [
                5666,
                5768
            ],
            [
                5769,
                5821
            ],
            [
                5821,
                5844
            ],
            [
                5845,
                5858
            ],
            [
                5858,
                5933
            ],
            [
                5933,
                5987
            ],
            [
                5988,
                5989
            ],
            [
                5995,
                6028
            ],
            [
                6030,
                6033
            ],
            [
                6034,
                6102
            ],
            [
                6102,
                6103
            ],
            [
                6104,
                6120
            ],
            [
                6120,
                6121
            ],
            [
                6124,
                6128
            ],
            [
                6129,
                6156
            ],
            [
                6157,
                6174
            ],
            [
                6180,
                6182
            ],
            [
                6182,
                6296
            ],
            [
                6297,
                6395
            ],
            [
                6396,
                6465
            ],
            [
                6465,
                6467
            ],
            [
                6467,
                6490
            ],
            [
                6498,
                6560
            ],
            [
                6560,
                6736
            ],
            [
                6736,
                6771
            ],
            [
                6771,
                6810
            ],
            [
                6810,
                6850
            ],
            [
                6852,
                6899
            ],
            [
                6900,
                6906
            ],
            [
                6907,
                6929
            ],
            [
                6929,
                6980
            ],
            [
                6981,
                7007
            ],
            [
                7008,
                7042
            ],
            [
                7060,
                7063
            ],
            [
                7072,
                7074
            ],
            [
                7079,
                7113
            ],
            [
                7113,
                7142
            ],
            [
                7143,
                7233
            ],
            [
                7233,
                7247
            ],
            [
                7248,
                7289
            ],
            [
                7290,
                7304
            ],
            [
                7304,
                7412
            ],
            [
                7413,
                7506
            ],
            [
                7506,
                7541
            ],
            [
                7547,
                7567
            ],
            [
                7568,
                7642
            ],
            [
                7645,
                7670
            ],
            [
                7673,
                7714
            ],
            [
                7714,
                7795
            ],
            [
                7804,
                7817
            ],
            [
                7817,
                7890
            ],
            [
                7890,
                7901
            ],
            [
                7902,
                7913
            ],
            [
                7914,
                7989
            ],
            [
                7989,
                8070
            ],
            [
                8081,
                8096
            ],
            [
                8096,
                8121
            ],
            [
                8122,
                8161
            ],
            [
                8162,
                8171
            ],
            [
                8172,
                8234
            ],
            [
                8234,
                8380
            ],
            [
                8387,
                8389
            ],
            [
                8390,
                8425
            ],
            [
                8425,
                8426
            ],
            [
                8427,
                8434
            ],
            [
                8435,
                8456
            ],
            [
                8456,
                8458
            ],
            [
                8458,
                8485
            ],
            [
                8486,
                8492
            ],
            [
                8493,
                8519
            ],
            [
                8520,
                8529
            ],
            [
                8530,
                8537
            ],
            [
                8538,
                8601
            ],
            [
                8601,
                8620
            ],
            [
                8633,
                8646
            ],
            [
                8646,
                8671
            ],
            [
                8671,
                8676
            ],
            [
                8685,
                8703
            ],
            [
                8703,
                8704
            ],
            [
                8709,
                8828
            ],
            [
                8829,
                8859
            ],
            [
                8859,
                8980
            ],
            [
                8980,
                8982
            ],
            [
                8982,
                8997
            ],
            [
                8997,
                9009
            ],
            [
                9010,
                9096
            ],
            [
                9096,
                9131
            ],
            [
                9131,
                9166
            ],
            [
                9167,
                9184
            ],
            [
                9189,
                9191
            ],
            [
                9191,
                9229
            ],
            [
                9230,
                9238
            ],
            [
                9239,
                9301
            ],
            [
                9301,
                9350
            ],
            [
                9350,
                9405
            ],
            [
                9408,
                9416
            ],
            [
                9424,
                9435
            ],
            [
                9435,
                9499
            ],
            [
                9500,
                9504
            ],
            [
                9505,
                9510
            ],
            [
                9510,
                9537
            ],
            [
                9537,
                9539
            ],
            [
                9539,
                9691
            ],
            [
                9691,
                9708
            ],
            [
                9708,
                9735
            ],
            [
                9735,
                9885
            ],
            [
                9885,
                10018
            ],
            [
                10019,
                10027
            ],
            [
                10027,
                10088
            ],
            [
                10088,
                10100
            ],
            [
                10111,
                10118
            ],
            [
                10119,
                10168
            ],
            [
                10168,
                10251
            ],
            [
                10251,
                10284
            ],
            [
                10284,
                10316
            ],
            [
                10316,
                10356
            ],
            [
                10356,
                10363
            ],
            [
                10372,
                10374
            ],
            [
                10374,
                10395
            ],
            [
                10406,
                10417
            ],
            [
                10417,
                10419
            ],
            [
                10419,
                10466
            ],
            [
                10466,
                10485
            ],
            [
                10485,
                10488
            ],
            [
                10488,
                10506
            ],
            [
                10506,
                10557
            ],
            [
                10557,
                10589
            ],
            [
                10589,
                10596
            ],
            [
                10596,
                10624
            ],
            [
                10628,
                10666
            ],
            [
                10666,
                10743
            ],
            [
                10743,
                10773
            ],
            [
                10774,
                10788
            ],
            [
                10793,
                10833
            ],
            [
                10833,
                10928
            ],
            [
                10930,
                10970
            ],
            [
                10970,
                11062
            ],
            [
                11062,
                11159
            ],
            [
                11159,
                11217
            ],
            [
                11218,
                11363
            ],
            [
                11363,
                11386
            ],
            [
                11389,
                11414
            ],
            [
                11415,
                11508
            ],
            [
                11509,
                11534
            ],
            [
                11535,
                11573
            ],
            [
                11574,
                11582
            ],
            [
                11584,
                11596
            ],
            [
                11597,
                11608
            ],
            [
                11612,
                11615
            ],
            [
                11616,
                11628
            ],
            [
                11629,
                11645
            ],
            [
                11645,
                11675
            ],
            [
                11676,
                11721
            ],
            [
                11721,
                11723
            ],
            [
                11723,
                11835
            ],
            [
                11835,
                11854
            ],
            [
                11855,
                11889
            ],
            [
                11890,
                11951
            ],
            [
                11951,
                12005
            ],
            [
                12006,
                12032
            ],
            [
                12033,
                12047
            ],
            [
                12047,
                12072
            ],
            [
                12073,
                12172
            ],
            [
                12172,
                12365
            ],
            [
                12365,
                12366
            ],
            [
                12366,
                12371
            ],
            [
                12372,
                12380
            ],
            [
                12381,
                12427
            ],
            [
                12427,
                12460
            ],
            [
                12468,
                12512
            ],
            [
                12512,
                12571
            ],
            [
                12571,
                12595
            ],
            [
                12597,
                12624
            ],
            [
                12627,
                12630
            ],
            [
                12630,
                12655
            ],
            [
                12655,
                12720
            ],
            [
                12720,
                12776
            ],
            [
                12776,
                12778
            ],
            [
                12778,
                12891
            ],
            [
                12896,
                12903
            ],
            [
                12917,
                12930
            ],
            [
                12930,
                13000
            ],
            [
                13001,
                13099
            ],
            [
                13099,
                13173
            ],
            [
                13173,
                13180
            ],
            [
                13186,
                13222
            ],
            [
                13224,
                13227
            ],
            [
                13238,
                13247
            ],
            [
                13251,
                13259
            ],
            [
                13259,
                13303
            ],
            [
                13309,
                13329
            ],
            [
                13331,
                13333
            ],
            [
                13334,
                13339
            ],
            [
                13340,
                13345
            ],
            [
                13354,
                13365
            ],
            [
                13371,
                13372
            ],
            [
                13373,
                13448
            ],
            [
                13454,
                13489
            ],
            [
                13489,
                13490
            ],
            [
                13491,
                13529
            ],
            [
                13529,
                13600
            ],
            [
                13601,
                13660
            ],
            [
                13661,
                13673
            ],
            [
                13673,
                13675
            ],
            [
                13675,
                13732
            ],
            [
                13732,
                13776
            ],
            [
                13778,
                13780
            ],
            [
                13789,
                13829
            ],
            [
                13830,
                13843
            ],
            [
                13844,
                13847
            ],
            [
                13848,
                13852
            ],
            [
                13852,
                13932
            ],
            [
                13940,
                13945
            ],
            [
                13954,
                13956
            ],
            [
                13956,
                13974
            ],
            [
                13975,
                14002
            ],
            [
                14002,
                14027
            ],
            [
                14027,
                14061
            ],
            [
                14061,
                14090
            ],
            [
                14090,
                14124
            ],
            [
                14124,
                14136
            ],
            [
                14136,
                14172
            ],
            [
                14172,
                14179
            ],
            [
                14179,
                14201
            ],
            [
                14202,
                14210
            ],
            [
                14210,
                14277
            ],
            [
                14277,
                14306
            ],
            [
                14308,
                14345
            ],
            [
                14346,
                14378
            ],
            [
                14379,
                14400
            ],
            [
                14401,
                14404
            ],
            [
                14405,
                14414
            ],
            [
                14415,
                14433
            ],
            [
                14433,
                14458
            ],
            [
                14458,
                14466
            ],
            [
                14466,
                14480
            ],
            [
                14480,
                14496
            ],
            [
                14496,
                14502
            ],
            [
                14502,
                14544
            ],
            [
                14544,
                14608
            ],
            [
                14608,
                14648
            ],
            [
                14648,
                14660
            ],
            [
                14660,
                14662
            ],
            [
                14662,
                14697
            ],
            [
                14698,
                14732
            ],
            [
                14733,
                14738
            ],
            [
                14739,
                14752
            ],
            [
                14752,
                14755
            ],
            [
                14755,
                14781
            ],
            [
                14781,
                14801
            ],
            [
                14801,
                14872
            ],
            [
                14880,
                14950
            ],
            [
                14952,
                15005
            ],
            [
                15005,
                15146
            ],
            [
                15149,
                15162
            ],
            [
                15165,
                15235
            ],
            [
                15235,
                15246
            ],
            [
                15249,
                15256
            ],
            [
                15257,
                15297
            ],
            [
                15304,
                15331
            ],
            [
                15331,
                15397
            ],
            [
                15400,
                15409
            ],
            [
                15410,
                15425
            ],
            [
                15426,
                15453
            ],
            [
                15453,
                15485
            ],
            [
                15485,
                15487
            ],
            [
                15487,
                15512
            ],
            [
                15515,
                15541
            ],
            [
                15541,
                15577
            ],
            [
                15577,
                15607
            ],
            [
                15608,
                15610
            ],
            [
                15611,
                15665
            ],
            [
                15666,
                15706
            ],
            [
                15708,
                15732
            ],
            [
                15735,
                15741
            ],
            [
                15742,
                15767
            ],
            [
                15768,
                15815
            ],
            [
                15818,
                15856
            ],
            [
                15857,
                15862
            ],
            [
                15868,
                15871
            ],
            [
                15872,
                15891
            ],
            [
                15891,
                15893
            ],
            [
                15893,
                15962
            ],
            [
                15962,
                16021
            ],
            [
                16021,
                16043
            ],
            [
                16043,
                16053
            ],
            [
                16053,
                16073
            ],
            [
                16073,
                16105
            ],
            [
                16105,
                16148
            ],
            [
                16148,
                16171
            ],
            [
                16171,
                16207
            ],
            [
                16207,
                16348
            ],
            [
                16348,
                16414
            ],
            [
                16414,
                16416
            ],
            [
                16424,
                16495
            ],
            [
                16495,
                16527
            ],
            [
                16534,
                16542
            ],
            [
                16548,
                16629
            ],
            [
                16630,
                16677
            ],
            [
                16677,
                16688
            ],
            [
                16690,
                16713
            ],
            [
                16714,
                16873
            ],
            [
                16874,
                16915
            ],
            [
                16915,
                16931
            ],
            [
                16931,
                17002
            ],
            [
                17003,
                17030
            ],
            [
                17030,
                17036
            ],
            [
                17042,
                17053
            ],
            [
                17054,
                17110
            ],
            [
                17123,
                17152
            ],
            [
                17152,
                17158
            ],
            [
                17159,
                17160
            ],
            [
                17161,
                17181
            ],
            [
                17182,
                17274
            ],
            [
                17275,
                17476
            ],
            [
                17477,
                17517
            ],
            [
                17517,
                17518
            ],
            [
                17526,
                17533
            ],
            [
                17536,
                17558
            ],
            [
                17561,
                17605
            ],
            [
                17605,
                17761
            ],
            [
                17762,
                17788
            ],
            [
                17788,
                17790
            ],
            [
                17790,
                17795
            ],
            [
                17796,
                17832
            ],
            [
                17833,
                17861
            ],
            [
                17864,
                17888
            ],
            [
                17888,
                17974
            ],
            [
                17985,
                18005
            ],
            [
                18006,
                18015
            ],
            [
                18016,
                18021
            ],
            [
                18021,
                18039
            ],
            [
                18039,
                18041
            ],
            [
                18041,
                18101
            ],
            [
                18101,
                18146
            ],
            [
                18146,
                18198
            ],
            [
                18198,
                18200
            ],
            [
                18200,
                18323
            ],
            [
                18323,
                18335
            ],
            [
                18336,
                18361
            ],
            [
                18362,
                18380
            ],
            [
                18381,
                18403
            ],
            [
                18403,
                18513
            ],
            [
                18513,
                18541
            ],
            [
                18542,
                18548
            ],
            [
                18560,
                18566
            ],
            [
                18580,
                18608
            ],
            [
                18609,
                18625
            ],
            [
                18626,
                18633
            ],
            [
                18633,
                18673
            ],
            [
                18673,
                18803
            ],
            [
                18803,
                18808
            ],
            [
                18809,
                18839
            ],
            [
                18840,
                18910
            ],
            [
                18912,
                18971
            ],
            [
                18971,
                18989
            ],
            [
                18990,
                19048
            ],
            [
                19048,
                19051
            ],
            [
                19051,
                19158
            ],
            [
                19158,
                19260
            ],
            [
                19260,
                19262
            ],
            [
                19262,
                19363
            ],
            [
                19363,
                19384
            ],
            [
                19392,
                19493
            ],
            [
                19493,
                19494
            ],
            [
                19495,
                19496
            ],
            [
                19497,
                19542
            ],
            [
                19542,
                19543
            ],
            [
                19548,
                19584
            ],
            [
                19584,
                19611
            ],
            [
                19612,
                19729
            ],
            [
                19729,
                19730
            ],
            [
                19731,
                19896
            ],
            [
                19897,
                19951
            ],
            [
                19952,
                19996
            ],
            [
                19996,
                20043
            ],
            [
                20045,
                20072
            ],
            [
                20072,
                20079
            ],
            [
                20080,
                20095
            ],
            [
                20096,
                20169
            ],
            [
                20169,
                20170
            ],
            [
                20182,
                20253
            ],
            [
                20259,
                20299
            ],
            [
                20305,
                20316
            ],
            [
                20316,
                20318
            ],
            [
                20331,
                20357
            ],
            [
                20368,
                20412
            ],
            [
                20413,
                20552
            ],
            [
                20552,
                20574
            ],
            [
                20574,
                20644
            ],
            [
                20655,
                20657
            ],
            [
                20657,
                20940
            ],
            [
                20945,
                20956
            ],
            [
                20960,
                20962
            ],
            [
                20962,
                20973
            ],
            [
                20984,
                21000
            ],
            [
                21000,
                21098
            ],
            [
                21107,
                21139
            ],
            [
                21140,
                21157
            ],
            [
                21157,
                21191
            ],
            [
                21193,
                21194
            ],
            [
                21201,
                21232
            ],
            [
                21236,
                21244
            ],
            [
                21245,
                21256
            ],
            [
                21256,
                21275
            ],
            [
                21275,
                21276
            ],
            [
                21277,
                21386
            ],
            [
                21392,
                21424
            ],
            [
                21426,
                21644
            ],
            [
                21645,
                21666
            ],
            [
                21667,
                21676
            ],
            [
                21684,
                21700
            ],
            [
                21706,
                21713
            ],
            [
                21714,
                21731
            ],
            [
                21732,
                21739
            ],
            [
                21740,
                21745
            ],
            [
                21746,
                21773
            ],
            [
                21773,
                21778
            ],
            [
                21779,
                21789
            ],
            [
                21790,
                21815
            ],
            [
                21815,
                21907
            ],
            [
                21907,
                21909
            ],
            [
                21909,
                21964
            ],
            [
                21966,
                22065
            ],
            [
                22065,
                22186
            ],
            [
                22186,
                22188
            ],
            [
                22227,
                22282
            ],
            [
                22282,
                22343
            ],
            [
                22356,
                22359
            ],
            [
                22368,
                22370
            ],
            [
                22376,
                22377
            ],
            [
                22378,
                22422
            ],
            [
                22422,
                22451
            ],
            [
                22452,
                22456
            ],
            [
                22460,
                22497
            ],
            [
                22497,
                22613
            ],
            [
                22613,
                22615
            ],
            [
                22615,
                22639
            ],
            [
                22640,
                22649
            ],
            [
                22650,
                22693
            ],
            [
                22694,
                22757
            ],
            [
                22757,
                22841
            ],
            [
                22848,
                22850
            ],
            [
                22850,
                22891
            ],
            [
                22891,
                22930
            ],
            [
                22931,
                22938
            ],
            [
                22938,
                22940
            ],
            [
                22940,
                22949
            ],
            [
                22950,
                22991
            ],
            [
                22992,
                23086
            ],
            [
                23086,
                23103
            ],
            [
                23104,
                23148
            ],
            [
                23148,
                23186
            ],
            [
                23192,
                23195
            ],
            [
                23196,
                23214
            ],
            [
                23218,
                23221
            ],
            [
                23222,
                23263
            ],
            [
                23263,
                23268
            ],
            [
                23269,
                23306
            ],
            [
                23306,
                23326
            ],
            [
                23326,
                23430
            ],
            [
                23431,
                23438
            ],
            [
                23447,
                23448
            ],
            [
                23452,
                23458
            ],
            [
                23468,
                23481
            ],
            [
                23481,
                23608
            ],
            [
                23609,
                23618
            ],
            [
                23619,
                23685
            ],
            [
                23685,
                23759
            ],
            [
                23760,
                23770
            ],
            [
                23776,
                23813
            ],
            [
                23813,
                23895
            ],
            [
                23896,
                23911
            ],
            [
                23911,
                23934
            ],
            [
                23937,
                24001
            ],
            [
                24002,
                24019
            ],
            [
                24019,
                24143
            ],
            [
                24146,
                24161
            ],
            [
                24162,
                24170
            ],
            [
                24170,
                24189
            ],
            [
                24189,
                24247
            ],
            [
                24247,
                24265
            ],
            [
                24268,
                24290
            ],
            [
                24290,
                24330
            ],
            [
                24331,
                24359
            ],
            [
                24360,
                24449
            ],
            [
                24450,
                24495
            ],
            [
                24495,
                24535
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                139
            ],
            [
                139,
                302
            ],
            [
                302,
                342
            ],
            [
                342,
                416
            ],
            [
                416,
                529
            ],
            [
                529,
                619
            ],
            [
                619,
                732
            ],
            [
                732,
                862
            ],
            [
                862,
                935
            ],
            [
                935,
                1132
            ],
            [
                1132,
                1132
            ],
            [
                1132,
                1291
            ],
            [
                1291,
                1629
            ],
            [
                1629,
                1773
            ],
            [
                1773,
                1813
            ],
            [
                1813,
                1884
            ],
            [
                1884,
                1976
            ],
            [
                1976,
                2083
            ],
            [
                2083,
                2137
            ],
            [
                2137,
                2190
            ],
            [
                2190,
                2273
            ],
            [
                2273,
                2324
            ],
            [
                2324,
                2436
            ],
            [
                2436,
                2556
            ],
            [
                2556,
                2603
            ],
            [
                2603,
                2645
            ],
            [
                2645,
                2726
            ],
            [
                2726,
                2800
            ],
            [
                2800,
                2901
            ],
            [
                2901,
                2922
            ],
            [
                2922,
                3070
            ],
            [
                3070,
                3153
            ],
            [
                3153,
                3189
            ],
            [
                3189,
                3273
            ],
            [
                3273,
                3305
            ],
            [
                3305,
                3439
            ],
            [
                3439,
                3602
            ],
            [
                3602,
                3783
            ],
            [
                3783,
                3817
            ],
            [
                3817,
                3845
            ],
            [
                3845,
                3954
            ],
            [
                3954,
                3974
            ],
            [
                3974,
                3999
            ],
            [
                3999,
                4014
            ],
            [
                4014,
                4066
            ],
            [
                4066,
                4111
            ],
            [
                4111,
                4191
            ],
            [
                4191,
                4236
            ],
            [
                4236,
                4236
            ],
            [
                4236,
                4396
            ],
            [
                4396,
                4618
            ],
            [
                4618,
                4858
            ],
            [
                4858,
                4984
            ],
            [
                4984,
                5078
            ],
            [
                5078,
                5099
            ],
            [
                5099,
                5325
            ],
            [
                5325,
                5491
            ],
            [
                5491,
                5542
            ],
            [
                5542,
                5659
            ],
            [
                5659,
                5821
            ],
            [
                5821,
                5933
            ],
            [
                5933,
                6182
            ],
            [
                6182,
                6467
            ],
            [
                6467,
                6736
            ],
            [
                6736,
                6810
            ],
            [
                6810,
                6929
            ],
            [
                6929,
                7008
            ],
            [
                7008,
                7074
            ],
            [
                7074,
                7113
            ],
            [
                7113,
                7233
            ],
            [
                7233,
                7304
            ],
            [
                7304,
                7506
            ],
            [
                7506,
                7714
            ],
            [
                7714,
                7817
            ],
            [
                7817,
                7890
            ],
            [
                7890,
                7989
            ],
            [
                7989,
                8096
            ],
            [
                8096,
                8234
            ],
            [
                8234,
                8458
            ],
            [
                8458,
                8601
            ],
            [
                8601,
                8601
            ],
            [
                8601,
                8671
            ],
            [
                8671,
                8859
            ],
            [
                8859,
                8982
            ],
            [
                8982,
                8997
            ],
            [
                8997,
                8997
            ],
            [
                8997,
                9096
            ],
            [
                9096,
                9191
            ],
            [
                9191,
                9301
            ],
            [
                9301,
                9350
            ],
            [
                9350,
                9435
            ],
            [
                9435,
                9539
            ],
            [
                9539,
                9691
            ],
            [
                9691,
                9708
            ],
            [
                9708,
                9735
            ],
            [
                9735,
                10027
            ],
            [
                10027,
                10088
            ],
            [
                10088,
                10168
            ],
            [
                10168,
                10251
            ],
            [
                10251,
                10284
            ],
            [
                10284,
                10316
            ],
            [
                10316,
                10356
            ],
            [
                10356,
                10374
            ],
            [
                10374,
                10419
            ],
            [
                10419,
                10466
            ],
            [
                10466,
                10488
            ],
            [
                10488,
                10506
            ],
            [
                10506,
                10557
            ],
            [
                10557,
                10589
            ],
            [
                10589,
                10596
            ],
            [
                10596,
                10666
            ],
            [
                10666,
                10743
            ],
            [
                10743,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10970
            ],
            [
                10970,
                11062
            ],
            [
                11062,
                11159
            ],
            [
                11159,
                11363
            ],
            [
                11363,
                11387
            ],
            [
                11387,
                11645
            ],
            [
                11645,
                11723
            ],
            [
                11723,
                11835
            ],
            [
                11835,
                11951
            ],
            [
                11951,
                12047
            ],
            [
                12047,
                12172
            ],
            [
                12172,
                12365
            ],
            [
                12365,
                12512
            ],
            [
                12512,
                12571
            ],
            [
                12571,
                12597
            ],
            [
                12597,
                12597
            ],
            [
                12597,
                12655
            ],
            [
                12655,
                12720
            ],
            [
                12720,
                12778
            ],
            [
                12778,
                12930
            ],
            [
                12930,
                13099
            ],
            [
                13099,
                13173
            ],
            [
                13173,
                13259
            ],
            [
                13259,
                13373
            ],
            [
                13373,
                13529
            ],
            [
                13529,
                13675
            ],
            [
                13675,
                13732
            ],
            [
                13732,
                13956
            ],
            [
                13956,
                14002
            ],
            [
                14002,
                14027
            ],
            [
                14027,
                14061
            ],
            [
                14061,
                14090
            ],
            [
                14090,
                14136
            ],
            [
                14136,
                14172
            ],
            [
                14172,
                14179
            ],
            [
                14179,
                14210
            ],
            [
                14210,
                14277
            ],
            [
                14277,
                14308
            ],
            [
                14308,
                14308
            ],
            [
                14308,
                14308
            ],
            [
                14308,
                14308
            ],
            [
                14308,
                14433
            ],
            [
                14433,
                14458
            ],
            [
                14458,
                14466
            ],
            [
                14466,
                14480
            ],
            [
                14480,
                14496
            ],
            [
                14496,
                14502
            ],
            [
                14502,
                14544
            ],
            [
                14544,
                14608
            ],
            [
                14608,
                14648
            ],
            [
                14648,
                14662
            ],
            [
                14662,
                14755
            ],
            [
                14755,
                14781
            ],
            [
                14781,
                14801
            ],
            [
                14801,
                14872
            ],
            [
                14872,
                14872
            ],
            [
                14872,
                14952
            ],
            [
                14952,
                14952
            ],
            [
                14952,
                14952
            ],
            [
                14952,
                14952
            ],
            [
                14952,
                15005
            ],
            [
                15005,
                15149
            ],
            [
                15149,
                15149
            ],
            [
                15149,
                15235
            ],
            [
                15235,
                15257
            ],
            [
                15257,
                15257
            ],
            [
                15257,
                15331
            ],
            [
                15331,
                15400
            ],
            [
                15400,
                15453
            ],
            [
                15453,
                15487
            ],
            [
                15487,
                15541
            ],
            [
                15541,
                15577
            ],
            [
                15577,
                15893
            ],
            [
                15893,
                15962
            ],
            [
                15962,
                16021
            ],
            [
                16021,
                16043
            ],
            [
                16043,
                16053
            ],
            [
                16053,
                16073
            ],
            [
                16073,
                16105
            ],
            [
                16105,
                16148
            ],
            [
                16148,
                16171
            ],
            [
                16171,
                16207
            ],
            [
                16207,
                16207
            ],
            [
                16207,
                16348
            ],
            [
                16348,
                16416
            ],
            [
                16416,
                16495
            ],
            [
                16495,
                16677
            ],
            [
                16677,
                16915
            ],
            [
                16915,
                17030
            ],
            [
                17030,
                17152
            ],
            [
                17152,
                17275
            ],
            [
                17275,
                17477
            ],
            [
                17477,
                17517
            ],
            [
                17517,
                17605
            ],
            [
                17605,
                17790
            ],
            [
                17790,
                17888
            ],
            [
                17888,
                18041
            ],
            [
                18041,
                18101
            ],
            [
                18101,
                18146
            ],
            [
                18146,
                18200
            ],
            [
                18200,
                18323
            ],
            [
                18323,
                18403
            ],
            [
                18403,
                18513
            ],
            [
                18513,
                18633
            ],
            [
                18633,
                18673
            ],
            [
                18673,
                18803
            ],
            [
                18803,
                18971
            ],
            [
                18971,
                19051
            ],
            [
                19051,
                19158
            ],
            [
                19158,
                19262
            ],
            [
                19262,
                19363
            ],
            [
                19363,
                19584
            ],
            [
                19584,
                19996
            ],
            [
                19996,
                20171
            ],
            [
                20171,
                20318
            ],
            [
                20318,
                20552
            ],
            [
                20552,
                20657
            ],
            [
                20657,
                20962
            ],
            [
                20962,
                21157
            ],
            [
                21157,
                21256
            ],
            [
                21256,
                21700
            ],
            [
                21700,
                21815
            ],
            [
                21815,
                21909
            ],
            [
                21909,
                21909
            ],
            [
                21909,
                22065
            ],
            [
                22065,
                22065
            ],
            [
                22065,
                22188
            ],
            [
                22188,
                22282
            ],
            [
                22282,
                22343
            ],
            [
                22343,
                22497
            ],
            [
                22497,
                22615
            ],
            [
                22615,
                22757
            ],
            [
                22757,
                22850
            ],
            [
                22850,
                22891
            ],
            [
                22891,
                22940
            ],
            [
                22940,
                22940
            ],
            [
                22940,
                22992
            ],
            [
                22992,
                22992
            ],
            [
                22992,
                23148
            ],
            [
                23148,
                23263
            ],
            [
                23263,
                23306
            ],
            [
                23306,
                23431
            ],
            [
                23431,
                23431
            ],
            [
                23431,
                23481
            ],
            [
                23481,
                23685
            ],
            [
                23685,
                23813
            ],
            [
                23813,
                23813
            ],
            [
                23813,
                23813
            ],
            [
                23813,
                23937
            ],
            [
                23937,
                23937
            ],
            [
                23937,
                24019
            ],
            [
                24019,
                24146
            ],
            [
                24146,
                24146
            ],
            [
                24146,
                24170
            ],
            [
                24170,
                24189
            ],
            [
                24189,
                24247
            ],
            [
                24247,
                24290
            ],
            [
                24290,
                24535
            ]
        ]
    }
}