{
    "original": {
        "text": "When our time came for returning to Bleak House again, we were punctual to the day and were received with an overpowering welcome. I was perfectly restored to health and strength, and finding my housekeeping keys laid ready for me in my room, rang myself in as if I had been a new year, with a merry little peal. \"Once more, duty, duty, Esther,\" said I; \"and if you are not overjoyed to do it, more than cheerfully and contentedly, through anything and everything, you ought to be. That's all I have to say to you, my dear!\"\nThe first few mornings were mornings of so much bustle and business, devoted to such settlements of accounts, such repeated journeys to and fro between the growlery and all other parts of the house, so many rearrangements of drawers and presses, and such a general new beginning altogether, that I had not a moment's leisure. But when these arrangements were completed and everything was in order, I paid a visit of a few hours to London, which something in the letter I had destroyed at Chesney Wold had induced me to decide upon in my own mind.\nI made Caddy Jellyby--her maiden name was so natural to me that I always called her by it--the pretext for this visit and wrote her a note previously asking the favour of her company on a little business expedition. Leaving home very early in the morning, I got to London by stage-coach in such good time that I got to Newman Street with the day before me.\nCaddy, who had not seen me since her wedding-day, was so glad and so affectionate that I was half inclined to fear I should make her husband jealous. But he was, in his way, just as bad--I mean as good; and in short it was the old story, and nobody would leave me any possibility of doing anything meritorious.\nThe elder Mr. Turveydrop was in bed, I found, and Caddy was milling his chocolate, which a melancholy little boy who was an apprentice--it seemed such a curious thing to be apprenticed to the trade of dancing--was waiting to carry upstairs. Her father-in-law was extremely kind and considerate, Caddy told me, and they lived most happily together. (When she spoke of their living together, she meant that the old gentleman had all the good things and all the good lodging, while she and her husband had what they could get, and were poked into two corner rooms over the Mews.)\n\"And how is your mama, Caddy?\" said I.\n\"Why, I hear of her, Esther,\" replied Caddy, \"through Pa, but I see very little of her. We are good friends, I am glad to say, but Ma thinks there is something absurd in my having married a dancing-master, and she is rather afraid of its extending to her.\"\nIt struck me that if Mrs. Jellyby had discharged her own natural duties and obligations before she swept the horizon with a telescope in search of others, she would have taken the best precautions against becoming absurd, but I need scarcely observe that I kept this to myself.\n\"And your papa, Caddy?\"\n\"He comes here every evening,\" returned Caddy, \"and is so fond of sitting in the corner there that it's a treat to see him.\"\nLooking at the corner, I plainly perceived the mark of Mr. Jellyby's head against the wall. It was consolatory to know that he had found such a resting-place for it.\n\"And you, Caddy,\" said I, \"you are always busy, I'll be bound?\"\n\"Well, my dear,\" returned Caddy, \"I am indeed, for to tell you a grand secret, I am qualifying myself to give lessons. Prince's health is not strong, and I want to be able to assist him. What with schools, and classes here, and private pupils, AND the apprentices, he really has too much to do, poor fellow!\"\nThe notion of the apprentices was still so odd to me that I asked Caddy if there were many of them.\n\"Four,\" said Caddy. \"One in-door, and three out. They are very good children; only when they get together they WILL play--children-like--instead of attending to their work. So the little boy you saw just now waltzes by himself in the empty kitchen, and we distribute the others over the house as well as we can.\"\n\"That is only for their steps, of course?\" said I.\n\"Only for their steps,\" said Caddy. \"In that way they practise, so many hours at a time, whatever steps they happen to be upon. They dance in the academy, and at this time of year we do figures at five every morning.\"\n\"Why, what a laborious life!\" I exclaimed.\n\"I assure you, my dear,\" returned Caddy, smiling, \"when the out-door apprentices ring us up in the morning (the bell rings into our room, not to disturb old Mr. Turveydrop), and when I put up the window and see them standing on the door-step with their little pumps under their arms, I am actually reminded of the Sweeps.\"\nAll this presented the art to me in a singular light, to be sure. Caddy enjoyed the effect of her communication and cheerfully recounted the particulars of her own studies.\n\"You see, my dear, to save expense I ought to know something of the piano, and I ought to know something of the kit too, and consequently I have to practise those two instruments as well as the details of our profession. If Ma had been like anybody else, I might have had some little musical knowledge to begin upon. However, I hadn't any; and that part of the work is, at first, a little discouraging, I must allow. But I have a very good ear, and I am used to drudgery--I have to thank Ma for that, at all events--and where there's a will there's a way, you know, Esther, the world over.\" Saying these words, Caddy laughingly sat down at a little jingling square piano and really rattled off a quadrille with great spirit. Then she good-humouredly and blushingly got up again, and while she still laughed herself, said, \"Don't laugh at me, please; that's a dear girl!\"\nI would sooner have cried, but I did neither. I encouraged her and praised her with all my heart. For I conscientiously believed, dancing-master's wife though she was, and dancing-mistress though in her limited ambition she aspired to be, she had struck out a natural, wholesome, loving course of industry and perseverance that was quite as good as a mission.\n\"My dear,\" said Caddy, delighted, \"you can't think how you cheer me. I shall owe you, you don't know how much. What changes, Esther, even in my small world! You recollect that first night, when I was so unpolite and inky? Who would have thought, then, of my ever teaching people to dance, of all other possibilities and impossibilities!\"\nHer husband, who had left us while we had this chat, now coming back, preparatory to exercising the apprentices in the ball-room, Caddy informed me she was quite at my disposal. But it was not my time yet, I was glad to tell her, for I should have been vexed to take her away then. Therefore we three adjourned to the apprentices together, and I made one in the dance.\nThe apprentices were the queerest little people. Besides the melancholy boy, who, I hoped, had not been made so by waltzing alone in the empty kitchen, there were two other boys and one dirty little limp girl in a gauzy dress. Such a precocious little girl, with such a dowdy bonnet on (that, too, of a gauzy texture), who brought her sandalled shoes in an old threadbare velvet reticule. Such mean little boys, when they were not dancing, with string, and marbles, and cramp-bones in their pockets, and the most untidy legs and feet--and heels particularly.\nI asked Caddy what had made their parents choose this profession for them. Caddy said she didn't know; perhaps they were designed for teachers, perhaps for the stage. They were all people in humble circumstances, and the melancholy boy's mother kept a ginger-beer shop.\nWe danced for an hour with great gravity, the melancholy child doing wonders with his lower extremities, in which there appeared to be some sense of enjoyment though it never rose above his waist. Caddy, while she was observant of her husband and was evidently founded upon him, had acquired a grace and self-possession of her own, which, united to her pretty face and figure, was uncommonly agreeable. She already relieved him of much of the instruction of these young people, and he seldom interfered except to walk his part in the figure if he had anything to do in it. He always played the tune. The affectation of the gauzy child, and her condescension to the boys, was a sight. And thus we danced an hour by the clock.\nWhen the practice was concluded, Caddy's husband made himself ready to go out of town to a school, and Caddy ran away to get ready to go out with me. I sat in the ball-room in the interval, contemplating the apprentices. The two out-door boys went upon the staircase to put on their half-boots and pull the in-door boy's hair, as I judged from the nature of his objections. Returning with their jackets buttoned and their pumps stuck in them, they then produced packets of cold bread and meat and bivouacked under a painted lyre on the wall. The little gauzy child, having whisked her sandals into the reticule and put on a trodden-down pair of shoes, shook her head into the dowdy bonnet at one shake, and answering my inquiry whether she liked dancing by replying, \"Not with boys,\" tied it across her chin, and went home contemptuous.\n\"Old Mr. Turveydrop is so sorry,\" said Caddy, \"that he has not finished dressing yet and cannot have the pleasure of seeing you before you go. You are such a favourite of his, Esther.\"\nI expressed myself much obliged to him, but did not think it necessary to add that I readily dispensed with this attention.\n\"It takes him a long time to dress,\" said Caddy, \"because he is very much looked up to in such things, you know, and has a reputation to support. You can't think how kind he is to Pa. He talks to Pa of an evening about the Prince Regent, and I never saw Pa so interested.\"\nThere was something in the picture of Mr. Turveydrop bestowing his deportment on Mr. Jellyby that quite took my fancy. I asked Caddy if he brought her papa out much.\n\"No,\" said Caddy, \"I don't know that he does that, but he talks to Pa, and Pa greatly admires him, and listens, and likes it. Of course I am aware that Pa has hardly any claims to deportment, but they get on together delightfully. You can't think what good companions they make. I never saw Pa take snuff before in my life, but he takes one pinch out of Mr. Turveydrop's box regularly and keeps putting it to his nose and taking it away again all the evening.\"\nThat old Mr. Turveydrop should ever, in the chances and changes of life, have come to the rescue of Mr. Jellyby from Borrioboola-Gha appeared to me to be one of the pleasantest of oddities.\n\"As to Peepy,\" said Caddy with a little hesitation, \"whom I was most afraid of--next to having any family of my own, Esther--as an inconvenience to Mr. Turveydrop, the kindness of the old gentleman to that child is beyond everything. He asks to see him, my dear! He lets him take the newspaper up to him in bed; he gives him the crusts of his toast to eat; he sends him on little errands about the house; he tells him to come to me for sixpences. In short,\" said Caddy cheerily, \"and not to prose, I am a very fortunate girl and ought to be very grateful. Where are we going, Esther?\"\n\"To the Old Street Road,\" said I, \"where I have a few words to say to the solicitor's clerk who was sent to meet me at the coach-office on the very day when I came to London and first saw you, my dear. Now I think of it, the gentleman who brought us to your house.\"\n\"Then, indeed, I seem to be naturally the person to go with you,\" returned Caddy.\nTo the Old Street Road we went and there inquired at Mrs. Guppy's residence for Mrs. Guppy. Mrs. Guppy, occupying the parlours and having indeed been visibly in danger of cracking herself like a nut in the front-parlour door by peeping out before she was asked for, immediately presented herself and requested us to walk in. She was an old lady in a large cap, with rather a red nose and rather an unsteady eye, but smiling all over. Her close little sitting-room was prepared for a visit, and there was a portrait of her son in it which, I had almost written here, was more like than life: it insisted upon him with such obstinacy, and was so determined not to let him off.\nNot only was the portrait there, but we found the original there too. He was dressed in a great many colours and was discovered at a table reading law-papers with his forefinger to his forehead.\n\"Miss Summerson,\" said Mr. Guppy, rising, \"this is indeed an oasis. Mother, will you be so good as to put a chair for the other lady and get out of the gangway.\"\nMrs. Guppy, whose incessant smiling gave her quite a waggish appearance, did as her son requested and then sat down in a corner, holding her pocket handkerchief to her chest, like a fomentation, with both hands.\nI presented Caddy, and Mr. Guppy said that any friend of mine was more than welcome. I then proceeded to the object of my visit.\n\"I took the liberty of sending you a note, sir,\" said I.\nMr. Guppy acknowledged the receipt by taking it out of his breast-pocket, putting it to his lips, and returning it to his pocket with a bow. Mr. Guppy's mother was so diverted that she rolled her head as she smiled and made a silent appeal to Caddy with her elbow.\n\"Could I speak to you alone for a moment?\" said I.\nAnything like the jocoseness of Mr. Guppy's mother just now, I think I never saw. She made no sound of laughter, but she rolled her head, and shook it, and put her handkerchief to her mouth, and appealed to Caddy with her elbow, and her hand, and her shoulder, and was so unspeakably entertained altogether that it was with some difficulty she could marshal Caddy through the little folding-door into her bedroom adjoining.\n\"Miss Summerson,\" said Mr. Guppy, \"you will excuse the waywardness of a parent ever mindful of a son's appiness. My mother, though highly exasperating to the feelings, is actuated by maternal dictates.\"\nI could hardly have believed that anybody could in a moment have turned so red or changed so much as Mr. Guppy did when I now put up my veil.\n\"I asked the favour of seeing you for a few moments here,\" said I, \"in preference to calling at Mr. Kenge's because, remembering what you said on an occasion when you spoke to me in confidence, I feared I might otherwise cause you some embarrassment, Mr. Guppy.\"\nI caused him embarrassment enough as it was, I am sure. I never saw such faltering, such confusion, such amazement and apprehension.\n\"Miss Summerson,\" stammered Mr. Guppy, \"I--I--beg your pardon, but in our profession--we--we--find it necessary to be explicit. You have referred to an occasion, miss, when I--when I did myself the honour of making a declaration which--\"\nSomething seemed to rise in his throat that he could not possibly swallow. He put his hand there, coughed, made faces, tried again to swallow it, coughed again, made faces again, looked all round the room, and fluttered his papers.\n\"A kind of giddy sensation has come upon me, miss,\" he explained, \"which rather knocks me over. I--er--a little subject to this sort of thing--er--by George!\"\nI gave him a little time to recover. He consumed it in putting his hand to his forehead and taking it away again, and in backing his chair into the corner behind him.\n\"My intention was to remark, miss,\" said Mr. Guppy, \"dear me--something bronchial, I think--hem!--to remark that you was so good on that occasion as to repel and repudiate that declaration. You--you wouldn't perhaps object to admit that? Though no witnesses are present, it might be a satisfaction to--to your mind--if you was to put in that admission.\"\n\"There can be no doubt,\" said I, \"that I declined your proposal without any reservation or qualification whatever, Mr. Guppy.\"\n\"Thank you, miss,\" he returned, measuring the table with his troubled hands. \"So far that's satisfactory, and it does you credit. Er--this is certainly bronchial!--must be in the tubes--er--you wouldn't perhaps be offended if I was to mention--not that it's necessary, for your own good sense or any person's sense must show 'em that--if I was to mention that such declaration on my part was final, and there terminated?\"\n\"I quite understand that,\" said I.\n\"Perhaps--er--it may not be worth the form, but it might be a satisfaction to your mind--perhaps you wouldn't object to admit that, miss?\" said Mr. Guppy.\n\"I admit it most fully and freely,\" said I.\n\"Thank you,\" returned Mr. Guppy. \"Very honourable, I am sure. I regret that my arrangements in life, combined with circumstances over which I have no control, will put it out of my power ever to fall back upon that offer or to renew it in any shape or form whatever, but it will ever be a retrospect entwined--er--with friendship's bowers.\" Mr. Guppy's bronchitis came to his relief and stopped his measurement of the table.\n\"I may now perhaps mention what I wished to say to you?\" I began.\n\"I shall be honoured, I am sure,\" said Mr. Guppy. \"I am so persuaded that your own good sense and right feeling, miss, will--will keep you as square as possible--that I can have nothing but pleasure, I am sure, in hearing any observations you may wish to offer.\"\n\"You were so good as to imply, on that occasion--\"\n\"Excuse me, miss,\" said Mr. Guppy, \"but we had better not travel out of the record into implication. I cannot admit that I implied anything.\"\n\"You said on that occasion,\" I recommenced, \"that you might possibly have the means of advancing my interests and promoting my fortunes by making discoveries of which I should be the subject. I presume that you founded that belief upon your general knowledge of my being an orphan girl, indebted for everything to the benevolence of Mr. Jarndyce. Now, the beginning and the end of what I have come to beg of you is, Mr. Guppy, that you will have the kindness to relinquish all idea of so serving me. I have thought of this sometimes, and I have thought of it most lately--since I have been ill. At length I have decided, in case you should at any time recall that purpose and act upon it in any way, to come to you and assure you that you are altogether mistaken. You could make no discovery in reference to me that would do me the least service or give me the least pleasure. I am acquainted with my personal history, and I have it in my power to assure you that you never can advance my welfare by such means. You may, perhaps, have abandoned this project a long time. If so, excuse my giving you unnecessary trouble. If not, I entreat you, on the assurance I have given you, henceforth to lay it aside. I beg you to do this, for my peace.\"\n\"I am bound to confess,\" said Mr. Guppy, \"that you express yourself, miss, with that good sense and right feeling for which I gave you credit. Nothing can be more satisfactory than such right feeling, and if I mistook any intentions on your part just now, I am prepared to tender a full apology. I should wish to be understood, miss, as hereby offering that apology--limiting it, as your own good sense and right feeling will point out the necessity of, to the present proceedings.\"\nI must say for Mr. Guppy that the snuffling manner he had had upon him improved very much. He seemed truly glad to be able to do something I asked, and he looked ashamed.\n\"If you will allow me to finish what I have to say at once so that I may have no occasion to resume,\" I went on, seeing him about to speak, \"you will do me a kindness, sir. I come to you as privately as possible because you announced this impression of yours to me in a confidence which I have really wished to respect--and which I always have respected, as you remember. I have mentioned my illness. There really is no reason why I should hesitate to say that I know very well that any little delicacy I might have had in making a request to you is quite removed. Therefore I make the entreaty I have now preferred, and I hope you will have sufficient consideration for me to accede to it.\"\nI must do Mr. Guppy the further justice of saying that he had looked more and more ashamed and that he looked most ashamed and very earnest when he now replied with a burning face, \"Upon my word and honour, upon my life, upon my soul, Miss Summerson, as I am a living man, I'll act according to your wish! I'll never go another step in opposition to it. I'll take my oath to it if it will be any satisfaction to you. In what I promise at this present time touching the matters now in question,\" continued Mr. Guppy rapidly, as if he were repeating a familiar form of words, \"I speak the truth, the whole truth, and nothing but the truth, so--\"\n\"I am quite satisfied,\" said I, rising at this point, \"and I thank you very much. Caddy, my dear, I am ready!\"\nMr. Guppy's mother returned with Caddy (now making me the recipient of her silent laughter and her nudges), and we took our leave. Mr. Guppy saw us to the door with the air of one who was either imperfectly awake or walking in his sleep; and we left him there, staring.\nBut in a minute he came after us down the street without any hat, and with his long hair all blown about, and stopped us, saying fervently, \"Miss Summerson, upon my honour and soul, you may depend upon me!\"\n\"I do,\" said I, \"quite confidently.\"\n\"I beg your pardon, miss,\" said Mr. Guppy, going with one leg and staying with the other, \"but this lady being present--your own witness--it might be a satisfaction to your mind (which I should wish to set at rest) if you was to repeat those admissions.\"\n\"Well, Caddy,\" said I, turning to her, \"perhaps you will not be surprised when I tell you, my dear, that there never has been any engagement--\"\n\"No proposal or promise of marriage whatsoever,\" suggested Mr. Guppy.\n\"No proposal or promise of marriage whatsoever,\" said I, \"between this gentleman--\"\n\"William Guppy, of Penton Place, Pentonville, in the county of Middlesex,\" he murmured.\n\"Between this gentleman, Mr. William Guppy, of Penton Place, Pentonville, in the county of Middlesex, and myself.\"\n\"Thank you, miss,\" said Mr. Guppy. \"Very full--er--excuse me--lady's name, Christian and surname both?\"\nI gave them.\n\"Married woman, I believe?\" said Mr. Guppy. \"Married woman. Thank you. Formerly Caroline Jellyby, spinster, then of Thavies Inn, within the city of London, but extra-parochial; now of Newman Street, Oxford Street. Much obliged.\"\nHe ran home and came running back again.\n\"Touching that matter, you know, I really and truly am very sorry that my arrangements in life, combined with circumstances over which I have no control, should prevent a renewal of what was wholly terminated some time back,\" said Mr. Guppy to me forlornly and despondently, \"but it couldn't be. Now COULD it, you know! I only put it to you.\"\nI replied it certainly could not. The subject did not admit of a doubt. He thanked me and ran to his mother's again--and back again.\n\"It's very honourable of you, miss, I am sure,\" said Mr. Guppy. \"If an altar could be erected in the bowers of friendship--but, upon my soul, you may rely upon me in every respect save and except the tender passion only!\"\nThe struggle in Mr. Guppy's breast and the numerous oscillations it occasioned him between his mother's door and us were sufficiently conspicuous in the windy street (particularly as his hair wanted cutting) to make us hurry away. I did so with a lightened heart; but when we last looked back, Mr. Guppy was still oscillating in the same troubled state of mind.",
        "paragraph_chars": [
            [
                0,
                525
            ],
            [
                525,
                1072
            ],
            [
                1072,
                1429
            ],
            [
                1429,
                1740
            ],
            [
                1740,
                2317
            ],
            [
                2317,
                2356
            ],
            [
                2356,
                2613
            ],
            [
                2613,
                2891
            ],
            [
                2891,
                2915
            ],
            [
                2915,
                3040
            ],
            [
                3040,
                3206
            ],
            [
                3206,
                3270
            ],
            [
                3270,
                3579
            ],
            [
                3579,
                3679
            ],
            [
                3679,
                3992
            ],
            [
                3992,
                4043
            ],
            [
                4043,
                4261
            ],
            [
                4261,
                4304
            ],
            [
                4304,
                4627
            ],
            [
                4627,
                4800
            ],
            [
                4800,
                5671
            ],
            [
                5671,
                6031
            ],
            [
                6031,
                6369
            ],
            [
                6369,
                6738
            ],
            [
                6738,
                7297
            ],
            [
                7297,
                7567
            ],
            [
                7567,
                8292
            ],
            [
                8292,
                9129
            ],
            [
                9129,
                9314
            ],
            [
                9314,
                9438
            ],
            [
                9438,
                9711
            ],
            [
                9711,
                9877
            ],
            [
                9877,
                10338
            ],
            [
                10338,
                10528
            ],
            [
                10528,
                11113
            ],
            [
                11113,
                11379
            ],
            [
                11379,
                11461
            ],
            [
                11461,
                12136
            ],
            [
                12136,
                12331
            ],
            [
                12331,
                12493
            ],
            [
                12493,
                12705
            ],
            [
                12705,
                12834
            ],
            [
                12834,
                12891
            ],
            [
                12891,
                13156
            ],
            [
                13156,
                13207
            ],
            [
                13207,
                13631
            ],
            [
                13631,
                13834
            ],
            [
                13834,
                13976
            ],
            [
                13976,
                14239
            ],
            [
                14239,
                14372
            ],
            [
                14372,
                14610
            ],
            [
                14610,
                14842
            ],
            [
                14842,
                15001
            ],
            [
                15001,
                15168
            ],
            [
                15168,
                15522
            ],
            [
                15522,
                15649
            ],
            [
                15649,
                16071
            ],
            [
                16071,
                16106
            ],
            [
                16106,
                16261
            ],
            [
                16261,
                16305
            ],
            [
                16305,
                16730
            ],
            [
                16730,
                16796
            ],
            [
                16796,
                17059
            ],
            [
                17059,
                17110
            ],
            [
                17110,
                17252
            ],
            [
                17252,
                18495
            ],
            [
                18495,
                18978
            ],
            [
                18978,
                19149
            ],
            [
                19149,
                19841
            ],
            [
                19841,
                20485
            ],
            [
                20485,
                20596
            ],
            [
                20596,
                20866
            ],
            [
                20866,
                21073
            ],
            [
                21073,
                21110
            ],
            [
                21110,
                21365
            ],
            [
                21365,
                21509
            ],
            [
                21509,
                21579
            ],
            [
                21579,
                21663
            ],
            [
                21663,
                21751
            ],
            [
                21751,
                21866
            ],
            [
                21866,
                21970
            ],
            [
                21970,
                21983
            ],
            [
                21983,
                22212
            ],
            [
                22212,
                22253
            ],
            [
                22253,
                22596
            ],
            [
                22596,
                22729
            ],
            [
                22729,
                22951
            ],
            [
                22951,
                23312
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                313
            ],
            [
                313,
                482
            ],
            [
                482,
                525
            ],
            [
                525,
                851
            ],
            [
                851,
                1072
            ],
            [
                1072,
                1288
            ],
            [
                1288,
                1429
            ],
            [
                1429,
                1579
            ],
            [
                1579,
                1740
            ],
            [
                1740,
                1981
            ],
            [
                1981,
                2088
            ],
            [
                2088,
                2317
            ],
            [
                2317,
                2348
            ],
            [
                2348,
                2356
            ],
            [
                2356,
                2444
            ],
            [
                2444,
                2613
            ],
            [
                2613,
                2891
            ],
            [
                2891,
                2915
            ],
            [
                2915,
                3040
            ],
            [
                3040,
                3132
            ],
            [
                3132,
                3206
            ],
            [
                3206,
                3270
            ],
            [
                3270,
                3389
            ],
            [
                3389,
                3457
            ],
            [
                3457,
                3579
            ],
            [
                3579,
                3679
            ],
            [
                3679,
                3699
            ],
            [
                3699,
                3728
            ],
            [
                3728,
                3852
            ],
            [
                3852,
                3992
            ],
            [
                3992,
                4035
            ],
            [
                4035,
                4043
            ],
            [
                4043,
                4079
            ],
            [
                4079,
                4171
            ],
            [
                4171,
                4261
            ],
            [
                4261,
                4291
            ],
            [
                4291,
                4304
            ],
            [
                4304,
                4627
            ],
            [
                4627,
                4693
            ],
            [
                4693,
                4800
            ],
            [
                4800,
                5021
            ],
            [
                5021,
                5117
            ],
            [
                5117,
                5217
            ],
            [
                5217,
                5391
            ],
            [
                5391,
                5525
            ],
            [
                5525,
                5671
            ],
            [
                5671,
                5717
            ],
            [
                5717,
                5769
            ],
            [
                5769,
                6031
            ],
            [
                6031,
                6100
            ],
            [
                6100,
                6142
            ],
            [
                6142,
                6188
            ],
            [
                6188,
                6253
            ],
            [
                6253,
                6369
            ],
            [
                6369,
                6547
            ],
            [
                6547,
                6651
            ],
            [
                6651,
                6738
            ],
            [
                6738,
                6787
            ],
            [
                6787,
                6965
            ],
            [
                6965,
                7127
            ],
            [
                7127,
                7297
            ],
            [
                7297,
                7372
            ],
            [
                7372,
                7464
            ],
            [
                7464,
                7567
            ],
            [
                7567,
                7764
            ],
            [
                7764,
                7970
            ],
            [
                7970,
                8140
            ],
            [
                8140,
                8167
            ],
            [
                8167,
                8251
            ],
            [
                8251,
                8292
            ],
            [
                8292,
                8442
            ],
            [
                8442,
                8513
            ],
            [
                8513,
                8666
            ],
            [
                8666,
                8834
            ],
            [
                8834,
                9129
            ],
            [
                9129,
                9272
            ],
            [
                9272,
                9314
            ],
            [
                9314,
                9438
            ],
            [
                9438,
                9584
            ],
            [
                9584,
                9622
            ],
            [
                9622,
                9711
            ],
            [
                9711,
                9830
            ],
            [
                9830,
                9877
            ],
            [
                9877,
                10003
            ],
            [
                10003,
                10108
            ],
            [
                10108,
                10156
            ],
            [
                10156,
                10338
            ],
            [
                10338,
                10528
            ],
            [
                10528,
                10762
            ],
            [
                10762,
                10791
            ],
            [
                10791,
                10975
            ],
            [
                10975,
                11084
            ],
            [
                11084,
                11113
            ],
            [
                11113,
                11315
            ],
            [
                11315,
                11379
            ],
            [
                11379,
                11461
            ],
            [
                11461,
                11553
            ],
            [
                11553,
                11786
            ],
            [
                11786,
                11895
            ],
            [
                11895,
                12136
            ],
            [
                12136,
                12206
            ],
            [
                12206,
                12331
            ],
            [
                12331,
                12399
            ],
            [
                12399,
                12493
            ],
            [
                12493,
                12705
            ],
            [
                12705,
                12790
            ],
            [
                12790,
                12834
            ],
            [
                12834,
                12891
            ],
            [
                12891,
                13032
            ],
            [
                13032,
                13156
            ],
            [
                13156,
                13199
            ],
            [
                13199,
                13207
            ],
            [
                13207,
                13289
            ],
            [
                13289,
                13631
            ],
            [
                13631,
                13744
            ],
            [
                13744,
                13834
            ],
            [
                13834,
                13976
            ],
            [
                13976,
                14239
            ],
            [
                14239,
                14295
            ],
            [
                14295,
                14372
            ],
            [
                14372,
                14500
            ],
            [
                14500,
                14610
            ],
            [
                14610,
                14685
            ],
            [
                14685,
                14842
            ],
            [
                14842,
                14938
            ],
            [
                14938,
                15001
            ],
            [
                15001,
                15038
            ],
            [
                15038,
                15168
            ],
            [
                15168,
                15358
            ],
            [
                15358,
                15406
            ],
            [
                15406,
                15522
            ],
            [
                15522,
                15649
            ],
            [
                15649,
                15726
            ],
            [
                15726,
                15779
            ],
            [
                15779,
                16071
            ],
            [
                16071,
                16106
            ],
            [
                16106,
                16245
            ],
            [
                16245,
                16261
            ],
            [
                16261,
                16305
            ],
            [
                16305,
                16338
            ],
            [
                16338,
                16367
            ],
            [
                16367,
                16646
            ],
            [
                16646,
                16730
            ],
            [
                16730,
                16787
            ],
            [
                16787,
                16796
            ],
            [
                16796,
                16846
            ],
            [
                16846,
                17059
            ],
            [
                17059,
                17110
            ],
            [
                17110,
                17211
            ],
            [
                17211,
                17252
            ],
            [
                17252,
                17444
            ],
            [
                17444,
                17599
            ],
            [
                17599,
                17752
            ],
            [
                17752,
                18016
            ],
            [
                18016,
                18129
            ],
            [
                18129,
                18264
            ],
            [
                18264,
                18323
            ],
            [
                18323,
                18372
            ],
            [
                18372,
                18458
            ],
            [
                18458,
                18495
            ],
            [
                18495,
                18638
            ],
            [
                18638,
                18791
            ],
            [
                18791,
                18978
            ],
            [
                18978,
                19069
            ],
            [
                19069,
                19149
            ],
            [
                19149,
                19322
            ],
            [
                19322,
                19521
            ],
            [
                19521,
                19550
            ],
            [
                19550,
                19714
            ],
            [
                19714,
                19841
            ],
            [
                19841,
                20147
            ],
            [
                20147,
                20195
            ],
            [
                20195,
                20258
            ],
            [
                20258,
                20485
            ],
            [
                20485,
                20567
            ],
            [
                20567,
                20596
            ],
            [
                20596,
                20727
            ],
            [
                20727,
                20866
            ],
            [
                20866,
                21073
            ],
            [
                21073,
                21110
            ],
            [
                21110,
                21365
            ],
            [
                21365,
                21509
            ],
            [
                21509,
                21579
            ],
            [
                21579,
                21663
            ],
            [
                21663,
                21751
            ],
            [
                21751,
                21866
            ],
            [
                21866,
                21901
            ],
            [
                21901,
                21970
            ],
            [
                21970,
                21983
            ],
            [
                21983,
                22011
            ],
            [
                22011,
                22027
            ],
            [
                22027,
                22043
            ],
            [
                22043,
                22054
            ],
            [
                22054,
                22197
            ],
            [
                22197,
                22212
            ],
            [
                22212,
                22253
            ],
            [
                22253,
                22549
            ],
            [
                22549,
                22573
            ],
            [
                22573,
                22596
            ],
            [
                22596,
                22630
            ],
            [
                22630,
                22668
            ],
            [
                22668,
                22729
            ],
            [
                22729,
                22793
            ],
            [
                22793,
                22951
            ],
            [
                22951,
                23182
            ],
            [
                23182,
                23312
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                33,
                47
            ],
            [
                53,
                57
            ],
            [
                87,
                131
            ],
            [
                131,
                165
            ],
            [
                178,
                257
            ],
            [
                287,
                312
            ],
            [
                313,
                323
            ],
            [
                329,
                392
            ],
            [
                404,
                431
            ],
            [
                465,
                480
            ],
            [
                525,
                547
            ],
            [
                565,
                593
            ],
            [
                610,
                634
            ],
            [
                640,
                660
            ],
            [
                677,
                693
            ],
            [
                732,
                749
            ],
            [
                814,
                851
            ],
            [
                851,
                859
            ],
            [
                898,
                931
            ],
            [
                932,
                937
            ],
            [
                953,
                962
            ],
            [
                941,
                942
            ],
            [
                964,
                1025
            ],
            [
                1030,
                1043
            ],
            [
                1070,
                1072
            ],
            [
                1072,
                1084
            ],
            [
                1163,
                1210
            ],
            [
                1222,
                1288
            ],
            [
                1288,
                1311
            ],
            [
                1326,
                1361
            ],
            [
                1367,
                1376
            ],
            [
                1427,
                1429
            ],
            [
                1429,
                1579
            ],
            [
                1579,
                1589
            ],
            [
                1603,
                1610
            ],
            [
                1626,
                1630
            ],
            [
                1690,
                1692
            ],
            [
                1738,
                1740
            ],
            [
                1740,
                1799
            ],
            [
                1808,
                1848
            ],
            [
                1864,
                1874
            ],
            [
                1849,
                1852
            ],
            [
                1876,
                1885
            ],
            [
                1893,
                1900
            ],
            [
                1907,
                1948
            ],
            [
                1950,
                1981
            ],
            [
                1981,
                2088
            ],
            [
                2088,
                2089
            ],
            [
                2128,
                2129
            ],
            [
                2145,
                2190
            ],
            [
                2195,
                2238
            ],
            [
                2268,
                2317
            ],
            [
                2317,
                2348
            ],
            [
                2348,
                2356
            ],
            [
                2356,
                2444
            ],
            [
                2444,
                2572
            ],
            [
                2580,
                2613
            ],
            [
                2613,
                2684
            ],
            [
                2701,
                2833
            ],
            [
                2835,
                2838
            ],
            [
                2868,
                2891
            ],
            [
                2891,
                2915
            ],
            [
                2915,
                2943
            ],
            [
                2960,
                2961
            ],
            [
                2963,
                3040
            ],
            [
                3206,
                3270
            ],
            [
                3270,
                3271
            ],
            [
                3304,
                3315
            ],
            [
                3284,
                3304
            ],
            [
                3317,
                3320
            ],
            [
                3349,
                3389
            ],
            [
                3389,
                3433
            ],
            [
                3445,
                3457
            ],
            [
                3457,
                3487
            ],
            [
                3492,
                3579
            ],
            [
                3637,
                3669
            ],
            [
                3597,
                3608
            ],
            [
                3677,
                3679
            ],
            [
                3679,
                3699
            ],
            [
                3728,
                3799
            ],
            [
                3816,
                3852
            ],
            [
                3852,
                3912
            ],
            [
                3919,
                3971
            ],
            [
                4159,
                4161
            ],
            [
                4097,
                4105
            ],
            [
                4010,
                4021
            ],
            [
                4169,
                4171
            ],
            [
                4819,
                4834
            ],
            [
                4808,
                4809
            ],
            [
                4800,
                4801
            ],
            [
                4835,
                4836
            ],
            [
                4864,
                4878
            ],
            [
                4908,
                4915
            ],
            [
                5019,
                5021
            ],
            [
                5021,
                5076
            ],
            [
                5084,
                5101
            ],
            [
                5115,
                5117
            ],
            [
                5364,
                5365
            ],
            [
                5221,
                5229
            ],
            [
                5235,
                5270
            ],
            [
                5272,
                5314
            ],
            [
                5316,
                5364
            ],
            [
                5388,
                5390
            ],
            [
                5409,
                5474
            ],
            [
                5482,
                5525
            ],
            [
                5525,
                5533
            ],
            [
                5554,
                5564
            ],
            [
                5616,
                5671
            ],
            [
                5671,
                5717
            ],
            [
                5717,
                5718
            ],
            [
                5738,
                5769
            ],
            [
                5769,
                5772
            ],
            [
                5874,
                5881
            ],
            [
                5823,
                5829
            ],
            [
                5870,
                5873
            ],
            [
                5908,
                5976
            ],
            [
                5994,
                6031
            ],
            [
                6031,
                6100
            ],
            [
                6100,
                6101
            ],
            [
                6108,
                6142
            ],
            [
                6188,
                6253
            ],
            [
                6253,
                6318
            ],
            [
                6366,
                6369
            ],
            [
                6661,
                6663
            ],
            [
                6707,
                6708
            ],
            [
                6683,
                6698
            ],
            [
                6736,
                6737
            ],
            [
                6754,
                6787
            ],
            [
                6787,
                6813
            ],
            [
                6888,
                6965
            ],
            [
                6965,
                7000
            ],
            [
                7006,
                7020
            ],
            [
                7029,
                7030
            ],
            [
                7057,
                7072
            ],
            [
                7083,
                7125
            ],
            [
                7001,
                7005
            ],
            [
                7137,
                7149
            ],
            [
                7178,
                7189
            ],
            [
                7191,
                7202
            ],
            [
                7220,
                7271
            ],
            [
                7295,
                7297
            ],
            [
                7297,
                7372
            ],
            [
                7372,
                7464
            ],
            [
                7464,
                7567
            ],
            [
                7567,
                7658
            ],
            [
                7670,
                7706
            ],
            [
                7716,
                7764
            ],
            [
                7764,
                7769
            ],
            [
                7846,
                7858
            ],
            [
                7959,
                7968
            ],
            [
                7861,
                7898
            ],
            [
                7771,
                7776
            ],
            [
                7798,
                7809
            ],
            [
                7968,
                7970
            ],
            [
                8167,
                8250
            ],
            [
                8292,
                8313
            ],
            [
                8323,
                8340
            ],
            [
                8354,
                8400
            ],
            [
                8417,
                8441
            ],
            [
                9129,
                9162
            ],
            [
                9163,
                9167
            ],
            [
                9173,
                9272
            ],
            [
                9272,
                9311
            ],
            [
                9439,
                9472
            ],
            [
                9488,
                9498
            ],
            [
                9555,
                9584
            ],
            [
                9584,
                9622
            ],
            [
                9622,
                9633
            ],
            [
                9637,
                9711
            ],
            [
                9830,
                9849
            ],
            [
                9858,
                9866
            ],
            [
                9871,
                9877
            ],
            [
                9877,
                9896
            ],
            [
                9928,
                9931
            ],
            [
                9952,
                10003
            ],
            [
                10003,
                10108
            ],
            [
                10156,
                10188
            ],
            [
                10199,
                10323
            ],
            [
                10328,
                10338
            ],
            [
                10338,
                10368
            ],
            [
                10411,
                10449
            ],
            [
                10471,
                10528
            ],
            [
                10528,
                10606
            ],
            [
                10653,
                10690
            ],
            [
                10608,
                10651
            ],
            [
                10692,
                10725
            ],
            [
                10740,
                10762
            ],
            [
                10762,
                10791
            ],
            [
                10791,
                10798
            ],
            [
                10803,
                10975
            ],
            [
                10975,
                11008
            ],
            [
                11026,
                11052
            ],
            [
                11082,
                11084
            ],
            [
                11084,
                11113
            ],
            [
                11113,
                11208
            ],
            [
                11226,
                11313
            ],
            [
                11461,
                11491
            ],
            [
                11514,
                11536
            ],
            [
                11551,
                11553
            ],
            [
                11790,
                11848
            ],
            [
                11856,
                11895
            ],
            [
                11895,
                11954
            ],
            [
                11979,
                11986
            ],
            [
                11961,
                11964
            ],
            [
                12264,
                12331
            ],
            [
                12331,
                12399
            ],
            [
                12399,
                12406
            ],
            [
                12416,
                12463
            ],
            [
                12490,
                12493
            ],
            [
                12493,
                12504
            ],
            [
                12521,
                12528
            ],
            [
                12511,
                12517
            ],
            [
                12564,
                12620
            ],
            [
                12703,
                12705
            ],
            [
                12834,
                12891
            ],
            [
                12891,
                12913
            ],
            [
                12926,
                13032
            ],
            [
                13044,
                13156
            ],
            [
                13156,
                13199
            ],
            [
                13199,
                13207
            ],
            [
                13328,
                13401
            ],
            [
                13472,
                13546
            ],
            [
                13547,
                13570
            ],
            [
                13603,
                13607
            ],
            [
                13579,
                13582
            ],
            [
                13620,
                13629
            ],
            [
                13629,
                13631
            ],
            [
                13631,
                13733
            ],
            [
                13742,
                13744
            ],
            [
                13744,
                13834
            ],
            [
                13954,
                13975
            ],
            [
                13834,
                13948
            ],
            [
                13976,
                14083
            ],
            [
                14091,
                14092
            ],
            [
                14084,
                14091
            ],
            [
                14170,
                14239
            ],
            [
                14239,
                14282
            ],
            [
                14293,
                14295
            ],
            [
                14295,
                14321
            ],
            [
                14354,
                14357
            ],
            [
                14328,
                14337
            ],
            [
                14370,
                14372
            ],
            [
                14372,
                14413
            ],
            [
                14415,
                14416
            ],
            [
                14422,
                14456
            ],
            [
                14458,
                14460
            ],
            [
                14462,
                14464
            ],
            [
                14466,
                14500
            ],
            [
                14521,
                14546
            ],
            [
                14548,
                14554
            ],
            [
                14587,
                14606
            ],
            [
                14610,
                14666
            ],
            [
                14676,
                14685
            ],
            [
                14685,
                14687
            ],
            [
                14708,
                14728
            ],
            [
                14789,
                14814
            ],
            [
                14754,
                14763
            ],
            [
                14814,
                14842
            ],
            [
                14842,
                14844
            ],
            [
                14853,
                14938
            ],
            [
                14938,
                14939
            ],
            [
                14941,
                14943
            ],
            [
                14989,
                14998
            ],
            [
                15251,
                15258
            ],
            [
                15195,
                15201
            ],
            [
                15226,
                15228
            ],
            [
                15218,
                15219
            ],
            [
                15230,
                15249
            ],
            [
                15281,
                15325
            ],
            [
                15340,
                15358
            ],
            [
                15358,
                15361
            ],
            [
                15363,
                15393
            ],
            [
                15400,
                15404
            ],
            [
                15522,
                15609
            ],
            [
                15635,
                15649
            ],
            [
                15649,
                15679
            ],
            [
                15724,
                15726
            ],
            [
                15779,
                15781
            ],
            [
                15839,
                15891
            ],
            [
                15893,
                15916
            ],
            [
                15984,
                16040
            ],
            [
                16058,
                16071
            ],
            [
                16071,
                16105
            ],
            [
                16261,
                16272
            ],
            [
                16278,
                16294
            ],
            [
                16305,
                16338
            ],
            [
                16338,
                16367
            ],
            [
                16367,
                16499
            ],
            [
                16532,
                16537
            ],
            [
                16515,
                16525
            ],
            [
                16570,
                16613
            ],
            [
                16615,
                16617
            ],
            [
                16619,
                16645
            ],
            [
                16730,
                16786
            ],
            [
                16796,
                16845
            ],
            [
                17059,
                17106
            ],
            [
                17110,
                17211
            ],
            [
                17211,
                17252
            ],
            [
                17252,
                17361
            ],
            [
                17388,
                17409
            ],
            [
                17523,
                17599
            ],
            [
                17599,
                17603
            ],
            [
                17638,
                17656
            ],
            [
                17660,
                17663
            ],
            [
                17666,
                17678
            ],
            [
                17693,
                17752
            ],
            [
                17752,
                17774
            ],
            [
                17824,
                17846
            ],
            [
                17857,
                17923
            ],
            [
                17950,
                17990
            ],
            [
                18020,
                18043
            ],
            [
                18060,
                18129
            ],
            [
                18129,
                18176
            ],
            [
                18207,
                18264
            ],
            [
                18458,
                18470
            ],
            [
                18444,
                18447
            ],
            [
                18297,
                18309
            ],
            [
                18451,
                18456
            ],
            [
                18478,
                18495
            ],
            [
                18495,
                18574
            ],
            [
                18580,
                18608
            ],
            [
                18636,
                18638
            ],
            [
                18700,
                18752
            ],
            [
                19149,
                19199
            ],
            [
                19248,
                19260
            ],
            [
                19287,
                19322
            ],
            [
                19322,
                19335
            ],
            [
                19339,
                19348
            ],
            [
                19361,
                19372
            ],
            [
                19408,
                19413
            ],
            [
                19414,
                19467
            ],
            [
                19519,
                19521
            ],
            [
                19770,
                19785
            ],
            [
                19823,
                19825
            ],
            [
                19735,
                19743
            ],
            [
                19838,
                19841
            ],
            [
                19841,
                19864
            ],
            [
                19873,
                19898
            ],
            [
                19903,
                19909
            ],
            [
                19956,
                19988
            ],
            [
                19993,
                20047
            ],
            [
                20076,
                20090
            ],
            [
                20112,
                20147
            ],
            [
                20195,
                20221
            ],
            [
                20253,
                20256
            ],
            [
                20256,
                20258
            ],
            [
                20258,
                20275
            ],
            [
                20297,
                20335
            ],
            [
                20371,
                20373
            ],
            [
                20336,
                20345
            ],
            [
                20356,
                20363
            ],
            [
                20413,
                20481
            ],
            [
                20485,
                20523
            ],
            [
                20537,
                20567
            ],
            [
                20567,
                20596
            ],
            [
                20596,
                20634
            ],
            [
                20704,
                20727
            ],
            [
                20727,
                20771
            ],
            [
                20827,
                20832
            ],
            [
                20832,
                20866
            ],
            [
                20866,
                20930
            ],
            [
                20970,
                21073
            ],
            [
                21073,
                21110
            ],
            [
                21110,
                21152
            ],
            [
                21200,
                21228
            ],
            [
                21230,
                21246
            ],
            [
                21248,
                21365
            ],
            [
                21365,
                21505
            ],
            [
                21509,
                21512
            ],
            [
                21525,
                21579
            ],
            [
                21579,
                21582
            ],
            [
                21595,
                21659
            ],
            [
                21663,
                21707
            ],
            [
                21751,
                21824
            ],
            [
                21853,
                21866
            ],
            [
                21866,
                21901
            ],
            [
                21901,
                21902
            ],
            [
                21913,
                21915
            ],
            [
                21924,
                21926
            ],
            [
                21932,
                21939
            ],
            [
                21967,
                21970
            ],
            [
                21970,
                21976
            ],
            [
                21981,
                21983
            ],
            [
                22043,
                22054
            ],
            [
                22197,
                22212
            ],
            [
                22212,
                22253
            ],
            [
                22253,
                22323
            ],
            [
                22363,
                22405
            ],
            [
                22407,
                22443
            ],
            [
                22451,
                22493
            ],
            [
                22500,
                22547
            ],
            [
                22596,
                22630
            ],
            [
                22630,
                22668
            ],
            [
                22668,
                22705
            ],
            [
                22713,
                22729
            ],
            [
                22729,
                22763
            ],
            [
                22774,
                22793
            ],
            [
                22793,
                22794
            ],
            [
                22857,
                22951
            ],
            [
                22951,
                22993
            ],
            [
                23003,
                23096
            ],
            [
                23159,
                23182
            ],
            [
                23182,
                23312
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                313
            ],
            [
                313,
                482
            ],
            [
                482,
                525
            ],
            [
                525,
                851
            ],
            [
                851,
                1072
            ],
            [
                1072,
                1288
            ],
            [
                1288,
                1429
            ],
            [
                1429,
                1579
            ],
            [
                1579,
                1740
            ],
            [
                1740,
                1981
            ],
            [
                1981,
                2088
            ],
            [
                2088,
                2317
            ],
            [
                2317,
                2348
            ],
            [
                2348,
                2356
            ],
            [
                2356,
                2444
            ],
            [
                2444,
                2613
            ],
            [
                2613,
                2891
            ],
            [
                2891,
                2915
            ],
            [
                2915,
                3040
            ],
            [
                3040,
                3132
            ],
            [
                3132,
                3206
            ],
            [
                3206,
                3270
            ],
            [
                3270,
                3389
            ],
            [
                3389,
                3457
            ],
            [
                3457,
                3579
            ],
            [
                3579,
                3679
            ],
            [
                3679,
                3699
            ],
            [
                3699,
                3728
            ],
            [
                3728,
                3852
            ],
            [
                3852,
                4171
            ],
            [
                4171,
                4261
            ],
            [
                4261,
                4291
            ],
            [
                4291,
                4304
            ],
            [
                4304,
                4627
            ],
            [
                4627,
                4693
            ],
            [
                4693,
                4800
            ],
            [
                4800,
                5021
            ],
            [
                5021,
                5117
            ],
            [
                5117,
                5217
            ],
            [
                5217,
                5391
            ],
            [
                5391,
                5525
            ],
            [
                5525,
                5671
            ],
            [
                5671,
                5717
            ],
            [
                5717,
                5769
            ],
            [
                5769,
                6031
            ],
            [
                6031,
                6100
            ],
            [
                6100,
                6142
            ],
            [
                6142,
                6188
            ],
            [
                6188,
                6253
            ],
            [
                6253,
                6369
            ],
            [
                6369,
                6547
            ],
            [
                6547,
                6651
            ],
            [
                6651,
                6738
            ],
            [
                6738,
                6787
            ],
            [
                6787,
                6965
            ],
            [
                6965,
                7297
            ],
            [
                7297,
                7372
            ],
            [
                7372,
                7464
            ],
            [
                7464,
                7567
            ],
            [
                7567,
                7764
            ],
            [
                7764,
                7970
            ],
            [
                7970,
                8140
            ],
            [
                8140,
                8167
            ],
            [
                8167,
                8251
            ],
            [
                8251,
                8292
            ],
            [
                8292,
                8442
            ],
            [
                8442,
                8513
            ],
            [
                8513,
                8666
            ],
            [
                8666,
                8834
            ],
            [
                8834,
                9129
            ],
            [
                9129,
                9272
            ],
            [
                9272,
                9314
            ],
            [
                9314,
                9438
            ],
            [
                9438,
                9584
            ],
            [
                9584,
                9622
            ],
            [
                9622,
                9711
            ],
            [
                9711,
                9830
            ],
            [
                9830,
                9877
            ],
            [
                9877,
                10003
            ],
            [
                10003,
                10108
            ],
            [
                10108,
                10156
            ],
            [
                10156,
                10338
            ],
            [
                10338,
                10528
            ],
            [
                10528,
                10762
            ],
            [
                10762,
                10791
            ],
            [
                10791,
                10975
            ],
            [
                10975,
                11084
            ],
            [
                11084,
                11113
            ],
            [
                11113,
                11315
            ],
            [
                11315,
                11379
            ],
            [
                11379,
                11461
            ],
            [
                11461,
                11553
            ],
            [
                11553,
                11786
            ],
            [
                11786,
                11895
            ],
            [
                11895,
                12331
            ],
            [
                12331,
                12399
            ],
            [
                12399,
                12493
            ],
            [
                12493,
                12705
            ],
            [
                12705,
                12790
            ],
            [
                12790,
                12834
            ],
            [
                12834,
                12891
            ],
            [
                12891,
                13032
            ],
            [
                13032,
                13156
            ],
            [
                13156,
                13199
            ],
            [
                13199,
                13207
            ],
            [
                13207,
                13289
            ],
            [
                13289,
                13631
            ],
            [
                13631,
                13744
            ],
            [
                13744,
                13834
            ],
            [
                13834,
                13976
            ],
            [
                13976,
                14239
            ],
            [
                14239,
                14295
            ],
            [
                14295,
                14372
            ],
            [
                14372,
                14500
            ],
            [
                14500,
                14610
            ],
            [
                14610,
                14685
            ],
            [
                14685,
                14842
            ],
            [
                14842,
                14938
            ],
            [
                14938,
                15001
            ],
            [
                15001,
                15038
            ],
            [
                15038,
                15168
            ],
            [
                15168,
                15358
            ],
            [
                15358,
                15406
            ],
            [
                15406,
                15522
            ],
            [
                15522,
                15649
            ],
            [
                15649,
                15726
            ],
            [
                15726,
                15779
            ],
            [
                15779,
                16071
            ],
            [
                16071,
                16106
            ],
            [
                16106,
                16245
            ],
            [
                16245,
                16261
            ],
            [
                16261,
                16305
            ],
            [
                16305,
                16338
            ],
            [
                16338,
                16367
            ],
            [
                16367,
                16646
            ],
            [
                16646,
                16730
            ],
            [
                16730,
                16787
            ],
            [
                16787,
                16796
            ],
            [
                16796,
                16846
            ],
            [
                16846,
                17059
            ],
            [
                17059,
                17110
            ],
            [
                17110,
                17211
            ],
            [
                17211,
                17252
            ],
            [
                17252,
                17599
            ],
            [
                17599,
                17752
            ],
            [
                17752,
                18129
            ],
            [
                18129,
                18264
            ],
            [
                18264,
                18495
            ],
            [
                18495,
                18638
            ],
            [
                18638,
                18791
            ],
            [
                18791,
                18978
            ],
            [
                18978,
                19069
            ],
            [
                19069,
                19149
            ],
            [
                19149,
                19322
            ],
            [
                19322,
                19521
            ],
            [
                19521,
                19550
            ],
            [
                19550,
                19714
            ],
            [
                19714,
                19841
            ],
            [
                19841,
                20147
            ],
            [
                20147,
                20195
            ],
            [
                20195,
                20258
            ],
            [
                20258,
                20485
            ],
            [
                20485,
                20567
            ],
            [
                20567,
                20596
            ],
            [
                20596,
                20727
            ],
            [
                20727,
                20866
            ],
            [
                20866,
                21073
            ],
            [
                21073,
                21110
            ],
            [
                21110,
                21365
            ],
            [
                21365,
                21509
            ],
            [
                21509,
                21579
            ],
            [
                21579,
                21663
            ],
            [
                21663,
                21751
            ],
            [
                21751,
                21866
            ],
            [
                21866,
                21901
            ],
            [
                21901,
                21970
            ],
            [
                21970,
                21983
            ],
            [
                21983,
                22011
            ],
            [
                22011,
                22027
            ],
            [
                22027,
                22043
            ],
            [
                22043,
                22054
            ],
            [
                22054,
                22197
            ],
            [
                22197,
                22212
            ],
            [
                22212,
                22253
            ],
            [
                22253,
                22549
            ],
            [
                22549,
                22573
            ],
            [
                22573,
                22596
            ],
            [
                22596,
                22630
            ],
            [
                22630,
                22668
            ],
            [
                22668,
                22729
            ],
            [
                22729,
                22793
            ],
            [
                22793,
                22951
            ],
            [
                22951,
                23182
            ],
            [
                23182,
                23312
            ]
        ]
    },
    "abridged": {
        "text": "When we returned to Bleak House, we were received with an overpowering welcome. I was perfectly restored to health, and finding my housekeeping keys laid ready for me in my room, rang myself in with a merry little peal.\n\"Once more, duty, Esther,\" said I; \"and if you are not overjoyed to do it cheerfully and contentedly, you ought to be!\"\nThe first few mornings involved so much bustle and business, settlements of accounts, repeated journeys to the growlery and rearrangements of cupboards, that I had not a moment's leisure. But when everything was in order, I paid a short visit to London - a visit which something in the letter I had destroyed at Chesney Wold induced me to take.\nI made Caddy the pretext for this visit and wrote her a note asking the favour of her company on a little business expedition. Leaving home very early, I got to London by stage-coach in good time.\nCaddy, who had not seen me since her wedding-day, was so glad and so affectionate that I was half inclined to fear I should make her husband jealous. But he was just as good to me.\nThe elder Mr. Turveydrop was in bed, I found, and Caddy was mixing his chocolate, which a melancholy little apprentice-boy - it seemed curious to be apprenticed to the trade of dancing - was waiting to carry upstairs. Her father-in-law was extremely kind and considerate, Caddy told me, and they lived most happily together. (In other words, the old gentleman had all the good things and the good lodging, while she and her husband were poked into two corner rooms over the Mews.)\n\"And how is your mama, Caddy?\" said I.\n\"Why, I hear of her, Esther,\" replied Caddy, \"through Pa, but I see very little of her. We are good friends, I am glad to say, but Ma thinks there is something absurd in my having married a dancing-master, and she is afraid of its extending to her.\"\nIt struck me that if Mrs. Jellyby had discharged her own natural duties before she swept the horizon with a telescope in search of others, she would have taken the best precautions against becoming absurd; but I kept this to myself.\n\"And your papa, Caddy?\"\n\"He comes here every evening, and is so fond of sitting in the corner there that it's a treat to see him.\"\n\"And you, Caddy,\" said I, \"you are always busy, I'll be bound?\"\n\"I am indeed,\" returned Caddy, \"for I am qualifying myself to give lessons. Prince's health is not strong, and I want to assist him. What with schools, and classes, and private pupils, and the apprentices, he really has too much to do, poor fellow!\"\nI asked Caddy if there were many apprentices.\n\"Four,\" said Caddy. \"They are very good children; only when they get together they will play instead of attending to their work. So the little boy you saw just now waltzes by himself in the kitchen, and we distribute the others over the house to practise their steps. To save expense,\" she continued, \"I am learning the piano, and the kit. If Ma had been like anybody else, I might have had some musical knowledge. However, I have a good ear, and I am used to drudgery - I have to thank Ma for that, at all events - and where there's a will there's a way, you know.\"\nWith this, Caddy laughingly sat down at a little jingling square piano and rattled off a quadrille with great spirit. Then she blushingly said, \"Don't laugh at me, please; that's a dear girl!\"\nI would sooner have cried, but I did neither. I praised her with all my heart. For limited though her ambitions were, she had struck out a natural, wholesome, loving course of industry that was quite as good as a mission.\n\"My dear,\" said Caddy, delighted, \"you can't think how you cheer me. I owe you, you don't know how much. You recollect that first night, when I was so unpolite and inky? Who would have thought, then, of my ever teaching people to dance!\"\nBefore we went out, we saw the apprentices at work. They were the queerest little people. Besides the melancholy boy, there were two other boys and one dirty little limp girl in a gauzy dress. Such a precocious little girl, with a dowdy bonnet, who brought her shoes in an old threadbare velvet reticule; such shabby little boys, with string and marbles in their pockets, and the most untidy legs and feet.\nI asked Caddy what had made their parents choose this profession for them. Caddy said she didn't know; perhaps they were designed for teachers, perhaps for the stage. They were all people in humble circumstances, and the melancholy boy's mother kept a ginger-beer shop.\nWe danced for an hour with great gravity, the melancholy child doing wonders with his lower half, in which there appeared to be some enjoyment though it never rose above his waist. Caddy had acquired an agreeable grace and self-possession of her own, while her husband played the music. The affectation of the gauzy child, and her condescension to the boys, was a sight.\nWhen the practice was finished, Caddy's husband got ready to go out of town to a school, and Caddy got ready to go out with me.\n\"Old Mr. Turveydrop is so sorry,\" she said, \"that he has not finished dressing yet and cannot have the pleasure of seeing you before you go. You are such a favourite of his, Esther. It takes him a long time to dress because he has a reputation to support. You can't think how kind he is to Pa. He talks to him of an evening about the Prince Regent, and I never saw Pa so interested.\"\nI asked Caddy if he induced her papa to talk much.\n\"No,\" said Caddy, \"but Pa greatly admires him, and listens, and likes it. Of course I am aware that Pa has hardly any claims to deportment, but they get on together delightfully. I never saw Pa take snuff before, but he takes one pinch out of Mr. Turveydrop's box regularly and keeps putting it to his nose and taking it away again all evening.\"\nThat old Mr. Turveydrop should have come to the rescue of Mr. Jellyby appeared to me to be one of the pleasantest of oddities.\n\"As to Peepy,\" said Caddy with a little hesitation, \"whom I was most afraid of as an inconvenience to Mr. Turveydrop - next to having any family of my own, Esther - the kindness of the old gentleman is beyond everything. He asks to see him, my dear! He lets Peepy take the newspaper up to him in bed; he gives him the crusts of his toast to eat; he sends him on little errands about the house; he tells him to come to me for sixpences. In short,\" said Caddy cheerily, \"I am a very fortunate girl. Where are we going, Esther?\"\n\"To the Old Street Road,\" said I, \"where I have a few words to say to the solicitor's clerk who met me at the coach-office on the very day when I came to London and first saw you, my dear.\"\nTo the Old Street Road we went, to Mrs. Guppy's residence. Mrs. Guppy was an old lady in a large cap, with rather a red nose and an unsteady eye, but smiling all over. Her close little sitting-room was prepared for a visit, and her son was sitting at a table reading law-papers with his forefinger to his forehead.\n\"Miss Summerson,\" said Mr. Guppy, rising, \"this is indeed an oasis. Mother, be so good as to put a chair for the other lady.\"\nMrs. Guppy, smiling incessantly, did as her son requested and then sat down in a corner.\n\"I took the liberty of sending you a note, sir,\" said I.\nMr. Guppy acknowledged this by taking it out of his breast-pocket, putting it to his lips, and returning it to his pocket with a bow. His mother was so diverted that she rolled her head as she smiled and made a silent appeal to Caddy with her elbow.\n\"Could I speak to you alone for a moment?\" said I.\nAt this Mrs. Guppy rolled her head, and shook it, and put her handkerchief to her mouth, and was so unspeakably entertained altogether that it was with some difficulty that she could marshal Caddy into the adjoining room.\n\"Miss Summerson,\" said Mr. Guppy, \"you will excuse the waywardness of a parent ever mindful of a son's 'appiness. My mother, though highly exasperating to the feelings, is actuated by maternal dictates.\"\nI now put up my veil. I could hardly have believed that anybody could in a moment have turned so red or changed so much as Mr. Guppy did.\n\"I asked the favour of seeing you for a few moments here,\" said I, \"in preference to calling at Mr. Kenge's, because I feared I might otherwise cause you some embarrassment, Mr. Guppy.\"\nI caused him embarrassment enough as it was. I never saw such faltering and confusion.\n\"Miss Summerson,\" stammered Mr. Guppy, \"I - I beg your pardon, but in our profession we - we find it necessary to be explicit. There was an occasion, miss, when I - when I made a declaration which-\"\nSomething seemed to rise in his throat that he could not swallow. He coughed, made faces, looked all round the room, coughed some more, and fluttered his papers.\n\"A giddy sensation has come upon me, miss,\" he explained, \"which rather knocks me over. I - er - by George! I - I think, miss - dear me, something bronchial - er - I think you was so good on that occasion as to repel that declaration. You - you wouldn't perhaps object to admitting that?\"\n\"There can be no doubt,\" said I, \"that I declined your proposal without any reservation, Mr. Guppy.\"\n\"Thank you, miss,\" he returned. \"Er - perhaps you wouldn't perhaps be offended if I was to mention - not that it's necessary - but if I was to mention that such declaration on my part was terminated?\"\n\"I quite understand that,\" said I. \"I admit it fully and freely.\"\n\"Thank you,\" returned Mr. Guppy. \"Very honourable, I am sure. I regret that my arrangements in life, combined with circumstances over which I have no control, will put it out of my power ever to renew that offer, but it will ever be a retrospect entwined - er - with friendship's bowers.\"\n\"I may now perhaps mention what I wished to say to you?\"\n\"I shall be honoured, I am sure,\" said Mr. Guppy.\n\"You were so good as to imply, on that occasion-\"\n\"Excuse me, miss,\" said Mr. Guppy, \"but we had better not travel out of the record into implication. I cannot admit that I implied anything.\"\n\"You said on that occasion,\" I recommenced, \"that you might possibly have the means of advancing my interests by making discoveries about me, as an orphan girl, indebted for everything to the benevolence of Mr. Jarndyce. Now, I have come to beg you, Mr. Guppy, to have the kindness to relinquish all idea of so serving me. I have thought of this since I have been ill. I have decided, in case you should at any time recall that purpose, to come to you and assure you that you could make no discovery about me that would do me the least service or give me the least pleasure. I am acquainted with my personal history, and I can tell you that you never can advance my welfare by such means. I beg you to lay this project aside, for my peace.\"\n\"I am bound to confess,\" said Mr. Guppy, \"that you express yourself, miss, with good sense and right feeling. If I mistook any intentions on your part just now, I apologise.\"\n\"If you will allow me to finish what I have to say,\" I went on, \"you will do me a kindness, sir. I come to you privately because you spoke to me about the matter in a confidence which I have really wished to respect. I hope you will agree to my entreaty.\"\nI must do Mr. Guppy the justice of saying that he looked ashamed and very earnest when he replied with a burning face, \"Upon my word and honour, Miss Summerson, I'll act according to your wish! I'll take my oath to it if you like. In what I promise touching the matters now in question,\" he continued rapidly, \"I speak the truth, the whole truth, and nothing but the truth, so-\"\n\"I am quite satisfied,\" said I, rising, \"and I thank you very much. Caddy, my dear, I am ready!\"\nMr. Guppy's mother returned with Caddy, and we took our leave. Mr. Guppy saw us to the door with the air of a sleep-walker; and we left him there, staring.\nBut in a minute he came after us down the street without any hat, and stopped us, saying fervently, \"Miss Summerson, upon my honour and soul, you may depend upon me!\"\n\"I do,\" said I, \"quite confidently.\"\n\"I beg your pardon, miss,\" said Mr. Guppy, \"but this lady being present - your own witness - it might be a satisfaction to your mind (which I should wish to set at rest) if you was to repeat those admissions.\"\n\"Well, Caddy,\" said I, turning to her, \"perhaps you will not be surprised when I tell you, my dear, that there never has been any engagement-\"\n\"No promise of marriage whatsoever,\" suggested Mr. Guppy.\n\"No promise of marriage whatsoever,\" said I, \"between this gentleman-\"\n\"William Guppy, of Penton Place, Pentonville.\"\n\"Between this gentleman, Mr. William Guppy, of Penton Place, Pentonville, and myself.\"\n\"Thank you, miss,\" said Mr. Guppy. \"Er - excuse me - lady's name?\"\nI gave it.\n\"Thank you. Much obliged.\"\nHe ran home and came running back again.\n\"Touching that matter, you know, I really and truly am very sorry that circumstances over which I have no control should prevent a renewal of what was terminated some time back,\" said Mr. Guppy forlornly and despondently, \"but it couldn't be.\"\nI replied it certainly could not. The subject did not admit of a doubt. He thanked me and ran to his mother's - and back again.\n\"It's very honourable of you, miss,\" said Mr. Guppy. \"Upon my soul, you may rely upon me in every respect save and except the tender passion only!\"\nThe struggle in Mr. Guppy's breast and the oscillations it occasioned him between his mother's door and us were sufficiently conspicuous to make us hurry away. I did so with a lightened heart; but when we last looked back, Mr. Guppy was still oscillating in the same troubled state of mind.",
        "paragraph_chars": [
            [
                0,
                220
            ],
            [
                220,
                340
            ],
            [
                340,
                685
            ],
            [
                685,
                882
            ],
            [
                882,
                1063
            ],
            [
                1063,
                1544
            ],
            [
                1544,
                1583
            ],
            [
                1583,
                1833
            ],
            [
                1833,
                2066
            ],
            [
                2066,
                2090
            ],
            [
                2090,
                2197
            ],
            [
                2197,
                2261
            ],
            [
                2261,
                2511
            ],
            [
                2511,
                2557
            ],
            [
                2557,
                3124
            ],
            [
                3124,
                3317
            ],
            [
                3317,
                3539
            ],
            [
                3539,
                3777
            ],
            [
                3777,
                4184
            ],
            [
                4184,
                4454
            ],
            [
                4454,
                4825
            ],
            [
                4825,
                4953
            ],
            [
                4953,
                5337
            ],
            [
                5337,
                5388
            ],
            [
                5388,
                5734
            ],
            [
                5734,
                5861
            ],
            [
                5861,
                6387
            ],
            [
                6387,
                6577
            ],
            [
                6577,
                6892
            ],
            [
                6892,
                7018
            ],
            [
                7018,
                7107
            ],
            [
                7107,
                7164
            ],
            [
                7164,
                7414
            ],
            [
                7414,
                7465
            ],
            [
                7465,
                7687
            ],
            [
                7687,
                7891
            ],
            [
                7891,
                8029
            ],
            [
                8029,
                8215
            ],
            [
                8215,
                8302
            ],
            [
                8302,
                8501
            ],
            [
                8501,
                8663
            ],
            [
                8663,
                8952
            ],
            [
                8952,
                9053
            ],
            [
                9053,
                9254
            ],
            [
                9254,
                9320
            ],
            [
                9320,
                9609
            ],
            [
                9609,
                9666
            ],
            [
                9666,
                9716
            ],
            [
                9716,
                9766
            ],
            [
                9766,
                9908
            ],
            [
                9908,
                10649
            ],
            [
                10649,
                10824
            ],
            [
                10824,
                11080
            ],
            [
                11080,
                11459
            ],
            [
                11459,
                11556
            ],
            [
                11556,
                11712
            ],
            [
                11712,
                11879
            ],
            [
                11879,
                11916
            ],
            [
                11916,
                12126
            ],
            [
                12126,
                12269
            ],
            [
                12269,
                12327
            ],
            [
                12327,
                12398
            ],
            [
                12398,
                12445
            ],
            [
                12445,
                12532
            ],
            [
                12532,
                12599
            ],
            [
                12599,
                12610
            ],
            [
                12610,
                12637
            ],
            [
                12637,
                12678
            ],
            [
                12678,
                12922
            ],
            [
                12922,
                13050
            ],
            [
                13050,
                13198
            ],
            [
                13198,
                13488
            ]
        ],
        "segment_chars": [
            [
                0,
                80
            ],
            [
                80,
                220
            ],
            [
                220,
                340
            ],
            [
                340,
                528
            ],
            [
                528,
                685
            ],
            [
                685,
                812
            ],
            [
                812,
                882
            ],
            [
                882,
                1032
            ],
            [
                1032,
                1063
            ],
            [
                1063,
                1281
            ],
            [
                1281,
                1388
            ],
            [
                1388,
                1544
            ],
            [
                1544,
                1575
            ],
            [
                1575,
                1583
            ],
            [
                1583,
                1671
            ],
            [
                1671,
                1833
            ],
            [
                1833,
                2066
            ],
            [
                2066,
                2090
            ],
            [
                2090,
                2197
            ],
            [
                2197,
                2261
            ],
            [
                2261,
                2337
            ],
            [
                2337,
                2394
            ],
            [
                2394,
                2511
            ],
            [
                2511,
                2557
            ],
            [
                2557,
                2577
            ],
            [
                2577,
                2686
            ],
            [
                2686,
                2825
            ],
            [
                2825,
                2897
            ],
            [
                2897,
                2972
            ],
            [
                2972,
                3124
            ],
            [
                3124,
                3242
            ],
            [
                3242,
                3317
            ],
            [
                3317,
                3363
            ],
            [
                3363,
                3396
            ],
            [
                3396,
                3539
            ],
            [
                3539,
                3608
            ],
            [
                3608,
                3644
            ],
            [
                3644,
                3709
            ],
            [
                3709,
                3777
            ],
            [
                3777,
                3829
            ],
            [
                3829,
                3867
            ],
            [
                3867,
                3970
            ],
            [
                3970,
                4184
            ],
            [
                4184,
                4259
            ],
            [
                4259,
                4351
            ],
            [
                4351,
                4454
            ],
            [
                4454,
                4635
            ],
            [
                4635,
                4741
            ],
            [
                4741,
                4825
            ],
            [
                4825,
                4953
            ],
            [
                4953,
                5094
            ],
            [
                5094,
                5135
            ],
            [
                5135,
                5209
            ],
            [
                5209,
                5247
            ],
            [
                5247,
                5337
            ],
            [
                5337,
                5388
            ],
            [
                5388,
                5462
            ],
            [
                5462,
                5567
            ],
            [
                5567,
                5734
            ],
            [
                5734,
                5861
            ],
            [
                5861,
                6082
            ],
            [
                6082,
                6111
            ],
            [
                6111,
                6297
            ],
            [
                6297,
                6358
            ],
            [
                6358,
                6387
            ],
            [
                6387,
                6577
            ],
            [
                6577,
                6636
            ],
            [
                6636,
                6745
            ],
            [
                6745,
                6892
            ],
            [
                6892,
                6960
            ],
            [
                6960,
                7018
            ],
            [
                7018,
                7107
            ],
            [
                7107,
                7164
            ],
            [
                7164,
                7298
            ],
            [
                7298,
                7414
            ],
            [
                7414,
                7457
            ],
            [
                7457,
                7465
            ],
            [
                7465,
                7687
            ],
            [
                7687,
                7801
            ],
            [
                7801,
                7891
            ],
            [
                7891,
                7913
            ],
            [
                7913,
                8029
            ],
            [
                8029,
                8215
            ],
            [
                8215,
                8260
            ],
            [
                8260,
                8302
            ],
            [
                8302,
                8429
            ],
            [
                8429,
                8501
            ],
            [
                8501,
                8567
            ],
            [
                8567,
                8663
            ],
            [
                8663,
                8751
            ],
            [
                8751,
                8771
            ],
            [
                8771,
                8898
            ],
            [
                8898,
                8952
            ],
            [
                8952,
                9053
            ],
            [
                9053,
                9085
            ],
            [
                9085,
                9254
            ],
            [
                9254,
                9289
            ],
            [
                9289,
                9320
            ],
            [
                9320,
                9353
            ],
            [
                9353,
                9382
            ],
            [
                9382,
                9609
            ],
            [
                9609,
                9666
            ],
            [
                9666,
                9716
            ],
            [
                9716,
                9766
            ],
            [
                9766,
                9867
            ],
            [
                9867,
                9908
            ],
            [
                9908,
                10129
            ],
            [
                10129,
                10231
            ],
            [
                10231,
                10277
            ],
            [
                10277,
                10483
            ],
            [
                10483,
                10597
            ],
            [
                10597,
                10649
            ],
            [
                10649,
                10759
            ],
            [
                10759,
                10824
            ],
            [
                10824,
                10921
            ],
            [
                10921,
                11041
            ],
            [
                11041,
                11080
            ],
            [
                11080,
                11274
            ],
            [
                11274,
                11311
            ],
            [
                11311,
                11459
            ],
            [
                11459,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11619
            ],
            [
                11619,
                11712
            ],
            [
                11712,
                11879
            ],
            [
                11879,
                11916
            ],
            [
                11916,
                12126
            ],
            [
                12126,
                12269
            ],
            [
                12269,
                12327
            ],
            [
                12327,
                12398
            ],
            [
                12398,
                12445
            ],
            [
                12445,
                12532
            ],
            [
                12532,
                12567
            ],
            [
                12567,
                12599
            ],
            [
                12599,
                12610
            ],
            [
                12610,
                12622
            ],
            [
                12622,
                12637
            ],
            [
                12637,
                12678
            ],
            [
                12678,
                12922
            ],
            [
                12922,
                12956
            ],
            [
                12956,
                12994
            ],
            [
                12994,
                13050
            ],
            [
                13050,
                13103
            ],
            [
                13103,
                13198
            ],
            [
                13198,
                13358
            ],
            [
                13358,
                13488
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                17,
                31
            ],
            [
                31,
                35
            ],
            [
                36,
                80
            ],
            [
                80,
                114
            ],
            [
                114,
                193
            ],
            [
                194,
                219
            ],
            [
                220,
                230
            ],
            [
                230,
                293
            ],
            [
                294,
                321
            ],
            [
                322,
                337
            ],
            [
                340,
                362
            ],
            [
                372,
                400
            ],
            [
                401,
                425
            ],
            [
                426,
                446
            ],
            [
                447,
                463
            ],
            [
                464,
                481
            ],
            [
                491,
                528
            ],
            [
                528,
                536
            ],
            [
                537,
                570
            ],
            [
                577,
                582
            ],
            [
                583,
                592
            ],
            [
                595,
                596
            ],
            [
                603,
                664
            ],
            [
                665,
                678
            ],
            [
                683,
                685
            ],
            [
                685,
                697
            ],
            [
                698,
                745
            ],
            [
                746,
                812
            ],
            [
                812,
                835
            ],
            [
                835,
                870
            ],
            [
                871,
                880
            ],
            [
                880,
                882
            ],
            [
                882,
                1032
            ],
            [
                1032,
                1042
            ],
            [
                1043,
                1050
            ],
            [
                1051,
                1055
            ],
            [
                1059,
                1061
            ],
            [
                1061,
                1063
            ],
            [
                1063,
                1122
            ],
            [
                1130,
                1170
            ],
            [
                1171,
                1181
            ],
            [
                1182,
                1185
            ],
            [
                1188,
                1197
            ],
            [
                1198,
                1205
            ],
            [
                1206,
                1247
            ],
            [
                1250,
                1281
            ],
            [
                1281,
                1388
            ],
            [
                1388,
                1389
            ],
            [
                1403,
                1404
            ],
            [
                1405,
                1450
            ],
            [
                1451,
                1494
            ],
            [
                1495,
                1544
            ],
            [
                1544,
                1575
            ],
            [
                1575,
                1583
            ],
            [
                1583,
                1671
            ],
            [
                1671,
                1799
            ],
            [
                1800,
                1833
            ],
            [
                1833,
                1904
            ],
            [
                1905,
                2037
            ],
            [
                2039,
                2042
            ],
            [
                2043,
                2066
            ],
            [
                2066,
                2090
            ],
            [
                2090,
                2118
            ],
            [
                2118,
                2119
            ],
            [
                2120,
                2197
            ],
            [
                2197,
                2261
            ],
            [
                2261,
                2262
            ],
            [
                2262,
                2273
            ],
            [
                2273,
                2293
            ],
            [
                2293,
                2296
            ],
            [
                2297,
                2337
            ],
            [
                2337,
                2381
            ],
            [
                2382,
                2394
            ],
            [
                2394,
                2424
            ],
            [
                2424,
                2511
            ],
            [
                2511,
                2543
            ],
            [
                2544,
                2555
            ],
            [
                2555,
                2557
            ],
            [
                2557,
                2577
            ],
            [
                2578,
                2649
            ],
            [
                2650,
                2686
            ],
            [
                2686,
                2746
            ],
            [
                2747,
                2799
            ],
            [
                2800,
                2802
            ],
            [
                2803,
                2811
            ],
            [
                2812,
                2823
            ],
            [
                2823,
                2825
            ],
            [
                2825,
                2840
            ],
            [
                2856,
                2857
            ],
            [
                2858,
                2859
            ],
            [
                2859,
                2860
            ],
            [
                2873,
                2887
            ],
            [
                2888,
                2895
            ],
            [
                2895,
                2897
            ],
            [
                2897,
                2952
            ],
            [
                2953,
                2970
            ],
            [
                2970,
                2972
            ],
            [
                2979,
                2980
            ],
            [
                2981,
                2989
            ],
            [
                2990,
                3025
            ],
            [
                3028,
                3070
            ],
            [
                3073,
                3121
            ],
            [
                3121,
                3123
            ],
            [
                3133,
                3198
            ],
            [
                3199,
                3242
            ],
            [
                3242,
                3250
            ],
            [
                3251,
                3261
            ],
            [
                3262,
                3317
            ],
            [
                3317,
                3363
            ],
            [
                3363,
                3364
            ],
            [
                3365,
                3396
            ],
            [
                3396,
                3399
            ],
            [
                3400,
                3407
            ],
            [
                3408,
                3414
            ],
            [
                3415,
                3418
            ],
            [
                3433,
                3501
            ],
            [
                3502,
                3539
            ],
            [
                3539,
                3608
            ],
            [
                3608,
                3609
            ],
            [
                3610,
                3644
            ],
            [
                3644,
                3709
            ],
            [
                3709,
                3774
            ],
            [
                3774,
                3777
            ],
            [
                3784,
                3786
            ],
            [
                3795,
                3796
            ],
            [
                3804,
                3819
            ],
            [
                3827,
                3828
            ],
            [
                3834,
                3867
            ],
            [
                3867,
                3893
            ],
            [
                3893,
                3970
            ],
            [
                3970,
                4005
            ],
            [
                4006,
                4020
            ],
            [
                4020,
                4021
            ],
            [
                4022,
                4037
            ],
            [
                4038,
                4080
            ],
            [
                4082,
                4086
            ],
            [
                4094,
                4106
            ],
            [
                4107,
                4118
            ],
            [
                4119,
                4130
            ],
            [
                4131,
                4182
            ],
            [
                4182,
                4184
            ],
            [
                4184,
                4259
            ],
            [
                4259,
                4351
            ],
            [
                4351,
                4454
            ],
            [
                4454,
                4545
            ],
            [
                4550,
                4586
            ],
            [
                4587,
                4635
            ],
            [
                4635,
                4640
            ],
            [
                4641,
                4653
            ],
            [
                4657,
                4666
            ],
            [
                4667,
                4704
            ],
            [
                4705,
                4710
            ],
            [
                4711,
                4722
            ],
            [
                4739,
                4741
            ],
            [
                4741,
                4824
            ],
            [
                4825,
                4846
            ],
            [
                4855,
                4872
            ],
            [
                4877,
                4923
            ],
            [
                4928,
                4952
            ],
            [
                4953,
                4986
            ],
            [
                4991,
                4995
            ],
            [
                4995,
                5094
            ],
            [
                5094,
                5133
            ],
            [
                5135,
                5168
            ],
            [
                5169,
                5179
            ],
            [
                5180,
                5209
            ],
            [
                5209,
                5247
            ],
            [
                5247,
                5258
            ],
            [
                5263,
                5337
            ],
            [
                5337,
                5356
            ],
            [
                5365,
                5373
            ],
            [
                5382,
                5388
            ],
            [
                5388,
                5407
            ],
            [
                5407,
                5410
            ],
            [
                5411,
                5462
            ],
            [
                5462,
                5567
            ],
            [
                5567,
                5599
            ],
            [
                5599,
                5723
            ],
            [
                5724,
                5734
            ],
            [
                5734,
                5764
            ],
            [
                5765,
                5803
            ],
            [
                5804,
                5861
            ],
            [
                5861,
                5939
            ],
            [
                5940,
                5977
            ],
            [
                5980,
                6023
            ],
            [
                6026,
                6059
            ],
            [
                6060,
                6082
            ],
            [
                6082,
                6111
            ],
            [
                6111,
                6118
            ],
            [
                6125,
                6297
            ],
            [
                6297,
                6330
            ],
            [
                6330,
                6356
            ],
            [
                6356,
                6358
            ],
            [
                6358,
                6387
            ],
            [
                6387,
                6482
            ],
            [
                6487,
                6574
            ],
            [
                6577,
                6607
            ],
            [
                6612,
                6634
            ],
            [
                6634,
                6636
            ],
            [
                6647,
                6705
            ],
            [
                6706,
                6745
            ],
            [
                6745,
                6804
            ],
            [
                6805,
                6812
            ],
            [
                6813,
                6816
            ],
            [
                6825,
                6892
            ],
            [
                6892,
                6960
            ],
            [
                6960,
                6967
            ],
            [
                6968,
                7015
            ],
            [
                7015,
                7018
            ],
            [
                7018,
                7029
            ],
            [
                7030,
                7037
            ],
            [
                7038,
                7044
            ],
            [
                7049,
                7105
            ],
            [
                7105,
                7107
            ],
            [
                7107,
                7164
            ],
            [
                7164,
                7186
            ],
            [
                7192,
                7298
            ],
            [
                7302,
                7414
            ],
            [
                7414,
                7457
            ],
            [
                7457,
                7465
            ],
            [
                7484,
                7557
            ],
            [
                7558,
                7632
            ],
            [
                7638,
                7661
            ],
            [
                7662,
                7666
            ],
            [
                7667,
                7670
            ],
            [
                7671,
                7680
            ],
            [
                7685,
                7687
            ],
            [
                7687,
                7789
            ],
            [
                7799,
                7801
            ],
            [
                7801,
                7891
            ],
            [
                7891,
                7912
            ],
            [
                7913,
                8027
            ],
            [
                8029,
                8136
            ],
            [
                8136,
                8137
            ],
            [
                8138,
                8145
            ],
            [
                8146,
                8215
            ],
            [
                8215,
                8258
            ],
            [
                8258,
                8260
            ],
            [
                8260,
                8286
            ],
            [
                8287,
                8290
            ],
            [
                8291,
                8300
            ],
            [
                8300,
                8302
            ],
            [
                8302,
                8343
            ],
            [
                8346,
                8347
            ],
            [
                8352,
                8386
            ],
            [
                8387,
                8389
            ],
            [
                8392,
                8394
            ],
            [
                8395,
                8429
            ],
            [
                8439,
                8464
            ],
            [
                8467,
                8473
            ],
            [
                8479,
                8498
            ],
            [
                8501,
                8557
            ],
            [
                8558,
                8567
            ],
            [
                8567,
                8569
            ],
            [
                8570,
                8590
            ],
            [
                8591,
                8616
            ],
            [
                8616,
                8625
            ],
            [
                8635,
                8663
            ],
            [
                8663,
                8665
            ],
            [
                8666,
                8751
            ],
            [
                8751,
                8752
            ],
            [
                8755,
                8757
            ],
            [
                8760,
                8769
            ],
            [
                8775,
                8782
            ],
            [
                8782,
                8788
            ],
            [
                8796,
                8798
            ],
            [
                8798,
                8799
            ],
            [
                8800,
                8819
            ],
            [
                8835,
                8879
            ],
            [
                8880,
                8898
            ],
            [
                8898,
                8901
            ],
            [
                8904,
                8934
            ],
            [
                8945,
                8949
            ],
            [
                8952,
                9039
            ],
            [
                9039,
                9053
            ],
            [
                9053,
                9083
            ],
            [
                9083,
                9085
            ],
            [
                9086,
                9088
            ],
            [
                9099,
                9151
            ],
            [
                9154,
                9177
            ],
            [
                9184,
                9240
            ],
            [
                9241,
                9254
            ],
            [
                9254,
                9288
            ],
            [
                9289,
                9300
            ],
            [
                9301,
                9317
            ],
            [
                9320,
                9353
            ],
            [
                9353,
                9382
            ],
            [
                9382,
                9514
            ],
            [
                9515,
                9520
            ],
            [
                9521,
                9531
            ],
            [
                9531,
                9574
            ],
            [
                9577,
                9579
            ],
            [
                9582,
                9608
            ],
            [
                9609,
                9665
            ],
            [
                9666,
                9715
            ],
            [
                9716,
                9763
            ],
            [
                9766,
                9867
            ],
            [
                9867,
                9908
            ],
            [
                9908,
                10017
            ],
            [
                10018,
                10039
            ],
            [
                10053,
                10129
            ],
            [
                10129,
                10133
            ],
            [
                10134,
                10152
            ],
            [
                10153,
                10156
            ],
            [
                10156,
                10168
            ],
            [
                10172,
                10231
            ],
            [
                10231,
                10253
            ],
            [
                10254,
                10276
            ],
            [
                10277,
                10343
            ],
            [
                10343,
                10383
            ],
            [
                10384,
                10407
            ],
            [
                10414,
                10483
            ],
            [
                10483,
                10530
            ],
            [
                10540,
                10597
            ],
            [
                10597,
                10609
            ],
            [
                10610,
                10613
            ],
            [
                10614,
                10626
            ],
            [
                10627,
                10632
            ],
            [
                10632,
                10649
            ],
            [
                10649,
                10728
            ],
            [
                10729,
                10757
            ],
            [
                10757,
                10759
            ],
            [
                10759,
                10811
            ],
            [
                10824,
                10874
            ],
            [
                10874,
                10886
            ],
            [
                10886,
                10921
            ],
            [
                10921,
                10934
            ],
            [
                10935,
                10944
            ],
            [
                10945,
                10956
            ],
            [
                10963,
                10968
            ],
            [
                10986,
                11039
            ],
            [
                11039,
                11041
            ],
            [
                11041,
                11056
            ],
            [
                11063,
                11065
            ],
            [
                11069,
                11077
            ],
            [
                11077,
                11080
            ],
            [
                11080,
                11103
            ],
            [
                11104,
                11129
            ],
            [
                11130,
                11136
            ],
            [
                11137,
                11169
            ],
            [
                11170,
                11224
            ],
            [
                11225,
                11239
            ],
            [
                11239,
                11274
            ],
            [
                11274,
                11300
            ],
            [
                11301,
                11304
            ],
            [
                11309,
                11311
            ],
            [
                11311,
                11328
            ],
            [
                11329,
                11367
            ],
            [
                11368,
                11370
            ],
            [
                11371,
                11380
            ],
            [
                11381,
                11388
            ],
            [
                11388,
                11456
            ],
            [
                11459,
                11497
            ],
            [
                11497,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11594
            ],
            [
                11596,
                11619
            ],
            [
                11619,
                11663
            ],
            [
                11666,
                11671
            ],
            [
                11678,
                11712
            ],
            [
                11712,
                11776
            ],
            [
                11776,
                11879
            ],
            [
                11879,
                11916
            ],
            [
                11916,
                11958
            ],
            [
                11959,
                11987
            ],
            [
                11990,
                12006
            ],
            [
                12009,
                12126
            ],
            [
                12126,
                12266
            ],
            [
                12269,
                12272
            ],
            [
                12273,
                12327
            ],
            [
                12327,
                12330
            ],
            [
                12331,
                12395
            ],
            [
                12398,
                12442
            ],
            [
                12445,
                12518
            ],
            [
                12519,
                12532
            ],
            [
                12532,
                12567
            ],
            [
                12567,
                12568
            ],
            [
                12568,
                12570
            ],
            [
                12580,
                12582
            ],
            [
                12589,
                12596
            ],
            [
                12596,
                12599
            ],
            [
                12599,
                12605
            ],
            [
                12608,
                12610
            ],
            [
                12611,
                12622
            ],
            [
                12622,
                12637
            ],
            [
                12637,
                12678
            ],
            [
                12678,
                12748
            ],
            [
                12749,
                12791
            ],
            [
                12792,
                12828
            ],
            [
                12829,
                12871
            ],
            [
                12872,
                12919
            ],
            [
                12922,
                12956
            ],
            [
                12956,
                12994
            ],
            [
                12994,
                13031
            ],
            [
                13034,
                13050
            ],
            [
                13050,
                13084
            ],
            [
                13084,
                13103
            ],
            [
                13103,
                13104
            ],
            [
                13104,
                13198
            ],
            [
                13198,
                13240
            ],
            [
                13241,
                13334
            ],
            [
                13335,
                13358
            ],
            [
                13358,
                13488
            ]
        ],
        "row_chars": [
            [
                0,
                80
            ],
            [
                80,
                220
            ],
            [
                220,
                340
            ],
            [
                340,
                340
            ],
            [
                340,
                528
            ],
            [
                528,
                685
            ],
            [
                685,
                812
            ],
            [
                812,
                882
            ],
            [
                882,
                1032
            ],
            [
                1032,
                1063
            ],
            [
                1063,
                1281
            ],
            [
                1281,
                1388
            ],
            [
                1388,
                1544
            ],
            [
                1544,
                1575
            ],
            [
                1575,
                1583
            ],
            [
                1583,
                1671
            ],
            [
                1671,
                1833
            ],
            [
                1833,
                2066
            ],
            [
                2066,
                2090
            ],
            [
                2090,
                2197
            ],
            [
                2197,
                2197
            ],
            [
                2197,
                2197
            ],
            [
                2197,
                2261
            ],
            [
                2261,
                2337
            ],
            [
                2337,
                2394
            ],
            [
                2394,
                2511
            ],
            [
                2511,
                2557
            ],
            [
                2557,
                2577
            ],
            [
                2577,
                2577
            ],
            [
                2577,
                2686
            ],
            [
                2686,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2825
            ],
            [
                2825,
                2897
            ],
            [
                2897,
                2972
            ],
            [
                2972,
                2972
            ],
            [
                2972,
                3124
            ],
            [
                3124,
                3242
            ],
            [
                3242,
                3317
            ],
            [
                3317,
                3363
            ],
            [
                3363,
                3396
            ],
            [
                3396,
                3539
            ],
            [
                3539,
                3608
            ],
            [
                3608,
                3644
            ],
            [
                3644,
                3644
            ],
            [
                3644,
                3709
            ],
            [
                3709,
                3777
            ],
            [
                3777,
                3777
            ],
            [
                3777,
                3777
            ],
            [
                3777,
                3829
            ],
            [
                3829,
                3867
            ],
            [
                3867,
                3970
            ],
            [
                3970,
                4184
            ],
            [
                4184,
                4259
            ],
            [
                4259,
                4351
            ],
            [
                4351,
                4454
            ],
            [
                4454,
                4635
            ],
            [
                4635,
                4741
            ],
            [
                4741,
                4741
            ],
            [
                4741,
                4741
            ],
            [
                4741,
                4825
            ],
            [
                4825,
                4825
            ],
            [
                4825,
                4953
            ],
            [
                4953,
                4953
            ],
            [
                4953,
                4953
            ],
            [
                4953,
                4953
            ],
            [
                4953,
                4953
            ],
            [
                4953,
                5094
            ],
            [
                5094,
                5135
            ],
            [
                5135,
                5135
            ],
            [
                5135,
                5209
            ],
            [
                5209,
                5247
            ],
            [
                5247,
                5337
            ],
            [
                5337,
                5337
            ],
            [
                5337,
                5388
            ],
            [
                5388,
                5462
            ],
            [
                5462,
                5567
            ],
            [
                5567,
                5567
            ],
            [
                5567,
                5734
            ],
            [
                5734,
                5861
            ],
            [
                5861,
                6082
            ],
            [
                6082,
                6111
            ],
            [
                6111,
                6297
            ],
            [
                6297,
                6358
            ],
            [
                6358,
                6387
            ],
            [
                6387,
                6577
            ],
            [
                6577,
                6577
            ],
            [
                6577,
                6577
            ],
            [
                6577,
                6636
            ],
            [
                6636,
                6636
            ],
            [
                6636,
                6745
            ],
            [
                6745,
                6892
            ],
            [
                6892,
                6960
            ],
            [
                6960,
                7018
            ],
            [
                7018,
                7107
            ],
            [
                7107,
                7107
            ],
            [
                7107,
                7107
            ],
            [
                7107,
                7164
            ],
            [
                7164,
                7298
            ],
            [
                7298,
                7414
            ],
            [
                7414,
                7457
            ],
            [
                7457,
                7465
            ],
            [
                7465,
                7465
            ],
            [
                7465,
                7687
            ],
            [
                7687,
                7801
            ],
            [
                7801,
                7891
            ],
            [
                7891,
                8029
            ],
            [
                8029,
                8215
            ],
            [
                8215,
                8260
            ],
            [
                8260,
                8302
            ],
            [
                8302,
                8429
            ],
            [
                8429,
                8501
            ],
            [
                8501,
                8567
            ],
            [
                8567,
                8663
            ],
            [
                8663,
                8751
            ],
            [
                8751,
                8771
            ],
            [
                8771,
                8771
            ],
            [
                8771,
                8771
            ],
            [
                8771,
                8898
            ],
            [
                8898,
                8952
            ],
            [
                8952,
                8952
            ],
            [
                8952,
                9053
            ],
            [
                9053,
                9085
            ],
            [
                9085,
                9085
            ],
            [
                9085,
                9254
            ],
            [
                9254,
                9289
            ],
            [
                9289,
                9289
            ],
            [
                9289,
                9289
            ],
            [
                9289,
                9320
            ],
            [
                9320,
                9353
            ],
            [
                9353,
                9382
            ],
            [
                9382,
                9609
            ],
            [
                9609,
                9609
            ],
            [
                9609,
                9666
            ],
            [
                9666,
                9666
            ],
            [
                9666,
                9716
            ],
            [
                9716,
                9716
            ],
            [
                9716,
                9766
            ],
            [
                9766,
                9867
            ],
            [
                9867,
                9908
            ],
            [
                9908,
                10129
            ],
            [
                10129,
                10231
            ],
            [
                10231,
                10483
            ],
            [
                10483,
                10597
            ],
            [
                10597,
                10649
            ],
            [
                10649,
                10759
            ],
            [
                10759,
                10824
            ],
            [
                10824,
                10824
            ],
            [
                10824,
                10824
            ],
            [
                10824,
                10824
            ],
            [
                10824,
                10921
            ],
            [
                10921,
                11041
            ],
            [
                11041,
                11041
            ],
            [
                11041,
                11041
            ],
            [
                11041,
                11080
            ],
            [
                11080,
                11274
            ],
            [
                11274,
                11274
            ],
            [
                11274,
                11311
            ],
            [
                11311,
                11459
            ],
            [
                11459,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11619
            ],
            [
                11619,
                11712
            ],
            [
                11712,
                11879
            ],
            [
                11879,
                11916
            ],
            [
                11916,
                12126
            ],
            [
                12126,
                12269
            ],
            [
                12269,
                12327
            ],
            [
                12327,
                12398
            ],
            [
                12398,
                12445
            ],
            [
                12445,
                12532
            ],
            [
                12532,
                12567
            ],
            [
                12567,
                12599
            ],
            [
                12599,
                12610
            ],
            [
                12610,
                12610
            ],
            [
                12610,
                12610
            ],
            [
                12610,
                12610
            ],
            [
                12610,
                12622
            ],
            [
                12622,
                12622
            ],
            [
                12622,
                12637
            ],
            [
                12637,
                12678
            ],
            [
                12678,
                12922
            ],
            [
                12922,
                12922
            ],
            [
                12922,
                12922
            ],
            [
                12922,
                12956
            ],
            [
                12956,
                12994
            ],
            [
                12994,
                13050
            ],
            [
                13050,
                13103
            ],
            [
                13103,
                13198
            ],
            [
                13198,
                13358
            ],
            [
                13358,
                13488
            ]
        ]
    }
}